{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Wonderful little shop ran by an adorable couple. Every sandwich I've tried has been equally delicious!\n\nGive the club a try when you go :)", "author": "Tucker N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Came here for lunch on a Saturday. It wasn't super crowded, however there is only seating for maybe 10 or 15 people inside. You can definitely order the food to go though, as it is only a couple blocks from the park.\n\nThe inside of the place is awesome. Classic little sandwich shop, menu written in chalk, lots of great options for breakfast and lunch. The people who own the place are really nice, and love to talk to you. They are a part of the reason the place is so great in my opinion. The posting online says cash only, and we paid in cash, but it looked like they had a Square reader so I'm not sure if they're taking card now, so prepare accordingly.\n\nI got the  on toasted Dutch rye, and it was very very good. Their sandwiches are nice a crunchy, and packed to the brim. They're juicy which is always a good sign and means most of the veggies are pretty fresh. My wife also had a sandwich (can't remember which) and said it was very good. The sandwiches weren't the best in the world which is why I'm giving four stars. It is definitely worth frequenting though.", "author": "Lance H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "This place is great! Much more affordable than other coffee shops in the area, cozy, good selection and they're friendly!", "author": "Marta F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "This place has the most delectable little sandwiches. I love the vegan sandwich and the BLT. I swear I can't just order one sandwich. I can probably gobble one down in just a few bites. And that's not enough to satiate my hunger.\n\nThe reason these sandwiches are so magical is their crunch. I love how the bread is toasted perfectly and the lettuce tastes so fresh and all the I ingredients come together with the perfect crunch. These sandwiches have the same effect that chips have on me. The sound of the crunching of the lettuce, bread or cucumber makes me want to eat more. It's that delicious!\n\nThe ingredients in each sandwich is perfectly balanced. And there seems to be enough veggies such that you won't be left in a food coma after you finish. In fact the sandwiches are very refreshing!\n\nDon't just get one, get two sandwiches when you come! You won't regret it.", "author": "Sherica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Love it. The best ever. One of the greatest quality/value quotients in all of SF. The owners are lovely folks who are thoughtful and attentive.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "This is my go-to breakfast spot. Chill vibe, not a lot of new dbs taking about their latest app, and it's run but the sweetest couple who has been here for years. Great place for the community that's not yet been priced out.", "author": "Jack N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Such a gem of a neighborhood cafe!\n\nI've gotten the Supreme Breakfast Sandwich and a pastrami sandwich and they were not only huge but super tasty! The ingredients they use are super fresh and everything is made with care and a smile.\n\nI'm glad to make this my new morning/lunch spot.", "author": "Art O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Absolutely love this place, it's never busy but not overpriced like all the other places in the area. I love their breakfast bagels. The two owners are super friendly.", "author": "Daniel V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-30", "description": "Service was great and they were open early on a Sunday.  Ordered a single shot cappuccino with almond milk and egg, avocado, bacon croissant.  The cappuccino was mediocre and the croissant ok.  Decent place but again the service was great and seems like a neighborhood joint.", "author": "Erika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "I love the fact that there can still be a great, reasonably priced neighbourhood cafe like this in the area, when everything else is so expensive.  Whenever I go, there's always the same really friendly guy behind the counter.  I've always gotten the breakfast bagel with bacon and it's really good.  They also have a drink that's coffee with chocolate that's only three dollars.", "author": "Sanae R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Really cute atmosphere. The staff was very friendly, food and coffee were great. Recommend to anyone stopping through town as a tourist and would especially recommend to locals to hit as a regular spot since it's affordable and good quality.", "author": "Seth J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Great place to come and get a good cup of coffee and have a quick chat with the owners. They are super friendly and a very cute couple. One of the few places in the city that has milk out for your coffee. Idk why but putting milk in your coffee, out in the city, is a huge taboo. So odd. But yes this place has milk for your coffee and I love it! \n\nFood is great as well. Had the supreme breakfast bagel a few times with cream geese instead of reg cheese. Amazing and filling. The bagel choices are fantastic! \n\nFresh ingredients for their smoothies. Kale smoothie is tasty and healthy.", "author": "Natalia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Had the supreme breakfast bagel on the garlic bagel and a dark chocolate mocha. Great sandwich and the mocha was on point", "author": "Aran H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-07", "description": "Perhaps we didn't order the right thing, but I was not super impressed with our food nor drink from Java Supreme.  I ordered the Mediterranean Plate which honestly seemed like half of it came from a frozen food aisle and was just reheated.  The falafel was especially disappointing--dry and not very flavorful.  The plate seemed like a fairly expensive dish for somewhat inauthentic and not-so-tasty food.  My husband ordered the Tuna Melt sandwich instead and he seemed to like it.  I think if I returned, I would try one of their bagel sandwiches...I just wasn't in a bagel mood at the time.\n\nI also ordered a latte which was mostly just hot milk and barely any espresso.  It was affordable but it was not something that I would order again for an actual pick-me-up.\n\nThe staff were friendly but I just wasn't too impressed with our first visit.  I will definitely give it another try though for the bagel sandwiches.  Cash only.", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "I work at a school near by and pop in here all the time for a coffee, tea or sandwich. the couple that owns the place are the sweetest, hardest working lovely people. The food is great and inexpensive and it's a lovely place to hang out while your enjoying a coffee!", "author": "Erin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Chill little coffee shop with friendly folks, WiFi and tasty food. When I'm working from home in the mornings, I sometimes treat myself to Java supreme. The owners are super nice and I love the Java 1 and have 2 bagels!", "author": "Lyla F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Beautiful little gem in the city. It's super close to Dolores park and their breakfast bagel sandwich is fabbbbbb!", "author": "Rwanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "It's our last day in the city and wanted something filling, yet clean and nourishing. After reading the reviews we picked Java Supreme and weren't disappointed. Two sammie's and two soda pops for under $20! And the owners are quite friendly.", "author": "Scot M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "I absolutely love this place. I come almost every day for my turkey breast& avocado  on sourdough , and I cannot find a better sandwich or an establishment more worthy of continued patronage! The family that runs this shop are some of the most kind , hard working and personable people in all the mission district. The coffee is amazing , the sandwiches and plates are tasty and fresh and I love that they really care about their customers ( they always remember my order) and at $7 for a HUGE tasty sandwich it can't be beat.\nThanks Java supreme for making my lunch breaks so enjoyable!", "author": "Evan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-11", "description": "Decent coffee, cheap price, they have outlets, but the good things pretty much stop there. The cafe is cash only, and the owner is abrupt and racist. I feel bad for his wife who also works at the cafe, as her husband is quite the prick. \nI was standing behind a young man, probably no more than 18, waiting to get coffee, and the kid looked like he'd been through hell. Or maybe just really needed coffee. Or maybe really high. I don't know, but he wasn't in tip top shape. The male owner asked the kid how his day was going, and the kid kind of stared at the owner and muttered, \"good,\" then proceeded to order about $25 worth of food (a feast at Java Supreme). \n\nThe owner then proceeds to talk INCREDIBLY loudly in Arabic while his wife started the order, gesturing to the young guy, and dropping a few words in English like, \"stupid,\" \"kids today,\" \"respect,\" \"rude.\" Basically, he was openly insulting the young kid while standing right in front of him, and making no show to hide it. It took the kid a couple minutes, but when he did realize that he was being insulted in a different language, he just looked so downtrodden and went to go sit with his girlfriend sitting at a table, who ALSO looked like hell.\n\nThe owner talked shit about this kid for about 10 straight minutes, while his wife was hard at work making the bagels, coffee, and other food. He didn't see me standing at the counter for a solid minute, and when he did, he rudely told me, \"CASH ONLY\" when I was ordering my coffee, gesturing at the ATM in the corner, and turned to continue yelling to his wife. \n\nIn my opinion, I'm taking this to be a racist encounter because the young couple were Latino, and the owner showed only hostile behavior to other Latinos that walked into the cafe later that afternoon.\n\nOverall, not impressed by the owners nor the coffee offered, so I will not go to this local establishment.", "author": "Paige S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "This place is a gem. It's the kind of place that's full of regulars from the neighborhood. I go here often for breakfast. The bagel sandwiches are delicious and very reasonably priced. I also quite like the smoothies. The coffee is cheap, and it does the job. The owners are absolutely adorable, and the atmosphere of the place is just lovely. It's not a place for a rowdy groups, but if you want to sit quietly somewhere with your laptop or a book and sip a coffee this place is just perfect.", "author": "Aniket A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "This place is a godsend. The owners are really sweet and produce high quality breakfast sandwiches.\n\nI miss living in this area, but always stop over there when I am.", "author": "Jessie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "A great place to kick off the day. \nVisited here but this is the first time trying their food. I like to keep my phone charged here with Doblet chargers when I am in Mission.", "author": "Donna Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-05", "description": "At first glance, the place looks like any quaint coffee shop in the ever-beautiful Mission. What seemed like owner-baristas also seemed polite. This was ~9am and we were the only people in the there, after a composed old man just left after reading his morning paper w/ coffee.\n\nBut soon after, 'attitude on display' began to unfold. Clarification: All 'attitude' relates to the man in our instance; woman was polite. \nThey forgot to make my girlfriend's latte (remember: no one else around, so, not busy), and when she returned to the counter 5-10 min later to check, they said \"oh it is coming\", as if they never forgot. It was just their attitude, more than the simple act of forgetting to make a latte even when there are no people around.\n\nI then was taking a phone call, very quietly I  might add, at one of the tables. At this stage, there were 2 other people in the cafe. Me, gf, 2 others. Time: ~9:29am. The man comes over and taps on my shoulder and says \"no calls\". I hung up immediately. I asked my gf if I was being loud but she didn't think so. There was a man right next to us on a laptop so I deliberately whispered on my call because I just felt like I want to be as quiet as possible. There are so many ways to tell me to no be on the phone: \"please take it outside thank you\", \"wifi slows down for others if you are on FT call\" and so many others. Also, I saw no signs for 'no calls'. I saw 2 others in the store. We also didn't just buy coffee for the wifi. Total order amount: ~$10.\n\nTheir (the man's) overall attitude left me feeling like I either play by certain unwritten rules, or I might be reprimanded. I typically go to smaller coffee shops to relate more with the owners, get a sense of 'family', but this 40min stay for breakfast + coffee left me with a bad taste, and no desire to return.\n\nNo bad words were used, no confrontations; just their attitude + actions made a subtle yet strong indication of how they tend to be toward customers. \n\nWith all due respect, I felt the vibe - maybe it is just me. Regardless, I shall not return. Thanks.", "author": "Madhu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "A little café with a great big heart.  Yvonne puts special attention and care in her sandwich creations and meal plates - like she cares you should enjoy your food.  She puts a lot of thought into healthy menu selections as well.  Ed and Yvonne make it a point to be attentive to folks who come in - and have many long-time customers who come back - after leaving the 'hood - to eat - to show how big the kids have gotten or just to say hi.  The prices in this café are simply the best in the area.  It is a rare little gem that has a warm personal touch and is billfold friendly.  These local mom and pop stops are few and rare in the neighborhood now.\nGive them a try.  Vegans and all sorts welcome.  (PS Highly recommend their smoothies - \nespecially the green smoothie - one of many of Yvonne's creations.  She has cut the unnecessary sugar etc. and loaded it with healthy.  She made the first one for herself and customers were curious and liked it and a whole selection evolved.  She is an artist.)", "author": "c c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I just love Java Supreme. It is the perfect place to get a little grading done; it is so much quieter and more reasonably priced than all of the other options in the neighborhood. The owners are just lovely people, and whenever I am there with my daughter they're so generous and kind to her. Plus their smoothies are fantastic! They're reasonably priced and delicious. I recommend the green smoothie!", "author": "Heather M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-13", "description": "I feel bad for the lady who works here (maybe also one of the owners), because she seems very friendly and down to earth. In fact, the reason the place has high reviews is because its a nice little coffee shop in a great part of town. 99% of people probably come in, have a coffee, and leave with a positive experience.\n\nSuch a shame because the owner is a psycho. He thinks that everyone is out to \"get him\"... or maybe he just feels that someone still owes him something in life. Check out some of the 1 star reviews here and you will see that everything is fine until the owner begins to threaten you. In my case it was quite embarrassing for him, as I left the store one or two other customers walked out because they felt uncomfortable. \n\nEveryone needs to read the review about how he locked a customer in the bathroom while \"calling the police\"... Hopefully this place goes out of business soon and opens up the doors for some new friendly owners who deserve such a great spot in the Mission.", "author": "Aljosha N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "I adore Ed and Yvonne (not sure if that's the way you spell her name.) They are the owners of this quaint coffee shop, both such lovely people and so in love. I've been meaning to write them a review for the longest since I work around the corner from them.  It only took me a year, sorry guys it's better late than never.\n\nIf you want that calm and homey coffee vibe. This is your place, they greet you with warmth and every time I've come in there are no lines.  I always order their Java Supreme in Vanilla and tuna sandwich for lunch. I've tried their breakfast bagels, also delicious. You can't go wrong with this place.  \n\nThanks for always making me feel welcomed Ed and Yvonne.", "author": "Dita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-28", "description": "Situation\n- Went to get lunch and do some work on the laptop\n- Thursday around noon\n- Ordered a Roast Turkey sandwich for $5 and a Cherry Coke Zero\n- Then ordered a muffin and a cappuccino for a total of less then $4\n\nPros\n- The sandwich was a very tasty\n- The cappuccino and the muffin were both pretty good\n- The wi-fi worked really well\n- Really friendly couple who work there\n\nCons\n- Perhaps they could have more power outlets", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "This place is highly underrated! \n\nI came in on a Tuesday, it was peaceful, and I was looking for a breakfast sandwich. The lady who makes these, perfects them! They are mouthwatering, cheesy, warm egg and cheese sandwiches. \n\nThis is a place that should have a line out the door but it doesn't! A true neighborhood gem! #bestbreakfastbagel!!!!", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "In an area where the line is around the block on a holiday weekend for brunch, Java Supreme was not crowded, quick, and delicious. The breakfast sandwich supreme was... Supreme. \n\nJust a word of warning, it's cash only or LevelUp, which I don't have.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-08", "description": "I was looking for a soy latte and stumbled upon this place. Prices were cheap -- $2.25 for a latte, extra $0.50 for soy milk. I was waiting for the coffee with a credit card in my hand, and the owner didn't tell me it was a cash only establishment until after he made the coffee and then pointed me in the direction of the ATM at the back of the shop. They really need to put some signs up (as there are zero signs indicating that it's a cash only cafe). At least one right by the counter/register would be much appreciated, not only by me but other patrons as well, otherwise, who would know?! \n\nSo basically, my cheap coffee ended up being a really expensive one. Was not happy about that at all..........  The soy latte was just all right. It was too sweet for my liking. They use the Kirkland brand sweetened soy milk from Costco.", "author": "Ava C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Absolutely love this place. The staff is super friendly, the bagel sandwiches and lattes are amazing. Very nice place to sit and hang out on a Saturday morning. The only downside is that they don't take credit cards, but they have an ATM inside. Java Supreme is the only reason I keep cash on me nowadays.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Truly hidden gem. The breakfast sandwiches are super tasty AND an amazing value.", "author": "Vin I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "A classic friendly, cheap, healthy, flexible store to enjoy some good food while crushing work with their free wi-fi.\n\nLatte is super solid, and the veggie sandwich (hummus instead of cream cheese) is fantastic.\n\nSuper friendly staff and cozy environment.\n\nNothing bad to say about this place!", "author": "Joon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Great value, really good bagels (especially the lox bagel), and super nice owners who are literally there all the time. Incredible dedication, and a true neighborhood gem. True that you can't talk on the phone in there, but that seems like a pretty fair rule to me and is a big factor in what keeps it cozy.", "author": "Katherine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "Coffee. Just a coffee. YES!\n\nLovely little place owned and run by warm people who care. They don't care whether you're mpressed or that you're impressing others. They care that you're fed, happy, haven't over-paid, and they're happy when you return.\n\nThere are dozens of other places where you can pretend a coffee is an amalgam of life choices.\n\nThis is where you buy a coffee. \n\nThere are dozens of other places where you can do a waltz of \"who-is-more-disappointed-in-whom\" with your barrista. \n\nThis is where you buy a coffee. And sit. With people who might not have read \"The Corrections\". Or maybe they have, just not publicly.\n\nThere are dozens of other places where you can pay $6 for the illusion of extra labor by someone who, lets face it, wasn't really doing much else anyway. \n\nThis is where you buy a coffee. Just a nice coffee. From nice people.\n\nIf you absolutely need the production chain to include someone who \"gets\" how important you are, you can always stir in the cream yourself.\n\nThis is a place where you can get \"just a coffee\" from really, really nice people.", "author": "Soren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Cozy, classic neighborhood coffee shop with good coffee, wi fi and friendly owners. Sadly, more and more places like this disappear and are being replaced with sterile, ultra modern, more-of-the-same shops...", "author": "Arkady I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "This review is wayyyy overdue. I love this place. Great espresso drinks -- love the Americano. Also awesome food, THAT'S CHEAP. My personal faves are Java #2 bagel sandwich and the veggie sandwich (substitute cream cheese with hummus!). Also awesome salads! They have wifi too. Amazing. Just a friendly, unpretentious neighborhood cafe. I just wish their hours are longer!!", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "Do not purchase the \"cold-brew\". It tastes like cheap coffee that was heated, burnt, then refrigerated and served over ice. I actually threw it out after two sips because I couldn't even force it down. Waste of $2. Not sure how this place got 4.5 stars, but it surely wasn't for the cold brew.", "author": "Drew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "This place is hella good and it's affordable too! I got a club sandwich for $7.50, back in San Jose where I live you can get a club sandwich for $11.50. Lame! Also, the portion of the food they give matches the price! Go here!", "author": "Josh R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Really nice and cozy little place, loved mocha.", "author": "George Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Had a phenomenal Americano (yes, I know it's a basic drink) and the barista was super friendly and patient. They do not accept credit/debit with card, but do through a service called LevelUp. He let me take my time and join the app, and I was able to pay quickly and easily. I was able to avoid those annoying ATM fees and pay for my coffee no problem. It had a friendly environment and free WIFI. I had to leave back to class, but I really wish I could have stayed and hung out for a while. I will be back for sure, there are plenty of other drinks on the menu that sound great; Morning Smoothies being the most intriguing. If you are in Mission district definitely stop by! Oh and the prices are cheap too!", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "This is one of the last remaining down to earth style coffee shops in this area of the mission. It reminds me of what things were like a decade ago. The owners are a wonderful husband and wife team that have put their heart into their business. I can sense this when I see it because I used to be involved in a similar sort of operation myself. This is just a chill spot on the corner to grab your standard cafe fare but I really like it. To be honest with you, I go to the fancy places too - especially craftsman & wolves. But I do stop in here almost every morning for a 12 oz for $1.50", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "Nice, cozy little cafe run by a friendly couple.  Although they don't take credit cards directly (cash is fine, of course, and there is an ATM in the coffeeshop), they use a service called LevelUp whereby you can pay by linking your credit card to a code that can be scanned from an iPhone app.  It might seem inconvenient to have to sign up for the service when you're at the coffeeshop trying to pay for your order, but if you do sign up for it there and enter their promotion code when you do it, you get a $5 credit that you can use at any LevelUp participating business!  You can use it all here, or use some here and save the rest for a different place.  Lots of businesses in the Mission (and elsewhere in SF) use LevelUp.\n\nThis was all explained to me by the owner, who was super patient as I signed up for it before paying for my sparkling water, bagel sandwich, and muffin.  The bagel sandwich was less than $3 and super delicious!!  The veggies were fresh and the bagel was one of the best I've ever had!\n\nThe place has more of a laid-back, easygoing vibe -- nothing fancy or shiny here.  The bathroom is super small and cramped, though clean, and the sink is outside the bathroom in the corner.  Overall, I had a very enjoyable experience here and look forward to coming back!", "author": "Ran L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Five stars for still being locally owned, for having yummy smoothies and nice workers, and for holding their own against the forces of gentrification. A good place in the neighborhood to have a quick meeting with social-justice-minded folks.", "author": "Laurie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "I love this place. If you don't, you're probably a bad person without manners. Just kidding, kind of.\n\nThe coffee isn't amazing, but the bagels, the owners, and the 'this is my local coffee shop, mine, mine, mine' vibe are.\n\nIf I'm ever gone for more than a week, the owners notice, ask me where my travels took me, and if I had fun.\n\nIf I'm ever missing a few bucks, they tell me to come in next time.\n\nIf ever am in a really picky mood and ask for something ridiculous, they do their best to fix it up.\n\nLove,\n\nJava lover.", "author": "Mariela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "Such a nice warm vibe when you walk in. Very spaciouse place. I came around 10 AM on a weekday, there was one guy on his laptop just hanging out. Me and my boyfriend ordered vanilla lattes and shared a bagel breakfast sandwich. The lattes were Great! Coffee is about 20 percent of my daily liquid intake(the rest is water or the occasional beer), I've had pretty crappy cups of coffee. This latte was tasteful. \n\nThe Cute little lady at the register let us choose what flavor bagel to use for our sandwich, of course i got the whole wheat. We paid then waited about 5 minutes. Received our coffee and sandwich, that was cut in half, and enjoyed. \n\nHung out for about an hour just talking it up. Its a cute, friendly, place.", "author": "Christy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-03", "description": "I've never been treated so poorly at a coffee shop.\n\nI was waiting on a friend to arrive and therefore didn't order a drink and chose to sit down.  The proprietor approached me after a few minutes and asked me if I had been helped. I explained that I was waiting on a friend and would be ordering something as soon as they arrived.\n\nA few minutes later he approached again and claimed that I didn't have anyone else coming and that \"He'd seen me there before, and I did this last time.\" (Fortunately for me I'd never been there before and will most definitely not be there again.) At this point I asked if he would like me to leave and he rudely stated that I should get out of there. Total time in the store 15 minutes.\n\nAs soon as I walk out the door, my date arrives and I have to explain to her that I've just been asked to leave and was pretty frustrated and humiliated. An amazing way to start a second date.\n\nThanks a lot Java Supreme.\n\nThis happened on Sunday, November 3, 2013.", "author": "A.T. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "There is nothing to equal the feeling of home that comes when greeted with \"The usual?\" \n\nJava Supreme is good coffee, great sandwiches, the sweetest couple around behind the counter. Home, is all.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "Don't expect something fancy. This is a small neighborhood coffee shop.\nWas looking for somewhere to get some work done.. It was ok. \nSeemed like a lot of people love their bagels. I will def check it out next time.", "author": "mona k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Best breakfast sandwich in the city. Always fresh ingredients and the owners go the extra mile to create a great atmosphere. Must go.", "author": "Luke E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-05", "description": "There were only a couple of customers, but somehow the guy forgot to make my drink. He was off doing other things in the shop. When I gave him a (friendly!) reminder he acted as if I was the one being rude and said he was making it....and then started making it. The woman was quite friendly, but I just don't get this place. The bathroom is \"out of order\" which I assume to be a permanent situation based on the other reviews. They don't allow phone calls, but it's not posted anywhere. You'll notice from other reviews here that if you are on the phone they will yell at you about it even if there is no one else in the coffee shop. This place is probably okay if you're just running in and out and follow the unspoken rules.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "I used to live right between Java Supreme and Tartine on Guerrero. 19 times out of 20 I would pick Java Supreme over Tartine.\n\nCheap, delicious, unpretentious, friendly. Owned and ran by the most wonderful and warm couple. I miss being able to come here, get an Americano and the \"Italian\" bagel for less than $6, sit for an hour or so and have my entire world be content. \n\nIf you live within earshot of Dolores Park, patronize this business. You'll see this is where the neighborhood really gets their coffee.", "author": "Jessi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "Cheap. Good. Awesome people. Americano. Bagel w avocado sprouts tomato red onion. Bagel with cream cheese. $6.25\n\n$5 credit - level up - they insisted", "author": "Christian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-21", "description": "WORST CAFE EXPERIENCE IN THE AREA. I barely got any attention when I walked in although I was the only customer. I finally ordered a drink, sat down, and took a phone call on my cellphone. 30 secs later I was told talking on the phone was against the \"rules\" and told to either hang up or get out. I asked to see these rules and was told that it is against the rules in all cafes in the Mission (wtf?). If they had had any posted rules or let me know ahead of time, I would have had no problem complying, but by that time I had already ordered my drink. I understand being respectful of others around you but I was the only person there and, with Gloria Estefan blaring in the background, there is nothing quiet about this cafe.\n\nBottom line, to interrupt a customer who is on the phone by yelling at them is rude behavior. With the plentiful cafes in the area, why go somewhere were they treat people like this?", "author": "Iris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-21", "description": "Laptop camper here.  The vibe here is laid back and it has what a laptop camper looks for: free wi-fi, power outlets, plenty of food (sandwiches, bagels, calzones, pastries, a new quinoa dish, middle Eastern items) and drink options (coffee, smoothies, Italian sodas). Prices are lower than average. Sandwiches are just $3.95.\n\nLike many coffeehouses, they play music and have art on the walls. I like the giant paper mache Fred Flintstone and Barney Rubble heads.  They could use some couches or something to make it more comfy.\n\n* Latte: not so good, had a sour taste, the foam was too airy\n* Bagel with scrambled eggs with scallions ($2.25): hot and good, the bagel was small and not chewy enough, but the eggs were nice and warm, it's hard to complain that loudly when the prices are this low.\n\nParking is extremely difficult here during the week. \n\nYou know you love me. X0 X0, laptop camper.\n\nCash only.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "Great selection of fresh, inexpensive sandwiches - got a falafel sandwich for under $6! Also, they had gluten free bread and a ton of organic and vegetarian snacks. Owners were super friendly and welcoming. Definitely recommended if you're looking for a place to get a picnic lunch for Mission Dolores Park!", "author": "Sara E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-02", "description": "This place has the worst customer service!Unless you enjoy being treated like shit, you probably don't want to enter this coffee shop.\n\nLet me start by saying that I've never felt the need to write a bad yelp review before. Yes, there have been times when the food or service at a restaurant may have been poor but nothing compares to what I experienced at this place. \n\nAs soon as I walked in, I sat down and took out a book. The place was almost empty so I figured it'd be nice to study while I enjoyed my coffee. Unfortunately, it never got that far. The owner immediately walked over to me and asked me if I was planning on ordering anything. I said I was but that I was going to take my things out of my bag first and then buy something. I found it strange that he was so pushy but thought maybe that was just his way of asking if he could get me something. Either way, he seemed to understand and just walked away. \n\nA couple minutes later I finally decided to order my cappuccino when he walked back over and told me that it's obvious I'm not planning on ordering anything so I need to leave. \n\nI was in shock, as were the other customers in the place. I asked them if this has happened before and they said yes, which only surprised me even more. I can't understand how a place with such rude owners is still in business. I will definitely never return. \n\nTo those who do read this: Please do not continue supporting a place who's owner thinks he can treat customers like crap! \n\nTo the owner: I understand this is your business, but please understand that if you don't treat your customers with respect, you're only hurting your business. And P.S. A course is patience could work wonders for you.", "author": "Karina V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "Always keeping a smile on my face with the bagel selection and great tasting coffee blends. Try the Lox bagel with capers n cream cheese. Local cafe Mom & Pop shop with thee best prices in the Mission. Set the clock back 10 years. Kablam...There's Java Supreme!", "author": "Sven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "If you want a great coffee shop where you don't have to worry about whether you're hipster enough to fit in, this is for you. Java Supreme is the perfect little coffee shop from the pre-third-wave era. \n\nFree wifi.\nGood coffee, though not obsessively so.\nGood bagel sandwiches and pastries.\nAlways-genial staff behind the counter.\nSmall.\nCozy.\nGood prices.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "This is a great place to go for a quick bite/drink, or if you want a quiet-enough coffee shop to work in for an hour or two.  There's fast and free wifi (password is 1234567890), a nice selection of coffees and teas, and the owners are friendly and charming.\n\nHighly recommend the lox bagel as a lunch option--it's reasonably priced, fresh, and tasty!", "author": "Joëlle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Best cappuccino in the city. Somehow their espresso is just so good.\n\nService is 5 star because the owners are so friendly. \n\nHave the breakfast sandwich; they make it fresh and it's a great value. This is a Mission gem. \n\np.s. this is the type of place to grab and go (vs hanging out or working), which is fine for us since the park is nearby.", "author": "Hanna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-16", "description": "The owner's(?) name is Ed and he's friendly, so I'm thinking you don't need to be a regular to get good customer service here. Sometimes the difference between a two-star and a four-star is \"what do you want?\" versus \"could i help you?\". Wasn't sure of what to get so he suggested the \"Rocket Fuel\"=espresso+coffee. It tasted like a good coffee with an Americano aftertaste. Loved it. There is also the nuclear or something or other, and must return to try that. \n\nLocated on the corner of Guerrero and 19th Streets - not far at all from Dolores Park and Delfina and Tartine and Bi-Rite...all wins.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-15", "description": "If you're looking for the least expensive latte in SF, you've found it. For a $1.75 you get what you pay for, a really rotten latte. I can't speak to the food, but it's not a very clean place. I would just go somewhere else.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-27", "description": "I went to this café today with an open mind. I bought a granola product that looked tasty. They only take cash, and when I tried to pay, the owner asked me to go to the ATM, which is fine. Long story short, I paid cash for the granola bar and, upon opening it, discovered it was covered in mold. When I showed the owner, his first reaction was to yell \"SORRY YOU CAN'T GET YOUR MONEY BACK\" and avoided eye contact. It was pretty rude and bizarre. I will not be going back. Also, the bathroom was unavailable, even to customers. Why?", "author": "Yannell S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Best coffee in the neighbor-hands down. Great prices. Best deal in town for sandwiches. Low key, real people.  Not pretentious like Fayes.", "author": "Cathy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "If you're looking for some great cheap food and a place to do work, this place is perfect. It's not as cool and trendy as other cafes in the area, but the food is cheap and there are plenty of tables where you can do work. I had the falafel sandwich which was delicious. Staff was friendly. Just watch out for their hours, I thought they were open until 6 and they closed at 4:30.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "These guys are awesome. Always very kind and welcoming! They have tasty sandwiches and awesome hot chocolates. Their prices are super reasonable and their shop has a very humble atmosphere.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-17", "description": "I had a similar experience to the other reviewer. I came in and waited literally five minutes for a friend to arrive, only to be confronted by the owner. It was rather unfriendly and could have been handled with more grace.\n\nIncidentally, another customer came in a few minutes after I bought something and asked if they had wireless, and the owner said they were closing early and shot the man a glare on his way out.", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "I am really partial to this place because I go almost every day when I'm in SF.  It's a super nice husband and wife couple who work together behind the counter in amazing harmony.  (Not sure my man and I would last a day doing that.)  They remember your order, they play classical music, they once came out of the store and got me when I dropped $20 inside.  It is the perfect neighborhood joint.  \n\nI'm trying to take it easy on the caffeine, but I LOVE the taste of coffee, and they brew really good drip decaf.  My play is to get a latte that's half regular, half decaf.  Most coffee shops in SF will basically kick you out for asking for decaf.  \n\nIt's also a great value.\n\nJava Supreme for president!", "author": "Bobbie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "As others have said, I have mixed feeling about plugging this place, because it is so special and rare I want to keep it to myself. But that's selfish, and the owners deserve to be swamped. Java Supreme has several things going for it. In no particular order, here are some of them:\n\n1. the food is sooooooo good - best egg/bacon/cheese morning sandwich I've had on the west coast; the cold sandwiches are delish too -- coffee drinks also good -- the prices are reasonable, not inflated\n\n2. wifi -- fast and uncomplicated -- sufficient number of outlets\n\n3. no cell phone use allowed (they enforce it--kindly but they mean it--which does result in entitled loud-talking conference calls people flouncing out in a huff (good! pls don't come back)\n\n4. the owners - if someone were to ask why small family businesses are the best, I'd point to Java Supreme -- a couple owns/runs it, working their asses off cheerfully in tandem -- they listen carefully to your orders and make you something that you feel truly is especially made for you.\n\n5. The vibe is calm, quiet, usually good music (ambient or chamber), dark wood floors, vibrant colorful but not intrusive artwork - many people from the local neighborhood, nobody fronting or posing\n\nWonderful place to do work or have a quiet lunch with a friend.", "author": "Swiss C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-13", "description": "This is a wonderful little wifi cafe with really friendly owners that give it a very relaxed vibe.  Classical music playing softly.  I wish I lived nearby and could study here from time to time.  \n\nRidiculously cheap too - $1.75 for a double americano.  She even asked if I wanted it 'strong' in a smaller cup.", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "I come here for coffee nearly every day. It is cheap, good, and right around the corner from my work.The couple that runs the place are very friendly and their food, what little I have had, is pretty damn good.\n\nStep aside bourgeoisie coffee houses, Java Supreme is here.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-10", "description": "Delicious, thoughtfully constructed sandwiches at very reasonable prices.  The chicken salad sandwich is my go-to and \"everything on it\" means a healthy portion of vegetables -- it will sell out on most days so don't linger.  The couple that runs this cafe is as warm as Dolores Park on a sunny September day.  If you have the means, become a regular.", "author": "Vin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "The falafel sandwich is the cheapest I've found in the Mission. I'd also call it the best. Much larger and more falafel-filled than I was expecting for $3.95, it's a pita stuffed with lettuce, tomatoes, red onions, pickles, and  with a tiny spicy pepper on the side. And it's vegan (hummus instead of tahini, and no dairy in the falafel). \n\nThe soy chai is spicy, frothy, and doesn't come sweetened: perfect. At only $2.35 for 12oz, I bought two over the course of my work-from-home day here. \n\nThe owners are super friendly and helpful, and the background music was relaxing classical-type instrumental. The chairs remind me of an elementary school cafeteria, but the ambiance and outlet availability are better than cushions.", "author": "Chelsea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-15", "description": "Best Cafe!! Best husband wife tag team! Best prices! Best service!\nI am there everyday :)) Thanks you guys, we love you!", "author": "Ateet P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Really, really, really good white chocolate mocha. Mochas are hit or miss - So many place use way too much syrup so the drink ends up tasting like a sugary mess. This place put just enough to add flavor while preserving the taste of coffee.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "Love this place! The husband and wife team are super nice and their prices are very inexpensive. I bought a soy latte (so so taste and flavor), blueberry muffin, English breakfast tea and their California bagel here before and loved them all. I've been here to pretty much work on my telecommuting days and it's wonderful. It's not crowded and their internet is rarely choppy. Definitely a dependable internet connection here. \n\nCan't wait to try their other bagels because the California bagel I had was delicious!!", "author": "Kathleen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "My new cafe fave. Artichoke hearts, olives, cream cheese bagel and double Americano for $4.50? Good, personable owner. Free wi-fi with ample wall plugs? Love this place!", "author": "Heidi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "I don't bother checking in here because I'm always here. I get a lot of work done thanks to Java.\n\nI drink decaf and theirs ain't bad. \n\nThey have gluten-free snacks including some kick-ass chocolate biscotti. \n\nI wish they had more outlets but I don't usually have a problem finding a seat near one. Their wifi is free and pretty fast. \n\nIt's a friendly, cozy place to read or write or eat lunch. This is not the place to conduct phone business. Conversations face-to-face I've never seen shut down but loud phone talkers are told in no uncertain terms that they are being rude. I appreciate that. \n\nAnd the owners are good people.", "author": "Will R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "This little coffeeshop/cafe is a great place to grab a coffee, simple sandwich or pastry.  The man and woman who run the place are amazingly sweet and friendly, and they make the place feel very homey.", "author": "Diana H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-18", "description": "The guy who I assume owns this joint is a freaking MONSTER!! On one of the recent super sunny days when all of San Francisco was in Dolores Park, my male friend and I ran around trying to find a bathroom. Dolores Park Cafe had locked theirs up and the public park restroom line was massive. I'm sorry, I'm a girl, I have to go and I'm not going to urinate in public in the middle of the day. We are both well-mannered, clean and had only had a couple of beers. And in response to another poster - I'm not a loser deadbeat, in the least. In fact, I'm pretty straight edge and have a great career. And I understand where this guy is coming from, but there's a point where you make an exception or just kindly say, listen, the restroom is for customers only, sorry. You don't need to lock people in your shop and call police. Give me a break.\n\nWe really would have bought a water or coffee if we both hadn't accidentally left our wallets behind in the park. And I would have come back some other day in the future to make a purchase if it weren't for what happened.\n\nSo I run in, go straight for the bathroom. A girl's gotta go when a girl's gotta go, ya know? Otherwise, I'm going on your floor. I'm in the restroom and I hear my friend talking to the owner. I thought it was just friendly conversation until I heard it escalating. \n\nI exit the restroom to find the guy on the phone, supposedly to the police, and that he was LOCKING US IN the coffee shop. He literally closed the door and locked it. He accused my friend of being on drugs (neither of us had even smoked) and was yelling. Thankfully my friend told him that what he was doing was false imprisonment and he opened the door.\n\nMorale of the story: if you have to pee here, pee on their floor.", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "The Java #2 bagel here is INCREDIBLE -- avocado, tomato, sprouts, red onion is a formidable combination that will really change the way you look at a morning bagel. Get it on a jalapeno bagel for an extra kick.", "author": "Varun G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "I recently moved into the area and now go to Java as my main coffee stop. The owners are always friendly and know what I want as I go there almost every day.\nThe food is great and the prices are as well. Being a local independently owned place makes me love them even more.\nThanks Java for everything!", "author": "David George J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "I enjoy the environment a lot. Nice place to get some reading done. The house coffee is pretty decent, and well priced. If I lived around the area, I think I'd be here all the time.", "author": "Kathleen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-05", "description": "My first Yelp review. As a creature of habit, I appreciate businesses that quickly get to know their regular customers. After a couple of visits, I accidentally left some shirts on one of the chairs--but the next time I came back they immediately recognized me and said they had been keeping them safe for me. Thank you Java Supreme! Also, their bagel sandwiches are delicious.", "author": "Nitin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Very welcoming. Had an excellent berries smoothie and a very good muffin! Will definitely come back!", "author": "Damien G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Java Supreme makes a mean breakfast bagel at a great price! The coffee and espresso drinks are alright, but I mostly find myself here for breakfast. Also free wifi if you need a place to get some emails or internet surfing done. The couple who run the place are the sweetest and are great to chat with while you wait. You'll never deal with Tartine crowds or have to queue up in line for breakfast or coffee. They have a decent selection of muffins and deli items, though I haven't tried any yet.", "author": "Heather U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-12", "description": "It's funny to me the negative reviews from the owner not wanting non-customers to use his bathroom.  The owner has every right to be angry if you came in there just to use the bathroom and chose to ignore his \"customers only\" sign.  The owner gently reminded a young woman who B-lined from the sidewalk in front  to the bathroom at the rear of the cafe.  I smiled at him.  Loser deadbeats!\n\nThis is one of the few places in SF where the prices are dirt cheap and it's quiet enough to get some studying done.  I had been looking for a cafe in close proximity to my home that's quiet enough for me on the weekend.  The great prices for good food is just icing!", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "This is one of my favorite coffee shops in the Mission, I go here almost every day (seriously). Their sandwiches are delicious (club, tuna, BLT, roasted turkey, I've tried them all!). The owners have been there many years, and they've done ana amazing job at making everyone feel welcome. Good coffee, good smoothies, free WiFi and a hop, skip and a jump from peaceful Dolores park. Best of all, they accept LevelUp so you never have to bring your wallet. Couldn't recommend this place enough. A++", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "best cafe / lunch spot in town. best value. hands down.\n\ni had to move everything else down a notch to make sure the ratings are fair...\n\nthe bagels are delicious!! how bagels ought to be. cripsy, flavorful, chewy inside. they remind me of new york.\n\nthe prices are SUPER low on everything, a legit, large bagel sandwich here is only $2.75. Nothing beats this place on value. it's the most worth it lunch i have ever gotten in the city of san francisco.\n\nto top it all off, they have an assortment of delicious middle eastern snacks. when i feel like a dolma in this cafe, i can get one. that's even more legit.\n\nand the last, most important thing about this place--the owners. this couple, as everyone on this cafe's page states, is so cute! i can't even relay this in text, you just need to go and see them work together. another thing i really appreciate is that the husband definitely makes sure he runs his business properly. if you come and sit in the cafe and use his internet without buying your recommended $5 purchase, he WILL call you out. and that's how it should be. tough love, folks. but remember, it's love.\n\nUse LevelUp here for the first time and get a free $5! I always use LevelUp here.", "author": "Neeharika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "I love this place as a local spot for coffee and sandwiches.  The food is simple, fresh and delicious!  And to top it all off, very inexpensive for the area and the owners are extremely friendly.", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "This place is pretty fantastic. It's not upscale in the way that Coffee Bar or Ritual is, but it hits all the important points for small neighborhood coffee shop.\n\n1) The husband and wife team who work here are cheerful and adorable. That goes a long way.\n2) Incredibly low prices for quality food. You can get a latte and a sandwich for just over $6.\n3) Outlets and WiFi. None of the telltale signs of WiFi-squatter stinginess.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-21", "description": "Good service, cash only but they have an ATM.  Just got out of work and it was easy and quick!", "author": "D R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-17", "description": "Java Supreme is a low-key cafe on Guerrero, a business you might not have noticed before. I didn't really, until I moved a few houses away. It's really a hidden gem in the city because it's rare to find a cafe in this town that has good food, reasonable prices and just down-to-earth, friendly, customer service.\n\nThey've got it all -- great breakfast and lunch meals that are actually affordable. Planning on studying for awhile? Grab a huge falafel, complete with hummus, lettuce, tomatoes stuffed in pita for less than $4. On the go in the morning? I recommend getting a bagel with cream cheese and sundried tomatoes for about $3.\n\nI fell in love with Java Supreme when I ordered a coffee and two bagels  and was pleasantly surprised when the total came out to be only $7. Some places charge that amount for just one bagel! I definitely stand behind businesses that offer great food at prices we can all afford.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-07", "description": "I'm sorry to have to write such a horrible review for a neighborhood spot that clearly satisifies some of its customers.\n\nIn short: While my bf and his friend decided on what to order (the friend is Vegan, and this is usually quite a process), I ran to pee. When I came out, the friend had already ordered his drink. My bf headed to the bathroom, and just as I was about to place my order, the old guy yells at us that since we only bought ONE item, only ONE of us could use the bathroom. \n\nAnd by \"yell,\" I mean verbally beat us like he caught us stealing something. \n\nLook, dude. I work in a small business too, and it IS really annoying and can get costly when transient customers use your resources without paying for anything. Except this doesn't apply here, since we did actually buy something. \n\nI get it. But this guy was such an asshole, I don't care to.", "author": "Sachi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "I love this place. I feel so lucky to live half a block away from here - especially when I want a quick coffee & a bagel. I usually get a large soy latte a few times a week and they only charge me $2.75 and it's ready right as I pull out my wallet to pay. Their smoothies are also extremely delicious (a little pricier than their other items) but I feel SO welcomed when I walk in to Java Supreme. I'm surprised by some of the reviews mentioning the owner being rude - The couple who works there make me feel like I'm coming into my mom's kitchen for breakfast. I support them fully and hope they don't get pushed out of our neighborhood like Cafe Quetal did. I also love that they use LevelUp so I can stop by after a jog without a wallet! Thanks Java Supreme!", "author": "julie p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "I've really come to love this place. They are such a lovely couple, the coffee is good - as good if not better than any other neighborhood place - and cheaper than elsewhere (less rent on Guerrero, I guess). Their breakfast sandwich is wonderful (and also cheaper than other versions) and I love their bagel & hummus (w/fixin's) for less than $3. Nothing to complain about here!", "author": "judah m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "Cheapest pot of tea in the area based on size and price ($3 for large pot).  The food is also less expensive than many cafes in the area.\n\nGood number of outlets, free wifi.\n\nI'm often the sole customer sitting down with a computer.  \n\nFriendly atmosphere and a good spot to work.", "author": "Maddie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "If you want a peaceful space without crowds or attitudes, leave the valencia strip the next block over and seek out this underrated, pretension-free neighborhood coffee shop.  It's mom-and-pop run and they have been here 18 years.  It's almost a hole in the wall, but they have a menu, amenities and prices that beat most others.  \n\nThere's 10 2-seat tables.  6 of them are in the front by the streetcorner-facing windows, a bright work space for using the free wifi.  The others line the wall by the counter which has all the coffee devices plus a tiny deli cooler with egg salad and stuff like that.  You can get a good selection of veggies and hummus or the usual meat on a sandwich, for just 3.95, what a deal.  I got the veggies and cream cheese on rye sandwich with a hearty home made vegan soup, plus coffee, for under $8.  I went on a sunday afternoon (they closed at 6, not 7) and there was just one other laptop worker and a few regulars who drifted in and out.  Very welcoming and 5 stars for sure.", "author": "Pat L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "Oh how I love Java Supreme! I used to intern at 826 Valencia, right around the corner, and this was my go-to spot for coffee and for bagel sandwiches, which are so cheap I initially thought I misread the price. I am particularly partial to both of the Java combination sandwiches, but, then again, I am a sucker for anything that combines a bagel, veggies, and cream cheese. I also love the atmosphere: Java Supreme is not a hipster coffee shop like Ritual or Philz and it's awfully nice to sip coffee in the Mission and not feel like I'm being judged by people who are way cooler than I'll ever be.\n\nEd, the owner, is incredibly kind and courteous, and I think he might be the hardest-working person I've ever met. His wife (I think her name is Yvonne) is also wonderful. I'm not here as often as I'd like to be now that I'm not at 826 all the time, but I try to make a point of stopping by if I'm on my way to the park.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "LOVE this place!\n\nThe owners are always there and are incredibly sweet. Coffee and bagels are delicious and cheap. Why pay $9 for a lox bagel at Dolores Park Cafe when you can get one just as delicious for $5 down the block? Never crowded, free wifi and beautiful photographs on the wall. Its a great alternative when you can't handle the hustle bustle of Tartine and just want a good old bagel for breakfast.", "author": "sholeh m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Great neighborhood coffee place.\n\nGood cheap at cheap prices.  Tuna sandwich for $3.95 is a fantastic deal (as far as cheap food).  The service is great from the husband and wife team and they are very nice/pleasant.  Quiet/nice atmosphere.  Good for studying/reading.  \n\nAnnoying part is that it closes so early at 6pm.", "author": "Ivan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "This is a great coffee shop.  The food is good and not expensive.  Try the tuna melt, the cashew chicken salad, and--yes, really--a toasted bagel with cream cheese, which has just the right amount of gooeyness in the cheese.  Mom and Pop who run the place are super sweet and awesome.  It's not fancy, not trendy, not hip--just lovely.", "author": "Louis T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "After my self boycott of the angry Korean woman at Mission Creek Cafe, this is now my go-to cafe to get my morning work done. \n\nI like this place - it's noticeably smaller and there's definitely more of a neighborhood vibe; more people reading magazines and newspapers and talking to their neighbors than douchebags like me checking my work e-mail - but I try to pay it back by buying a bagel sandwich and a coffee and tipping and stuff. I'll be coming back here a lot.", "author": "Ernie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "Cute sandwich/coffee shop close to Delores Park. The eggplant sandwich is good! It's a big deal when the group votes the eggplant better than the turkey. Not only was it delicious, but I think it was $4.95 (possibly $5.95), and came on bread rather than a roll, so wasn't huge. Great option for something quick. \n\nAs of 4/22/12 their bathroom didn't work :(", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-04", "description": "I'm a bit upset that my fav coffee shop has been discovered by more and more people, but I love the owners and the food is great, so I will openly rave about them now :)   \n\nThe falafel sandwich is great, especially with the spicy sauce; I love any number of the bagel sandwiches and you can't beat the prices!", "author": "Tara T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-02", "description": "Cheap. Free Wifi. Nice light. Outlets. And friendly people.\n\nUnfortunately the coffee pretty terrible. Watery and slightly greasy. \n\nFoam on foamed drinks is thin with too much air.\n\nBut not a bad place to spend a few hours getting some work done.", "author": "Julia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "I dropped in to get a sandwich in a hurry, and I was very impressed with the value and quality. The falafel sandwich is my favorite, vegetarian and filling and under 5 bucks! Every lunch break, you will find me here. Its run by a really nice couple, who if my calculations are correct... carry the one... work there EVERY day. Free WiFi and there is always a free table. It is truly a neighborhood Gem.", "author": "Seo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-23", "description": "Alot of 4-5 star reviews here so i have to balance it out. If you want:\n\n1. Just a basic coffee and/or sandwich to go ... this place is well priced and great.\n2. To work, go somewhere else ... why? Because they now require you to spend $5 to use their wifi (this is new as of a few weeks ago). There are plenty of great coffee shops within a few blocks that will let you use their internet hassle free with any purchase.\n\nAlso they don't have a sink in their washroom so i wouldn't shake anyone's hand in there.\n\nThe woman who works there is the sweetest person you may ever meet though.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "I come here for their egg & cheese bagel. Great chai also (and what a deal). The couple who run this place are lovely, too.", "author": "Rogger P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-17", "description": "java #2 breakfast bagel:  $2.75\nlarge coffee:  $1.50\nwifi: free and stable\nverdict: awesome\n\nthe bagel was teeming with fresh avocado, sprouts, tomatoes, and red onion; the coffee was a nice medium roast and was a pleasure to drink.  for $4.25, i had a healthy breakfast that kept me sated until way past noon.\n\noh, and the little touches totally put this place over the edge.  i stayed here for a whole morning, and noticed that the owners recognized a great majority of the customers as regulars and remembered their orders.  the salt shakers have himalayan pink rock salt.  lots of outlets and plenty of table space for you to camp out and get some work done.  can't wait to come back and become a regular!", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-13", "description": "I love Java Supreme!\nI go there every morning and the nice family that works there already knows what I want and it's cheaper than any other cafe I've been to in San Francisco.\n$3.25 for a large coffee and a bagel with cream cheese. \nThere is an annoying man who comes in all the time to get language lessons from the woman who works there and holds up the line while he pulls out his notebook and writes down the new words he's learning. From what I've observed he isn't making any progress, and the lady who works there is way to nice. If I were her I'd start charging for that service.\nBut, beside the annoying man who comes in for language lessons too often, it's a very nice and relaxed spot.", "author": "David V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-05", "description": "So I decided to give this place another chance--I'm glad I did. \n\nSurprisingly, i had no idea that the male owner, Ed, knew who i was and both he and his wife (both with big, sincere smiles) thanked me for my review. Ed was in quite a jolly mood, presenting the face befitting the pictures i mentioned in my previous review. We had a short conversation and were both able to joke about the incident regarding the tables. \n\nI deeply appreciated the personal interaction and re-neg my last rating. Thank you again for killing me softly with kindness :-)", "author": "Caitanya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-05", "description": "Best falafel in the city! very reasonable prices and super fresh ingredients. Great service every time.", "author": "Arianna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "This is a great little coffee shop - I only wished I was hungry when I came here. The coffee (java supreme) was good, and where can you get an expresso drink for $2.50 anymore? \n\nBreakfast bagels and lunch offerings looked great; I will definitely be back!", "author": "M. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "This has been my coffee shop of choice for about a year and a half, and I must admit that I have intentionally held off from writing a review for the purely selfish reason that I don't want anything about the place to change - least of which the fact that I can almost always get a seat there.  So you may believe that I am now writing this review because I have denounced my self-serving ways but in fact, it is only because I now know that I will be moving away from SF in a few months and want to finally give props where props are due.\n\nThe things that initially won me over to Java Supreme were the utter lack of pretense and good, solid coffee at a price that would never make me stop and think to myself, \"wait a minute, I spent HOW much on coffee this week??\"  Ed, who runs the place, is also an awfully charming guy.  Even if I haven't built up the personal relationship with him that many of the other regulars have, I know that I could, and that's enough.  He knows my order, including what kind of bagel I'd like for my breakfast bagel, without asking.  \n\nJava Supreme's clientele is made up of the kinds of people who appreciate a personable, small-business owner like Ed, and I like that too.  They are a decidedly less-hipster, slightly older, more likely to have a small child, less likely to be posing with their iBook crowd than you will find at most of the other options in the neighborhood.  \n\nMy only complaint is from those days when I do need to get something done during my time at Java Supreme - the wifi is terribly undependable.  That can be frustrating when you figure it out only after having placed your order.  But no matter - the coffee is strong, the food good, and the atmosphere very relaxed.   A+", "author": "Josh C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "This place is amazing. The couple that works here are SO nice, the atmosphere is great, it's the little things about this place that make it the neighborhood favorite.", "author": "Pedro P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "Lovely people run this homey little cafe a block from Dolores Park. Great sandwiches, coffees, smoothies, mediterranean snacks, etc.. Also, probably the best value in the city dollar for dollar. If you're on a budget you'll feel very fairly treated here.", "author": "chris n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "I live a block away from here and always manage to forget about Java Supreme. They have good coffee, but free wifi and good eats. My americano was a little weak but it would not stop me from going back because the people who own it are SOOOOOO darn nice!", "author": "Caitlin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "I visited Java Supreme around 1PM on a Saturday afternoon.  The older couple working, who I assume are the owners, are very sweet and friendly.  There was no line and my drink was made right away.  The mocha was good, but could have had more chocolate flavor.  The espresso was a little bitter.  There were a lot of obvious regular customers as well as people reading.  A very neighborhood-feeling type of coffee shop.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "This is hands down my favorite cafe in the area. They feed and caffinate me on a daily basis.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-01", "description": "So question: Is it rude to talk on your cell phone inside a coffee shop? I'd really like to know because if it is then I will gladly say that doing so was my bad. I was at a table, sipping on my coffee and talking to a good friend when the barista woman / owner walked up to me and told me to \"Take it ouside\" and \"Talking on the phone is rude.\" Ok... proceeded to get off the phone. Maybe if she hadn't practically bitten my head off and asked nicely (i.e. she was being rude) I'd give this place 2 stars instead of one. Butttt probably not. Leaving the cell phone use aside: their latte tastes like watered down milk, and there is absolutely no wifi here so one star for you!", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "Java Supreme is THE BEST. Their coffee is ridiculously  good and you cant beat their delicious breakfast sandwiches. But more importantly, their prices are on point. Who the h&ll wants to spend more than $5 for breakfast. Sorry, but some of us are getting killed by the recession. But these guys keep their prices low and affordable. \n\nSkip Dolores Park Cafe and some of the cafes on Valencia. Instead, stop by here (and give a shout out to Ed and his wife, who are such nice people).", "author": "MC N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "This coffee shop is GREAT!! After moving to the Mission and trying out quite a few coffee shops in the area: Ritual, Borderlands, Blue Fig, Summit, Java Valencia, and Rodgers coffee. I found Java Supreme to be a true neighborhood gathering place. The owners Ed and Yvonne are so sweet and really make an effort to remember your name and usual drink. \n\nI do like some of the other coffee places for a change of pace, but you can't beat the prices and genuine service you get at Java Supreme. I like the bagels because they are not big and doughy. The combinations of bagel sandwiches are unique and delicious.", "author": "Lorraine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-22", "description": "Horrible service.... What looked like the manager/owner was really rude.  Told me there was a five dollar min to use the internet -- couldnt JUST buy a coffee.  Not to mention the coffee was gross.", "author": "Kim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "I love Java Supreme!  I live a block away, so it is very convenient!  And the prices really can't be beat.  The chai that they use (I think it's Divine Chai, but don't quote me on that) is deliciously spicy, which I prefer to the really sweet kinds out there, and where else can you get a soy chai latte (with frothed milk) for $2.30... And my wife loves their cappucino-- Ed, the owner, is amazing at frothing milk, and always gives her extra foam, which makes her happy =)  I've tried the green tea passion fruit smoothie; it was good on one of those scorcher days, but they're a little on the sweet side.  As for eats, I have kept it simple with bagels and cream cheese or hummus, but it's always good.  \nIn terms of atmosphere, it's not the coziest place in the world, but Dolores Park is a block away-- Grab N' Go!", "author": "Nikki C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "__ Friendly, better seating, prices are reasonable.  \n\nYou won't impress people with what yelp calls, \"WooHoo, as good as it gets.\"   but this place does five star in doing what we usually want in a coffee shop.  I am comfortable bringing friends, family, and for  meeting to  get things done, rather than impress.", "author": "Gregory D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-05", "description": "Coffee here is about average for a place named Java-Something.\r\n\r\nWhy then have I given it Four Stars? They top a bagel here with hummus, tomato slices and pickle chips. Freaking awesome. Try it on a combo bagel.\r\n\r\nSmall homey place with 6-10 tables. I remember seeing a bulletin board pinned with customer photos above the milk/sugar station. Check this out for a hilarious pic of a little kid dressed as a cartoon hillbilly. It's a crack-up.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "Get away from the Mission and Valencia street cafes and try Java Supreme.  They make great tuna melts!  The staff is very friendly and sweet.", "author": "Ricky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "Ed is the best.  You go into Java twice and Ed already knows your name and your order.  Great food and drinks at a VERY reasonable price.", "author": "Jon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-21", "description": "I have the luxury of rolling out of bed to grab coffee here, then rolling back up to my place to enjoy. The prices are extremely reasonable, the coffee's made quick and the coffee's pretty good -- meaning I've had better coffee but had to pay for it. It's definitely way better than the coffee I make at home. I'm not really sure why I do that. Never really seen the place crowded, but being a neighbor of theirs, I see this as a good thing. \n\nPastries and other stuff are good as well.", "author": "Janet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "Fantastic service, prices and food. Great place to run into for a coffee or sandwich made with love.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "\"Hi Ed, how's it going?\n\nHey Xavier, how are you? how's the baby?\n\nBaby's growing up, that's what they do right? \n\nThat's good.\n\nAlright, I'll get a small coffee and this delicious-looking blueberry muffin to go.\n\nYou got it\"\n\nThat's the usual talk with Supreme Java's owner and barista, my daily coffee dealer. It's that simple and that's why I really enjoy grabbing a coffee there.", "author": "xavier v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "My favorite cafe.  I used to live next door.  Ed is the best.  Too bad I can't chance running into my ex roommate so I can't go back.  I miss the java #1 bagel with avocado every day.  If that girl ever leaves I'll be back in a heartbeat.  She thinks people who go there are stalking her and I don't want that rep.  \n\nso sad!", "author": "Pamela I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-17", "description": "The best coffee in town! Give the breakfast beagle a try and I promise you a treat. And Eddy is the best!", "author": "Ahmad D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "Cute place, not sure what the big deal is.  Kind of dirty/grimy, friendly people and the food looked good.  Coffee fine, but with so many options, not sure i would go back.", "author": "michael d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-23", "description": "I started stopping at Java Supreme on my way to work... and after my office moved, I continued to go every day for years even though it was no longer \"on my way\" in anything more than a spiritual sense.  you get dependant on your daily dose of Nutella on a whole wheat bagel.  yes you do.\n\nEd is a doll, and his coffee is reasonably priced.  I pay $2.00 for a large coffee in new york - which I consider an abuse of my caffeine addiction.\n\nthe hummus bagel with pickles is a great lunch.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "This place is situated right next to my go-to deli-style sandwich place around the corner. I'm never really up and around these parts early in the morning on a regular basis, but I was out buying breakfast ingredients and coffee was yelling my name.\n\nIn I went, pjs on and glasses slipping down my face, struggling with the flimsy plastic bags they provide at the market. \n\nIt WAS Saturday morning at 9:15 a.m., but I waited a considerable time for an americano, but that's to be expected. Perhaps, though, they should try the whole order-pay-waitforname process over the order, wait at the counter with money-in-hand until he's done fiddling with the espresso machine, and then pay process. I'm just sayin'...allow your clientele to go enjoy the atmosphere and just call their name when a drink is done. Especially when the line is over three people strong, all of who (more-than-likely) are going to order some sort of coffe concoction.\n\nThat aside, I love this place. The art on the walls really caught my eye. The menu is of the colored-paint-on-chalkboard variety (seems to have invaded these places all over the city). The coffee is pretty dern good. There was no soymilk at the extras station, though I'm sure they would have provided had I asked (I just didn't want to bother the lone worker). \n\nI want to come here for a lunch or light dinner sometime. It's MORE than reasonably priced for the city - a sandwich and salad for $5.50 is almost UNHEARD of. The bagels looked pretty unique AND they have POTS of tea over that crappy $2 for a teabag in steamed water. \n\nThere were also certainly regulars. I saw one of the \"customers\" bring the worker a bag of ice, and then slink around the corner only to order a coffee directly on the other side.\n\nRegulars make me like a place more.\n\nNice neighborhood hide-a-way.", "author": "Danyell K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-03", "description": "Good, reliable coffee shop located across the street from my apartment. Internet access for a fee. My only beef is that you're also charged to use wireless there as well, so don't bother bringing a laptop to catch up on your e-mail. I love coming here for the hummus plate on a weekend afternoon. \n\nUpdate - no more charges for wireless access. Thanks Java Supreme!", "author": "Lucky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-26", "description": "Friendly owner, never crowded, nice homey neighborhood feel.\n\nI can get a \"small\" coffee here for $1 on my way to work.  It's tasty stuff and more than enough to satiate my caffeine needs for the morning.  A  bargain, I say.\n\nYou will also stumble across quite a few friendly dogs here, which makes heading to the office that much more bearable.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-12", "description": "i LOVE this place :) This is my only and i mean only go to cafe in San Francisco. I normally never liked going to sit at cafes and such but when I discovered this place, its now my favorite thing to do. The people who run this place are extremely friendly and I love that. I just love friendly people, it makes me so happy :) So it makes me feel really comfortable spending an afternoon here reading a book, writing, using my laptop or doing homework as I'm  sipping on a delicious hot chocolate, and eating a delicious tuna sandwich. The sandwiches here are soooooooo good! and I love the pot of tea menu where I can get a teapot of their selection of teas. Its so nice. Also very affordable which is good for me, being a college student. I can really afford this place especially since I be coming often sometimes. :) Please go here! =]", "author": "Evelyn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "Coyz wood-floored neighborhood cafe. My latest hangout.\n\nWhere can you get a $3.95 hearty sandwich or $2.25 double latte these days? The latte is just like you get at Cafe Roma in Berkeley and all the other college towns. I like Java Supreme's strong drip coffee which took me through a long road trip.\n\nNice and mellow, good music. If you're writing or want to work on your laptop and not just people watch this is the place.", "author": "Susie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-28", "description": "I've been here only twice.  First time was in the first few weeks after landing in SF.  And now I remember why--I'd bought wireless access from ZRNet, which provides wireless service at various cafes around the city.\n\nThe 2nd time was yesterday, after spending a couple hrs reading in the sun in Dolores Park.  I like this spot--it's mellow, unlike, say, Ritual.  When I stopped in, in the late afternoon, I was literally the only person in the shop.  Ok, maybe a little too mellow.  But if you're looking for a quiet spot to do some reading or writing, and don't need wireless, here is where to go.  \n\nThe cappucino I got was mediocre, but it was something to drink.  If you're there in the late afternoon on a sunny day, the tables in the front get plenty of sun.  \n\nI plan to head back to try the food.  Dan Leone did a Cheap Eats column about them back in '97!", "author": "Suman G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-24", "description": "\"The usual.. sure.\"\nThats how i like to start my mornings, and that's how it is here. Gotta support the locals and this guys (Ed) friendly demeanor makes it easy.", "author": "t h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "This is my neighborhood coffee place.   I love that San Francisco is the kind of city where you can have a neighborhood coffee place.   \n\nMany neighborhood coffee places are getting a little too slick though.   I like mine chill, the tables a little beat up, chairs a little wobbly and the food and coffee good but not ecstatically so such that there would be the chance of an extreme line --- hello, Tartine.   \n\nAlso Ed is aware of his regulars and knows their orders.   That rocks.   My husband is a person who always orders the same thing and he knows this.   He also knows that I mix it up every time on the bagel order.  that is just who I am.    I am a big fan of the have a heart bagel -- they are just artichokes from a bottle, but I love them along with cream cheese and olives.   yum.    i also love the hummus, pickles and tomatoes combo, and I can also be persauded by an avocado open face -- thin slices of avocado either side.   yum.   \n\nI also lilke coffee but sometimes get rocket fuel -- espresso and coffee with a shot.   it's good, it's enough to get a good start on on a foggy morning.\n\nthere are seats here to linger and there are always friendly dogs to contemplate as their owners grab a cup to go before heading to the park.\n\ngood times.", "author": "Liz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-30", "description": "Ah, I feel grateful to a place off the beaten path (read, NOT on mission or valencia), that you can hang/write/do homework/converse without worrying about power supplies, earsplitting conversations, crying babies, or claustrophobic surroundings.\n     They do require a password for the wifi, FYI...And the best part $3.95 for  a sandwich! YAY!", "author": "wayne s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "This place is great -- delicious veggie sandwich including some of the best avocado I have tasted in a while.  Owners and everyone who works here is super friendly also.", "author": "Nathan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-17", "description": "I adore this place.\n\nI have developed an addiction for their yummy fresh sandwiches (which are only $3.95).  There are lots of little cafes that are nearer to me, but I prefer to walk a little out of my way to visit this place.  I think it must be owner-operated because I always see the same man and woman behind the counter.  And they are truly lovely.\n\nFree WiFi, lots of outlets, yummy sammiches, and totally unpretentious.  A favorite.", "author": "Myrna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "Great place.  Owners are nice as can be.  They even steep your tea for you.  And it's only $1.50\n\nPlenty of power outlets.  Free Wifi.\n\nKinda small - but plenty of seating.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "This is my all-time favorite.  They make the world's most delicious bagel sandwich, the Java #2, which I always get with a latte, and the two items amount to only 5 dollars.  What a fantastic breakfast.  Awesome!", "author": "Nico B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-06", "description": "I'm always up for trying a new mocha.  Since I was craving one & can walk to Java Supreme, I decided to give theirs a shot.  Not too shabby!  Perhaps a bit on the bitter side, & they use some kind of chocolate powder instead of a syrup, but still a significant improvement over the chains.  At some point, I'll have to try the food there -- they serve all kinds of bagels, sandwiches, & pastries, & the people who run the place seem really nice.", "author": "Angela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-14", "description": "2 for lunch and 2 drinks. $11 even. the food was good and the window faces west for some late afternoon sun or to illuminate your book/nook.", "author": "aaron f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-10", "description": "Greatest sandwich deal in the mission, no questions asked.  $3.95 for a delicious sandwich?  Go for the turkey, you will not be disappointed.", "author": "Trevor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-09", "description": "My neighbourhood cafe - my early-morning-coffee-to-go-place, my friday's office, my afternoon have a quick coffee, my bagel-delivery on the weekends... everything in one place!\n\nThis place is not only close and has really crazy good prices - I even think that the coffee is the best in town! I don't know why I like it so much, I just do! Maybe it's the beans, maybe it's my being used to it, but maybe it's also Ed who is always so sweet and interested!\n\nI love this place!", "author": "Sandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "I see other reviewers complain about not being able to pee here for free, not being able to wait there for their date for free. and giving 2 stars for rudeness. Sorry you got put out, but think about this. There are 8 million other coffee spots in the Mission. Java Supreme happens to sell $2 coffees and $5 sandwiches, and that's cheaper than places like Starbucks that let you crash for free. You can meet your date for free at the park on 19th between Valencia and Guerrero. Anybody can pee for free at The Women's Building right around the corner (huge mural bldg/18th between Valencia and Guerrero). If this place--or anyplace--won't let you pee or hang out for free, you could maybe smile, say, \"Oh, I'd be happy to pay!\" and hand the guy $1 or $2. Just a suggestion.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-07", "description": "Decent bagels and friendly owner and never a long wait.  Java Supreme is a solid coffee shop.  Their Heart Bagel is really yummy :)", "author": "MJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-24", "description": "Five stars for a sweet, off-the-beaten-path cafe that welcomed us on Christmas Eve. Great prices and a sweet dog in the house!", "author": "Allison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-08", "description": "This little coffeeshop is across the street from my old apartment in the Mission, so it has a special place in my heart. The owner isn't exactly chatty, but he's a good guy and makes it a point to know his regulars' usual drink. It's pretty spare -- just simple wooden tables and chairs -- but there's almost always a seat or two open. Plus, yummy sandwiches, salads and a smattering of Middle Eastern fare. There's not a whole lot of ambience to speak of -- but for me, this is one of its high points because it means I can always get a seat. Bonus: I heard they just added free wifi.", "author": "Jen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "When I lived in the Mission this place filled a crucial niche in my selection of cafes--it was my \"discount\" coffee shop of choice. The prices are really low-~$2.25 for a latte or cappuccino, $5 for a decent sandwich. It's a mom-and-pop shop, and the proprietors are generally friendly, if perhaps a tiny bit aloof at times.\n\nOne downside is that the bathroom is really cramped. There's just one toilet in a tiny little room, and when you come out you have to go behind the counter to wash your hands.\n\nThere's free wifi, although you have to ask for the password (also not a  big deal). There are some outlets too.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-08", "description": "one of the most quaint cafes out in san francisco. after the debacle from rituals, i decided to cafe hop over here, since i've seen java supreme once or twice walking down guerrero. i would say that i appreciated my first experience with the cafe; eventhough, i only had their nutella bagel, so i can charge my laptop and use it. \n\ncan't wait for my next return! :D oh yea, owners are nice too! i think they're from the middle east, with their accents.", "author": "Marc K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "I wish I could give it 17 stars -- these are the nicest cafe owners on earth.  And they have a good variety of food.  And it's yummy.  Great atmosphere, I go there all the time to eat, work, and enjoy the friendly vibe.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-16", "description": "Met some friends here for bagels and coffee while visiting San Fran from Seattle. Really friendly hole in the wall place, just my style. Tasty bagel sandwiches and a great atmosphere.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "I come here all the time. Owners are super nice, they are not trendy, just good. Beverages and food are all spot on and CHEAP! they even let you bring your dog inside sometimes!", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "Java Supreme is the BEST place to get a bagel in the mission, and also one of the cheapest. I alternate between the Java # 2 and the California. The bagels are always fresh and soft and the portions of avocado and vegies are generous. Only $2.25? You've got to be kidding. Nowhere else can compare. Ed is always friendly and the atmosphere is relaxed and unpretentious. The wireless works. The brewed coffee is quite good. Java Supreme, I love you.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-11", "description": "Java Supreme is a necessary relief from the surrounding metastasis of caffeine-related trends in the area. It's a totally genuine establishment with really friendly people with strong familial undertones. There are family pictures posted above the milk and sugar area--not even awkward ones. Every time I walk in, I am greeted with warm recognition. I would never want my caffeine addiction to be welcomed by anybody else. To sum it up, they're just down. And I'm down with their coffee and reasonable price range. Plus their bagels are good and it's on a peaceful little part of the block. For chillers only.", "author": "Sam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "Ok, it's not really \"as good as it gets\", but it's way better than you expected or even hoped for at these prices. Falafel is very good. Latte is better, bigger AND cheaper than Tartine, not to mention eons faster. On the (extremely rare) occasions I can stand to wait in the line at Tartine, I still come here for my latte. If their prices were \"normal\", I'd probably give it 4 stars, but since their prices are beyond-belief low, I'm going up to 5.", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "this husband and wife team are the sweetest business owners i've ever met. it's a great spot for a quick (and affordable) cup of coffee and bagel breakfast sandwich. it's little neighborhood spots like this that make me love living in the mission!", "author": "Kristen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-05", "description": "Java Supreme is like one of those old time gems that you think you can't find anymore. They have the best prices on coffee drinks and food and it's ALL DELICIOUS. The owners could not be friendlier and they treat you like family. It is a small, family run business and they care about their customers. I live a few blocks away and have some options as to where I go. Java Supreme's coffee is always HOT, it's strong and they don't ever have to ask what I want because they are like my little family down the street, they know. In addition, the food they serve caters to diverse dietary needs and their soy milk is delicious! The atomosphere is mellow and the art work is pleasing. I highly reccomend this coffee shop if you are visiting Dolores Park and definitely making it a habit if you live in the neighborhood!", "author": "Molly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "$5 for a bomb sandwich and a coffee. pretty much, awesome.", "author": "Joyce S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-23", "description": "nasty and rude.  Stopped in for a coffee then proceeded to plug in my computer and was shocked when the guy told  me to get out!  You have to spend $5 to use the internet!  That's crazy since I live next door and have stopped in many times even though it's dirty and not very good coffee but have used it for last resort. Now I will walk an extra few blocks to get good coffee and nice service.  Also, no sink in bathroom gross.", "author": "Briana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-31", "description": "I love this spot. Ed, the owner, makes a kick ass hot chocolate, although i have him go light on the scoops. The food is great, simple, and very reasonably priced. This place is what it is and does not pretend to be anything more. In terms of a great corner coffee shop, it gets and A+", "author": "Roxane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "a neighborhood spot with the best sandwiches for the best price. coffee and bagels are good too. the nicest couple alive runs the place.\n\nATM has cheaper fee than most others in the neighborhood too. a bummer about the recent change to charge for wifi, but it doesn't impact me.\n\nto the people complaining about their bathroom not having a sink - what exactly did you do after you finished your business? when i first went to their bathroom, and didn't see the sink, i walked out and said \"uhh, do you guys have a sink?!\" OF COURSE THEY HAVE A SINK. it's to the left against the wall after you get out of the bathroom.", "author": "Jamie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-11", "description": "This place used to rock but it's definitely gone downhill.  Last time I dropped in saw quite a few roaches.  Hopefully they took care of that.  Like others are saying the owners are great and definitely know their regulars, that's been the way since they first opened and throughout the different owner/managers.", "author": "Lito S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-02", "description": "I never really had a proper sandwich until I tried one at java supreme, so it's safe to say that the have some of the best in the mission.  In addition, they have an awesome selection of bagel toppings and a small coffee that's still a buck.  \n\nI started coming here in grad school when I was watching my budget, but I come back for the neighborhood feel and the sandwiches--which are more delightful to me than anything i've had at tartine. it's sad that a good sandwich is a mostly dead art.", "author": "bri b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "Visited yesterday for lunch, was hanging out at Delores park with friends and I was starving. My friend tells me there's a couple spots nearby for food, and that there was a pizza spot and a sandwich spot. This spot was the first one I saw, so me and my friends check it out. Very friendly people who run the shop, and even gave my friend a discount and a free pastry for grabbing a bag of ice for bossman. The sandwich i ordered was the tuna melt, and MAN.. that was really on point. My friend ordered the ham, egg & cheese bagel and he said it was really good as well. Everything was very reasonably priced and I only spent 6 bucks. Very small inside. Ordering to go at this place seems like a good idea. Doesn't accept credit or debit, but there's a ATM inside. Mom n pops shops always have the goods, which is why i never turn away from these places. Never tried the coffee or other items, but if I'm in the area, I'd visit again.", "author": "Ronald S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "Great, undiscovered place for simple sandwiches (I always get the chicken cashew salad, very filling and very yummy) and free wifi. The people at the counter are always friendly and there's usually some sort of family member or friend of their's that's dropped by and is chatting with them. It gives the whole thing a homey sort of feel.", "author": "Sameer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "I love love love this place, so much.  I never leave any Yelp reviews, but this places deserves it.  Java Supreme is the little coffee shop that makes you love your morning coffee for just the \"morning start\" of it;  Ed and his joy to see you starts any day out perfectly.  I go in even if I dont want coffee!  Ill get it just to see them and give them some business.  He and his wife are lovely and make this neighborhood that much more special.  Go to Java Supreme!  And have a beautiful day.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-26", "description": "I have been going to Java Supreme for years, and can't recommend it enough--Ed (the owner) and his family are wonderful.  Java Supreme has the best bagels in the Mission, and is never too crowded.  \n\nIt's is unpretentious, friendly, and I can always find an outlet for my laptop, unlike most of the other coffee shops in the neighborhood.  \n\nLove it!", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "Great Coffee and food...... Lovely family %%", "author": "Hashem K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-15", "description": "Above average coffee shop, bonus star for the reasonable prices, being close to Dolores Park, unique coffee selections and very nice owner.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-21", "description": "I'm right around the corner from them, so I stop by often... Ed is a sweetie and always remembers my name and my order. It's not a fancy place, but down-to-earth and not too crowded. I recommend it heartily.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-29", "description": "good guy, good coffee\nnice when i dont want to walk to ritual... or i'm on way to the park.\n\ni get the cadillac\nchocolate, coffee, no milk\ntry it if you arent in the mood for dairy induced bloating.", "author": "FAMOS A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-19", "description": "Mellow cafe with free wi-fi and great prices! \nThe owners are really sweet.\nPlenty of pastries, even options for vegans!\n\nI just started coming here. Great place to sit around, sip some coffee, grab a pastry or salad or sandwich.\nPerfect place to stop in if you're on your way to or by the park!", "author": "Tosh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "I seriously just signed up for this site just so I can rave about how awesome this place is.  It's a cute little family owned place, but I've always found a table and it's cheaper than the hipster places around.  \n\nGreat coffee, good cookies, and a nice selection of real food.  I'd give it 5 stars, but I'm a pastry snob so I'll knock them down one star because their baked good are standard cafe fare.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-28", "description": "The best coffee shop in my neighborhood.  Ed makes it a great place.  I've never seen someone make a bagel sandwich so fast at the same time.", "author": "Charlie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "I don't know if its a matter of convenience (this place is just a block away from home) but its the best coffee shop in town! No weekend is complete without a trip to Java for a bagel sandwich. Better than any chain like Noahs hand down. The lox bagel sandwich is delicious and hits the hangover. My husband always goes for the breakfast bagel, cause bacon makes everything better!", "author": "Kris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-30", "description": "Great place to come for coffee and bagels in the morning while working or catching up on the news.  Or reading.  Owners are friendly.  Coffee is hot and tasty.  Bagels are great.  We come on most mornings when not already at work.", "author": "Nicolas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-06", "description": "With Bi-Rite charging some obscene price for a sandwich and a line out the door at Tartine, people would be wise to turn to Java Supreme. With simple but good food and a very pleasant owner, this is my regular spot for breakfast or lunch.", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-16", "description": "I come here once in a while because the place is a block away from my apartment.  It's a quiet place to study but I definitely do not recommend anything to consume. I go there for coffee but who knows how long it's been sitting there.  I am not really sure how they clean their utensils and cooking tools. Wait a minute. There is no cooking.  There are eggs on the menu but they are cooked in the microwave.  Microwaved eggs??!! The place is not too clean and are at times dingy.   The lighting is dim which creates a depressed atmosphere.", "author": "Vivian T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-13", "description": "this place is alright but if you're gonna be having a conversation here, it will be heard by everyone in the shop.  If you have a medical issue or something stuck in an orifice, do not choose this place to break the news to your friend.", "author": "pauline e."}
