{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Not sure why the overall rating is so low -- I just ordered delivery from Jika (via doordash) for the first time and was very pleasantly surprised! Super affordable sushi with great portions. \n\nMy roommate and I had the avocado roll, Alaska roll, miso soups and ika nigiri and everything was genuinely wonderful. I especially enjoyed the ika -- glad we decided to give this place a shot!", "author": "Katherine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Very cheap and decent sushi. They are often pretty fast with their deliveries even though sometimes they can mess up the order.\n\nThe main reason to order here is probably not the sushi, since it's definitely not the best or freshest you can get. The gyoza, karage, miso soup and many other appetizers are really good though.", "author": "Antonio H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Weird, but not terrible. Wandered in because we were nearby looking for late night eats.\n\nNot authentic by any stretch. Walk in, they're talking to each other in Mandarin, a Chinese period drama is playing on the tv, and nobody acknowledges us for minutes as we stand there awkwardly. Ah, my people. We're not so good with the customer service, in general.\n\nToward the end of our meal a loud, pushy white woman (his wife?) walked in off the street and started yelling at the Chinese guy about where's her food and she's freaking starving right there in front of the customers, so I guess it's not just a cultural thing, lol. At first I thought she was just a crazy person but then when she started grabbing plates off our table I figured she must be affiliated. When the guy (Jackson?) started whining about how he never gets to relax or something, I figured there must be more than a work relationship there.\n\nThe Yelper complaining about \"discolored ginger\" must never have gone to an Americanized sushi place before. The pink pickled ginger is normal to me, though I am happy to see yellow pickled ginger.\n\nThe \"tofu age\" is not agedashi tofu. It's a Chinese-style fried tofu (the kind where the breading is a little sweet, not a fan) topped with a thickened dashi reduction or something. Tasted okay, a little sweet. You only get 2, but it's only 3 bucks. 3 stars.\n\nChicken karaage: looked like salt and pepper calamari (without pepper) but actually tasted like chicken tempura. I kinda liked it even though it wasn't how I was expecting. Came with a very mild spicy mayo, but I wish it came with tempura dipping sauce. I don't like how he forced me to take the last piece so he could clear the plate -- I wanted to eat the tempura crumbs! 4.5 stars.\n\nThe shrimp tempura temaki (hand roll) was a hot mess. The nori was disappointingly soggy and not crisp. There was the tiniest cold tempura'd shrimp and a whole mess of fake \"krab\" filler. 1 star (on a scale of 1 to 5, not 0 to 5, otherwise it'd be 0).\n\nSaba ginger maki (roll): the best and most interesting item, though I'd probably prefer it with less sweet a pickled ginger. Mackerel was a perfect choice for the type of fish to be used in this roll. The tartness of the ginger cut the oiliness of the mackerel. This roll demonstrates the whole reason why ginger is paired with sushi, though it's really supposed to be a palate cleanser between pieces, not a condiment. Though after this I might be less snobby and judgmental of people who pile ginger on top of their maki or nigiri. 4.5 stars.\n\nThe salmon tempura roll might have been nice but it was too drowned in eel sauce for me to really taste anything but sweetness. 2 stars.\n\nGot 5 pairs of nigiri:\n\nFried unagi, the most interesting nigiri on the sushi menu, suffered the same problem as the salmon tempura: it was too inundated with eel sauce to have much taste outside of cloying sweetness. I would've liked to try them without eel sauce but I don't like making special requests my first time at a place. 2.\n\nSpicy tuna nigiri sounded really strange but turned out to just be spicy tuna in a gunkan (military boat) style sushi (the one where nori is wrapped around like a moat). The spicy tuna itself was a tad spicier than I like but not as spicy as it can be at a Korean-Japanese sushi bar. Like the hand roll, the nori was not crisp. 2.5.\n\nTuna: meh but looked better than I expected at a place like this. 2.\n\nSalmon: okay. 3.\n\nThe yellowtail was a fattier belly or near-belly cut, which I appreciated. Some places this is the default for yellowtail, others charge extra for \"hamachi toro.\" 4.\n\nThe tea, a little scalded, came in a Chinese teapot. The ticket was illegible so I'm not sure if they charged us for it -- I saw a scribble that looked like it might have been the character for \"cha\" but didn't see a dollar amount next to it so I can't be sure. Water was never refilled.\n\nWith 20% tip it came to over $70 -- more than I think it was worth but beggars can't be choosers in the wee hours. Oddly (since they're supposedly a Japanese restaurant) fortune cookies came with the bill?\n\nThe woman acted condescending that our card was declined, but that's because the bank keeps mistakenly freezing that card on suspected fraud alerts, and we'd just bought an $8000+ medical bed this afternoon. When I was noting the tip amount on the customer copy of the receipt for my records, she pointedly told me I didn't need to fill that one out. Like I'm a foreigner who doesn't know how it works, with my perfect 'Merican accent? Weird to be married to an Asian dude and then be racist to customers.\n\nShe'd sounded like she was hangry earlier and maybe was having a bad day, though, so I let it go and didn't dock the tip for it. She was friendly enough saying goodbye and thank you, luckily.\n\nThat they're open late, take card (albeit somewhat snobbily), and have a couple interesting items makes this a low 3, but not a high enough 3 to brave the parking situation again.", "author": "ben l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "This evening I witnessed a teenage skateboarder come into the restaurant and ask for a \"special tea,\" to which the manager replied that he's been getting trouble from the cops lately. He then handed the kid a wad of cash and a soda.", "author": "Nadja B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-13", "description": "To be fair I did a delivery order towards the end of the night, which probably wasn't the best idea with a sushi place but jeez was the food bad. The sashimi was very fishy smelling and looked like it had been sliced days ago, the kind of sushi you see at a gas station. The tuna seemed like it was artificially dyed pink, the sort of nasty processed stuff. The yakitori sampler looked boiled with no grill marks what so ever, the scallops were honestly a joke. And the \"hot link\" tasted like a store bought mini hot dog, which I'm sure it was. To top it all off the kani or \"real crab meat\" nigiri was so stinking and off it seemed like they re-fried it to try and make it better, so it was over cooked and rubbery while also being rancid. Not feeling so great after this, would not recommend.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "So I ordered through uber eats, my order cost a little under $40, 2 California rolls, 2 kappa rolls, veg tempura rolls, inagi, and mushroom tofu ramen. \nI requested that the crab in the California rolls to be replaced with veggies or fruit(asparagus, mango, or simply cream cheese)because of being vegetarian and they didn't even bother with it. My kappa rolls came broken up and falling apart, while my mushrooms in my ramen tasted moldy. I've order from here before and didn't have a issue the last few time, while spending less than $20 but when I decide to treat guests to sushi and spend a good amout of money, I received a disappointment.", "author": "Jullianna O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "I don't have much to say other than this is the BEST chicken chow mein I may have ever experienced. High quality flavor and noodles :-) my friend enjoyed their meal as well! I live in Santa Cruz and I find myself making up excuses to go back in to SF just to eat here!", "author": "Eva D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "Proabably the worst watered down microwave quality ramen i've had ever. Anyone could probably make an instant ramen that'd have better quality than the selection they offer. I'd pay 10 dollars def for the instant ramen. Never trust the waiter to remember the prices of the food on the menu, just be ready to pay a few extra dollars already handwritten on the check for you. Jika ramen, a stale late night time, but man i felt robbed tonight. Ps don't order the duck roasted ramen unles you like to suck on bones. Also theres a review about an innaproriate deliveryman, literally butchering someone and not worth mentioning the food or quality here. That was my entertainment for the night.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Late night craving. Custom made 49er roll . Best edamame ever. \nNo minimum delivery order only $2 fee", "author": "Tania A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-10", "description": "I ordered delivery from here last night because my bf and I were craving sushi and not many sushi spots deliver to our area. We decided to give this place a shot because it had a great rating on Eat24 (I should've checked yelp too!). \n\nPros:  They delivered to our address and their ETA was spot on\n\nCons:  The fish was NOT FRESH!  Luckily we also ordered chicken karage and the wagyu roll because we could not eat the nigiri combo, CA rolls, or VIP rolls we ordered.  One bite of each and our stomachs turned.  \n\nVery sad to say that one of the few sushi restaurants that deliver to our location (and on time!) we will NOT be ordering from again!", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Always a fun late night spot with friends!! If you're in the mood for it (lol), sometimes they turn on the karaoke machine for you. Otherwise they have a pretty good menu and good service too.", "author": "Lucia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "This place is super chill. The main guy/owner I think is always very friendly and helpful. I would definitely recommend their food. Especially the rolls", "author": "Dexter Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Salmon Teriyaki and BBQ Eel w/rice was amazing, n came with a small portion of salad. Salmon was tasty and the skin cooked to crispy perfection I love it", "author": "Mimi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "This was the worse late night sushi I have ever had! Tuna taste tooo fishi. Worst order I have ever ate. And that was how much we ate of it.", "author": "Emilio L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Jika Ramen is my new favorite spot! I've lived in this part of the outer sunset for 2 years and I cannot believe this is the first time I've attended this restaurant. Beautifully crafted nigiri sushi and rolls, amazing specialty rolls (TRY THE VOLCANO ROLL) yummy yummy curry. Cheap beer! Open until 1 am! \n\nHeaven on earth.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I've been here several times and each time we've had great food.  Everything has always been hot and fresh.  Love the sushi and curry beef noodles!\n\nOnly con is the parking but we've been fairly lucky so far to find a space.", "author": "Yvonne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Best ramen noodles!  I love the beef ramen.  It is so delicious with some mushroom and broccoli. This is a hidden jam!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-08", "description": "These reviews are all over the place and if I wasn't craving sushi on labor day night while being super lazy about driving then I probably wouldn't have gotten food here. But I was lazy and they were opened late so oh well, might as well try. \n\nI ordered through Yelp with Eat 24 and the whole process was quite easy. And they estimated it to be about a 45-75 min delivery which was fine because I wasn't hungry yet when I ordered so I figured by the time the food gets here then I'll be all hungry and ready to chow down. \n\nOrdering online makes it easy to track how long it's been and the girl working even called me right after to let me know they were out of the uni nigiri (T____T) and that they could either issue me a refund or I can get something else so I got their Toro nigiri. And their mushroom wrapped beef, dragon roll, poke salad, and spicy salmon roll. It cost me $46 for everything I believe with the delivery fee and tip. \n\nOverall, my boyfriend and I enjoyed the poke salad and mushroom wrapped beef, but the sushi rolls were sort of below average to be honest. The toro didn't seem fresh ahd the dragon roll was mushy. I didn't eat the spicy salmon, that was my boyfriend's so I can't say anything about that. If I was ever hungry again late night I'd give them another try.. just with other foo", "author": "Venus L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-19", "description": "Good place for a quick Chinese meal. Although they serve ramen, this is a Chinese run restaurant. The food is good for quick on the run cheapish asian food. They have a rewards card where you get a stamp for each meal and they give free gyoza etc. Highly recommend the stamp card if you plan on going more than once. You just have to go once for the first free gyoza appetizer. \n\nIt's decent food, I wouldn't say anything is great or amazing here. The salad and veggies are very basic such as broccoli sides with light seasoning and the gyoza definitely tastes like the frozen ones they sell. I come here what I feel lazy to cook. They deliver as well which is the best part!", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-17", "description": "Ordered delivery. Took 2 and a half hours. Most horrible customer service I've ever had at a restaurant. Called the restaurant and they call the driver and claim, it will arrive in 5 minutes. 40 minutes later it finally came. Horrible. I would never order from them again", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "TERRIBLE. DO NOT EAT HERE. An absolute DISASTER. This place needs to learn how to be sanitary. (8/5/17) \n\nMy friends and I were waiting for our take out food and we were watching how the sushi was made. First the sushi chef placed seaweed sheets on top of the DIRTY counter WITHOUT a plate, she proceeded to place a DIRTY MENU on top of the seaweed (which is being used for rolls). I told the manager twice explaining what happened, and sadly the chef continued. Seeing the dirty menu they write on be placed on food is absolutely disgusting. Not only was the dirty menu taken behind the counter but they placed it top of the food they prepped. We lost our appetite just watching them. Food was terrible and their \"ginger\" they serve should not be eaten, highly discolored...", "author": "Lejla S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-19", "description": "Jika ramen has extremely small portions and just okay food. I don't think I'll be ordering here again.\n\nMy boyfriend and I ordered through their delivery service. We picked out the Godzilla roll which is a batter fried spicy tuna roll with tobiko as well as their Japanese beef ramen. Once it got here, the Godzilla roll was mushy and both items were room temperature. I've honestly had better instant ramen. The noodles were very gummy and they topped it with a sweet, strange flavored beef. The flavor of the beef overpowered even the miso broth. It was also 50% fat. Upon fondling through the noodles there were also bits of corn that weren't supposed to be there. It is definitely not a place for ramen. \n\nI've read that it is Chinese run and they have a sort of Chinese Japanese fusion thing going on here. Places like this are usually a miss and yes, this place is definitely a miss. Maybe we ordered the wrong items- just steer clear of their ramen and batter fried rolls.", "author": "Nina I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "I decided to make a last minute late night sushi order tonight, and ended up ordering from Jika.  I got some tuna and salmon sashimi, with a seaweed salad.  \n\nOverall the fish was fine; the tuna was not cut well, and the salmon was slightly fishy.  But the albacore was perfect.  Unfortunately, the ginger was the less delicious red kind, and the wakame was too juicy and a little rancid.  And they gave me the really cheap chopsticks.\n\nSo while I don't really recommend this place, it wasn't bad.  But I wish I'd tried harder to make the app order from Kaka Udon.", "author": "Joey Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I am really glad I didn't let the negative reviews for this place turn me away. I ordered the veggie Ramen, and my boyfriend and ordered the Japanese beef ramen, both were really good. We went 9 PM on a Friday, the place is really small we found seats immediately. Our waitress was super nice, but I could tell from all the yelling and orders that kept coming in that they were either stressed out or maybe short staffed. So I guess it kind of killed my relaxed vibe a little bit. However, since I hadn't tried this restaurant before I guess it was sort of comforting to know they were in high demand.", "author": "Alison J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-14", "description": "The food is okay, but their service sucks gorilla balls. We prepay a $2.00 delivery charge plus tip just so the courier can call from her car and tell us to come out to the street--in the middle of the night--because she's \"not good with English.\" Keep in mind that we had already given them our gate's access code through the app; you need not be fluent in any language to punch \"#####\" into a universal dialing pad. She calls another employee to call us to meet her lazy ass outside; we tell him, \"push ##### on the dialing pad.\" He hangs up, and the courier calls us again to meet her down at the street. We reiterate, \"push #####,\" and she goes into great lengths telling us--in full sentences--she is not good with English. Hangry and ready to bitch at management for sending a courier that is too incompetent to \"push ####\" on a dialing pad but competent enough to use a phone and tell us to meet her on the street, we tell the guy, \"tell her to get out of the car and walk up to our front gate first.\" Minutes later, she miraculously shows up at our front door and says, \"here you go\" as she annoyingly hands us our food. For someone who is \"not good with English,\" I am impressed with her familiarity with the idiom \"here you go.\"\n\nConclusion: The fact that Jika Ramen would send someone too illiterate to use universal dialing pads on a delivery run accentuates how little they care about their own employees, let alone customers. That alone is a compelling reason to never support this business ever again.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-08", "description": "waited 2 hours from the time I placed the order for the food to arrive!! Do not eat at this place! Waisted so much of my time!!!! called the restaurant and was told 3 separate times food would arrive in 10 minutes!!!!! Stop lying and be honest!! Such a disappointment!", "author": "Daisy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-25", "description": "I came in at 9 pm and there was no one else in the restaurant. after my meal i was waiting for my check for 15 minutes. I'm usually sympathetic to family owned businesses but for the service and portions i got, it was way too pricey.", "author": "Gabby P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "Don't know what's up with with These negative reveiws...my food was hot, sushi was fresh. Nothing that blew me away, but still very good.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Looks like a lot of recent negative reviews. Based on my experience I thought the food was good and no issues with delivery. I ordered the spicy hot spicy minced pork ramen and the 3 amigos roll. The broth was flavourful and the roll was good. Granted, I only ordered from here once, but I'd definitely order from them again. I don't often give 5 stars unless my mind is blown but I thought this place was pretty solid based on my experience so far. I'll update if anything changes.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "The chicken on the chicken ramen is hard to eat. The place doesn't looks like clean. They open until late, they might get you when you don't have option. But you always can buy a rotisserie chicken on Safeway.", "author": "Patrícia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-03", "description": "DISGUSTING. How is this place allowed to serve food? I ordered UberEats from this place and it was literally the worst meal I've ever had in San Francisco since I moved here 5 years ago. That sounds dramatic AF, but when you get food poisoning from the supposedly \"baked\" oysters, you deserve to add some dramatic flare to your warning review to others. \n\nMy BF and I ordered:\n\n** Chicken Karaage: BLAND, over cooked, batter was incredibly greasy. Have you ever had BLAND and OVERGREASY fried chicken? Don't. Just... don't.\n\n** Baked Oysters: As stated above, these oysters WERE NOT COOKED thoroughly. This would be fine, if it weren't for the clear low quality of them. AND EXCUSE ME. IF I WANTED RAW OYSTERS, I WOULD HAVE ORDERED RAW OYSTERS. UGH. I ate one. Literally ONE out of the four pieces and couldn't continue. I dumped the other three pieces, but unfortunately, that one piece I ate was enough to have me spending too much time over the toilet. #tmi. BUT NO F-ING WONDER THEIR HEALTH SCORE IS LOW. WHY, GOD, WHY WAS I SO DESPERATE FOR POST-GYM FOOD? Maybe I deserved this wrath... \n\n** Chicken Wings: Yes, we love fried chicken, we ordered two diff kinds of fried chicken. See explanation for the \"Chicken Karaage\" except add on top of it that the breading of these wings was SOOOO thick, YET SOOOO BLAND, that I felt like I was biting into... actually, I have no comparable noun... \n\n** 2 piece sake nigiri and toro nigiri: WHAT IN THE?! TOTAL. SUSHI. BLASPHEMY. The taste was INCREDIBLY fishy and the texture was RUBBER. I love sushi, the high end bougie B kind, and the kind that doesn't taste as bougie but is decent quality. My scale for sushi is pretty wide. BUT THIS... THISSSSSSSSSSSSSSS doesn't even land on my scale. It falls off the deep end and into sushi hell. I took a small bite of each and tossed it... didn't even let my BF try it because I love him and he doesn't deserve such cruelty. \n\nSTAY AWAY from this terrible place.  SEE ALL THESE REVIEWS?!!? YEAH, I KNOW. I SHOULD HAVE BEEN SMART AND YELPED THIS PLACE BEFORE I PUT IN MY ORDER. So again, maybe I deserved this meal... but you don't. If you read through these reviews, you'll be wise to not order from here. If you order anyway, God be with you.", "author": "Quynh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Went and had the grilled pork ramen tonight.  4 nice pcs of pork in it, good amount of noodles, tofu, seaweed, little light on the corn and mushrooms.  Broth was hot and yummy.  For 10.50, it was a good value.  Served up in about 5 - 10 mins.\n\nThey use laminated menus now, so you just circle what you want on the menu.  Easy to order.\n\nAlso, chopsticks are now plastic, reusable.  Good for the environment and no splinters and much more firm.\n\nI've never had the sushi, had the ramen twice and it's been decent both times.", "author": "T. E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "HARASSMENT AND  CREEPY, INAPPROPRIATE BEHAVIOR FROM DELIVERYMAN. If I could give this place a zero and add a giant red flag next to the name to alert customers, I would. \n\nI ordered from this place on Saturday at 11 PM through the Yelp app and the delivery man was disgustingly inappropriate. First, he got past my gate before calling me to let me know he was outside at 12 AM. When I came outside, he proceeded to comment on my appearance. Then, he forcefully hugged and kissed me on the cheek while moving towards my house's entrance. I had to push him off of me. \n\nMinutes after leaving he texted me commenting on my appearance again and asking if I liked the food. I have no idea how he got my number because Yelp masks customers' numbers. \n\nI was so disgusted by the experience that after a few bites of the food I simply had to throw it away. No loss for me, because it was mediocre. \n\nBEWARE OF THE DELIVERYMEN. Or just don't order from here. It's not worth your money.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-29", "description": "The only good thing about this place was the delivery was much faster than anticipated. As for the food....ugh. We both ordered Ramen, duck and teriyaki chicken. Neither of us had any edible pieces of meat in the ramen. The duck was pure bone and the chicken was all fat. The soup was extremely bland tasting and lukewarm at best. I will not be ordering from here again. It did nothing to satisfy my craving for ramen.", "author": "Addyson B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Missed to-go order by phone then and once reordered at the restaurant, it made the wrong order again! What's wrong with this restaurant. It should be closed and let this location has better restaurant. Please! Please close it!", "author": "Fred L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "Tried their ramen got off work late, not many options at late night. I'm not excited on the ramen, tasted aleight and the waitress' need to keep up with their service, but I guess they do mostly togos and deliveries.", "author": "Hu H L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "Super nice and yummy restaurant!!! Fast delivery \nI always order food from them when I don't want to cook.\nThey also send me the green tea ice cream for free:)", "author": "Vincci C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Ordered through Eat24 and had no problems. Delivery was on time roughly 1 hour or so. \n\nPoke- Not bad. Tuna's pretty fresh and I like how its in a mild spicy sauce.\n\nJapanese Beef Ramen- My bf seems to like it a lot especially after drinking lol. Broth isn't too strong so it blends well with the strong taste of ingredients. \n\nChicken Wings- Crispy and the sauce it comes with some type of siracha sauce with mayo and the other one seems to be like teriyaki sauce. Tastes good with the chicken :)\n\nSalmon Sashimi- 5 big chunk slices of raw salmon and its surprisingly fresh!!! \n\nYakitori- Little hard so I won't order this again. \n\nThey're not extraordinary nor they are bad so I gave them 4 stars since I'll be ordering delivery from them quite often...", "author": "Sharmaine M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-22", "description": "We ordered through a delivery service. Politely, and specifically, requested no seaweed on one of the orders. When we received the order, had to spend 15 minutes pulling seaweed out of the dish. By then, the flavor of the seaweed was in the dish. The slow cooked pork belly was tough and not falling apart like it should've been. Literally took six bites and couldn't eat anymore because of the flavor.", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-27", "description": "I had a mixed experience at Jika Ramen. \n\nSo I swung by yesterday to take a look at the menu (I live one block away but had never been in) and when I walked in/said hello, all of the employees looked at me, said nothing, then went back to doing whatever they were doing. I stood there for 45 seconds (literally) waiting for service (there was NOBODY else seated in the restaurant) and then the sushi chef finally looked up and mumbled \"do you want something?\"  I'm a pretty laid back person, but almost responded with a \"I did, but not anymore\" and walked out, but I asked for a menu because I wanted to call in for delivery later that night. He mumbled something in another language to the kitchen, nothing happened, and then a man who was waiting for his to-go bag finally walked over and grabbed a menu for me (unreal that a customer had to go get me a menu). I left, but planned on going back after seeing some good rolls on the menu.\n\nWalked in today, sushi chef was again of no help, short, and rude (he's the only person you see when walking in, so naturally you ask him where to sit/say hello). The waitress was very nice. Couldn't speak much English but she was polite and did everything in a timely manner. She actually made me laugh when I went to order a glass of Cab and she politely said \"no no no\" and recommended I order something else. I always appreciate honesty.\n\nThe sushi was ok. Not the best, but very good for the prices (regular rolls will cost you $3-5 for 6 pieces, special rolls will cost $8-$12). The plum wine she recommended was actually very good, and only $4-$6.\n\nI have to say the sushi chef again showed TERRIBLE customer service. It was 8:30 PM when I walked in, sat down, and then 2-3 minutes later two other guys walked in. Same thing that happened to me last night happened to them (walked in, said hello, got ignored). One of the guys put his arms up/\"uhhhh, hello.......?\", and the sushi chef finally said \"can I help you?\" and the irritated guy asked if they were open/could they order food. The sushi chef turned around, looked at the clock, chopped sushi for about 8-10 seconds and then shook his head no. I couldn't believe what I saw, because the restaurant is supposed to be open until 2:00 AM, was empty (only two tables being used) and I had literally just walked in. The two guys just walked out laughing and shaking their heads in shock. That's one way to guarantee two paying customers never return to your restaurant. Unbelievable. \n\nThis restaurant has good food for very affordable prices, but very BADLY need to improve the customer service. The waitress was nice, but the sushi chef was a straight a$$hole (maybe he just doesn't speak English very well? I'd sure hope that's the problem).", "author": "Joey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "This is the best Ramen in San Francisco! The sushi is fantastic also. I love the food. And it is very affordable. The quality is amazing. And the staff is very friendly. I have never felt more welcome at a restaurant before. The staff and owners genuinely care about their guests. I have come here multiple times in the past and I can't wait for my next visit!", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-04", "description": "The sushi is alright here. I've been a couple times and not entirely disappointed by their sushi, although it's also not super awesome. The ramen is pretty much the same as those $0.15 packages from Safeway. Do not get ramen here.", "author": "Jill A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "I ordered from here once and they didn't do too good but they made up for it, the manager reached out and was amazing , the sushi tasted really good and the customer service was amazing", "author": "Paula S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Ramen was very good. Sushi was fantastic. The owners were very friendly and we liked the local neighborhood restaurant feel to the place. We will visit again.", "author": "Art T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "The family was getting together to spend a nice evening chowing down on something Japanese.  Somebody in the group had the bright idea to walk down to Jika Ramen despite the sad reviews of other savvy diners.  Giving the place the benefit of the doubt, we figured we'd give it a try.\n\nBetween the waitress not knowing how to pronounce the dishes, to being served half full glasses of water, we were off to a bad start in the sauna of a restaurant.  Then the food came.  The noodles and broth I ordered (I got #101) were unbelievably salty.  In fact, every dish was incredibly salty and many members of the group watered down their soup with their water to make it edible.  The portion sizes were pretty pathetic too and I only left full because I polished off 5 glasses of water to counter the salt-lick soup.\n\nOne member of the party mentioned to the waitress that there was no toilet paper in the bathroom, to which she shrugged and walked away.  Honestly, Jika Ramen has got to be the worst restaurant in the sunset, by far.  Never...again.\n\nFood: 2/10\n\nService: 2/10\n\nPrice: $$\n\nAtmosphere: 2/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-17", "description": "Ordered assorted sashimi which supposed to have 7 different type of sashimi as stated, but it came with just 4 types...   this whole meal is $50+. Oh heck no. No going to order from them again.", "author": "Rebegi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "3.5 stars\n\nHmm not sure why all the bad reviews but I thought their sushi and 2 item combos were good and flavorful\n\nDidn't order the ramen but maybe it's not up to par yet especially since if their name has \"ramen\" then it better be good right??\n\nBut I thought their 2 item combo was really good. Love the waygu sliced beef! It was flavorful and the sautéed onions was a plus\n\nEel rice was ok but still good\n\nI also had the crispy sushi cause anything fried, salmon and cheese must be good and it was!\n\nWill prob tried their other sushi rolls for take out/delivery again and maybe they will be my go to late night munchies place. Japanese\\Chinese food is always better than a greasy burger or pizza!", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Me and my wife went to there to share spicy ramen noodle for several times. The soup is not the real cook transitional ramen soup, the noodle is not real quality ramen, fast food basically. The only reason why we keep eating there is because they open until 12am. We have to go there.", "author": "Jimmy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "Damn either this place has taken a dive or reading the reviews after i already placed my order- seriously affected my experience .Because i swear it was ok before.\n\nThe good: Order arrived early and went through on the app even after the posted closing time. (maybe cashing in right before it goes back in dumpster)\nAlso the miso soup was fine.\nBad: Yep the baked oysters were raw and grody.\n-The ramen broth was revolting and smelled like squid pig garbage juice milk and the ribs were dry and flavor less.\n- And finally the bay bridge roll which i remember liking before was terrible. The shrimp tempura (scrumptious as it once was) was worse than sizzler all u can eat shrimps and im almost certain it wasnt even a smashed shrimp but a a sardine deep deep fried in stale crust of generic Chinese crust sht. The tuna was the worst ever defrosted poorly and the ginger was void of all ginger and wasabi not wasabi as if it all came out of a frozen box from some Chinese basement. \n\nYour better off with one of those red hot rubber beef borritos from the Sevie (7-11) that used to go so well with a Slurpee and street fighter II. \n\nAlmost as bad as the resilient Chinese restaurant on the corner of Broadway and Columbus in North Beach with the bizarre squid chicken and tortured fish tank sea animals on display.\nAnother space in the late-night hungry n drunk niche filled- w weird Chinese food.\nI was so hungry i ate most of it . im gross when its late i guess. Im calling the health dpt if i barf.", "author": "R.C P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-13", "description": "Beware! FRAUDULENT CHARGES FROM THIS RESTAURANT. Make sure they don't keep your credit card information! I ordered from this place via Postmates on December 29, 2016, and they never brought my food because they called to tell me they were \"closed\" (even though their website stated that they were open for two more hours). But they CHARGED MY CREDIT CARD THAT EXACT AMOUNT ON MARCH 11, 2017. Unauthorized, and almost 3 months later! And I never would have seen it if I didn't check my statement. If you've EVER ordered from these people, keep an eye on your bank statements, as they might try to steal from you.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "Not doing the ramen again... its no good.. I was excited to see a ramen place that delivered but I guess ill have to keep driving.. no flavor, super basic, not even an egg.. if you're wanting ramen do yourself a favor and look else where.", "author": "Mia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "I had the cucumber rolls, miso soup & brown rice tea. All incredibly good, I wish I had 2 more servings of each!", "author": "Venus S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "Open till 2am + they deliver = hazardous to my health.\n#datsrslydoe what a treat (vs my other latenite deliv opshies).\nAt my door like 20 mins after ordering.\n\n(^_^) Soft Shell Shrimp (http://www.yelp.com/biz_photos/jika-ramen-san-francisco?select=kL0Wc9sPZBLuuJaf_zugnQ)\nTimon said \"the little cream-filled kind\". #district9status*\n\n(^_^) Ribs x Eel Rice x Choc Ice Creamochi (http://www.yelp.com/biz_photos/jika-ramen-san-francisco?select=VT748UMpj_zUFk2gChEMIg)\nOther places' ribs should be like this.\n\n(-_^) Baked Mussels (http://www.yelp.com/biz_photos/jika-ramen-san-francisco?select=eRzyFUBIXF-u-E52S6S2Ng)\nGood, but I'm biased toward raw. #oobabywelikeitraw #yellowsuits #honkifyouheartminions\n\n(-_^) Japanese Hot Link (http://www.yelp.com/biz_photos/jika-ramen-san-francisco?select=zx-nXkvfLFzofTOiQK6nPw)\nEd Scissorhands hearts these.\n\n(-_^) Gyizzoza (http://www.yelp.com/biz_photos/jika-ramen-san-francisco?select=6pRn3m9QJ1aSrUV9OKT0hQ)\nFairly standard; still good.\n\n\n*#hakunamatata was too obvi. Besides, that htag is like SO last review.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-11", "description": "The longest 2 hours of my life only to get meager portions, and for the outrageous price at that...\nThere was a major major lack of flavor as well as meat on the bones...\nWhere are the rest of my ribs for that ridiculous price...?\nLong story short I'm sooooooo good off of getting ripped off from these people. Shop and dine elsewhere sunsetters", "author": "Alfonzo T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "We ordered from here through ubereats and couldn't be more disappointed!!!! The sushi was absolutely DISGUSTING. sashimi was very dry and you could tell just by looking at it. Ordered spam musubi and it was just one piece cut in half and there was barely any rice to cover the spam!! Ordered at 1AM so maybe they half assed it because they were closing, but the sushi was just gross & dry. Sashimi tasted like straight up FISH. Did not taste clean at all. Nauseating.....", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-17", "description": "My husband and I ate here on the first day of our trip  as it was close to where we were staying and I was excited about being able to get a bento box (outside lunch hours).  We got the gyoza which was tasty but it was only crisped on one side, leaving the rest of it soggy and not very flavorful.\n\nMy husband ordered some kind of seafood and noodles and stated his noodles were slimy, unappetizing and that there was hardly any seafood in it (1 shrimp, 2 clams or scallops, couple pieces of salmon).  I got the chicken teriyaki bento box.  The salad was ok, lettuce seemed fresh but was just iceberg, tomatoes, cucumber and the ginger dressing.  My california roll tasted like mayo (not saying it has it in there but it had a definite taste to it).  The chicken teriyaki was pretty sweet and I found the chicken to have a \"springy\" texture to it.   I was not able to eat it (texture issues creep me out in food) but my husband had a few pieces as he was hungry from not eating most of his meal.\n\nWe came on a Wednesday and the place is small and there were 3 other tables filled.  Service was slow.  The employees were more interested in talking to each other than helping us, it seemed.  Although maybe since it was not busy the waitress ignored us so as not to be overly attentive.  When she came to fill water glasses she did not fill them to the top (not sure if it because of the drought in California or she worried about overfiling them).\n\nNot a place I would go back to as I am sure there are other restaurants that do the same types of food, much better.\n\nPlus they are open till 2am and they do deliver.\n\nAlso while we were there we observed the person making the sushi rolls (or standing behind the sushi counter) wearing gloves.  She came to the cooler near our table, got out some bags and buckets, took them away, brought them back, went back to the sushi counter and did not appear to change her gloves.  not sure what was in the buckets and bags she was handling but it seemed unsanitary to not change gloves between tasks (I do not have a food service license and am not sure what the proper procedure is).", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-27", "description": "I'm going to start off by saying do not waste your money if you are craving ramen. \n\nWe decided to give this place a try (even with poor reviews) after being intrigued with the wonton chicken ramen. Definitely not worth it. The noodles are almost soggy, completely lacking the slight chewy goodness that good ramen provides. The chicken in the wonton chicken ramen was okay and the fried chicken tasted like frying oil. The broth was the only part that tasted decent, but still nothing to save the rest of the dish. \n\nWe also built our own bowl of ramen and were completely disappointed to receive broth, mushrooms, noodles and the protein (the fried chicken). We were disappointed that although we paid more for this dish, it did not include the egg, corn, or other vegetables that the wonton chicken ramen included. It was extremely bland.   \n\nThe only thing that was good was the gyoza.", "author": "Carissa B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-01", "description": "Yikes. The worst experience at a sushi place I have ever had. Maybe their delivery is better, it seemed like they prioritized getting as many orders out as possible than getting the orders correct of the people actually eating there. Another couple who left just before us also had a messed up order. \n\nThere's another sushi spot right around the corner (Izakaya), I'd recommend going there if you like being treated like an actual human being. Our mistake was checking this place out after seeing that Izakaya had a wait. It definitely would have been worth the wait, in hindsight.\n\nWhat we ordered:\nSpicy tuna roll,\nCombination tempura,\nHot tea,\nMango ice cream.\n\nWhat we got after waiting for 45 minutes:\nSpicy tuna roll,\nEdamame,\nTea,\nSashimi.\n\nSomehow, those four items (that you can get anywhere and would likely taste better) added up to $30.45 for a measly 6 pc of small spicy tuna, a small dish of warm edamame, bland tea, and a plate of 6 dry sashimi that we didn't order. After waiting for an extended time listening to staff and couriers from delivery services arguing, getting a headache and still being hungry, I decided to pay the bill so I could leave and have a real meal even though I was obviously being gypped. I hope that the extra $10 they got out of me was worth it, because no one working in this place seemed to have their shit together. Maybe we just came in on a really bad night. Don't know, but we won't be back.\n\nIn the end:\n-Slow/unfriendly and unattentive service.\n-They messed up our simple order by not giving us 2 items and gave us 1 item we didn't order, and then charged us for things we didn't order/receive. \n-Small uncomfortable loud space with people constantly arguing over getting together delivery orders.\n*****If you like being ignored in a place with 4 tables and a small sushi bar with at least 5-6 employees, overcharged for a messed up order and medicore food, then eat here. Otherwise do yourself a favor check out the place around the corner. Or any other restaurant in this city. Seriously.", "author": "Joey F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-04", "description": "Tried this place via Uber Eats only, didn't like anything there, especially the beef sukiyaki or ramen of any kind.  Will not come back again.", "author": "Lolipop W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Firstly, this is a Japanese style run by Chinese owners, so don't expect much authenticity. As others mentioned, the waitress doesn't know English at all so the restaurant devised up a way to circumvent that: laminated menus where you circle the dishes you want with a marker. Problem solved. But, that means that if you want any substitutions or whatnot, you'll need to have a Mandarin speaker with you (or the Google translate app).\n\nThis place is not very busy for dinner but seems to be packed with take-out orders and lunch patrons, so if you want to give it a try, dinner time will let you have the staff's full attention. I reiterate: the staff isn't trying to be unfriendly or unprofessional; they just don't understand you well (case in point: the table next to me told the waitress that the food was delicious, but she \"ignored\" it, not intentionally but because she didn't catch what the person said). If you happen to speak Chinese though, you will find that the staff truly cares if you enjoy your meal or not and will be happy to make any adjustments.\n\nThe curry is really spicy, the sushi is just average, but the ramen is pleasant and worth getting!", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "The food is quite delightful, and the prices are awesome! I especially love their baked mussels that I look forward to almost every night. Lol! And I highly appreciate their welcoming friendly customer service!\n\nIf you are a fan of baked mussels,\ngrab it HERE :)\n\nOh and also, the fried ice cream is a tasteful dessert.", "author": "Ievrin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "I brought my family to eat here first time for lunch , great ramen noodle with \"charsiew\". My family had Bento Box. Great food overall and everyone is happy. Owner Jackson is friendly. Great little restaurant. I will return again", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "Our experience was iffy. My parents and I came here for lunch. It was empty; no other customers.\n\nUps:\n1) The place is nice on the inside.\n2) They are very nice and polite.\n3) The edamame was good.\n4) The gyoza was good.\n5) The pork tonkatsu was good.\n6) The braised pork belly ramen was good but it wasn't spicy as advertised.\n\nDowns:\n1) Their main problem is that no one really understands English.\n2) They got my order wrong (I still don't know exactly what it is, but what they brought me was yummy. It was some stir fry, but not worth $9).\n3) They forgot part of my dad's order and even when he said something, he still got the wrong thing, mainly because they don't understand English.\n4) They don't have some of the wines that are on the menu.\n5) They would also give us strange looks while we tried ordering because we are an all white family (even though my mom is half Japanese) trying to enjoy some ramen.\n6) We would have to point over and over and what we wanted off the menu.\n\nOverall, the food was good, but the service can use work.", "author": "Kimmie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Ordered the Grilled pork ramen, it was very good. The sushi was not made to specifications, as they left in the avocado when I didn't want any thats the only reason its 4 stars. Their gyoza is very very good! Would recommend to anybody!", "author": "Carter K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "If you're going to get anything delivered, don't order anything with raw fish. On second thought, don't order any sushi at all. \nI ordered a spicy tuna roll, california roll, and an avocado roll.\nThe spicy tuna was warm and it did not taste fresh whatsoever, had to throw it out. The california roll had a really bad texture to it, and like it was gooey (why was it gooey, i dont know!!). The avocado roll was extremely tiny and wow not good... AT ALL.. How do you mess up on the most simple sushi rolls?\n\nAte most of the sushi and felt so sick from it, I had to throw up. \nNEVER EVER ORDERING FROM HERE AGAIN. So disappointed. \n\nThe sushi is food poisoning waiting to happen, not satisfied.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-27", "description": "Great if you want pseudo-Japanese food that's actually just Chinese two minute noodles. About as authentically Japanese as Tom Cruise in the Last Samurai", "author": "Jason P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "Hot sake was warm, not good.\nWaitress don't speak english at all.\nChef/cook neither.\nRamen was ok, but not as expected. Noodle too soft.", "author": "Marco V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Super yummy! Cozy restaurant. The staff was very kind, but there seemed to be a little confusion when we were ordering because the paper menu and the book menu had some differences. It was all sorted out though and everyone I was with got exactly what we wanted.\n\nWe ordered: grilled pork ramen, bbq pork and duck ramen, and braised beef ramen.\n\nThey gave us tea when we first sat down, and brought us our food promptly. In the pork and duck ramen, the duck was still on the bone, which made it a little harder to eat but really enhanced the broth. A few bits of the beef were tough, but the flavor was really nice.\n\nOverall, not anything too fancy, but a nice place to get some good ramen.", "author": "Molly F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-22", "description": "I made a huge mistake.  I was craving ramen, and saw this place on GrubHub and ordered before reading the reviews.  I figured ramen was in the name, so it had to be at least passable.\n\nSuch a waste of my money.  Noodles bad texture, flavorless broth.  I ended up pouring it down the garbage disposal.\n\nI also ordered a sushi roll to get my order up to the minimum value, but they put the cold sushi on top of the hot ramen, and now I'm weary to eat it.  Never, never, never again.  So dumb of me to order without reading the reviews.", "author": "Kathryn M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-25", "description": "Jika Ramen sells ramen, sashimi, rolls, nigiri, won ton ramen, noodles, japanese appetizers per their menu.\n\nwandered in noonish, open sign on. staff says they're not open. i pointed to menu listing hours. after finding i wanted ramen.  they agreed to serve me. (seems the boss not in yet). they couldn't make change later since they couldn't open the cash register\n\neats: ramen (5) with pork broth\n-homemade hand pulled\"la mian\" chinese style\n-broth just pork flavored, not tonkotsu.\n-thin angel hair noodle, not al dente, mushy\n-toppings just corn, seaweed and  ? sprouts\n-this isn't ramen at all, more like noodles in won ton noodle soup (on the menu also).\n\ntake outs:\n-very nice staff,\n-ramen iffy, ramen base price, toppings +2\n-ramen is chinese style, not japanese\n2 stars for japanese, 3 stars for chinese noodles.\n-beijing used to be here.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "I live close by and have recently seen them place menus on my door so thought I would give them a try.  \n\nI ordered three sushi rolls.  The only one remotely palatable was the California roll . The must buy the lowest grade sushi because this stuff is awful.  The salmon looks like farmed, dyed, and smells off. I couldn't even finish the other 2 rolls.  The wasabi didn't have ANY kick to it whatsoever.  \n\nI had to throw them out.  I've never had to do that with sushi.  \n\nI'm not going to order from here again.  Disappointed I wasted my money.", "author": "Koa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-02", "description": "I'm giving this a 1 star rating because the sushi was not fresh. Salmon was very *fishy* tasting. I could only chew twice before spitting it out. Before throwing the whole thing out, my friend sampled it, and although he swallowed his bite, he also wouldn't eat more. \n\nThe curry was red and a little too spicy. I've tried curry from many different places, and I prefer the yellow (brown) type of Japanese curry. The carrots were good, though they were the only thing of substance, besides the curry itself. It was not a complex flavor. \n\nPerhaps the ramen here is good. I would steer clear of anything uncooked at this restaurant though.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "Two of my favorite types of food under one roof!\nThere are so many wonderful items on the menu, and the spicy ramen won me over, spicy and meaty and the noodles were great. All the sushi we ordered was very good, well made.\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-14", "description": "Need to check your bill before paying.  Terrible experience as they double charged us their dinner set and they kept saying the side rice that goes with the dinner set is counted as another dinner set.   We went back and forth for at least five times \"explaining\" their menu to the waitress.\n\nFood is so so, we are not going back again.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "I live down the block so had to give this place a try.\n\nThe ramen is delicious. The noodles are made in-house every morning. The broth is tasty, I needed to spice it up a little with hot sauce but that's a person preference thing. \n\nThe sushi was good but not great. There's a great sushi place around the corner that will continue to be my favorite. Particularly since it is open so late, it's a good choice for sushi.\n\nOverall, the food was good but the Gyoza was delivered to the table cold. I was also surprised by the service. Everyone is very nice but everything took forever. We were the only people in the restaurant and dinner easily took over an hour because of the time it took. Since we weren't in a hurry, that was fine, I wouldn't pick it if I was in a rush.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "I order Volcano roll, Combo nigiri, Poki bowl, and free x2 miso soup.Nothing I ordered came appealing or tasty. There was a weird white spot on my salmon Nigiri... Didn't eat that.", "author": "Tri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "I've ordered delivery only through seamless\n\nNever got our orders wrong \n\nI get the:\n\nPoke: pretty fresh and the marinate isn't too salty. It's a little spicy but I like that. \n\nSashimi platter: fish is pretty fresh and the portion is great. \n\nNigiri: the amaebi was really good and the fried shrimp head wasn't soggy.\n\nBaked mussle: good too. But of course when we got it, it was cold already. But it was still good.\n\nThe price is pretty cheap consider its delivers across town.\n\nTry delivery, maybe it's just the service that gave this place a bad yelp rating.", "author": "Josie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-20", "description": "After landing from a 12 hour flight and having been craving ramen the whole time, I turned to Eat24 and Jika to help solve my problem. \n\nUnfortunately, results were less than inspiring. \n\nI ordered the grilled pork ramen, poke tuna, and seaweed salad, and while the tuna was fairly middle of the road, the salad was bad and the ramen was terrible. I would have been better off making Top Ramen as the noodles were soggy and the broth completely flavorless and watery. I was glad to see the egg wasn't completely hard-boiled like the pictures show, but it's not saying much if a soft-cooked egg is the highlight of your bowl of ramen. \n\nAdditionally, delivery, which was originally estimated at 40-50 minutes ended up taking 80+, a full hour after the app's given delivery time after a status check. \n Tonight \nAll-in-all, a very lackluster experience, will definitely not be returning for a round 2.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Local gem in the Outer Sunset! Always delicious sushi and spectacular prices! I was never a fan of sushi but Jika got me hooked, no pun intended. I'm trying to figure out how to convince the BF he wants sushi tonight, too! Give them a chance and support local/small businesses.", "author": "Debra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Had the pork ramen, poke salad and California roll. My only complaint would be that the noodles were soggy. But overall everything was pretty good. Would order here again.", "author": "Alane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Not sure if my order was good because I'm a first time costumer, but I got the pork Ramen and Tuna Maguru, and they were both great.  This place deserves more then 2 stars.", "author": "josh d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-19", "description": "This place is great has great desserts sometimes their sushi could be a little better however the pokey is delicious and out of this world I can eat that all day night 24 seven. I also really like the remune drinks even tho are a little tricky one opening them", "author": "Linda A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-29", "description": "The service was absolutely ridiculous. The one waiter didn't know English. The food came out ridiculously slow as well. We probably received 1 roll per 20 minutes, and this place wasn't even full. We waited 90 minutes until our first ramen came out (out of 3). To makes things worse, it took 20+ min to get the bill. In the end, it took over 2 hours and 30 minutes for an entire meal for 6 adults and 3 kids. Again, the restaurant was not full. \n\nThe food here was also mediocre. The sushi rice didn't have enough vinegar and the rolls didn't have enough flavor. The ramen did not taste like legit Japanese ramen like many other places in sf and San Mateo. \n\nDefinitely never coming again.", "author": "Alvin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-16", "description": "Ordered delivery and got a \"house cheese cake\" which is advertised \"with whipped cream & sweet cherry with strawberry sauce\" ..... Delivery arrived and all I got was a seriously tiny piece of cheese cake without any of the promised toppings. Called back to fix the error - was told \"sorry that's just the way it comes\" and hung up on me.", "author": "Tom G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-05", "description": "I hate leaving bad reviews for places but this kinda called for it, I ordered at 11:45am and did not receive it until 1:40.. 30 minutes past the maximum delivery time. Oh, and I love 3 miles away...I usually wouldn't mind that but I ordered SUSHI! it was warm, and the ramen was cold. I ate one or two pieces and felt weird about it so I  decided to just put it in the fridge and continue into my ramen. However, now I am feeling some nausea. Hopefully I don't have food poisoning.", "author": "Shelby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "I saw all those reviews but still decided to try it out last night for dinner, I had great service. The boss designed and ordered for our table, party of 5. She was very courteous and polite, ordered just enough, 3 bowls of different ramen-pork, tampura & scallop; assorted sashimi, spider rolls and a few more others; hamachi kama plus mango mochi. It was only $107, I think it is great value for what we had.", "author": "Tina C. W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-27", "description": "The reviews are all over the place, so going in I really didn't know what to expect. Interior is ok--doesn't feel dirty but also doesn't feel nice. The server did have trouble with English as stated in other reviews--beer wasn't on the menu, but my partner asked if we could have one of the beers displayed on the wall. She was confused by the request, pointed to the menu, then got another man to come over and assist. They didn't have tamago on the menu which is pretty basic, but due to the language barrier issues with the beer, I didn't want to ask.\nWe got a spicy tuna roll, and some pieces had very little avocado. After awhile they brought out a large plate of sashimi which we hadn't ordered. It was difficult communicating the error, and they then brought out two other dishes--neither of which were correct. They wouldn't read over the items we'd circled on the menu so we were stuck trying to explain to them in English. None of the sushi seemed too fresh. Miso was decent. I'd say based on service, this is one star. Based on food, two.", "author": "K H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-28", "description": "This was my first time ordering from Jika, and currently I can say I probably won't order from them again. \nPros:\nOpen early and late \nDecent size portions for the price\nChicken teriyaki was tasty\nPork belly in ramen was also very tasty\nCons:\nTook over 1.5 hours for delivery that's about a ten minute drive away\nNo miso soup with bento box (it costs less than 25 cents per bowl to make, I have never seen this not offered with bento)\nRamen broth was tasty but as it sat it seemed to get much saltier?? So much so that I had to toss it out.\nThe house salad was half filled with mushy tomato slices and the dressing they used was not bad, just different than what I'm used to, wish I hadn't ordered this for $4\n\nAll in all the food was ok, but with as many good Japanese restaurants in the sunset and richmond I don't think I'll be dining here again.", "author": "heather t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-17", "description": "Delivery was prompt and friendly. Nigiri, ramen, and shrimp tempura was good, nothing to rave about. The mochi was disgusting - the outer mochi layer was hard and cracked as if it had been sitting in a freezer for weeks. I'm hoping they were having an \"off\" day with this item.", "author": "Roger E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "Delivery order confirmed on GrubHub by the restaurant, waited forty five minutes after closing time with no communication. If you guys are going to confirm an order, see it though or decline it. Suffice it to say, will not order again from this restaurant. From the looks of other reviews, didn't miss out on much. Thanks for keeping me slim!", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Had a major craving for Ramen, but it was 9:30pm and most places were closing for 10. Looked for other options and found this place to which we had never been to before. Saw the pictures on help and the food look yummy. Had the Brisket Ramen and the regular pork ramen. The pork was succulent and the broth in both ramens was very flavorful. The brisket was pretty fatty- I had to take out of my bowl a small plateful of just fat with no meat and find the meat in the bottom. Now regularly I would munch on the day, but this was hard fat that was hard to chew so definitely did not want that in my body anyways. We also had the Ichiban roll which was nicely balanced with decent chunks of avocado so it was very light and refreshing as an appetizer. Service was very friendly and attentive. The place is a bit small so get there early to beat the dinner rush.", "author": "Gaby E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Wow. Food ssooo good!! The older gentleman was super friendly and was catering to my husbands brown rice needs. Food was so fresh! Wasabi made fresh, little salad was delicious. I loved my Wonton & Roasted Duck Ramen. Broth was prefect. Everything we ordered was Excellent! Will be going back to try the other dishes, looking forward to it!", "author": "Marie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "Great for delivery! So tasty. \n\nWe just had the scallop ramen, BBQ pork + roasted duck ramen, tuna sashimi, and volcano roll LOVE this place. \n\nWe got delivery from Eat24 and will definitely be ordering again.", "author": "Jen N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Ok so my fault for ordering from here .....  I thought I would give it a chance despite the bad reviews !!!  My mistake cuz the ramen broth was plain, cold, completely flavorless, and noodles are soggy, the most basic ramen we've ever tasted ... Oh and normally ramen is served with a soft boiled egg...this one was waaay overdone and by that I mean, you could see the gray in the yolk. I probably will never come back here again! Order at your own risk ... Although prices are ok   But then again it's for crappy food... As they say, you get what you pay for!", "author": "Damien F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-13", "description": "Don't. Just don't. You can pay your inexperienced friend to do equal to or better than. Servers were sweet but could not make up for the quality of food. Small restaurant - dinner tables seated amidst random fortune cookie boxes, and a pocket scooter?! I asked for Tonkotsu ramen - Broth was bouillon. Ramen noodles either canned or packaged. Instead of char siu pork, it was a Panko fried, pork cutlet (tonkatsu). Tempura batter to our appetizer too heavy and inedible. Seafood (mussels and oysters) was previously frozen and/or much less than fresh. I was afraid to try my fiancé's Godzilla roll for fear of it destroying my bowels. Tea came out of a bag and half a can of coke was $1.50. One star for the courtesy hi-chews at the end - they were a nice palate cleanser.", "author": "Juliet P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "Just skip this place. \n\nIf you read any detailed review on this page they are pretty accurate. The service is slow, which is surprising since the place is ALWAYS EMPTY. I guess that should tell you something. \n\nThe ramen is flavorless and overpriced. \n\nThe sushi is just bad. It is mealy and gelatinous tasting. Horrible mouth feel and flavors. I suspect it is unsustainably farmed in southeast asia, then frozen and shipped over. \n\nMost of the appetizers appear to be items from the freezer at Costco or Ranch99. \n\nThere is a different restaurant at this location every year. It seems like each one is worse than the one before. Maybe the location is just cursed.", "author": "Griffith P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "No idea why this place has such bad reviews. I guess some people don't go into the place, and are instead too tired and order it to go. Trust me... Go to the restaurant! There's barley anyone there (because most people order out) and they give you one on one attention. ((unless this review convinces many to go, causing a flood of people into the place, which I hope it does)) Plus, the food is much better than ordering it to go. \n\nFirst of all, the ramen here is amazing! Get the short ribs ramen, it comes with beef ribs drenched in barbecue sauce and it's in the soup! Second, the sake here is great! I recommend their unfiltered sake, but all of their drinks are good. Third, their sushi is as good as it gets!!! Next time your thinking about traveling to Japantown for their sushi, just remember there's a place in the Sunset that has just as good sushi!", "author": "Samuel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "The Menue and Food Presentatiom is a work of Art!!\nOpen late!! I wanna give 5 stars for getting me excited!!\nFood looks like picture.\nRAMEN Soups are definetly lively and unique.\nHad the pork, good soft texture.\nFriendly smiling waitress.\n\nBut I gotta be honest to my peoples so here lies the Cons...\nCigatte smoke seaping through window seat.\nIf you serve food, smoking out front does not help in any healthy manner.\n\nWait time, long.\nGood thing we werent in a hury and this was the only late night joint unique from dennys and other chains and in the neighborhood.\n\nThe Pig Appitite in me did not feel I got my Bang for the buck. Eventhough my friend coverrd the Tab.\nThank God there were other plates to snack off of.", "author": "Hung L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "When this place first opened my wife and I decided to try it.  We dined at the restaurant, it took them over an hour to serve us.  The food was decent but how could we enjoy it when we had to wait that long?\n\nMany months later our usual ramen delivery spot was swamped, so we decided to give this place another shot.  We figured that they've had some time to work out the kinks so everything should be running smoothly.  We were wrong.  The man who took our order said the food would arrive in 40 minutes.  80 minutes later the food had still not arrived.  I called back and the man said \"sorry, our driver is busy tonight, your order should be there in 15 to 30 minutes\".   Really?  Over an hour and a half to deliver ramen?  I will never order from here again.  I don't expect this place to be around for too much longer with this type of consistently bad service.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-27", "description": "1/5 Stars for Food.\n\n3/5 Stars for Service.\n\n0/5 for the guy who stands outside and smokes cigarettes and makes this place seem like a money laundering operation.\n\n(Also, I have a very strong suspicion that this place is owned and run by the same people who owned iWonton that used to be here. The same guy who stands outside and smokes cigarettes also seemed to run iWonton)\n\nAnyway, the ramen is in no way authentic ramen and seems to be much more of a Chinese noodle in origin. The broth is subpar as well. I would say the strongest points of Jika ramen is not the ramen itself, but the things that you cannot possibly mess up at a Sushi place (ie California roll, Fried Tofu (not really agedashi...).\n\nIf it's 2am, you just finished ripping a bongload, and you're not in the mood for pizza, never have eaten ramen aside from instant ramen; I could understand you going to this place and rating the food highly. \n\nNow if it's any other time of the day where there is another Japanese restaurant open... go there. Please. The other poor ratings are honest and true. I hope this place reopens as a fast food Chinese place that doesn't try so hard to be special or unique.", "author": "Will Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Friendly people, ramen is ramen, but you must try the volcano. Super smackin had me like whoa", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "I love this place. The service is good. The food is delicious. I can't believe it has such a terrible rating! The pork belly ramen will blow your mind.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-20", "description": "Service is still horrible, even more so than before, but I'm sure the management here doesn't care. \n\nJika Ramen closes at 1am. My friend and I got there at 11:50 pm and the door was locked, but there were still employees inside. After standing outside and staring at them, they finally decided to open the door and told us that we have to order everything to-go. Getting food to-go is fine, but I'd appreciate a little less rudeness next time. \n\nWhile my friend and I were looking at the menu, the waitress was talking on her phone... on speaker. Are you kidding me?\n\nOverall, service here is terrible - the waiters and waitresses have no common decency and are very rude. I only came here because I was craving Japanese food at midnight and this was the only place opened, but it's not worth it for subpar ramen. \n\nNew management, please! :)", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-15", "description": "Save yourself! Go somewhere else. Anywhere else.  I dunno if the chef called in sick so they had the delivery driver cover.... but I mean I'm pretty sure I could make better, more authentic japanese food. With a blindfold on. And I'm not Japanese.\n\nHad some sushi rolls. They were..... edible for the most part. Also had some noodles.... and they were WAAAAAAY overcooked. It was like noodle mush casserole. Looked yucky. Tasted yucky.\n\nI didn't need amazing. Was very hungry. And very tired. Okay would have been good enough. But this.... was just plain bad. BAD!", "author": "Judi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Discovered this place at my neighborhood. Jika-Ramen. Chinese Japanese food, but surprisingly good.\n\nWell, I don't expect they re good. I am just hungry and too lazy to cook. Knowing they re close and give a try.\n\nAt $12 for a bowl of spicy beef ramen. I have no complain. Good quality Sukiyaki beef, spicy miso soup base, and the ramen is cooked just right with veggie garnished.\n\nIt is not those you must try place, but will come around for a bowl of ramen noodle if you have no idea where to eat near Sunset, Ocean Beach area.", "author": "Wilson Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-08", "description": "I've never written a yelp review before but felt compelled to tell people how absolutely terrible this place was. Perhaps it was our mistake for ordering ramen for delivery rather than just getting off the couch and going to a restaurant, but my boyfriend and I were completely disgusted by the food from this place.\n\nRamen: totally flavorless. The broth was, at best, lukewarm when it arrived, and tasted like water with a hint of salt. Also, there was a substantial part of a hot dog in my ramen, which perplexed me, to say the least. The meat was a strange color. Neither of us finished even half of our ramen, and my boyfriend usually eats all of his plus some of mine.\n\nRainbow roll: ew. I wouldn't even eat a piece of it. My boyfriend tried one piece and discarded the rest. Not really sure what was going on there, but it looked totally unappetizing and apparently tasted the same. The fish was sliced extremely thin, and the avocado was already half brown.\n\nDeep fried ham and cheese: we ordered this mostly because we were curious as to what it was, and though it was strange, it was the best part of the meal (I still found it gross, however). For those who are also curious, it's a few pieces of ham with what seems to be Velveeta cheese inside, coated in bread crumbs and deep fried. My boyfriend actually sort of liked this, but it certainly did not make up for the rest of the meal. \n\nWe also ordered some sort of fried pork but didn't even open the container or touch it after trying all the other food and being so disappointed. We are not picky eaters and don't usually complain about food, but this was horrific. DO NOT ORDER.\n\nAs a final note, delivery took over an hour, so that wasn't great either. All of the food was cold, and nothing smelled or looked appealing. With so many other great options for ramen or sushi in San Francisco, do not give this place your business!", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "The Udon here is very good, with good broth, good quality of noodle, and generous potions. The boss here is very kind and gave us very prompt and excellent service.  I would come here again, especially with the fact that they open late.", "author": "James P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-22", "description": "Not sure why this place has low stars! It's a nice little neighborhood sushi restaurant and everytime I've been I have never been disappointed. Service is fast and friendly and the whole staff is incredibly friendly. The sushi bar is really nice, the food is great and it's a nice clean space but a little small.", "author": "Amber J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "This place is amazing!! I go here at least twice a week and the staff is always friendly. The prices are super low and the food always tastes fresh. \n\nA lot of the negative reviews I see are because of the language barrier, which is a bit ridiculous. I have had to repeat my order to some of the staff, but they are just trying to do their job and get the order correct. Y'all need to chill and check this place out!", "author": "Allison B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "Stopped by here on my way home to order some take out. First off, the waitress here was incredibly friendly. Although, she did not speak English very well, you could tell that she had the best intentions and was able to complete the order correctly. She even wishes us all a Happy Chinese New Year and gave us candy. We just ordered 4 sushi rolls, and to be honest they were good! Nothing too amazing or out of the ordinary. But this place is certainly a bit cheaper than other sushi spots, and they have free delivery!!! I am sure I will be using them for take-out now. They have a large variety of sushi rolls, and the tuna we got tasted fresh. I did not try the ramen, so I can not comment on it, but the rolls were not bad at all. Maybe I just lucked out compared to some of these other yelp reviews :) I will try again for sure.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "I don't know how this place isn't packed... Oh yeah, location.  People don't seem to know or care that it's there.  Lucky for us, we were given exceptional service and recommendations on a Saturday night.  \nThe grilled pork ramen is a must try, with the tastiest noodles and specialty mushrooms in a light, almost creamy broth (no diary). \nTheir sushi selection is super fresh!  I ordered the hamachi and scallops handrolls and only wanted more.  It appears to be run by women which was a lovely addition to my experience. \n\nI'm surprised this place hasn't gotten better reviews, but I know I will be back over and over again.  Thanks for serving such high quality food on a quiet street in the outer sunset!", "author": "Sarah S N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "Let me tell you a little thing or two about Jika Ramen. I ordered from Grub Hub way back in maybe February, but I have saved this in Safari ever since, because I had to warn all you Yelpers about my horrid experience. It not only took longer than expected, it was completely awful. The worst take-out I have had in my year of living in San Francisco. First thing's first, the ramen I ordered was a plastic box of noodles...without the soup. There was no soup in the bag! My sushi? It wasn't even the right roll I ordered. And the spam musubi? Oh my goodness gracious. Not only was it a huge slice (probably as thick as my finger!), it wasn't really cooked. I mean I understand it's spam, but it feels like it was cut right from the can. I am utterly displeased and disgusted. Never again. I wish I could give it 0 stars. *mic drop*", "author": "Emily N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Mushroom tofu Raman was excellent, delivery was pretty fast ! \n\nPrice was great, it was spicy like I asked ! \n\nMy friend also enjoyed her chicken Raman. \n\nDef a repeat ! \n\nMy experience was great !", "author": "Ortiz N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "When you advertise your hours of business you might want to be OPEN when you say you are.  I just travelled a long frustrating distance only to find the staff hanging out, but not open even though the door was open and YELP said OPEN.  Lies= FAIL", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-09", "description": "Went here with my brother and dad . When we first arrived I noticed it was completely empty at around 1:00pm. The waitress and the chef were talking about us whether is we could speak Chinese or not but we could  . They gave some edamame. We order pork belly ramen , and beef stew ramen. I really liked the broth, and plus the bowl was a decent size. I personally thought the noodles were a bit too soggy/soft(but my brother liked it) . The beef stew/tendon were hard to chew, but it was still tasty. Some price may vary due to what you get . It's pretty close by to my house .", "author": "Joyce C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "I ordered through Eat24 and the ramen we ordered was really good for delivery. The delivery took 10 more minutes than promised but overall had a good experience.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-14", "description": "The food here isn't terrible, but isn't good, either. My dining experience was somewhat bizarre, though, by my standards. I ordered toro sushi and they brought me some type of white fish that had been braised with a blow torch. I have no idea what it was, but I do know that it was not consistent with consensus reality's definition of toro. Maybe I need to make sure I'm not experiencing the Mandela effect by going somewhere for toro today! I also ordered a salmon skin roll and the salmon skin was tempura battered. I didn't think to ask and only realized after I'd taken a couple of bites because it wasn't something I was expecting. I have gluten sensitivity, so this is a very bad thing for me- I woke up in the middle of the night in excruciating pain, nausea this morning, and I'll have tummy troubles for the next couple of days. Maybe TMI, but beware if you suffer from similar problems. Should've known better than not to check, but to me it's kind of like finding bee larvae in salad nicoise. I would overall recommend against this place- you might not get the variety, but you'd certainly get similar quality, going to your local grocery store. Not to mention, one of the best (IMHO) sushi restaurants in the city is just a couple of blocks away. I only went to Jika because the other place was closed as they always are on Mondays. FYI, I've had ramen at Jika before my body decided gluten is evil, and it was no better than the sushi.", "author": "Rd J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-28", "description": "Pretty good delivery time (under 60mins), tastes good, nice spread of ramen toppings and fixings. Portions are okay. I wish the tempura had a bit more batter for vegetable ones, shrimps were tasty.\n\nRamen broth is a little too salty even when hot.\n\nWho are these weirdos ordering sushi AT A RAMEN HOUSE LOL. Of course they won't be up to par with dedicated sushi places...", "author": "Clare Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Really good late night sushi delivery with decent veggie options.", "author": "Tommy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "I always wondered why this place had such low ratings...after tonight I know. The sushi here is not bad-but nothing can excuse the poor service I experienced tonight. When I came in there were no customers and the sushi chefs behind the counter looked at me as if I was some kind of alien. No hello... Nothing. I waited to be seated and was greeted by the hostess, but it wasn't a warm hello at all. It was kind of I seated you now get out of my face type of hello. The last straw for me was when my waitress brought me the check and I said thank you and smiled, she freaking rolled her eyes at me. Sad I was going to give this place another chance, but after tonight I am never stepping foot in this place again! Hey waitress, here is a TIP for you, don't roll your eyes when people are being polite to you.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-19", "description": "We've tried to go twice now during the hours published on their website: 10am-2am, 7da. We were turned away the first time on a Friday at 11 pm. 'We're closed,' the two bored girls working said without smiles. There were four tables of people eating their dinners.  We tried again today at 11:45 am, and all the lights were off. There was no sign indicating why. Lame! Each time, our hungry bellies were saved by the great staff at Tazaki a block away.", "author": "Mc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Astounded by the low reviews. I order from Jika Ramen about once a week, and they have always surpassed my expectations. They have consistently delivered my orders within 30 minutes despite the eat24 app displaying a 1 hour wait time (presumably since I live on the other end of the city). Their portions are awesome - huge juicy sashimi pieces in the chirashi bowl and the 20 piece sashimi platter. They have always accommodated my special requests as well. Oh, plus, their prices are the lowest on eat24 for the exact same chirashi bowl and sashimi platter found at other restaurants. Originally I thought I had found the cheapest from Kaka Udon (Also owns Oolong noodles I believe), but Jika beats them all. Compare for yourself!", "author": "Anna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-07", "description": "Ugh.....wanted to like this place since it's so close to my house, but the ramen is sooooo mediocre. Maybe I'm a ramen snob, but theirs did nothing for me. I think good Ramen is an artform and needs to be made by people who see it as such.", "author": "Colin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "I WOULD GIVE 0 STAR. Terrible delivery customer service. Would never come back and do not recommend. waited for almost 3 hours, and they canceled the order", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "This place is awesome.  Small little restaurant hidden in Sunset district and without the crowd like many other restaurants nearby.  The best of all...it's their outstanding customer service.  The waitress is extremely nice and never pressure you into ordering things you don't need and very willing to help and provide excellent advices.  I strongly recommend this place to fellow yelpers.", "author": "Danny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "Similar to another review about tardiness of food delivery, but I never received the food and their phone number doesn't work. I'm not sure this is a real restaurant or not.", "author": "Rory F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-27", "description": "I'll cut to the chase; I found a staple in one of the tempura vegetables in the tempura appetizer. It must have made its way into the batter. I was chewing the food then I bit into this hard thing. \"Great...\" I thought. I pulled it out and placed it on a plate. As a side note, the shrimp tempura tasted a bit funky, like it was old. When the waitress returned with my Francisco roll, I promptly pointed it out. She apologized, but they didn't bother to comp us in any way. Unfortunately, this is typical of restaurants when you find something in the food, but it's unacceptable. We're not talking about bringing out the wrong order; we're talking about a health hazard. Anyway, my sushi roll was fine, nothing wrong with it (though I was paranoid and inspected the pieces before each bite). My boyfriend said the mushroom and tofu ramen was ok. He didn't like that the noodles were mushy but maybe they were supposed to be that way? We're not ramen experts...\n\nWell, nice service, food came out fast, but yeah, super put off by the staple.", "author": "Opal L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "I wanted to like this place so badly. Pretty much what other reviews have said though. Cold, crappy food that arrived late, a seriously lazy delivery driver, and a pretty bad experience. It couldn't be more obvious they just don't care.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-02", "description": "I saw their place menus on my door so thought I would give them a try. But very disappointed. This is the worst ramen I've tasted ever. The noodle soup tastes are not authentic. \n\nI have been to another place called Ramen Yamadaya in Japantown. This restanrant is  running by Japanese owner. And it tasted very authentic and traditional. It's as the same as the ramen I have tried in Japan. Compare with Ramen Yamadaya, Jika Ramen is nothing. It is not made by real pork soup but actually some powder. It's artificial and unhealthy.", "author": "Jessy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-25", "description": "the driver was actually yelling at me!  \n\nAnd the refund i requested was the only about the tip for him.  not the food, which btw is mediocre.  Yet, they refused even a partial refund.  \n\nCertainly never order from them again. \n\nTip was prepaid because i used GrubHub .  they at least tried to help, but i hope they drop this place.", "author": "V J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "Nothing good, mediocre. I ordered delivery since I loved the Chinese joint that used to occupy the storefront, hoping that their chow mein would still be excellent. Not the case. not the standard chow mein noodles, which is not bad per se, just unexpected. what WAS bad though, was the fact that the skin of the onion made it into the food. California rolls were decent, but miso/salad/teriyaki chicken were not worth the price. I would order again if nothing else were open.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "Absolutely if you want sushi at mid night, this is one of the place you can order delivery.  I am sashimi fan and this is cheaper than order restaurant, especially sashimi.  BUT!!!!  Sashimi is very thin and not fresh at all.   Although it is just 23 dollar for 20 pcs assorted sashimi, I don't think it worth with it.  DO NOT check the sashimi photo that other people posted.  You will know it is totally different thing.  Or maybe it is just for me, shouldn't crave with sashimi in the afternoon and midnight.", "author": "Tissuebabee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Husband and I thought we'd try out this local ramen restaurant! Pleasantly surprised. Great food and wonderful friendly staff. Food, fish is fresh and tasty.  And I have to say that the prices are reasonable. I have not tried their delivery, but I have picked up food from here, still awesome and tasty. Three cheers for this place!!!", "author": "Caring C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Their delivery is great. Our food has been consistently awesome every time we've ordered from here. The fish has always been fresh and tasty and the food is great for the price. Oh! They put enoki mushrooms in the miso! \n\nWhen I sat down and ate there, my experience wasn't quite as good. I ordered a hot sake, two rolls and three nigiri. I was a little concerned because my waitress didn't recognize any of the sushi I ordered, and I had to point to each thing in the menu. About ten minutes later she came back with one roll and one nigiri packaged to go, and my check. I tried to ask her about the hot sake and the rest of my order, and she just said yes and pointed to my order of ebi. I gave up and went home. Not a big deal, but I'm glad I wasn't on a date. \n\nI will definitely keep ordering delivery from here, but I'm not sure I'll go back for a sit down.", "author": "Fiona F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-15", "description": "Horrible! Bad food, terrible service. Took two hours to get our food and when it came it was inedible.  I've made better raman at home from a package. Not one thing we got tasted good. We called the restaurant and told them we were not satisfied and they were rude to us then hung up abruptly. We told grub hub and they called five times and couldn't get to talk to a manager. I would never order from this place again and I recommend that you don't waste your money. You will NOT be happy. It's not cheap and completely inedible. We wasted our time and had to have sandwiches for dinner.  Be warned they have bad reviews for a reason, don't waste your money!", "author": "Skye M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-31", "description": "Is horrible,  their website said they are open daily, but that is not true. I went there today which is a Thursday at 1:30 pm and they are actually closed.", "author": "Sally C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "They're open late and they have great sushi. I got a Philadelphia hand roll and it was delicious. Their servers are very attentive and the prices are very reasonable. Would recommend to anyone looking for cheap, quick sushi fix!", "author": "Sam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Overall pretty tasty. Their food is good, and despite some initial slow service I've had good luck ordering for pickup. Go there if you live nearby.", "author": "Dietrich D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Friendly service, accomodating for my 2 year old, free edamame, tasty noodles and soup!", "author": "waiming B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-15", "description": "So sad to give this place only two stars, yet they just open up. The food was ok, but the server was very slow, did not paid much attention to us. The other server or helper was very rude. He brought to our table one of our dish we have ordered with such an attitude that shocked us. Then we spend probably 15 minutes if waiting to make our server charged us and when he appear to the table to grab our credit card, he was on his cell which is really Rudy to the guest-us! The place look like a old place that was in business over 10 years, I wish they updated and make sure the place is clean and NO FLYES flying around. So sad that this \"new\" place is dead to us. I would not recommend this place to my friends!!!", "author": "Yana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "The waitress was pretty. The delivery man was handsome. The foods were fresh. I like this place.", "author": "Justin Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-01", "description": "Nobody should come here! My boyfriend and I came here a few days ago for dinner since he was craving for Ramen. We decided to come here since it took us forever to find parking by Genki Ramen in Geary and it was way easier by this place. I ordered the grilled pork and stir fry veggies and he ordered the shrimp tempura ramen. My boyfriend said that the ramen wasn't bad and my dish was pretty decent as well however a bit on the oily side. On that very day after we left, my boyfriend had to go to the bathroom instantly and I thought it was just a normal thing. The next day he was hit with food poisoning. He had the bad case of diarrhea and even noticed blood in his stool after throwing up twice. The whole day he wouldn't stop going to the bathroom. I would not recommend this place and should have never came here when I saw they didn't have such good ratings already. If nobody wants to have to go to the ER, I would skip this place.", "author": "Teresa W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-09", "description": "food: 1/5\nservice: 3/5\n\nCame here on a weeknight with my friend and the place was full but not packed. Many people actually do take out here. The food is very bland and not made well here. I ordered the combo with pork katsu and unagi rice. The pork katsu was soo tough and dry, it was deifinitely over cooked. Also the unagi rice is not slices of unagi over white rice, it is chinese fried rice with unagi bits in it. Did not taste good. My friend ordered an egg side dish which was supposed to be soft boiled. When it came out, the egg was not seasoned at all and was hardboiled rock solid. They don't even know how to boil eggs correctly.  \n\nService was good but slow. They are definitely understaffed. The kitchen is also understaffed because it took everyone at least 30 minutes to get their food. I think this place really tries to be good with the nice menus and decor. But they just don't know how to run a restaurant business. 2 stars because they really try but the skill is just not there.", "author": "Cecile S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "For late night delivery Sushi, this place is damn fine. Miso soup was great.  Used real crab in California rolls!!!!!!!!!!!!!!!!!!", "author": "Adam G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-01", "description": "Arrived 6:15PM to an empty restaurant. My review: Zero. Dreadful. Avoid. Details: I ordered Baked Oysters from the appetizer section five minutes after we sat down. Ten minutes later I ordered Hot Spicy Vegetarian Kimchee Ramen (kimchi misspelled on their menu) and my wife ordered Hokkaido Scallops Ramen. My ramen arrived in 15 minutes and I thought I smelled dirty mop, I've mopped a lot of floors, I know what it smells like. I picked up my fork and took a few bites of the warm food and realized that there was a film of something, like grease, on the underside of the fork. I put the folk down and continued with chop sticks. My wife gave me her fork after saying it was dirty too. My ramen was tasteless. The \"kimchee\", of course, had some spice. There were a few under-cooked broccoli florets, unevenly cut cubes of tofu and some other stuff. The liquid had no flavor, it wasn't salted or anything else added. I stopped eating and told my wife the Baked Oysters were probably not coming and that's good because there is \"no way that four baked oysters ordered for appetizer should take 30+ minutes\". A few minutes later my wife said \"oysters are coming\". I did not have the guts to take a picture and I certainly did not try one. I almost did but I couldn't do it. In hindsight the waitress told me the story of the new Chinese owners and added \"Sushi was easy to make, that's why they bought a Japanese restaurant.\" My reply was \"That's really interesting.\" I should have walked out then. Normally I would go back again and try something else but I have a bad taste in my mouth so I won't do it. There are better restaurants around the corner on Judah, what a pity.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "It's really good for the cheaper pricing. Their miso soup is the best, they put mushrooms and a bunch of tofu. It's open late and delivers so it's just what I need somethimes when all the other restaurants are closed. Their ramen is okay. Over all I enjoy their food.", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "We went to this place despite pretty bad prior reviews and I am glad we did.  It did not disappoint.  Everything we ordered was very tasty and fresh including raw fish.", "author": "Yuliya M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-14", "description": "First time order for delivery gave them my credit card to charge the amount they asked for.  They called me back said they under charged me and needed to run my credit card again. Okay fine! I gave them another chance today and they did the same thing. If you asked them amount over the phone, make sure you will have extra money with you cuz it seems like the price goes up all the time.", "author": "W T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "Pretty good food, but they make you wait too long for it. My friends and I came here and waited 45 minutes (there were two other tables in the entire place) and not only did they bring out one person's food before everyone else's, but my chicken was still raw and took them another 30 minutes to cook it fully. The dude who works there was super rude to me for sending it back, but I prefer to live my life salmonella-free. Sorry, bro. Everyone else was nice but it just took too long. I shouldn't have to wait that long to get some ramen and skewers.", "author": "Molly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "The ramen here was really tasty. We also had a couple sushi rolls and they were good too. It was also super cheap (by SF standards). The service was a little funky, maybe a language barrier, but we were the only ones in there so it was all good. Happy to have this place down the street.", "author": "J.D. E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-10", "description": "Would give 0 stars if I could. I was in search of a late night delivery, and saw on grub hub that they deliver until 2 AM. I ordered through grub hub and got my confirmation email quoting me an hour. 2 hours later, still no food. I called them and the rude man on the phone not only told me they never received my order, but also hung up on me...twice. What a waste of my time and now it's 1 AM and I'm still without food. Don't bother with this place. If I get charged for the meal I didn't receive it will be a whole other story.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "I've ordered take-out from here a couple of times and have been completely satisfied with the price and quality of food. It's also open super late which is awesome.", "author": "Beth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "We were nervous coming in due to lack of reviews and low rating. It's in walking distance and I craved sushi so... We braved it!  Miso was yummy and generous portion and full of yummy mushrooms and seaweed. Ikura was yum. Hamachi too. California roll was quite nice, tobiko tasty, rice was fluffy!!!  The hand rolls are hearty-lots of rice and I liked their wasabi and ginger. Overall quite good. We'll be back!!!", "author": "Tamara C."}
