{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Consistently on point!! We order takeout here just about weekly, and it's literally always good and fresh. Actually just finished a pizza and salad. We always order the goat cheese salad and a pepperoni pizza. \n\nThe goat cheese salad used to come with blood oranges. They were a perfect touch! Not sure if it's a seasonal thing, but lately the menu changed and now it's heirlooms and pine nuts. Still a beautiful salad, but we'd be happy to have the blood oranges back :). The toast that comes with the salad is highly recommended. I started ordering this years ago, and they've only improved. It took me a few orders to realize there was no goat cheese on the salad, and that it's in the toast lol. \n\nAnother thing they used to make that was amazing was this broccoli, Parmesan, and prosciutto dish I think it was? Super perfect. It's missed. \n\nReally love the little cups of shredded Parmesan instead of the packets. It's just a simple thing they do, but it helps make the place as awesome as it is.\n\nHighly recommend this spot :). They're very fast and friendly too.", "author": "Kathryn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Solid pizza. I got the pepperoni, sausage, and mushroom pizza. I was a little surprised that they used mushroom heads/stems instead of just sliced mushrooms like you commonly see on pizza. It was pretty good, just seemed a little different. The overall taste and quality of the pizza was great tho. It's a good sized pizza for 2-3 people, but if you got more than that I'd suggest getting another pizza too. I also got there burrata which was great too. \n\nI like the place itself too. It's a quiet little local spot. Good date spot or just a chill place to go with a friend.", "author": "Renato S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "Wow what???  This place has some really solid pizza. The Caprese salad was a perfectly satisfying amount which is usually not the case at other restaurants. \nA small restaurant, clean bathrooms. Good vibes. I'd go back.", "author": "Nora N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Broccolini with olive oil, garlic, diced Framani pancetta, and topped with Mussini balsamic & Pecorino Romano; \nSpecialty pizza with pancetta, humboldt fog goat cheese, sun dried tomatoes, & mozzarella cheese", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "It's more like 3.5.\n\nOn a Friday night at 7:45pm there were surprisingly few people there.  \n\nThe Caprese Salad was quite nice. Heirloom tomatoes were particularly fresh. Sort of hard to eat because the pieces were so big.\n\nWe got 3 pizzas, one make your own, a #4 and a #5. The make your own option that we got was my favorite - with pepperoni, basil, and Humboldt fog cheese. I do really appreciate that they had such a fantastic cheese as a topping option.  \n\n3 pizzas was plenty to feed 5 people.  \n\nThe larger seating in the back is cool idea - couches and pillows with low tables - but in practice it was kinda awkward because the tables were a bit too far from the sofas and our group was kinda in a line....", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Cute, cozy bar with delicious thin crust pizzas and heaping salads. A great place to come for a casual date or group get together - there's seating in the back for larger groups.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "My husband and I came here after working out nearby. It was empty and oh-so-quiet. Slow Jazz in the background and the tv was showing the basketball game. We had the huckleberry cider which was good. We ordered the kale leek goat cheese pizza which was delicious! 2 ciders and 1 pizza was enough for the 2 of us. We finished the entire pizza which was about medium size. We got fresh Parmesan for our pizza topping and crushed pepper to top out pizza. Will come back and try the raspberry lambic cheesecake next time.\n\nCame here again 1/2018 and it's not full on a Saturday afternoon. The butternut squash basil vegetarian pizza was delicious. The front wood beer is sweet and delicious, a perfect pairing for the pizza. It's a hidden pizza place but oh so delicious!", "author": "Crys L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Secret (okay maybe not so secret) delicious pizza spot in SF! Ordered for delivery a while back and was pleasantly surprised. The small pizzetta is the perfect size for two or one hungry gal to have plenty of leftovers. The ingredients tasted fresh and I loved how they baked the pizza a little longer so it was nice and crisp (ask for extra bake time if you like pizza well done).", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Love this spot. They are always so helpful and knows exactly what I want. I work next door, they even remember my cheese allergies and are pretty quick esp when I'm on the run. Also a perfect post training session for yummy pizza and beers, very chill ambience.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Kezar Pizzetta isn't my favorite pizza place in San Francisco but it's pretty darn good. If you're looking for something simple and fast, go for an 8\" Personal Pizzetta with Housemade Sausage and Fresh Garlic. I typically order to-go from here but every once in a while, I like to actually stop in and dine here. It's super casual and almost never busy.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "A locals' favorite hidden secret. I've been here countless times over the last couple years. \n\nHigh quality pizza ingredients make for simple and delicious selections. Salads and appetizers are the same -- simple but quality and delicious and not your typical \"pizza restaurant\" style as the seem much more New American in selection. \n\nAlways a great selection of beers on tap from lesser known but reputable breweries across a spectrum of styles. Someone knows how to pick 'em\n\nHappy hour is a phenomenal deal on single serving pizzas and discounted beer and wine. It also attracts a lot of families with young children. It's a small place and can get busy quickly. Quieter weekdays but starts to get busier on Thur. No happy hour Sat or Sun. \n\nYou can't go wrong if you're in the mood for pizza.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "Ordered on Eat24 to deliver to the house. The pics looked great, but I've had better pizza and wings.\n\nUpdate: stopped in to eat with a friend after a workout(judge me, I plead guilty)\n\nThey had the game on, and service was decent. The waitress wasn't as knowledgeable describing beer options, but was attentive and helpful overall. Again, the pizza was ok, but too messy. The crust just couldn't hold the toppings.", "author": "Rafael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "I fell in love with a pizza (again) that I found on Yelp (again). This place is the reason I spend so much money on Soul Cycle and Barry's Bootcamp - I'm just a mom trying to break even over here! \n\nAll their pizza is amazing but the one made with Humboldt Fog cheese will always hold a special place in my heart. I'm in love and I'm not afraid to show it! \n\nThis place also makes salads and side veggies that will turn any anti-veggie human into a veggie LOVER. I have dreams of marrying the broccolini that's covered in parm, pancetta and olive oil. \n\nBTW, PSA for all restaurants....if you're on Eat24 I will love you forever, and ever. For rich or for poorer. Eat24 has changed it up in the food delivery world and I'm forever grateful! We order from them often using Eat24 and they arrive before I can finish my first glass of white wine! \n\nThank you, Kezar! I love you like you're one of the Crawfords over here....", "author": "Alison C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "#confession You had me at pirate chick with glasses. All I know is the melted mozzGEMrella ain't the only thang that's hawt y'all. ;p But I showed up on a non-pirate day and had to have non-pirate lunch. :(\n\n(^_^) #6 SPECIALTY PIZZETTA $20\nBc pancetta x gyoloat cheese.\nOiiillllyyyyy but I liked it #bunbsaid sippin on dat oil.\n\n(^_^) ICED TEA $2.5\nDuh.\n\n(-_^) (BUFFALO) WINGS $10\nTiny tiny tiny but tasted good. #thatswhatshesaid\nShame on y'all for making me eat vegetables.\n\nFrom bare table to full order in under 20 mins like dayym. Even though bar-ish places aren't my fave environment, this was chill af with polite service. I just need a little more arrrrrrr in this piece.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I've been going to Pizetta for many years-- it's a gem in the city that I think more than the locals have finally started to discover. Why?\n1. The back area is something special. I've had many friend gatherings/reunions there, spent literally dozens of hours working with design teams on special projects, and watched a lot of sports games (special memories of the giants 14' run and then the warriors right after back there). It can be reserved with at least 6 people.\n2. The food is authentic and always good. Ingredients are fresh and the pizza menu changes with the seasons. Basim makes the mozzarella early in the morning, sometimes burning his hands (maybe there's an easier way to make it but if the quality would suffer, he probably wouldn't do it). He makes the sausage too... it really really good but no one wants to know how sausage is made...\n3. Beer connoisseurs will be impressed and even schooled. Ask about how the nitro and CO2 taps work, or the crazy world of craft beer distribution and you'll get great stories from Basim. It's the best revolving tap I've come across in SF.\n4. It's a community place where locals can go and feel comfortable. For example, you'll see random people coming in on Wednesdays, go to a cooler in the back, take a bag of fish out of it and leave. Why is a whole story that reinforces this spot as part of a community. \n\nVery grateful for Kezar Pizetta-- it makes the neighborhood a nicer place.", "author": "Noah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "This is one of my favorite pizza places in the city.\n\nI like the crust, which is especially crispy and this place has very fresh ingredients. Anything with prosciutto, burrata cheese, or basil has me reeled in. As such, my favorite is their specialty pizzeta #1 with prosciutto di parma, tomatoes, basil, house made mozzarella, and cheese and tomato sauce. I am addicted to prosciutto these days. But if you are not a meat eater, there are plenty of delicious veggie options! The best thing is that they let you customize your pizzetta. This place is perfect for a quick bite right next to Golden Gate park or if you happen to be at UCSF medical center. Pizza is great any time of the day, breakfast, lunch, or dinner. The location is convenient if you can get lucky with parking around Golden Gate park. You don't have to go all the way to Little Italy to get some Italian style pizza and antipasti.\n\nThey have a happy hour with some of the simpler pizzas for a cheaper price. It is pretty busy during happy hours, but turnaround time is pretty fast. The workers there are especially friendly.", "author": "Jaime F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Great pizza joint with a very neighborhood feel.  The ambiance is not hipster at all, but the specialty pizzas are sophisticated combos.  We had butternut squash with fried sage and goat cheese. Hubby noted that the anchovies on the Caesar salad were high quality.", "author": "Mirba E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-09", "description": "I ordered the #1 Special Pizza and the Caprese Salad for delivery.  The food got here really fast!! But...The pizza unfortunately looks like it got damaged during transport... All the cheese and prosciutto slid to one side, which was pretty sad.  I think it would have been good if it weren't for that...\n\nThe Caprese salad did not look like the picture at all haha -- it didn't look great, but it actually tasted pretty good. \n\nUnfortunately, not sure if I will order again..", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Love this neighborhood pizza joint.  Finished working out with my wife at Keezar stadium, and came here for a delicious post workout meal.  The butternut squash specialty pizza with a beer hit the spot.", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "I love this place. A consistently great pizza with friendly people and great selection of beers. Generally not crowded. Three flat screens for sports watching and a back area with sofas for a medium size group. Fresh ingredients always. Sooo good.", "author": "Cameron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Seriously delicious food. I had the #6 Pizza and it was fresh. The ambiance was great there and the staff was so friendly. I would go back again.", "author": "Irene P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "This place doesn't have a sign - it's sign on the window is simply \"KP\" just FYI.\n\nFor lunch time, we were only one or the two groups in there.\nThe Max. occupancy of this place is 50 people & it is quite small but cozy.\nThey have an area in the back where there is a TV to watch the games - FYI.\nThey also have a TV towards the front.\n\nYou get your own water at the table near the aquarium - it's iced water.\nThe menu is already on the table once you are seated.\n\nThe menu isn't big by any means. I was craving pasta but only found that there was pizza & salads with some appetizer options.\nSorta sad about that but it's my fault for not reading the menu prior to stopping there.\n\nI ordered/customized the 8' personal pizza with spinach & tomato - so yummy! I finished it all. It was a good amount of food.\nThe pizza was BOMB though - totally recommend it.\n\nThey give you your bill at the table & collect it so no need to go up to the cashiers.\n\nThey were super friendly & the food was delicious - I recommend but look at the menu first to make sure they have what you're craving at the moment.", "author": "Camille C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "To be fair, I haven't been to the restaurant but have ordered 10+ time on UberEATS. This pizza is better than Delfina and the sides are amazing. I have only had one not great salad (antipasti). Sometimes I think I should go eat there, but then nahhh. Order!", "author": "S M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "My two teenagers and I were at Golden Gate Park and decided we were starving.  We looked for a pizza place on yelp and found this place was only a few blocks away.  It was a little difficult to find, but once we got there the service was excellent and as it was happy hour, our pizzetas were only $6 a piece.  There was also a handy outlet for us to charge our cellphones while we were there.  The pizza was tasty and were left full and happy for less than $20 (plus tip) for 3 of us.", "author": "Sandra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "A lazy holiday break brought me to Kezar Pizzetta. I wanted to try a new place for delivery, but the delivery fee has always deterred me. (They charge $2 for delivery.) Last week, I sucked it up and ordered through Eat24.\n\n*Broccolini ($8): olive oil, garlic with diced framani pancetta and topped with mussini balsamic and pecorino romano\nThe broccolini was good. Cooked nicely to where there was still some crunch. It was a little tough though as some were hard to cut with a knife.\n\n8\" 2 toppings pizzetta ($7.99): your choice of 2 toppings\n*Fresh garlic and Wild mushrooms: The garlic wasn't fully cooked so the flavor was too strong. Such a shame since I loved the mushrooms.\n*Fresh basil and Burrata cheese: The basil and burrata suffered from the pizza oven. The heat took away from the flavors and of both ingredients.\n*House made basil pesto and Mary's organic chicken breast (no red sauce): I could barely taste the pesto which was a bummer. As a result, there was nothing to complement the chicken.\n*New York sausage and Organic applegate pepperoni: Yum! The pepperoni was super tasty and so was the sausage.\n\nAnd yes, I ordered 4 pizzettas for myself! I figured they would be small so I could polish off like two of them in one seating right? Wrong! I actually made four meals out of this and the roommate finished the rest. Not bad at $7.99 each. And you know how I love variety. Great pizza spot when I can't make up my mind. I can order a bunch of pizzettas!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "I've started to work my way through these delicious pizzas. Both the Pepperoni Sausage Pizzetta and Pancetta Pizzetta were full of savory flavor. The slices were tasty enough that I found myself popping the fallen toppings off my plate and into my mouth. I look forward to trying all the menu selections eventually and updating this review.", "author": "Mike Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "We had a lovely experience eating here. Pizzas are tasty. Beer and wine very good. Happy hour prices amazing! Very friendly staff. We will definitely go again! It is a very small place. We were so pleasantly surprised! They have sports on tvs. Nice to find another \"local\" place that is kid and adult friendly", "author": "Simone H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "I get the same specialty pizza every time and really like it. They use good ingredients too. It's one of my top two choices I have found in SF so far.", "author": "Yrev T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Came here for dinner with my hubby and good friend while visiting town, and SO GLAD my friend recommended this place.\n\nIt wasn't too crowded, and was located in a suburban neighborhood, where parking was limited, but not impossible. \n\nThey have a pretty decent selection of wines (about 6 reds & 6 whites) and beer, and everything on the menu sounded amazing if you're a lover of pizza and Californian fare. \n\nWe got the broccolini app--a delicious and somewhat sinful veggie dish with pancetta, romano cheese, and balsamic glaze--highly recommended.\n\nWe ordered the cesar salad to go with the pizzetta #2--kale, spinach, leeks, and humboldt fog goat cheese. It was perfection. Balanced, not too heavy, and flavorful. If you really wanted meat on it, the prosciutto add-on would probably be delicious, but it really didn't need it. The crust was perfect: crispy,  substantial enough to hold up all the toppings, a little thick around the edges, but airy and not overly dense. It tasted like an authentic, homemade, leavened crust. \n\nIt was the perfect amount of food for 3, and SO yummy. Go!!!", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Stumbled upon this place while visiting the city with my family. Once we walked in the door our mouths starting watering. We really only had time for a quick bite so we went with a couple of salads (goat cheese and the Caesar). Both were super tasty and enough to split between two people. We also ordered an 8\" \"margherita\" style pizza that was cooked perfectly. I know margherita pizzas are pretty basic, but the flavors on the pizza were incredible. And the basil was super fresh. We are already planning on coming back to try this place again. Great selection of craft beers, too.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "The pizza is delicious! They also usually have a pretty good beer selection. The ambiance is just ok which is why I gave it 4 stars. But everything else is good.", "author": "Allie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "I am a neighborhood local and have been to Kezar Pizzetta many times. They put way more attention into pizza presentation and artisan touches than your typical pizzeria. This is the closest pizza I've had to those delightfully fresh and exotic 4 cheese pizzas in France (exotic to Miss American girl anyway). \n\nThe salamis are my favorite toppings and I've learned to balance their saltiness with more benign ingredients. The typically available cheese topping selections, burrata, humbolt fog, etc. are delicious additions to the pizzas. To avoid combo mistakes, you can't go wrong with the fixed topping selections that change seasonally. \n\nThe place itself is casual and comfortable. I've come here often to watch Giants and Warriors games, and can usually find a seat. Service takes longer than at other pizza places, and I'm guessing that's because of the higher quality pizza.\n\nThe beer selection is really fun and changes every week or so. It was so great to have a beer week participating venue around the corner! The happy hour wine deal is good too, and I've enjoyed most of the wines I've tried there.\n\nIt's hard for me to say anything about the service as a whole because I know the servers individually at this point. I'll settle for saying they are all good people! \n\nMy primary tip is related to delivery and leftover reheating. There are so many fresh, water bearing ingredients that if you don't eat the pizza right out of the oven it can get soggy. Heat it up in the oven to solve this challenge as best you can. I use a tray with wide slots that exposes the pizza crust to heat on the first oven rack. I put tin foil on the 2nd rack to catch any drips.", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Amazing pizza! Came here on a Monday at 4:10, place was empty. ( just how I wanted it) happy wine $5. Broccolini was so flavorful, pears wrapped with Gorgonzola and Brie w/ prochuitto, beer menu is excellent. I'm a pizza fanatic, I was telling my husband prior to coming here that I was tired of pizza and I didn't want any more pizza. This pizza is a napoletana style pizza which I can I never get tired of. As I was coming back for  the restroom I saw a heaping plate with a generous amount of something and asked what it was, it was their appetizer Eggplant Parmesana looked scrumptious!!!! \n\nThis place is a hidden gem, don't be fooled by outside appearance. Food is amazing.", "author": "Roxanne O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-24", "description": "I had a terrible delivery experience with Kezar on a Saturday night. The food took nearly two hours to arrive, and when it finally did, it looked pathetic. Everything was luke warm or cold. The wings were tiny; as if they were the last 6 from the bottom of the 10 lb freezer bag they came from. Clearly the rejects of the litter. The toppings had slid off of the 8\" pizza. The pizza itself looked and tasted like one of those microwaveables you can buy for 99 cents at the market, or overpay for at the ballpark. No good.\n\nI'm not one to write negative reviews, but this was an embarrassing effort by the restaurant. Perhaps Kezar is better for dining in, but I won't be ordering delivery from them again.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "I was in the neighbourhood craving pizza and saw that Kezar Pizzetta has just recently opened. \n\nFor a crispy, delicious \"12 pizza, starting at $12, I recommend this place. \n\nI spoke with Jaimel who was working at the time and he suggested to get a 2-topping pizzetta which came out to $18. \n\nThe organic applegate pepperoni and portabello mushroom pizzetta is what I ordered and it was definitely worth the price. \n\nI was already too full to check out the dessert menu but they serve a variety of gelatos; I'll be sure to try some the next time I visit.\n\nAlso, take full advantage of their $10 for $20 Yelp coupon available; definitely worth looking into - 07/31/13", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "I absolutely love this place . The owner is always working and is a complete gentleman. The pizza is amazing as are the prices. I highly recommend this hidden little gem", "author": "Ciaran M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "I have been ordering from here for a few Months now and I am a fan!  Great Pizza with some really neat combinations.  Delivery always arrives pretty fast and the Pizza is Hot (Key).   If you need some delivery pizza this is a great place.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Hands down one of my favorite places for pizza in SF. I drove from SJ just to make it for lunch. The pizza is so fresh and KP is cozy, perfect for family. Brought my parents here to sample this gem. We ate before coming here and devoured the pizza. Highly recommend the specialty!", "author": "Viviane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Love this place...\n\nSince moving to Twin Peaks three years ago, I've tried Pasquale's, Paxti's, Round Table and they all okay... Nothing special or out of the ordinary except maybe Pasquale's. Tried Kezar the first time a few weeks ago and now hook on their pizza. Ordered the #4 and #5 Speciality Pizza and it was off the chain. I seriously think it's one of the best pizzas in SF.. Their delivery turnaround is superb.. Always get my pizzas delivered within 25 mins or so to my door step.. The broccolinni and Caprese Salad is also off the chain... This now my once a week routine", "author": "Alexei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Stopped by here with some colleagues on a whim after an evening meeting and really enjoyed their pizza! Fantastic service as well.", "author": "Maryam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Long over due review... Where do I start. Hands down the best pizza in San Francisco. What really makes this spot stand out from so many other restaurants is the quality of ingredients use (I've eaten at a lot of pizzerias and no place has come close). The recipes are always changing because the owner sources ingredients seasonally. The mozzarella is all house made. The dough and crust is amazing! \n\nFavorite combination so far is the #2 with pepperoni... Addicting.\n\nPS: beer on tap is always changing, and Kezar never fails to have something new.", "author": "Legendary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Their pizza is QUITE delicious! My only complaints were the sizes and the prices.. We ordered take out and the very sweet woman on the phone recommended one pizza for three people. This was certainly reasonable enough given there were 8 slices but my sister and I are pretty big eaters and were disappointed by the small size of the $21.00 #4. Specialty Pizzetta with Applegate pepperoni, wild mushrooms, house-made sausage, house-made fresh mozzarella and tomato sauce. It was certainly delicious but could have been bigger given the price (even if we didn't need to eat more). All in all, it was pretty reasonable per person but a little more expensive than your average pizza joint..The broccolini was awesome and super flavorful! Amazing that they deliver and did so super quickly given the last minute order on a Saturday night of a holiday weekend!!", "author": "Annie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Kezar Pizzetta presents a paradox, food ranged from very good to \"just\" so so. how to rate?  overall experience enjoyable, going with higher rating  with cavaetts..\n\nmenu: pizzettas, italian entrees, salads, and ?\nflatscreen: sports\n\neats: 8\" pizzetta with mushrooms & salami (7.95) lunch special (choice of 2 toppings)\n(posted on standing board sign at door, online has other specials)\n-first tasting like wood fired pizza\nhad homemade mozzarella, \"applegate\" salami, sea salt (made pizza too salty)\nstringy cheese, fresh ingredients....\n-last 2 slices were hard,  chewy, crust too thick.\n\n-green salad? side: ultra deliz with balsamic vinegar, heirloom tomatos?, pecorina romano cheese?, olive oil...yummy. bih portion\n\nbeer special: rolling rock(2)\n-other drafts regular price.\n\ncrumbs:\n-learned a lot about pizza from \"owner?\"\n-wouldn't order pizza to go, pizza has to eaten at once.\n-eatery lengthy, has mini seating bar, lengthy tables, chairs, conference room in back.\n-cooled pizza not so enjoyable\n-except for specials, menu feels pricey (little experience with italian fare)\n3.5 stars-not all entrees fab, so far salad is.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-23", "description": "I am getting more and more disappointed with this place.\n\nTheir website and online ordering is a pain in the ass, and even thought they are listed with Eat24 finding them on Eat24 is a pain in the ass.  Finally, after getting pissed with how bad everything was online, when I called to place an order I am pretty sure the girl I spoke with was stoned.  First she answer the phone \"hello?\" like I have called her personal cell phone, then when i say I want to place an order she acts like she is doing me a favor. \n\nFinally, their pizza's are too small for the price, 16 bucks for a pizza that can barely feed one person, and they don't offer anything bigger.\n\nScrew this mess. Call me when things get better.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-02", "description": "Lets start off on a good note. The pizza here is pretty good. I actually liked it. Nice thin crust and nice toppings. Am I ok spending $12-$20 dollars for a personal pizza? Sure, it's San Francisco. San Francisco is pricy people! It's the Norm\n\nA few months ago my friend left a 1 star review, Because he didn't enjoy the soggy chicken wings. Everyone is entitled to their own opinion, and my friends opinion was 1 star.... So the owner private messages my friend a sarcastic and very Bitchy message, saying, my friend should have told the wait staff he didn't like the wings instead of finishing the whole plate and leaving a tip. Um, maybe my friend is non confrontational and he left a tip because service was good. I was annoyed when my friend told me about the private message. Is Kezar Pizzetta serious?\n\nMy family has been here twice and both times they enjoyed the pizza. My mother didn't enjoy her salad very much.... But let's get real, this isn't the best Italian in SF, and it isn't the worst. It's a hole in a wall restaurant in cole valley/inner sunset.... And it's in (what looks like) a dark garage. \n\nIf I'm dining out, I'll travel to North Beach District and find an aesthetically pleasing restaurant with ok food... Instead of ok food in a dark basement on Frederick St. \n\nOh and BTW, the chicken wings Are in fact soggy and seem pre made. It's my opinion. Let's leave it at that.", "author": "Andrew V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Best upscale pizza in San Francisco. Basim knows what's up, all of his ingredients are top shelf and the beer selection is always unique and interesting.", "author": "E V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-02", "description": "I found this place because my fish delivery from Seaforager happens here and it was always warm inside and smelled good. I brought my wife and son tonight and I have to say we were all disappointed. First, we tried the Caesar salad. The dressing and croutons seemed store bought (meaning, just OK), and the lettuce was green leaf instead of the typical Romaine - which was fine, but I think this dish is super standard enough that it might have been nice to have it pointed out when we ordered it, especially because it is the first ingredient listed on the menu.\n\nWe got our pizzas. My son got the pepperoni, my wife, plain cheese and sauce with basil, and I had the #5 with sausage, fennel and red onions. We had the same complaints about all 3. First, there was hardly any tomato sauce at all. It was like a very thin layer had been painted on with a brush. Mainly what we tasted were crust and cheese. Most importantly, though, the pizzas were super bland! It was the first time I've been in a restaurant in ages where I was actually tempted to ask for a salt shaker. It's like they forgot to add salt to anything. You would think that on a Saturday night, they'd have their A-Game on in the kitchen.\n\nThey had a good beer selection, but my wife was disappointed with her $12 glass of wine. Seems like if you pay that much at a pizza place like this, it should wow you.\n\nI want to give this place a 1.5 stars, but I will gravitate towards a 2 because the pizza crust was actually quite good, they just need to tweak the rest of the experience.", "author": "Kent C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-29", "description": "The Inner sunset/cole valley area has been in need of a solid pizza place- unfortunately Kezar Pizzeta is not it. \n\nThe price is similar to other upscale pizzerias but the quality is much lower- major disappointment. Honestly, I just ate a a 17 dollar \"party pizza\". The place was empty when we dined on a Sunday; no surprise why. We will not return.", "author": "Anna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Disappointed to go a 4th (or 5th?) time and the pizza was over-salted. Took away from the taste of fresh cheese. And there was too much cheese on it. That's not Napoletana. :(\n\nA good Napoletana pizza has a balance between sauce cheese and crust. Kezar Pizzetta usually has it. Not last night. \n\nI'll go back but will mention this slip in quality.\n\n...\n\nSo I went back. Different guy. Pizza good again. Now, please be consistent.", "author": "Kiai K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-14", "description": "Kezar Pizzetta is a nice neighborhood restaurant/bar in the Inner Sunset, close to Golden Gate Park. They serve personal sized pizzas, along with other typical Italian dishes. I came here twice, courtesy of Groupons, and came away fairly impressed. This is one of the better pizza/Italian restaurants there is in Inner Sunset - granted the quality of the pizza in the Sunset is probably just as bad as the quality of the weather.\n\nThe pizzas are made with wonderfully fresh ingredients. They start at $12 for a cheese pizza, and then the price goes up as you add toppings. There are no specialty pizzas on the menu, so you've got to figure out the toppings for yourself, but every topping I've tried is great. I also really, really like the Caesar salad - homemade dressing, with garlicky croutons. I also tried the buffalo wings and the garlic bread, both of which were somewhat disappointing.", "author": "Sidney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Some of the best pizza in the city. Pizza is topped with homemade mozzarella. Happy hour has amazing deals. Very kid friendly.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "I love this place. The staff rocks and ive been fortunate to have known the owner for many years. They have great beers on tap, good wine and their food is amazing. Hands down my favorite place to veg after a long day!", "author": "Davina Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Great tasting Pizza and the Caprese salad was amazing! Will definitely become a repeat customer:)", "author": "Dre S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-14", "description": "I am very peeved at the quality delivered to me. I ordered the chicken pesto pizza and was thrown back by the burnt taste I got when I took a bite.  The smoke from the Chipotle pesto didn't help the fact that it was really burnt.  I ordered the pizza through 24hr Eats and recieved the best service I could get.... 25% of my pizza. I was totally offended by the offer given by Kezar Pizzet.   I will never eat here again.", "author": "La-Rae A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "We created two of our own pizzas from their roster of stuff and we're more than likely to do it again. They have a nice selection of toppings and, according to my dude, it's the closest thing to Australian pizza that he has found in this great city - if that's of any significance to you. I thought the pizza was fine.\n\nThe cheese they use was a particularly big hit with me. \n\nWe also ordered a Caprese Salad, which looked nothing like the picture someone posted. I imagine it's because it's not tomato season. Instead we got little tomatoes. It didn't end up being a big deal because it was still pretty tasty, and at the end of the day, isn't that what really matters? And their cheese was good. Have I mentioned that I'm a fan of their cheese?", "author": "Loli L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-12", "description": "Ordered the sausage special pizza for delivery and it tasted gross. The pizza itself was barely edible -felt like I was chewing cardboard. The sausage was burnt (almost black in color) and when I tried to grab a piece, all the toppings would just fall off.\n\nVery disappointing. Should have taken pics but I just threw it away. Waste of money, honestly.", "author": "zoo k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Perfect little spot to go and get salad and really good pizza near the park. We were there on a Friday for lunch and had the run of the place. They had a very interesting selection of beers on draft too. Nice.", "author": "Zachary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "This will be my first Yelp review ever and I'm glad It's for Kezar Pizzetta. I absolutely love this pizza! Amazing ingredients, so fresh and everything is made to order, takes about 10-15 minutes and it has always been amazing!! The salami and pepperoni are so good its crazy!! The chef is so sweet and his attention to detail with every pie is superb! This is my go to spot in the sunset! Love it!!!", "author": "Sandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Delicious pizza with fresh ingredients! I went to the gym in the morning and still felt good eating the pizza. Got the number 4 specialty pizza, large enough for 3-4 people to share. Owner is really friendly!", "author": "Nhat H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "We had this pizza delivered, and it was BAD.  My girlfriend described it as \"funky tasking.\"  More specifically, it tasted metallic and cold.  The mushrooms and crust were soggy and chewy.  There was very little cheese or sauce on it.  The whole thing was luke-warm.  All in all, a horrible pizza.  We're confused by the good reviews.", "author": "Michael J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "I cannot believe I ate the entire pizza!\n\nAnyways, I got the specialty pizza #4.\n\nI give them credit, they at least give you actual shaved parmesan. \n\nBut I guess what could be improved was the flavor. Maybe it's just me, but I like pizzas where the cheese and toppings have more flavor.", "author": "Bahar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "KP is by far one of the top pizzarias I've ever been to. The pizza was a taste of excellence and the staff was very friendly and welcoming. I had the #3 and I would have to say making that decision was very difficult because every taste I was looking for they had something for that. I drove up from San Jose and I am proud to say I have absolutely no regrets. If anyone is in SF I highly recommend this place.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Small hole in the wall pizza joint. Came in around 1:00 pm in a Tuesday. The place had a small crowd and one gentleman working. He was great! The salad and pizza came out relatively fast. I highly recommend the house made sausages and wild mushrooms! The crust made this meal fantastic. Five stars all around!", "author": "James F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Food is great.  But they can be slow.\n\nthe first couple times, i was very frustrated at slow food.  But we have learned.  order everything quickly, then enjoy it when it comes.  the food is very good.  and reasonably priced for SF.  there is a big open area in back with TV -- great for us and the kiddos.  nice that happy hour goes until 7.", "author": "Genevieve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "I came in for dinner with the fam and we sat in the back lounge area. It's cute and cozy, good for big groups! Ordered buffalo wings, broccolini and the two specialty pizzas that have house made sausages. I really liked the food, super tasty, but could only give 4 stars cause the portions are small for the price.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Tried the Specialty Pizza with sausage and fennel. Made a big impression. First of all the sauce and all the ingredients just tasted super fresh. It was noticeably good and different! Not cheap, but also very high quality. I think the large pizza is enough for 2 people to share, but might want to add in a salad too. \n\nAlso, for what it's worth, the person that answered the phone AND the person who delivered the pizza were both super nice and helpful.", "author": "Maria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "This place is absolutely awesome. In a city full of good food and settings more European than American, this place still feels like you strolled in off a Western European street. The pizza is delicious and affordable, the rocket salad got rave reviews from the 6 of us and the beer list is incredibly thoughtful. I work in the industry so I love seeing an owner who pours great examples of the styles he/she likes while making sure the draft list is well rounded. I'll definitely be back.", "author": "Phil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "This has become a great go to for lunch for me and couple of friends from UCSF.  It's nary a block away from the bottom floor of the UCSF parking structure, and well worth the walk.  The place is comfortable, with a great owner/barman, who provides outstanding friendly, casual service.  I've been here twice and will definitely be here many more times.  There are daily rotating beer specials that are a good value (e.g. $3 draft stellas, or $3 draft Anchor Steams, etc.), but their non-special beers are also fairly priced.  A personal favorite in that regard would be the 10% ABV stout that they carry(apologies that I don't remember the specific variety, but it was delicious).\n\nThis restaurant is a really great neighborhood spot.  The ownership are very active in the operation of the establishment, and that pays off in a number of ways.  They are a great conversation because they are very helpful and friendly, but there is also real value in their participation in the day-to-day operation because they can tell you exactly what they're serving you, down to the variety and mixture of the daily mushroom pizza toppings.  They do not take the food they serve lightly, and the pizzas that they whip up are always very well done.\n\nI cannot stress how friendly an atmosphere is had here.  The service is always on point and appropriately casual, and even if you dn't bring a friend, the owners are a great chat.  I cannot recommend this place enough, especially in the area.  This is a great destination, and even more of a no-brainer if you're doing anything in Golden Gate Park or adjacent.", "author": "J T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-08", "description": "The pizza is OK.  If you're getting one of those ridiculous deals, totally jump on it, because it's worth it to stuff your face for cheap.\n\nAs a replacement for New Ganges, though, it's really a disappointment.  You can't follow an institution and expect not to be compared to that institution.  I'm not grading them on the same scale--now that would be unfair--but whereas New Ganges made me OK with eating in a basementish garage, Kezar Pizzetta just makes me want to take my pizza to my brother's house.\n\nThere's worse pizza out there, but there's better pizza out there as well.  And I miss New Ganges.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "My wife and I came to the city for a good pizza and tasty beer. Each time we visit we try a different pizza place. Make no misunderstanding at what I'm gonna say: this pizza is AMAZING. The hostess, (who also answers the phone) was so polite and helpful. Despite having dual duties, she was extremely attentive and knowledgeable about the speciality beer and food they served. She was honest about the selections, even warning me about the spicy hot wings! Spicy but so tasty! The food here is like no other because: 1. It is FRESH 2. It actually doesn't taste like processed food or cardboard like other places with 5 star ratings 3. It has unique flavors, not typical bland toppings  (our pizza had several mushrooms I hadn't even seen before) 4. The pizza was filling! More than enough for the both of us! We took 4 slices home... 5. The caprese salad was one of the best I've ever had...the mozzarella was fresh and flavorful. Anyone saying anything different is crazy!!! You would be missing out on the City if you didn't have at least one meal here. Great environment, fantastic food prepared by skilled staff and one AMAZING hostess. Why go anywhere else??", "author": "Cain A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Cool spot with tasty pizza and a solid rotating tap list. One of the few places I can take my kid and have a beer while watching a Warriors or 9ers game.", "author": "John V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-21", "description": "Not that Yelp reviews matter anymore but this is the worst pizza I've ever had. We ordered a pepperoni, spinach and \"wild\" mushroom pizza.  Mushrooms were NOT \"wild\" there were straight button mushrooms from any grocery store so at $3 for them, we basically just bought them the whole container. How even pepperoni can have no taste is so confusing. The whole pizza honestly tastes like cardboard, no joke. The hostess who answers the phone also doesn't know how to just apologize for 1 pizza taking over and a half, instead she chose to confirm that it was actually only an hour and 23 minutes. Our pizza hadn't even been picked up yet so yes, OVER an hour and a half. DO NOT WASTE YOUR MONEY. This place is garbage all the way around.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "Three stars for delivery and decent, albeit \"gourmet-style\" rather than East coast style, pizza. The pizza was A-OK, but for the prices I expected a much larger pie. This is definitely hipster pizza at hipster prices. And seriously, $2 for delivery? 1993 called and wants its pricing back. And I'm willing to bet that the person who actually delivered the pizza doesn't get that 2 bucks. My other gripe is the checkerboard paper they use to line the boxes. Pretty? Maybe. But having red dye embedded on the bottom of the leftover pizza, as little as it was given the size of the pie, isn't my idea of appetizing. Had to throw it out. \n\nProbably good for one person with some leftovers, but not really enough for 2 people. And if I wanted to spend that much money for 2 people, surely I wouldn't be ordering pizza. And I am serious, so don't call me Shirley.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "This is so exciting!!! I'll be honest... I walked by here for moooooonths before coming in and when I finally did I was kicking myself for not doing so earlier. The marinara sauce is amazing, strong but not overpowering on the rosemary, and the crust, as another reviewer has said, is perfect New York sweet. The wine list also should be mentioned--- 4 of the wines were from my favorite vineyards in Mendocino, etc. \n\nThis place is a true gem. I'll probably be here ~once per week from now on.", "author": "Luz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "This place is wonderful. The food is fantastic and their draft beer selection is always refreshingly unique. I would recommend any of their pizzas, and the salads are a great addition to your meal.", "author": "George W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-13", "description": "Tried for the first time a couple weeks ago. Here's my summary: \n\nService: Prompt and friendly\nFood: Salads were fresh and good size portion. Pizza was pretty good. \nAmbiance: Odd. A long, narrow restaurant with hodgepodge of tables, chairs, and decor. Lighting was a bit awkward. Sports being broadcast in tv. \nPrice: A little steep for what it was. \n\nIn short, I would consider returning to get take out pizza. But it was not worth the cost to have a sit down meal. It looks like they did not really do anything do spruce up the place before they opened.", "author": "Anne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "Great place to get artisan pizza. Also the wings and brocollini are great appetizers.  Also, the regular cheese pizza is a solid choice.  The dining are has a bar and tables in addition to a couch in the back.  The bar is a full bar with a decent selection on tap.  Ordering through eat24 was a breeze when we opted for delivery.", "author": "Ryan I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "We consider this one of the better additions to the neighborhood in recent years. Solid pizza once you find the right one for you. Amazing eggplant appetizer. Good beer options, etc. \n\nAbove all, the place is so perfectly cozy and the staff is sincere and friendly. We've become regulars in the past couple months and consider it one of our spots.", "author": "Wilson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "Honestly and seriously ... The best service.  I'm not a beer connoisseur or anything, I just want to enjoy my drink. I ordered something that was recommended to me and didn't enjoy it. The owner talked me through all of the types he had based on the flavors and brews I like and found me something PERFECT. The pizza was absolutely delicious. I got prosciutto, basil and onion and I ended up getting two because of how absolutely yummy it was. I definitely recommend this place for good company, great atmosphere (local art on the wall is a HUGE plus for me. I think it's so cool) and great eats. Come one come all!", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-02", "description": "I don't like writing bad reviews to nice/new businesses, but the pizzas here were very underwhelming when I went. Each pizza I ordered was about $16+ because it starts off $12 (no toppings) and each topping (even a veggie topping!) is 2 bucks or more!! Also, all the meats were very very very salty. I had the sopressata and prosciutto (on different pizzas) and both were not good. They had a weird aftertaste...Also, I recommend getting the pesto base over the tomato base. The tomato base pizzas were very soggy and oily. The arugula salad was good.  But it was only arugula and a few slices of apple and it costs like $8 o__o\n\nOverall, this place was wayyyyy overpriced. The quality of food just didn't match the price for me.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "This place was AMAZING! I've wanted to go here for a while and bought a groupon recently that finally pushed me to go. The service was great, warm welcome and positive vibes and very helpful.\n\nOrdered the Bruchetta which was delicious. The cheese and sauce pizza added prosciutto and bratta cheese. The pizza was creamy and very tasty. We seriously wanted to order more the bratta made it so cheesy. The pizza is thinner Italian style crust, was very authentic. Can't wait to go back.", "author": "Krista R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "I have to laugh at the review that compared this pizza to Round Table? If you live in the city, try expanding your horizons outside of crappy chain restaurants.\n\nI've been driving by as this location has had failed business after failed business - so I was excited when I saw signs of life finally.\n\nThe pizza was actually REALLY good - I'm usually a Patxi's fan, love thin crust and while the pizza was a bit on the pricey side, it was worth it - super flavorful and great service.\n\nIf you can still get the groupon, that'll help the price, but eitherway, i'll be back!", "author": "Chloe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Totally tasty pizza and cute spot! Will definitely go back for a pick up another Friday soon, great way to end the week...by not cooking dinner!", "author": "Taylor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Tasty, healthier option for pizza. Tonight I chose delivery, arrived on time (half hour). Ordered veggie, which had kale, maybe feta cheese (who knows, we wolfed it down pretty quick). I will absolutely, positively, definitely be ordering from here regularly.", "author": "Richard V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-20", "description": "Yay, finally something in this location worth going to!\n\nDon't let the name confuse you, though.  Kezar Pizzetta is a neighborhood restaurant; homey, basic, and affordable, yet filling and tasty.  Except that they have a heck of a beer list, including beers I haven't seen anywhere closer than Toranado.\n\nSo I could see going here for beers, and not just for pizza.  But the pizza is pretty good, and the bruchette are terrific.\n\nAnyway, here's hoping that they do well despite the terrible location, and hang around ... because I plan to go back.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "Project upgrade.\n\nGood taste: http://www.gq.com/about/project-upgrade\n\nReally good taste: Sourdough bruschetta with heirloom tomatoes to start and Mary's chicken, spinach and more heirloom tomatoes to finish.\n\nFather/son meal so delicious we joked it was quite the upgrade from Domino's many years ago. Not even close.\n\nOnly the eggplant parmesan disappointed. Each ingredient got lost and distracted from the namesake. Still far outclassed Domino's.\n\nEverything was as organic as possible and a very reasonable $40 with tax and tip.\n\nServer was super friendly and very attentive. Appreciated it when she no time lowering the volume on the TV when asked.\n\nElongated space features a bar to the right and seating along the wall and towards the back. Nothing fancy. Too focused on pizza.\n\nUpgraded pizza.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Yum!!  Got delivery a couple times so far.  Love the charred corn salad and wings and can't go wrong with any pizza choice.  Our new go-to pizza delivery place!", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "We go here every Wednesday for a combo (salad, personal pizza, coke) and every week the pizza continues to impress our whole group. Honestly, if you are in the area you need to give this pie a try. Fresh ingredients, good service (though good pizza takes time), and for the time being, relatively a quite and comfortable establishment. I imagine once people find out about this place, it will get busy, but I think the owners deserve some recognition for making some of my favorite pizzas in CA.", "author": "Ben A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-09", "description": "Terrible experience. They hadn't put our pizzas in the oven 45 minutes after we had ordered them. When we told them we couldn't wait and would like our check...they treated us with little to no respect. Limited beer choices...slow service. I will steer clear going forward.", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-12", "description": "Horrible customer service! The manager/owner did not take responsibility for a screwed up order. He accused us of misordering. We have 2 witnesses to our order and the waitress admitted to screwing up the order (whom I had tipped). I asked for a refund on our to go order because the food was inedible to our kids. Manager/owner was very rude!!!! When we picked up the food, the resto was empty so they were lucky that they got any revenues. I refuse to go back!  Do not support bad service!!!!", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-04", "description": "Honestly I love any type of pizza, but I've never had pizza this bad in my life. The chipotle pesto sauce taste like taco sauce with chili! And as far as the wings go, it says \"seasoned sauce\" but it is actually bagged wings you can buy from Costco. It was horrible. Their bruschetta was worst than everything else. It was a bunch of cheese and marinara on top of toast. \n\n\nThere service was okay, but never ever ever again!", "author": "Zamer H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-18", "description": "Food is bland, service is ok. Beer/wine is good.  Pizza has weird flavour and not particularly tasty.  I'd go to Pizza Hut or Roundtable over Pizzetta. \n\nNot sure why this location is having such a hard time putting in a restaurant with a recipe that works. Try again please.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "This place is amazing! Basim the owner is a one man army! He took care of my friend and i while making some of the best pizza in town. Don't go anywhere else for pizza! Being that it's football season again. He has plenty of beers and TVs to watch all the games! Thanks again brotha!", "author": "Anthonie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "So this is the second time I've been here now, and I gotta say I'm a believer! The pepperoni is amazing! Margarita Pizza is unreal, and their sauce is unbeatable! Great beer selection and a very chill atmosphere! If you're in the area you have to come here!", "author": "Kris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "We got pizza delivered a couple weeks ago. The flavors were great and we really enjoyed it - however, by the time it arrived it wasn't very fresh. I could tell though that this pizza would be pretty good if we ordered it fresh. And it was still pretty good when it wasn't so fresh. We ordered specialty pizza 1&4 - we liked 1 (it had butternut squash) the best. Looking forward to coming in and trying it out in person in the future!", "author": "Alison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Staff very friendly. Pizza was delicious. Ingredients very fresh and tasty.  If you like thin crust pizza, this is the place for you. If you don't, stay away because crust is extremely thin.  You have to pretty much pick your own toppings, don't really have pre-designated choices, but you can't go wrong with ingredient or sauce choices.  Price adds up quickly though, $3 extra per topping. Paid $41 for 2 small pizzas and 1 soda! That didn't include tip.", "author": "Mari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "I love their pizzas. They are right next to my apt so it's the perfect spot for me to get a quick bite of nice thin crust pizza :)", "author": "Aki J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "The $12 basic pizza forms a nice base to start from, but is reasonably bland until you start adding items to it.  There are a variety of interesting, fresh, and organic toppings which takes some serious digging to find online (as of the time we ordered, neither the yelp or first 3-4 google menu hits included the toppings menu). \n\nI'd recommend at least two or three toppings to get the pizza to an interesting flavor intersection, including some kind of seasoned meat like the Applegate pepperoni.  This is going to get your price closer to $20, but as other reviewers pointed out, this is better than fast food pizza.", "author": "Kraig M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "This place has surprisingly good delivery! Got the broccolini and a sausage pizzeta. Kinda pricey, though...but in this case you get what you pay for!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Without a doubt the best pizza I've ever had delivered and I'm 57!  The crust is amazing and they use high quality ingredients. I betcha in 2 months time I'll be blaming them for weight gain. I've ordered 3 times in three weeks. My oh my!!! And I once got the arugula salad and it was delish. So happy I'm in their delivery range.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Excellent, friendly service, very good pizza with a good draft beer selection. This place would be doing great business if it had a decent location.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "What a relatively hidden gem.  Was with a friend at the community garden across the street before we wandered in.  Friendly service, delicious pizza, and ginormous salads.  Will definitely come back for more.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-11", "description": "I don't understand all the 4/5 star reviews for this place.  Definitely in my top 5 worst pizza I've ever had.  It's basically just loads of cheese on soggy bread.  It really makes no difference which pizza you order, they're all the same. Cheese and a very light sprinkling of other tasteless ingredients that in total probably constitute $2 worth of food for which you pay $20.  \n\nI don't get why this is seen as OK.  If I want a \"NY Sausage\" pizza, is it crazy to expect more than 3-4 tiny pieces of sausage amidst a sea of greasy cheese on an oil soaked base?", "author": "J P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Was pleasantly surprised.  Ordered the custom pizzas because I like basic pizzas...pepperoni, sausage, olives, etc.  their specialty pizza menu did not look appealing.  Our pizzas were fantastic.  Better than some of the famed trendy pizza places in town. Space is a bit odd and not too inviting. But I'd go back just for the pizzas.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "This is not the cheapest pizza...But it's probably the best! I had the sausage/fennel pizzetta - can't wait 'til next time!\nPlus, in the midst of a busy, busy night, the person on the phone sweetly helped me figure out my order. \nPizza delivery these days can take 1 1/2 hours, so if it's likely to be a busy night, try to plan in advance. Delivery only for orders over $20, and there's a small delivery charge too, just so you know.", "author": "Judy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Great little neighborhood spot. Horrible signage. I've probably walked by this place 25 times and never knew it existed. Now that I have found it my wife will know where I am when I'm bored. Great little craft beer selection and solid wines. If you are a fan of thin crust crispy pizza this is absolutely the place for you. Couple Haight weirdos at the bar which makes it even better. Feeling blue? Head to Keezar Pizzetta for warm food and people.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "I have been to Kezar Pizzetta a few times now, as I live nearby and found it convenient for a casual dinner with the roommates. \n\nAfter my last experience I must say, avoid this place. Much better pizza in the neighborhood and more importantly: much better customer service. \n\nI called in an order to pick up on a Sunday evening. I was told the wait would be 30 minutes. I arrived 40 minutes after calling to find that no components of my order had been made and the man working the cash register told us to have a seat.\n\nI expected to be offered a glass of wine or a beer while I sat at the bar and waited an additional 25 minutes for my pizza to be made but nope, nothing. At one point a man ran through the restaurant from the back room with a head of lettuce towards the kitchen, what I assumed was my future caesar salad. After an endless wait our order was finally ready. I expected an \"I'm sorry for the wait, here ya go\" but nope, no apology, the man just gave me the price for the full order. I would of loved to hear \"garlic bread is on the house\" or something of that nature. And let me just say that I work in customer service and this was some of the worst I have seen. \n\nAnd to make matters worse- I emphasized on the phone that the pizza have only half meat (as my roommate is vegetarian). We get home and nope... full meat. So frustrating. Not to mention the pizza was so greasy that it took me about 5 paper towels to soak up the drippings. \n\nBrightside: garlic bread was pretty good \n\nMaybe they were having an off night? I would hope so because on this occasion they definitely blew it.", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "I found this pizza to be super legit. Much better than I was expecting. A nice, chewy thin-ish crust that wasn't charred the way Delfina and other similar pieces are. (I know this is a thing some people like, I don't) and also (I really did just compare this a little bit to Delfina). I got the number 5 to go. The sauce was pretty good, but maybe a touch of salt or a bit more acid needed to brighten it a smidge. The cheese, tomatoes, and basil were delicious. I thought the interior seemed like an unappealing dinner destination. A bit sports bar. But a very solid and much needed take-out option in the area.", "author": "Andrea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "When reading some of the reviews below I couldn't help but wondering what is the credibility of a pizza reviewer when the \"control group\" for comparison is round table pizza or dominos? It's like comparing beautiful handmade art and craft items on etsy with mass fabricated Walmart goods. The price is of course different, but so is the quality and the entire experience. \n\nThe pizzas here are fantastic -- the dough is by itself very flavorful, crispy; the cheese is rich with subtle texture, freshly made in shop; the sauce is nicely balanced and NOT OVERSALTED like most of the pizza places in the states, which means the saltiness does not cover up the sweet taste of the dough and all the subtleties of the sauce. You can order a pizza with only the basic cheese and sauce and love it -- this is not your normal 6 topping pizza, to fully experience it you really just need to add one or two ingredients, like one meat with roasted pepper, for example, and the experience would be totally satisfying. YOU DO NOT WANT TO OVERLOAD IT WITH CONFLICKING FLAVORS BY ADDING TOO MANY DIFFERENT TOPPINGS. It's like wearing jewelry -- a simple, graceful pearl necklace is usually better than a bunch of crappy boings bundled together. And with 2-3 toppings, the price comes out very reasonable.\n\nThis is what I would call \"artesian pizza\". It is comparable to the real pizza you find in Italy. And yes, I am comparing it to the great pizzas I've had in Rome, the ones that locals go to really enjoy traditional food.\n\nSome of the reviewers mentioned that the meats leaves a strange aftertaste -- that's because they use NON-CURED meats that is not overloaded with sodium nitrate (which is a potential carcinogen) and therefore much better for your health. And that \"strange\" taste -- it is the taste of traditionally smoked or dried. Since sodium nitrate is added primarily as a preservative, I would guess the meats they use are much more fresh. So many people growing up in the states have never had much chance to enjoy high quality prosciutto or Spanish ham but if you happen to have tried them from their country of origin, you will understand what I mean.\n\nIn a word, this is a rare neighborhood gem and I'm just glad I have tried it. I've almost lost all faith of finding good thin-crust pizza in this city before this. It's an experience by itself.\n\nP.S. I have not tried their chicken wings but I would hesitate to judge the food quality of a pizza place which imports their flour from Italy from their chicken wings.", "author": "Fiona S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "In reality, I'd like to give this place 3.5 stars. Service is great...really great. They go out of their way to make sure you have a positive dining experience. Though the prices are a bit high, the portions are decent sized. Your bill can add up pretty quickly if you go the choose your own toppings path ($12 for plain marinara and cheese, $2-$3 per topping addition). We chose to try out a few of the specialty pizzas which are $15 each. Between two hungry people, 1.5 pizzas is enough to leave you feeling comfortably full. I love that the menu features organic and local ingredients wherever possible. Each pizza is topped with their home made marinara sauce and slices of freshly made mozzarella which is a real treat. My only gripe is that the crust was a little too doughy and undercooked in the middle. I like my thin crust pizza to be thin and crisp from edge to center. Overall we had a positive dining experience here, but there is a little more room to improve with the craftsmanship of the pizza.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "I ordered delivery at this place, and I know it had good reviews but I didn't expect it to be THIS good. Had the spinach appetizer and two 8\" pizzetas. Both were really really good, some of the best pizza I've had since I moved here from Europe. Comes highly recommended. Only con is that delivery could be faster.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Really, REALLY good pizza and beer selection near Golden Gate Park. I was so relieved to find a place within walking distance of the Conservatory of Flowers that could accommodate a big family group with no reservations on Saturday. It was busy but luckily they had cozy bench & table area in the back that was perfect. Nice, casual service too.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-04", "description": "2nd time trying this place and both times were not great. Not bad, but not great...and for the price, it should be great. Nice staff and quick delivery, but the food is just.. okay. There is definitely better and less expensive pizza in the area.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "Just had delivery from kp for first time.  It is the bomb!  Best delivery pizza available to me.  Reminds me of Giovanni's which I think of often and miss a lot.  Had their buffolo mozzarella tomato salami arugula pie.  Off the charts. I plan to dine in soon.", "author": "ari b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Ordered delivery and got the broccolini appetizer. It. Was. Amazing!\nPizza was good too, but make sure you get the broccolini.", "author": "Jim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Small hole in the wall pizzettta and good beers on tap.  Very friendly folks behind the bar and register.  Nice choice of different creative pizzas with natural ingredients.  Went with the goat cheese, sun dried tomato one night, and a chicken pesto that worked. I like thin crust every once and a while and they do this well.  Pricey but it is San Francisco so par for the course for an upscale wood fired oven pizza.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-16", "description": "The only reason why I'm giving this restaurant is because they advertise 8 seasoned and baked wings for $9.00. When the plate arrived the wings seemed familiar, oh yeah their Costco hot and spicy wings. Baked wings should be a bit more firm and crispy to some extent, not soggy, seemed microwaved. For about 3 more bucks I could of bought a whole bag from Costco. The pizza seemed a bit pricey but it was tasty.", "author": "Luis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-16", "description": "It's not often you can find high end quality food with a sports bar, but the Haight is in luck. I'm in heaven!\n\nWent here for the first time yesterday as it came highly recommended by a friend. The environment is very welcoming and cozy for a sports bar/ pizzeria. We opted to sit in the back where there was a long bench with pillows. For appetizers we ordered the broccolini and the garlic bread. Both were SUPERB! The broccolini was fresh, covered with pancetta and had a divine slightly sweet taste to it. The garlic bread was smothered in garlic (which I love) because it was still crispy and not soggy. \nWe each ordered our own pizzettas. I had the cheese and sauce with garlic, basil and shitake mushrooms added. SHITAKE! What a treat. When it came out  it was so pipping hot i had to wait several minutes for it to cool down, even with blowing on it. Despite having to wait, when I was able to bite into it the thin crust pizza it was very crispy and able to hold the weight of the ingredients, so no fork and knife necessary. Everything tasted like it had just been picked from the garden that morning. The most surprising aspect I learned was that the owner not only gets his produce fresh daily but also makes his own cheese! Talk about fresh! It makes all the difference. None of his ingredients have any preservatives, so if you are thinking of taking any leftovers home, make sure to eat them the same or next day. \n\nPizzettas are reasonably priced, starting at $12, but with the high end ingredients list starting at $3 & $2 each, a 12' pizza can get expensive quickly. But the ingredients are such good quality that you only need 2 - 3 toppings max to get the wonderful flavors of what you are paying for. Trust me its definitely worth the price and will keep me coming back for more. You know this place knows its beer when each beer has its own personal glass. Can't wait to see the updated beer bottle and draft menu when they get settled in. \nExcellent place all the way around. \n\nI really hope the neighborhood takes to this place because this pizza is crave worthy and I will have a panic attack if I can't get my hands on another one.", "author": "Vanessa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Great meal. Went in on a Friday about 8 PM and was seated right away. Had the prosciutto pear wraps, garlic bread, and one of the specialty pizzas. Courses were timed perfectly. Great crust good beer fun atmosphere. I'll be back.", "author": "Cole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "Was lucky and ate here on their first-ever \"make your own pizza\" night as part of SF Beer Week. When they told me this, I assumed I may get to pick out the toppings from behind the glass, but no, I got to go behind the counter, wash-up, and place all the toppings, cheese, etc, myself! They were incredibly friendly, and the pizza came out awesome. Would love if they do this again sometime.", "author": "Carl F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "LOCATION: This small place is a bit hidden and easy to miss, but well worth trying, especially if you live nearby.  \n\nFOOD: This is NOT Fast-food pizza. The pizza, salads, and veggie side dishes are more upscale and organic. Highly recommend the arugula salad with the garlicky blue cheese dressing, BUT make sure to ask them to lighten up on the amount of dressing. The quality of the thin crust is wonderful and far better than the other nearby pizzerias. Crispy on the exterior surface with the right amount of \"chewy\" texture, as in not too chewy when the dough has been overworked. I have lived in the hood for 22 yrs and have tried them all. Also try the broccolini, and the spinach, both are garlicky and salty without overdoing it on the salt. Vegetables were not overcooked, thank goodness. A plus...the cook properly retained the bright green color of the cooked veggies. All dishes came out piping hot, not lukewarm.\n\nVery small but well-varied range of beer on tap choices. Nicely poured, not foamy. \n\nDECOR & SERVICE: The interior decor is a bit dark and somber, so be prepared for a dark bar atmosphere versus a nicely lit restaurant. More candles or a slightly higher wattage in their lighting would be helpful. However, the place still retains a nice neighborly charm, mainly due to the congeniality and sincere spirit of the owner and the servers.\n\nPlate & cutlery service was a pleasant surprise for such a casual, tiny place. Fresh plates and cutlery was provided between courses, a nice touch which should be standard in most pizzerias.", "author": "Lily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "My new favorite beer, wine & organic pizza! Just fabulous! Great ambiance and the employees outstanding! Great customer service!", "author": "Francis H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "Thank you Kezar Pizetta!  Finally I have a close neighborhood favorite pizza.  Crispy thin crust just the right chew not bread-y.  Great sauce and here's best thing people--side of Parmesan is not normal finely grated cheap it's real grated Parmesan!  Lol.  Do not change that.  I'm an east coast pizza snob and I'll be back and I'll tell everyone in the neighborhood for sure.  Please do another Groupon!  My only advice-- your storefront needs a makeover.  I was standing in front and looking up address in my phone.   Yum!\n\nPs to owner(s)-- location sucks.  Your pizza is worth a better pedestrian location.  Come to Cole Valley.  ;)", "author": "marie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "Delicious pizzette and Caesar salad, good beer and wine selection, excellent service, very kid-friendly.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Came here for lunch one day and watched the world cup. The place is really cute and loungey, seems like it would be great for a birthday party or large groups. I am surprised that people have said it was not inviting because I felt right at home and loved it instantly (particularly the bench seating area in the back). Service was really friendly and attentive, our server seemed very sincere. We went all out and got the fig and prosciutto appetizer which was a pretty generous serving for the price, a salad, and we got the pizza lunch special as well (don't quote me, but I recall it was $7.99 for a personal pizza). I got the prosciutto and burrata pizza and my boyfriend got the goat cheese and kale pizza. He wasn't very enthused with his but I think that was mainly because he doesn't eat goat cheese or kale very often and it was a pungent cheese.  Dessert was very good as well. Beer selection was great! The only thing I think could use some improvement was the decor. The decorations were a little strange, a mix of candles and knick knacks. But overall I am excited to have this place in the neighborhood.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-15", "description": "Pizza had no flavor, soggy in the middle. Garlic bread was not good and didn't have a good texture. Caesar salad didn't taste washed and had the dressing already on it, but barely any dressing. Overall not satisfying. Sad.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-15", "description": "Wonderful experience. The food was very fresh and the pizza was amazing. Very friendly service. I highly recommend the trip here even if you don't happen to live in the neighborhood.", "author": "kevin d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "Don't come here unless you want to waste 2 hours of your life! Where are all these good reviews coming from??!! Are these friends of owners giving good reviews??!! \nThis place is so unbelievably bad it defies description. We went here this evening, place was mostly empty. There was one cook and one server. That should have tipped us off but the good yelp reviews prevailed. \nSo we ordered pizza and chicken wings. This was about 7pm. Then we waited and waited and waited some more. 50 minutes later, the microwaved chicken wings comes out. We gobble them up because we were famished. Then we asked for the status of our pizza order and told them we have to leave in a few minutes because we have been waiting for almost an hour. Server got all pissy and gave us a check for the drinks and wings. Said they were backed up because they were fulfilling takeout orders. If you're not going to serve customers who are at the restaurant then keep the place close for goodness sake. \nWe paid our $25 dollars for the microwave wings, beer and wine and left. Worst use of $25 dollars ever. Stay away from this place. Unless you like bad customer service and have time to wait hours for pizza.", "author": "gor d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Love this place. Delicious pizza, great beer selection, tucked away location, awesome owner, sports on the television...perfect spot for me. I think everyone at Kezar Pub and Kezar Bar would have a much nicer time here! :)", "author": "Latte Queen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "Thin crust pizza is off the hook good.  Ate there 2 days in a row.  Ingredients are all very fresh and staff is very friendly.  Small place, but nice.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "The good news: The food at Kezar Pizzetta is fabulous, superb, full of top quality organic ingredients. The pizzettas have a thin, crispy crust - both very thin and very crispy -- so if you like thick, floppy crusts, the crust may seem too \"crackery\" to you. But I thought the crust here was better than almost anywhere else in SF, including places like Flour + Water, which are much more expensive. The sauce is simple, tomatoey, and excellent, and the house-made mozzarella (!) is delicate and wonderful. The broccolini appetizer was great too, perfectly cooked, with plenty of crispy pancetta and freshly grated Parmesan, good fragrant olive oil, and a dash of balsamic vinegar. The service was nice, and the staff seem like great people, including the British-accented waitress and the sweet young guy who washes dishes. The space is so narrow that it's a bit awkward, like dining in a rail car -- 20 people would overwhelm the joint. But it's fine.\n\nNow for the bad news, for which I subtracted one star from what would have been a five-star review, and nearly subtracted two:  There's a huge video screen in the back, looming over a very pleasant-looking space with cushions, and another huge screen in the front, and on top of that, there was music playing over the speakers. We were sitting at a table in the middle of the room, where I could hear nothing but the sports announcer in the back competing with the pop music from the front, and I couldn't even begin to hear what my dining companion was saying, even though neither sound source was particularly loud. The food was so great that we had a nice time anyway, but I'll just say it:  I don't go to a restaurant so I can watch TV while listening to the stereo. What is going ON with restaurants these days? I don't say to myself, \"Hey, let's go out so I can eat in front of the TV and spend $50 doing it!\" But I seem to be in the minority, as giant video screens and booming sound systems seem to be standard in every new restaurant that opens in this neighborhood these days. I can only imagine how much more pleasant this intimate space would be with NO stupid screens, lower light, more candles, and either no music or soft jazz at most. I predict that the noise problem in this restaurant could prove a serious liability to a place that deserves to succeed, because they obviously really care about the food. Sell those bloody screens on eBay and use the money to make more delicious mozzarella or plant some oregano and basil in the back.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "We love this place!  We have always gotten wonderful service and great food.  I love (lovelove) their red spinach salad.  My son loves the pizza.  They have an excellent selection of beers on tap.  It is a destination location, and parking has always been a breeze for me. He accepted the Groupon graciously.  We would not have discovered this place without the Groupon, and it is now a favorite.  Every time we have been there, same story, great service, yummy quality food.", "author": "Carol K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "My first time coming here tonight... Wasn't sure what to expect, although I had already heard about their amazing pizza. They did not disappoint!!!! Pepperoni, artichokes, Johnny's cheese-it's not on the menu but it should be. OMG. That perfect thin, flaky crust. Sauce not over dressed. Need I say more?!? Heaven on a plate. This place has a cool atmosphere. I know there's still some work happening so it'll only get better. Excited to see more happen for this place and to come back! Check it out :)", "author": "Pearl A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "Perfect place to take my kids to eat pizza while they get their homework done after Acrosports.  Service was excellent. Kids loved sitting at big table in front of aquarium.  My baby really enjoyed watching the fish while eating his pizza. I had the eggplant parmesan and it was healthy and yummy. Even the baby liked it. Happy hour wine selection was good enough. Definitely going back.", "author": "Carolyne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "A neighborhood gem! The restaurant hasn't officially opened and we were lucky enough to eat there during their \"soft opening\". (This place will be very popular once the word gets out!) Everything was delicious...generous portions on the salads, the pizza crust had a great flavor with a crispy texture. We cannot wait to go back!", "author": "Janelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-30", "description": "Yum! This place rocks. The pizza is not trying to be East Coast, West Coast, Neapolitan, etc. it's merely using the best possible ingredients on thin crust. I'm someone who gravitates for the true Neapolitan pizza, but I'll eat this pizza any day. The value is great, as are the ingredients. The owner takes pride in what he's doing from the pizza to the beer and local wine selections.... In a city full of precious $$ restaurants, this is a neighbor gem--nothing pretentious about it--just honest good food and beer and wine. I've quickly become a regular. Oh, and they have free delivery--another rarity in this city. Keep up the good work Kezar Pizzetta.", "author": "Keelyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "Just ate here for the first time recently.  Mostly organic quality ingredients.  Fabulous side dishes like broccolini and a divine house made blue cheese dressing.  I definitely will return to try more items on the interesting menu.  They even have burrata for a pizza topping choice plus Applegate's organic salami and pepperoni, which is something I won't eat normally because of the way it's processed but at Kezar I can relax about that.", "author": "Marsha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-04", "description": "Great new pizza joint!  My second time here. Pizza tastes awesome and the price isn't too bad.  Highly recommend", "author": "Laura W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Went here on a Tuesday night with two girlfriends.  There were only two or three other parties in the restaurant, so they let us sit in the back where we had a huge space with couches and tables to ourselves.  Luckily, we were in the mood to drink wine and chat because our two pizzas took 50 minutes to come out.  Even our caesar salad didn't come out until at least 20 minutes in.  Despite the glacial pace of the service, the pizza was delicious.  We got one with a chipotle pesto (don't be fooled by the name - it's a nicely spicy sauce but it bears no resemblance to pesto) and chicken that was great and the other had arugula and prosciutto.  Both were perfectly cooked with crispy thin crust.  I would happily come back, but only if I had plenty of time to spare.", "author": "Rosie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-09", "description": "So we live in the neighborhood and noticed this place was opening. Waited a while til they got their liquor license. Decor is nice. Wish I could say the same about the music (ouch). The pizza is thin crust and very good but the cheese is skimpy and by the time you add a few ingredients it gets pricey (for pizza). We went on a Saturday evening at 6 pm and the place was empty except for one fellow at the bar. When we left  at 7:30 one other couple had come in for drinks at the bar at and gone and there was no one else in the place. We asked the waitress how the place was doing and she said really well. I hope so but seems hard to believe.`", "author": "Francoise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Pizza is really yummy. I would definitely recommend it. A salad was good too, albeit a bit over-dressed.", "author": "g a."}
