{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "This restaurant really surprised me. Every dish was delicious. It was savory, sweet, sour and I hate to be that person but you can definitely taste the umami. Everything was a flavor explosion. I was worried that because it was a such a posh place, the food would lose its authenticity but that doubt was completely destroyed.\n\nMy favorite dish was the black cod and the rice noodles. The fish was fatty and rich but the intense Vietnamese spice cut through it, giving it such a sophisticated flavor--nuts, cinnamon, turmeric, basil etc. The price might be pricey but with the high quality ingredients and amount of food you get--worth it.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Ate at this most fantastic restaurant on Sat\nEach tastebud is still smiling . Each of the 8 courses\nwas better than the previous . Outstandingly x 2\nChef Khai is a Great creative chef and a most personal\nand friendly person. He my wife and I really hit it off well\nHe invited us to on a Culinary Journey in Vietnam with him\nand other renowned chefs\n We are packing already \nKhai will not disappoint   10 Stars", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "A fantastic and unique experience beyond the usual New American or Californian tasting menu. The dishes were tasty, well balanced and nuanced in flavor, incorporating fresh Vietnamese and local ingredients. 10 courses of good portions left us pleasantly full. Service was attentive and friendly, with chef Khai joining diners for conversation.\n\nLooking forward to returning soon!", "author": "Gary G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-27", "description": "I was really rooting for this place to be good, but for a Michelin star restaurant, the decor, food, and service need some work. \n\nThe dining room feels unfinished, the curtain that separates the dining room from the kitchen is terrible, it should either be a glass wall so we can see the kitchen, or build an actual wall and make it part of the decor, maybe a wine wall, but this doesn't feel like fine dining. There was only one waiter, granted we were one of two tables that night, which surprised me.  \n\nAlso,  the wine list was just a single piece of paper, there was no sommelier and no menu.  There should be a daily menu printed and given to the diners that we can use as a guide and take with us. \n\nThe food: \nThe seaweed salad was forgettable, the tomatoes and grapes in there also didn't seem to do anything.\n\nThe lobster soup was not a favorite of mine, the flavor didn't shine through and the texture was like a hot and sour soup.  \n\nThe foie gras was nicely cooked but the cold pear under it didn't quite work, should have been poached or cooked in some way.\n\nThe lobster roll didn't have the complexity of a dish for this type of restaurant.\n\nThe fish was excellent, probably one of the best dishes of the night, great flavor, texture, just perfectly cooked.\n\nThe lobster was also very nice, well prepared, tender.\n\nThe lamb was nicely done, great flavor and there was good complexity to the dish.\n\nThe dessert was OK.\n\nAll and all, nothing really shined for me and I love both French and Vietnamese cooking and had higher expectations for this place.  It would be better to cut down the menu and focus on fewer dishes but really make them stand out.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "What an experience!  The 10 courses from tasting menu were visually beautiful, smelled sensational, and tasted amazing. This is Vietnamese food at its highest level.  Just look that posted Yelp pictures and yes... they taste as good as they look.", "author": "Foodking Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Here for a Saturday night casual date after a moving day. \n\nElegant and Asian decor and setting with good ambiance. The place had ~7 tables and was half filled during our seating around 6pm. Service was okay for a fine dining establishment as they didn't speak English very well so we couldn't get the ingredients for the dishes and was not given a menu at the end. The chef came out to greet each table, which is always nice.\n\nThis place has one of the greatest value for fine dining out of the places we visited in San Francisco at $115 pp with creative Vietnamese fusion elements. Absolutely loved the seared foie gras (5 stars) and the butterfish (5 stars) both with excellent flavor and perfectly cooked. Though dessert was a little simple, but loved the Durian!\n\nTLDR: come here for a Vietnamese fusion fine dining experience at excellent value with GREAT food!", "author": "Nancy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "WOW!  \n\nWhat an amazing dining experience.  I'm Vietnamese, super picky and LOVED this restaurant.  \n\nKhai Duong, chef and owner used to be the owner of Ana Madera.  I feel so lucky to be able to taste the art he created last night.  \n\nThe restaurant seats about 20 people and is a 10 course omakase style presentation, where the chef picks what you eat.  Any food allergies or special requests like vegetarian needs to tell them 48 hours in advance since he literally prepares each and every dish for you.  \n\nWe went last night for a work dinner and I had some very picky eaters on the team.  But the way Khai presented and cooked each item, it was so beautiful and tasty that they ended up just eating it everything!\n\nWhat a very special treat.  Thank you so much Anh Khai and Roberto for taking such great care of our group!", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Very very delicious Vietnamese food! And this is so special like omakase style service. \n\nChef Khai is so kind and friendly . He spent a little while to spoke with us ... \nnice to tried out \n\nDon't forgot to make a reservation first", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Is it possible to give this place TRIPLE Five Stars? HIGHLY RECOMMENDED as A PICKY EATER. \nI was born and grew up in VietNam. My mom couldn't afford cooking and running business at the same time so she gave me funds to buy dinner. Meaning I have been eating so much REAL Viet foods everywhere in Vietnam and I have good enough knowledge to compare all the Viet foods in USA. \nSo, a friend recommended us to try Khai. At first I thought this restaurant is just an Asian Fusion place. But I was totally incorrect. \nThis place is THE BEST of THE BEST of THE BEST ( if I can go on) and THE MOST AUTHENTIC Vietnamese restaurant in The Bay Areas. \n1. Let's talk about the service: \nI wonder why some people complained about the service here while I found they have the best service in town. Only one server and Mr. Khai were there at the time, they came to every table to talk to us, explained about each food and where the ingredients came from. Silverware sets were changed after every single course. \n2. Let's talk about the courses: ALL OF those courses HAD BEAUTIFUL PRESENTATION. So thoughtful. I can strongly feel Mr. Khai 's PASSION in every bite throughout the dinner. HIGHLY RECOMMENDED!!!!!\n\nYou will have 10 surprised courses and no menu will be given to you except the wine menu. I am not a wine person but I finished the glass after 10 courses. The wine and his foods went so well together. \n-1st course : white seaweed salad and the seaweed came from Nha Trang ,Vietnam.  Such a refreshing start. His fish sauce dressing for the salad is the best sauce that I have had. \n-2nd course : Foie gras (goose liver) -- OMG-- I had goose liver so many places but I have to say this one was the best. Something I had to open my eyes widely and said wow after a first taste. \n-3rd course : Crab noodle soup (banh canh cua ): traditional Vietnamese noodle soup and it tasted so authentic, i have to say more authentic than any authentic Vietnamese restaurant in the bay. \n-4th course : Cod ceviche with yam : the taste of crispy yam and cool ceviche and coconut dressing.Very distinct flavor but surprisingly works perfectly together. The balance of the warm crispy yam with cool ceviche was very unique. \n-5th course : Rice paper roll- this one is not something too interesting but I still liked it because of the presentation and of course his sauce is still the best in town. \n-6th course : Beef Tartare: SO DELICIOUS. We wanted to get more of this course but too bad we couldnt.  The beef was melt in my mouth, flavorful, tanginess, combined with the shrimp chip . Killing me!! \n-7th course: Bun Cha Ca La Vong-OUR FAVORITE- LIKE REALLY GOOOOODDDD- we ate this noodle many places before but for real tho, I never had such a TASTY dish where else but at KHAI. He cooked the fish and fish sauce all together therefore I could taste the sweetness from the fish in the fish sauce which made me feel like heaven on earth in every bite. LOVE IT ! \n-8th course: Lobster tail- so good. Just don't have enough words to describe how good it is . LOL \n-9th course: Lamb on eggplant: OMG- I hate lamb my whole life because of the smell, but I barely smelled that offensive smell in this dish. The eggplant was the best part tho. It was so soft that it just melted in my mouth and the flavor stayed inside my mouth for a while tho. Love it too! \n-10 course: OMGGGGG durian dessert. I GOT FOODGASM while eating this. The combination of durian and pineapple just killed the stinkiness of durian (if you don't like durian)  and I just wanted more of it. \n\nThanks Mr. Khai Duong - Who is in the top 10 famous Vietnamese chefs in Vietnam- for bringing the Viet foods to the next level. Your foods speak for a country we left behind and speak to younger generation that be proud of our cuisine. Viet foods are not only pho and bun rieu or banh mi. Viet foods can be as pretty and delicious as any other upscale cuisines . So proud of you Mr. Khai Duong.  We will be back !", "author": "Chloe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "This is one of my favorite tasting menus in San Francisco. Even at Michelin star restaurants, there is often a (or some) dish(es) that is (are) a bit meh. No meh dishes here! I'm shocked that Khai hasn't had even more buzz. From the seaweed to the foie to soft shell crab to the beef to the lamb. All spectacular!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Chef Khai's restaurant was a pleasure to eat at. My mom had told me about the chef as she had gone to Ana Mandara in the past and loved it!\n\nThere are two seating and everyone eats at the same time so hopefully people in your group aren't late. The food was very unique and aesthetically pleasing! My favorite was the the seaweed salad! So unique! \n\nBeing Vietnamese, I've grown up eating these types of foods. Chef Khai put a unique spin to it and it's a great restaurant for those who haven't ventured to try different types of Vietnamese foods!", "author": "Natalie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "The best Vietnamese food in town. I can't think of a complain for anything. Very detail. Khai is really nice to explain everything for us in Vietnamese. Of course, he is really confident about his cooking because it's really good.  Very proud of him to bring traditional Viet food to the next level.", "author": "Tran N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Amazing tasting menu by Chef Khai!  The restaurant is small, but very intimate, seating approximately 18 people.  Their wine selection goes very well with the dishes.  And their service is very personable, with Chef Khai even serving some dishes.  But the best thing about the whole experience is the food.  So exquisite!!  Each of the 10 dishes is bursting with flavor!  From seaweed salad, to rice crackers with mushroom pate, to lamb, there is just an exuberant amount of flavor in each bite.  Chef Khai would even explain the background and history behind each dish.  I was very impressed by the entire evening.  Such an amazing dining experience!  I highly recommend making a reservation if you are in SF.  \n\nOverall:  Amazing dining experience!", "author": "Joe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Utterly fabulous. Each dish prepared and served with great attention to detail.  Ingredients from Vietnam were new and exciting. Fish dishes incredibly fresh and meat perfectly cooked. Chef Chai is truly a master of flavors. Loved his interaction with us during courses as he explained his signature dishes. This whole experiences was truly \"0ne of a kind\" and \"not to be missed\". Treat yourself. You deserve it!  Ten StarsBravo", "author": "Susan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Get ready for a gastronomic seduction in nouvelle Viet cuisine. Each dish of the ten course tasting menu is exquisitely prepared and offered up as a precious gift to be savoured. You will be captivated by the masterful balance of delicate yet complex reveal of flavors dancing on your palate. \nProfessional wait service.\nFriendly atmosphere punctuated by Chef Khai's appearances.\nPris fixe.\nExperience of a lifetime.\nTry it. You'll  like it.", "author": "Linda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "The food was fantastic and very reasonably priced for what you get...\n\nBUT, the ambiance is very weird, wine list is very very limited for this type of meal (Vietnamese french, with no french wines). When you do a tasting menu only service people want the experience and you just don't get this here. Front of the house needs to be revamped and enhanced. You can tell this is a chef designed restaurant because the experience makes no sense but the food is amazing. \n\nGive people a menu! A menu gets people excited about the journey. The staff is also hard to understand when explaining the dishes so i didn't know what half of the dishes were. \n\nI don't understand the people describing the decor in any positive way. Its like a dead quit strip mall with a big curtain. You can also hear the staff complaining etc because you are just separate by the hanging sheet. \n\nFoods is good, probably worth a trip, maybe bring your own bottle of Chablis", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Late post from last night...finally a place to experience the Great flavors of Vietnamese food delivered in an elegant 10 course tasting menu by Chef Khai Duong", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Phenomenal dinner at Khai!\n\nAnother great experience at this wonderful restaurant.  Chef Khai is truly an artist!  Every single dish is a work of art. Not only it's eye pleasing, it smells and tastes wonderful.\n\nI highly recommend this place.", "author": "TopCat W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Delicious delicious delicious! Chef Khai knows how to use Asian ingredients to make delicious western-friendly food. I am impressed", "author": "Juni Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "Came for dinner with a few friends and this place really exceeded our expectations! The service was excellent and the chef himself came out a few times to introduce the dishes to us personally. My favorites of the night were the rice crackers that came w salted honey and mushroom purée. The foie gras. The black cod - how are they able to even get it to be so buttery and delicious? You will leave the meal quite full and so happy that you came. None of us really like durian, so the dessert was probably the lowlight, but we probably should have asked the chef if there was any way to substitute the durian filling for something else. The flavor profiles are really stunning, although, if you don't eat spicy, you might want to let the chef know, as a good number of the dishes have a little bit of a kick to them.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Absolutely PHENOMENAL dinner! First off, Chef Khai is so friendly and personable! For several of the 10 courses, he came out and personally introduced the dish and how it came to be. He took the time to meet and chat with everyone dining that night, which I loved. Now let's talk food - incredible and so so worth the money!\n\n-Seaweed Salad: One of my favs! Such a refreshing and zesty dish, perfect for opening our palates. \n\n-Mushroom Pate with Honey on Rice Cracker: Beautiful presentation! Rice crackers came out placed on a coral. Mushroom pate was very unique, using mushrooms Chef Khai personally picked from Oregon back in November.\n\n-Crab Sausage: Another one of my favs, and my boyfriend's all time fav! So unique, incredibly flavorful, and the mix of the tartness from the radish below the sausage and spiciness from the jalapeno sauce was perfect!\n\n-Vermicelli with Spicy Banana Sauce and Tomato Soup: Incredibly unique! Spicy banana sauce - who would've thought? Very distinct flavor but surprisingly works perfectly together. The balance of the warm soup with cold vermicelli was very interesting too!\n\n-Beef Tartare: MY ALL TIME FAVORITE, I cannot get enough of this! The beef was melt in your mouth good - perfect saltiness, tanginess, combined with the shrimp chip and kumquat juice...heaven in every bite. My favorite dish of the night! I could eat loads of this...\n\n-Butterfish: Buttery soft, melt in your mouth, incredibly flavorful...what more can I ask for?\n\n-Fried Quail: DELISH! Tasted just like fried chicken would taste, but a little on the salty side...Nevertheless, very good still!\n\n-Lamb: I usually hate lamb but this was SO SOFT and again, melt in your mouth. No strong lamb taste which is why I usually hate lamb. Very tender, fragrant...Loved it!\n\n-Coconut Roll with Durian: I'm not a huge fan of durian so I only ate about half but my bf loved it and he loves durian.\n\n-Lemongrass tea: Refreshing and soothing! Perfect way to end the meal.\n\nAmazing value for the incredibly high quality food and service. HIGHLY recommend! Will most definitely be coming back!", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Amazing!!! Each dish alone was delicious, beautiful presentation, but complimented the next course and there after...I would recommend the experience and I will be back again..thank you!!!", "author": "Yolie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Came here with my mom for a belated birthday dinner. Service was great and chef came out occasionally to present food and/or chat. The food was delicious and gorgeously plated with pretty generous portions. On the night we went, highlights were seared foie gras with mango and pickled vegetables, smoked tartare, and butter poached lobster tail with a jalapeno sauce. Small space with two seatings per night at 5:30 and 8:30pm so definitely make a reservation. They offer a wine pairing and also have a limited wine and sake menu.", "author": "Sarina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "If you want a special experience with gorgeous food in a gentle setting, then go to Khai. They have two seatings at 5:30 and 8:30 pm. Chef Khai, former chef/owner of Ana Mandara proudly presents each course to you explaining his thoughtful approach and the best way to enjoy. Every course carefully created and handcrafted by Chef Khai, even the fragrant tea served. \n\nOur table of six really enjoyed the entire experience and since we were having such a good time interacting with our server and Chef Khai, we took the entire 3 hrs!  They will pace you, but it is single course at a time. \n\nLocated in the design center area where other new restaurants like Omakase, Okane and Dumpling Time are enjoying excellent popularity. \n\nReservations are highly recommended as seating capacity is 26.", "author": "Randall F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-23", "description": "I was glad that I made the reservation a week ago, on a weekend, when I was ambitious enough to think I could get a break from work, I'm glad that I did as I was pulling 14, 15 hours days, and I have now a growing list of trips to make between now until end of September. Ten location, four countries, all work no play. \n\nSometimes the best medicine to an overstressed brain is a nice long dinner. And a long dinner was what I got at Khai. Ten course meal tasting. Khai is ambitious in its own ways. It's new, it's still in its in development stage, it's not quite high end but it wants to be. At $95 10 course tasting, I think it should be better. It is very flavorful. Some dishes are better even, than French Laundry, the lobster dish that is. The seaweed salad is quite pretty. The turmeric cod and noodles and soup is a standout. But this is, their early days I think. The chef is very talented. The servers are professional. It's modern Vietnamese meets French, cue the foie gras dish. But I was expecting something spectacular. You know when you want something to be extraordinary because I've had some amazing Vietnamese food and this was not that different but much pricier. I compare this to the early days of Lazy Bear hosted in that little place on Caesar Chavez,  family style, everyone forced to make friends with your cozied up neighbors after ridiculous long lottery ticket sale wait, this is sort of like that but more understated and more expensive. \n\nI think when you get to charge people at triple digits territory, people want surprises and finale that wowed them. I did not get that high. I got something in between and I left with nothing but ennui.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Had a lovely meal here with husband and a friend. Each course was delicious and the flavors were very clean. I'm pregnant right now so I really appreciated the fact that everything was not super salty. My favorite course was the soup course which the chef (who is super sweet) said he likes to eat late at night. Wish I could make that for a midnight snack!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Went to dinner last night. At first you wouldn't think you'd get full with their tiny portions but Good Golly Ms Molly - all the tiny, well presented, expertly executed bites added up to a perfect meal. Thank you Chef Khai!", "author": "Girl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This meal was so amazing. I recommend the wine pairings with the chef's menu. Every dish was unique and elegantly presented. We were STUFFED at the end of the meal and already planning to return.", "author": "D Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "I have such fond memories of Ana Mandara, and I'm not talking about the food. Before Ana Mandara closed in 2012, they housed some of the most epic parties in San Francisco and was the clubbing venue of choice by my friends and I.\n\nMy \"favorite\" memory (besides drunkenly slipping on the floor...several times): \n\nMy friends and I met this girl who kept saying, \"I'm a good girl\" and boasted about being a Sunday school teacher. It became awkward to talk religion at a club so I excused myself and went to the patio upstairs to get some fresh air. \n\nThirty minutes later I return to our table and this \"Sunday school teacher\" was straddling my friend on the chair and riding her like a bull. \n\nUmmm, I'm pretty sure Jesus would have raised his eyebrow if he saw that. \n\nOk, back to the review. To be honest, I wasn't fan of the food at Ana Mandara (2 stars) but when I read that Chef Khai was making a comeback with a fine dining menu that featured a durian dessert, my eyes glistened. \n\nHis namesake restaurant, Khai shares a space with Bonjour Patisserie (across from Zynga) and serves a 10-Course Tasting Menu for $95. There's two seatings: 5:30 pm and 8:30 pm (20 seats). A 24 hour cancellation is required for reservations otherwise, you will be charged 50% of the tasting menu per a person. \n\nNo menu is provided and is only provided upon request at the end of dinner so if you have food allergies, tell your server right when you're seated (they don't ask). \n\nT A S T I N G  M E N U ($95)\n(1) Fresh Seaweed Salad w/ onions, grapes, tomatoes, house dressing, mint: http://bit.ly/2j5bGQB\nA refreshing and less acidic take on Vietnamese papaya salad. \n\n(2) Wild Matsutake Mushroom Pate w/ rice crackers, honey, himalayan salt: http://bit.ly/2jsX1Sn\nAt first, the pate tasted bland but with a drizzle of the honey and himalayan salt it made the flavors pop. Loved the presentation of the rice crackers tucked into the coral.\n\n(3) Crab Sausage w/ matsutake mushroom, pickled kohlrabi, kefir lime, jalapeño: http://bit.ly/2iJYRNH\nInteresting, meaty texture. I really liked the tangy heat from the pickled kohlrabi and jalapeno.\n\n(4 & 5) Ocean Trout (?) Ceviche: pork belly, rice noodles, egg, green apple, herbs, mint & Tomato Soup w/ shrimp: http://bit.ly/2iDkLz1\nA light and refreshing take on Vietnamese bun especially with the crispy tart apple. Loved the soothing tomato soup. \n\n(6) Smoked Beef Tartare w/ starfruit, onion, coriander, tamarind, calamansi: http://bit.ly/2jGaWC1\nI liked the shrimp chips but the beef tartare tasted like cooked beef. \n\n(7) Baked Turmeric Butter Fish w/ dill, green onion, peanuts, noodles: http://bit.ly/2iK4KKI\nI usually despise cooked fish but really enjoyed this one, the fish was delicately soft and moistly flaky with a crisp skin. Me being nitpicky, since the noodles made an earlier appearance, I think another carb liked sticky rice would have been nice. \n\n(8) Golden Quail w/ roasted garlic, salted egg yolk, mashed cassava, potato, truffle oil: http://bit.ly/2ixJCcb\nSounded great on paper but this was my least fav dish. There was more batter than meat (less than teaspoon) and the garlic was acrid. The mashed potato and cassava were really gummy.\n\n(9) Pan Seared Rack of Lamb w/ eggplant, lemongrass, scallion oil: http://bit.ly/2iKcZ9F\nMy fav course, the boneless rack of lamb was incredibly tender. Really enjoyed the lemongrass essence. \n\n(10) Signature Dessert: Durian, coconut sauce, ginger, mint, pomegranate & Housemade Lemongrass Tea: http://bit.ly/2j5ajBe\nAs a durian lover, I adored this coconut jello roll that was filled with deliciously stinky durian. I wanted to lick the plate clean from the yummy coconut sauce. It was hard to eat though because the jello kept sliding off the spoon. The lemongrass tea was really soothing but could have used a touch more ginger. \n\nService was very kind but felt disjointed at times. They didn't have our reservations on file and there was only one table left which we were seated at. I knew going in it was a tasting menu only but it wasn't communicated to diners. We sat there for a good 20 minutes and no one brought us the drink menu until we asked. We both ordered a glass of white wine. Mine was chilled while my friend's wasn't. Odd. It was also odd that they would fully describe a dish before it came out, and again when it came out. \n\nOpening jitters that I'm sure they'll smooth over with time. \n\nI appreciated that Chef Khai was very hands-on and is very proud of his food. He personally delivered many of the courses and talked about how he foraged many of the ingredients from his home country, Vietnam.  \n\nA bakery café by day, they've done a great job transforming the space to a romantic and intimate dining area at night. There's seating for only 20 and tables are well-spaced apart.\n\nReally easy street parking. \n\nKhai is a huge improvement over the food Ana Mandara and it's nice to see elevated, fining dining Vietnamese food make an appearance in SF. Best of luck to Chef Khai!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Everything was super delicious! Our favorites were the foie gras, beef tartare, lobster over corn fritter, and lamb over eggplant.\n\nDishes:\n\n- Jellyfish salad\n- Foie gras with mango\n- Dungeoness crab noodle soup\n- Soft shell crab spring roll\n- Beef tartare marinated with tamarind over shrimp crackers\n- Lobster over corn fritter with keffir lime jalapeno sauce\n- Black cod with dill and rice noodles\n- Lamb with mok mok spice and eggplant\n- Ginger and lemongrass tea\n- Pineapple and durian ravioli with raspberry", "author": "Bo N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "The ambiance is nothing special, but the service and food were very good.\n\nThe great:\n- Coconut and durian dessert.  Incredibly delicious.  It's like a sheet of soft coconut flesh rolled around a durian filling, drenched in coconut sauce.  The coconut flavor balanced really well with the stinkiness of the durian, and the texture was fantastic.\n\nThe good:\n- Lamb and eggplant.  Nicely cooked lamb with a really flavorful outer crust.\n- Black cod.\n- Rice noodles with salmon, pork, and banana sauce.  Nice bit of spice.  Comes with a tasty tomato and onion soup.\n- Mushroom pate on rice crackers.  Great combination of pate, honey, and salt makes for nice flavor.\n- Beef tartar.  \n- Seaweed salad.  Nice crunchy texture.\n- Foie gras.  \n\nThe meh:\n- Poached lobster.  Nice texture but didn't really get a deep lobster flavor.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Celebrated our anniversary with a phenomenal 10-course tasting dinner and 5-flights of wine!  What a pleasure to be served by Chef Khai, a native of Nha Trang where I was born, who explained every piece of his work of art!  Now this is the true Vietnamese culinary experience...", "author": "thu b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "After a four year sabbatical, Chef Khai Duong returns to San Francisco with sublime nouveau Vietnamese cuisine.\n\nWith a 12 year run at the now-closed Ana Mandara and a stint as head judge of Vietnam's Iron Chef cooking show, Chef Khai is no stranger to success. His latest venture, Khai located in the heart of the Design District, continues his stellar legacy, offering a marvelous 10 course prix fixe ($95 per person) menu abounding with delicate flavors of his homeland.\n\nWith dishes from his childhood full of ingredients Chef Khai sourced himself in Vietnam, the tasting menu is sublime with flavors that meld well together and do not over-power. As of 18 January, the menu consists of:\n\n(1) Fresh seaweed salad: light and refreshing with good acidity.\n\n(2) Matsutake mushroom pate with honey and Himalayan salt on rice crackers: crunchy, savory and sweet flavors that blend together harmoniously..\n\n(3) Dungeness crab sausage served with kohlrabi, jalapeño and kaffir lime: tender and juicy with the right amount of heat. Why has no one done crab sausage before?\n\n(4) Pork belly ceviche served with green apple, herbs, mint, rice noodles and spicy banana sauce accompanied by prawn and tomato soup: light and refreshing meets warm and comforting.\n\n(5) Beef tartare with coriander, pepper, tamarind and kumquat served on shrimp chips: the bracing acidity from the kumquat \"perks up\" the beef, which is served medium rare rather than totally raw.\n\n(6) Black cod with diil, green onion, turmeric, vinegar and house-made fish sauce accompanied by rice noodles: flaky and tender with just a hint of \"gingery-ness\" from the turmeric.\n\n(7) Golden fried quail leg marinated in lemongrass served over a mashed combination of yucca and potatoes with salted egg: simple presentation, but an explosion of flavor.\n\n(8) Medallion of marinated lamb served atop roasted eggplant: tender, perfectly cooked lamb and the absolute best eggplant ever.\n\n(9) Rice roll stuffed with with durian drizzled with coconut sauce and pomegranate jewels: this dessert will make you forget anything you ever knew about durian (in a good way).\n\n(10) Ginger lemongrass tea: the perfect end to a great meal.\n\nWarm and gracious, Chef Khai himself introduced each course, entertaining diners with stories of growing up and traveling in Vietnam. The other server was earnest and friendly.\n\nDining at Khai is intimate: like going to the home of a very well trained, well traveled and creative chef who bridges the two worlds of Vietnamese flavors and gourmet preparation. Chef Khai, welcome back to The City and continued success.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "This was a great way to start my 2017 dining experiences.  I'm easily excited about food and meeting chefs.  So I was probably overly excited to go here with my friends, especially when Chef Khai came out to greet us and bring us to our table.  He was quite friendly, telling us about his past restaurant experience and his personal excitement about bringing special recipes and spices from Vietnam to share with us that night.  I could tell we were in for a treat.  \n\nYou should be prepared as the dishes are small, but tasty and filling.  Chef Khai and two others served us that night and with each dish, a lovely presentation and description was given.  I think my favorites was the turmeric fish, the smoked beef \"tartare,\" and the matsutake mushroom pate with rice crackers.  The golden quail and rack of lamb were stellar as well.   I was also pleasantly surprised by his signature durian dessert, as the smell was not as pungent as I expected it to be.  \n\nThe service was very good and the evening was very entertaining.  Between being relaxed and able to catch up with friends and enjoying the wonderful presentations of each dish, this was definitely one of those dining experiences I will remember for a long time.  I can't believe this is just a pop-up too.  I can't wait to see how Chef Khai expands his menu and what he decides to do next!", "author": "Maria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Amazing Vietnamese creations from Chef Khai! Although this place has only been opened for a year, but my husband and I have had a taste of Chef Khai's cooking before when he used to own Ana Mandara many years ago (now closed). This is a high end Vietnamese cuisine restaurant. I believe nuoc mam (fish sauce) were a part of most dishes served here. We had seaweed salad to start off and it was good. We chose wine pairing and I would HIGHLY recommend it if you are a wine person. Each wine (3) lasts you two entrees each and it was magnificent. I must give props to Chef Khai for this, he has done an amazing job at choosing the wine to pair with the dishes that he served. He has done a great job at bringing out the true flavors of Vietnamese food while presented each plate nicely. The only two dishes that I would say were non Vietnamese descent were the lobster and lamb. The dessert was mind-blowing. I'd recommend this place.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Fabulous 10 course tasting menu for just $95.\n\nIf you are looking for a delicious tasting menu for a great price, this is the place for you.  Although it is listed as a Vietnamese restaurant, it is really a familiar 10 course tasting menu with a tasty Vietnamese bend.  There are Vietnamese dishes, such as the seaweed salad to start, but the three main dishes are black cod, quail and lamb with a slight Vietnamese taste.\n\nThe ten courses start with a light crunchy salad with a tangy vinaigrette, then appetizers of mushroom pate, crab sausage, salmon ceviche, a light delicious tomato soup, and beef tar tare.  The three main courses are black cod, quail and lamb.  My personal main favorite was the black cod.  Dessert is a unique soft rice shell stuffed with a fruit pudding, covered with a cream sauce and raspberry sauce dollops.  The unique tea was a perfect ending.\n\nSo, if you like tasting menus, this is a great place to go at a very reasonable price.  This restaurant is all about the food.  And the chef, who comes out to talk to everyone, is a very nice person.", "author": "Jim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Khai is one of the best fine dining experiences I've had in a while.\n\nOr let me put it this way: New York's overblown 11 Madison should serve food this good.\n\nAt first I was a bit wary.  It's in the design district of San Francisco and we had no idea what to expect.  It only has eight tables.\n\nBut that wariness soon disappeared.\n\nEach dish of the 10-course tasting meal was presented and explained by Chef Khai Duong.  Our meal started off with a seaweed salad enclosed in a bell jar, followed by rice crisps and mushroom pate.  Next was sausage and jalapeño sauce, followed by a ceviche and soup (served atop a heated candle).  \n\nMy husband's favorite was the beef tartar that you scooped into three rice cups.  My favorite was the butter fish and rice noodles.  The noodles just soaked up the butter sauce.  Then we were served a fried quail wing on top of a yucca mash.  \n\nBREAKING NEWS: We may have a new favorite dish. We just had the lemongrass lamb with eggplant.  The combination of flavors was amazing and frankly escape my abilities to describe it.  \n\nOMG - just had the durian dessert.  In fact everyone in the restaurant was exclaiming the same thing.  It's like a soft egg roll of coconut with durian inside, drenched with coconut milk cooked in Grand Marnier.  Unlike desserts where you politely eat the dessert and leave the sauce behind, this was a dish where you sucked up every bit, leaving manners and decorum aside.  It was that good.\n\nSo, in conclusion Khai was fabulous.  One of the shining stars of the San Francisco culinary scene and potentially ready for the restaurant hall of fame.  It's certainly better than 11 Madison.", "author": "Curtis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Authentic Vietnamese food with a fine dining twist. I enjoyed the 9 course meal I had here and the setting is very intimate. Some courses like the pork belly salmon noodles were a bit underwhelming for me, but things like the mushroom pate, steak tartare and cod were incredibly delicious. I also surprisingly enjoyed the lamb, a protein I usually avoid and don't eat.\n\nI think the best part of this experience was how many different things you get to eat. This included a durian coconut dessert at the end, which was actually yummy for me. \n\nI'm hoping to come back and try the lunchtime menu soon.", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Run, don't walk, to this spot before it gets reviewed and you can't get a table. Amazing new delicious, affordable, intimate Vietnamese 9 course tasting menu spot. Takes dishes and elevates them while respecting their core essence of Vietnamese flavors. \n\nFood: 5, Service: 4.5, Atmosphere: 4.5\nCost to worth it rating: 5 (9 fine dining courses for $95)\nReturn worthiness: Yes!\nEve award: best fancified Vietnamese\n\nHighlights (in order of how much I liked them):\n- Fish: best fish dish I've had. Tender and silky mild black cod topped with dill. Replica of one we get at an everyday Vietnamese restaurant in San Jose but elevated times 100. 5 stars\n- Steak \"tartare\": I'm not a beer tartare person and luckily the chef isn't either. These small medium rare cooked soft chunks were combined with tamarind for some tartness and black pepper for space to make it outstanding. Using shrimp chips as a vessel was all kinds of fun. 5 stars \n- Seaweed salad: refreshing dish for a perfect starter that left you excited about the menu and wanting more. The glass dome presentation was impressive. White seaweed, thin slices of crisp jicama, grapes, tomatoes, mint, and peanuts made a lovely combination. It was my first time trying white seaweed which was a bit spiney and waxy. 5 stars.\n- Dungenous crab sausage: a cross between a Thai fish cake tod mun and an American crab cake. Using the dollops of kaffir lime jalapeño sauce was the way to go. 5 stars\n- Broth: tomato and onions in a mellow but irresistible liquid. It was placed on top of a candle which my dad said was his dream come true to eat a soup that's always hot. 5 stars\n- Lamb: tender and not too gamey. Eggplant underneath was soft and delicious. 4 stars\n- Bun bowl: classic but with a tasty reddish sauce that was poured over and raw salmon. Paired with that broth was a nice play on hot and cold. 4 stars\n- Quail: tiny bird fried in a crispy batted on top of yucca mashed potatoes with a bit of truffle flavor. 4 stars\n- Rice roll filled with durian: sweet version of a Chinese dim sum dish. I was initially scared of the durian but it didn't have an unpleasant odor or flavor--almost reminded me of jack fruit. Exterior rice roll was soft and just the right amount to house the insides. All laying on top of a shallow coconutty pool of sauce. 4 stars\n- Rice crackers and mushroom spread with honey. Unique presentation with the crackers lodged in white coral. Subdued flavors but points for something I've never had before. 3 stars\n- Atmosphere: tiny dining room with a capacity of 47. Loved how the chef kept coming out and delivering the plates and talking to each table. He legitimately looked thrilled when I called one of his dishes amazing.\n\nMidlights:\n- Wine selection: super small and different pairing plan. You got tiny pours per course and cycled through 4 different wines. Wines were fine but would be nice to get more variety and larger pours.\n\nLowlights:\n- Not on OpenTable: my online reservation site of choice to get points I've been raking up for over a decade. At least online reservations were available via Yelp \n\nLoved this place and raving about it to all my friends. A must try and would love to return.", "author": "Eve K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "It was such an honor to have been able to dine here at chef Khai Duong's restaurant. We were extremely lucky to have been able to get reservations the day of. We were visiting SF for a couple of days and I happen to stumble upon his restaurant and noticed there's a vacancy for that very same day. Needless to say, I jumped and yelled in excitement. \nI'm sure all the other reviews have said wonderful things and I will simply bore you with the same compliments, but it must be repeated as it is very much deserving. From the presentation to the actual food itself was superb! Throughout the dinner, as each dish is brought out, each having their own unique element in taste and presentation. You can tell that chef Khai really put time and effort into designing the look of each dish as well as ensuring the quality of each bite. Needless to say, the food was divine! \nI just want to take this opportunity to thank you chef Khai for being very accommodating to my family and friends that night. We thank you also for showing other people how Vietnamese cuisine can be upscale dinning as well. You are truly amazing and your humbleness just makes you even more wonderful. We hope to be able to make another trip to your restaurant and try other dishes of yours. \nCam on chu va men chuc chu that nhieu suc khoe de tiep tuc mang nhung am Thuc cua Vietnam den khap the gioi!", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Food is spectacular!! Very unique flavors and very tasty! There are only 2 seatings and it wasn't full. This is a hidden gem.", "author": "Toni E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Delicious meal.  The standouts were the butterfish, lamb, tartare, and lobster (last four dishes in the menu).  I enjoyed the tartare and tomato broth (with the ceviche) as well.  You experience the Southeast Asian flavors but they are not overly overt - very balanced and keeps you surprised.  I was skeptical about the durian dessert, but it ended up being delicious.  Good portion sizes - we were definitely full, unlike at some other places with tasting menus.  Chef Khai came out to chat and was quite friendly; the front of the house was also friendly and informative.  I think it'll get more popular once it opens in a space full time, but until then, go to be surprised and delighted.", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-12", "description": "I was excited about this place because I love Vietnamese food and fine dining so trying a refined French inspired approach peaked my interest .  For $115 a head tasting I expect explosive flavor or complex subtle ones and I expect a refined dining environment or an inspiring one at least. This was anything but. I typically don't write reviews but given the cost, this needed a comment.\n\nDecor\nSpace is a premium in SF but this strangely L shaped seating surrounding a curtain veiled kitchen is isolating and with curtains over the street facing windows too there isn't much to look at. I'd say expose the kitchen and create some obvious barriers to give something to talk about. Bathroom looked like it was fixed up over a weekend with second hand decor, fake flowers, a gash on the wall against a black painted background. \n\nPlating\nPlating was thoughtful but clunky. The first dish of seaweed is hard to eat given its gangliness. I can't tell why they give you both chopsticks and Western cutlery (which was sometimes taken away and sometimes left).Washed out Ikea personal cutting boards also seemed like an afterthought.\n\nFood (out of order)\nSeaweed starter is interesting as an amusement bouche, were it a bite or two but it's a salad. Interesting texture, flavorful tomatoes, good acid and crunch but a bit too much. \n\nMushroom pate and rice crackers- presentation with coral is unique but the crackers themselves are bland and the mushroom pate is tasteless. Salted honey is interesting and hightened the mushroom pate somewhat but overall not memorable.\n\nSoup and noodles - this mix of proteins and noodles reminded me of a dish I had in Vietnam where you dunk your noodles in soup. In this case the soup was a tomato broth. But we were told to alternate eating noodles and soup. Soup broth was nice but didn't do much to highlight the noodles salad.\n\nPoached lobster\nClassic butter poached lobster. Ok but nothing very Vietnamese about this or french.\n\nFoie gras\nSeared perfectly but no flavor at all\n\nBeef tartare\nNice blend of French and Vietnamese using tamarind and a watermelon radish and a rice cracker. But subdued. Cheap presentation on wood cutting boards\n\nButterfish\nTypically I love this fish and was excited to hear it was marinated in tumeric overnight. But that didn't add much flavor. Consume accompanying this was good and probably one of the more solid dishes\n\nLamb\nWell cooked and juicy and au jus was good. But not memorable.\n\nDessert\nThis was a mix of coconut flavors which I like but it had a Durian custard. I realize Durian is a polarizing flavor and is a classic SE food so I dont fault that since I don't prefer that flavor, but this was an interesting set way to end a meal.\n\nCost\n$10 for a bottle of beer and $20 for a glass of wine is insane", "author": "Jason W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-23", "description": "Bad ambiance, horrible service, mediocre food and for heaven's sake, please at least read about the wine you're serving before claiming that you can pair wine and serve lamb with the white pinot after you served red with a lighter food in the previous course.\nI give it one extra star for the tomato consommé and another extra star out of respect to the chef for his past, and hands-on involvement on the floor", "author": "Radyar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Fantastic experience with Chef Khai and Roberto!\nI have not had much exposure to Vietnamese food beyond the usual comfort pho soups, so it was truly eye-opening to have the opportunity to experience fine-dining Vietnamese. \nChef Khai introduced all of the dishes to us and explained his ideas and influence were from his growing up in Vietnam (such as the seaweed salad inspired by his mother's recipe). This added a personal touch to the overall dining experience. It was well worth the time and cost. The wine pairing was a pleasant addition as well. \nI felt that every dish from the 10 courses was delicious. I highly recommend this restaurant!", "author": "Jenelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Wonderful modern vietnamese cuisine. We enjoyed every course. Artful presentation, well balanced tastes. We will return! Chef Khai was also in the dining room throughout the evening interacting with diners.", "author": "Karrot L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Best dining experience to-date! 10 courses, each one is special. Chef's ability to create unique textures, impressive Vietnamese flavor combinations, high-quality ingredients native to Vietnam... wow! Everything was amazing & the dessert is truly something you can't find anywhere else like the rest of the dishes & complimentary serving design, simple to complex flavors!", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Chef Khai's dishes were amazing!! I'm a very big fan of Vietnamese food and I'm very glad I chose to come try this restaurant!! I've had some pretty good springs rolls in my lifetime, but chef Khai's spring rolls were offfffff theeeee hooook!!", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "loveee the presentation. when chef khai walked out premeal and shook everybody's hand(!) he told us we were in for something different; he was right y'all.\n\nidk when a la mario kart will kick in, but our menu was the 10 course prix fixe. every dish was so personal to chef's hometown (nhatrang) and life. some ingredients he hunted down himself in the jungles n shhh.\n\nand no, chef khai, i'm not vietnamese.\nand no, maitre d, i'm not on the food channel.\nbut \"gamma\"* for asking!\n\nour courses in order of appearance...\n\n(-_^) Fresh Seaweed Salad (http://bit.ly/2iXyUaM)\nhas collagen good for skin\n\n(^_^) Wild Matsutake Mushroom Pâté (http://bit.ly/2hKs7oL)\ndope plating (don't try to eat the coral)\n\n(-_-) Crab Sausage (http://bit.ly/2ir4PTJ)\nmost forgettable dish of the set\n\n(^_^) Wild Smelt Ceviche (http://bit.ly/2j0YoI9)\nmy fave dish of the meal\n\n(^_^) Tomato Soup (http://bit.ly/2iw0EEn)\nlike a soup my dad made when i was little\n\n(-_^) Smoked Beef Tartare (http://bit.ly/2iIfxDo)\nmy 1st time having semicooked tartare\n\n(^_^) Baked Turmeric Fish of the day (http://bit.ly/2hIdBZG)\nours was butterfish / walu. dat dill doe\n\n(^_^) Golden Quail (http://bit.ly/2iIknQS)\nfried quailicken n mashed nonpotatoes\n\n(-_^) Pan Seared Rack of Lamb (http://bit.ly/2iwbp9u)\nvarying texture. he got the \"magma\" spice himself\n\n(^_^) Chef Khai's Signature Dessert (http://bit.ly/2hKVe9A)\nreduced odor durian\nhe said i could learn the technique\nif i return brek lunch dinner lunch dinner\n\n(^_^) House Special Lemongrass Tea (http://bit.ly/2ird8PN)\nsurprise spicy, mild sweet. good\n\nlevel of NARRATION you get depends on which employee comes to your table. don't be afraid to ask for chef's story behind each dish - they're worth hearing.\n\nmore of an experiential TASTING menu than a stuff yourself meal (read: i met up w a besto for food afterward).\n\nENTRANCE is the left door even though both have hours posted on them.\n\ntbh i wouldn't gaf about online REZZES - despite the unavailabilities the internet kept telling me, i straight up called and got my own 2top. no outdoor tater seating tho.\n\nin a month or two once they're established he wants to get even more CREATIVE with the dishes. whoa.\n\n*chef told me that's \"thank you\" in vietnamese. bc i asked him.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "This place is amazing and I am sure will get its first Michelin star soon. The food was delicious, the wine was a perfect pairing and presentation was a story in itself. Be prepared to sit for a few hours but it's well worth it. \n\nThank you for making me a happy Jew!", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Believe what you have heard.  This place is fantastic.  We brought my mother in law here for her birthday dinner.  One of the Best choices we have made in a long time.  Everything from the presentation, to the people, the very personable Chef Khai and most important- the AMAZING food was spot on.  Highly recommended.", "author": "Uri L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "Every dish was delicious. The Chef came out regularly to explain the dishes to us. Loved the beef tartare, foie gras, and poached lobster.\n\nThe only reasons I wouldn't come back are the ambiance and service, which should be impeccable when you're paying over $100 a person. Servers were picking up plates when we weren't even done yet. We felt totally rushed, and I promise you we aren't slow eaters. The restaurant itself doesn't look nice. You don't sit down there and feel at ease and transported somewhere beautiful. It feels like what you'd expect from a casual Vietnamese restaurant charging $10-15 a course.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Everything we ordered tonight was amazing. Our waiter Tom was able to give great recommendations. Don't skip dessert!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "As someone who grew up with excellent Vietnamese food, both home cooking and restaurants, I wasn't sure if there was much to be surprised by with a fine dining take on food that was so familiar to me. In a sense that was true, so many of the flavors and textures were familiar to me, but with a new appreciation. \n\nWe also got the wine pairing which gave you a small drink of 8 or 9 different wines for each dish. The price was incredibly reasonable at $90 for 9 courses. I consider it one of the most interesting tasting menus I've had in the city and look forward to having more dinners here.", "author": "Linh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Ok, it's Vietnamese food.  I grew up eating Vietnamese food and other Asian cuisines.  I was curious about the ten course that was well decorated into small plates as featured in the Yelp reviews. And I needed to take my husband out for his birthday, and he loves all things durian, and Khai had offered as the dessert at the end of the meal, a coconut durian roll.  Their prefix menu was $95 for a 10 course menu.  How can you go wrong with that?  \nWhen we arrived, we were seated by a host who was a kid that was well dressed with a tie.  My first thought was that this was typical of an Asian family owned business.  The place was small and the ambience was modern and simple.  Even before dinner was served, Khai, the chief, came out to chat with some of his \"guests\" as he likes to call his patrons.  When the first course came, it was a simple seaweed salad nicely decorated in a glass bowl.  I thought to myself, I had many Vietnamese salads in the past, what would make this one different?  My first bite told me that this was not your typical Vietnamese salad.  The seaweed was not your typical green seaweed, it was white and almost translucent in color and appeared like it came from a coral in the sea.  I found it surprisingly unique and delicious; and it had the same taste that I was use to, but the texture was unique.  From that course forward, I looked forward to seeing and tasting the food I grew up with, but in a creative and culinary way.  \n  This is not your typical Vietnamese restaurant!  Khai offers a different way to enjoy Vietnamese food in a \"Michelin\" type of style.  To top it off, the dessert was a phenomenal way to end the meal.  My husband loved it.  \n  Warm atmosphere, creative and delicious food, and the price didn't even match what we would pay for the uniqueness of the experience.  We truly enjoyed everything, and we would definitely come back again.  Thank you Chief Khai!", "author": "Von C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Chef Khai is a magician! \n\nThis 10-course meal was just phenomenal. Each course took you through a journey of the flavors of Vietnam. My wife is vegetarian and she was equally impressed. \n\nThe wine pairing that goes with this experience, is phenomenal and every pairing is very well suited to the intricacies of flavors, that come with every course. \n\nThe staff is super amazing, friendly and attentive! \n\nWe will definitely be going here, again, soon!", "author": "Kedar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Dining at Khai last night was such an enjoyable experience for 3 main reasons: \n1) The food was spectacular: each course was expertly prepared, with so many dishes very memorable. There was a great balance of flavors, each bite more exciting than the previous one. \n\n2) price was very reasonable for such quality ingredients and expertise\n\n3)What made this restaurant even more special was chef's Khai's attentiveness and hands on approach. He greeted us once we arrived, ensured my dietary restrictions were met, was present throughout the dinner to introduce his dishes and he also bid us farewell at the end of the meal. \n\nI wouldn't be surprised if Chef Khai gets a Michelin star soon, so check this place out before everyone knows about it!", "author": "Lan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "My favorite dishes are Fresh Seaweed Salad, Wild Matsutake Mushroom Pate', Crab Sausage, Wild Salmon Ceviche, Smoked Beef Tartare, Pan Seared Rack of Lamb, Coconut Rolls filled with Durian, and House Special Lemon Grass Tea. I guess I like almost everything :D Customer service is really nice too.", "author": "Nina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "If you are going for atmosphere, this is NOT the place for you. It's really situated weirdly with a black curtain being the main focus. It was also pretty drafty. BUT, I came for food and was super happy. The meal was exquisite and I experiences tastes I have never experiences before. It was also nice to have Chef Kai come out and tell us a great story about one of the dishes we had.", "author": "Matty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Chef Khai is gracious and immensely talented. My table had some picky eaters with all sorts of last-minute asks of the chef (sorry!), and he handled all of this with ease and was able to cook up the most delicious alternatives for everybody.\n\nThe food is sublime & otherworldly. Chef Khai explains each course with care, with humility and pride at once. Each course was so delicate and delicious, and infused with a harmony of flavors from far-reaching parts of the world (e.g. ocean kelp from Vietnam, or mushrooms that the chef had personally foraged in Oregon the day before). If I had to pick, the soup, fish, and lamb were my favorites, but everything was a delight! The meat / fish courses truly melted in your mouth.\n\nI came here for my birthday celebration and was having a tough time choosing which place to come for my special night! I am so, so happy that fate brought us to Khai. What a treat. At this price point, this meal is a steal for the quality and quantity - not a huge splurge - I would recommend it both for a special occasion and a treat-yourself date night.\n\nThank you chef - we will be back soon!", "author": "Sonya H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "What an exquisite dining experience! Chef Khai's delicious dishes are super creative and unique. He clearly takes great care and pride in selecting the best ingredients. We were amazed to learn that he traveled up to Oregon to forage for the amazing mushrooms used in several of the dishes we were served. He also was able to accommodate different meals at our table as we had one meat eater, several pescetarians and another with a severe dairy allergy. The flavors were all superb. We cannot wait to go back! Thank you, Chef Khai, for preparing such a memorable meal for us!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-15", "description": "Was very excited to eat here.\n\nEvening started off badly--we were the first to arrive, treated stupidly by the person who greeted us  (I want to say rudely, but I think perhaps he thought what he was saying was polite and made sense), then among the last to receive our drinks after 20 minutes of waiting (again, despite being the first to arrive).  Inauspicious start.\n\nThe decor is very blah.  One wall is a curtain...blocking off the kitchen I guess?  It would've been cuter to leave the kitchen open...everything on our side of the curtain was boring.\n\nThe wine pairing was solid, with excellent descriptions.  However, it didn't come when it was supposed to.  Each pairing was supposed to be for two dishes...so why would the pairing only appear after the 2nd dish arrived?  We'd often be left without food or drink, watching others eating/drinking exactly what we ordered.  It's a fixed menu with a wine pairing...it should not be so difficult to get it to the tables at the right times.\n\nThe service was both good and bad.  Good in that the chef himself regularly made appearances to explain things.  That was wonderful.  Bad in that you could hear the other servers explaining things in different ways.  I.e., the way the food was being described to us was never consistent with other tables!  It's a fixed menu...learn it!\n\nThe food.  There were three dishes I absolutely loved.  For instance, the lamb I thought was truly excellent.  As were the black cod and the fois gras.  The others were just...fine.  Nothing great, just fine.  I hated the dessert, and not just because it was durien...I didn't like the texture/squeak of the wrapper.  Combined with the durien, this was a bad way to end the evening.  Also, I appreciate the use of edible flowers as a garnish...but it loses its uniqueness when half the dishes are plated with marigold petals.  \n\nOverall, we planned in advance to get a reservation to a restaurant which is not cheap...and were disappointed.", "author": "L Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "The food at this restaurant is utterly beautiful, and much more moving than than many Michelin-starred meals I've had. The food is deeply flavored, beautifully presented, and flat-out delicious. It is also a complete reinvention of traditional Vietnamese food, and not just \"refined Vietnamese\" like you see elsewhere. \n\nI loved that Chef Khai came out with every course to chat with the diners and talk about the food. I also love that when his ginger tea in the dessert course evoked so many memories I nearly cried, he just calmly said he wanted his food to bring memories so it was good I was enjoying things.\n\nThe wine pairing is far too generic for the food so I do hope they find some more suitable pairings, but the lack is not going to keep me from coming back again and again.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "First time in San Francisco and we were lucky enough to come across this restaurant!  Amazing is what I would rate this place.  Beautiful presentation, amazing taste, awesome chef and staff!  Need to put this on your list if you're there!!!", "author": "Toni W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Updated June, 2018\n\nOutstanding innovative flavors bursting in novel combinations of ingredients! This aesthetically pleasing modern tasting menu only Vietnamese fusion restaurant should definitely receive at least two Michelin stars.  This was the second visit wife and I had on a Saturday 5:30 PM opening time reservation, and unlike the first time, the restaurant was almost filled as we arrived.   We were promptly seated by Khai who seems to be the host, owner, chef and waiter combined and one assistant.  The restaurant is very tastefully decorated, with only eight tables. There is a pretty good wine and sake list but only two beers, one of which was available.  Ah, the food!  About ten courses of Vietnamese and French fusion- each delicious, bursting with flavor, and very innovative. The chef seems to know exactly how to create a combination of ingredients to be uniquely delicious and memorable.  Especially memorable were the foie gras, halibut, lobster, and lamb as well as the dessert, coconut delight and ginger tea concoction.  We loved this restaurant when we fist visited it a few months ago, and this second time, we loved it even more.  Wife felt this was to Vietnamese food what Kusakabe is for Sushi (superlative).  I agree. There will be many more times in the future, which we eagerly anticipate. \n\nPrevious Review:\n\nAn aesthetically pleasing modern tasting-menu Vietnamese restaurant.  Reading an excellent review, we reserved a table for a Thursday 5:30 PM seating.  The L-shaped room with only eight tables did not seem that small as there was sufficient space between tables and the décor was pleasingly modern. As soon as we were seated, the chef came out personally to review my wife's minor food allergies. The tasting menu ($115 per person) was very innovative and tasty, at times a bursting gift of delicious flavors to the palette. Especially outstanding were the foie gras, ceviche with spicy soup, black cod, lobster tail, and the wonderful melt-in-the-mouth lamb rack!  All the dishes were concoctions by the Cordon Bleu trained chef, a beautiful fusion of French and Vietnamese cuisines. For a tasting menu, the portions were substantial and by the time the dessert, a wonderful, creamy, coconut delight, arrived with lemon grass and ginger tea (again, an invention), we were quite satiated.  There was a small but interesting list of wines, sake, and beer (only two kinds of unusual Japanese beers -sake and grapefruit flavored.  There should be more options.) The service was personalized, attentive, and professional. Overall, wonderful and very satisfactory! Loved it!!Will come again.", "author": "Hoyle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Probably one of the best meals we've had so far this year! Every dish was visually beautiful and flavorful. Definitely a must try!!", "author": "MARILYN C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "Would love to see some banh xeo or maybe a noodle course or a refined pho course in the tasting lineup. Server was a bit difficult to understand when he was explaining each dish.      Perhaps the first course could be offered in cocktail format (using lillet since they are not licensed for anything stronger than wine.)", "author": "H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "A truly extraordinary experience.  My wife and I read about Khai before our recent visit to S.F. from Oregon and made a reservation.  We spent 4 days in S.F., visited and enjoyed museums,  shopping and some good meals.  But Khai was unquestionably the highlight of our visit.  Other reviewers have described the food in detail so I don't need to say more, except to add that chef Khai introduced us to foods and flavors we've never experienced.  I want to add that chef Khai and his aides could not have been more gracious and helpful.  We're already planning a return visit and our first destination will be - can you guess? - Khai.  P.S. We visited Khai on a Saturday for the 5:30 seating and there were empty tables.  We're disappointed in any food interested  San Franciscans for letting this happen.  Hurry up and go to Khai.  You won't be disappointed.", "author": "Melvyn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Cuisine is fantastic. Truly a great show of modern Vietnamese flavors. I would highly recommend the place. A bit disappointed in the measurement of wines by the glass.There was no consistency for the $15 price. Furthermore the wine menu isn't fantastic. I have attached photos of the variance of pours.", "author": "Ree M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "It was simply a very good dinner that I had with some friends at this restaurant.\nThe presentation of the dishes were beautiful, entertaining and unique.  They know how to convert simple Vietnamese dishes into something exotic and delicious.  \nThe service was professional and friendly.\nThis restaurant is not for someone looking to get a quick bite or on the run.  \nGood job and well done Chef Khai!", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "What a wonderful experience it was to dine at Khai. The food presentation is amazing! So beautiful to look at and delicious. The pate and smoked beef tartare were among my favorites! I like trying a little bit of a lot of different things so this 10 course tasting menu was perfect. And the wine pairings went well with each dish. \n\nIf you want to impress family, friends or business colleagues this is the place to go to. It will be a memorable experience, I promise!", "author": "Valerie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "My family and I have been a huge fan of Chef Khai since his Ana Mandara days. We were pretty devastated when they closed that beautiful. We went through stages of mourning, depression, and almost tore our family apart. So when I found out Khai was making a return with a restaurant in SF, we had to go!\n\nHis new space is nowhere the size of his old Ghiradelli Square space. Its a cute little area to make it more intimate so Khai can interact with all his guests. All the dishes represent his time growing up in Vietnam with his own spin to them. Overall, its a great chef-diner experience and the dishes are well thought out. Portion wise, it's perfect. Not too little, and not stuffed full either. Just don't expect a spin off from Ana Mandara :(\n\nAs much as I appreciate this restaurant, please bring back Ana Mandara in some kind of form!", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Absolutely Incredible!  Perfection!  Every dish is better than the previous one. What a culinary experience with chef himself serving his dishes and telling us how each dish is prepared. Unique flavors combined with unique experience.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Amazing 10 course tasting menu using Vietnamese flavors and spices. We love Vietnamese food and have been to Vietnam four times. You will not find any of the 10 courses at any Vietnamese restaurant anywhere because they are unique creations of Chef Khai. However, if you like Vietnamese food and enjoy trying new dishes, you will love this restaurant. Our favorites were the wild salmon ceviche with rice noodles (similar to bun only much better), the marinated fish of the day (butter fish), wild mushroom vegan pate and the signature durian rice roll dessert.\n\nWe are from the east coast and every time we will return to visit family in SF, this restaurant will be at the top of our list.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Simply outstanding. 10 course tasting menu. The chef's attention and involvement in the whole dining experience shows through in his usage of flavours and textures. The opening course of a bright tart white seaweed salad sets an engaging tone of balanced Vietnamese fusion cuisine. The soup and salmon/pork noodles course was especially delicious. Highly recommended!", "author": "Jesse M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "After procrastinating on making dinner reservations for a trip to San Francisco, I was excited to get in for the 8:30 seating due to a cancellation. I have eaten a lot of Vietnamese food over the past 25 years as my wife (and thus my in-laws) are from Saigon, but have never had a meal that presented all of those flavors in such an innovative and subtle way. The plating of each of the 10 courses along with the explanations of each dish provided in person by the chef made for a very informative and intimate experience. I can't wait to come back.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "This place is unreal.  The Chef comes out and explains every course.  Each course is quite different then anything I'd ever had and truly memorable.  Had an amazing White Pinot, which I wasn't aware was a thing.  This, along with the interactions with the Chef, and amazing food, made the experience one I'd love to come back to.", "author": "Jesse R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Had a great experience at Khai. The food tasted great and the chef was warm and friendly. If you're only experience with Vietnamese food is pho, you should definitely check this place out. Chef Khai brings a lot of experience to cooking, and you can taste his latest creations here. \n\nThe restaurant is in a shared space, so it's definitely a bit cozier. But the decor still feels elegant. The food is excellent, and the experience was a lot of fun!", "author": "Richard S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Had the prefixed dinner here on Friday at 5:30 pm. Chef Khai did a wonderful job with his menu.  True Vietnamese flavors in his fine modern dishes. Wonderfully delicious ingredients. I enjoyed every bite. Go here if you enjoy Vietnamese flavors (fish sauce and all).  $95 prefix, very reasonable price.", "author": "Phish P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-02", "description": "Great showcase for the chef, but some courses, service and lack of non-alcoholic drinks  made the experience lackluster. Went to Khai last weekend with a friend for the 5:30 pm sitting. We arrived on time; however, two tables were 20+ minutes late. Given that service doesn't begin until everyone is seated and has drinks, it was a long wait. We were offered a choice of beer or wine. However, neither of us drink. Waiter seemed flummoxed by the request for non-alcoholic beverages, and said that other than water, we \"may have a few cans of 7-up in the back\". No tea, coffee, juice or other soda options. So our meal began with a 20-minute ice water course (no snacks were served during the wait). \n\nOnce service began courses were beautifully presented, often with a personal description from the chef, who is kind and enthusiastic. Taste was hit and miss. \n\nHits: 1) the sauces across the courses; chef has a real gift here. A week later can still remember the salty plum and spicy banana sauces. 2) fantastic black cod, perfectly cooked 3) Rice noodles with salmon tartare, pork belly, and banana sauce: creative mix of flavors and fun to eat 4) Beef tartare 5) white seaweed salad: like nothing we had eaten before (although the supermarket green grapes seemed out of place). \n\nMisses: 1) rice crackers with mushroom pate, bland. 2) poached lobster on a bed of roasted corn: flavors more in line with a New England lobster boil, out of place. Lobster also a bit chewy 3) Lamb and eggplant: thyme seasoning and prep also seemed out of place with the theme and arc of the experience. 4) Coconut and durian dessert: intriguing flavors and textures, but durian a funky specific taste that doesn't agree with many palates. Surprised that this was the only sweet course out of ten. Did appreciate the hot tea at the end--why not offer this as an option earlier? \n\nOn reading the reviews many note the personality and involvement of the chef. This is real, and a big part of the experience. But given the mixed food and service, and lack of drink options it's hard to say it was worth $115 per person (note, $20 more pp than advertised when making the reservation).", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "Made reservation for dinner here a month ago to celebrate a special occasion.  We showed up at the appointed time and the place was closed.  No email or message received beforehand.  We called the restaurant as we were standing outside on the sidewalk and were told their oven broke so they closed for the night.  It would have been nice to know that before we trekked through the city to get to this rather remote and inconvenient location.  Poor customer service!", "author": "Karen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Khai eating experience is exquisite to the eyes and sensual to the palate.  The presentation is simple, creative yet gorgeous.  This is a delightful and tasteful twist to traditional Vietnamese cuisine.  Khai is a testament to art and science embodied in cooking.  We loved this 10 course experience.", "author": "Brittany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I was blown away. Chef Khai has creativity and a passion for food that cannot be denied. A small intimate setting, much different than Ana Mandara. I loved Ana Mandara, but I dont miss it anymore. Tonight my wife and I experienced a wonderful meal at the hands of Chef Khai. Ive eaten his food many times years ago. But the chance to see and speak so friendly with the chef that had prepared our experience was such a treat. we left feeling like the chef was a wonderfully nice man and an amazing artist. I really want to go back.", "author": "Kiyomi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Mind = blown. \n\nI didn't know food could taste this good. \n\n--\n\nWhite seaweed salad w/ jicama & tomato. \n\nRice crackers with honey and mushroom pate. \n\nSeared foie gras with fresh mango. \n\nTomato soup w/ prawns and spicy noodles (on the side). \n\nSmoked beef tartar & shrimp chips. With smoked lemongrass, tamarind sauce, coriander, black pepper, lemon juice, key lime. \n\nThere's more. This is just the beginning.  So good!", "author": "marc c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Absolutely loved the dinner experience - 10 delicious courses, clean flavors and great ambience. And to top if off, the chef is there to tell you stories of ingredients, where they are sourced from and how the courses are seasoned. I pretty much loved every thing, but my favorite was actually the tomato soup :). Wine is great, and the price point is very reasonable. Oh yea, very easy parking in the neighborhood. A must go, can't recommend enough!!", "author": "Pankhudi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "So yummy! Chef Khai cares about his craft and his customers. Extremely affordable (def come and visit now before he becomes uber famous since prices would likely go up). Food was delicious! Restaurant is kept warm so don't wear too many layers/long sleeves. My favorite was the vermicelli with spicy banana sauce!", "author": "Holly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "20 stars! Why would you go to Manresa, Jardiniere, Keiko Nob Hill or Coi when you have Khai? The food is actually better & is so reasonably priced. Each and every one of the 10 courses were phenomenal. The service was warm & impeccable and the Chef/Owner, Khai, spent time with us & is so passionate about his food. Standouts were the lamb, smoked beef, butter fish, white seaweed salad.... Well, everything! Complex, clean and unusual flavor combinations. Can't say enough about how good it is. GO! About $95 per person.", "author": "Ottis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "This place was awesome.  Everything we ate was delicious.  Chef Khai personally presented each course himself and described the influence behind the flavors.  Very affordable for this type of meal.  Beautiful presentation.  I loved every dish.  I was pleasantly surprised by the lamb.  I normally do not like lamb and never order it, however, if it was always prepared the way Chef Khai made it, I would order it every single time.  He used a Vietnamese spice that took away the gaminess of lamb and made it so flavorful.  The butterfish was delicious, melted in your mouth.  And the dessert and tea was to-die-for!  Overall, I will recommend this place to all my foodie friends.  My only complaint was that it was pretty warm in the restaurant, maybe they can lower the temperature a little since some of the courses paired with hot soup or tea, and the wine pairing wasn't available that night.  But we made up for it with a fantastic bottle of pinot!  Thanks for the amazing meal Chef Khai!", "author": "Kotim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "The food here is really very good and interesting. Two of the dishes were particularly outstanding, and the rest were solid. Worth coming for the food for sure. \n\nThe service is fun because the chef personally delivers many of the dishes and explains them, which is awesome. \n\nBut the wine pairing was poor (and oddly executed). And the ambiance is really bad. I expect they will fix both over time, but right now it is a pretty awkward situation.", "author": "Amjad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "I had a great dinner with excellent taste and nice decoration as a 5 stars Vietnamese Cuisine by chef Khai. I highly recommended to try this restaurant.", "author": "Trang L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Fabulous Vietnamese 9 course tasting menu with Chef Khai. This intimate venue is tucked away at 655 Townsend. The hospitality is warm and welcoming to make you feel at home. All 9 courses are uniquely delicious. I was not sure what to expect but pleasantly surprised by the presentation, the flavors and freshness of the ingredients.  He came out of the kitchen after several courses to meet us, explained the ingredients from Vietnam and answer questions. The pictures and description of the menu are accurate. I will return and recommend Khai to my foodie friends and neighbors.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I just had dinner at Khai this evening, and cannot wait to give it a review. To be honest, I think this is one of the best 9/10 course prefix menu you can get in the Bay Area. Everything is wonderful. They have food materials from Vietnam. My personal favorite is the white seaweed grown in the deep ocean in Vietnam which I have never had before. In addition to the delicate taste, the staff here are really friendly. Chef Khai is so nice to come to the table to explain to the guests about his inspiration.", "author": "Rainee J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Amazing food and intimate yet professional service. We even got to meet the chef probably given we were the one of the two tables for the seating. I'd never been able to relate Vietnamese food to fine cuisine, but this was definitely one eye opening experience to savor and experience Vietnamese food in completely different format and style. Excited to see if they receive any Michelin star - yes Khai is this good!", "author": "Nina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "Just lovely. Super creative, delicate food with incredible attention to detail. Stumbled in here by accident for a company dinner. I knew it was Vietnamese food, so I imagined huge bowls of pho or bun. Instead, I was greeted with course after course of refined and original creations -- poached lobster, crackers nested in sea corral served with a mushroom pate, rice noodles, tiny slices of raw salmon, some kind of plum sauce, served with a magical winter melon and tomato broth, lamb, fish, etc. The atmosphere is intimate and cozy, with candles burning and fine carpets on the floor. We were totally blown away when we learned it was a bakery by day.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "So good! Great ambiance, service, but most importantly delicious food. Have never had Vietnamese cuisine prepared with such care. Also the chef came by and would tell us the story behind each dish and the ingredients used. Highly recommend!", "author": "Allene J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Food here is unlike anywhere else I've been in the city. The presentation and quality are incredible but the stories the courses tell of chef Khai's life in Vietnam are what make it a special, authentic experience. The service was amazing and the wine pairings were perfect! As Khai grows into its space, I hope this place gets the recognition it deserves.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "As most reviewers, I, too, came from Khai's old Ana Mandara restaurant years back! Khai's tasting menu is definitely fine dining Viet food mixed with his own flavor that he took from Vietnam. Portions were good. If you're like me, I'd much rather not be disgustingly full, but this place didn't make you feel hungry at the end either. Every dish was special and unique! It was all delicious. Personally I am NOT a fan of durian, but he made its pungent taste on the more mild side. I do, however, still miss his old Ana Mandara restaurant! Chef Khai, if you're reading this, make another one please!!", "author": "Celine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Absolutely amazing. If you come to San Francisco and miss this gem of a restaurant then you have missed an opportunity of a lifetime to try so many amazing foods. I would strongly recommend Khai to anyone who is looking for a unique dining experience. I will most differently return.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "So I set up a reservation for 6, invited business clients. Going to be a fun great evening. Then the restaurant called and confirmed, then 3 days later they called and told me that they had overbooked and I needed to come another night. So be very careful if you think you have reservations, their system seems very disorganized. I haven't been ever been disinvited to a restaurant that I have had reservations at.", "author": "Horace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "I came here with my family for my birthday and we are very happy we did! I've eaten Vietnamese my entire life, but this opened my eyes to just how exquisite the cuisine could be. The fixed ten course meal paired beautifully with the selected wines in the flight. My favorite courses were the vermicelli with butter fish in tumeric sauce, beef tartar with shrimp crackers, and Chef Khai's signaure durian wrapped in banh cuon in a coconut and raspberry sauce. Before every dish was served, Chef Khai would explain the dish and his inspiration behind the flavors. Highly recommend for delicious food and a great dining experience.", "author": "Tilly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "The wife and I had the privilege of dining here New Years Eve. The food was incredible and having Chef Khai come out and explain each dish added that extra touch which wasn't really necessary, but appreciated nonetheless.  My favorite dish was the pork belly rice noodle with tomato soup. If reminded me of a very well made Bun Ryu soup.  The most unexpected dish was the signature desert which had durian mixed in with coconut, ginger and pomegranate. Knowing how odd this particular fruit tastes, I was pleasantly surprised at how well the desert tasted and how well it was executed. Well done!  \n\nIn short, if you're looking for a new culinary experience with a southeast Asian twist, Khai is most definitely worth a try. \n\n(I'm only giving 4 starts for now since I know that Chef Khai is only just beginning to spread his wings with his latest creation... We look forward to returning in a few months to see how  much his creation will have grown.)", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "As of this writing, there is little I can add that does not echo both the praises and the criticisms of Khai Vietnamese Noveau. In short: at its price point, the ambiance is barely passable, the service is average but professional, and the food-- most of it-- is unforgettable. Thus if you are any sort of reasonable, sentient creature, Khai is worth your visit, if for the food alone. \n\nThe restaurant is tucked away among a strip of similarly indistinct businesses, with the looming Zynga building across the street being the easiest landmark to guide you to the vicinity. The interior is dark and cramped, and your view is either the black curtains blocking off the kitchen or said Zynga building outside the window. There is nothing in the restaurant that evokes a personality of any sort; you're eating in, essentially, an emptied out office sprawl. And it feels that way. An atmosphere that is intimate but industrial, lacking character. Basically, it's a pop-up. You would be nearly fooled into believing the night will be unenjoyable. \n\nAnd then the tasting menu starts. \n\nChef Khai is unpretentious and heartfelt, and it reflects strongly in his wine offerings and his cuisine. Flavors are bold, and each dish provokes a delicate balance of home and haute.Many have described the menu, and perhaps it is easiest to compare the starter and the dessert is to realize the journey you will experience. An opener of a bright jicama salad inspired from Chef Khai's mother that tastes wholly Vietnamese traditional, with the classic pungency of mint, fish sauce, and peanuts with a translucent, chewy white seaweed being the lone surprise; a closing dessert celebrating coconut and durian, with a clever roll of coconut jelly cocooning the delightfully funky durian filling, becoming something different altogether. You'll find a tasting menu that builds and builds, both in daring and in gastronomic intensity. Each course is paced well, spaced with enough time to linger and reflect. Within the ten courses, you will undoubtedly find a dish that will make you pause. For me it was the \"tartare,\" an eye-rolling burst of flavor that was as if I was in a topsy turvy world where the star of ceviche was not fish, but beef. Spread upon a delicate chip, there is savory crunch, a punch of acid, and then indescribable deliciousness. \n\nOnce you find yourself at your seat at Khai's and focus on the experience itself, you'll see glimpses of what Chef Khai has brought back with him during his time away. Enjoy his company, his hospitality, and his food. You will not regret it.", "author": "H C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "The food was great and the staff was awesome! They explained each dish and they came out at a perfect cadence. My favorites were probably the crab sausage, the lamb, and the durian dessert. Also notable were the seaweed salad (probably the first seaweed salad I've ever really liked), the garlic quail, and the butterfish. The tartar, rice chips, and the ceviche weren't my favorites compared to the others, but they were still great, and the presentation on the rice chips was awesome, which made them worth it. :)\n\nKhai is definitely recommended and a great experience. We'll definitely return when he changes up the menu (to me, tasting menus are all about trying new things).", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Amazing food. Brilliant chef. Hands down best meal I've had in a long time, maybe ever.", "author": "Raquel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Amazing food and presentation, generous portions.  It  felt very special to have chef personally come out and describe most of the courses.  Allow 2.5 - 3 hours for dinner.", "author": "Robin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Best meal of 2017 and 2016.  Personalized attention, customize meal, 10 courses of delicious amazing Vietnamese food. The owner and chef shared a glass of wine with us and we couldn't be happier to be dining at his restaurant for our last day of vacation. Best night of our trip.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Absolutely masterful flavor combinations, and probably one of the best meals I've ever had in SF. The multi-course meal was amazing, from the refreshingly crunchy seaweed salad to the smoke lemongrass-lamb, to the *gasp* durian dessert. The chef was very sweet, personable, and had great stories for every dish and how it came to be. I couldn't be more impressed with the ingenious flavor/texture combos experienced during this meal. Had a lovely time here for my birthday (best bf ever). Highly recommended. Although the price seems high initially the amount and quality of the experience will be totally worth it.", "author": "Marina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Just Open, every dish is carefully crafted by the iron chef! The set menu is the way to go, great with wines. I love the fish, lamb, soup and dessert! Unbelievable.", "author": "Wilson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Amazing! A great dining experience. The chef really blew my mind with out of the world creations and pairings. A must try !", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Absolutely amazing dining.  Not a foodie guy; but found each dish to be delicious.  Never had that experience.  Presentation was artistic and flavors delightful.  Chose a Syrah which match the meal perfectly.  Great way to share New Year Eve.  People got to try this place\n\nDavid2", "author": "David T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-23", "description": "Found Khai a bit overbearing. Food is okay. Some dishes are better than others. Dinner took longer than expected.", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "My husband and I totally enjoyed the 9 course dinner with wine pairing.  Price was good for this type of dining.  Portions were good and adequate.  Chef Khai used a lot of different spices in his dishes.  Each dish was explained by the server.  Chef Khai actually came out from the kitchen, served some dishes and talked to us.  Service was good.  However we would probably not get the wine pairing next time.  We preferred white served first and then graduated to the heavier wine towards the end.  But at Khai they alternated white and red and we don't think the wine actually helped bringing out the flavor of the food.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "Trying very hard but food mediocre, long explanation of simple dishes, overpriced, a black curtain in dining area to hide the kitchen, and when I took a business call and stepped outside not to disturb the other diners the wait staff came outside to tell me the chef could not wait for me and that I should finish the call as I was disrupting the flow!  LOL  I am not making this up.  True.", "author": "Mariko T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "It is not really correct to categorize Khai as a Vietnamese restaurant. While Chef Khai takes full advantage of the flavors and spices of Vietnam, this is no just very good restaurant. It is truly Haute Cuisine. Chef Khai's concept of everything he turns out is beautifully sophisticated. Our starter was a white seaweed salad with just a touch of red onion, a hint of mint and a very delicate citrus vinaigrette. Just wonderful. Since this is a ten course tasting menu I won't go into each one, but some of the highlights were a crab sausage underlain with a slice of watermelon radish and dots of oil infused with pepper and key lime. The flavors worked perfectly together. Another was a salmon ceviche salad with noodles and green apples and a side of tomato and prawn infused soup; out of this world. A perfectly prepared medallion of lamb with Vietnamese spices that I couldn't identify over a lovely eggplant preparation. It ended with a surprising desert of young coconut wrapped around durian with a coconut cream sauce with pomegranate seeds. Lovely. Finally, a cup of lemongrass ginger tea which was not only delicate but also somehow unctuous. Definitely do the wine parings. They are beautifully thought out. Where are the Michelin reviewers?  Get there soon.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "We were running late to our reservations at 5:30 pm. Roads were blocked off, had to literally hop off our Lyft and walk a few blocks to catch a different ride.  I was going to give up and call to cancel our reservations and willingly lose that $100 fee for cancellations. But the lady on the phone was so sweet and accommodating that she told us to come, they were about to serve the first course and if anything we will just miss the first two courses. We rushed over there and got there just in time for the second course. OMG I'm so happy that I went!!!Vietnamese food to the next level. AND lucky for us they brought out the first course for us to try! Everything was beautifully presented and tasted delicious. My favorites were the foie gras, black cod fish, the lamb, and the durian desert! Chef Khai wasn't there this time but We'll definitely be back! Oh and thank you Miss Chau, great service and we enjoyed our little chats. Great experience here!", "author": "Lynda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "This is the best meal i've had in years.  Exquisite, original, beautifully presented multi-course dinner.  The atmosphere is warm and friendly, nothing pretentious about it.  Memorable.", "author": "Renee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "What a culinary experience .  Compliments to Chef Khai.  Didn't know what to expect and left very happy .  He got me to eat eggplant and durian AND like it . So delicious and just the right amount of food for a sampling menu.  Hope the restaurant makes it in this very competitive market in SF", "author": "MJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Fantastic dining experience. 10 courses, not a single one the same, and all devine. Loved every bit of this modern spin on Vietnamese food. Wow!", "author": "Heather D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "Happy to be able to experience some new flavors. First night jitters, slow service, no consistency in the message that came with each dish. Chef was there as was his wife, which Chef gave credit to the appearance of the dishes and praised her assistance. The dishes were inspired by his life in Vietnam. The courses were lovely to look at but do need some work. I believe it will only get better. Chef stated he was interested in providing some ingredients  native to Vietnam to his patrons. Chef was very friendly and the glasses were never empty. Highlights for me include: the seaweed salad, a white seaweed from Vietnam, (needed more acid for me), texture and presentation were great, turmeric fish was just barely cooked (I wish I could just cook fish like it was cooked) and had amazing texture and flavor ( I was lucky my fish still had 3 bones), the quail KFQ was outstanding ( gummy yucca under the quail could have been a more pleasing texture), the lamb (not a lamb fan) was amazing, had a spice from Vietnam, scallion oil and lemongrass powder, so good. Do go, I'm sure the kinks will be worked out.", "author": "C W."}
