{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "I can't get enough of this place.\n\nThe food is incredible, fresh, healthy, AMAZING!\n\nThe staff are always friendly. So surprising given how busy it usually is. \n\nWhat keeps me coming back? Honestly it's a toss up between the awesome staff and the awesome food.\n\nThe vegan options are to die for and I always leave in a good mood. That hot sauce though...I could drink it by itself, so good!\nThey had an Alfredo special one time...probably a good thing it's not on the regular menu because I would be in everyday and it would rule my life.\nSeriously it was that good.\nI love this place and the community around it - they just turned 1 and I look forward to stuffing my face here for many more years :)", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "A healthy low carb haven!\n\nThe food: Mix n match bowls are EPIC (try the pulled pork). The crispy brussel sprouts are some of the best I've ever had. And they have bone broth. Oh come on! Who else HAS that?!?\n\nLocation: 16th & mission, VERY convenient, but easy to walk right by\n\nInterior: peaceful, relaxed vibes & CLEAN\n\nStaff: VERY kind, patient and fast table service\n\nBottom line: WORTH it", "author": "Elena P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-20", "description": "\"Aww f*** how'd I let myself get brought to a health restaurant?\"\n\n::gets handed a menu, eyes immediately find the drinks section::\n\nOh AND there's no syzzurp? What in the world is even happening rn.\n\nI keep forgetting the word FITFAM starts w \"fit\". Guess that's wtf I get for finally attending my boxing homies' weekly group dinner.\n\nMore like FMLFAM. Nah jk luh this crew.\n\nYeah so we had a blast.\nMy GENERAL TSO CHICKEN was ait.\nEither way, as of now seems this place is a weekly staple for me.\n\nBYOB tho? ...? loljk", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "I'm such a kitava convert! When first hearing about the concept I was definitely skeptical... how can something that is lacking so many key ingredients (gluten, lactose, soy, etc) be tasty? Well... it was DELICIOUS!\n\nBeautiful space as well. I like how you order at the counter, pay, and then sit. It's fast casual and a great lunch spot. I ordered the General Tso's Chicken and loved it!!", "author": "Angelina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "I found myself here on a Saturday night when a restaurant down the street that I planned on eating at had a 1.5 hour wait for a party of two. Since waiting outside in the cold didn't seem particularly enticing, we instead walked to Kitava after doing a quick search on Yelp for gf/df options nearby. So glad we did! We were able to get a seat immediately, though there were enough people in the place to give off a good dinner time vibe. The first thing I noticed was how friendly the staff was. Like honestly they seemed like genuinely good people. We ordered the grass-fed beef meatballs in pesto sauce, the cubano bowl, a turmeric almond milk drink, green tea, and, for dessert, a brownie and an almond cookie.\n\nThe meatball dish felt like a home cooked meal that I didn't know I needed. It was so warming and tasty. Rich but not over the top. Simple flavors but blended nicely together. The cubano bowl (which wasn't mine but I had a little) had really nice pulled pork. Not at all greasy which can be hard to find. Both dishes were super filling and generously portioned. I think the brownie was probably tastier earlier in the day, but to be fair we ordered it at 8:30 pm, half an hour before closing. The almond cookie was really good and I'd definitely get it again. The turmeric drink was delicious and the green tea was as expected, green tea.\n\nSo yeah, all in all a great experience. I'll definitely return!", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "Nothing says gentrification like an old McDonald's being replaced by a gluten-free fast casual restaurant with kombucha on tap.  Despite the fancy sustainable hipster motif, it's not that pricey (for San Francisco) with most mains between $13-$15.  It's not vegan raw healthy, but it feels like cleaner eating than a carby burrito or slice of pizza nearby.\n\nPesto Meatballs: Labeled as a \"small plate\", it's definitely smaller than a meal but much more substantive than an appetizer.  Really liked the tasty and warm pesto.  The ground meat was surprisingly yummy for ground meat, like they used a lot of nice spices and herbs.\n\nGeneral Tso's Chicken: Ok, it's nothing like the sticky sweet and spicy General Tso's Chicken one would find at a Chinese-American joint.  It's more like nice chunks of chicken covered in a light and very crispy batter.  There happens to be a not-sticky-at-all sauce on the side that mainly tastes like soy and vinegar.  The rice was fluffy and had some of that light sauce mixed in it.  The large chunks of steamed broccoli were the only boring part.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "The General Tso's Chicken and Zoodles & Meatballs won me over!\n\nKitava's food is pretty good, and I love their concept of being 100% free of gluten, dairy, corn, soy, peanuts, refined sugar & seed oils. It's a great spot for the health conscious and those with dietary restrictions like paleo, Whole30 and GF. The proces are steep but the ingredients are high quality.\n\nThe restaurant is more like a cafe setting since there are communal tables. It's a good place to get delivery/take out from as well. It's located near the 16th Street BART station in the Mission so a fairly easy location to find. \n\nThe menu consists of lots of bowl options like the Baja Bowl, Cuban Bowl, and you can also mix and match 1 protein and 2 sides. The Zoodles & Meatballs and General Tso's Chicken are delicious and popular.\n\nI got the Mix & Match with salmon, turmeric cauliflower rice and brussels sprouts and it came out to $19 which was pretty expensive. The portions weren't that big, even though it came in a big bowl which I was sort of disappointed by. The food is kind of on the plain/bland side. Try their specialty entrees instead.\n\nWe also got the Immunity Broth which had ginger and turmeric in it which was $5. The broth was way too salty and I couldn't finish it.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "I love chicken wings. For part three of my weekly office lunch, I decided to get some from Kitava. Our delivery arrived via Caviar on Friday, June 22nd around 12:30pm.\n\nI got the Chicken Wings with Ranch and Green Onion: 6 pieces, Pasture-raised chicken wings, tossed with paleo ranch dressing and green onions, over a bed of arugula ($6). I adore greens, so I was happy the dish came with a mini salad underneath. The wings were tasty. Lots of flavor. But they were really small. I don't think an order would fill you up as they are not very meaty. I guess that's what you get with pasture raised chickens? They're skinnier, so less meat?\n\nTheir menu offered a lot of comfort food, so I wouldn't mind trying more dishes from here. Plus, their slogan on Caviar said \"Healthy Food Without Compromise\". Healthy and comforting? Works for me!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "I came here for a team lunch during the week. I really love the concept of gluten, dairy, corn, soy, peanut, and refined sugar free, however, I felt it was lacking in flavor and most dishes only had a few items in them. I would have liked to have more options (and am willing to pay more for it) available in their dishes. The zucchini noodle dish for instance is just zucchini, sauce and basil (with the option to add mushroom or meat). The Cuban bowl seemed to have more variety in it but the day I was there they were out of beans. \n\nThe space is clean and decor is nice for a fast sit down meal. I'm not sure if this is normal here but it was weird that we all ordered on the same number but our dishes did not come out at the same time. Makes it super awkward for one person to start eating or have their food but have to wait for the rest of the dishes.", "author": "Tarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "I'm wondering to myself why the fuck I haven't come here sooner?\n\nYes, this place is expensive, and yes, the location is a bit sketch. But believe me, Kitava is so worth going!!! Fresh ingredients, delicious taste, and transparent menu... what more could I ask for? I ended up ordering the General Tso's chicken with cauliflower rice. I wasn't in a rush to eat lunch when I came in, but when the nice waitress and I both noticed that my food still wasn't ready despite having waited for half an hour, she gave me a side of plantains on the house. :) I usually don't eat fried stuff, but those plantains tasted B O M B. What I loved more, though, was the chicken. The breading was thick and crispy, and the chicken meat was juicy and tender. However, the cauliflower rice tasted way too overwhelming. Imo, there was way too much turmeric and ginger for me to enjoy the cauli-rice on its own. But when paired with the chicken, it tasted a little better.\n\nOverall, I love this place, because it's a healthy, fast-casual joint conveniently located across the 16th and Mission Bart station. In the future, though, I might request for the cauli-rice to be cooked plain instead.", "author": "Connie X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-09", "description": "They are VERY expensive. I went there by myself and it came up to 20$. They charge extra for everything. To answer your question of why I didn't feel it was worth 20$ a person: usually a 20$ meal for myself would be a bit fancier. For something from a place like yours, one could usually get an entire meal for 15$. Not have to pay extra for any sides. I", "author": "Lucinda R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "I love cauliflower normally, and the cauliflower did look extremely rice like. However, the taste was slightly bitter, with a texture that was overly hard. There wasn't any flavoring to it at all, and it imparted the bitter taste onto the rest of the food when eaten in combination 2/5.\n\nThe pork add on ($5) was in good portion. While the meat was not dry, a bit more moisture would have been appreciated. The flavoring was sufficient, not overly strong in pork flavor, and felt like a healthy protein. 3.25/5.\n\nThe carrot and red lettuce veggie mix was super crunchy-- not a carrot fan normally, but couldn't taste it in this mix. 3.75/5. The beans on this were standard. Plaintains (included with the dish) was cooked through, with a sweet taste and starchy texture. \n\nOverall the dish felt healthy and was ~1.5 full meals for me. However, I would highly suggest not doing the cauliflower rice, as avant-garde and appealing as it sounds.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "Overview: Kitava is a clean, modern, health-conscious, gluten-free, medium sized, spacious, sit down (but serve yourself) restaurant that opened in 2017 located in the heart of the Mission District on 16th and Mission on the east side of the BART station that replaced the McDonalds there.\n\nThe Food: About half of the menu items here are a variant of a grain-bowl or a salad bowl, consisting of a protein such as pork shoulder, chicken, or salmon atop a mix of white rice, legumes, vegetables, and avocado. There isn't a specific ethnicity that Kitava adheres to and you can get options from the \"Cuban Bowl\" that adds plantains, to meatballs/zucchini, to General Tso's chicken, to the house salad which consists of spinach, arugula, cabbage, carrots, tomatoes, and avocado. Prices for an average meal range from about $14-16 and portions are on the heartier side.\n\nIn general you will feel good about eating at Kitava as most of the foods served here are traditionally thought of as being healthy and many of their ingredients are organic and locally sourced. On the flip side, Kitava still serves white rice, plantains, fried chicken, and a variety of desserts so to me their vision seems kind of diluted. For example, their Cuban bowl is 871 calories (300 more than a Big Mac), and 47% of your daily sodium content. The Zoodles+Meatballs (for 3 meatballs) is 520 calories, 77% of your daily sodium content. I do get the impression that Kitava is catering more to people on fad diets. \n\nAs for how the food tastes, it's a little low on the flavor, and most dishes are fairly simple. The meats specifically are a bit dry and I found myself needing to incorporate a little chunk of plantain into every bite of my Cuban bowl because the rest of the bowl was on the bland side.\n\nConclusions: Kitava is a wonderful addition to the Mission neighborhood and I hope that it thrives. If you like the idea of local ingredients, simple bowls, clean, spacious interiors, and hate the idea of gluten, Kitava is a perfect place for lunch with a date or a small group.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "I had the local special which consisted of pulled pork and plantains over rice with salsa and it was delicious!\n\nThey have a bit of a healthy trend here so the dish could have used a little bit more salt but they have Himalayan salt on the table so it tastes just perfect after you season it yourself.\n\nThe pork was juicy and tender, the plantains were delicious, but what actually made the dish taste extra good was the hot sauce like salsa on the table. It's lightly spicy with a nice sweet and sour kick and it really elevates the dish and makes it taste that much better.\n\nI'll have to come back and try their other concoctions, you can get things with cauliflower rice! It looks pretty paleo friendly.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "My go-to restaurant in San Francisco. Delicious, high quality food, both vegan and Paleo options, accessible to BART. The owners are also great people. Highly recommend.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "I tried Kitava back in the Mealmade days. I found the food tasty and wholesome, but kind of pricey for delivery so I only tried it once or twice. Recently, I ordered 10 meals catered for a group meeting through Caviar and enjoyed it. The food was simple, flavorful, and had a home-cooked quality to it. There's also something everyone with a dietary restriction from gluten free, vegan, keto, the intersection of some of the above.\n\nI also visited the Mission location for a casual weekend lunch with a friend and for a quick dinner. The second time, it was slow to get my order but eventually got it. The food quality is great, and it's nice to have a low carb option with healthy food.\n\nI enjoy the build your own plate (main protein) plus two sides. I love the brussel sprouts side, crispy, deep flavor and rich aioli dipping sauce. I could easily eat it as a meal!", "author": "Truc N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I was in town this weekend and I'm so glad someone in a group found this place! The decor is beautiful, It includes plants, art and some living walls. There was even a cooking class going on in the back, which was cool to see. \n\nThey had two different kinds of kombucha on tap. I liked the lemonade ginger one better. \n\nThis place was nice because I feel like they has something for everyone on the menu and had so many healthy options. Three people I went with were on a keto diet (mainly protein and meat) and I am on a plant based diet. But we were all able to have a meal here. I was impressed with their dessert menu. They had sugar free options and dairy free options as well.  The vanilla bean gelato is cashew based (vegan option) and it is a must try! \n\nI was surprised they have only been opened since September. The staff was really nice and helpful answering all of our questions. I can't wait to go back. \n\nPros: Clearly marked vegan/veggie options on the menu, sugar free desserts, decor/cute art on the wall, nice music, friendly/knowledgeable staff, cooking classes available, and they have wifi \n\nCons: I can't think of any..I wish they had more locations?\n\nTips: If you're a fan of kombucha, try their kombucha on tap, they give out free samples. Also read the card about what the name of the restaurant means! :)", "author": "Carly E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "4.5 stars. Love this spot in the mission. The ingredients are right on and the flavor/ are right on. And it's even better that this is at the site where McDonald's was - time for people to upgrade into a new healthier spot. Casual healthy food served more affordably to the masses - reminds me of Digg in New York. I hope that they will expand to downtown SF soon!\n\nI ordered the Cuban bowl with braised pasture-raised pork, cauliflower, cumin beans, kale slaw, avocado and rice. This one has the right texture with the soft and tender pork and rice with the more crunchy cauliflower, kale slaw, and sunflower seed risotto. Even though there are literally 10 wholesome ingredients in this dish, the dish tastes incredibly natural and balanced. I love the slight Indian influenced spices integrated into the bowl.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "I got a pork dish - it was well balanced (rice, salad, pork); the pork was well cooked.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "Salad with roasted chicken and half an avocado was just the thing to feel satisfied after a long day of small meals and hardly any snacks. Hard to believe the place used to be a mickeyDs before. Step outside and you're back in familiar mission and 16th but corner is full of cameras", "author": "tomohisa w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Cool spot on the corner of 16th and Mission. \n\nHopped into this place recently and went with the:\n\nPesto Chicken Cobb $15 - Roasted Chicken , sunflower basil, pesto, bacon, egg , avocado, tomatoes ,spinach, dairy-free ranch dressing with extra virgin olive oil\n\nTook a number and waited patiently for my meal.\n\nI like Pesto and like Cobb Salads and this was a good solid salad but I was not blown away. It's in the middle of my tier below but it has a great location so I could see myself picking up another salad sometime. \n\nI like Healthy Foods...occasionally ...lol. For the past year or so I workout multiple times everyday so I typically try to eat at least one Salad a day. Often times I bring my own salad for lunch but sometimes I venture out in the city for some healthy greens.  \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. \n\nHere is a look at how I rank the Salad Spots in the City. They are all pretty good this is just my take. \n\n\nRod's San Francisco Salad Rankings (and what they're known for or what I like). I have rankings various foods like Boba, Ramen, Steakhouse, Chicken and Wafffles(random right?) Follow my profile to see my most recent reviews. I hope I can be helpful since so many Yelpers have helped me discover new places \n\nRanked from Fave to least fave (Business owners don't hate me, all these places are good) \n\n1 Café du Soleil-Nicoise Salad\n2 SweetGreen-Pesto Chicken\n3 Darwin Café-Baby Spinach \n4 La Fromagerie-La Mancha Salad\n5 Mission Picnic -Deluxe Cobb\n6 Mixt-Mixt Cobb\n7 Plutos-Custom salad\n8 Tender Greens-Chinese Chicken\n9 Blue Barn Gourmet-Cobber (Cobb Salad)\n10 Split Pea Seduction-The Squash salad\n11 Boxed Foods-Boxed Chicken Salad\n12 Kitava-Pesto Chicken Cobb\n13 Soma Chicken-Caesar Salad\n14 Proper Food-Lemon Quinoa Salad with Chicken\n15 Eatsa-Various Salads/bowls \n16 The New Spot on Polk-Asian Chicken\n17 Organic Coup-Kale/Caesar Combo \n18 Uno Dos Tacos-Fish Salad Bowl", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "My boyfriend and I are on the Whole30 diet right now and were looking for suitable dinner options. I searched \"paleo\" in Yelp and this was one of the first few options. I saw at the top of their online menu that everything was Soy/Dairy/Wheat/Yadda Yadda free and said \"Yep this is the one\".\n\nIt's right across from 16th & Mission BART so very centrally-located and was easy to get to. The atmosphere is very chill, casual, and relaxing with the order at the counter/seat yourself/bus your own table flow which is gaining so much popularity here in SF (a whole other conversation). Also sharing tables with strangers is definitely somewhat expected just because it's a small place with lots of chairs at each space to eat. This must be a newer business cause the bathroom looks like it was still being set up and you have to super hulk strength one of the stall doors in the women's bathroom to get it to close.\n\nEverything was well-priced and super delicious! I came with two people and we all ordered different things and tried each other's stuff.\n\nBrussel sprouts + aioli were a nice thing to munch on, I loved how crispy they were. It's hard to mess up brussel sprouts, imo.\n\nGeneral Tso's chicken was not to be missed, what a great take on a classic. I love that they use coconut aminos for the sauce instead of soy. We ordered this w cauliflower \"rice\" instead of the jasmine rice and were pleased that this was even an option (it's like they really know their audience or something~).\n\nThe meatloaf and mashed sweet potatoes were also very good, I've never had sweet potato that tastes so similar to your expected mashed white potatoes. They were savory and delicious.\n\nThe spaghetti squash bolognese w/ beef was soooo satisfying. My boyfriend didn't want to get this at first (which I understand, cause like yeah, spaghetti squash subbing in for actual pasta is almost like carob pretending to be chocolate) but it was very rich and flavor-complex and I kept bugging him by saying \"and you didn't want to get this one! Ha!\".\n\nI left with that pleasantly full, content, and warm feeling that only follows an especially nourishing meal. My mouth is watering just thinking about it and I'll definitely be a returning diner.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "One of my new favorite spots in sf. I love everything about this place. The fact that they give back to he community is super great and something that other restaurants should learn from. The staff was super friendly and the food was incredible. It's hard to find delicious, healthy food in the city and that's why I'm so glad that I found Kitava. I ordered the Cuban bowl which was delicious but I'll definitely be back soon! Everything on the menu sounds delicious.", "author": "Ina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "I love the Cuban bowl. Such a great mix of flavors and the atmosphere is extremely good !", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Love love loved all the food we had. Health conscious foodies dream location. Paleo Treats are sold here  Vixen Kitchen ice cream  100% gluten free and dairy free  yessss! My boyfriend loved it too and he's not GF DF like me. Area is a little sketch but that was expected. Bathroom needs work. Good friendly staff.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-05", "description": "I ordered takeout and the food arrived on time but I just didn't love the way it tasted. I ordered spaghetti squash with mushroom bolognese and a \"Mix and Match\". The brussels were delicious (5/5), the spaghetti squash was ok (4/5) but the sweet potato mash tasted like pure sugar (2/5) and the pasteurized chicken was terrible because it was all diced up and ended up being about 95% skin with a tiny bit of dark meat (1/5). Perhaps other items on the menu are better but I was not thrilled with the items that I ordered.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "100% free of Gluten, dairy, corn, soy, peanut, refined sugar and seed oils! They get me! I've never been in a restaurant that offers an AIP menu. If you have food sensitivities, this is the place for you! Plus the ingredients are pasture-raised, grassfed, etc! I can't tell you how excited I am about it. And it was delicious. General Tso's chicken was delish and the chocolate brownie... sooo chocolatey. Service was excellent too. Just a lovely experience. I want to come back everyday. I'll be by in the morning for some bone broth for sure!", "author": "Dede S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I just ordered food off grub hub. I'm in San Fran for work and eat paleo. It's hard to find good clean spots. Omg omg!!  I had the Cuban bowl. I loved it so much. I just ate it so fast!! I wish you delivered to Seattle!", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "My friends were in town for weeks getting treated for cancer. Mykel was so sweet to them, which is such a blessing when you are going through such a difficult time. Thank you Mykel!", "author": "Pam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "What a great place for people looking for a healthy option. Kitava caters to people who are looking for a paleo meal, including those on an AIP (auto-immune paleo) diet. \n\nI recommend ordering the Cuban Bowl with pulled pork or General Tso's Chicken. You can substitute the rice for cauliflower tumeric rice.\n\nOh, the brownie is pretty bomb, too!", "author": "Lindsey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "I'm obsessed with this place. It's a gluten free vegan Mecca, and they even have meat options for my friends that aren't into vegan fare! The avocado mash with yucca chips is a must, they have kombucha on top, and their mashed sweet potatoes are the best I've ever had! I like to get a mix and match bowl, but the mashed sweet potatoes and phenomenal Brussels sprouts are always included! And the desserts? Literally to die for. This place better be around for a long time, because I can't get enough.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "If it tastes bad, it must be good for you and if it tastes good, it must be bad for you - right?\n\nThen again, maybe it's just a rhetorical question and the answer is right in front me. \n\n*Stares at thunder thighs* \n\nWhat can I say? I love good food but sometimes I want a clean meal for balance.\n\nThe last time I tried a very restrictive, health-oriented eatery, I never wanted to look at a vegan, gluten free, lo-carb, no sugar meal again. Don't get me wrong, vegan can be good but this particular place made steamed broccoli for life seem more appealing. \n\nAnd, then I read Eater SF's article: \"Mission McD's Reborn as Gluten-Free, Paleo Restaurant\": http://bit.ly/2iReSAn. GF, paleo friendly chicken nuggets, french fries, and sweet & sour sauce?! I'm so there! \n\nOk, I can't be the only one who misread the misleading title. I mean, if McD was going to reborn into anything \"health-conscious\", it's first location would definitely be in the hipster Mission. \n\nSorry, to disappoint McD fans but taking over the vacant McD space is Kitava is paleo friendly, fast-casual restaurant that's free from dairy, corn, soy, peanuts, refined sugar and oils. Meats are grass fed and pastured.\n\nOn the menu are small plates (butternut squash hummus, pesto meatballs), salads, bowls (Cuban bowl, zoodles & meatballs, General tso's chicken) and sweets (brownie, cookies, ice cream sandwich). \n\nLike most new eateries in the city, it's not cheap but not insanely expensive either. A bowl and a brownie was about $25 including tip. Not an everyday type of place I can afford to go to for lunch but Kitava is THE place to go to when you're seeking a tasty meal that's makes you feel good about yourself. \n\nThey also offer delivery through UberEATS, DoorDash, and GrubHub.\n\nI ordered at the counter with the very friendly cashier and my meal was ready within minutes. \n\nFor lunch, I choose the Cuban Bowl ($14) w/ heritage pork shoulder, plantains, avocado, kale slaw, cilantro-garlic mojo sauce, cauliflower rice & sunflower risotto (+$2): http://bit.ly/2mnkLu4.\n\nThis was a very filling bowl with a good ratio of proteins and fiber. \n\nThe pork shoulder was fantastic - slow cooked and very tender. Much better than nearby Media Noche's rendition. Mojo sauce added a great acidity and the plantains had a nice caramelized sweetness. I love heat and each table had a bottle of housemade tangy habanero sauce. It wasn't too hot so don't worry. \n\nI wasn't too keen on the cauliflower rice (very cabbagey with a bitter aftertaste) and sunflower risotto (like oatmeal). They do have pink Himalayan sea salt on each table that will probably help neutralize the cauliflower rice but I didn't use it. Personally, I like a more neutral flavor you get with regular rice but that's just my AZN side. Next time, I would just do all kale slaw or the white rice & beans option. \n\nI've had my fair share of terrible, GF desserts so I was very pleasantly surprised at how tasty the Dark Chocolate Brownie ($4): http://bit.ly/2zDpi0g was. It's made with almond flour, pastured eggs and coconut sugar. It was very chocolately and satisfying. Not chalky. \n\nThe owners have done a great job revamping the space and turning it into an inviting, bright space with living succulents and greenery on the walls. \n\nKitava is easily accessible from Bart which is right across the street. Street parking is very tough. \n\nIf you're looking for a quick, filling, and healthy meal that's packed with clean, high-quality ingredients that doesn't sacrifice on taste, check out Kitava!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "If you are in San Francisco, let me assure you that making an effort to stop at Kitava is well worth any time and energy spent. Located in the heart of Mission District, Kitava is a modern cafe that offers appetizers, small plates, entrees, and desserts that have been expertly prepared using only the highest quality of ingredients (i.e. pasture-raised meats and safe cooking oils). Is it healthy? Yes. Is it delicious? Yes.\n\nMy husband and I easily walked to this restaurant with an infant and stroller in tow from Mission Delores Park, but one can also directly access it via the BART station across the street. Upon entering Kitava, we discovered a spacious atmosphere decorated in a simple, yet tasteful manner. Guests order at a main counter and then dishes are delivered to your table of choice. After examining the menu, my husband ordered the Cuban bowl with pastured heritage pork shoulder, and I chose the General Tso's chicken. There was a tempting $7 special of the day, but we chose to try some of the restaurant's acclaimed staples. \n\nOur food was delivered within 20 minutes, an impressive feat considering the restaurant was full of patrons at 2:30 p.m. on a weekday afternoon. My General Tso's Chicken was beautifully displayed atop a bed of fresh broccoli and jasmine rice (can substitute with cauliflower rice). I wish I had taken a picture, but the aroma was too tantalizing. Within minutes, my plate was empty! The chicken was perfect - crispy and flavorful, but made without using any gluten, soy, MSG, etc. My husband reported his dish was equally delicious. And the best part? We felt GOOD about our choices. This is definitely a restaurant we would like to eat at again!", "author": "Arielle C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "UPDATE: \n\nOriginally my review had a lower amount of stars, however, I decided to update it. I noticed that my salad also didn't have the promised Pepitas and decided to talk to stuff directly. The lady I was talking to was very nice and compassionate, and was very responsive to feedback. She said she'd pass it onto her boss and agreed that this was unacceptable. They refunded my salad and gave me complimentary yuka chips and hummus. I'm happy to see that they handled it so well and hope to see the salads get better. \n\nI also noticed that their bowls looked really nice and as I pointed out earlier, I haven't tried anything BUT the salad so my opinion is based solely on that.\n\nORIGINAL REVIEW:\n\nIf you want a literal salad (a pack of arugula and spinach mix) with a topping of 3 blueberries and 2 tiny pieces of avocado for $12, this the right place for you! \nI got the California salad (one of their specials) and it was REALLY disappointing. I could have gone to a grocery store and get a pack of salad mix on my own for a cheaper price. \n\nAVOID their salads! Can't speak for anything else, but the salad sucked A LOT.", "author": "Luba Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "This place is delicious! Everything tastes wonderful, you would never guess it is health food. And all ingredients are listed online so I know exactly what I am eating. I wish there were places like this in other cities!", "author": "Jenn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "This place is hands down my new favorite place to eat in the mission. The food is fresh and yummy! It's satusfying without being filling. You leave feeling satiated and proud of your life choices. \nI had the vegan Cuban bowl. I wanted the cauliflower rice but the cashier misunderstood and gave me regular rice. (It's okay, just a reason to go back). My boyfriend had the Baja bowl with salmon and we got a side of brussel sprouts and plantains. I also had the lemongrass kombucha which was the best kombucha I've ever had. \nEverything was fresh and the salmon tasted like natural caught salmon. \n\n10/10 will go again. 10/10 will recommend to everyone.", "author": "Chelsea L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "I'm excited about any restaurant establishment that offers health conscious food, ethically sourced, and most importantly, flavor driven. \n\nAs natural as possible, Kitava offers gluten-free, no refined sugars or flours, dairy free, corn free, soy free, peanut free, and seed oil free. They also use grass-fed and free range meats. \n\nMy faves are the General Tso Chicken over a bed of cauliflower rice. I've had plenty of their other selections too, but this is probably the best that they offer. The bone broths are good, but not seasoned enough. I do LOVE their avocado mash and accompanying yucca chips. Brownies are great too. The Spaghetti Bolognese is a crowd pleaser. Totally love it. \n\nPaleo and Whole 30 friendly. \n\nBomb dig.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Fantastic bowls! I had the General Tso's with cauliflower rice. It was excellent. My wife had a mix and match with pork, kale, and brussel sprouts. Also great. Very clean, great ambiance!", "author": "Brad E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Finally there's a great place in the Mission to get affordable, low-carb, healthy food! Kitava (formerly Mealmade) serves up delicious entrees and appetizers that are easy on your waist and wallet. \n\nI ordered Kitava through Grubhub for delivery, but you can also order via UberEATS for delivery, Grubhub for pickup, or just dine in. \n\nThe Kitava website lists out all of the potential dishes you can order and the best part is that clicking on each gives you the full picture of nutritional info so you can really get an idea of what you're eating. Huge plus points for this! Also, many of the meat dishes can be made vegetarian, which is great! \n\nKitava is one of the few places in SF serving low-carb alternatives to noodles, namely zucchini noodles and spaghetti squash. I love that they have these options!\n\nI decided to order the Zucchini Noodles ($14) with Meatballs. This dish was truly excellent! I make zucchini noodles myself and I must say, it is pretty hard to get them cooked to perfection - not overly crunchy but also not too cooked otherwise it gets mushy. Kitava cooks them so well! The sauce on this dish was so flavorful. Sure, it's a simple sauce, but it just tasted so fresh. The meatballs too were flavorful, juicy, and also cooked well! \n\nI can't wait to order again from Kitava and try more of their dishes!", "author": "Sabina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I've heard nothing but good things about this place, so I figured I must try!\n\nFirst impressions:\n- Very clean location\n- A variety of different options\n- A bit pricey, but worth it\n- HEALTHY\n\nI was born and raised in San Francisco's Mission District, and it is so so hard to find healthy food. The menu seemed a bit intimidating, but I was happy with my first order ever here.\n\nMy mother ordered the Baja Bowl ($11) with chicken (+$4)\n- Extremely Tasty\n- Comes with: Guac, some sort of really good veggie mix, pico de gallo, salsa, beans, and white rice + the chicken she added on which was extremely flavorful!\n- Big portion\n\nShe also tried the Chicken Bone Broth ($5)\n- She absolutely loved it, just stated that it was critical to add her own salt and pepper to make it a bit tastier!\n\nI ordered the General Tso's Chicken ($14)\n- I wasn't absolutely in love with it, but it wasn't bad. When I come back, I'd probably order something different\n- It is very flavorful, and a big portion\n\nTo end we tried the Vanilla Bean Gelato ($6) and Dark Chocolate Brownie ($4)\n- Gelato was bomb\n- Brownie was okay!\n\nI definitely saw other dishes that I want to try and overheard people saying they absolutely loved! Would definitely recommend. Right now this place is at a 3.5/5 for me, but I think that will quickly change once I try some new things!", "author": "Kassie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Delicious food. Kind and quick service. Great vegan, vegetarian, and meat dishes. Food is fresh and organic. Loved it.", "author": "Cristian G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-23", "description": "I ordered the orange chicken with cauliflower rice with extra sauce. No extra sauce. Dry. Only a few pieces of stale and cold chicken.  Small and not 1/2 full in container. For $16\n\nOrdered plantains. These were not included. \n\nCookie. Dry tasteless cardboard.\n\nFood arrived 1/2 hour late. At first- Refused to redeliver- had to go thru grub hub and be on the phone for 45mins.  \n\nSo finally get a redeliver. No sauce with plantains and no extra sauce. Two 1/2 filled container that could only cover some chicken.\n\nWanted to love this place. Disappointed.", "author": "meesh m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "I understand that broccoli is healthy, but really though, how much broccoli can a human eat in one sitting? I'm gonna have to rent a pickup truck to load all this broccoli out of here. I'm not talking about just some broccoli on a plate, I'm talking about massive bunches of broccoli that you practically need a machete to get through. No human being should be expected to chew through that.\n\nI'm willing to pay for healthy food, but I've given up on this place. The quality and quantity of the food just vary too much from order to order. Ordering the chicken dish, one day I'll get a good size portion of meat, the next day I'll get a few tiny nuggets and THREE TONS of broccoli... I've ordered the extra chicken option, ok?; but again, sometimes there is a good amount of extra chicken, other times you just feel violated. Maybe eating at the restaurant in person is different, I've only ever ordered for delivery. I just can't take it anymore.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I stumbled upon this place coming up from the BART on 16th and Mission while trolling around the city by myself, waiting to hop on a plane back to Vegas. My phone was on it's last leg, as was I. We both needed to recharge. \n\nThere are booths and tables of all different sized to accommodate your party, however big or small it might be. Don't be shy to share a table (and/or an outlet!). It's clean in terms of actual cleanliness and decor. More on the modern, sleek side but comfortable. Water is free and is self serve by the register. They let me fill up my Nalgene for the trip. Thanks!\n\nEating out while maintaining a clean/paleo/gluten+dairy free diet is freaking hard. Especially when you're in an unfamiliar city. I was grateful to stumble upon this place. I was shocked that I could eat most everything without drastically modifying it and getting judged by cashiers/servers. \n\nThe cashier totally helped me out with suggestions. I was grateful for that. I let her know that I had never been there before because I was just passing through but really needed to eat before I had to head back to the airport. She suggested a special that was going on, the pork and plantain bowl but subbed with kale slaw instead of rice. SCORE!\n\nIt was out of this world. The pork was tender, the plantains gave way to create the perfect balance the savory pork and the spiciness which is the sauce in the squeeze bottles on the table. Amazing. \n\nI left this spot with a heavy heart, wishing that we had somewhere like this at home. Hope they stick around. I'd definitely make it a point to stop back the next time I'm in the area!", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Every dish was delicious, and they were so kind to accommodate a large and complex order for 12 of us (including vegans, and carnivores on keto diet.)\n\nI love the lack of bad ingredients here, all the chemicals and additives and garbage foods you normally see in food these days are not on the menu! Yes, I salute this mission! (pun intended, due to restaurant location?)\n\nI really like the bowl options, and they offer so many delicious foods and also accommodate really difficult diets like paleo, keto and vegan.  That and they taste great!\n\nThe sides were very good too, the plantains were lovely and soft.\n\nThe only thing I disliked was the (cassava?) chips and guacamole because the chips were not crisp, but felt soft and malleable like an 'old' potato chip does when left out for a few days. That may have just been an outlier.", "author": "Jules F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I can't believe I've waited this long to come in here! Super keto friendly. Delicious food. I'll be back!", "author": "Kim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Wow! Amazing food and all really healthy! The only negative is that the area is pretty sketchy, but ok in the daytime. \n\nThey work with various delivery services, and this will become a mainstay for me going forward!\n\nHIGHLY RECOMMENDED!", "author": "Laurence N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Love them! Zoodles, meatballs, and meatloaf are all favorites in our house. It's a great, healthy go-to when we are tired and want take out. \n\nThey list all their ingredients and have great options when deciding if you want paleo, gluten free or whole 30. \n\nIt delish and you get a good value for the $$$. Highly recommend!", "author": "Terri L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "I found Kitava one day when I was  Googling places in the city to get Zoodles.  Kitva is fairly new, I think it opened late last fall.   I brought my friend who is gluten free, dairy free, meat free, sugar free, blah blah blah and she loved this place so much that she now goes there all the time.  I think it's a good place to go with extremely health conscious people.\n\nTo me Kitava is expensive for my budget but it's not overpriced.  For the quality of food you are getting it's reasonable yet if you are on a tight budget it might be too much.  They do have daily specials that are around $7.  Some other options if you don't want to spend a lot are the plantaines ($5) which are really filling and the avocado mash ($6) which is like chips and guacamole but way less heavy.  \n\nMy favorite thing about Kitava is that the food isn't heavy and you don't feel weighed down and lethargic like food at other restaurants. Everything especially the meats are very flavorful, everything is fresh, and their portion sizes are more realistic as to what people this day in age should be eating.  \n\nI'd recommend their zoodles with meatballs, general Tso's chicken, and chocolate covered dates.  \n\nIt's right across from the 16th and Bart so can be doable during lunch if working in the financial district downtown time because it's easy to get to.", "author": "Joan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "I actually heard about Kitava through an even where they catered the food, and I am so glad for the discovery. Kitava is now one of my favorite spots in SF and a staple in my rotation. Here's why:\n\nThe food is fresh, additive free, and best of all DELICIOUS. The entire place is gluten and dairy free, which is amazing. Most items can be made completely grain free and paleo and/or vegan, another huge win. Despite being a huge foodie and lover of all things delicious and bad for me, I spend the vast majority of my time eating paleo. I'm so thankful to have a place that is incredibly tasty, has a varied menu, and is healthy for a wide range of diets. \n\nHere's what I've had-\nButternut squash \"hummus\" - it's a bean free revelation. It has an amazing combination of comforting warming spices that I've tried to replicate at home but I can't. Safe to say I'm completely obsessed and addicted. \n\nMeatball appetizer - I remember enjoying this when I tasted it at the event but can't remember specifics. \n\nSpaghetti squash bolognese - very tasty! Spaghetti squash /= pasta but I really enjoyed this dish and was satisfied by the portion. Great hearty dish for the cooler winter weather we've been having lately. \n\nCuban Bowl - love that I can sub more slaw for the beans and the offer cauliflower rice. This bowl is SO GOOD. Plus the pineapple habanero hot sauce is a great match for the fresh tangy flavors in the bowl. Also the avocado that came in the bowl was perfection - a HUGE pet peeve of mine is getting under/over ripe avocados. I'd honestly rather not have it at all if it's not just right. \n\nBrownies - omg these are so good. I'd be eating them right now if I wasn't doing w30. \n\nI didn't try the meatloaf that m boyfriend had but he seemed to really like it and finished his plate!\n\nYes, this place is a bit pricey but if you're willing to pay a premium to know you're putting good food in, it shouldn't bother you too much. And honestly I'd rather support places with a mission like Kitava.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-28", "description": "Saw this spot when looking for gluten free food in the area and was glad to find this paleo-friendly place! Then I also happened to see a gilt deal for a dinner for two here, so me and my boyfriend sprang on it. We came on a Saturday night; the place is across the street from the BART station and doesn't have a lot of tables. Most tables were full, but we were able to find a spot after we ordered our deal of an appetizer, two entrees, and a dessert to share.\n\nWe ordered the fried brussel sprouts as our appetizer, Meatloaf and sweet mashed potatoes as our first entree, General Tso's chicken as our second entree, and brownie as our dessert.\n\nEven though the sprouts were our appetizer, they came out after the entrees so it was treated more like our side. As far as fried Brussel sprouts go, they were fine; if they didn't come with the aioli then they'd essentially have no taste, hardly even salt, so I would not consider ordering it again unless they added some spices.\n\nThe meatloaf plate was good. Good flavor and a good healthy version of a hearty meal. Especially since half the dish was steamed broccoli and carrots so I'd suggest asking for more sauce or gravy.\n\nThe chicken was weird. We thought they they might have messed up the sauce on our order because it was supposed to be a soy sauce-like coconut aminos sauce, but it tasted like balsamic vinegar. It even came with an extra serving of the sauce, but we didn't use it with the chicken - honestly, it went better with the Brussel sprouts like a balsamic glaze. If it weren't for the sauce, the dish seemed like it could be pretty bomb...\n\nThe dessert was so so; the consistency was very crumbly which I'd expect for something gluten free, but I've made so many gluten free, paleo friendly brownies in my day that I was expecting better.\n\nOverall I was pleased with the concept and experience and would come back to try different things and stay away from others. The staff was nice, but could be more informed about the choices when trying to find something that fits your dietary restrictions and taste.", "author": "Samira I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "3.5 overall but has a lot of potential if they work out the kinks. I really want this place to improve because I did like many things about it. It is conveniently located near Bart. It is one of the few paleo/primal friendly restaurants. I follow primal for health reasons and have friends who do as well so it is great to look at the menu and not have to figure out which meal we can eat. The service was friendly and it was clean inside. The sauce that came with my dish was delicious. The breaded chicken was hot, crispy, and tasted great. My friend really enjoyed her dish overall in terms of flavor.\n\nThe rice for both of our dishes were uncooked so they had a slight crunch to them. My breaded chicken was hot but the rest of my food came out warm and quickly turned cold. I guess someone in the kitchen finished cooking and placing the rice and broccoli in bowl way earlier than when the chicken was done. The ratio on my dish was a bit off. There was a lot of rice but I would have liked more broccoli and chicken pieces. The amount of chicken pieces I got was much smaller than the amount of broccoli I got. Pretty soon I was just eating a bowl of sauced rice because I ran out of chicken and broccoli.\n\nI really hope this place gets better because if it does, this place can easily become a go to place for me as a lunch or dinner choice so I am willing to give it another chance. Crossing my fingers that the next visit will be a five star experience.", "author": "S A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "The first thing I notice is the space. So we coming and modern! I love the community tables. Second the staff here are awesome. Really positive vibes from everyone I talked to. The food was quite good too! I was really impressed by the commitment to different types of dietary needs. I got the zoodles with king trumpet mushrooms. The zoodles and the marinara sauce were really good but unfortunately the mushrooms were a under done, hence the loss of a star. Great experience overall though.", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "I've only been here once so I haven't tried too much off the menu, but my first experience didn't leave me very excited. To start on a positive note, the concept is good, the space is clean and nice, and the food quality is good. Now onto the other stuff... I came in wanting to have a meal with spiced beans but they were out of beans. I ended up getting the zoodles and sauce with king trumpet mushrooms. The tenderness of the mushroom chunks was inconsistent - some were soft but many of them were pretty rubbery and hard to bite into. I didn't finish them. The dish was lacking in flavor. I ate with two other people who each got the Cuban bowl. They liked it but also commented on blandness. While I don't see myself heading to the Mission just for another meal here, if I'm standing at the corner of 16th and Mission and am looking for a quick bite I would be open to trying another dish.", "author": "Russ S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Nice food! Very nice place! Wish they just put key dressing sauce in the Pesto Chicken salad", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "I think we can all agree there's a lot of great food in the Mission - I can barely walk 5 paces without bumping into something delicious that I want to eat. But Kitava is something pretty different; healthy, tasty food that is veggie-forward while still offering some excellent meat options. \n\nI went in for the first time with low-moderate expectations on the taste front, but I was blown away by how well cooked, well seasoned, and downright delicious everything was. It's obvious a lot of care, thought and love is put into this food and the produce used to make it.\n\nSo far I've tried:\n\n- Zoodles and meatballs: I'm Italian and fancy my family meatball recipe as kind of a big deal. THESE MEATBALLS WERE BETTER.\n\n- General Tso's Chicken: a healthier version of the finger-licking fried dish we all love. Except this batter is made from cassava flour and so doesn't make you feel bloated and oily. Served on rice with bright green broccoli. A little light on the chicken pieces when I tried it, but the whole portion was large and very filling.\n\n- Cuban bowl (see photo here: https://www.yelp.com/biz_photos/kitava-san-francisco?select=c6N7Y3V8deF37oI66DMy-g): I've tried this with the pork, chicken and also meatless, and each time it's been so so tasty. I sub in the cauliflower rice + sunflower risotto, both of which are delicious, and I have never been able to finish the bowl. *chef kissy fingers*\n\nThe space is beautiful, the staff is knowledgeable and there's really nothing else like it in the area. Try it before the ever-growing crowds get too intense.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Kitava is a rare gem in this city, in that they take unbelievable care in making sure that their food is well sourced, and that it is good for you as well. All of their dishes are gluten free, they serve organic meat and vegetables, and they use sustainable palm, avocado, coconut, and olive oil in their dishes.\n\nI have yet to actually visit Kitava's physical location, but I have had delivery from here a number of times (including when they used to be known as Mealmade). My favorite dish of what I've ordered so far -is their meatloaf, which comes paired with sweet potato mash, roasted vegetables, and a dreamy chicken broth based gravy. Their crunchy brussels sprouts are also divine. In fact just last night  - I ate two big orders of them. So good! I appreciate that Kitava uses wild salmon in their fish dishes - and normally salmon would be my go-to order here, but I have yet to be wowed by the way that they cook it here. It's never very moist and it doesn't have a ton of flavor.\n\nIf you're looking for healthy food that has been cooked with quality ingredients - Kitava is your spot. I'm looking forward to exploring more of their menu in these next coming weeks.\n\nTrust", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "1st time here. Thank you for using exceptional ingredients and providing another healthy option in a city that seems to love hedonism :-)\n\nPlease open a 2nd location in the inner sunset! You would do very well.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "Came here after purchasing their dine-in deal for 2 on Gilt with high expectations as my gf is gluten free. I ordered the General Tso chicken with Brussels sprouts as an appetizer. The sprouts were solid, nothing super special. The chicken itself was good, especially for being gluten free. The weird part was the sauce - it basically tasted like balsamic vinegar which didn't go with the chicken at all. Not sure if this was a mistake or not, but can't recommend the dish because of that.\n\nI'd consider coming back to try something else when I'm in the area and needing something gluten free.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Got the general tso's chicken with white rice to go. I felt the rice was a bit undercooked I think. Chicken was tender and tasted good. Also got the brownie which was not overly sweet which I  prefer. I'm definitely going back and will try the Cuban bowl and the bone broth and everything else on the pictures posted here on Yelp. This place reminded me of Little Gem in the Hayes Valley (from a fast casual dining perspective) but Little Gem's more expensive.", "author": "Michael Angelo R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "I've been wanting to eat here for a while because i was so excited for a healthy place to go out. This review is based on food only as i ended up ordering for delivery. A coworker and i ordered the avocado salads and neither one looked like any of the pictures. It was mostly arugula with 4 small slices of avocado on top and drenched in lemon juice. I also ordered the Brussels sprouts (which were overpriced for the amount...$8) but pretty tasty. The cauliflower rice was ok but not much flavor. My coworker ordered the cookie with the drizzle. Can't comment on the taste of that but it was just a cookie. Didn't come with any drizzle. Disappointing.\n\nAnd adding after the response of the owner since it doesn't seem like you can reply. You missed my point on the avocado salad. The point is they weren't anything like the picture of the menu online nor the pictures other patrons have posted. That means we received  way less avocado (definitely not a half) than your normal portion. Sorry i didn't take a picture.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "When I can order off a menu with no substitutions, I'd give 'em 10 stars if I could. Worth the walk for me....General Tso's chicken with Jasmine rice was incredible and finally quenched my craving for Chinese food. \n\nThe ice cream sandwich was a taste of heaven for me and it felt great to finally be able to have a dessert while visiting SF. \n\nPortions were big enough that I had leftovers to make a second full meal. \n\nTHANK YOU to the owner for opening this amazing restaurant!", "author": "Heather R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "It's hard to find lunch spots that are this veggie friendly and healthy without paying out the nose, and this place nails it. Adding salmon is crazy expensive, but if you're down with just veggies it's an excellent deal.", "author": "Dylan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Man it feels good to eat great! Service was quick, food was exceptional, and if they didn't tell you it was paleo and gluten free, you'd never know. \n\nI recommend the Brussels Sprouts and Meat Loaf, as those were specifically what I ordered. Meat loaf sounds basic but they took it to another level. This was my first experience with mashed sweet potatoes, and they were amazing with a gravy that paired excellently with the meat loaf. \n\nCasually dine out or order in, either way you won't regret it!", "author": "Julius B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-03", "description": "3.5 stars.\n\nGluten free, paleo restaurant and is perfect if you're doing Whole 30 and looking to eat out (no dairy, soy, sugar, gluten/grains). It's expensive, but it's unavoidable due to the high cost of the ingredients, like using coconut aminos instead of soy sauce or cassava flour instead of flour.\n\nI got Kitava delivered (they are on Caviar, GrubHub, UberEats, and Doordash) and ordered the General Tso's chicken with cauliflower rice (extra $) since I felt it was the dish that I was least able to make myself (unlike the spaghetti squash bolognese). The breading was surprisingly crisp, and the dish overall was pretty filling. A few of my chicken pieces were dried out and stringy though, which is why I didn't rate it higher.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Now this was an excellent find thanks to Yelper extraordinaire Cherylynn N. who was so simpatico with my recent wave of healthful eating that she pointed me in the direction of this spanking new organic spot which ironically took the place of a very tired-looking McDonald's right outside of the 16th Street BART station. It's a deceptively casual operation where you order at the counter and wait for the food with your number on a stick. I say 'deceptive' only because the prices are higher than you would expect, but the quality of the dishes more than justifies the cost. It was a bit like Chipotle if it went into a health nut phase and then went for a makeover. I really like the concept a lot because this is the type of fast food we all need to move toward if we plan to lead healthier lives. I came here quite early after work. so there wasn't a customer in the place, just what looked to be an employee eating at the one large round communal table.\n\nI had already taken a sneak preview of the menu online, so I knew what I wanted to try. It was the $15 Baja Bowl which mixed an avocado mash, kale slaw, poblano peppers, pico de gallo, salsa verde, and upon my discretion, cauliflower rice since I'm trying to minimize my carb intake. It automatically came with pastured chicken which pulled apart with ease (photo: http://bit.ly/2A0aLwe) - but you can alternatively order wild-caught salmon or cumin-spiced beans if you're a veg-head. I thought it was quite delicious and very fresh-tasting, and the portion was reasonable without getting excessive. The Chipotle parallels are unavoidable, but I doubt I'll look at another burrito bowl with as much fondness. Because I was like a kid in a candy store (an ironic analogy indeed), I also tried the $11 Pesto Meatballs just because they sounded good.\n\nNothing veggie about them, as they were made with 100% grass-fed beef and ladled with sunflower basil pesto (photo: http://bit.ly/2A0baz2). That was tasty and it had been so long since I had actual red meat, it was almost intoxicating to my system. There were no soft drinks served here (so much for refills), so I went for the $4.99 REBBL Maca Mocha Coconut Elixir, which was a \"super herb-powered coconut-milk elixir with dark cocoa, chicory & maca\" (photo: http://bit.ly/2ApiIM9). It was libation enough for me, and you just can't go wrong with coconut in my book. I need to bring Jamie W. back with me next time because he loves General Tso's Chicken and he will be thrilled to know that it comes with cauliflower rice as well. I really hope this place is a raging success because we need more healthy chains like this one. Keep rockin' it, Kitava!\n\nFOOD - 5 stars...bright, fresh, and tasty bowls of goodness...and the meatballs are very good, too\nAMBIANCE - 4 stars...very clean and streamlined to match the menu, no elaborate décor here\nSERVICE - 4.5 stars...very friendly and very skinny...I hate 'em\nTOTAL - 5 stars...considering the convenient location, this will become a go-to spot for me", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "I loved the clean ingredients used to make each meal! They have the best designed menu in the area, making it easy to tell what meal would be best for your diet Gluten Free, Nut Free, Paleo, Whole 30, low carb, or vegan. The best part is they use palm oil to cook in, even with the fried plantains and Cassava chips! Even the quality of the meat is great using 100% Grass Fed Beef, pastured pork, or Wild caught salmon. I got the Cuban Bowel with cauliflower rice and my friends got the Baja Bowel and the General Tso's chicken. We also shared the Avocado Mash with Cassava Chips, Fried Plantains, and Butternut Squash Hummus. I'd say they were all great, except for the fried plantains. Overall I loved the meal and will go back often. I highly recommend this place if you care about health!", "author": "Hanah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "I ordered the Cuban bowl for delivery via Caviar. It gave me the worst case of food poisoning I've had in a very, very long time. Never again.", "author": "A E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Have never eaten at the location due to its sketchy location but have ordered delivery service. I'm sure it's safe but just don't want to deal with all the street life at the intersection of 16th and Mission.\n\nI've ordered the zoodles and meatballs, General Tso's chicken, and a dark chocolate brownie. All were very tasty, fresh, gluten-free and healthy. I usually order here when I have spur of the moment, gluten-free dinner guests.", "author": "Charlie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Such a great and unique selection of gluten- and dairy-free food! Make sure you try Baja Bowl, my personal favorite. Service is very good and personal.", "author": "Alina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "I am an extremely picky eater who HATES vegetables but I am still dreaming about Kitava's brussel sprouts.\n\nWhen I think of a place to eat that embodies the spirit of San Francisco, Kitava is it. Occupying the space of a former McDonald's, it is beautiful, airy, calming, and kind with warm and friendly staff members who give back to the community.\n\nWe shared a plate of the brussel sprouts and Cuban pork. As a picky eater, I figured I'd be able to take a few bites of the pork and avoid everything else on the plates (especially the dreaded veggies), but ended up eating every single bite, or trying to - it was wonderfully filling. The brussel sprouts especially were a standout; they were almost more like potato chips than anything else. We paired them with kombucha on tap, which was surprisingly smooth and non-vinegary.\n\nI never thought I'd be so excited by healthy food. But Kitava makes it approachable and casual.", "author": "Season H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "I like what they're doing here. Hard to find a restaurant in this city that combines healthy food with hearty dishes and lots of flavor - which is pretty surprising given the California culture. There's something for everyone on the menu and you'll be happy knowing you put something good in your body. \n\nThe decor inside is warm and inviting, great for groups or a casual date. Good music plays overhead and friendly staff. \n\nI'm giving this 4 stars because with any new restaurant there are things to tweak. For example I ordered my meal to eat at the restaurant but it was packaged to go. The avocados in my Cuban Bowl were not ripe and were rather hard. And, to be frank, spending $20 on my one dish was a bit more steep than I would have liked. I realize you pay for quality ingredients here but do note you should expect to pay more than your average fast casual restaurant. \n\nOverall I left full and satisfied. Big up to the habanero pineapple sauce too, but add some more heat!", "author": "Jon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I drive into the city from the east bay just to eat here. Where else are you going to find an entirely allergy free restaurant (soy, nut, gluten, and dairy free) with heritage pastured pork and grass-fed and finished pastured beef? (In the US beef can be labeled grass-fed so long as they're eating grass the last 30 days prior to slaughter). I believe the owner started this place after getting well from personal health challenges through proper food and nutrition. As someone with food sensitivities and health challenges myself, I really appreciate having a place like this where I can dine out safely. The area can be quite dodgy, especially across the street, but it's worth trekking through the urban jungle once in a while, pungent odors and all, to get high quality clean eats.", "author": "Tien H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "SUCH a good find in SF!!! Loved that this fits with my personal food lifestyle. Loved the main meals but the desserts were my favorite- went back for more!! Ice cream sandwich was my personal favorite! If I lived in SF I would be here often! Service was very friendly and helpful!!", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "I ordered delivery from here, and was pleasantly surprised. This dairy and GF life is ruling me, so I'll be ordering from here more frequently. I ordered the pork entree, and the salsa it was bathed in, made the dish. Cumin beans, to keep my microbiome in check. Thank you.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "My new favorite restaurant in San Fran! The food is amazing, the staff is attentive and efficient and the ambiance is great. \n\nWe ordered the pesto meatballs, Brussels sprouts, avocado mash to start. The meatball are out of this world. For our main courses we had the Cuban bowl, General Tso's chicken, Baja bowl and Spaghetti Squash Bolognese. For 4 people it was more than enough and everything was incredibly tasty. \n\nI can't wait to go back!", "author": "Andy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "A surprising find right by Mission & 16th. Super cool quick and healthy, it's far better than many of the alternatives nearby. Trying to remember what was here before. Was it a McDonald's? The only similarity is that this place serves food fast and there's no table service. Otherwise it's kale and brown rice for you here, except... it's soooo tasty. You should try it out. I know I'm going to keep coming back until I've tried everything on the menu!", "author": "David A R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "If you eat keto or paleo, once in a while you really need to take a break from cooking every day, right?\n\nEnter Kitava. They have you covered right down to every last ingredient. Try the Avocado Salad -- so refreshing and filling.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I found this place by yelping \"paleo\" or maybe \"keto\" to try to find healthier food options near my office in the mission. I cannot say enough about the food and service. Employees were kind and the food is so delicious. General Tso's chicken was crispy and perfect. Spaghetti squash and beef bolognese was so wonderful and I LOVED the cuban bowl. I ate here 3 out of 3 days on my last work visit to SF. Also, they sell Paleo Treats, a paleo desert company based in San Diego (where I live) so I've already visited them here =) Great coffee, too. Plus I loved the clarity of the menu online so you know exactly what you're getting (awesome for people eating categorically) Can't wait to come back!", "author": "Shvonne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Food was very healthy and delicious. I had the Butternut Squash Spaghetti with Mushrooms.", "author": "Kenji M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Yeah, it's kinda pricey. But where else are you getting your fast casual bowl with cauliflower rice or zucchini noodles? That's what I thought.\n\nAs others have touched on, pricing precludes this spot from being an everyday destination, but I *really* like what I've had here. The Baja Bowl with pastured chicken, avocado mash, kale slaw, poblano peppers, pico de gallo, salsa verde, cauliflower rice & extra kale slaw (instead of beans) has become my go-to, as it's packed with flavor while also being fairly guilt-free. Plus, while I might not be vegan, paleo, or gluten-free, I definitely appreciate the options Kitava has accommodating these lifestyles.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Kitava (formerly Mealmade) is a lunch and dinner delivery service (Monday-Friday) which focuses on all the healthy buzzwords of the moment: \n* 100% grass-fed beef, free-range poultry and sustainably-caught seafood\n* Organic produce\n* Gluten-free EVERYTHING\n* No soy, no canola oil\n* Paleo (mostly; they have some dairy & grains in some dishes but they identify them for you)\n* Low glycemic sweeteners and healthy fats\n* Nutrition info, full ingredient lists and photos for all offerings\n\nThey cook their meals to order and deliver fast, usually within a half hour. For delivery, they use either GrubHub ($2.99+Delivery fee) or UberEats ($4.99, tip optional), or DoorDash (cost depends on what you order, but I think they're the costliest delivery option). You also have the option to pick up your meal from their Mission location using GrubHub. \n\nI've ordered from them 20 times since November 2016. They really impressed me with their honestly great-tasting food and they have not forgotten a single item or messed up any orders. In short, they are on the frigging ball. The only tiny, very tiny, quibble I have is that it would be nice to request they bump up their spice level on some of their dishes -- but I understand that in order to please more palates, they keep their seasonings on the gentle side. \n\nThey even cook Thanksgiving lunch and dinner -- I got it last year and it ROCKED. The turkey was moist. The mashed cauliflower was creamy and delicious. The sausage and apple stuffing was pure comfort food (gawd, I love stuffing). Even the Brussels sprouts were tasty, and they are not at all my favorite vegetable. Oh, and the cranberry relish was tangy and zingy. Lastly, the pumpkin pie was rich and decadent. \n\nSeriously the best delivery service I have had so far in San Francisco. They don't have junky foods (mmm, donuts) or cheesy pizza that I crave sometimes, but for the \"healthy\" stuff, they got it going on. Oh, and their customer service is *excellent*.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Very cool place.  Once you step in,  you are in anotber dimension.  Sane, chill, relaxing-that's just the atmosphere.  The gal at the register was terrific and patient with us newbies.  I had the big cuban bowl with shredded pork and a few slices of avocado, side of coleslaw with kale, cauliflower rice, beans-so delicious and healthy.  The general zhou's chicken was with cauliflower rice and broccoli.  The best is the roasted butternut squash hummus with non-greasy yucca chips.  To top off the meal the ginger lemongrass komacha was so good.  Better than a beer.  The server was wonderful too.  Order at the register, get a number, and they will bring it to you.   Lots of people order to-go.  This place makes me feel healthy.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Lots of vegan and vegetarian options. Just. In addition to whole30. Staff is friendly and conveniently located in the mission district right next to 16th street Bart station.", "author": "Madhu J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Ever since I discovered Kitava just a few blocks away from my office this has become a staple in my lunch rotation. Great space with plenty of seating for groups of various sizes, orders come out really quickly (even during the lunch rush), and the food is very healthy and delicious. I've tried about half of their main dishes and I've enjoyed every one. I really like the \"build a bowl\" option, and the zoodles+meatballs is delicious and surprisingly healthy \"comfort food.\" The plates are always much larger than I expect and I rarely finish an entire meal. Which is crazy given that everything is super healthy - proof you can live the paleo life and not feel like you're still starving at the end of a meal.\n\nI also appreciate the staff's focus on ingredients and helping people to find dishes that meet their dietary restrictions. This is somewhere I can easily bring my vegan, w30, paleo, and allergy-riddled friends and everyone can find something that works for them. I have a serious nut allergy and whenever I mention this the staff are quick to read through all of the ingredients in a dish and verify that it will be safe for me to eat. It's nice to go to a place where I  don't feel like I'm inconveniencing anyone. Also having easy add on options for cauliflower rice and other dietary adjustments is super useful.\n\nThis will continue to be a go-to lunch spot!", "author": "Alissa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "I was doing an autoimmune paleo protocol and needed some flavor, and this is one of the few places in the city that I could go to without modifying everything I ordered. They have an AIP menu that's only slightly limited compared to their regular menu. \n\nThe servings of yuca chips plus avocado dip were very generous! I got the general Tso's chicken, it was delicious! Fried chicken is not something I get to eat often... I've also tried the pulled pork and meatloaf before. No symptoms afterwards, so all a good sign!\n\nI would advise against the cauliflower rice because it gave off a weird noxious smell.", "author": "Maymie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Whole 30 approved! \n\nLove this place. Pretty affordable dishes 10-15$ for items such as Zucchini & Meat Balls. Recommended", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "So excited to find a place to eat!! Loved the fried plantains, Cajun bowl, cookie and brownie!", "author": "Shannel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I like the whole food, paleo style approach, the people who work here are good people. The food is nourishing and wholesome I loved it!", "author": "Jules H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I was so excited to find Kitava on a recent trip to SF for work. I eat mostly Paleo, and Kitava is one of the few restaurants I've found where I didn't have to modify my meal to make it Paleo. I ordered the avocado mash w/ yucca fries, the spaghetti squash bolognese, and a pint of ginger kombucha, which they have on tap. Everything was delicious, and I had enough bolognese leftover for lunch the next day. It was easy for me to hop on BART, and Kitava is right across the street from the 16th Street station. I didn't try dessert this time, but I will definitely be back soon.", "author": "Tara T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This place is amazing, yummy good for you food. I had the zoodles and meatballs and the guacamole and yaro chips they where both amazing. The cashew maple ice cream is to die for!!", "author": "Hope A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "I had the General Tso's Chicken with Cauliflower and the Butternut Squash Hummus with Yuca chips recommended by Jazmyn. :) thank you for being patient and kind with me and making such delicious recommendations. :) I love the different selections Kitava has and knowing it's all 100% Gluten free ... even the DESSERTS :) doesn't make me feel guilty. I didn't get to try any desserts but it's a must for my future visits. I would highly recommend don't forget to ask Jazmyn anything for she makes amazing suggestions with 5-Star customer service!", "author": "Veronica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Haven't written a yelp review in years, but felt inspired by how great this place was! Nice to find somewhere with low carb options and REAL food! No soy, gluten, or any of those irritating ingredients. I felt energized and healthy after eating here, and it tasted delicious. I should mention again - TASTED REAL! Definitely will be coming back next time I'm hanging out in SF. Cuban bowl with pork was quite instagramable as well (just a bonus).", "author": "Sweden C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Delicious healthy food that leaves you satisfied (but not bloated!)  Clean, simple, and friendly.  Try the Cuban bowl--a wonderful mix of sweet plantains to round out the protein.  My wife loved the Gen Tso chicken.  Highly recommend.", "author": "James C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "What a hidden-in-plain-sight healthy gem! I got the Cuban bowl with cauliflower rice and sunflower risotto and a rebbl beverage- love how all is local, creative, flavorful and fresh. I'll definitely be back!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "I LOVE this place. Amazing AIP menu that makes it easy and safe to eat without concern. I eat here at least once a week if not more. Probably my fave restaurant and would very much recommend to anyone who is following an AIP diet and is in the Bay Area.", "author": "Alix R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "This is such a convenient eatery for good quality food. I had the Baja bowl on my most recent visit. Since I'm not a fan of either cauliflower rice or white rice, I opted out for plantains instead. I only wish that they have brown rice as an option. The portion size is moderate, but the food is very filling and dense! You will definitely feel full afterward. Don't forget to on some of that delicious habanero pineapple sauce that comes in a squigee bottle.", "author": "D W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "I take friends here who are health freaks / \"clean-eaters\" / have digestive issues. I love the General Tso's chicken and the bone broth but feel like a lot of the dishes need some work (especially given their price point). I highly recommend. HOWEVER, when I ordered the \"make your own plate\" with chicken ($15), the chicken was so dry that it got stuck in my throat. I had two options: wash it down with a drink or feed it to my friend's pet dog. Not ideal. The roasted Brussels sprouts and cauliflower were also undercooked. A shame, because I love those vegetables! (I tried the fried Brussels sprouts and those were much better)\n\nAlso the cookie is VERY DRY. You will also need to wash it down with a drink. Do not order it, unless you are desperate for a cookie (which, if you are gluten-free & paleo, you might be).\n\nThe ice cream is very good. But expensive.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Kitava has an incredible menu that's accessible to people with all sorts of dietary restrictions.  The staff is incredibly accommodating and has a book on hand with all the information about what's in each dish.  I also signed up and took a cooking class there, which was wonderful! The whole place has a very community-like feel.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "I'm in love.  And it's in my hood. I've been aching for a paleo spot in SF. (Move over Little Gem.) The food is delicious, healthy, affordable. Unpretentious. ALL GOOD. Please go here, order big, and let's make them wildly successful. YUMMMMMMMMMMM", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-24", "description": "This is an update from a previous review.  In my previous review, I gave them four stars, after having tried two of their meals: Baja Bowl and Cuban Bowl.  I had mixed feelings about the food, but was pleased there was a paleo/gluten free place to go to in the Mission.\n\nI went back this Friday to give Kitava another chance, since it had such good reviews on yelp.  I ordered General Tso's chicken (best reviewed) and was sorely disappointed.  The rice was undercooked and the chicken was not filling or particularly tasty.  I was also underwhelmed by the chocolate brownie for dessert.  In sum, I would say Kitava is not worth it for the price, but if you're in the area in a pinch, the food will do.", "author": "Jordan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "Came here last night for the first-time. Disclaimer: I eat fairly healthy, but nothing this health-focused generally. I usually eat lots of meat and I'm not afraid of carbs.\n\nSo while everything on the menu here isn't necessarily for me, I can still respect it. Kitava is still a pretty cool concept, especially given the rising demand for vegan, allergy-friendly, and gluten-free options. \n\nI had the Spaghetti Squash Bolognese. It's a really nice dish, especially for pasta-lovers (roasted spaghetti squash noodles, bolognese sauce, fresh basil). If find yourself hungry and looking for a slightly heavier dish (relative to other stuff here), this is a good pick.\n\nThe plaintains are also dope. Don't sleep on those!! \n\nThe vibe in here is truly friendly and relaxed, almost in a coffee-shop sort of way. Not sure if that's a good or a bad thing, just an observation. It's differently different than your usual Mission dinner spot, but I found it to be a very chill place to eat.\n\nOnly minus is that the seating in here is a bit sparse and hard to find. We had to wait a few minutes to get a table, and even then we seemed to get lucky with the timing. I'd imagine this means your ability to find a seat really boils down to luck more than anything else. So just be aware that if you're planning to dine-in during peak dinner hours, grabbing a table might be a bit tricky.\n\nBut all-in-all great meal! Would certainly come back.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-28", "description": "This place is a fast casual dining spot specializing in \"healthy\" food, right by the 16th St Mission BART station. I really love the menu offerings: lots of options for vegetarians and vegans, and very doable if you're eating low/slow-carb/paleo-esque/Whole 30. I also really appreciate that the vegan options were clearly marked! I wish there were *more* veg-friendly protein options; beans are a great start, but I'd love some eggs, faux meat like Beyond Sausage, or chickpea tofu.\n\nThe food itself was pretty tasty although just a touch on the bland side. I got the vegan Cuban bowl, and my husband got veggie tacos (a special) plus yucca chips.\n\nThe restaurant is a nicely designed, comfortable, clean place. It's one of those places you order at the counter and get a number, and they bring your order to your table. There were only two copies of the menu at the counter, so if you were waiting in line, you couldn't spend your time waiting deciding on what you were going to order. Staff also weren't doing a great job clearing tables, and patrons weren't busing their own tables. In addition, our food came out in a slow trickle. First, they brought out the yucca chips pretty quickly. Then, in a reasonable amount of time, they brought out my husband's taco. He had ordered queso they had on special to go with his taco, but it wasn't until they brought out the taco that we learned they had run out of queso. The server offered to bring aioli instead, which sounded good. But then it took another five-ten minutes for that to arrive, and my dinner was still missing. It eventually arrived, but my husband had almost finished eating by then.\n\nService issues aside, I'd give them another try. They also deliver via various services, which seems super convenient for a weeknight healthy dinner.", "author": "Sylvia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Delicious and healthy food that can be delivered anywhere in SF. Try the General Tso's chicken here it's excellent!", "author": "Phil K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Really excellent food and a great option for low carb. I was worried it wouldn't be filling or the portions would be small but the portions were actually really big and I was stuffed after I ordered a bowl.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Clean delicious amazing food.  Everything I've had has been exceptional and perfect.  Thank you for being there Kitava", "author": "Dan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "After 20 days on Whole30 it was a distinct treat to be able to walk into a restaurant and order straight from the menu with no substitutions, special requests, or worries. Just that probably would have earned three stars. The very friendly staff, clean, open, inviting space and kombucha would have added another star. But the actual food? So delicious. And for those of you a little suspicious of 'health food' - it was delicious by any standard. We tried the General Tso's chicken and sauce and the Cuban bowl (cauliflower rice in both cases instead of jasmine), plus got sides of plantains and Brussels sprouts. (Note that, despite my previous raving, not everything is Whole30 compliant (see those beans in the Cuban bowl?) so do be sure to actually read the menu.) Welcome to the neighborhood, Kitava!", "author": "Lori W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Amazing food high quality and made with love. Also very well priced. \n\nI got the spaghetti and tsao chicken it was amazing!!", "author": "A G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "This place is wonderful. It is very rare to find vegetarian restaurant options that are not cheese/carb heavy, or just plain boring. I work close by and eat here about once a week. The baja bowl (my go-to) is full of a variety of textures and flavors, and it feels like eating home-cooked food. The staff has always been very friendly. I HIGHLY recommend trying this place out!!", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "We ordered the General Tso chicken with cauliflower rice and broccoli. Food was\nlukewarm at best when it arrived. The chicken was over cooked, dry and rubbery as well as bland. They put liquid aminos in a pool at the bottom of the container. We couldn't eat this food. If it's good for you it has to taste awful, right? We ordered from DoorDash and contacted their customer support. They offered us a $1.99 credit for next delivery-that's it. Needless to say very disappointing.", "author": "Maria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Fresh, solid lunch fare. It never disappoints. I wish they had more grain and legume options but I like what they have.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Seriously amazing. This block needed an affordable healthy option SO bad and this fits the bill perfectly. I'm usually anti overly healthy vegany places, but this spot serves meat and doesn't take themselves too seriously. GET THE ZOODLES!", "author": "Corinne A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "Ordered general tsao chicken today for delivery as I was so hungry after work (I normally don't do takout). $15 for 6 tiny pieces of soggy chicken and undercooked broccoli over white rice. So overpriced! I was not impressed by the lack of seasoning other than a soy vinaigrette that was soaking at the bottom of the dish. While this restaurant seems like a good concept, I do not wish to try this place out again.", "author": "Logic M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "*** edited - see below for original text ****\n\nYelp reviews don't really allow for interaction when the owner responds so I'm using this space to respond to the owner. \n\n1. It was never my intention to get your staff fired from my comment. I feel horrible about that and am sorry that you couldn't find a better resolution to the issue.   \n2. I make a lot of chicken bone broth at home. That's not what I tasted on the meatloaf. It was an off flavor from within the meatloaf.  \n3. I would prefer just salt and oil over your amino blend. Or just use soy sauce. Why would I want my vegetables sweet anyhow?\n4. There is nothing wrong with msg - it's a massive socially propagated belief that it's bad. Do some research and look at some studies. Not a single double blinded study has found any problems with it. It's just an amino acid stabilized by a sodium ion (as found in salt). It's found naturally at high concentrations in so much stuff, like Parmesan.  If you want something salty, we add salt. If you want something with more umami, you add msg. \n\nAlso, I spoke to one other guy who got the chicken. According to him it tasted like it was just boiled in water. Can you not use oil and sear meat with the paleo diet?  \n\n****************************************\n\nI had high expectations for this place.  Im doing a lot of low carb and was happy to find a place that had so many low carb options.  4 of us came here for lunch and had the meatloaf, general chows, chicken, and pulled pork bowls.  Meatloaf and accompanying sweet potatoes had such a strange off taste.  Bitterness and citrus and funk.  Meatloaf should taste like meat.  I have idea what it tasted like. The general chows was meh and only tolerable due to my friend not having had breaded chicken for a long time - but he says the cauliflower rice ruined it.  I tried some spit it out into a napkin. The pulled pork was so bland - but managed to be the best option because it lacked funky strange off flavors. \n\nTo top it off, the person at the register pre-pressed the 20% tip button before showing is the payment screen. This is a no service establishment.  20% to take my order is just ridiculous.  \n\nOne of us (with the pork) said he might come back. Rest of us will not. I didn't eat more than two bites of the meatloaf and I'm off to the Taco Bell on duboce to get this nasty taste out of my mouth.", "author": "reza n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "I'm waiting for my food at Kitava now. Literally nobody around me has their food. Everybody is waiting, and it seems like only one person works here. We had to find a dirty table and bus it because nobody is cleaning up.  No glasses for the self-serve water, no forks in the self-serve cutlery on each table. We stood in line waiting to order for about 10 minutes, now waiting for our food. I'll update once we eat, but at this rate it could be a while.  So far this is a hot mess.  They don't have their shit together yet. Maybe order to go, but don't dine in. Especially if you have plans. \n\nUpdate: I was served a good 5 minutes before my boyfriend was served. My Cuban bowl was delicious but my boyfriend's General Tso was dry and meh. The overall experience sucked, especially because the front door was constantly open since delivery guys were running in and out every minute and cold air was coming in the whole time.\n\nBill for two people ordering one dish each is $40.", "author": "Tamara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "This place is a paradise for clean-eaters. Even if you are not into that kind of thing the food is very delicious. For anyone that has dietary restrictions get here now. I've been saying we need a restaurant similar to Hu Kitchen in NYC. This is the place! \n\nI had one of the specials - a pork and plantain bowl - amazing slow cooked pork, perfectly sautéed plantains, a yummy verde type sauce and pico. They kindly swapped the rice and beans for extra plantains (noms). Also got a green iced tea, fudge brownie, and an order of the butternut squash hummus with yucca chips (yeah I had to try multiple things I was just do excited). All of that stuff was only around $25 (a good deal in my mind for everything I got).\n\nButternut squash hummus was unlike anything I've ever had. If they sold it I would buy the gallon size ;) \n\nMy friend got the bone broth and avocado mash with yucca chips and couldn't stop raving about both. \n\nIn short check them out or order one of their many delivery options - Caviar etc.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "Have no complaints! Bright and clean inside (in contrast to 16th St BART area...), and fair price for some relatively healthy food. I was worried that it wouldn't be flavorful because it was \"healthy\" but my dish was super packed with flavor!", "author": "J. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "I've only had delivery. This is one of my favorite restaurants. Being plant based it provides me with options that are flavorful and filling.", "author": "Sheralyn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "First time dining at Kitava and it was just about perfect. I love the fact that my friends and I could each eat anything on the menu we wanted (of the four of us one eats paleo, one vegetarian). I had the spaghetti squash bolognese and my friends had the cuban bowl (one vegan and one with pulled pork. We all loved everything. I came home and told my family and seriously i think we are going back tomorrow so they can try it! Thanks for being here and also for being mindful of the neighborhood and gentrification which a previous person mentioned in their post. There's a place in the bay view where customers can pay for a slice of pizza and they will give it to a person if need who comes in if they are hungry and can not pay. I wonder if that's  something you might consider? The way they do it: you pay for a slice and they place a sticky note in the window letting a person in need know there is a free slice waiting for them if they need it. When the stickies run out, people know there are none available. I would totally participate in that if you offered it. Just a thought.", "author": "Lisa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Delicious. Healthy. Creative menu. Nice decor. Love the live plants inside. Great staff.", "author": "Mj D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Amazing fresh food and fast service! My sister and kids got the Cuban bowl (beans, rice (but not too much rice), plantains, veggies), I got a salmon salad (beautiful spinach, cabbage, romaine, nicely cooked salmon without being dry) and we shared Brussel sprouts (can't go wrong with fried sprouts). Everything was so good and the portions were huge!! I will definitely be going back there next time I'm in San Fran.", "author": "Kitty W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "A new staple in the mission. We went with a small group of friends and shared a few appetizers and mains. Everything we had was delicious. Personal favorites were the Brussels sprouts for a starter and Zoodles with meatballs for the main. \n\nThe place was also very inviting, as were the people working there. You could tell they care about making very tasty food using wholesome ingredients. \n\nI'll definitely be back.", "author": "Jeremy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "My health is a huge priority, and that starts with the food that I put in my body. San Francisco is a great place to find really healthy food, but Kitava has blown me away with their healthy and paleo options. Everything is tasty, and everything makes me feel good after I've eaten it.\n\nI've spent time talking to the founders of the place, and their philosophy about food and health mirrors my own, which means I'm eating the same quality food that they'd put in their own bodies.\n\nI also order their food delivery on GrubHub all the time. Sometimes you want takeout that's actually good for you. \n\nIf you're looking for healthy fast casual food, try these guys out.", "author": "Austin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "I am hooked on delivery from Kitava! The portions are huge - enough to share for two. Every thing I have ordered has been flavorful and fresh - tastes home cooked. \n\nI especially enjoy the cuban bowl, pesto meatballs and the ice cream sandwich. \n\nKitava Crew - thanks for all you do to prepare this food!", "author": "Kelsey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Their Spaghetti Squash Bolognese (no wheat) - Wow! Incredible. I got it to go as I'd just finished a run their with Run Way/SF and when I got home I ate half as my midday meal. I've saved the rest for today.\nGood vibes from the staff. I'll be a regular, so much on their menu is tempting.", "author": "Jack T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Finally a \"paleo\" place in San Francisco. \nI ordered just about everything off of the menu. Zero complaints about any of the dishes and sides. \n\nMy favorite dish was the Cuban bowl (yummy pork goodness) and I really enjoyed the \"pesto\" meatballs. \n\ngeneral tso's chicken was also amazing. Breaded with cassava flour (which is a prebiotic) served over a bed of cauliflower rice and broccoli with a side of coconut aminos. Delicious !! \n\nI definitely recommend this place!\n\n5 Star food !", "author": "Alvaro C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "Second attempt. Waited in line. \"Sorry, no Salmon today.\"", "author": "iko o."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "Me and my wife went there in the evening. I don't wanna talk about the price and portion. Because it was ridiculously. We ordered a Cobb salad and salmon. The salad was ok, but the salmon is super dry like jerky!! I don't know if they preheat the salmon or they made a mistake and reheat the order. We also ordered side of Brussel sprout and it came in yellow color. The table right next to us ordered the same thing and it looks so green and fresh. WTF!! I will never come back again. Hopefully I m the only lucky one to get these kind of food for these price, thank you!", "author": "James F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-16", "description": "Baja chicken Cuban Mojo Pork Spice toasted cauliflower and Jasmine rice is what I had on my plate for the night. \n\nFor the place to be on 16th and Mission the other TL of SF it's a nice place.", "author": "Mychelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "This is my go to lunch in the mission, it's healthy and tasty. I order from here at least once a week for lunches at work. Everyone at work is on a different type of diet and this place fits everyones needs. People go back to work happy and full.  The favorite in the office is General Tso's chicken with the cauliflower rice!\n\nThe restaurant its self is very clean which is a plus especially since it's in the mission.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Favorite spot, I stop by or order delivery at least once a week. A place focused on higher quality with a variety of offerings available.", "author": "Jaron H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "I'm so happy this place exists. Their paleo & whole 30 compliant dishes are delicious. My go-to is the spaghetti squash and bolognese sauce, though I've tried most items on the menu and have been pleased with everything. If you're not used to eating paleo or whole 30, the dishes likely won't taste like what you're expecting. For example, General Tso's chicken won't taste like the Chinese take out dish filled with msg and regret. Instead, it'll be a healthy meal that leaves you feeling energized and satisfied.", "author": "MP B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "I practice a paleo lifestyle and this place hits the spot! It's refreshing to see you can get grass fed beef and pasture raised meat without breaking the bank. The ginger kombucha is awesome!", "author": "Supreet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "As I write this post, I'm currently on day 6 of Whole30. Today I searched for Whole30 compliant restaurants and Kitava appeared to be first on the list. My boyfriend and I decided to eat here for dinner and ordered a Cuban Bowl and Spaghetti Squash Bolognese. The staff were very accommodating to meet customers' needs, especially when they're on a diet like Whole30. Kudos to the staff and management for having a binder dedicated to all the listed ingredients of their menu. Whether you're on Whole30 or not, we were glad to be able to customize our own dishes with the compliant ingredients. As soon as we paid our order, we sat down on a table and did not expect to get our order in less than 5 minutes. Lastly, we were curious to find out about a yellow sauce in a bottle. I kindly asked the staff what it was and it was actually Whole30 Pineapple Habanero sauce with no added sugar. I immediately fell in love with this restaurant and would love to go back regardless of my future diet plans.", "author": "Gene A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Just tried delivery from Kitava and was super impressed. Baja bowl with Pastured chicken, cauliflower rice, avocado salad all fresh and delicious. Delivery was prompt and professional (grubhub) and the restaurant called when receiving my order to see if spinach was ok to substitute for arugula (it was). That they run out of arugula in the evening means they keep their stuff fresh, which comes through in the taste. Based on this great meal, I will need to visit their brick and mortar spot. Thanks Kitava", "author": "Tom J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I loved ordering from Mealmade, so of course I was super excited to see that they have a restaurant I can visit at least once a week!! I tried the General Tso's chicken with cauliflower rice, who needs rice when you have cauliflower rice...they totally need to sell this as a side!! I would eat this with all my Asian dishes!! The place is small, but the order delivery was rather quick. I can't wait to come back and order some other items off the menu. I do hope they bring the collards back, they were one of my favorites!", "author": "Korynne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "By far one of the safest and most delicious places to eat for someone with food allergies and intolerances. I appreciate and respect their commitment to quality, nutrient-dense meals made from locally sourced and sustainable, organic ingredients. Great portion sizes, so you get that bang for your buck, and the space is cozy and inviting; it's come a long way since being a Mc Donalds. Do yourself a favor and get the General Tso's Chicken....you're welcome.", "author": "Araceli E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Tastes great and also healthy? Win! I've had the general tso's chicken with cauliflower rice and the beef and pesto meatballs. Both were excellent. The decor inside is also a delightful retreat from the hustle and bustle of the mission.", "author": "dan s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "Very underwhelmed. Ingredient flavors did not go well together and seemed just thrown together in a bowl and called healthy", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Delicious food. Great vibe. Definitely coming back. Highly recommend the butternut squash hummus. Finish off with almond cookie vanilla gelato sando. So good!!", "author": "Nathan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "This is hands down the most amazing food delivery I've found in San Fran. Me and my boyfriend use to only go to wholefoods hot bar but now we only order from here almost every night. They have gone above and beyond to accommodate my special request and the few times my order had some small mistakes they exceeded my expectations at correcting them and making things right. Finally delicious healthy food I can have delivered. Score.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "Have eaten here twice, once in the restaurant and another time getting takeout. Good dining out option if you have dietary restrictions; they use high quality ingredients and portions are generous. The downsides are slow/inefficient service, blandish flavor, and price ($18 for a chicken, slaw, & rice bowl). It's a nice addition to the neighborhood, but until they iron out the operational kinks I won't be adding them to my usual rotation.", "author": "Lulu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Excellent deliciousness! Clean and locally sourced, nutrient-dense fun and nice atmosphere to sit in the heart of the mission. Definitely recommend!", "author": "Ave L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "We were so impressed with our dinner at Kitava! In addition to being made from scratch from high-quality and clean ingredients, everything we ate was so delicious!\n\nWe ordered the butternut squash hummus with yucca chips, crispy Brussels sprouts, the Cuban bowl with cauli rice and sunflower seed risotto, General Tso's chicken with cauli rice, and an almond flour cookie and dairy-free vanilla gelato for dessert.\n\nEverything was great but our favorite things were probably:\n- General Tso's chicken, which was crispy and perfect. All of the comfort of chicken nuggets without all of the unhealthy crap!\n- Sunflower seed risotto -so tasty and such a great idea for a bean replacement that neither of us had ever thought of!\n- Crispy brussels sprouts - now I know a lot of restaurants make something like this but often they're undercooked (no one wants raw brussles) and guarantee they're not using healthy fats to cook them like Kitava does.\n\n- Vanilla bean gelato! It's amazing and you'd never know it's dairy-free (made with cashew milk). Even better it's also egg-free which is great for those of us with egg allergies.\n- *Bonus: special shout out to the bottles of habanero pineapple hot sauce on each table which we wanted to take home with us (don't worry we didn't, although we made sure to add some extra to our togo boxes).\n\nEating out can be really difficult based on food sensitivities/allergies or the conscious choice to eat higher quality food and avoid industrial seed oils, commercial meats etc, but Kitava does a great job making going out to eat stress-free (besides trying to decide what to order because you want to get everything).\n\nGo check them out! Or if you're in SF, have them deliver to you!", "author": "Rachael O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Omg this place is amazing. The owners are sooo nice and the food is great. I'm a vegan and this spot is perfect for food. Many vegan options and great portion sizes. I had the roasted brassica salad - amazing.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "To start, Kitava is one of my favorite gluten free restaurants in the city. I usually order their General Tso's chicken and maybe some bone-broth, both of which are gluten free. It's a little bit pricey but it has a good environment inside of the little restaurant. The location outside is crazy and loud, but inside, it's its own safe haven from the rain.", "author": "Summer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "I'm a vegetarian/vegan and I love all the options that they have here. The food is extremely clean & fresh tasting! The options are healthy whether you're into meat or not! They base a lot of their menu mostly off of the islands of Papa New Guinea and do a great job at it! They also have two kombuchas on tap! This place is a gem!", "author": "Marty M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Finally, a 100% Paleo restaurant! Everything was fantastic, flavorful, and our food came out QUICK. They've got a bunch of desserts (that we will try next time) and they've even got some booch on tap. Awesome place to go if you are Paleo, gluten-free, dairy free, or on a Whole30.", "author": "Summer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "I am on the autoimmune protocol and this restaurant is just what I was looking for on my trip to San Fran. They have an AIP menu to make it easy for anyone on strict or modified AIP to pick what they can eat; they even host an AIP cooking class! I really wish there was a place like this in LA. Overall very satisfied with this restaurant!", "author": "jasmine g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Not sure why SF never had a place like this before, I love Kitava! It's right off Bart and super convenient, the food is made with REAL ingredients and Paleo/Whole 30 friendly. The General Tso's Chicken was great as well as the Cuban Bowl with pork. I will definitely be going back. I have used yelp for 5+ years and never left a review. The food here is worth it.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Amazing food and great staff. The Brussels sprouts are to die for and the vegan Cuban plate is amazing. Definitely a great place to go to keep it healthy", "author": "Sabrina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Arrived on time. Bone broth was wonderful and the Kung Pau Chicken, plantains, and avocado salad were delicious. I'm happy I found this place. I've been under the weather and exactly what I needed.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "Great healthy eating options. We ordered food and they delivery was quick hassle free.", "author": "Tejal D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-25", "description": "Have ordered takeout from here 3 times now, and I have to say it's never blown me away. Bummed bc I was really hopeful about it given all the good reviews. The bolognese and the zoodles with meatballs were okay. The Baja Bowl (I got it with the adobe chicken and cauliflower rice), I'm sad to say, tasted like dog food. I've never been to the brick and mortar, which looks like a really nice space, so maybe the experience is better when you're actually there. For now though, I'm scratching this off my takeout list and will have to look elsewhere for healthy meals.", "author": "Brodie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "This food fed my soul!!!! I came here with my vegan daughter, in paleo/whole30 and we were able to order our meals together and be compliant. I cannot stress have w fresh and delicious the food is. The bone broth was amazing. I cannot say enough good things about the food and customer service here. I'm from out of town but will def be here every time I am in town.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "My favorite restaurant!  I have a bunch of allergies and this place has given me so many great choices!!  I love it.  Shout out to Virgil for great customer service and fun.  Favorite place in San Fran if not the world.", "author": "Marcus P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-27", "description": "I've eaten hundreds of no-carb, low-carb, and paleo meals, so I was excited to see what the pros can do.\n\nI tried a mix-and-match Brussels sprouts, chicken, and sweet potato mash bowl.\n\nBrussels sprouts: They transported me back to the mid-80's whine-to-your-momma era of vegetables. If they were boiled or steamed, just close your restaurant please. If they were roasted, do it about twice as long, in a single layer, and consider a little salt, pepper, oil, and if you're feeling fancy a small splash of balsamic vinegar.\n\nChicken: It was a bare pale chicken breast with that odd slightly rubbery wetness that boiled (perhaps you'd call it poached?) chicken has. Not much else to say because what else is there to say about a boiled chicken breast, the next-blandest protein to tofu? Consider roasting or searing these in a pan, sprinkle on some herbs, and possibly switch to chicken thighs for more (any) flavor and texture. There was a dipping bowl with about 1 tablespoon of lemon juice and herbs that helped a small amount. If you serve chicken and it's less flavorful than what you can get every day at Chipotle, there is work to do.\n\nSweet potato mash: I love sweet potatoes. Over the hundreds of times I've eaten sweet potatoes and yams in my life (in every way, mashed, pan-roasted, fries, etc), this was the first time I didn't eat the whole serving. The best way to describe Kitava's sweet potatoes would be sour potatoes. They're already tangy if you're not adding sugar, so I see very little reason to put in so much lemon juice. Disappointing, sour, and gloppy. Try dicing them and boiling or pan-roasting with SMALL amount of lemon juice in the water to keep them intact, then lightly tossing with an herbed aioli and chives for a lower-carb spin on potato salad. Or slice up some wedges and roast those in oil, and serve with chipotle mayo. Or, just mash them and do as little to them as you can...sweet potatoes are great without any additions or seasoning. Let the taste come through without piling on stuff that sounds cool on the menu.\n\nAll ingredients together: There was no problem with the quality of the ingredients, just the preparation. But if you're a grocery store you can get by on just the quality of ingredients; as a restaurant the preparation is the majority of what you bring to the table. The bowl was served a couple degrees above room temperature. Not sure if that was intentional but it didn't help the textures and flavors at all. All-in cost for a bowl+tax and free water was about $20.", "author": "Garrett M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Tried the Cuban bowl. Pretty tasty. Would go back for lunch or for dinner to go. Good service and energy.", "author": "Natalia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "This is a great restaurant, they serve meet substitutes, aswell as free range meats,  very good diversity in their cuisine from general tzo chicken to Cuban bowls! Delicious", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "So good. Loved the Brussels sprouts, Cuban, tsao chicken. All of it was very tasty. As a person who is not worried about gf and all the other dietary boxes this place checks I loved it. Smelled amazing right when you walked in. It's amazing the space used to be a McDonalds.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "This place is outstanding. \n\nI am quite particular when it comes to going out. Often times, I'd rather eat at home vs eating out to avoid the way my body feels after food has been cooked in cheap oils or cross contaminated. Kitava in next level when it comes both to taste and integrity. \n\nYou can feel the love they put into their menu and food as your body is filled and feels amazing afterward. \n\nNot only is this food amazing, it's also at a price that doesn't break the bank. Not to mention the fact it was in an old Mc Donalds is fantastic! \n\nWhoever dreamed up this place had health in mind. Thank you for making your vision become a reality that many can enjoy!", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Love this place. The food is more in the 3.5-4 Star, BUT it's so damned healthy that it gets a 5. Reasonable prices, quick food, nice staff.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Went here with a friend who has a gluten intolerance over the weekend. We both ordered variations of the Cuban Bowl and were not only satisfied with the balanced portions of the meal, the tenderness of the pork was out of this world sort of melt in your mouth goodness.  \n\nAlso really digged the decor and plan on coming back now that I know it's so close to BART. This place is ideal for lunch dates if you're commuting!  I highly recommend!", "author": "Peter N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "Ordered the Roasted Broccoli with Lemons & the Brassica Salad with Salmon. It was okay. I ordered it through DoorDash so I understand the food wouldn't be super hot. The broccolis were a bit burnt and over cooked. The salad was fine, nothing real special. Overall, everything I tried was decent. I'd like to try out their different meals though.", "author": "Kristin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "It's amazing to find restaurants that cater to people with food restrictions. Their Brussels sprouts is amazing and also the Baja bowl. You end up feeling good about yourself and also your taste buds thank you.", "author": "Yamini S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "I'm so happy this place exists! I keep wanting to pinch myself because it seems too good to be true: a beautiful, serene oasis, conveniently located across from the 16th and Mission BART station, with friendly & fast service, wifi -- and most importantly, food that somehow manages to be indulgently delicious while still being healthy.\n\nSo far I've loved every dish I've tried:\n1. Zoodles & meatballs: Perfectly done zoodles, still slightly crunchy but tender enough to twirl around your fork like pasta, covered in a fresh tomato sauce, and four huge meatballs. I was especially impressed with the meatballs, they were so moist and full of flavor.\n2. Fried plantains: Fried in just enough oil to make them soft and caramelized, but not at all greasy (which is my typical complaint about plantains). They come with a slightly spicy mayo dipping sauce that's the perfect complement to the plantains' sweetness.\n3. Cauliflower rice: Excellent, rice-sized \"grains\" that somehow don't taste like cauliflower at all. A fluffy and healthy side dish that pairs well with a bunch of different things (I tried it with meatballs + tomato sauce, and also with the plantains + mayo).\n\nThe portions are all really generous, btw. I can tell I'll be a regular here for a long time, especially since it's a spot I can bring my vegan friends, paleo friends, and foodie friends alike.", "author": "Anne P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-18", "description": "Ordered from Mealmade / Kitava several times and didn't have an issue. Food tastes pretty good for being paleo-friendly. However, most recent lunch order messed up three of the entrees by not adding additional items (i.e. extra chicken, meat sauce instead of veggie sauce, etc) that were paid for. \n\nDuring busy hours, be sure to check your orders to make sure you actually got what you ordered.", "author": "Daffy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "UPDATE: I went back again today, and this place deserves five stars.  The service was honest and the food was great.", "author": "Ashley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Looking for tasty filling food that doesn't leave you with lots of guilt - look no further. While healthy fast food is the concept, you wouldn't know it to look at it. Portions are large, tasty and filled with cool flavorful twists. Pro tip: their sauces are to die for! I wandered in one day and had my food 15 minutes later -- and it was still warm by the time I came home. If anything, my one critique is that there's no tasting menu as so much looks exciting.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "The food is delicious! The prices are good. And the staff is chill. I'm on the autoimmune protocol diet (AIP) so it's amazing to be able to eat everything on the menu. It's also great when eating with mixed diets like vegetarians/vegans and meat lovers.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Omg this place was AMAZING. As soon as I walked in, I was greeted by the kindest hostess. She recommended some dishes and I decided on the spaghetti squash bolognese. It was a quick, healthy, delicious dinner. I can't wait to return and try all everything else on the menu.", "author": "Sinead T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "If you don't regularly eat as clean as the food served here, it's not going to taste the same. It takes time to adjust and detox from the overly processed \"food\" of the typical standard American diet. \n\nOkay, that said- this place rocks! Having a place that is gluten, dairy, soy, peanut and refined sugar/oil free means I will be safe and not feel sick after-food taste aside. That's already awesome. \n\nThe general tso's chicken was delicious. Loved the sauce and the chicken was fried perfectly. The spaghetti squash bolognese was warm and comforting. \n\nI was impressed by the range of options they have- being able to accommodate vegans and paleo folks alike is not an easy thing. Bigger portions than I expected (the bowls are bigger than they look in the pictures!)\n\nWill definitely come back. Wish they had a location in Marin!", "author": "Alana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "I was so excited to find this place and they did not disappoint! This is exactly what SF needed! I have a very strict diet and it felt awesome to be able to actually have choices and go out to eat. The flavors were rich and yummy. I will definitely be back and will bring friends!", "author": "Jessa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "I really enjoyed the food I had at Kitava. I tried the butternut squash hummus, crispy brussel sprouts and the vanilla bean gelato. The hummus was flavorful and lightly sweet. The brussel sprouts were crispy and delicious, served with aoli that was the perfect compliment. The gelato was tasty and apparently vegan. All around good experience, I look forward to coming back!", "author": "Cindy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Kitava!! This is my go-to spot for healthy, clean food. Their focus on traditional cultures and sustainability is a huge plus too. Recommend to all who are looking to start off this new year right.", "author": "Tręvõr L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Just had the general tso chicken and it was the bomb! Highly recommend trying kitava - decent price too!", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "If I could give them more stars I would! The food options were amazing. I'm allergic to gluten/dairy/soy/eggs and I could easily review my many, many options (yay AIP menu!). General Tso's Chicken was fabulous. Service was equally amazing - everyone was super friendly.", "author": "Joslyn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-27", "description": "I think I need to give this another shot, as I realize they just opened. I love  the concept and the story, however the food was VERY salty. I tried the Baja Bowl, and I would recommend a lot less salt. The flavors and seasonings of the Chicken are rich enough, no need to add salt to everything else. If you are serving fresh beautiful, good quality food, less is more when it comes to salt.", "author": "K D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Excellent, healthy and delicious options in the Mission. Squash spaghetti with meatballs was perfect.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Kitava is a great addition to the mission. Great healthy options with a convenient location. \n\nI got the broccoli, sweet potato, and salmon bowl. It was good portions. We also got the side of Brussels sprouts which were awesome.", "author": "Jason E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "OMG, I think I just found my new favorite restaurant! This place is AMAZING.  The food is consistently good.  Tonight I had the cuban bowl with plantains and butternut squash hummus--so DELICIOUS! I'm already planning on making a return trip sometime this weekend for the street tacos.  The food is fresh, doesn't have all kinds of sh*t in it and the flavors are AMAZING.  I'm vegan and find several options each time I get take-out from this place.  Check it out you'll be glad you did!", "author": "James E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "This place has great food including salads.  A healthier option.", "author": "a f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Finally a great restaurant for Paleo / Keto people. Really good food, great ambience, and the delivery is okay too. Price is fine.", "author": "Brayden M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "This is my favorite, guilt free place to eat in San Francisco. The menu is crafted with human health, sustainable environmentalism, and affordability all top of mind. I go as often as I can!", "author": "J.B. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Upon entering the restaurant we were greeted by friendly staff who were educated on our dietary concerns. The smell of delicious food in the air, and a bounty of options I knew I was in the right place. I ordered the Cuban bowl (made by Ben!) which tasted as good as it looks.  fresh ingredients that are organic, AND pasture raised pulled pork! I was in heaven. I left feeling satisfied and energized. Will definitely be back for the general tso chicken :) and more", "author": "Zelda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "If I had to describe my meal at Kitava, it would sound something like this: extremely flavorful and downright delicious. \n\nI got the Baja Bowl with Cauliflower Rice and Sunflower Risotto. I had never had Sunflower Risotto so didn't know what to expect. Like I said, it was delicious. The bowl was filled with hearty goodness. I also got the Butternut Squash Hummus with plantain chips. Another dish that was unique, and extra tasty!  \n\nThe guys at Kitava are working hard to make sure their food is healthy, fresh, and follows guidelines of some complex diets, all without compromising taste. What more could you want? I already can't wait to go back!", "author": "Andi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "This place has great tasting fast casual. And it is healthy! Plenty of options for vegan, vegetarian, and Paleo.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "Cute place. The food was good as was the service. I felt that the food could be a little more flavorful, but it wasn't bad. I wasn't super impressed with the ice cream sandwich. Overall it is a nice place and I love that the food is all fresh and local.", "author": "Aya O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Yum yum yum yum yum. 5yum review. Who knew paleo was so delicious. The transition of McDonalds to this wasn't lost on me. Out with the old, in with the yum and a better way of consumption. The menu was frustrating...because we couldn't decide what to order because everything tasted so good. It's both a restaurant and community for people who love good food and each other. See you here!", "author": "Brad W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Love what Jeff and the rest of the team are doing at Kitava. Pastured meat, expertly-prepared veggies, inventive combos. Apparently the team has used the data collected during the meal-delivery era to craft a menu of favorite dishes. I'll be headed there tonight, can't wait to get another helping of the Brussels sprouts!", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I wanted healthy food that's also awesome and that's 100% what I got. Kitava is awesome! General Tso's Chicken, avocado salad and my friends shared roasted Brussels sprouts. Totally coming back... probably after yoga at Yoga To The People.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "The spaghetti squash Bolognese is so yummy. Nothing like healthier comfort food on a rainy day!", "author": "Mi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "I've only ordered takeout from here so I can't speak to the dine-in experience. The first few times I was pretty happy-- it's a little on the pricier side but the food is healthy and pretty creative. \n\nSadly all good things come to an end. The one star is because it's currently 1am, and I'm up sick with food poisoning from the dinner I ordered (the coconut masala bowl).", "author": "S K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Soooooo good!!\n\nI loved the General Taos Chicken, and the pork bowl (especially with that habanero salsa). For side dishes, the Yuca chips were really crispy and good and the pesto meatballs were perfectly cooked and had tons of tasty pesto.\n\nOf course this place checks all the boxes for healthy eating (especially no seed oils!!), but it just tastes damn good and is normally priced. Why did it take SF so long to get a place like this?", "author": "Josh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Had the Cuba bowl with cauliflower rice and pork shoulder. It was really good. Very filling as well", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I have Hashimoto's and I am on the AutoImmune protocol (gluten, dairy, soy, corn, dairy free). I can't eat in a lot of places in the city. Kitava's not only had an amazing menu that I can eat a lot from but their meatballs, salad, and yuca chips was the best meal I've had in a long time. So happy to have discovered this restaurant, it will now become part of my weekly menu :)", "author": "Ilya V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Kitava is the only delivery service (and soon to be restaurant as well) that I use/will go to without any questions asked. Their food is delicious. The cuisine seems to have an international hint across the world. \n\nMy only complaint is they aren't everywhere at any time ! :)", "author": "Erich L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-11", "description": "Kitava has excellent food but I can't help but notice that it's out of place in the core cultural distinct latino culture of the mission and more in line with attracting more predominantly hip health consciouse people with high paying jobs.  I don't really want to bring gentrification here, but it is what it is.  If this place did not have excellent food I'd give this place a total thumbs down. I pass by this place a lot - and it's so out of place - I have not since one seen a latino family dine here.  I ate here and paid 5 bucks for clear organic broth. I appreciate the health conscious food menu, I do.  I do not appreciate how hip businesses  attracts the wrong kind of crowd which inevitably can potentially destroy a neighborhood without them consciously knowing it unless they do something about it and build relationships with their neighbors.  This is all over the mission.", "author": "Shu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-10", "description": "I've eaten there three times now.... on average a 'bowl' costs $15..... even more if you replace normal rice with cauliflower rice or something of that sort. If the food was out of this world then I wouldn't complain about the price because the Mission needs some health food options that doesn't involve green juice! But in all honesty, as healthy-ish as the food is here, it's bland. They give you some sauces for your meals but if you add those then you mind as well have just gone to a local hole in the wall place and paid $8 for something super tasty, salty, and loaded with sugar.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Amending an earlier review- Always had positive things to say about the food here, but I left a  comment about a staff member being rude. I promptly received an apology which was appreciated. Thanks for being receptive to my feedback Kitava :)", "author": "Chris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Amazing meatloaf and great vibe. Used to be a McDonalds.. what an upgrade for 16th/Mission. I hear the General Tsao chicken is 10/10, I'll be back to try that soon.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This place had amazing food, ambiance, and service. The flavors and menu items they have are awesome. They're menu is completely gluten free which is so nice. Having celiacs can make eating out a real hassle. It was great to not have to think about the food or how to special order something. They also have vegan options.", "author": "Kelsee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Great gluten free, clean & tasty food.  I got the General chicken and the Cuban bowl. Both super you,  I have celiac disease and feel fine after eating here.", "author": "Banana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Excellent food, nice casual atmosphere.  The crispy b-sprouts were delicious!  Highly recommend the Cuban bowl.  Topped it off with gelato made from cashew milk.  All.very yummy.  Highly recommend", "author": "Susan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Healthy and tasty goodness at a reasonable price! It amazes me how few places like this are in SF. Brussels sprouts are to die for, meatloaf better than your mom's, and the sweet potatoes were excellent. I was starving and left with a smile. What a welcome addition to the Mission!", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "The food is delicious. Apparently it is super healthy, but I really loved the meat and vegetables. Their guac is superb and the Cuban bowl perfectly balanced. And the brussel sprouts are perfect.", "author": "Rob R."}
