{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "I can't believe this was my first visit! Super fun little dive with fantastic bands. We made the trek from the north bay to check out Jonny Manak and The Depressives, Genuine Parts, and more. Frontside Five was so amazing we went to Oakland the next night to see them again.\nThis place is small, but the sound is good. Drinks are solid, and a decent selection of beers on tap. \nWe found parking just a short walk away, too.", "author": "Dee C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-02", "description": "I was at Knockout at about 5:30pm on a Sunday. I ordered a Vodka Martini, extra dirty, and after drinking the extra portion the bartender gave me, asked for a few extra olives (he gave me a small extra portion that didn't fit in the glass when I first ordered, which is cool - why I'm giving this two stars instead of one). \n\nIf this bartender had simply stated to me, \"Yes, you can have more olives, but I will have to charge you for it\" there would be no problem here. However, he was so uptight and rude with his response that I didn't even feel comfortable asking to pay for more olives in my drink - and nor did I want to with the attitude he'd just given me.\n\nThe attitude he gave my upon asking for extra olives was truly atrocious, though. Sure, I had three olives in my beverage upon ordering, which is great. But when I asked him for some extra olives, he replied with a pretentious \"No.\"\n\nAt the very least, he could have said that it would cost me extra for some more olives (and if he had asked I would have gladly paid). But he opted to say, without explanation \"No...\" and I was absolutely shocked by his disrespectful attitude.\n\nI don't ask for much, and when I do it is with a courteous and kind demeanor. This bartender chose to opt for the opposite type of attitude.\n\nLike I said before, I would have paid for more olives in my drink, but he didn't even mention it as an option - just gave me a solid no.", "author": "Conor T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Came all the way here to enjoy their 90s Simpsons Trivia & Watch Party. Every 4th Sunday of the month from 6-9pm. Pleasantly surprised to see so many people show up for the event. Bar was pretty packed, almost no place to walk. \n\nDive bar all the way, but it has its charm I guess. Love the decor on the walls.\n\nConsidering why we were there, SO and I HAD to try their Duff beer. Not bad, not bad at all. We then tried their version of a Tequila Sunrise (forgot what it's called sorry). It wasn't too strong, which is my preference. I liked that they let you bring outside food in for the event. Didn't care for the cigarette smoke that kept suffocating us all from those standing right next to the door smoking. \n\nVery limited seating area. I think they set up an extra table, but just for the event. Big giant movie screen to watch the episodes on. Only interested in coming back here for the trivia nights.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "This dive bar is not one I would travel very far to go to. I was in Potrero Hill when my friend invited me to Simpson's trivia night, so since it wasn't far, I decided to meet him there. It's a small dive bar with typical alcoholic beverages...no frills...Simpson's trivia was fun to attend and catch some Simpson's episodes, but only fun because I had company that I knew. Otherwise, if I didn't have company, it would have sucked.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "I actually like this place. Drink specials are good and fair prices. Love coming here when its a bit more empty and there is space for me and some friends to just sit down and talk to eachother comfortably. Lots of cool bands and event nights too.\n\n2 star rating because it seems like a lot of other reviewers run into this issue: there is a particular bartender here that is just the most annoying POS ever. It really seems like he goes out of his way to piss off customers. I and a lot of my friends have had experiences where we order drinks only to be met by a constant barrage of berating from this guy. Lol like my guy, just give me my beer i dont care how much your life sucks id be more than happy to just give you my money then leave you alone. Don't get me wrong, the other bartenders that work the knockout are really great but everytime i come here and see this guy i just know im gonna have to listen to this crybaby yell at me before i can get my drink. \n\nCrowd can be a sausagefest but i don't go here to get laid, i go here to be sad so this doesn't bother me that much. Been here on busy nights and tbh i didnt care for it so much but when the knockout is a bit slower and that whiny bartender isnt working, boy is this a nice place to just sit down and be mopey.", "author": "Franky F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "F**k this place the Bartender with glasses is such a douche !! And the guy thay handles the karakoke doesn't believe in first request for singing.", "author": "Carolina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "This bar is very inviting our bar tender was awesome! I will be coming here again. It's different, but a fun different vibe. I love they have pin ball machines takes me way back. The drinks were on point and cheap I have nothing but good things to say about this place.", "author": "Ana E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-22", "description": "It's a shitty dive bar. I love shitty dive bars. Beers were a little pricey for a shitty dive bar - what are you gunna do? You can get mediocre tacos next door and bring them over to eat your mediocre tacos at the shitty dive bar.  I would reccomend that.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-17", "description": "Old school charm, not really into the screamo music scene... Just a heads up \n\nBut it seems like they're good friends, and place for that local vibe", "author": "Molly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-26", "description": "Ok, I understand it was Sunday, but geeze this place was dead and a total sausagefest. I guess I'm the only female that likes funk? \n\nBartender was nice and drinks were cheap, but c'mon let's get it together next time.", "author": "Kemi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "One of my favorite dive bars to go to, especially for Booty bassment nights (3rd Wednesdays each month)!! Great drinks & good music. Parking is tough in that area, but there is a parking lot in the Bank of America lot for $12.", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-07", "description": "Worst service ever had!!! Stood at the bar for 20 mins waiting on a drink said excuse me to the bartender he gave me a crappy look and I Said may I get a drink and he said not that way and I said well I have watched you serve 10 other people as I have sat here and he said I don't care fucking yelp it!!!! So here you go!!!! Worse service ever!!!!!", "author": "Megan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "This is one of my bernal heights faves.  I\"ve had some great photobooth moments here.    I've had some drunken walks from other bars here. had some heartfelt moments here, I've seen bands play here that were excellent. \nMy friends band MC Meat hook and the vital organs played here and rocked.\nThey have a great happy hour here.\ncan't really know what kinda ratio its gonna be like here this place gets pretty random.\nThe crowd is always great here, I love it.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "One of the great dive bars in SF!  They have everything as far as music goes from punk shows to disco dj nights.  There's always cool 70's and 80's movies playing thanks to the VHS player on the big screens.  Wanna get a picture of your visit?  Hop in the photo booth!  The typical drink special is a cheap beer (Bud, Hamms, PBR) and a shot of well whiskey for $5 or $6 and there's restaurants on every side to help ya fill up!  Decor is dark wood with some funky benches and couches, there's also two booths.\nI've been there a bunch, and I'll be there a lot more!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-17", "description": "Often come here for various events, usually Karaoke with Omar, who is a great host and has a great book. Recently attended while he had a substitute who was awful. Cut his friends in before others, announced singers and then disappeared them. Just generally kind of terrible.", "author": "Darien W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "Such a fitting name for such a kick-ass bar! \n\nNot only do they have scheduled live music nights, they host bingo tournaments on Thursdays. It's a bit of a way out in Bernal Heights but if you're willing to make the trek, you're bound to have a good time.\n\nIt's also right next to Dell'uva! (See review here: http://www.yelp.com/biz/delluva-san-francisco#hrid:i0fBrxZRjMfxc4ukx9Xa8g)", "author": "Kat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "And I might not be around that much\ndoesn't mean i didn't try.\nI can say \nhi and bye.\nIts all the same,\nsome other time. And\nI think...\nI got a few lines left.\n\nA few lines left.\nTo try and say \nthat you were a sparkle to my eyes.\nI say your name in my head\nduring the drinking times\nand hear your voice\nat the end of those dark nights\n\nSo i got a few lines left to say.\nThat I live my life \nSolitary and confined most nights. \nDrinking away thoughts \nand wondering why\nDesolate\nYet still trying to hold onto pride\nYou were a sparkle to my eyes. And will always hold a piece of me despite my tries. \nYou are \na sparkle to my eye.", "author": "Rossi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Rock and Roll is not dead in San Francisco! Came here for a local music show and head a great time. Cheap drinks, cool ambiance, live music (yay!), and a great crowd. I will be back often! Wednesday nights live rock and roll is the best night to come if you like live music.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "This place was alright. Like a lot of the reviews said: it's mostly hipsters that frequent this bar. The drinks were cheap, but the music wasn't my cup of tea (Japanese hardcore music; different strokes for different folks).", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "The Knockout is a pretty fun bar. It's very close to my stomping grounds, old and new... Who am I kidding? The city is my playground. \n\nLove the Bingo Night on Thursdays, one bingo card per drink. People call out numbers and adding a little extra with the Ohhhhh 69, winning for the kitschy prizes. I was trying for a Monster Jam posters/book covers for my 3 year old nephew. \n\nI love love the Knockout and will be back to play some more Bingo soon.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "I had a great time at Knockout. We went for a soul night, and there was much dancing to be had. Not sure if it was the music or the general nature of the crowd, but people were super into it, and there weren't annoying lady bros/bros getting it on on the dance floor. For this reason, I am a big fan.\n\nI got my dance on, and didn't drink, so I can't speak to the quality. But I had a blast, and I would definitely go back.\n\nThe good: great place to put on your dancing shoes without fear of some rando grinding on you.\nThe bad: kind of far away, but eh.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-08", "description": "Went for the \"Oldies\"soul night promoted as being soul music from the 60s-70s. Looked up the DJ, Primo, and apparently in some circles he's respected for his oldies soul dj skills. What these circles are? I have no idea. Whatever circles they may be they don't no jack about soul music. Here's why:\n\n\n1) No James Brown - he's the king of soul for a reason DJ Primo. \n2) No Otis Redding\n3) No Sam Cooke\n4) No Marvin Gay\n5) No Temptations\n6) No Aretha Franklin\n7) No Al Green\n8) No Jr. Walker and the Allstars\n8) Not even a Jackson 5 song\n\nOk I can go on here but what's the purpose? \n\nSynoposis of Knockout Oldies Night with DJ Primo: Bunch of Square white people who can't dance and don't know soul music for jack who feel like they are hip for dancing to black music in the mission district. \n\nDisclaimer: This review is from a 32 year old middle class white man.\n\nMy search for decent music in SF continues.", "author": "ben T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "My girlfriends and I were stumbling down Mission after a night of heavy drinking. I'm not as much of a boozehound anymore, but I had been really putting away the cervezas. I even decided to stay and crash at my friend Michelle's rather than take the last BART home. \n\nOn our way back to her digs, we were discussing whether or not we should grab a late night bite at a taqueria, but instead opted to have one last nightcap at Knockout. \n\nThe staff were all kindly folks, even though we busted in the doors at 1:30am. \n\nBathroom was a little grimy, but that's pretty standard at SF dive bars. The dance floor looked crowded, but it wasn't a complete zoo. Then again, it was almost 2, so perhaps they had gone home with a special someone. One guy had his shirt off, which was mildly amusing to me.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Cheap drinks. Live music. On the smaller side but thats a positive for this bar. Recommend this spot to just kick back with a beer and dodge some yuppies.", "author": "Daher H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "gorgeous staff, the beer i need and the music i want.\nwhere do i sign?", "author": "Gary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "I came in here due to my mobile Yelp! app telling me there was Happy Hour and it got good reviews.\n\nWe came early before our Dinner reservations (across the street) - the drinks were very strong and good, the bartender was super nice.\n\nThe bar is a bit of a dive - It seems like it used to be a pub or it was designed similar to a lot of pubs I have been to.\n\nOverall great and I would go back.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "It was very difficult to find a good bar in San Fran on our last night there. Most of the ones we drove by were closed (it was Christmas) or they only served beer. In fact, I think we had to Yelp bars and Knockout was on the list of the ones nearby!\n\nOutside, it looked a little sketchy. Dark. I was honestly scared someone was going to stab me if I walked in, but you can't judge a book by it's cover.\n\nAt first, it looked really crowded. A bit loud from all the chatter, but what bar isn't, right? There was a guy going around just taking pictures of everyone even though some didn't want their pictures taken. Luckily, he left us alone and left soon after we got in so it was a smooth ride from there.\n\nThe bartender was good and he reminded some of us a little of our business law professor back home. Almost same face and pony tail. Anyway, he was really efficient about walking the counter and taking our drink orders in a timely manner. When we ran out of ideas what to drink, we asked and he suggested \"Hot Apple Pie\" which was actually a pretty good one (no shame in ordering a sweet drink). We ordered another round and he comped our drinks PLUS he found the time to take a shot with us. Very laid back. We appreciated the fact that he'd take some time to chill with the SF bar hopping noobies. We figured since the service was so good, we could probably take a couple more drinks before we left so jager bombs all around. Left a nice tip and bailed out!\n\nI don't drink very often. Personally, I don't like the bar atmosphere but our experience here wasn't based on how the place looked, rather, how it operated. I was impressed and very satisfied with our time at Knockout. When we got home, I made a recommendation for a few friends to stop by there when they decide to go and they did! They had the same bartender and had a GREAT time.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "Met a hot guy at a bar and he convinced me to ditch that popsicle stand and accompany him to Knockout where it was Soul Night and lots of dancing. Now Im not one to turn down dancing that doesn't involve Pitbull or dubstep so I was SO there.\n\nI love dive bars and this one did not disappoint. The place was dark and the dancefloor was even darker. The tunes were bumpin and the night was makin its way into my top 5 nights ever. \n\nWent to the bathroom to change into a dress I bought earlier that day because I didn't want to keep carrying it around. All of the girls in line for the bathroom were so nice and helped me change and look extra pretty for this hottie I was with.\n\nEveryone here seemed happy and it was an amazing vibe! I didnt want the night to end. Great mood on the dancefloor.\nDefinitely a knockout.", "author": "Kathy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "Back in my high school and college days I was a total britpop girl. Spent way too much money on NME and Q magazines, spent my days and nights at Virgin Megastore in Chicago (RIP) buying imported Blur singles for the B sides, and going to clubs where DJs spun sweet tracks and I danced to Pulp's \"Common People\" until the wee hours of the night.\n\nDebaser at Knockout took me back to those days in a big way. Two DJs duking it out between Britpop and 90s alternative/college rock. It was magical. Not sure what the other DJ nights at this place are like but this particular evening was awesome. A surprisingly cool and non-obnoxious crowd, good stiff drinks, and a really solid tunes made this a great night. I didn't stay terribly long but the time I spent was fantastic. On my way out it started to fill up so I could see how the tight quarters could be somewhat stressful but everyone was dancing together and having a good time, so it wasn't that big a deal. \n\nIf I lived in SF I could definitely see myself spending a lot of time here.", "author": "Annette J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-27", "description": "To me it seems weird to have a female DJ playing rap songs about fucking bitches. Maybe it's supposed to be ironic? Since everyone in the bar is white, that seems offensive on a whole different level.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Best bar in town. Sean, DX, Christina and the rest of the gang are the greatest. Good music, stiff drinks, and sexy people. what else do you need? Oldies night with DJ Primo is highly recommended.", "author": "Gilbert M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-14", "description": "We really wanted to like this place, especially after all of the reviews, but honestly? We were disappointed. Maybe it's because we have different \"dive bar\" standards, or maybe everything just felt kind of forced, but overall not a good experience.", "author": "Daphne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "Oooo nice little dive bar with good acoustics. It would be 5 stars if they had a patio! But I know that's easier said than done. Came for the benefit concert fo the tamale lady. Damn, those are good tamales... \n\n10-15 minute walk from the 24th St. & Mission BART stop", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "Not only Coolest Dive bar but Coolest bar I have ever been in. It's hipsters night everynight, and I don't mean old people. Upside: its a place where the chances of having a bad time is unlikely. Comon how many bars have people crowd surfing? Bad side: have a big bladder to hold ur pee for a while. \nAll in all I love this place and all my peep that come here on the daily. If you have never been, Go! It's Unforgettable while sometimes regrettable. Peace.", "author": "Gina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "The Knockout is an exemplary dive bar - a bastion of the dirty, raucous, no-frills, subcultural nightlife that is fast disappearing from San Francisco.  In my opinion, it is among the finest drinking establishments in town.  The Knockout offers cheap drinks ($5 whiskey and beer special, $2 Hamm's), awesome dance parties, and punk rock shows.  Good 'til the last round!", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "Good dance party bars are hard to come by in the city...usually they are TINY, sweaty, and full of weirdos.\nThe Knockout kills it (for me)! I love Sweaterfunk Sundays...old school jams and the whole place is grooving. They have cheap-o shot/beer deals and a photobooth!! What's not to love?  *I won't lie, the place is divey, but somehow, it makes up for it with quirky charm.\nThe crowd is eclectic, but you can certainly find some gems amongst the packed dance floor.  Plus, Taqueria Cancun is a couple doors down once those drunk munchies hit.\n\nNext night on my hit-list:  Booty shaking contests on the 3rd Saturday of the month.  See you then, rowdies.", "author": "Bree P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "The KO is a pretty rad place to hang out. It doubles as a fun place to hang out when there's no djs/bands and a really packed, sweaty mess of people on club nights. Teenage Dance Craze and Oldies Night are both really good times. Plenty of people come here for Debaser too, but I have no interest in re-living the 90s unless specifically through britpop or shoegaze.\n\nBeer selection is good and I've heard the mixed drinks are made very strong.\n\nI use to think it was kinda lame how far out the KO out is, but then I discovered I can just take the 24 back direct to my house. May need to start heading out here more often...", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Came here on Saturday for Booty Bassment. ($5 cover) They actually played better music than some clubs / bars (in my opinion). Chill crowd. Cheap drinks.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-17", "description": "\"Ohhhhhhhhh SIXTY-NINE!!!!!\"\n\nNothing trumps the crowd energy on bingo Thursday like good ol' O 69. Gee, immatture a bit are we? Good, I like it that way.\n\nA few Thursdays a month Knockout steps up to the plate with some seriously fun Bingo. Legit too, I'm talking an old school electric scoreboard keeping track of numbers and reusable bingo cards. Reusable bingo cards that appear to be promotional items from a mortuary with the advertisement at the bottom.... but reusable bingo cards none the less. Win a round and a goofy prize from the table and a free drink are yours, booyah.\n\nThe vibe is nothing but love, everyone calling back numbers (*especially* O 69), and the announcer is friggen hilarious. Tipsy Justin mumbles \"Bbbbbeeee elevennnnn\", I needed it to win, and over the mic I get \"No, and even if I pull B11 I'm putting it back now. Way to go.\" Then when someone mocked the background music by shouting \"That shit sounds like Legend of Zelda\" our quick witted announcer fires back \"You're mom is a Legend of Zelda...\" So awesome.\n\nI learned new bingo lingo, like the term \"premature e-bingo-lation\" for those jumpy folks calling out false bingo. The bar tenders were all super friendly, cool points for their love of my old school Brewers hat. I dunno, I can't think of a more perfect Thursday night out. Work tomorrow so you don't want to really \"party\", but drinking some Tecate tallboys and battling witts with the funny announcer while kicking it in a fun crowd sounds great to me. \n\nO 69, how you do amuse us.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-17", "description": "Found out last minute GENE LOVES JEZEBEL was playing at Knockout & couldn't wait to go\n\nThis was Jay's GLJ (aka, the *real* British band w/ the original members) and not Michael's GLJ which is only Michael, here in the US, claiming he's the real deal.....long blown out story of sibling rivalry gone horribly wrong but if you're interested, it's all here... http://blogs.sfweekly.com/shookdown/2010/02/what_to_do_mondays_pick.php \n\nVibe of the place was interesting.....\n\nAbout 20-30 people total in the bar - everyone seemed to know each other (as with any good dive bar) and there was the overall sense of hanging out at a friend's BBQ / garage band party, like we did back in high school\n\nDark open room w/ a HUGE layer of dust covering the disco balls hanging from the ceilings, photo booth in the back which could be all kinds of fun; Tron was broadcasting on the tvs at the bar & also onto the wall - awesome!\n\nBartenders offer good & heavy pours b/c there was more than 1 person stumbling outta there after the show - props!\n\nAfter reading all the reviews about the Big Ass Margaritas, we knew that would be our drinky of the night - & boy did that thing pack a whollop!  Mine was super sweet; bf's was super salty......he was a trooper & finished his but I only got down about 1/2 of mine & was still feeling a bit silly\n\nGreat band appreciation, strong drinks & a unique vibe make this place A-OK for me & would definitely look forward to going back", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "First time here but I'm already feeling food vibes. John our bartender is rocking it right now, good drinks friendly staff. I also love the art on the walls, defiantly cool decor. \n\nCheers.", "author": "Louis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Pros:- good vibe, nice crowd, upbeat music, not too crowded.\nCons:- Kinda sorta far out (location wise).", "author": "DeesQue N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-15", "description": "The first time I came to KO was back in December for Debaser's Weezer Holiday Sweater Party. It was SO RAD. Great music, everyone was laughing and having fun and singing along. Great photographer, cheap drinks, and a staff that was friendly and quick on their feet (i.e. catching the girl that started to crowd-surf during a smashing pumpkins song). \n\nIt was magic. \n\nBut, I swear to god we were tricked. Every time we've been back it has felt like a different bar -- with our group of friends having a collective, confused, \"what is this place?!\" exclamation. \n\nFirst, the $5 cover. I know there was one for the Weezer Party, and I know that the DJs have to get paid, but the acoustics in there are painful and the music has never been that great. And to boot, a door girl with a crappy attitude. Listen, I used to work the door at a grungy bar. But really, I was only as miserable as I let myself be. Upbeat attitude = less chance of people being jerks to you. Interact and joke with the customers, don't look at them like you wish they'd jump off a cliff just because they're trying to make you laugh. \n\nSecond, the people. Really guys? There's a dance floor (well, after 12pm its more like a slip-and-slide). Stop drunkenly sloshing your giant Tecate all over my back when I'm trying to order a drink at the bar. I don't think you're cute. There are a lot of prowler-type guys at this place, and around 1, 1:30 you see a lot of last-ditch efforts from angry aggro guys that seem to hate everything about the world. No, my girlfriend and I won't go home with you. Yes we're queer, and we don't have a problem with straight boys (which is why we go to straight bars sometimes), but come on guys. Your chances of sleeping with a queer girl are at like .01%, a queer girl with a girlfriend is .001%, and by creepily lurking or hitting on us and assuming it would be OK your chances just landed at never ever ever ever ever. Never. Ever.\n\nThird, the bartenders. You guys were awesome that one time. Each time we've been back (about 4 subsequent times), you've either thrown our drinks down so hard on the counter that an inch of it flies out and soaks our glass/money/arms, or you throw our change back at us or into the aforementioned soak you've created by spilling our drinks. Yes its busy, but chill out. Being angry isn't going to make people want drinks any slower. In fact, being up at that bar was so stressful it made me just want to drink a lot of shots so you seemed like less of an asshole.\n\nI don't know why we left Doc's Clock to come here again last night. But, the night was salvaged when we went to El Rio for last call. I love that bar.\n\nProbably won't be back.", "author": "Colleen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "Bingo on Thursdays here is awesome. Motivation to imbibe as much beer as possible? An extra card for every drink purchased. The only downside is the woman who reads the bingo numbers tries to make every number reading as sexual as possible. Funny at first, but annoying after going a couple times and hearing \"6\" read as \"dicks\" every time. If she were hot it might be cooler. Awesome times here though. Music afterwards is sometimes a plus.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-28", "description": "I did not know hipsters before this. First off, although I am not looking to hook up, I definitely would like to see the ratio of a place be not 100% male. Either this place had all men when I went in or they had women but sadly they looked like men too. Leather jackets, bling on leather jackets, hair styles suitable for nobody, belts that are supposed to look like reflectors placed on the moon, smell of sweat mixed with dirt, bands that dont sing but scream (i am not lying, i was not able to figure out the language of the tracks played). I felt super unwelcome the second I stepped my feet through the door. I am still giving it 3 stars for the drinks that are only meant to get you high and the fact that everybody but me seemed to be having fun.", "author": "Ambu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "Last stop of the night on our Mission run!\n\nSome of us did get knockout...\n\nThis bar was crowded! When we got to the door, there were lots of drunkies chilling out by the door and getting fresh air.  We weren't aware that there was a cover charge, I believe it was $3 or $5 per person.  The bar itself was very narrow.  On the left side was a bar stretching from door to the end of the house.  At the very back, that's where the restrooms were located.  On the right side, there was loud music playing and many tipsy/drunkies dancing and bumpin to the music to what we called \"dance floor\".\n\nWe started off with tequila shots! Hand over the lime and salt please!  Great shot, what more can i say about Tequila? The bartender was nice enough to treat our birthday boy a 151 on the house. Now that was awesome!  We ordered a couple more coccktails and within an hour, I had to use the bathroom..\n\nNow letme just warn you ladies there was a HUGE line to the bathroom.  I assume there was 2 stalls.  Why did I say assume?  Cause i didnt actually use the ladies room.  Instead, I was lining up in the men's.  I swear men were so nice here, they let me cut the line and went first.  The only thing is, there was no door at the men's bathroom, so make sure you grab a close guy friend and watch the door for you.  Nevertheless, I gotta say, I have never went to a men's bathroom without door in a bar!\n\nThey also have a photobooth in this bar! So cool, BUT take note, its $15 to spend.  At the end of the night, letme just say...2 of my friends were knockout.\n\np.s. there is a mexican restaurant couple doors down! Perfect for \"sobering up\" food.", "author": "Stephy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "I love that the knockout has great events like bingo and soul nights, just wish the sound quality was a little better.", "author": "Jill C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-23", "description": "Very rude personnel in there. Don't go there unless you wanna get yeild at!", "author": "Amine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "I stopped in for Debaser which is a monthly event where they play awesome music! It's one of the better dive bars in my opinion. They have a good selection of drinks (at least from what I saw), the crowd seemed unpretentious and laid back. They also have a photobooth and a small dance floor. It's a little bit more tucked away than most bars on Mission Street but it's well worth seeking out. I'll definitely be back, hopefully with friends in tow next time.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-31", "description": "Worst bartender ever. Guy in the bauhaus T-Shirt tonight was beyond rude on 4-5 drink orders. The most horrible service. Do not go here.", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-18", "description": "Walked in on a Wednesday Afternoon, and the place was packed. We squished our asses into two stools at the bar, and ordered a Lemon Drop & Dry Martini with a twist. The drinks were stroooong. After 3 or 4 of those I would probably be in for a knock out. \n\nThe drinks were good, but the trendy hipsters got on my nerves. One particular inebriated hipster girl accused us of taking her seats and her sushi. We sat down in some empty seats, and about 5 minutes later, she shoots her head in between us and starts talking under her breath. I can hear things like, \"left to watch the band and our seats got taken, I can't find my sushi, somebody took it.\". If you want to start talking shit, woman up and talk shit straight to us. At one point, she took our dinner leftovers, and assumed that it was her sushi box. The expression on her face, when she opened up the box to find Arroz Con Pollo instead of sushi, was purely priceless.\n\nI'll probably end up going there again if I'm in the area, to try out their Dive Bar Sushi. Now that's two words you don't see together very often. An oxymoron similar to jumbo shrimp, living dead, or plastic glasses.\n\nA pun and an Oxymoron in one review. English Grammar Rules!!", "author": "Robin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "b-i-n-g-o!!!\n\nI've been meaning to drop by for bingo for years, but never made it till I moved back to socal and came up for a visit. Walking into the bar, I realized the true meaning of a Dive Bar, local awesome hole in the wall. Although the facility was a bit on the dingy side, the crowd was definitely friendly and easily familiar. Bingo was fun. 1 card per purchase of alcoholic beverage, which was amazing because by the end of the bingo night, you're buzzed and scrambling to check numbers on numerous cards. Now I must find a bar like Knockout relatively close to my house. Sigh. you can count this among my list of \"why LA can never live up to the Bay area\"", "author": "Charlene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Great small bar/ music venue.  The staff are very friendly and helpful, sound is good and it is laid out well with a dance floor, some booth space and a bar area seperate from the dance floor where you can still enjoy the music. Unpretentious spot to grab a drink, with things I like to drink like Guiness and  good cider on tap and a well crafted Dark & Stormy. I also recommend this place to play for up and coming musical acts.  Great food options nearby.", "author": "Greg K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-20", "description": "Came here for Bingo on a Thursday. The announcer was annoying but the beers were good. The space is kind of weirdly laid out. There is a glittery stage and a dancefloor which is cool but during Bingo the announcements were so loud that I couldn't hear my friend next to me. Really, does Bingo need to be that loud? The place wasn't packed or anything.\n\nAnyhow, I am not much of a bar person but we thought it might be fun. We were wrong so we went next door to the wine bar to have wine and Tiramisu.", "author": "Tala D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "It will Knock-You-Out!  Ok, bad joke.  We went for bingo last Thursday and wow was it fun.  They let us bring in like $30 of Burger King.  Sure it sounds like not a big deal but that stuff smells.   The crowd was definitely into the game and we didn't get booed as haters.  Actually the bar was filled with other bingo loving haters.  Someone won, boooo!!!!!  All in good fun.  When we finally won, we got to double hate.  Hate you for winning and hate you for booing our win, Bam!  Take that fellow bingo players.  My friend won a pirate kit.  It came with an Ali Baba sword, Michael Jordan earring, Captain Hook accessory and an eye patch.  \n\nI have no idea what the bar is like regularly but I want to try out Bootie Basement.  I hear it is amazing!!!  Oh, oh and they have Sweet Tea Vodka.  It is good stuff.  Seriously, try it.  My friend in NJ is obsessed with the stuff.  My sister actually has to drive back bottles of it from South Carolina for her friend.  It's that good!", "author": "Kristin Marie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "When I want to Mod it up, dress in my favorite vintage skirt, twist and shout and get my teenage dance fever out - this is my place. I adore the vibe and just the concept of Knockout. \n\nVenture south via Bart or the 14, or 47 deep to the outskirts of the mission, just as the hill starts to climb and you've passed the infamous El Rio, then Cancun to your left, there you'll see it, just as Valencia and Mission streets kiss. The doorway almost impreceptable, the sign hidden by a tree. But when you think you must have passed it, you'll see the hipsters outside smoking a cig, and you've arrived.\n\nGrab a whiskey or Tecate, it really doesn't matter, bring your drink to the floor and dance your brains out of your ears. Tip to the wise, arrive early as it ain't that big and the joint gets elbows to butt cheeks by midnight. \n\nComing from the OC where every club is a bump-and-grind contest, all playing top 40, all scantly clad over made bimbos and all that jazz, this is my escape, my breath of not so fresh air. It's a night out that's fun and still sexy without being slutty. Don't think, just take it in.\n\nOh, and don't leave without hitting up the super-sized photo strip booth in the front side. Super cute and high-quality pics.\n\nOnly downsides for me are the $4 cover and its distance from the rest of the citay.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-05", "description": "Ugh - really? 90s music night? Except it wasn't 90s music. It was more bad rock music that some dj thought was cool even though he wasn't around in the 90s. Pffff.", "author": "rhiannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "Hipster central , fer shozies, but ths did not effect my good time with peeps, celebrating the Giants clinching the NL Pennant. \n\nSaturday night was a Debaser night: 90's bay area hip-hop/rap spun with free cover if you are rocking SF Giants gear( $5 without). \n\nUpon entering I was completely confused as 10-12 large women dressed in Jane Fonda workout clothes dominated the scene. I am not ironic and did not understand the beep-beep-boop sounds and hipster mustache rounds. \n\nI asked the door guy who said they were gonna get it in Nickatina mode in just a few moments. \n\nSweet. \n\nPicked a couple 40 oz of St Ide's from the bartender, poured a lil out for Mac Dre/ RBL Posse's Hitman and hit the flo. \n\nBy 10:30pm it was completely packed and classics from Del, Souls of Mischief, Too Short, E-40 and all the rest of the notable greats had everyone dancing and occassionally getting \" thizzle\". \n\nBy the time \" I'm a player\" by Todd Shaw was blasting loudly - I decided I would hit this Debaser party every time. \n\nMyself, my friends, and my $4 22 oz Tecate highly recommend this hip-hop party.", "author": "Taj A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "At first, I wanted to give this place 3 stars, but then I realized they had pacman AND a photobooth, so automatic one extra star. Who doesn't like to drunkenly play Pacman? Maybe the dreadfully gorgeous Patrick M, whom I caught drinking scotch and reading Manga (where are my damn lessons so I can start reading Manga, dammit!). I think I just fell in love again (why yes, I HAVE been drinking since 8am, why do you ask?)\n\nMost of us headed here after Socha, and started drinking again. The woman at the front door told us to quiet down, even though, HELLO, we're in a BAR. You want quiet, go next door. Plus, if you, the bartenders, are having a conversation, and there is a customer waiting for you (aka ME) to shut the fuck up and pay attention to the order, then you should probably not finish your conversation first. \n\nHELLO.\n\nBut I WAS able to photograph the ever lens-elusive individual Jon A., by backing him into a corner of the photobooth and forcing him to sit, and stay. By that time we were so drunk I wasn't in any of the pictures, so they're wonderful headshots but he's probably plotting to kill me and take them out of my luggage--er I mean purse--as I'm writing this. \n\nBtw, I'm posting them up all over t3h internetz.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "I love this place. Every time I visit SF, I make a trip to the Knockout. Who doesn't love a good dive bar? Love Tracy! Always good music, some new concoction to drink, hooks for me to hang my purse, and Blue Plate is literally across the street if you get hungry! The photo booth is also a nice touch.  Never disappointed.\n\nWill be back again!", "author": "Clarissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "Five Stars - Guinness on tap!\nFive Stars - Hoegaarden on tap!\nFive Stars - 2 ounce pours shots of Jameson!\nFive Stars - Very fun underwear dance party on Valentine's day!\nMany Stars - Everyone coming up to me and saying my date and I were the hottest couple there with the best looking asses in the place .......  priceless !", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "I gotta give a shout out to the Knockout. I am surprised at how much I liked the place. Even though the crowd all looked the same, this group had an unconventional way of standing out from other hipsters in the city. They looked HAPPY. Smiling even! Maybe it was the dim lighting, but I think I saw some actual teeth. I felt a neighborhood-y vibe that reminded me of home and it was cool be amongst some friendly city folk for once. Knockout gives hipsters and SF a good name. \n\nMinus one star for it being so loud that the bartenders could barely understand my drink orders, it's not my fault your workplace hates your eardrums.", "author": "Kylie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "I never would have found this bar ... but a local Mission-ite took me here after dinner.  Drinks were cheap, cash only.\n\nWe spent the money we saved on drink playing Pac Man, Frogger and \nDonkey Kong - drunk or sober, I suck at it ... Don't believe me when I say it's the controllers that's broken. \n\nSpent the rest of my money making faces in the photo booth.  Pictures are awesome - full color, great quality.  $15 spent on the photo booth ... with a digital camera in my purse.", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "I like how the Knockout has a lot going on on the different nights of the week, it really makes this little bar come alive. \n\nI like how their concerts are usually $5 or cheaper and that they have drink specials. \n\nI like their adult root beer floats (which taste just like normal root beer floats) and their bartenders. \n\nI like this bar!", "author": "Murphy O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-02", "description": "The bartenders here are just mean people. The music on oldies night was fine and the clientele friendly, but these bartenders made me feel bad for being alive. Once we got the drinks, they tasted like pure rubbing alcohol. To make things worse, one bartender threw out my drink before it was finished and when I told him he said \"well, there wasn't any ice in it.\" Yeah dude, because it was hot inside the bar! I know that there are things more important than the bartenders at a bar, but I have never in my life been treated so horribly. \n\nIt seems like the people who work at this place think being mean is cool. News flash: it's not.", "author": "Jessie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "I've only been here on 1st and 2nd Fridays for Oldies night, hosted by Primo. I once stumbled into the Knockout on a Saturday night and it looked pretty dead inside. Unless there's an actual event or DJ scheduled for the evening, it doesn't look any more special than a typical SF bar in the Mission.\n\nMy nights at K.O have always been fun. They provide you with the essentials of Mission livin': strong cheap drinks, dance floor, plenty of willing and questionable make-out strangers, and a photobooth to capture your drunken memories.\n\nThe only downside to K.O is that it's really out there on the other side of town. If you get tired of the joint, you're left stranded in a sea of taquerias and the option of El Rio.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-21", "description": "It's like a frat party in bizarro world, and the bartenders suck.\n\nGreat for kids from the suburbs who are exploring the notion that dressing like a tramp gives you credibility.", "author": "jole b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "Things you need to know:\n\nBingo on Thursday nights.\n\nHammjobs (a can of Hamm's and a shot of well whiskey) are $5.50.  \n\nGodspeed, people.", "author": "Gene A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-01", "description": "teenage dance craze is too much fucking fun.  I love love love dancing all night long to the best music ever.  my only gripe is the bar needs to get some wine glasses, a chimay glass will suffice but come on.  i've seen many bands at this space but my favorite evenings are with my love dancing to records.  is anything better in life?  \n\n\"the people who do not dance are the dead\"", "author": "Noel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "4/5 drunk bingo!\n\nonly goes til 9:30ish, thankfully before it gets too hipster. i won my 3rd game ever. relatively cheap drinks, all around fun time.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "Great dive bar with a photo booth. Can't say enough about the bingo and DJ nights. Also, lots of cool indie shows and can't-miss one-offs like the Cassette Swap nights.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "This place is cool because cover is just $5, there are crazy videos playing on the TVs, and they spin popular 90s hip hop.   What I don't like is how stuffy it gets when the crowds start pouring in.  This place isn't that big.  \n\nOverall, it's a fun place to be with your friends and get lots of cheap drinks and dance, dance, dance.", "author": "Sally Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-18", "description": "I was there for 20 minutes. Never again. I dont think they care for Hispanics here. I got that vibe. I was here in January 2014", "author": "M F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "Oh! This is where the hipsters went! I was wondering.\n\nDecent prices, decent space (not overly hot, but just enough hot to be sexy sweaty) and a rather unpretentious crowd.\n\n90s night is where I run into hip former coworkers and reminisce  about 90s music. It is bittersweet because some of it just makes you feel old, but other songs just make you dance and laugh. Like really, that Harvey Danger Song?!\n\nWarning: the bathroom line is incredibly long (one stall) for all the ladies. So avoid breaking the seal until the after party.\n\n\nParanoia Paranoia everybody's coming to get me!!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-10", "description": "Woop Woop!!!!!  It only took me one time and Im a fan!\nMy NEW favorite Friday night hangout when its oldies night.  Primo has got it going on.  It's packed, great music TONS of drink choices, photo booth, dancing and even though its packed I've never had to wait very long for someone to take my drink order.  Great bar staff, that keeps up with the pace of the bar.  Nothing more annoying then a messy bar, you wont find that here.  And theres a huge luchador drinking a beer on their sign out front what more can you ask for!!!!!", "author": "Mother L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-19", "description": "Drinks are strong and tasty, it's not impossible to get one, the decor is pretty sweet, and the DJs play some great stuff.  That said, THE PEOPLE.   It's like the photography crowd from high school decided that dancing in circles is even better if you're wearing thick frames with no lenses in them. Extra points if you refuse to talk to anyone outside of your group of friends. \nWe went to Booty Basement, and if you're going to drop beats like that, people are going to want to dance. We started dancing almost immediately, and over the course of 45 minutes the dance floor was so packed with sloppy hipsters spilling their tall cans that it just wasn't worth it. Next time? No thanks.", "author": "Dru V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "Bingo night. Thanksgiving night. Fun night. A great little hole in the wall, some splendid drinks, and they were up and playing bingo thanksgiving night. Quite the crowd as well, some folks really lit up the karaoke machine!\nDefinitely a good hang out place..", "author": "Gurpreet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-05", "description": "What hipsters envisioned when they first googled \"cool\" and took their collective cues from Molly Ringwald, Judd Nelson, and checkerboard sunglasses.\nThey seem to have an activity every night!\nSleazy, fu*king sleazy let me tell you.\nBut it's a dive bar, so WTF, right?\nKaraoke here rocks, stiff drinks and drunken debauchery.\nJust the way this checkerboard wearing skinny ass fool likes it.", "author": "Theo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-06", "description": "Since I am such a knockout, I had to check this bar out. Love the location - 29th & mission near some great restaurants and other good bars.  I arrived at 6pm - a prompt start to Friday happy hour and the place was EMPTY.  But the bartender was great and we chatted for a bit while I guzzled my Root Beer Float with Vodka and extra cherries.  So good.  Turns out there is Bingo on thursday nights and the Tamale Lady usually stops by on Wednesdays. Good to know.\n\nFriends arrived later and we caught up and chatted with background beats that were very nice.  The bar wasn't super crowded when we left at 9pm to get food, but looked like it was a hot spot for the locals. DJ was setting up for the night when we left - with an entourage of like 50 ppl.  Guess that is how he rolls.", "author": "Kamael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "You want to go to a raunchy, dirty, and extremely fun Mission Dive Bar?\nThis is the place.\n\nAlso this place hosts Vinyl disc swaps and obscure Indie bands, it can't get more Mission than this. \n\nOh and you will get dirty ;)", "author": "Gonzalo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-09", "description": "I LOVE this bar.  \n\nIf you see me there on Thursday, I'm probably gonna be yelling: B eleven B-B eleven!!\n\nI've been here at least once week for the past forever.  Jason the bartender is a total doll.  LOVE!  Good music, photo booth, old movies on the screens (think old godzilla \"dudes in suits\" movies.\n\nAgain, I just love this place.  They have a good night on some Saturdays called debaser where it's all 90's grungy goodness.  I get drunk and dance to Sonic Youth.  It's amazing.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "This is an established dive in bar, period. It at the end of Valencia St, on Mission and away from the Valencia bar strip yet it gets super busy after $10. Well, I was there on a Friday Night so...duh!\n\nSmall old place with a good sized dance floor. Tiny little DJ booth. The bartenders nice and bathroom is super clean. \n\nBest thing about the location? If you forget to eat before you drink or vice versa, go to the Taqueria or Thai restaurant next door, or Vietnamese across the street.", "author": "Elly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-05", "description": "Hard to write a definitive review of my experiences here because they've all been great. I go for Oldies Night or other dancing events. Great bar, with great music and I meet swell people here.\nI love the coat hooks on the dancefloor.", "author": "Velcro F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-23", "description": "Not much was happening at Knockout around 10 p.m. on Monday night, unless a lukewarm karaoke session counts. I acknowledge the sentimentality I felt from watching a middle-aged man perform Bush's \"Machinehead\" and a twentysomething woman belt out Robyn's \"Show Me Love.\" One flock of friends stapled themselves to the song list, so I couldn't check for Joan Osborne's \"One of Us\" even if I wanted to.\n\nFree pizza was available on a table in back. Free cheese didn't sway me; in search of something hopping, I left.", "author": "Bobbin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "Tecate tall boys complete with a fresh lime?? In the land where I'm from, the only canned beer that comes in 21 ounces is the less than extraordinary PBR. \n\nLast night's party at Knockout consisted of 50's doo wop, lumberjack looking twats, girls with high waisted jeans, and people getting down and familiar on the dance floor. Yeah, I'd go back.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-09", "description": "I went here once...they made me draw the chalkboard sign.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-15", "description": "it's not a bad place to drink, but it's not one of my favorite dives, and i'll tell you why:\nI live upstairs, and they STILL charge me a cover every time, despite my constant arguing, and despite the fact that it's usually for a DJ, and not even live music! i mean.... come on! don't charge your neighbors a cover!\nUsually all I want in a neighborhood bar is a drink or two in the middle of the week without a hassle, I don't wanna pay a cover... clearly this is not the place for that.\n\nUpdate afew years later... I never go here. It draws a shitty crowd that chain smokes on the sidewalk next door to my house. I've never cared for the crappy bands that play constantly and I'm definitely never paying a cover to get in. \n\nI forgot about this place years ago. You will too.", "author": "Jevir G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "A \"big ass\" margarita in a pint glass w/ Cazadores and a bunch of fresh limes + a bottle of Pacifico = $10.50!!!! This is hard to beat! (Note: a margarita w/ Cazadores and a slice of lime in a plastic cup about 1/2 the size + a can of Tecate at El Rio = $12.50)\n\nOftentimes, one doesn't necessarily realize he/she is getting fat, old, or are simply changing over time as such changes tend to come gradually. I didn't really realize that, over the course of the last several years, I'd thoroughly been (y)uppified and become accustomed to paying a double digit price for a drink in a small cocktail glass. Thanks to Knockout (along with a few other Mission bars), now I know that i can happily reach a sufficient (or excessive) intoxication level with a drink that actually tastes good for less than 1/2 the price while still being out and [anti]social. \n\nI don't know how hectic things can be at Knockout on weekends, but it was perfectly nice and mellow on Sunday night. A few hipsters and a cute bartender were having random conversations....it was cool by me.", "author": "Nana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-27", "description": "Cool crowd, PBR and a photobooth. \n\nThe Knockout meets my all requirements for a good time. Also, the neighborhood isn't that great, so that is always a plus when I am looking for a place to drink.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-13", "description": "2.5 stars!  I primarily go out to such venues to check out bands only - not sit on a bar-stool nursing a watered-down cocktail yucking it up with strangers. Thus, I will focus on what matters to me. The stage in this bar/club is TINY - a three member band can barely fit on it let alone get comfortable - and if there's a fourth member he or she will have to step out into the audience if they plan to move their bodies at all, (as most front-persons do). Drummers are stuck in the back of stage behind everything where audience cannot view the details of what they are doing with their feet etc as there is no side viewing. There is no side of the stage so if slamming is occurs be prepared to get hit regardless of your intent! Sound-system is just mediocre...", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-18", "description": "As in...\n\nThe final, fight-ending blow; where you always end up after going everywhere else in the Mission because: it's Primo's Oldies Night and you know that everyone will be dancing, the energy will be throw back and good times, and Cancun is just next door for much needed Mexican style sponge action after all your shot taking, twist doing, clothing removal encouraging, bar tender attention getting activity.\n\nOr, a really good looking woman; everyone looks better bathed in red light, shaking their ass, and if no one believes you there's a picture booth to preserve the truth.", "author": "Kathryn M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-01", "description": "The Knockout is the type of shambling bar you might find in a dystopian future after we're all living in catacombs or something.  You'd probably run into people like Bob Arctor, Spider Jerusalem, and Johnny Mnemonic, except, you know, you can still order a PBR because the REAL currency is gasoline.  I guess it didn't help that they were projecting The Matrix Revolutions when I was there last.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-10", "description": "I've been here twice.  Once to see this band called Astral, right after getting burrito-jacked at Tacqueria Cancun next door, and once to see Jeremy Jay.  \n\nWhen the bar isn't absolutely packed its actually a rather pleasant place to sit down, drink a few beers and listen to some obscure-ish indie rock type stuff.  Its got that dingy indie dive kind of thing going on.  They sell Hamm's beer by the can for $2.  \n\nWhen it is packed, however, its very difficult to move around inside, and you have to really get all up in peoples' personal space to order a drink.  The Jeremy Jay show was like that.  There were all these indie-rocker girls screaming \"Jeremy Jay!!!\", and trying to cram themselves in front of the stage.  The other girls would stare daggers at them as they slunk past one at a time in that little hand-holding daisy chain you see in crowded places.  \n\nFor the few minutes I actually lucked into a seat at the bar, people were leaning over my shoulder to order drinks.  I got to chat with this one girl for a while as direct result of that.  She was drinking Maker's Mark in a shot glass, and dripping Coca-Cola into it with a straw.  \"That's pretty slick\", I told her, and she smiled back at me for second before taking another sip.\n\nAfter that, I went over to the KUSF table and bought a t shirt.  Ty Segall, the opening act, let me take a few pictures of him as he leaned up against the wall near the bar.  We chatted for a few minutes about guitars and reverb and stuff.  \n\nOutside on the street, people gathered around me to bum some smokes as soon as I took the pack out of my pocket.  This one guy and his girlfriend told me a story about how there's some dread-locked guy down by some tacqueria on 6th & Market who put weed on everyone's table to celebrate April 20th last year.  Sounds intriguing.\n\nIt was an intriguing kind of night, I suppose.", "author": "Gopal R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "Accidentally wound up here on their once-a-month 90s night (TRL-style). Music was good, service was okay, beer was decent.", "author": "Roxy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "I've been going to the Knockout for years.  It's a great bar that's low key but can get crowded on the weekends.  It's a nice spot for stiff drinks and good times.  They used to have a film photobooth I think but now it's a digital one unfortunately (I'm old school that way).", "author": "Gene X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-29", "description": "i don't really understand what the appeal is.\n\nfull of pretentious hipsters, super crowded, kinda dirty. and they don't even know how to dance.\n\nstrong drinks, though. about a dollar more than they should be at a dive. and i like the photo booth.\n\nugh, why do people go to dives at all?", "author": "Julie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-26", "description": "eehh it looked cooler than it actually was, shitty music and lots of hipsters everyone looks like they're in a uniform and not very social.", "author": "Giovanie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "I love this place, but I do have to revoke the title of \"dive bar.\"\n\nDive bars shouldn't have lines or covers at the door. That being said...\n\nThis place is a blast - from the great djs to the crowded dance floor to the random people that ALWAYS pop their heads into one of my shots in the photobooth. \n\nThe only other downside is that they don't take cards at the bar. I REALLY do hate that.", "author": "Chia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-02", "description": "If you don't know what a hipster is, come here. You'll have to pay a $5 cover, but it's a real-life hipster zoo. My friend described it as having hot 24 year olds. This is generally true. I came here for \"90's night\". It was really trippy to watch these 24 year olds try to interpret my era and bounce around to punk rock from the 90's that I'd never heard before. Everybody was having a good time. I couldn't get past the fact that I was the oldest guy there. Well, there were like 30-something hipsters sprinkled about, but they had tats, nerdy glasses, and handlebar mustaches, so they fit the scene better than I did. Ultimately, I felt uncomfortable, but that's not Knockout's fault. They show a lot of people a good time. And, it was fun to be a fly on the wall there.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-04", "description": "I just love me some Oldies Night.  It's twice a month with Teenage Dance Craze to fill in once a month.  So the great music and the dedicated crowd are awesome.  Oh, and the cheap cover doesn't hurt.\n\nThings that leave a little to be desired: dance floor is way too tiny for said dedicated crowd.  Mixed drinks are too strong (yes), with margaritas bordering on undrinkable - if I wanted straight tequila, I would've ordered some.  No cards [cash only] is kind of annoying.\n\nAt the end of the day, though, I would consider it very nearly my favorite bar in the city.\n\nIt'd probably help if it wasn't so fuck-all far into the Mission that 1. it's really hard to get back from and 2. no one wants to meet me there.", "author": "Marianne F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "I like you knockout.\n\nI often like your shows knockout.\n\nMostly I like your bartenders except from when they can't take a joke and have to be assholes about it, but mostly they are not.\n\nI love the bingo nights, really love them, even if I don't go as often as I should.\n\nSometimes I wish you were closer to me.\n\nBut I do like you.", "author": "cecilia k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-13", "description": "The Knockout simply rules. Good local music for cheap cover on most nights, Thursday night bingo is a blast!  You get a bingo card for every drink you buy and a chance to win ANOTHER drink along with a titilating prize of your choice.  Some past acquistions have included: tiger balm, noisemakers, and a  rooster snow globe to name a few.  Who doesn't need one of those?\n\nCome early on Thursday night to ensure a seat (before 8pm). You can grab a burrito at Cancun or the Tamale Lady makes ceremonious stops as well.\n\nIts near my hood, low-key and an all-around good time. Two enthusiastic thumbs-up.", "author": "Faith S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-29", "description": "A group of friends were going to the 90's party.\nWith a line out the door even with a $5 cover...\nIt was packed!\nMission atmosphere here.\nThe 90's mix could have been chosen better and the crowd had a real problem with no falling over into our crowd.\nThis is a dive bar and it's fun with friends.\nThey have a stage so I assume they  have live music at times.\nIt's a bar that I'd come back to for something different.", "author": "Po L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-16", "description": "I went on a Saturday night and there was some crazy pantera sounding metal band there. Although I am not into that kind of noise I can appreciate a good band especially when it's live.\nThe crowd was kinda douchey... bunch a freaks in all black trying to look bored.\nI would go back...\nOh wait there was a cover charge but we got a deep discount because we were tardy for the party.", "author": "Edi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-22", "description": "Hot heavy packed and hip to scene as possible and has every right to claim cred from all the patrons that frequent this sensational find. You will end up dancing no matter what, apparently I came on Oldies Night which was infuckingcredible.", "author": "Champ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "I've been here 3 times.  The first time was a revelation.  I hadn't been that excited about a SF bar since we found Frisco Disco at the Arrow Bar whenever that was.  It was oldies dance party night, and the music was amazing.  The crowd was great, people were dancing, cheap drinks were flowing.  I thought I had found my favorite new spot.\n\nThe last two times I've been have been very disappointing.  \n\n1.  Our friend wanted everyone to go there for his birthday.  The (very slick) website said it was oldies night with a dj.  He talked to somebody on the phone about it and they confirmed.  When we showed up, it was $7 at the door instead of the advertised $5, and it was bands - not oldies night with a dj.  Even the chalkboard outside the door said $5 oldies DJ!\n\n2.  We tried again.  This time the website said 90's.  We got there (it's pretty far out there) and it was rockabilly bands.  Nothing against rockabilly bands, but I had to offend a close friend by leaving their going-away party at midnight because there was no dancing and I just wanted to go dancing, and then this.  \n\nAm I missing something?  Is there a way to find out what event is Actually going on at the Knockout on any given night short of taking the $15 cab down there?  \n\nTonight is says Oldies Night w/ DJ's.  My fingers are crossed.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "PAUL REUBENS.\n\nNo, there wasn't a celebrity sighting.  It's just that the Knockout looks like the biker bar from Pee-Wee's Big Adventure.  They didn't play  \"Tequila,\" but they probably should have.   Too bad the statute of limitations ran out on my indecent exposure rap.\n\nSpeaking of indecent exposure, they have a photo booth next to the dance floor, just in case you want to record your inebriation in three second intervals.\n\nIt's a painfully hip place.  Definitely divey, slightly seedy, a smattering of Bernal Heights exiles from Cortland Street -- my kind of shithole.  They were also showing The Shining, so you know I'll be back as that's my craigslist m4m hookup movie of choice (\"Oooooh, weren't those dismembered twins creepy?  Wanna fuck?\").  \n\nOnce again, I was a willing hostage to the charms of fellow yelpers Patrick M and MJ T...look, I love everyone but I'm sorry, they pull up at my office in a white van, club me like a baby seal, and throw me in the back.  What am I supposed to do -- resist?  Those bitches will pop a cap in my ass, they're all business.  Plus, it's not like the rest of you ask me out.   Word to my pretty female friends: I'm the perfect dinner date.  I'm cute, asian, and fit in your satin evening clutch.\n\nSo we were at one of the tables next to the window, chatting and otherwise being obnoxious to each other.  There were two straight couples seated at the table next to ours.  Now, we're friends in real life (right? RIGHT?) but we're also yelpriends, so we were talking yelp, when I noticed one of the harpies rolling her eyes and casting disparaging looks in our direction.  They then quickly got up and left.  Look you tramp, don't give me that.  You're just bitter because you're stuck in your miserable life with your obviously gay boyfriend AND YOU DON'T HAVE A WEBSITE LIKE YELP ON WHICH TO BITCH!  TALK TO MY MOTHERFUCKING HAND.\n\nSeriously, am I crazy?  Does this shit happen to anyone else?  Who knew yelping could provoke such hatred amongst the hoi polloi? \n\nAnyway, as we were leaving a [expletive deleted]* reveler wanted to prove he was going commando and showed us his pubes.\n\nMaybe Pee-Wee was there after all.\n\n\n\n*property of PM", "author": "d s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-25", "description": "The kind of place for a big Chimay and a table full of strangers who you may or may not end up hugging at evening's end, even if you're not really a hugger. Because this crazy bitch is so high she's calling you \"babe\" and handing you her dog and all of a sudden you're part of this weird ad hoc little family. \n\nBars like that are nice.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "Since Monday signals the beginning of another work week, Heidi and I took it upon ourselves to mourn the passing of the weekend by throwing back cheap vodka and singing our (her) heart(s) out at Happy Hour Karaoke at Knockout. Was it happy? Yes. And it lasted longer than an hour (6 p.m.-9 p.m.). \n\nThe place is a dive but a clean dive full of outer-mission hipsters, guys in flannel shirts, and what appear to be neighborhood natives. The bartender last night was a most adorable, itsy bitsy dark-haired girl with a heavy hand for vodka and unending patience with a drunk guy at the bar. There is a stage, a PHOTO BOOTH, and a very private, clean ladies' room. \n\nIt's a mellow place with a laid-back vibe and some pin up shots behind the bar. I wouldn't go out of my way to come back, as it's kind of out there, but it's a great option if you live in or find yourself in the Outer Mission. Especially on a Monday for Happy Hour Karaoke. OOOh! And if you get real drunk, you can even justify munching on some big, juicy tacos (*ahem*) at Cancun next door!", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-31", "description": "The only time I have seen a room full of white hipsters awkwardly swing to 2-PAC and throw their 40's in the air WITHOUT getting the sh*t knocked outta them.", "author": "Jade W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "Blah blah hipstercakes (and if you get that reference, you are as dorky as me and should be my new BFF. we'll get friends forever bracelets. and buy domain names. and start our own LJ community. and our own IRC channel where we can trade viruses & porn. it'll be glorious.).\r\n\r\nNo, seriously, Knockout is a great addition to the Valencia meets Mission meets Burger King section of the neighborhood. Odeon was always a little too \"playa\" for me (do you have any idea how long it took me to figure that reference out? too long.) (and the pathetic thing is i am a native spanish speaker.) and this is much better, less pretention, more locals who just want to listen to music and get drunk (really, what else is there in life?). Drinks are strong and reasonably priced. I would not go near the margarita ever again, unless you have a hankering for Jose Cuervo and a shitload of sour mix.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-13", "description": "Yeah, I know people like this place but this is just not my scene.  For one, I'm not a cool hip girl with cutesy clothes and cutesier hair.  For two, I'm not a cool hip guy with size 28 waist and skinny jeans.  For three, the only person who bothered to talk to me was the old (and I mean grandfatherly old) man at the bar. True he may have only talked to me because I was the one closest to him in age.\n\nWell, this place does have super cheap drinks - 2 Red Bull vodka + 1 double vodka collins = $14.  I'll probably be back.", "author": ".elin f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-14", "description": "I'm from San Diego. The Knockout (despite the fact that I came during the 90's night...YAY to the Flannel-palooza!) was still a refreshing change from the lack of a scene here in SD.  \n\nThings this bar does NOT have, that every other bar in SD does have:\n\n1. Girls wearing glittery halter tops and guys wearing rainbows\n\n2. $15 Whiskey & cokes\n\n3. \"Don't Stop Believin\" by Journey\n\n4. \"Livin' On A Prayer\" by Bon Jovi\n\n5. People who like to sing the above-mentioned songs EVERY time they play them at a bar.\n\nCheers to the Knockout for providing a nice venue for me to escape from the horrors that is SD for a little while.", "author": "Samantha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "With a mere 3 bars, the Deep Mission manages to offer a very well-rounded hipster drinking scene.  First: El Rio (the obligatory sprawling biergarten with random things to eat), then Argus (the best spot for ambience-fetishists and bar traditionalists like myself), and finally The Knockout--for the committed hipsters.  \n\nThe place itself, from the deliberately unaesthetic reddish-grey palate to the impractically small tables and the seemingly thoughtless (yet no doubt carefully composed) layout is very much an exercise in random-chic.  Ordinarily that would be the telltale sign of a den of minimalist, abrasive snark, but you gotta hand it to 'em for going all-out on the activities--seems like not a night goes by without karaoke, bingo, an all-girl Kinks cover band, or (as in our case) a 90's dance night.  And yes, we did show up in thrift-store flannel so as to get in for free.\n\nAnd then there's that drink menu.  Long have I searched for a root-beer cocktail that was worthy of the name, and their root-beer float was just that (I think the secret is the vanilla vodka).  Can't go wrong with the bro-seff either (though normally I abhor energy drinks).  Or you can just down a mini-sake bottle for 8 bucks.  Pretty soon, you'll stop worrying whether you're as cool as the guy in the fedora, glasses, goatee, tie and short sleeves who hasn't looked up from his iPhone all night (swear to God), and just get out there on the dance floor, moving from Blur to Supergrass to Stone Roses until suddenly you realize it's 1:00 and you're not even tired (don't laugh, I'm 65 at heart).\n\nOh yeah, and don't forget to do a quick round in the photo booth for your morning-after Facebook profile (but plan out your poses ahead of time, or you'll be drunkenly caught off-guard--and out of frame).", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-04", "description": "I'm one of those people that doesn't really go outside of her comfort zone when it comes to bars. I will try eating at new restaurants, listening to new records, maybe ill even get crazy and try on a different cut of jeans. But very, very rarely will I go to a bar when there isn't at least one bar stool with a severely deep impression of my levis back pockets. \nKnockout has had a pretty good string of shows and dance nights, some cheap some free. That got me in there. The fact that they have tall cans, cider, and odd cocktails kept me in there. The cute dudes, efficient bartenders and fact that its pretty close to a bunch of other bars will keep me going back. Its official. I like this place. Damn, does that mean I'm growing?", "author": "Taler N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-25", "description": "Okay, so my first two star review easily goes to the Knockout.\n\nNow, I want people to keep in mind that what I am looking for in a bar is important to the 2 star rating.\n\n1) I like places with cheap, but quality drinks. They had advertised $2 Kirin on tap on their website, however it was actually $3 dollars and then went to $4 after 9pm. Considering that most other similar bars have an actual $2 quality draft happy hour, and that Sudachi has actual $2 drafts all day on Sapporo, the Knockout disappointed here (after 5 beers w/ tips the difference adds up fast).\n\n2) I like places with a cool crowd, age group early to late 20s. This place had a crowd of late 20s to early 30s and the people were very unimpressive. Most that I talked to had really similar life stories -- drifted from job to job never really advancing far and kind of settling into mediocrity. It was like time traveling forward and seeing what happened to all the High School burnouts. The scene was really boring.\n\n3) I like places with some sort of ambiance. Yes, I know this is a dive bar, but if the drinks aren't particularly cheap then part of what you go for is an interesting setting. And considering how cheap it is to make a punk/rock club look good, they really under delivered. Also, the bathrooms are terrible.\n\nAll in all, I came expecting a unique place, cheap drinks, sushi, and good music. I left pretty disappointed. Won't be going back.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-09", "description": "I like to come here with friends for bingo on Thursdays... I don't really know what it's like here for other events, although I hear they have some good dance nights.  \n\nThe drinks are inexpensive, and they have a drink called the root beer float that's pure deliciousness (I'm a sucker for sugary drinks).   You get a bingo card for every drink you buy.  \n\nThe bingo caller is really entertaining, and the music is always good.  It's more fun if you get there early, so you have a table to spread out all of your bingo cards... it's almost impossible to keep track of more than one when you're standing up.  Trust me, I've tried.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "Kudos to the photo booth. We came here for cocktails after dinner one night. I felt a little jipped for having to pay a cover to come to a bar where I felt it was an 80's post-punk night. Sure, I dug the referents to Joy Division and the band was obviously influenced by the post-punk scene I honestly just wanted a more dancey scene opposed to a group of kids emulating the Sex Pistols, Joy Division and New Order.. Don't get me wrong the place is a typical dive which I like. Perhaps check the calender before coming. In all it's still a cool place. I was just tired from a busy day...", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-24", "description": "We used to drive by this bar in the Outer Mission and someone would  always say, \"We should try that place with the crazy monkey drinking a bottle of wine on the sign\" (it's a Luchador).  Well, last night, we did.\r\n\r\nThere are many reasons to like Knockout.\r\n\r\nIt's a mix of so many different things - random magic show on the t.v., photobooth, giant glow-in-the dark Godzilla poster, Virgin Mary beads, pool table, photo booth, live music.  I mean, come on, there's enough going on to keep you there a few hours at least.\r\n\r\nThe drinks are good and strong. I was being weird and ordered a glass of wine (we were going to dinner after), and received a tumbler of Malbec, so good, so big.  When is the last time you had a good wine by the glass at a bar?\r\n\r\nThe live music is good!  It has that New York downtown kind of vibe to the place, and the band that we saw played a Johnny Cash cover that was decent.  \r\n\r\nThe crowd is mixed - cool, Mission-y, dive-bar-going folk.  My kind of people.  We were there at around 9:30pm and it wasn't packed - you could stand comfortably and hear each other talk.\r\n\r\nI would definitely go back - it's the kind of place that I feel instantly comfortable, like I've been there before.  That is truly a rarity in SF these days.  Go see the crazy monkey.  He's got something for you - a good time.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-04", "description": "Thursday night plan: \n\nEat super burrito at El Farolito  \nWalk ten blocks to Knockout in attempt to burn off some of the super burrito\nBuy drinks to get Bingo boards\nPlay Bingo!\nWin Bingo\nWin Blackout!!\n\nThe last two steps hasn't happened yet, but its a super fun Thursday night plan.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "Entrance to the Social Studies show: $5\nVodka Soda: $3 (!!!!!)\nBeing two doors down from the best (and open late) taqueria in town: PRICELESS\n\nAlso, the photobooth, mega touch and oldie's nights make the Knockout a knockout!", "author": "Mandy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-07", "description": "The Knockout is one of my favorite bars in the city. It's just divey enough but not dirty or sketchy. The staff is all really cool and the drinks are strong. My favorite nights there are Oldies and Teenage Dance Craze (50's,60's music) but Debaser and Shine On (90's music) are good too.", "author": "Bob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-22", "description": "Two words:  BINGO NIGHT\n\nMy roommies have been going here on Thursdays and last week I finally caved in.  \n\nIt was so worth it!  Very fun, late twenties something crowd.  Do you remember those rainy days in elementary school when your whole class would stay in to play heads up 7 up, 4 corners, or BINGO?  Well, it's like that, but with alchohol, people.  I love how everyone gets involved, and when you win your future ceramic-pot-that-used-to-have-a-live-plant-in-there, and take home your future ex from there, you can't not come back again and again, week after week,  you know what I mean?  \n\nI also heard they serve sushi on Wednesdays.  Only for the strongest of heart and gut, I assume.", "author": "Xandria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "This is my favorite grimy dive bar in San Francisco. Why? I like to look at the people who go there and I love the musical line up. While I'm not a show going person, I do think they have some good bands come here (that is if I liked contemporary music which I seem not to). The DJ nights are spectacular. You can hear anything from jock jams to French 60's pop. It's amazing.\n\nMore on people watching/interacting. I have had more success here than most other places in SF. I have met new people here, ran into old friends, and I've even made out here (it was in a secret spot). But, let me tell you, if you ain't a hipster it may not be your thing. To this day I'm scared of bringing my friends from the the Marina here. It's one of the few Mission spots that isn't desecrated by frat boys on the weekend, and for that it def. deserves 5 stars.\n\nAs for the drinks, well I don't like them much but they are much cheaper than the drinks I usually buy when I'm out. But what do you expect, this is a dive bar, and frankly it's a great place in which to be drunk even if it isn't the best place to get a drink.", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "I've seen too many shows to count here. It's a great mainstay for quality, semi-cheap music (generally $5ish). Musicians love the place because it has great sound. I love it because it has great dancing! It sort of has an open, two-room design that separates the dance area from the bar, making for less spilled drinks. And they tend to have good DJs in-between and after sets, making for more fun! :D\n\nOther observations of awesomeness:\n$2 Hamms\n$3 Color photobooth\nNeon sign that says \"NOPE\" instead of \"OPEN\"\nFriendly bouncers that actually make non-vapid conversation", "author": "T.Z. R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-10", "description": "SO far yet so worth it.  \nSo many different things happen here, I love it.  \nI've gone here for Booty basement many a times, dance your ass off, get someone else's sweat on you.  It's a great work out. :)\nI even did the hair for and walked in a friends fashion show here about a year ago, it was really fun. You can find pictures on fliker/ knockout fashion, or something like that.  Donuts events are a blast here.  \nI always see everyone I know here, plus or minus, you decide...", "author": "amanda v."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-19", "description": "One Pool Table\n$4 Vodka Cranberry \nSake by the bottle available\nOne restroom for the ladies \nDancing area that no one was utilizing\nPhoto Booth - that will fit four grown men and one girl \n\nPlenty of hipster/biker types - but no good lookers in sight except for the three handsome devils I was with that night. \n\nAnd no thank you white drunk guy...I do not want to look at your pubes.", "author": "MJ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "First and foremost -- THE most flattering photobooth ever! Fuck all the poorly maintained, black and white booths smattering similar (and inferior) bars around the city that only work half the time. This is very important! I always tend to get very very drunk at the knockout, and that is sure reflected in the photobooth strip, but i still always look GOOD. magical.\r\n\r\nOther points:\r\n-Strong drinks \r\n-Bartenders and barbacks usually nice and easy on the eyes.\r\n-The occasional saucy little doorboy (wink wink)\r\n-Amazing pupusa place across the street open just late enough for you to stumble into after the bar closes\r\n-Lots of weird decor that amuses the drunk eye\r\n-Clean (girls) bathrooms with a convenient primping mirror outside the door while you wait.\r\n-In my experience, the ratio of creepy dudes is less than many other like places.\r\n\r\nDrawbacks?\r\n-Sub-par tabletop Ms. Pacman\r\n-Sure it's kinda \"out there\" but it's not too bad if you're coming from another part of the mission. I've made the walk. I've been known to trek there just for the pupusa joint anyway.\r\n-Somehow I just get TOO drunk every time.\r\n\r\nGrab your friends, split a cab, bring ones -- did I mention the photobooth? One last warning - a hot girl friend and i did have TWO strips of pictures consecutively stolen from the drop slot one very intoxicated evening.  This incident still under investigation.", "author": "Frances L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-02", "description": "Update 1/11/07: Now this place is called Knockout and it's still pretty hip. Was there last night with some friends. I bought a round that included 1 Racer 5, 2 Stellas, 1 Pacifico and a Vodka Tonic, the total was $14.50. 'Nuff said. On Wednesdays, stop in for happy hour where one of the previous chefs from Tokyo Go Go makes fresh sushi at knockout prices.\n\n-----\n\nThe infamous Odeon, home to some truly wacky and out there entertainment on almost any night of the week. Bad Bad Karaoke, if they still do it, is worth checking out. On quieter nights, this is a cool bar just to hang out at.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "I joined friends here who are regulars of the Thursday Beer Bingo. So much fun!!!\n\nA little crowded and disorienting, but the bartenders are efficient and friendly, and the crowd is a good mix of hipsters, comedians, drunks, and nice people (like me).\n\nMy friend won a cute rug (how random are these prizes? I love it!). A couple weeks ago, another one of my friends won a bottle of mistable KY lube. Ahhhh, yes:-)\n\nDefinitely going to be a somewhat regular place to hang out at when I'm in the Mission on a random weekday night.", "author": "Judy F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-23", "description": "It's a decent place - a little on the small side, but most bars around SF are.  I came here awhile back for their bingo night.\n\nNeedless to say...the pair of underwear that I won from a round of bingo left a little to be desired as a prize, but that adds flair to the place in my book.\n\nOverall, had a good experience, but not amazing, and it's quite a ways south -- not sure I'd make it a destination spot.  Probably a good place to stop off for a drink after dinner at some of the restaurants around Bernal.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "My cousin was in town (I know, I repeat myself), and on her last night we decided to do dinner and drinks and photo booth madness.\n\nApparently, it was some crazy donut night, with claws, and a fashion show?? I really have no idea what was going on, but I work with the doorguy and he said we should come, so we did. \n\nIt was crowded, and again, we were confused, so we just grabbed a couple of (cheap well) drinks and hit the photo booth. Three bucks, color, four photo strip = four stars. Fair enough?\n\nI might come back, if I'm ever way out in this neighborhood again on a normal, non donut night. (Who am I kidding...they have the only traditional color photo booth that I know of in the city. I'll more than likely be back for that reason alone)", "author": "Vanessa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "I went to go see my roomates former band play.\n\nIt was pretty nice. I like the grungy feel to it all. Indie rock is a nice complement to this place. \n\nI don't know what else to say, other than I enjoyed the environment.", "author": "Eugenia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-21", "description": "I have frequented the Knockout for some time now and Saturday seems to be my favorite night of the week thus far. the space is moderate but the crowd's make it feel very intimate at times. divided spaces for drinking/dancing and drinking/socializing at the top of your lungs due to the great selection of music that the DJ's often spit out. if you're looking to dance with a group of friends, this venue will provide all night. the drink selection is on the skim side, beers and mixed drinks, but is often overshadowed by how much of a blast your having at this place. the small cover at the door is definitely worth it. \n\noh and aesthetically, if you remember to look around before you start drinking there is awesome artwork scattered throughout the place. the photobooth is money as well.", "author": "Earlvin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "Wednesday night Ichi sushi RULES!  If you ask me, it is WAY too inexpensive for the quality...\n\nGreat bar to hang in...\n\nAffordable quality all-around...what's not to love?!", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "4 stars in less than 20words:\n\nWednesday night delicious sushi in cozy bar with 1940s stripper clips on the telly for very little money, yeah!", "author": "Tatjana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-22", "description": "Well, I've only been to Knockout for Bingo on Thursdays and it's always a great time.  It's dark and divey, which I love, and I dig the decor-especially the mug shots of Alcatraz inmates-they all look so evil.  Anyway, Thursday Bingo is a lot of fun.  You get one card for every drink you buy.  Last week I won the blackout round and won 2 drink tickets and 2 prizes!  I picked out a little plant as one of my prizes and I'm going to try my best not to kill it...I don't have a very green thumb.  \n\nBy the way, I'm not a \"hipster.\"  I don't look like a hipster.  I don't pretend to be a hipster, but I have never felt uncomfortable or out of place in Knockout.  Maybe the Thursday Bingo crowd is a bit different than the regular crowd, but don't let the negative reviews of the \"hipsters\" keep you away.", "author": "Sara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "I love Sushi Happy Hour on Wednesday, the killer Motown music they always play, the bartender who can make you a mixed drink you've never heard of and will order again and again, the photobooth, the tall stools, the proximity to excellent burritos, the general lack of pretension, and the decent prices. \n\nHooray for The Knockout!", "author": "Erica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-07", "description": "So dark my I can feel my pupils straining to dilate turning my eyes into that of a sleestack. Whoa... pretty cool. \n\nI didn't realize Thursday was a bingo night until the large and friendly bartender gave us a board per drink. I was thinking, wtf? But, turned out to be fun. The hostess perhaps being key to making it that way. Lit up bingo board display is doing it right.\n\nAfter bingo, the first band of the night began to play, the singer being in a near devil-possessed frenzy,, and I felt like the guy in one of those pictures where the wind is hitting is face so hard, his face begins to distort from the sheer force.\n\nOnly my second time here, definitely won't be my last.", "author": "Boris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-06", "description": "Deep into one of my numerous tallboy cans of Tecate at the Knockout one night, I text messaged my friend who used to live in Chicago: \"knockout sf = empty bottle.\" Anyone who's scoped the music scene in the Windy City should be able to recognize what that means. It means that, like the Empty Bottle in Chicago, the Knockout SF is a cool place to see some cool indie/punk bands and, sometimes, try to ignore all the people who are simply TOO cool.\n\nYes, the Knockout can occasionally suffer from infestations of Hipsteris Elitus. Like a few weeks ago, when an Israeli band set things on fire, poured beer down their own trousers, played on top of the bar, and rode a kick-drum over the audience's outstretched arms while banging out primal rock'n'roll rhythms --- and yet there were still groups of skinny-teed trendoids who dared to stand around, slouching and glaring through their bangs and acting as if it was all SO boring and, omigod, can I BE any less excited?\n\nUm, yeah...and fuck YOU, too. \n\nBesides the indie clones, though, this place is pretty sweet. Affordable prices and a small stage for live underground music are always a fine mix. Keep your hipster gag reflex under control and you should have no problems.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-04", "description": "This place gets some pretty good bands. I wish that the space was a bit bigger. It can get pretty packed and hard to see the bands that are playing. The drinks are normally priced and everyone that shows up are usually pretty chill people.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-24", "description": "Had a great time here on a recent rainy Tuesday for KUSF's happy hour.  They have Racer 5 on tap, along with a really great selection of other beers, including an excellent selection of the cheap 'n' dirty variety.  I felt super comfortable there. It has a run-down but clean feel, and good random decor, with all these little dark nooks -- good if you like to sequester yourself with your drinking pals.  The bar is made of old-fashioned wood like I like, nice and long in case you feel like being part of the action.  \n\nThe 'tender was super laid back, but not remiss at all.  He opened the mason jar of corn likker for me to taste (Soooo gross!  Smells like tequila, tastes like corn oil.  But oddly smooth... So I finished the shot, naturally.) just 'cause I was curious (or maybe just 'cause of the growing pile of ones at our end of the bar).  \n\nWe meant to stay maybe 2 hours, ended up staying a full 4.  The availability of great drunk-people food in all directions is also a plus.\n\nI mean to return, and the Bingo sounds like it might be similar to the Cacophony Society one I used to love.  Hell, I love any Bingo, so you can bet I'll make it one day...", "author": "Teal H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-22", "description": "Look out weekend cus here I come, because weekends were made 4 fun! And on the weekends I'm lookin for a DANCERIA! \n\nEy, It's all about BOOTY BASEMENT NIGHTS! \nThe gots: \nDebbie Deb\nDr. Dre n Snoop\nShit even Mama Old Skool hits\nDOWN! \nAll that was missing was some Zapp n Roger\n\n*The only thing is the dance floo is not big enuff for me--ey man push those tables back!*", "author": "Roxane P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-02", "description": "Nothing says \"party\" like the Knockout.  Many a night I have spent here, flirting with tall skinny boys in tight jeans, luring them into the photo booth for a taste of my frothy beer.  Yes, my seduction tool of choice - the photo booth.  I'll post pictures of some of my finer catches in the near future.  Maybe I'll even make a collage!\nThe girls at work are all jealous because I can rock a gold lame bra and snag emo boys like nobody's business.  And the Knockout is my bar of choice!  Long live donut parties!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "This has got to be my favorite bar in the city.  Located on the intersection of Mission and Valencia, it's pretty hard for this place to escape the hipster inevitability of it's visitors.  It totally adds to the atmosphere of the environment and is a nice reflection of the character of the neighborhood.  On any given night they always seem to have a fun theme (hello, bingo and board games? hip hop? Smithfits?)  or kick ass live band playing.  This is one place you definately do NOT want to pass up.", "author": "Marilyn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-17", "description": "What?? This place has a photo booth and Thursday night bingo? Nice!\nI was browned-out when I got here, but I do remember the bartender being super friendly... The drinks were poured stiff and the shots were free (or, who paid for my shots?) Anyway, It would be worth going back here to see if I had as much fun as I think I did.", "author": "Carrie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-02", "description": "Damn, boy.  Why u gotta be so far away?  You know I wanna holler at you, but I'm not trying to drop 20 on a cab just making it to ya crib.  I miss ya fine ass cocktails and photobooth.\n\nEDIT  6/8/07\n\nDayum.  I can't believe I gave the Knockout 2 stars.  I'm such a whore.  I believe in giving updates on places, so let's talk about Knocking oneself Out.  I came here to lower my rating of the Knockout because the place, quite frankly, has gotten too popular for its own good.  I'm sick of the attitude I get at the door here when paying a cover.  But at the same time, it's good enough that lately I end up here once a week.  That's right.  I cross fucking town to come here.  So I'll up its rating a star.  But one thing that bugs me is when it's a coke whore night here.  There's only one stall, ladies.  Take a cue from the Arrow (RIP) and just do it by the vanity.  Some of us need to pee!!", "author": "Coco D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "OK all this hipster talk--try being a 40-something lesbian who, yes, looks like a lesbian, and lives in the Mission. I still walk right into these \"hipster\" bars and have a great time. First, I smile politely at the guy at the door who wants to see my ID, and I just tell him DJ Chaperon is here--I never show my ID. \n\nMy first experience was when the place was the Odeon, and I did not live in the hood. A friend was visiting from Leeds so we had a great dinner at Blue Plate; then we wanted to have a drink. My gf being a bit buzzed tried to get into Lucita's--well, since we were not working girls--that did not work out--they must of been having a private party. So next nearest bar was the Odeon. We walked in  and a duo was on stage. The lead singer was playing the stand up bass and singing Old School, Honky Tonk, country and western tunes with a very thick Japanese accent--I was in heaven. Much to my friend's delighted surprise and my gf's obvious chagrin--I knew every word to every song--scary but true. Yes, I have red neck genealogy straight from the Ozarks. The evening was a unexpected surprise for us all. \n\nSecond time I walked into the Knockout it was for a quick beer; people were nice, beer was cheap and cold, and no one tried to speak to me in Hip-slang. So do not be afraid; it is a cool place to go even if you a girl like me.", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-03", "description": "SUSHI on wednesdays is awesome.   We are picky, and these guys bring it for real.  Just get there early for a table. $2 Kirin Ichibans, and $6 for A Kick-ass margarita feat. Fresh squeezed lime juice.  Good service, fun crowd. Dj spinning 45's...even cooler.\nLooking forward to more times there.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-18", "description": "Wednesday night sushi = awesome, +five stars!  The number of hipsters in suede vests and keds that I had to deal with to get the sushi, -one star.  \n\nRoving sushi at a bar is an awesome idea.  It was easy, delicious and affordable (especially when the BF pays for it).\n\nI would definitely go back - I had the full intent to use the photo booth but some how got distracted and left before I did (probably b/c the number of hipsters were increasing by the truck loads).", "author": "Brittney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "Wicked place. Just moved to the area and it is the only place I've found worth going to.\n\nWent to the International Club(which had lovely bartenders-coolios but the place was chock full of lecherous Latino blokes ,all vying for the bartenders attention) and another Latino bar on Mission that I didn't get.\nThe latter had a gender mixed crowd which is better than the last one but it was weird to say the least. We get in there after an interrogation by the midget security folks and go to the bar.\n\n The bartender is all smiles and shakes my hand.\n(thats cool-i say to myself, friendly folks)\nI order a  gin&soda for $8 and gave her a $1 tip. \n(Ok, its a little pricey but hell i'm alittle toasted so i let it slide and start to mingle at the bar)\n\n10 mins later the lady comes back and says \"Excuse me thats $2 tip not $1\", not in a mean, intimidating  way but in a very nonchalant friendly manner.\n(Knee Jerk reaction =hand her another dollar and smile, 'when in Rome')\n....1min later...internal monologue....wait a minute WHAT IN THE MONKEY BUTT JUST HAPPENED?!? I 've never heard that before, that's not even a tip, that's like a payment  but in 3 parts : a advance, a deposit and last months rent. So it came up to be a $10 drink.\nTill this day, i do not know what kind of place it was but i can assure you, it was shady.\n\nThen we ended up at  the Knockout Room and had the same drink for $4 and a belly of laughs.\n\nYes luvya Knockout", "author": "Tak H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "Although it was raining in the city, a quick walk through the Mission to Knockout on a Thursday night was perfect for my friends and I who were just looking to chill out for the night.  Thursday night Bingo comes equipped with a Bingo Mistress, a free drink ticket and a table with a plethora of wonderful prizes.  After plenty of drinks ... by the end of the night we walked away home as big bingo winners and had enough bingo cards to prove it!  We didn't walk home empty handed but straggled home with a potted plant, plastic neon fun sunglasses that would have been found at any 6 year old birthday party, a jar of delicious finger-sized pickles and a 6oz. can of mushrooms.  \n\nThere was never a line for the girls bathroom, drinks were good, and the bartender was super friendly.  And who doesn't love live music?!\n\nYou got to love this place.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Who the fuck doesn't love a photo booth?\n\nWe went in like six times last night. Good times. Never gets old, except when you run out of $.", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-04", "description": "If I were a townie & a drunk & I lived in the deep Mission or Bernal Heights, you bet your ass I'd be here every night.\n\nI was there last night (Tuesday) for a friend's show, & first impression is that I like pretty much everything about the Knockout. It's an obvious dive, they've got cheap drinks, a photobooth, pool table, pac-man, booths for people to sit in, awesome paraphernalia on  the walls, & it's very roomy.\n\nNevermind the extremely drunk creepy dude hitting on two of my friends all night. That's just Roger.\n\nOkay so I don't know his name, & there's no excuse for that, but being that The Knockout is the perfect townie bar, he was probably buds with the bartender & it's known to the regulars that skeeziness is his M.O.\n\nGreat place.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-21", "description": "Don't let the talk of the hipsters scare you away from this great bar. The Tamale Lady-Equivalent of the 'sushi guy' is there on Wednesdays for happy hour which, as disgusting as that may sound, is a very, very good thing.\n\nI've never won big at bingo on Thursdays, but have gotten drunk enough to lose track of the six scorecards in front of me. \n\nI've been there for a Friday/Saturday night band and those are the nights I would like to avoid most. Having said that, it's still a blast.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-13", "description": "For some reason lately this has been my defacto bar when in the Mission and I love it. They have a really awesome Oldies night, photo booth, and photo hunt (which is a rare combo). I also find their bartenders really nice and drink selection cheap and good. You can't go wrong with a tall boy of Tecate or their alcoholic root beer float. \n\nIt is also a great small venue to see some great bands play at. I saw Glass Candy here on New Years Eve and it was amazing.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-18", "description": "Went to the Knockout on their Hip-Hop night on a Saturday and loved it!  Was referred to go there for their oldies night but didn't make it and we thought it was a little sketchy because of their sign, but as soon as we walked in it was great!  Loved it!  Great food, reasonably priced drinks and friendly people.  Definitely, making a stop here every time we're in SanFran.", "author": "Toni Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-19", "description": "A casual environment and a nice performance stage/area. I recently came here to see the Young Offenders on a Tuesday night and it was fucking awesome. The place got pretty crowded but not packed.\n\nI don't drink so I can't gauge that aspect of it, but my friends that do drink were having a great time, and they're broke, so it can't be too hard on the wallet.\n\nDefinitely a cool place.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "Great location for me (stumbling distance to and fro)\n\nI always seem to have a good time here - they book lots of bands which is cool as there are fewer places to play in the City these days.\n\ndX is a great guy - he booked my ukulele act there a couple of years ago based simply on my pitch (Dark Side of the Moon on ukuleles).... He gave us a Sat night and the whole thing was such a blast we did it again for the Knockout's 2 yr anniversary.\n\nThe Tatamimats are forever grateful!", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "If there is a Map for revolutionaries, instigators, booty-shakers, or people who want to create community through good beverages, good people, and good music, then Knockout is the place for you.\n\nKnockout is the home for artistas, wanderers, and good spirits. After I attend a rally, or cook a huge meal for protestors, or my familia, I go to the Knockout to hang out with people who don't believe in petty hierarchies, and appreciate Bingo and Karaoke and Rockabilly and good Latin House. If these nights were names for political parties, I would join them because that is what political party should do more of, PARTY!\n\nDX is the best bartender in the City. He is understanding of musical and political history is above all. \n\nY la Tamale Lady's recipes are to die for. She is a true revolutionary cocinera! \n\nWhenever I leave San Francisco for too long, I go back to Knockout and know that I am home.", "author": "mero cocinero k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Last night was my first time going to this place. \nActually... it was the first time in that part of the Mission area.. it's nice! \n\nI went to go see the Scratchies play they're last show. I'm bummed!!\n\n\nNot a bad walk from BART and a few buses run right outside the door. Makes it easy for us non-drivers, non-bikers, too-poor-to-cab-it's to get to. \n\nThey had a special drink list that everything was $5. I tried the \"extreme Limeade\". I was pleasantly surprised that it was good! great! fantastic. \n\nThis place reminds me of the punk scene before everyone was covered in piercings and tattoos and wearing Chucks.  I didn't feel judged or stared at, which is hard to find when you're a woman wearing a neon zebra print shirt and have tattoo sleeves.\n\nMy only complaint was that it was hot as balls in there. it wasn't crowded, but I still felt like I was in a sauna.", "author": "Towanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-01", "description": "Headed to a 90's hiphop dance show that night only to find that the club was a little too over packed on the dance floor where you really could not show off any extreme moves to the mediocre jams that they played. The cost to enter was $5 and I kind of wish that it was free. \nIf you are up for grind dancing with a loud DJ who keep singing over the songs, then this is your place to be! \nIn my honest opinion, this isn't my cup of tea, but I know many of you might actually like to be reproducing on the dance floor!", "author": "Jon-o G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-21", "description": "The first time I came here I stumbled in, unknowingly, with a college buddy who had friends bartending. Needless to say, I left even more elated than when I arrived. \r\n\r\nThe second time I visited, I was dining across the street and someone suggested to grab a quick beer. \"A\" quick beer it was not. We stayed most of the night, drinking, dancing, playing video games, taking photos in the photo booth, and jamming to the tight sounds from King City. This place rawks even more because my buddy who recently got engaged, has found his wedding reception band. That band is King City. We'll see what his fiance says ... \r\n\r\nThe bartenders pour awesome drinks. When I say awesome, I mean heavy, just the way that I like it. The entertainment is clearly there (btw, Thursday nights are Bingo night. The prize? More free beer!), and the best part is that Taqueria Cancun is right next door for drunk munchies.\r\n\r\nThe reason why this place doesn't get 5 stars is because it's impossible to get a cab from here. It's location is where Valencia meets Mission, and both times I've stumbled out the doors I've had to wait. And wait. And then call Yellow Cab. And wait. And then someone got dropped off at Taqueria Cancun and I jumped in their cab.", "author": "Justin V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-14", "description": "Drinks are cheap, some are very original and good, not overly crowded (although it could be very busy with band shows and such), and show cover isn't too expensive either.  Bathroom always has plenty toilet paper, and it's relatively clean compared to other bars.\n\nParking isn't too hard, they always have fun events like 60s DJ dance night, good band shows, tons of restaurants nearby, and bartenders are friendly.\n\nI love The Knockout.", "author": "Yoko S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "I really should have come here a lot sooner.\n\nTonight they played early 90s rock -- she's a keeper.\n\nAlso, there was a gnarly fight outside after last call.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "It's getting HOT in here! No really it's HOT as HELL!! Went to my 1st booty basement and we danced our booty off but it was CRAZY HOT! Everyone was literally soaked in their sweat and it was gross accidently bumping into a stranger's wet body. I think I lost 5lbs of sweat. The music was ok and the videos of bouncing asses were hillarious", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "Had a blast with Naked and Shameless. Easy to get to on the Van ness bus. Beer good price", "author": "Chelsy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "Yes....I like this place.  I've been there a few times now and I always feel like I'm returning to my own dark little cave.  It's cozy!\n\nI highly recommend BINGO Thursdays but I don't really want more freakin' hip kids to come on over, so....I am conflicted.  I've won TWICE and it's always like a huge joy, you get a $4 drink ticket in addition to your fabulous and authentic $1.99 pirate kit or sketch pad.  They have Hamm's which is like a big deal to some people but I think it tastes like it ran off of someone's boot.\n\nThe bartenders are pretty nice and really, that pretty much makes the place for me.", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-13", "description": "The Knockout Rocks!  Any bar with a drink called \"big ass margarita\" is cool by me.  Thursday Bingo is silly and fun.  With each drink, you get another card - sitting at the bar, watching your three cards like a hawk - how can you beat this?.  \n\nEat at Emmy's and then head to The Knockout.  Afterall, Thursday IS the new Friday.\n\n:-)", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-18", "description": "5 stars for the AMAZING Burning Brides show and the good time I had at the Knockout.  This is how a bar should be: trashy, loud rock and roll, sweet as pie girl bartenders that smile and give you a good pour and don't ignore girls at the bar, and lots of hot rock and roll boys that aren't shy about checking you out.  *sigh*  GOOD TIMES. \n\nOh yeah, there are some little things which annoyed me, like its location in Nowhere, Bumblefuck but it is not a deal breaker.  (And I have a suspicion that its location is what makes it so great--perhaps people that bring down a party don't like to travel.) I almost do not want to go back just in case I dreamed this placed up and/or I have a bad night there and get disillusioned.\n\nKnockout--you make my dirty rock and roll lovin' heart go pitter-pat.  If I had a locker, I'd put your picture in it.", "author": "MakeUp M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-14", "description": "Live music, 60's dance parties, Chimay, Thursday bingo, karaoke with a phenomenal song selection on Mondays, plus a photo booth... what's not to love about the Knockout?\n\nNope. I can't think of anything either.", "author": "Missy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "This place is great and has a photo booth.\n\nI'm definitely a fan.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "1. Photo Booth\n2. Dirty Rock and Roll\n3. Pool Table/Dance Floor\n4. DX\n5. A million different places to sit depending on your mood\n\nThe only negative about this place is sometimes the music is too loud and too eclectic. Unlike the Hemlock, which is pretty consistent musically (but not with their pours, so much), you get either Oldies, Rockabilly, Garage, or Bart Davenport. I like it all, but some of it I need to prepare for first, you know?", "author": "Molly A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-09", "description": "I have been to the Knockout on quite a few occasions. It has always been a reasonable dive bar complete with good DJ's and live bands. Now the bands and DJ's are still there and still enjoyable. While the bartenders are quite lacking and the prices have just been raised. The older bartender with the pony tail is capable, quick, and proficient. The best they have. The remaining bartenders are in varying degrees worse than he. From not caring, to just downright incapable. Also at a dive bar I expect my drinks to be cheap and strong. Well not so much. I am not going to go to a dive bar where I get attitude from the bartenders to get a very poor Rusty Nail for $7. I am writing the Knockout out of my will and out of my establishments to visit. When in the area, go to El Rio or Argus, the Knockout just fails.", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-04", "description": "Debutante at the Knockout: Every Wednesday, 5/3 featured the Dilettantes\n\nGreat venue for live music and good spirits. The \"Detox special\" of the night consisted of Tequila and OJ. Stings a little at first, due to the quality of the tequila being poured, but after a while its quite refreshing. They also have a very good selection of other spirits including Sake and an Alcohol drenched \"Root Beer Float\". The beer selection is impressive as well. If that wasn't enough they also offer Trivia on Wednesday nights and Bingo on Thursday nights. I thought the size of the room might be confining to The Dilettantes sound, but they actually sounded very good in the intimate setting. The venue is a little out of the way (for me), but its definitely worth the trip to see some good, unsigned bands...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "90's night is a very underrated theme. \nWear flannel, and you get in for free. \nI sang my little heart out to Annie Lennox songs.\nUnpretentious, cheap GOOD drinks, and a jolly good crowd. \nThey have photobooths too.", "author": "Shereen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "This is quickly becoming one of my favorite hang out spots! There is always something fun going on at the Knock Out! Godzuky Sushi serves sushi there on Wednesday nights, it's delicious and cheap!! You can wash it down with $2 Sapporo. Bingo night (every Thurs) is a bit crowded but super fun nonetheless. On the second Friday of the month they have oldies night. The dj plays nothing but rare -yet hot- 45's that you can totally dance your pants off.\n\nIf you are in the mood for something sweet yet strong, try the root beer float!", "author": "Javier B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "Dropped in to see a friend's band play and really enjoyed this skinny little bar. It wasn't conspicuously hipster, more of the uncool-cool ethos. Or maybe just because it was Daniel Johnston tribute night, so people played it down just in honor of him. Anyhow, a feel goody sort of neighborhood bar, pleasant and friendly with reasonably priced drinks (a large nigiri sake for $8, $4 for a bass and $5 for a margarita, among others). Plenty of TV screens about, that night playing the Devil and Daniel Johnston, natch. Great music in between sets too (lotsa british invasion plus one of my favorite nuggets (run, run run by the gestures).", "author": "Henry Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-12", "description": "I finally went to the Knockout for ska night last Saturday, and I must say, it's a fairly lovable dive.  The $5 cover charge I could've done without, but the cheap, cheap drinks more than make up for it.  I had a modified version of their famous 'Hammjob' (a can of Hamm's and a shot of Kentucky Reserve for $5) by substituting Dewar's for an extra $2.  I had a couple more sets throughout the night, and each shot was filled to the rim of the glass.  Thanks, fellas.  \n\nPoints lost because of the awkward layout which traps a shitload of people in a narrow pathway against the bar.  Our friends ended up hanging out in the coat closet, as it was the only place you could stand without rubbing elbows with strangers.  And the $5 cover to listen to some guy play ska and reggae music?  My roommate can do that for free at my house.  In fact, come over some time, I'll give you a discount on drinks.  Also, I'm not sure which bar is a popular hangout for cute girls, but this isn't it.  Come here when you want to get ridiculously drunk with your guy friends and not have to worry about paying a lot or hitting on anybody.  It's perfect!", "author": "Kyle O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-27", "description": "I enjoy attending Thursday night BINGO at The Knockout with my labmates, if only for the reason that I derive pleasure from helping to lower the hipster/science nerd ratio of the bar.\n\nPersonal vendettas aside, this place offers stiff libations, a photobooth in which to get your pose on, good music, computerized solitaire, and large, clean surroundings. God, I just realized that commenting on hygiene makes me sound like an old geezer *denture falls out of mouth*.\n\n*Now lower denture falls out as well*.\n\nIf hunger seizes you before, during, or after your scheduled drinking session, Taqueria Cancun's delicious tacos await you two doors down.", "author": "Momo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-24", "description": "I only go here for bingo, otherwise the Knockout is a bit too hip for my tastes.  The bingo allows (forces?) the hip kids to take off their veneer of cool indifference and shout along with the drunken masses \"BEEEEEE SIIIIX!!!!\"\n\nThis makes me happy.\n\nThat and my Virgin Mary night light that I won a few months back.  \n\nShe lights the way.", "author": "Mat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-21", "description": "Get thee to the Knockout! John is fun to work with (if you are booking shows) and they're working hard to make a go of it. Great shows and Bingo from the former Sadie's crew is the hot ticket here. \nNot easy being in the neverland part of the Mission, but it's so much more relaxing than the 16th St corridor.\nDustin now works there Weds, he's  a peach! They have sushi happy hour with Sake specials and Clare has an 'annual prom' in July!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "DONUT PARTY rocks my socks. \n\nI stumble into this Mission bar, 3 martinis to the wind. A friend suggested we go here and we are \"on the list\". I guess the \"list\" happens to be a Donut with sprinkles. I grabbed a button and a hand-stamp and moved on. \n\nWhat I encountered was some of the best music I have heard live since...ok I havent heard anything live like this shit before. I was coherent long enough to hear Miyami (minimal synth electro) and white jumpsuit-clad Tussle (drum-heavy electro pop). Loopy and yacked out of commision, I couldnt help but be mezmerized by this beautiful electronic ear-sex. This party IS just like a donut. Sweet, fluffy, well rounded and leaves you wanting more.", "author": "K K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-06", "description": "I went here on a Sunday night to see my friend's band playing. The place was pretty cool, a regular hipster bar but I don't really mind. The drinks were very reasonable. They serve the old school beer, Hamms.  Hamms+a shot of Jim Beams=$5. That's awesome!\n\nThey also have a lot of fancy drinks but in the place like this, make me feel like a fool to order one. Ha! I got gin&tonic. It was only $4 and the glass was definitely bigger than most bars I went to, so I was happy as a clam =)\n\nThey have photobooth! I love places with photobooth though didn't get a chance to take one. I definitely have to come back though it's kinda out of my way. Ah, I wish you were a little bit closer to me =(", "author": "Perry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-14", "description": "I love this place!  I've only been there twice.  Drinks are reasonably priced, there's a pool table that never seems to have a long line, kewl random videos screening, a photo booth, and good music of a mixed variety is always playing.  The staff was incredibly nice (even after my friend shattered a martini glass...thank you for not kicking us out!)\n\nAlso, I highly recommend the Doo Wop Night...sounds cheesy, but loads of fun.", "author": "Lyz L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "My band played here last month.  We really loved the ambiance -- christmas lights and red walls!  What what!  Plus there's a photo booth, Ms. Pacman, and bizarre movies playing on a few tvs.  Nothin' says fun like old-school godzilla.  AND they did some really cool chalk art promoting our show on the chalkboard outside in a pseudo-tattoo font.\n\nWe'll be back.", "author": "Veggie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-12", "description": "B-I-N-G-O\nforget what you think you know\nabout bingo, yo\n\nAnd Hamm's.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "One of the cooler bars in the city. It's not full of pricks, which is an automatic 3 stars in the city, the drinks are par for the course and it does get crowded, but it's not constantly crowded at the level you'll suffocate there. Always had a good time.", "author": "Keith B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "After a second visit to Knockout last night, I'm ready to say I'm a fan ...\n\nFrom great events like Thursday night Bingo (complete with the most old-school bingo cards around, and a visit from the Tamale lady), to great live music (on my first visit I saw Sean Hayes in this tiny club for only a $5 cover), to a great selection of beers ... this is quickly becoming one of my favorite neighborhood spots.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-06", "description": "I'll keep it short as there's already 100 reviews of this place, but how can you not love a bar that: \n\na) has bingo \nb) serves cans of Hamm's beer\n\nFrom the Land of Sky Blue Waters (Waters), \nFrom the land of pines, lofty balsam, \nComes the beer refreshing, \nHamm's the Beer Refreshing, \nHaaaaamms.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-16", "description": "Dude.  Bingo.  I haven't played in years and there I was rocking five or six cards at once.  I'm not even sure how many, all I know is that you get a card every time you buy a beer, hence the confusion.  \n\nPlus everyone loves photobooths and being the nerd I am I was stoked that this one is real color prints, not that crappy digital shit.\n\nWe stayed after bingo as the tunes were really great.\n\nI think I have a new thursday night routine.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-13", "description": "It is definitely an issue of what night.  I go zero nights.  Unless a friend is playing.  Trevor, TLG, and the like are there from time to time... at least back in the day.  It holds a lot of good memories.. like the night we boarded the party bus to the TLG show in SC at Moe's.\n\nThe KnockOut is a fine little bar.... with superb memories.  Minus two for the too hip for me people that were sort of... boring... and silently judging me.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-01", "description": "I really like this place and have ended up going there quite a bit recently. Can't say I love their choices in bands that they have there all the time, but the people that go there, bartenders, and atmosphere are all fun. They also have what might be one of the better drink deals in the city all the time: 22oz. Tiger Bombers for 5$. They don't advertise it, but they're there. Waiting for you and calling to you behind the bar.\n\nI also like the $1 Oyster Nights that the do too. High quality food for a happy hour deal!", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "I might actually give this fine bar Five Stars, except (when it was the Odeon) they used to do karaoke here. And it was always a car crash. Good times. They called it Costume Karaoke and would trot out 4 or 5 tubs of skanky burning man costumes and make you put one on before you sang. Stay away from furry things or onesies and you were usually OK. I'd always just grab the Dracula cape. The KJ was super hott too.\n\nNow they have better DJs here and Smile is on Mondays and I know all you BM-ers really, really miss the Odeon but it's time to move on. Start your own bar for the one month a year you aren't preparing for or returning from BM.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-17", "description": "Probably my favorite bar in SF. A nice long walk from Valencia & 16th - needed after the first couple rounds of pounding. Pint margaritas (substitute Cazadores for the well, which they never seem to charge me for), pool, band, characters, etc.\n\nGreat spot. Not much in the way of trim usually, but alas I am retired from skirt chasing.\n\nBus ride back to 24th then down Mission. A fantastic loop full of rewarding experiences ; )", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-19", "description": "I like the Knockout... Its stylish yet unsophisticated.\n\nTo be honest, I don't remember this place too well. From what I DO remember its your run of the mill San Francisco bar... I think they had the same decorator that they used over at Kilowatt!\n\nWhat I will say about this place:\n\nI was there with some buddies drinking Heineken (for some reason) when one of my afore-mentioned buddies drops and shatters his beer on the ground. Oh shit. Well, lets see how the bar staff handle this... So I tell the bar back, he gets a little pissy look on his face, and then starts to clean it up. As soon as he's done, another friend drops & shatters his beer. They weren't that drunk, just that stupid. The guy kept his cool and cleaned up without kicking us out. That paired with their drink prices earns them a 4 star review!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-14", "description": "Coming from a musicians perspective, I think this place is lame.  My band has played there twice and there has always been shitty sound.  The location of the stage is super shitty also.  The whole set up is awkward.  What this place really needs is to tear down the partition that separate the bar and tables, that would open it up.  \n\nFrom a patrons point of view, it's cool.  Too many hipsters for my taste though.", "author": "Larry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "Just the BEST bar to ever open in SF!\nYou can't go wrong with what ever is happening here!\nMake sure you check out Shuckin and Jivin on the first Sunday\nof the month!\ndX the bartender/DJ rocks!!\nAnd try the Root Beer float, it's great and you'll be on the floor before you know it!", "author": "O. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-02", "description": "Kick-Ass karaoke on Monday's for \"Happy Hour\" with a great KJ who has some very cool song list.  I saw songs on his list you just don't see anywhere else.  Cheap but well made drinks.  Live Music.  Great crowd.  What the hell else can you ask for?\n\nHit it, but don't quit it!!!", "author": "Scott A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-25", "description": "I went to Friday Teenage Dance craze and drunken freestyled with a bunch of Mission kids to R Kelly's \"Trapped in the Closet Part 1.\" Excellent.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-19", "description": "1 star bingo\n1 star decor and cheese elevator tunes\n1 star for pin ups in restroom\n1 star for ass hole bartender\n4 stars for a good time", "author": "Porfirio R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-17", "description": "I love unknown awesomeness.  I checked out this really awesome dynamic trio that go by the name \"My First Earthquake\" at the Knockout tonight...\n\nLemme break it down for you:  awesome people.  great acts.  a little steamy and warm inside, but hey, you're looking for steamy and warm. This place is definitely the look.  And 'My First Earthquake\" was a-mazing.\n\n\nPlus one for really awesome music.  Plus one for taking a chance on unknown acts that rock.  Plus one for amazing people.  Plus one for reasonable drink prices.  Plus one for the other Bartosz I met.  Minus one for not throwing the drunk guy out that was kissing on the lead singer's mom.\n\nWOo!", "author": "Bartosz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "This is a great place for music and now burlesque.  It's relaxed and friendly.  The sound is good for such a tiny place.  The photo  booth is cool.\n\nI've never had a drink here, I've only gone as a photographer and I don't drink and shoot.  The drinks look good, the tequila selection looks too small to interest me in showing up just to drink.", "author": "Spike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "Teenage Dance Craze and Oldies Nights are my absolute dance nights in San Francisco. There's such a great vibe and everyone is so nice out on the dance floor. Cover is only $2 before 11 and $4 after that but with such amazing tunes, why show up late and miss out on half the set?", "author": "Clarissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "Maybe I had another life in the sixties, but I LOVE Teenage Dance Craze. I had so much fun and danced with so many people that were just there to shake it and drink Tecate tallboys. I think these kinds of nights make for more fun, cause it seems more genuine you know--you're not a$s-grinding someone in the Marina or worrying too much about anyone else.", "author": "Krystha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-08", "description": "Bar Bingo - need I say more\n\n(wish it were back at Sadie's though)", "author": "melissa g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-21", "description": "THURSDAY NIGHT BINGO***** I'm drunk and havin' a blast!\n\nFriendly patrons and strong/cheap drinks...  great bar!\nThe only bummer was how dirty my glass of whiskey was.  I'm NOT a snob...  Usually the drink has got to have a floatie the size of a seamonkey or be covered in blood (somebody else's) before I care, but for real!  Every glass that the bartender pulled to replace the glass in question was dirtier than the one before...  finally I reached across the bar and grabbed a plastic cup, and said, \"Fuck it!   Let's play some damn BINGO!!!\"  And I never got to yell \"BINGO\" again, but still had a blast, especially after the Tecate double-tall-tallboy!", "author": "Erica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "Hipster bar at its finest, atlho not being located too close to the main concentration of hipster mission bars keeps a lot of the riff raff out.\n\nIm not a hipster, but I fit in fine here. There is a little bit of a 'tude present, but fight 'tude with 'tude and youll be ok.\n\nEvery night hosts something different: sushi, bingo, karaoke, plain ol' local band. Also included: photo booth and a table top video game.\n\nAs for drinks--they range from bar specialties like \"Man Berry\" -- dont know what was in it, but damn it was strong. And of course, the cheapest beer available (we asked) -- Hamm's. So gross, but so satisfying. Oh Hamm's...from the land of sky blue waters.", "author": "Sabine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-02", "description": "I don't like many bars in SF.  I don't like even thinking about what I am going to wear when I go to an establishment of this kind, and the hipster stare seems to be ubitquitous. \nHowever, I really like this bar.  I like to sit in their chairs.  I like to listen to their music.  I like to take pictures in their booth.  I like their manberry drink.  And one time I went there and they were playing Scarface, sans sound, on a huge screen.  What could be better?", "author": "Rhea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-07", "description": "I've been to the Knockout once before on a Saturday afternoon a couple months back. My only recollection of the place was having too many beers, playing a lot of pool and then, as day turned into night, someone offering me a warm, fresh donut. At the time, I had no idea what to make of it but I welcomed the nourishment and washed it down with a beer -delicious, huh? About the same time I finished my donut dinner, a band called the Donuts Disco (classic disco, mutant disco, italo, cosmic, dutch electro old school hip hop and house) took the stage. \n\nThis time I made my way through the Knockout's dark doorway and wondered how my evening would compare to last time. And, well, it ended up about the same. \n\nFor more check out www.missiononmission.com", "author": "Gadiel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-14", "description": "Went to the Knockout for an Oldies dance party (Soul, Doo-Wop, R&B Girl Bands) on Friday night. The music was fantastic, bartenders and crowd very friendly. They have a lot of specialty drinks and $2 Hamms, High Life and Coronitas. A girl on a budget can't afford to be picky so Hamm's it is. The best part, other than the awesome tunes and dancing was the PHOTOBOOTH!!! The sis and I love a good romp in those little boxes, I think we went in about 4 times. That's 4 less Hamm's but at least I have something to show for it other than a wicked hangover.\nThe only downside to this place (for me) is the location. Long way from home but definitely worth the cab fare once in awhile. Knockout beware, we will be back!", "author": "deb C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "This is the perfect place to go if you need a drink after work, \nwant to watch movies about people hanging out with fucking\ndolphins for a year, meet some weirdos, get drunk, realize \nthe burrito place next door is closed so you can't get your fix,\nfreak out, have a cigarette, watch the lead singer and the \ndrummer of the band that just finished have a lover's quarrel\nwhile loading their equipment into their van, go back inside,\nuse the men's bathroom (because women's is flooded, again)\nand spend the rest of your night drinking the lame west coast\nversion of PBR: Hamm's. (Now, I don't care if it is from the \nland of sky blue waters - it didn't win a blue ribbon so it's crap\nto me.  On the other hand, i'd rather punch myself in the fucking\nface than drink an Tecate so Hamm's it is.)\n\nPs. the bro-seff is a gay drink but then again so is SF, so way \nto go, Knockout.", "author": "kates d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "Didn't let my friend in with her ID, but hosts punk shows so an A+ there.", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "I was wasted watching an amazing punk show a week or so ago, apparently I was here!  I really just wanted to see my friend's band so can't remember too much about the place.  Dingy and dark, good sound system, lots of drinks.  The end.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-05", "description": "I was diggin Oldies Night in a real way, but as the tracks wore on, I realized: this DJ seems to be playing obscure just for the sake of being obscure. I get a minor kick out of the ludicrous lyrics of tunes like \"Hippy Hippy Shake\" and \"Tiny Tim,\" but there's only so much most people can take, right? The silly needs to mingle with the just-plain-good. But, no Exciters, DJ says. Maybe I left too early for the Ronettes, Smokey, etc. I hear Teenage Dance Craze has that spoonfull to help the rest go down.", "author": "Jena H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "i've been here upon waits for restaurants across the road.  the bar is dressed with great posters and signs, and the drinks are stiff and generous.\n\nmany times i've seen the listings for this place in the guardian or sf weekly, and the music seems to be up my dancing alley.   i've never made it out here to shake my tail feather, but i will have the knockout in mind for the future.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "Love love love this place. Came here for Bingo Thursdays and it was a hoot. Tina BINGO'd once and won a free drink and some smarties. We went to Cancun next door and ate a big heaping wet burrito while drinking tall Tecates. My only slight gripe is the drink prices. For a dive bar this far out, you shouldn't be paying $5 for tall boys.", "author": "Rich B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "Debaser = the most fun I've had at a bar since I turned 21.  In 1997.", "author": "Cory G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "The first things I noticed while waiting for my beer was that an old Clint Eastwood western was being projected on to the wall and they have a photo-booth. I was equally enthralled by both. Those were the bonuses! Along with great beers on tap, top shelf liquors, a video game system (choice of Frogger, Ms. Pac Man, Donkey Kong, and Galaga), a pool table, there was a band playing. The band was really wasn't that good, but it was drowning out the drunk telling me how much better his margarita mix is at home. Who orders margaritas at a dive bar anyways??? Cash bar only which doesn't make sense in modern society and it is the Mission therefore parking is atrocious.", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-04", "description": "i don't think i've ever seen so many fashonistia revisionist hippie new wavers in my life, really. \r\n\r\n& it was pretty scary. especially when multiplied over again exponentially because one of them was doing a particularly insane coked out looking dance. kind of pigeonesque, actually.\r\n\r\nhowever, it's got some good shit going for it. like...\r\n-booking my bf's band there on monday.\r\n-cute bartender lady making extra strong drinks.\r\n-super cool & snazzy decor & lighting.\r\n- big ol' video screens.\r\n-being warm when it's freezing outside (maybe not so good in the summer).\r\n-& a photobooth. a motherfuckin' photobooth! hooray!", "author": "Irene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "My favorite bar in the bay area. Good DJ's (old soul, garage, brit pop, brit invasion). Great bands on almost any night. Fantastic bartenders, good strong pours. Photo booth, what else do you need.", "author": "Ben A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I have done some unspeakable things at this bar. And by that I mean far more unspeakable than you might imagine. I owe it to the $5 hamm + x-large shot of Whiskey. And the fact that I sneak in flasks of whiskey and no one seems to care. It's wonderful that I've yet to run into two of the three least favorite people I have ever known, inside, even though they're always here, because it's so dark. And being next door to Taqueria Cancun does not hurt either. And I really appreciate shoegaze, pychedelic, and otherwise some of the mopier musical selection that's spun here for rug-cutting.", "author": "Y K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-28", "description": "So this used to be the sorely missed Odeon.  Fortunately, all is not lost.  While the disturbing trend in SF sees cool, \"dive\" bars with real character taken over by new owners and almost invariably made into tacky, soulless nonentities (for instance, the formerly cool Hush Hush), the Knockout has potential.  In fact, I do believe that the person who used to do the booking at the formerly cool Hush Hush now does the booking at the Knockout, and I for one have seen a couple of very cool shows here.  It's still too soon for me to say, but besides the rather distant (by my standards) location, the Knockout has 5-star potential.", "author": "Mynameisdavid M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-06", "description": "Thursday bingo night has changed my life (or at least the way I look at drinking on work/school nights).  The photo booth is a heart-warming and bonding machine that is rarely seen nowadays- thanks Knockout for keeping it alive!  My roommate and I are still hell-bent on winning bingo (nope, still haven't yet- even with like the 7 cards we use) just for the Jesus night-light...", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-28", "description": "Great neighborhood bar, makes living in Glen Park not suck so bad. Great atmosphere, nice candles, liked the art on the wall.  Silent movies and sixties soul were a superb surprise.  Wish they had a short pool stick 'cause the table's a little close to the wall.  Wish it wasn't as far away from my friends who are all too lazy to get out here.  But, that's kinda nice too, keeps the uber-scenesters at bay...", "author": "Jesse Lu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "thanks for the review that mentioned the crazy drinking monkey (well, the luchador, but from the cab it really does look like a drinking monkey) otherwise i would have had difficulty finding the place.\n\nthis would be \"my\" bar, if it weren't so far.  (i am the hip-hop-otamus, my rhymes are bottomless.)\n\nwent last night to see my friend's band (good city lie still), and i had a great time.  granted it was wednesday (and wednesday is not the new thursday which is not the new friday)  but the place was full of people supporting the local music.  very unpretentious and friendly crowd.  \n\nnice bartender (he would serve his friends first, but if i owned a bar, i would do exactly the same thing, which made me like him even more), the door guy was holier-than-thou... but in his defense he was much holier-than-me.  \n\nsound in the place is pretty damn decent for a small bar.  great place, i did feel at home in an instant.  maybe it was the alcatraz prisoners on the wall (a fan from childhood), the b+w photobooth, or the cindy sherman photograph right outside the ladies but i really did feel right at home.\n\nerotic photo-hunt!  this machine is the hardest one i have come across.. with the highscore being 349,000.  crazy hard.  us (us as in the royal me and my roomie, not the US) veterans couldn't even make it on the top ten.  pathetic.\n\na pub crawl between zeitgeist and here would be epic awesome.", "author": "Ge O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-22", "description": "Went here last night, Saturday, around 10pm. Had to pay a lousy 5 bucks just to get into a bar, which I ferociously dissaprove of. Bathroom sucks, place was dirty, and it was way too crowded. Couldn't figure out why it was so packed. Anyways, next time I'll save 5 bucks, buy a few 40s, and just stay home. My house is cleaner and I don't have to hijack the boys bathroom to pee.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-11", "description": "when i first moved to sf this was the first bar I felt at home in. long bar, a little dancfloor to get your 80s dancing on, plenty of cute girls. perfectooo", "author": "C D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-25", "description": "The drinks and even the drink specials are decently priced, the crowd is good and so is the stage area/seating. I like the movies being played in the background (conversation pieces if nothing else). My favorite part of this bar/venue is the photo booth. Best one in SF. I'm serious! High-quality, color photos for $3.", "author": "Tara R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "booty basement had my mine shaking into the wee hours of a sunday morning. the $5 tall cans of tecate helped me stay within my budget. very hip and I absolutely love the albums on the wall. I have no idea how I would feel about it walking in here sober  on a sunday afternoon, but i'd be willing to find out!", "author": "Caddy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "Wow.  The Knockout is pretty damn awesome.  And no, that isn't the \"Manberry\" talking.  Great drinks, great local feel, walking distance from home, and a Karaoke Gong Show on Sundays make this place my new favorite local bar.  Of course, I probably shouldn't be telling you this.  I should be keeping it to myself.  But whatever, we're all friends here, right?", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "i went last night to meet up with the wife and other fellow dogwalker friends after my boxing workout.\n\nparking is a bitch, but it's 29th and mission, what's new?\n\nthis place is a great bar!\n\nhere are some of the great things\n\n1) good beer selection\n2) nice bar keep\n3) girl comes in a plugs in her lap top to the sound system and it starts to play black lips \"good bad, not evil\"  http://www.myspace.com/theblacklips\n4) other people at the bar were nice\n5) bar keep will open bottle of the georgia corn likker and let ya have a taste for free\n\nnot really much else you could really want in a bar...", "author": "erik H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-26", "description": "thursday nights is bingo! buy drink = 1 bingo play card\nphoto booth. pool table. stage. insane decor. dance floor.\nthey serve hamms. and scooby snacks. (aka coronitas)\nthis place is the place to go if you MUST be surrounded\nby ONLY hipsters, and absolutely no marina or bridge and tunnel.\nonly locals and die-hard hoodies come to a place this far out.\n\ni love this place but damn, even the JT does not wish to travel so far.\n\nOne does not simply WALK into the mission. Its black gates are guarded by more than just crackheads. There is evil there that does not sleep. And the great Eye is ever watchful. It is a barren wasteland. Riddled with fire and ash and dust. The very air you breathe is a poisonous fume. Not with ten thousand men could you do this. It is folly!", "author": "JT X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "What do you get when the owner of a cool ass bar digs music and advocates for good music? A beautiful hum...not unlike that sound you hear when you're alone in an empty car on a silent street. Just pretend it doesn't drive you mad. Just pretend you don't know what it's talking about. Just pretend you don't like it. Just pretend. Just pretend.", "author": "Roy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-02", "description": "if you're still feeling unsure of what a 'hipster' is, head over to the knockout for hipster culture 101. yelp anthropologist-in-residence, jill k., investigates...\n\nat the knockout, you can see the hipster in his natural habitat: observing the traditional hipster way of dress, the hipster haircut/grooming methods, and you can take note of typical hipster ceremonial beverages (often includes fernet).\n\nthis is clearly a place with lots of regulars. even though i went with some friends, i still felt like an outsider. i went on a sunday night for the karaoke gong show. if you know me, you know i'm a karaoke junkie and that i love to get up and sing regardless of level of drunkness.\n\nthe way the karaoke gong show (KGS) works is that there's a panel of judges not too unlike paula/randy/simon. if you don't get gonged during your performance, the judges then rate you on a scale of 1-10. don't take them too seriously! there are definitely some inherent biases going on and they're not necessarily rating you based on skill or talent. if they're in a bad mood or have it in for you, they'll definitely rip you apart. ouchie!\n\nnice sized place with plenty of tables, couches, a pool table, etc. friendly and attentive bartender.\n\ni'd check it out another time if i were in the area, but wouldn't go out of my way to the outer mission just to hang out here.", "author": "Jill M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-28", "description": "Why has no one said anything about the Odeon????  I used to go see Dr. Hal there, and they have the twisted cabaret which is always a good time.  I love the eccentricity of this place.", "author": "Corie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "Love to dance here- racer 5 on tap is a bonus too", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-20", "description": "Free punk shows on tuesdays!!!!! one of the most amazing things a cool bar could do! i love this place.", "author": "Shon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "It smells bad, the service is alright, the drinks are okay, the photobooth is...present, and the location is just outside where I can easily access. And yet, the place rules. Really, it's my favorite. Monday through Thursday, there's so few other places I'd rather be. Thursday is Bingo night, and geriatric is just alright with me. The drinks are next to free. I've never left without a conversation with someone slightly drunker than myself; Go to the Knockout.", "author": "Alyssa v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-27", "description": "I was at Knockout Friday, and had my iPhone, all the cash in my wallet, and my bike gloves (??) stolen out of my bag. I didn't realize until after last call when they kicked us all out, and even after begging the doorman, I was not allowed back in to look for my items, and had the door closed in my face. According to the crowd on the street who overheard, things get stolen all the time at the Knockout and the staff are notoriously rude about it. When I called them the next day to ask if they found anything they laughed at me over the phone. Do not leave anything alone for five minutes there, and don't depend on the establishment to be on your side - they're unbelievably unhelpful.", "author": "Light E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-14", "description": "No matter how shitfaced I got the last time I was there, no matter how many chairs I knocked over, glasses I broke, beers I spilled or people I tried to fight or fuck, the folks at Knockout always let me back in, with open arms.  I love this place.", "author": "slayerela b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-04", "description": "Check it! The third Saturday of the month is a DJ event called the Booty Bassment. The best hip hop records are played & mixed by ultra talented DJs Dimitri & Ryan who pack the dance floor. Gotta knock a star for the heated conditions, they have a few fans but it gets mighty hot. Plus, only one girl's bathroom stall made me miss some good songs, dammit Knockout, I still like you.", "author": "Amanda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "Love this place.  Awesome live bands, oldies night, tecate, and a photo booth!   It doesn't get as crowded as the bars on 16th, so there's plenty of room to dance.  The men aren't aggressive here at all, so you can enjoy your drink in relative peace.  Plus, it's surrounded by late night mexican/El Salvadorean fare next door and across the street!", "author": "Tracy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-10", "description": "Excellent venue and bar -- cheap drinks, AND a photobooth is all included in this lovely package deal.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "don't care what kind of crowd hangs out there, it's cheap and has live music.\n\nawesome cheap burritos next door", "author": "kiki b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-26", "description": "What a great bar!!  I love, love, loved the Knockout!  We got there around 9ish on a Thursday for bingo.  Next time we know, we have to get there a little bit earlier.  But we had such a blast playing.  They pour the drinks here STRONG.  The bartender had me laughing.  He was a little rough around the edges and maybe a tiny bit drunk.  But he was great and added character to the place.  Oh, and the photo booth?!!  Awesome.  I felt like I was 10 and at a carnival taking pictures in there.  Everyone was super nice and friendly.  This is a great spot and I can't wait to come back.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-12", "description": "Fun dive bar... I'll probably edit this to five stars after I've gone to drunk bingo.", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "A friend of a friend suggested I go here when I asked where a good divey bar with good tunes I could go to. I don't know how it is on other nights, but I came here on a Saturday night and it wasn't really what I expected? I thought it was gonna be like the other bars on 16th & Valencia...\n\nSo I pay $5 at the door and enter a different scene equipped with live honky tonkin' bands and women clad in vintage 50's attire.\n\nOkay, so I kind of expected bands, but didn't really expect (or really want to) see rockabilly bands. Suffice it to say, they were great. Very good in their craft. Everybody was boppin' around the whole night. The place was a good size. They had an intimate-sized dancefloor and a stage for the bands. Sweet photo booth (good for those drunk-o pictures that everybody loves to take of themselves). The second band I remember, The Royal Deuces, was great. The lead guy was amazing at his chicken pickin' and tremolo pickin' on the gee-tar. Everybody was really cool and I didn't feel intimidated by anybody (given that it seemed to be rockabilly night and I'm from Orange County / Los Angeles where the scene here is saturated with idiots who'll fight anything that moves). So I was very surprised and had a great time. And the best part about it was their cheap-o drinks (and their names, \"The Bro-seff, Bro!\" or \"Absolut Manberry\"). What I was extremely excited about was that they served a Vietnamese beer called Brew 33. I never even knew Vietnam had their own beer (a little ethnic pride washed over me)! \n\nSo I'm sure that it's different every night and the night that I went shouldn't make it any different because I'm sure that there ain't no bad nights here. I'm sure you're always gonna get a great crowd with great service and great music. I will definitely visit this bar everytime I'm in town.", "author": "Anthony T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-02", "description": "I LOVE THIS PLACE!!! OBVI... I'm in their icon picture!!! No complaints. If you are looking to get off your butt, and have some fun...This is the place to do it!!!", "author": "Trump D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-19", "description": "A favorite local watering hole. This place has been getting better and better since it changed hands a couple years back. They got rid of the pool table (thank god), and switched the stage to the other side of the room (which makes so much more sense), and started booking decent events.\n\nOh except for the lame punk shows that seem to happen every tuesday. On such nights I always seem to end up walking down the block to the argus, quietly cursing under my breath.\n\nstill, they have pretty much everything you'd want in a bar. dancefloor, good selection of booze, photobooth (a classic party enabler), small stage, shitty soundsystem, cocktail galaga, plenty of seating.\n\n!LLOR SEMIT DOOG EHT LET", "author": "Aidan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "one of my favourite mission bars! heres why:\n\n1. Bingo! thursdays 8pm-10pm. you get a new card with every drink you buy, so you cane get really drunk and play like 6 cards! prizes are awesome too!\n2. The Broseff! the bartenders will give you a dirty look when you order this, and honestly, i think its only on the menu as a joke, but its THE BEST DRINK EVER! take one sparks in a glass, drop in one shot of citron vodka, and chug. \n3. soul night! \n4. booty basement!\n\ngripes? no air conditioning and that place heats up like an inferno! also, soul night and booty basement generally have the longest lines ever!!! if you go, go early.", "author": "Jaei P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-13", "description": "This place is Awesome! Great prices and cool bartenders(especially Dusty). Every Wednesday night they have a sushi happy hour from 6 to 8 thats hosted by one of the old chefs of Tokyo Go Go. He sells rolls for $4 and nigiri $3.  Best deal in town for the quality.", "author": "tim a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "hip hop booty shaking after some comfort food across the street? \n\n\nyes please.", "author": "tiff f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-26", "description": "the knockout used to be the Odeon, a smallish bar in the outer mission right near where mission and valencia cross. the odeon used to host all these burning man events and other artsy fringe weird bizarre interesting events. but now it's gone, and in it's place is the knockout, a chill hipster-ish dive-ish bar that has that typical mission bar feel. it's a pretty cool place to kick back and have a drink, but it's pretty far out there, and definitley not as original or interesting as the bar it replaced...\n\n(my resolution this year is to visit 50 new bars in SF.  read about it at: http://fiftybars.thisisvlad.com)", "author": "vlad k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-13", "description": "fairly cheap drinks and bingo thursdays!  great dive.", "author": "dan a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-15", "description": "Atmosphere, great.  Bingo, very fun.  Beer selection, pretty damn good.  Erotic photo hunt, what can I say.  Girls that sometimes take charge of the door for rockabilly shows, they can be mean. But it's still worth it.", "author": "JB S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-04", "description": "I never would have discovered this place had my best friend not moved a zillion miles away.  I'm so glad she did!  Great drink specials and prices, a photo booth to capture illicit behavior real-time and a very ecclectic music schedule.  I've seem a host of rockabilliy here, and recommend you check out www.hickswithsticks.com for simliar if you like a little Americana served with a tall boy Tecate.", "author": "Lady Ms. K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-06", "description": "Your lucky I can drink Hamms and can enjoy the Champagne of beers. I went last night to bid a good friend farewell on his journey to litter Venezuela with children of his seed. That said, enjoyed the vibe, drank with good friends and tip my hat at the decor. KnocKOUT two Stars for paying 5 bucks to get in only to realize that had I waited 10 more minutes, entrance would have been free. The band was obnoxious. The bar keep was cool enough to sound like a strip club Dj but not enough to earn the fallen Asterisks.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "friendly staff and stiff cheap drinks. always something going on, whether it be karaoke, bingo or a cheap show. cover is always low. awesome drink specials. can get a bit crowded and you have to smoke out front. other than those small details there isn't much reason to dislike this joint.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "Every Wed until 9, chef Ichi rolls his cooler into this hipster dive and makes great sushi. Delicious tuna belly.", "author": "chris o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "The Knockout is fun, comfortable and the drinks are good. Its it my favorite neighborhood bar even though I am not technically in the neighborhood. Booty Bassment is always a good time (SF or SD) but it does get a crowded and hot so turning from hipster to hoochie makes sense. Teenage dance craze is lots and lots of fun. DX has then best time spinning those records and seriously makes me want to jump back and kiss myself. Smiling, sweaty, fun.", "author": "kristen s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-01", "description": "I love that I can stuff my face with three carnitas tacos next door, walk over here and see a great show, drink some cheap beer (bartenders, ruling, esp the owner), take some bloated photobooth pics, then work up another round of hunger dancing to some oldies, and stumble back over to Cancun and eat more tacos. it's like a perfect sentence (albeit a run-on) punctuated by two spicy mexican quotation tacos...err, i mean marks.", "author": "Maris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "this was stop numero dos on a friday night, and being uninterested in the bar, i was won over by the music.  you know djs are doing an amazing job when you have no idea what song is playing but are still shakin' it.  on every song.  \n\nit was a refreshing change of pace from other snooty, overpriced options, and the fun-lovin' group of people on the dancefloor personified their motto of \"let the good times roll.\"  look in the mirror when you're waiting for a drink and you'll see what i mean.  but to the people from last night, leave the grandma-esque baby powder at home.  only breakdancers can claim that stuff as a dance aid.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-20", "description": "I'd like to thank the greater Yelp community for refraining from using any pun involving the phrase \"knock out\" in their reviews.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-23", "description": "Dig it.  My favorite local bar.  Nice bar, funky atmosphere, good beer, great bartenders.  I've seen some great bands here, and I've seen some that make my ears bleed.  Check out Bingo Thursdays.", "author": "John K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-05", "description": "I like their drink specials and their bartenders are really chill. I don't really dig a lot of the people that hang out here. But they have good events and music from time to time. I wouldn't say it's my favorite bar, but I don't really have any complaints about it.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "The vibe in this place is electric and the dance floor is insane.  I felt like I was was in a time warp, watching a dance session from the 50s.  Very San Frantastic and a hipster mecha of sorts.", "author": "Tony R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-07", "description": "I went here recently to see my friend's fabulously eccentric band Borts Minorts. It is a great space. Kind of divey, and comfy, but with all the amenities you might want. A pool table, photobooth (color), small stage, good bar, DJ (on Monday), and a funny crowd. I heard that it is popular with the Burning Man crowd, and all the dancers there did seem to be enjoying themselves with that Burning Man abandon. They have a great sign that I heard was drawn by one of the new owners, but I could be making that up.", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-29", "description": "I use to frequent the Elbo Room back when DX had rockabilly bands playing every Wednesday night.  Although I miss the spaciousness of the Elbo Room, the Knockout is a close replacement.  Cheep drinks, good tunes, but not a whole lot of room to dance.", "author": "Rachelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-02", "description": "photobooth, sit down ms. pacman arcade, and stiff drinks.\n\ni'm really tempted to give this bar a 5 star rating: the DJs are good (pink mountaintops AND liars?  yes, please), and the interior of the bar reminds me a little bit of Wild At Heart (this bar i love in berlin).  however, it's not within stumbling home drunk distance from my flat, so 4 stars will have to do.\n\ni heart thee, knockout.  p.s. stop booking lame bands.", "author": "Claudia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "I've had some pretty amazingly good times here.  It's really dark and definitely on the small size.  Most of the time, I can't handle the thought of so many people squeezed into such a tiny space, but they generally play pretty great music or have a rockin' band or two.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "Definitely my favorite bar in the city. Great events, semi-friendly bartenders, cheap drinks, and a photobooth with exceptionally flattering lighting (my friends and I always marvel at how great we look in those photos). Only complaint is that their tonic and soda water is usually substantially lacking in fizz, but after one or two, who can tell the difference, right? Right!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-22", "description": "last night i went to the knockout to watch my friends' band play (the aerosols--indie psych trio). bartenders were friendly and attentive for every drink...and it didn't take long to get drinks despite being a bit crowded. they need to get some air conditioning or something in there tho...it got HOT and stuffy. \n\npretty cool crowd...and the other band--the parties--were great too. the first band--the matinees--were decent...but didn't seem all that into their music, which makes it that much harder for the crowd to get into it. BUT, the lead singer was SUPER cute...so that def. helped ;) oh, and the aerosols closed with a sick cover of \"lucifer sam (...a tall young cat)\"--syd barret-era pink floyd. that RULED. \n\ni realize this is a review of the knockout and i'm pretty much talking mostly about the bands...but hey, isn't one of the most important parts of a bar experience what music's playing? of COURSE it is. rock out with your knockout.", "author": "dusty d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-02", "description": "Tons of different kinds of beers and the perfect place to meet your friends who've \"retired\" to Glen Park when you live in the Mission. \n\nI've only been there for the Godzilla Sushi night hosted by Timmy (ex Tokyo Go Go chef) on Weds night happy hour (6-8). Get there early though, his more popular rolls go early. He and his cohort Erin provide the friendliest service around. \n\nAnd, they have a nice little setup where you can sit in front of him, sorta like a makeshift sushi bar. Definitely try to sit in front of him, he'll have you laughing and choking on fish. In a good way of course.", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "Went on Sunday and it was a place where we will plan to go again.  We are new to the area and have been looking for a place with a cozy feeling and maybe some northern soul, motown and garage music might played.  We were all feeling good towards the end of the night.  The crowd was decent and drinks we reasonably priced.", "author": "Van E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-21", "description": "This place rocks. Kiren beer on tap, cheap happy hours, and PBR in cans, what's not to like? Oh, and bingo nights. All that is missing is some wings and this place would be perfect.", "author": "Hans H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-23", "description": "This bar is a microcosm of that which is San Francisco.  A burning man bar with amazing oddball entertainment, you can always find a 400lb woman in a blue sequin dress or a blood-fetish night.   Just...wow!", "author": "Anony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-16", "description": "I went here Saturday night for the first time; my date recommended it because he wanted to hear the band. I loved the band and the place. This is a very comfortable local bar that had good bartenders and nice customers. I plan on going again to check out Bingo night.", "author": "E P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-25", "description": "Chicken John done sold it.  We'll miss you Dr. Hal.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-21", "description": "Knockout is a large bar, nicely decorated inside.  They have live music here often that I hear is usually OK.  Happy hour prices are nothing to scream about, especially in light of the fact that it is so far out in the Mission (although I really like that area of the city).  The most redeeming quality of the knockout is their Bingo games, which are offered on Thursdays after 8 pm (or whenever it gets crowded enough).", "author": "Mr. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "The Knockout rules.  Good people, good drinks, good events.  Thursday bingo is awsome and they used to have a karaoke night on Sundays that kicked ass.  I'm not sure if they do it any more but the nights are full of good 60s R&B.  What more could you want.  A gem in the upper mission.", "author": "jason k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-22", "description": "bingo is rad, so is the bingo girl.  i go there cause its a dark cool lookin bar.  decor is cool.  rad old horror movies playing in the backround.  i'm so gay. i've never seen a band there tho as i really havent noticed any that intrigued me; and i dont really go to shows i have to pay for unless its friends or something i NEED to see.  mostly my roomies drag me there, but its not such a bad place to be dragged to.\n\nBooty basement is super cool!\n\nedited (01/22/08) -  i just realized how lame this review reads.  it should go more like this:\nthe knockout is i nice medium sized bar with a photobooth and a dark, classic monster movie decor.  bingo on thurs rocks as well as booty basement on the 3rd friday of the month.  my god i use the word 'cool' way too much", "author": "regan g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-02", "description": "I was at the Knockout this past Halloween. DJ Sergio Iglesias kept us dancing all night. The bar staff was friendly. The drinks were reasonably priced. We loved the photo booth and the films of go-go dancers from the 60's.  In addition, the crowd was super friendly and relaxed. The costumes were creative and I swear I didn't see one lame \"sexy witch/nurse/police officer in the bunch.", "author": "Kay O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-28", "description": "There is nothing \"hipster\" about the knockout -  Total nerds and dorks go here to tear it up - I do see the occasional hipster gang wander in, but they never stay long. (thank god - they can be such an eye sore!)", "author": "gem s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-01", "description": "Large Drinks, Nice Bartenders, Excellent music and dj's, check dx, and rye in the sky.  Probably the best city venue in terms of variety and quality of musical billing!", "author": "Zach H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-28", "description": "The non-douchebaggery side of the mission.  Like where latino's live and stuff and white kids hang out....oh wait, this is the next step to the great cleanse.  yikes.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-28", "description": "A cool place with cheap beer and good music, but, alas:\n\nThe most rude bartender in the world (the female one).\n\nAnd when I took a cherry from the bar, I was escorted out amidst cursing and hulabaloo.\n\nGeeze, guys, as soon as you told me to leave, I started walking. Why did you feel the need to scream at me and act all macho?\n\nWell, you've lost my business, and that all of my friends'.", "author": "B To The Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-18", "description": "Bingo on Thursdays is fun on a stick.  However, the band that was warming up before Bingo started sounded like nails on a chalkboard.  It was near impossible to have a conversation.  I'll forever love my squeaky chicken I won during the game, and will go back for more!", "author": "Trisha I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-29", "description": "When you have five bingo cards going and a couple beers the fun just gets better and better. I would tell you what night I was there (was it Thursday?) but the fact that I can't remember is probably the best sign of all. Every beer you get a bingo card and they have some good giveaways. Also on Wednesday they have a killer sushi night (I know but I eat Tamales from a lady that wanders around in the mission so I figure what the hell). The place is super chill and a lot of fun. Away from some of the mission craziness but still can get pretty rowdy on the weekends.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-19", "description": "5 Stars...Yes, 5 stars and justifiably so! This place from the times I visited, has a wide array of music that's both played live and record spinning by the DJ's. Lot of energy flows here with dancing and drinking. Nice decor and drinks that are served up well. Check it out!!", "author": "Tom W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-06", "description": "family owned and operated. great bartenders that put up with the worst of us drunks. i always have a great time at this bar. sometimes i ride my bike all the way from the richmond district just to get out to kareoke (sunday) or bingo night (thursday). AND it is a place you can almost always catch a great band before they get big and play some other shitty crowded bar. and by that time all the squares have heard the band and ruin it. knockout keeps it real.", "author": "Goober U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "Love this place. Always a good time. If you come on Wednesdays (early like 6-9ish) they actually have a sushi chef there making great rolls and such. Yum :) Bingo on Thursdays is also a good time.", "author": "r e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "i think this used to be the odeon bar(?)  i've only been to shows at the knockout.  a lot of my favorite bay area bands play here, and it is always a good time.  since they moved the stage over, it's a lot better.  there is a photobooth and cheap, strong, big drinks.  the bathroom is pretty clean for a bar too, which is a plus.  it can get REALLY HOT in there, which is really the only downside.  i love seeing bands at this place, and i am very curious to go to bingo night...", "author": "Kate W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-12", "description": "i came here for my birthday and i don't remember much of the night after 2 a.m. thanks, the knockout!", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-02", "description": "last night was BOB SEGER tribute night, and while my friend and i made the tough decision not to pay the cover to see tribute, i checked the crowd outside and peeped in and i feel i could dig this joint.", "author": "ms.kiki g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "seriously if you are going to keep having those hipster dance parties here,figure out a more room situation!", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-12", "description": "Nice little dive, saw the Prayers and the Muslims there this week, decent sound system, good tap list (Bear Republic Racer 5, among others), one of the closer Mission hipster bars to the Excelsior.", "author": "Noah E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-24", "description": "I went to Knockout for the first time last thursday night and I want to start by nominating the bartender for the \"BIGGEST DOUCHE IN THE UNIVERSE\" award.  I got my ID checked by a cute girl at the door (good so far).  It wasn't that busy so i didnt feel bad about asking the bartender if they had any lagers on tap.  He told me one I'd never heard of before and I asked how dark is it.  Now, I kind of drink a lot of beer and I know what lager is (motherfucker) it was a simple question that warranted a simple, straight-forward answer.  I asked because I don't really like the lightest lagers that taste like nothing. Is that a crime?  NO ITS NOT.  He stared at me and asked condescendingly  \"did someone check your ID at the door?\"  I said yeah, but his evaluation of my question as completely retarded pissed me off and I asked him bitterly if he wanted to check it himself. I handed it to him and he said:  \"I dont believe this ID\"  What does that mean?  It's obviously me.  It happens to be a Michigan issued one since thats where I'm from.  I stared dumbfounded and told the asshole to scan it, which he did.  HE STILL DIDN\"T BELIEVE THAT MY ID WAS LEGIT!!  He asked me \"when did they start issuing these\"  WTF?!  WHO KNOWS THAT?!  When did they start issuing CA IDs the way they currently look?  Douche-bag definitely doesn't know the answer.  I took my ID back and left with my three friends who had already ordered beers but no longer wanted them.  \n\nI'm amazed at this guy's false sense of authority which just ended up making him look like an ass, losing his owner money ( we collectively spent over $300 that night at the next bar we went to), and losing him a third of his tips for the night (that number is based on how few ppl were there when we we arrived at 11:30 ish).  \n\nAsshole bartender dude:   I know you are probably used to hipsters who only order PBR cans.  I just wanna say I'm really sorry that you don't know how to work the tap and have no knowledge of your beer selection or the term \"customer service\". \n\nMaybe you will have better luck there if you go.  Just shut up, don't ask questions, order a PBR and you'll be fine  ;D", "author": "Lauryn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "i love this place... best staff, cheap & strong drinks, music!\nnuff said.", "author": "layla s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-02", "description": "good dive bar.  cheap pints.", "author": "pauline e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-03", "description": "young, hip, casual bar. rather small but clean and interesting and last night was really crowded and really hot inside. i could see the moisture on the windows before i walked in. it was amazing feeling the contrast between standing inside and then walking outside. some bands were playing (which were really entertaining IMHO). had to pay 6 for cover; not that bad considering i stuck to the 2 buck hamms. the people were friendly but that night was just a little crowded, but there were a good ratio of girls to guys. three people stepped on the same foot and i was right up against the dividing wall. oh well that happens. but anyhow  the staff was pretty cool and attentive. i saw one that was constantly running around tidying up the place. kudos to her. i would like to go back and get stupid drunk if i lived nearer to it but its not really worth it if your coming from the east bay unless u got a place to crash in the city. also, parking sucks around that area, so if u want to catch a show, arrive early. oh yea...sort of hard to find if u haven't been there before, its literally at the end of valencia street. if you found the burger king there, its right across the street pass valencia.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-25", "description": "this place is my second favorite place, now actually the favorite since the other one closed. the owners, bartenders are the best. the music is always great. the sundays when they used to play all the trad. ska, reggae and rocksteady. oldie nights, soul nights. Bre is fuckin kool as fuck. i don't get in there as much as i would like due to my work, but when i do i love it", "author": "Ausewaldoe J."}
