{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "the ambiance is great here - we came in a big group and sat at the sushi bar. ordered some rolls, some toro handrolls, a few beers and sake and everything was amazing.\n\nservice was great. clean restaurant. i love sake. i love sushi.", "author": "Sang P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "I am a huge fan of sushi, I was in the area for Halloween so I thought I should check this place out.\n\nHad several nigiris, including all the bellies except toro and a tango roll. Bellies weren't as fat as I would like, but at least it was fresh. Didn't really like the tango roll, not much fish and not much flavors, felt like I was eating rice.\n\nDidn't eat a lot but it was $50 per person, so watch out if you are on a budget", "author": "Jas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "Omakase\n\nYea, this place was pretty good. I think the Yelp's 4.5 stars is fairly accurate for this place. \n\nI really felt like the sushi chef was taking me on an interesting tasting experience as he prepared the omakase. I appreciate that he gave me 1 piece at a time, and made the effort to explain what he was serving. Very creative, and delicious. \n\nThe only reason this isn't a 5 star was when I ordered the uni. Man, I was so happy after my meal, and wanted to finish it off with uni - but then I bit into it. There seemed to be some kind of salt rock (?) in the sushi. I did notice that it was prepared by a different sushi chef, but I'm not sure if that's necessarily a matter of preparation. \n\nAll in all, would definitely come here again for the omakase.\n\nService was excellent. Very attentive wait staff.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-07", "description": "Not bad but I would expect a little more for their 4.5-star review on Yelp. Ordered some regular fish and thier bellies, all nigiris for comparison. By the way prices were around double for the bellies. Unfortunately the bellies weren't worth the money, very subtle difference between salmon belly and salmon, same thing with yellowtail and trout.", "author": "Teresa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Came here on a Wednesday night and there was no wait, though your whole party has to be there before you're seated.\n\nWe sat at the bar and really appreciated how the chefs and waiters would recommend particular types of nigiri to try. If you like stronger tasting fish (e.g. mackerel) I highly recommend the butterfish! \n\nWe also ordered a scary salmon roll and a haunted hey girl roll (they just changed their menu to reflect a Halloween theme) which were ok but I think you should just get the nigiri if you come here.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Loooove this sushi spot not only for the sushi but also for the Izakaya style dishes. Very hip interior and the staff are friendly. But also a great place to eat Japanese food! The sake is also delicious.", "author": "Ayumi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Love this new hotspot! Came here when they first opened. My cousin brought me here before my surprise birthday party and it was so much fun.\n\nThe staff here are so stylish! Total trendy Tokyo vibes. We went all out on sushi and sake. There was a a wait when we arrived Saturday night but we were able to order sake first and drink it at the standing table. \n\nNever thought the service was slow. Chefs choice nigri combo is for sure the way to go. Can't wait to come back!", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Absolutely loved it here. I was craving sushi and this popped up on my yelp suggestions.\n\nI ordered the chef's choice nigiri combo and I fell in love. The detail behind presentation and taste was spectacular. Every piece melted in my mouth so nicely. The tenderness and different flavours of each piece of fish was just amazing. \n\nService was great too! I sat by the bar and the chef was extremely friendly.\n\nI will be back for sure the next time I'm here!", "author": "Frances C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "We tried the salmon and it was fresh and delicious. Other rolls were great too. The miso soup was really delicious. I wish they were not closing in middle of day! This place is great to hang out with friends or take a date. Awesome spot, great food.", "author": "Mahrad M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "The food is fabulous. Service now so much. \n\nI had the haunted girl and gruesome great balls and they were similar my amazing. \nWhat wasn't was the way to order. I understand it's a Friday night but bring the help, turn over customers and make money. \n\nI recommend this place.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Boutique cute sushi restaurant. Went on a Sunday night for dinner date of 2. Either bar or table sitting. Wait was ~25 minutes. Sat at the bar and enjoyed cold sake, edamame, cucumber salad, and two specialty sushi rolls. This is probably the best quality sushi I have ever had. Half baked roll and Kuma roll. Excellent taste. Definitely recommend this restaurant. They do not take ahead call-in reservations so expect a wait if going for dinner.", "author": "Jasmine O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-09", "description": "Waited 45+ min to get a table on a Monday. Went to a nearby bar. After ordering took another 30-45 min before we got our rolls. Rolls tasted okay but did not have enough fish on them. For the price we expected way more fish. Pieces were also cut smaller than normal. \n\nWait staff were nice. If I went back would only order nigiri.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "Absolutely incredible. Some of the best sushi and Japanese food I've ever eaten. Super talented and creative guys in the kitchen. 8 stars out of 5. Run, don't walk to eat here.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "As for the food it's excellent sushi for the price. We love the half baked and great balls of fire. We always get the amaebi and the seaweed salad. Miso soup is excellent. \n\nThe service is still really slow. They need to get like 1-2 or more waiters because the one that's trying to serve the entire restaurant can't really check in often enough. \n\nIt's a great neighborhood spot and we definitely will be back again.", "author": "Yasi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "I'm too busy enjoying the best sushi I've ever had (for like the 20th time) to detail this review. \nJust t r u s t.", "author": "Drew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "This is the first time I have been to Kuma! I've passed by it many times and finally decided to grab a late dinner there. It was surprisingly busy for a Thursday night at 9pm (they close at 10). Actually had to put myself on the waitlist. They have a standing tablet that you sign in on to get on the waitlist. It's really nice because you can see who is in front of you and how many people are in their group. It gives you a pretty good idea of wait time! They also text you when your table is about to be ready. \n\nOnce at the table, we had great wait staff and got to enjoy the ambiance of the small (but well designed) space. They had a couple Halloween decorations up and their menu was even Halloween themed! They didn't over-do it though and it was very tasteful and cute. I enjoyed the extra effort and creativity that went into naming some of the rolls. \n\nThe food all tasted very fresh and had crisp flavor. We started with edamame, miso soup, and the seaweed salad. I would definitely say the edamame was over salted, but maybe that just my personal presence, as my partner didn't mind. I would definitely recommend the miso soup and the seaweed salad as starters. \n\nFor main course, my partner got the nigiri tasting which was good. We also ordered the \"scary salmon roll\" which was very fresh and had nice subtle lemon hints. Then got the \"hellish half baked\" roll which was a little disappointing. It just didn't have a ton of flavor for having such great ingredients. I didn't even taste the crab in it, but there was a lot going on in that roll as well, and it is baked so the flavors mix a little. \n\nFor desert, I got the \"unearthly ube\" ice cream (per the recommendation of our waiter) and it was perfect! It was sweet but also tasted very natural. The sweetness wasn't overpowering, and the portion size was perfect, it made for a great end to the meal. \n\nOverall, this place exceeded my expectations. The check in service was refreshing and smooth, the food was good, the wait staff was attentive and helpful. I'll definitely visit again!", "author": "Tessa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "We have been here a few more times since their opening a year ago. Here are my thoughts:\n\nDinner is definitely a lot busier. The service drops down a bit and feels like the wait staff is short handed. We had to wait a lot longer to place second round of orders, get the bill, or have empty plates taken away. \n\nLunch: Slower and more mellow time to eat here. The lunch special increased price from $15 to $17 over time which is still a pretty decent price for the special. If I'm going to be particular, the portion size of the salad has gotten a bit smaller and I don't get mushrooms in my soup. Regardless it's not a deal breaker for me. It's still a nice side for the meal and presentation is still nice. I really like all their combo options and chirashi bowl, but the sushi combo is probably my favorite. \n\nOne thing that I do wish is they offered tempura as a side. They only offer it as a complete lunch set for $17. I asked the server if I could order side of mix tempura and he said they don't do that. And that was that. Kind of a bummer and also a loss of $8 or so that I would have been willing to spend for a small appetizer portion of mix tempura. They seem pretty set in their ways for only what the menu specifies and offers. Maybe they have a set portion aside for lunch specials though, so I could see that. I just see it as a missed opportunity for more profit and offering on their end. They could simply even charge a little extra as an add-on to the specials.\n\nTake out: I know from the beginning they didn't allow take out orders and don't know if they still officially don't do take out, but for what it's worth I did see someone at the bar place take out and leave with a take out order. So maybe it's limited take out?\n\nSo.. Is it the best sushi in SF? No. And service was a whole lot friendlier when they first opened.. But I will say it's still good, fresh, with ok prices, and the location is really the ultimate convenience for us with a lunch and dinner offering that will keep us coming back when we don't want to venture out to the marina for our favorite sushi spot.", "author": "Natassia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "The food here was actually quite good and pretty affordable for being in San Francisco. We didn't order any of the nigiri but the chef looked like he did a good job with it and was explaining it pretty well to the party next to us.\n\nWe ended up getting a pair of sushi rolls, the half baked and the something explosion. Both were delicious. \n\nThe half baked roll was the standard creamy baked salmon one, which was pretty good though a little sweet. \n\nThe explosion was like deep fried sushi with some hot sauce in addition to the unagi like sauce on top.\n\nI'd probably be back to try some of their nigiri or other delectable items!", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "\"There's this great place close-by. It's like Omakase quality but not at Omakase prices.\"\n\nMy Lil and I ended up waiting a good 30 minutes, on a Monday night, after bumping into each other at the gym.\nI could feel my hangry levels starting to escalate and wanted to suggest going to another place to dine, if it weren't for what she said.\n\nWe noticed that they had an extensive selection of alcoholic beverages to choose from, which ranged from wine, shochu, sake, and beers. They also appeared to have a daily menu, as noted by the day printed with ink, as well as a menu with all their classics.\nBetween the two of us, we shared a Shishito Peppers ($7) and a Hamachi Ponzu ($14) small plate. She had the Osuimono (5) and a 4-piece Nigiri Tasting ($18). I had a 8-piece Nigiri Tasting ($36). We also ordered 2 carafes of different cold sakes that she selected. Each carafe was able to serve around 5-6 shot glasses of sake.\n\nEverything was fantastic.\nThe Shishito Peppers were a delight to see on the menu, with a couple of ones having fiery pepper seeds (probably not the best for people who cant handle heat). The Hamachi Ponzu was pleasing to the eyes and had 6 nice cuts of yellowtale, tamago, and green onion for décor. The sakes paired very nicely with everything. The nigiri, which my Lil told me was the thing-to-get, as if there were only one, was fantastic - fresh, melt-in-your-mouth, flavorful, and did not need anything else.\n\nIt was a great experience and well-worth the wait, even after an intensive gym sesh.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "After this meal I realized I could get 80% of the pleasure of omakase for half the price. Good sushi is still expensive no matter where you go, but the prices at Kuma are reasonable considering the quality. Just know that they don't take reservations and you can expect a long wait. You can put your name on the waiting list and take a stroll outside until they call you. \n\nEverything was fresh and the rice texture was on point.  I especially enjoyed the Hokkaido uni, hotate, salmon belly, and tobiko nigiri. The only thing I wish was done differently was for the escolar to be served completely raw, rather than soaked in lime juice as escolar ceviche. A friend and I ordered the nigiri dinner, sashimi dinner, as well as the uni, hotate, and tobiko nigiri, and we each spent $54. I was so happy and I know I will be back soon.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "Came here for a late lunch by myself. The place was hard to find because the location on Yelp was a little off and their sign isn't big. After walking around the intersection, I found their sidewalk sign. Inside is small and narrow, but nicely decorated. The sushi was high quality and delicious. I got the chiraishi bowl and 2 pieces of sake (my favorite). The chiraishi bowl had a lot of filler and maybe only 6 slices of fish. If I go again, I'll probably stick with the sushi lunch special. The meal came with a complimentary kale salad and a miso soup. Even though the place was pretty empty, the chef was busy with a large catering order so my salmon sushi took awhile, but they were nice enough to give me a complimentary uni sushi because of the wait.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "Big fan of this restaurant, everything we had was very good. Magic mushroom roll was my favorite, nigiri also recommended and hamachi Kama. Sashimi omakase would not order again. Also get the ube ice cream. Service is a bit slow but they were at full capacity when we went (8pm Thursday)", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "There is no sign out front so you can miss this place real quick. They don't take reservations. Small space so be ready to wait a while. They do serve you drinks while waiting. Food is amazing! Everything, and I mean everything, was heavenly! Service was fast and on point. Please eat here. You won't regret it.", "author": "Brenda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "We were here around 1230pm on a Saturday, and we've been here for dinner several times in the past. I applaud Kuma for their fresh, high quality, and delicious sushi that makes you smile on your first, second, and last bite. Quite simply, this place has had the best sushi I've had in SF, everytime I've been here. To top it off, there wasn't a wait for lunch which makes me feel smug at all the other yuppies who are waiting 1 hour+ for mediocre brunch places nearby. \n\nThe four of us got seated quickly and had to hold back from ordering everything on the menu. The restaurant is quite small so I wouldn't recommend coming with a group bigger than 4.\n\nThe miso soup and seaweed salad was a great start. The soup was light and had just the right amount of saltiness. The seaweed salad was juicy and refreshing, with a nice tangy aftertaste.\n\nFrom there, we ordered the chirashi bowl and kuma poke bowl, which is only available for lunch. Both were fantastic! In particular, the kuma poke was more interesting than typical poke and didn't rely on heavy sauces for flavor.\n\nFor the main course, we received the great balls of fire, california roll, rainbow roll, tango roll, and shrimp tempera roll. \n1. Great Balls of Fire got mixed reviews from our table. I thought the battered, warm texture was a great contrast to the rest of the sauces & toppings. It was my favorite for the day. Others thought it was the weakest link. \n2. The California Roll and Rainbow Roll are the best I've had in San Francisco. They use real crab instead of imitation crab, and that makes a HUGE difference. \n3. The Tango roll perfectly balanced the strong flavors of mango, tuna, and chili. Given the strong flavors, I wouldn't get this roll just for myself, but it was a fantastic roll to share in a group. \n4. We actually ordered the shrimp tempera on accident. We typically don't love shrimp but alas, a miscommunication landed us with a surprisingly delicious and upscaled version of the typical shrimp tempera you'd expect from a sushi place. They somehow made fried tempura feel healthy and refreshing by adding a light, crunchy lettuce and a delicate sauce.", "author": "Yuchen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Great neighborhood sushi joint. We love coming here for a date night or to have lunch on a lazy Sunday afternoon. The staff is always friendly and welcoming. Food is consistent and of good quality. I love the deluxe chirashi bowl. It's a great value, featuring plenty of my beloved uni, hotate, fresh ikura, cuts of tuna, salmon, fluke, crab and a few others. We love to get the tempura baby octopus. The batter is perfect! It's light, crispy and isn't oily at all. We always end the meal with a few pieces of nigiri. The favorites include amaebi + fried shrimp head, monkfish liver (ankimo), scallops (hotate), sea urchin (uni), Scottish ocean trout if they've got it (so rich!).\nHead over to Kuma Sushi and grab a seat at the bar, you won't be sorry.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "My new favorite sushi spot in SF! Loved the cozy-ness of this restaurant and service was great. We walk in on a Sunday evening and snagged the last table available vs. waiting for the bar. However, after a couple seats opened up at the bar, the server kindly helped us move. \n\nThey offer a simple menu of starters, small plates, a la carte sushi/sashimi, rolls, and tastings. Kama is their only cooked fish dish. They also have a decent selection of sake. My favorite was Kikusui -- well balanced with a caramel after taste.\n\nWe sat right in front of John, the sushi chef. We watched him work his magic and whip up our sashimi and nigiri tastings. The fish varies in the tastings, depending on what's the seasonal selections for the day. The fish was very fresh and I liked how he put a coat of soy sauce on our nigiri and a small topping on the pieces.\n\nWe enjoyed getting to know John and he really made our experience wonderful. He even threw in toro pieces and sake on-the-house. The only con was that they made a mistake with our order and brought out the 4-piece nigiri tasting, instead of 8 pieces.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Just found my new favorite sushi spot in the city! The quality of the fish is comparable to fine dining omakase restaurants in the city for a fraction of the price. Not only was it tasty, but the presentation was beautiful as well. We sat at the bar and the chef was very friendly. Things we ordered:\n\nHamachi Collar: 5/5 - perfectly cooked and juicy inside with delicious ponzu sauce \n\nSashimi tasting (10 pieces): 5/5 - wow, every piece was delicious. The albacore was especially buttery and rich in flavor + texture. Also the plating for this was gorgeous. \n\nNigiri tasting (4 pieces): 4/5 - came with tuna, butterfish, sakura trout, and one more thing I forgot. Each piece was specially prepared. The trout was my favorite!\n\nHalf baked roll: 4/5- comes hot and fresh out of the oven! I like how they don't overdo the mayo and the salmon and crab were good.\n\nAlso get the ube or green tea ice cream- the scoops are huge!", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Omg go here. Since moving to SF, I've been on the hunt for a place that's delicious but not unreasonably priced. This is it. \n\nThe wait was about an hour for the weekend dinner rush, so be prepared. I appreciated that unlike most sushi restaurants, they'll actually call if you add your number to the list. This allowed my friend to to grab a drink elsewhere while we waited. \n\nThe atmosphere and decor were comfortable and given how many people were both eating and waiting it still felt intimate. Service was swift which I didn't mind as it gave us more time to catch up.\n\nWhat I ordered:\nSake flight - Delicious and reasonably priced.\nNigiri tasting - I'm not a big fan of shrimp nigiri and they were super accommodating by removing it as an option. Also would order this every time, so flavorful. \n\nWhat she ordered:\nSweet potato roll - So delicious and they have a bunch of other vegan options, too. \nSpicy tuna roll - Nothing to write home about\nEdamame - Also standard\n\nReally worth checking out. Like now.", "author": "Capers B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "So glad I gave Kuma Sushi + Sake a second chance. \n\nI knew I had to give this place another try since the food is solid. I've tried both the sashimi and nigiri tastings and have been impressed both times. Of course, there's going to be pieces you like/dislike but overall the variety is good. \n\nPrices are reasonable/borderline on the pricier side for some things. I prefer nigiris and ordering only that will definitely add up. The quality is there, though. \n\nIf I wrote a review for the first time I went here.. it would not have been pretty. They were sOooO busy, I think we stayed close to two hours?! Food took F O R E V E R. We were sitting at the bar and were watching all the sushi sit there because the servers were too overwhelmed to bring the food out. Not good.. BUT SO GLAD THAT DIDN'T HAPPEN AGAIN. \n\nVery small and cozy spot, they don't take resy's. It was still very busy, but the service improved tremendously! I knew I couldn't give up on you, Kuma Sushi + Sake!", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Let me start off by saying I am a sushi snob and a fanatic! Of course I found this joint because of Yelp and it was right down the street from the movie theater which I was coming out of.\n\nI don't often get five stars on Yelp but here's why I did for Kuma:\n\n1. The beauty is in the details. \n- hand crafted wooden chopsticks that rear on a wooden fish so you don't have to get the tips dirty.\n\n2. The Atmosphere.\n- plenty of space at the bar to watch the chefs make you fresh sushi\n- cool music to make you feel relaxed\n- those white \"Christmas-like\" lights to give it that special look.\n\n3. Service.\n- Matt (my server) was on top of asking me how I was enjoying my meal.\n- my water was filled just when it was getting half way empty.\n\n4. Quality of sushi.\n- I tried the Sweet Potato Roll and it was everything I was hoping it would be. Warm on the inside and super tasty. \n- I also had the Fresca Roll- spicy tuna, pineapple, and avocado topped with ceviche. All I can say is \"wow\"! The sweetness of the pineapple combining with the spicy tuna creates a wonderful cognitive dissonance in your mouth that leaves you surprised and feeling adventurous.\n\nThey have only been around for 6 months, but Kuma is a strong contender for high quality sushi that will give all the competition a run for their money.", "author": "Jeremiah Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "This place in incredible. I came here for a birthday lunch, so it was a tuesday around 12:30 and there was no wait, however we got the last table so I can imagine there being a wait even on weekdays, considering this place is fairly small. \nTo start, we ordered the great balls of fire, and we thought were great, but just air on the side of caution as they are a little on spicier side. We also tried the salmon sake nigiri and it blew me away. The fish quality is spectacular, and even my brother who does not eat sushi was into this. For his meal, my brother ordered a poke bowl and requested crab as an add on, he really enjoyed his bowl. \nI ordered the Hey Girl roll and it tasted super fresh, the place has a modern interior, with lights up and the service is great 5/5. I wish I lived closer to this place so I could go more often! \nThere was also no sign outside with the restaurants name, so it may be hard to find if you weren't aware of it. It is also in the tenderloin so just remember to be aware of your surroundings if you're walking around near the restaurant!", "author": "Noor H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Our group of four were craving sushi one night and wanted to get out of Mission, so looked up sushi spots open later than 7PM. That was a hard search, but we were happy we found Kuma...eventually.\n\nSo Google Maps says Kuma is on the Post side, so make sure you stay on Polk! We walked in and were pleasantly surprised at how sophisticated yet simple this place felt. There was definitely an air of \"craft sushi\" noticed right away with their beautiful bar and ceramics displayed at the entrance. The restaurant itself is tiny and does not have too many seats (can probably only seat 4 smaller groups at tables and a few couples at the front window, and some couples and solo eaters at the sushi bar. All the designers I ate with marveled at their ceramics and aesthetics. \n\nI started with their small house hot sake, and they seemed to actually have more cold sake options vs hot! Surprising, since I'm a hot sake kinda gal. Bf got a beer, and the rest had hot tea. We were hungry, so started with the edamame, shishito peppers, and beautiful steamed egg custard in a gorgeous egg-shaped container (presentation is 100% here), a few sushi rolls: rainbow (my go-to), hey girl, and half-baked. They almost forgot our chawanmushi, but we reminded our servers and they brought it out in a few minutes. The sashimi cuts themselves on the special rolls were delicious and fresh, not too large, and definitely worth the prices. \n\nI'm excited to see if they will expand their special rolls because their nigiri prices are way too costly for my wallet. Our bill did total over $100, so each person ended up paying almost $30. Not a pricey feat in SF for sushi, and this place has clean restrooms and a homey kind of feel. I am still holding on to my South Bay sushi pride, as I think the South Bay does the same prices for thicker and phat-er cuts of sashimi and more creative selection and variety of items.", "author": "Jodi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Man, I love this place! As soon as I sat down at the sushi bar, I told my husband, \"I want to become a regular here.\" Awesome quality fish and relaxing, unpretentious vibes.\n\nI've been meaning to try Kuma's lunch specials for a while now, and I was so pleased! I ordered the chirashi deluxe (costs extra for higher-end additions like uni, scallops, etc.) and my husband had the open-faced dragon roll over rice. Everything was really tasty. Lunch specials come with a delicious mushroom miso soup and kale salad, too.\n\nHowever, I'd probably do the regular chirashi (almost half the price of the deluxe) and order a roll or tempura to supplement next time. Everything being made behind the bar looked delicious. Really want to come back again and again.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "One of my favorite sushi spots in the city! The food is fantastic and the service is amazing as well. We sat at the bar and ordered nigiri from Chef Rio, who also kept us entertained the entire night. The fish is really fresh and the prices are reasonable! I will definitely be coming back!", "author": "Helen z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "Food : 3/5\nService and atmosphere: 5/5 \n\nI really really wanted to love this place. Their miso soup and kale salad were really spectacular. Can't describe it but their miso soup had a lighter base but still rich in flavor. \n\nI was a little disappointed with their sushi though. I got the shrimp tempura roll and the baked one. The shrimp tempura roll was served with a bitter and weird tasting lettuce and had so little avocado that I could barely see it. The baked roll fell apart completely no matter how I tried to take it out of the foil. I didn't think the baking added a lot to the roll, actually made the fish on top a but over cooked in my opinion, and would have been better torching instead for a smokier flavor while keeping the fish half cooked and half raw for better texture.", "author": "Terrie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Haven't had sushi this good since Tokyo. Could not recommend more. Get the walu nigiri, it tastes like a field of flowers looks.", "author": "Alx N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Everything was incredible! Went in there for dinner and sat at the bar where I had the pleasure of speaking with Corey. Ordered the Kale salad and was blown away by the dressing, then got a Tango roll but we were just getting started. Their trout belly is unbeatable but trying Monkfish liver for the first time at Kuma was the best dish by far.\n\nHighly recommend sitting at the bar for anyone that visits.", "author": "Simon R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-04", "description": "Nigiri and sake were good, but the service was atrocious.\n\nPros:\n+ Sushi bar available\n+ Quality fish\n+ Friendly service\n+ Affordable/reasonable prices \n\nCons:\n- 30 minute wait for nigiri at the sushi bar? Hell. No.\n- Sake order completely forgotten\n\nIN LENGTH:\nWe were seated promptly at the sushi bar on a Friday night (11/03/2017), but the half hour wait for food and drinks afterwards was absolutely awful. We watched as the confusion of orders unraveled behind the sushi bar. I guess our omakase or nigiri sets were mixed or missed. Thankfully, my friend and I had a lot to catch up on until that 30 minute hunger mark hit.\n\nI'd return if I were in the area, but it's nothing special. Hopefully, they'll be a little more organized next time.", "author": "Fanny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Been here 5 times over a 2 month period. Food quality has always been consistently amazing. The two of us normally share 2 rolls, 2 appetizers, a beer (the Orion beer is big enough to share), and sometimes 2 orders of sashimi/nigiri. \n\nVery interesting and creative rolls and very friendly staff. \n\nWe order the Magic Mushroom roll every time and just can't have enough of it. See picture for reference. \n\nHope they will have more dessert options in the future.", "author": "Morgane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-18", "description": "The sushi is incredible, but expect frenzied/absent service and an incredibly long wait.", "author": "Chef R G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "Fine dining.  Good job by Kuma Sushi and Sake. It is a good spot especially for a date.  The rolls are freshly made.  The utensils are very nice.  Definitely quality over quantity.  Didn't have an issue with the salmon roles, volcano , philly, half baked and kuma roll all superb.  Maybe I'm being  a tad bit petty and its nothing personal (or maybe it is).  The wait was long AF!  It was about an hour and that may had been the only knock.  Not a big place, very cozy in there.  Good Crowd.  A place I would definitely try again.  \n\nGrade: B", "author": "Steve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "This is a long overdue review that I meant to write several months ago.\n\nI'm going to leave this review as a draft for now as I absolutely adore this place. Until next time, soon Kuma Sushi. I'll be back to leave a thorough five star review as it deserves.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Wowie, talk about fine dining! This place is superb for a date night or group outing (maybe like 2 groups tops since it's a small place). We came here before our night at the Regency Ballroom and twas spectacular! \n\nIt's definitely quality over quantity here. We ordered the Great Balls of Fire, a special roll that came with a bit of tart lemon-y sprinkle over each bite (forgot the name woops but it had more of a latin style to it), and hamachi crudo as a small plate! We also ordered the sayuri cold sake which had a creamy, light, and smooth texture. Small lil thang but packs a punch! \n\nWe loved the Great Balls of Fire although tiny tiny that I felt maybe it should be considered an appetizer/small plate. Its deepfried in what seems to be a wonton like skin slathered with a whole bunch of sauces but their house sauce really stood out the most. The sushi roll we ordered was made so well with fresh fish and a lil savory crunch in each bite! Definitely will go back for a second round.", "author": "Jia Qi F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Caught up with a friend recently at the newly opened Kuma Sushi on Polk St.\n\nWe came for dinner a little before 7 pm on a Thursday, and there was a large group in front of us waiting. We put our names down, and after being told it was a 30-45 minute wait, we left our number and decided to go to a bar nearby to kill some time while waiting.\n\nWe ordered a couple rolls along with a couple small plates and nigiri to share.\n\nMasu toro ($9) - the ocean trout belly tasted okay but not as fatty as I was expecting\n\nAmaebi ($8) - the amaebi here was pretty standard, i.e. it was melt-in-your-mouth good! one of my favorite nigiri pieces at any sushi spot\n\nTamago tofu ($10) - chilled version of chawanmushi, which is a savory egg custard. I love chawanmushi, and while this was good with the ikura topping, I wish it had been served warm\n\nHalf Baked ($14) - essentially Kuma's version of the lion king roll as it is a crab and avocado roll topped with salmon, green onions, tobiko, spicy mayo, and baked. This was my favorite dish of the night!\n\nKuma Roll ($14) - sweet potato tempura topped with bbq eel, roasted almonds, and unagi glaze. We ordered this because 1) it's the restaurant's namesake roll and 2) I was intrigued by the sweet potato tempura, but all the flavors mixed in my mouth and it was hard to taste the sweet potato and eel\n\nThe space is very small and intimate. It's dimly lit (see how my photos turned out...) and would make a nice date spot. I would recommend coming in a smaller group, maybe 2-4 people, though there was a group of 12 that was celebrating a birthday and the restaurant managed to make it work.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-08", "description": "I am a Japanese and really glad to find a sushi bar which is open at noon but after I try it I feel so disappointed..there is a fish bone in the sake toro and I tell the waitress he seems don't care at all...I spend like $70 and this quality is really NOT worthy!so...never come back here again:(", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "I went to Kuma's Feastly pop-up before they had a brick and mortar spot and was hooked from the start. Chefs Ryo and Cory have collaborated for a long time on the SF sushi scene and that partnership shows up in spades at Kuma, right on Polk and Post. When your options in the area are fast-casual, bar food and pizza, it's a godsend to have a neighborhood sushi spot. \n\nThey have a rotating seasonal menu but the stand-outs are as follows:\n\n- Chawanmushi: Ok, it's not sushi but this is a silky, savory egg custard to beat all egg custards. It's spiked with the latest batch of housemade fish broth and you'll want to get your own to catch the scoops of cheese, crab and mushroom speckled throughout. Bonus adorable egg vessel. \n\n- Ankimo anything: Even for avid sushi addicts, monkfish liver might be a new adventure for you. It's underrated and shouldn't be. The texture and flavor is unique and it doesn't need any embellishments to make it shine. \n\n- Kuma Roll: Any namesake roll is going to be a smash and this one doesn't disappoint. Unagi and sweet potato tempura is a match made in heaven. \n\n- Hamachi Kama: Get at me Japanese yellowtail collar. The ponzu sauce is super light and the fish tastes like fresh ocean dreams. \n\n- Magic Mushroom Roll: This one's a specialty \"sometimes\" roll with tempura mushroom that just gives and gives. \n\nP.S. Kuma means \"bear\" in Japanese. It's fun to see how that comes to life subtly in their menu logos and in the bathroom decor. :)\n\nP.P.S. Go solo at the bar counter, break nori with a friend or date, and enjoy a small group outing. Not meant for big extravaganzas though.", "author": "Faith Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "I love sushi but my wallet hates it.\n\nYea, there's plenty of \"cheap\" pseudo Japanese restaurants in San Francisco like Kiki and Kitaro. And, you can REALLY get your money's worth a la FREE DETOX! You may break your toilet but hey, at least you're 10 lbs lighter by the end of the week.\n\nOn the other end of the spectrum are high end omakase places that are popping up all over SF. Most are good but not practical for everyday eating. \n\nEnter Kuma Sushi + Sake. \n\nThey serve great quality sushi at reasonable prices. It's a solid neighborhood sushi bar (NO reservations) where you can regularly get your raw fix without having to eat Nongshim ramen bowls for the rest of the week. \n\nThe dinner menu has starters, tasting spoons, salads, small plates, sashimi, nigiri, maki rolls, specialty rolls, and dessert (Mitchell's ice cream): http://bit.ly/2wAFKge. There's a daily specials menu showcasing the fresh fishes for the day: http://bit.ly/2v2lXqp. There's also a nice curated sake list with nothing over $18 a carafe: http://bit.ly/2x9jXtS.\n\nDuring the soft opening, I visited for lunch which has a limited menu ($12-$14): http://bit.ly/2wvk9H2. All orders come with a housemade mushroom miso soup and a salad which is a steal!\n\nI decided to go with the Chirashi ($14) and while waiting for it, I was presented with a Daikon & Wakame Salad: http://bit.ly/2wkpb8B. It was crisp, refreshing, and had good umami from the bonito flakes. A large cup of Mushroom Miso Soup soon followed: http://bit.ly/2vlNezD. I usually pass on the miso soup from restaurants as it tends to MSG water but this miso soup was really clean tasting (not salty) with cubes of silken tofu. \n\nMinutes later, I received a beautifully assembled Chirashi: http://bit.ly/2xpK8Mu with 6 slices of neta and ikura over sushi rice. Everything was fresh and high quality for the price. My favorite was the sake toro as it was super buttery. The sushi rice was nicely seasoned and had the right temperature. \n\nFor $14, you get a good amount of food and I was full. That's until Ryo showed me a tray of Santa Barbara Uni that he just got in and I couldn't resist. I also ordered a pair of Uni Nigiri ($14): http://bit.ly/2v2m8lO. I'm glad I did because it was so good. The uni was sweet, briny, and deliciously creamy. \n\nI washed everything down with a small carafe of Toji-kan sake ($9). Just don't tell le boss. \n\nThe owners Ryo (formerly Domo and Pink Zebra) and Cory did a phenomenal job transforming the seedy Western Union space into a very inviting, contemporary, and zen space. There's only 12 seats at the sushi bar and a handful of two tops so come solo or with a date only! It's NOT a place to bring your entire posse to. \n\nRyo and Cory are very kind and humble guys, and I love that they're offering great quality sushi at non-gentrification prices. Wishing them much success with Kuma Sushi + Sake!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "Kuma doesn't take (online) reservations but it seems like you can call for one. There was a 10 people group there (w/ reservation) when I was there. Be prepared to wait. People tend to take A LONG TIME to eat. You can put your name down and get a drink elsewhere before dinner.  \n\nSeating is slightly awkward. There are four clusters of 3s, and a couple tables of 2s that can be combined for bigger groups. I think the bar seating should be re-arranged to accommodate groups of 2 and not have empty seats. \n\nAmbience is chill & dark (perfect for a date). Decor is chic, minimalistic and urban. Service is great, Mr. host is very attentive, but they seem a bit understaffed from time to time. \n\nPrice is very fair, especially for the city. Menu has variety. Only dessert right now is Michelle's ice cream (I had the UBE) - for $3, you get a big scoop! Worth it . But what is the \"eat until your full @ m.p.\" deal? I can't imagine how much that'd be and what they'd serve you. \n\nOverall food was just okay. We weren't impressed. In fact one of our rolls kinda a fell apart, we couldn't pick up the whole thing as one piece! Nigiri was fine, but weren't big fans of the roll. Sounded interesting on the menu but tastes not that great. Maybe we didn't order the right things? But since Kuma is new, I'd come back in a couple of months and see how things are then. For now, I rather have sushi elsewhere nearby; some suggestions (Wayo, Elephant, Sanraku, Ryoko).", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-24", "description": "I'm genuinely shocked at how high of a rating this new sushi spot has. Honestly, I'd give this place a lower rating (2 stars), if not for the nice chefs. And yes, I did just get back from Japan, and had some majorly legit sushi to compare this spot to in my mind, but that's not what this rating is based off of. \n\nLet's start at the beginning. Was pretty excited to hit up this spot for an after-work wknight dinner (around 6ish) with a friend. No line, got the last two counter seats. I took a quick glance at the fish in front of me, and felt a bit concerned. Everything was being diced up...for rolls. \n\nMy friend and I wanted to give their \"omakase\" a try, and that was the mistake. Actually, there were a few. I quote \"omakase\" bc this included a pineapple spicy tuna roll in the dinner, which I was truly shocked by. The first four dishes didn't include nigiri, which I was a little shocked by as well. And then when the nigiri actually came, the rice was hard?! As in, undercooked. I looked at my friend. She looked at me. We were very confused. In the end, we were offered ice cream, thinking it came with the meal...it did not. We were charged for it. I wouldn't have gotten it, had I known it was a choice. \n\nBoth of us, being SF natives, having been to nearly every which sushi and Japanese spot around the city, I was shocked that our meal of this caliber came out to 90pp (tax and tip included). For 50, maybe I'd be more okay with it, but still, no. I could list a handful of better Japanese restaurants around town that I would've gladly paid 90 for instead. \n\nLastly, service from the two sushi chefs were nice. They were kind and informative, which is what makes me feel so bad about writing this poor review. But the rest of their staff is uninformed about the menu, and the fish in general. I saw the sushi chefs explaining multiple times what was what etc. \n\nI've reread other reviews and it seems like their lunch menu is more worth it, but for dinner, it sure is not. I'll never come back for that \"omakase\" experience. And unfortunately, I can barely rate the fish, as I was so disappointed and caught up in the rice quality itself. \n\nPersonally, I'd never come here again. 3 stars.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "Why ?\nPro tip: Their 8 piece nigiri is yummy and the Kuma roll is unique and yummy! \nKeep in mind: If you're sitting facing the window, the service will take awhile. Some of the dishes you see in the yelp pictures, they don't have anymore like the spoon dishes.\nInstagrammable: Pretty good, if you get the dishes that have a wooden plate. \nAtmosphere: Unfortunately, it was a bit stuffy and it smelled like fried oil.", "author": "Christina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "I met a friend here and was really surprised how much I liked it.  Sushi is very fresh and the flavors pop.  I highly recommend it.\n\nNote:  it is a bit small inside so we had to wait a bit longer then I would prefer.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Date & Time:  Friday August 11, 2017 @ 6pm\nDining Companion:  The Husband\nScene:  Solo, Couples & Small Groups in Crop Tops, Skinny Jeans or Skirts & Sneakers\nDecor:  Urban, Minimalistic, Zen.  Reclaimed Woods.  Sleek Sushi Bar, Counter-Seating & Bench Seating\nMusic:  Eclectic Mix of Jazz & Rap\nService:  Professional, Polite, Efficient\nImbibe:  Sake \nDevour:  Miso Soup, Tasting Spoons: Ankimo, Salmon, Fluke, Spicy Salmon.  Bin Toro, Masu Toro, Hokkaido Uni, Sunazuri Sashimi & Nigiri\nTotal:  $84.09", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-02", "description": "I went to this restaurant on Sunday night(June 30)\nI very disappointed for this  restaurant because they have 4.5 star but service so bad.The server who wearing yellow shirt ( has tattoo)He serving everything like he doesn't like to serve us. He put our bill and take our utensil out but when I check on the bill I didn't get steam egg so I asked him and he said it coming.I said I want to cancel because he already clean everything on our table but he didn't  let us cancel . This how they serve the customer, put the bill and take everything out before we get all the food???", "author": "Panisara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "I never heard of Kuma before so I was a bit suspect but everything I had tonight was excellent. The food here surprisingly good! We had the sake (salmon) Kama (collar) and the size was huge! The skin was crispy and the fish was fatty and it paired p deftly with the ponzu daikon sauce. I had the chef's choice nigiri and it was very reasonably priced at $36 for 8 pieces. The fishes were sometimes marinated and/or included shisho leaves to enhance the flavors... really the selection contained the innovation and quality you would expect at a omakase restaurant. I think the chef's choice is an amazing deal. The chawamushi was flavorful and the dashi stock really made a big difference. The best part of the meal? The AMAZING uni from Hokkaido.... really fresh and really quality. It was about $18 for two nigiris but SO WORTH IT in my opinion. They also had uni from Vancouver and Boston which I will try next time. \n\nWe finished up the meal with tamago sushi (served cold which is a miss for me personally) and Ube ice cream from Mitchell's. Love to see that childhood ice cream shop still alive and kicking. The service was fairly good but it did take awhile to get the sushi. We didn't need reservations and were able to pop in around 7:30 no problem. This place will definitely become a regular spot from now on!", "author": "Jocelyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Very tasty, fresh, creative sushi and friendly/efficient service! Prices are reasonable. Space is narrow with seating either at the bar or tables along the wall. I would suggest reservations or get there when it opens. I walked in at 5:30pm on a Saturday and was able to get seated (party of 2) right away but it got busy quickly within the hour. Nice addition to the Polk St. border of Decent and Sketchy (you are entering Sketchy within the block). I hope, with the high turnover of restaurants in SF, that this one will last!", "author": "Barbara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "The food and service and sake were good here. Not special enough to justify 5 stars, probably not a place I'd be drawn to return to, but decent food and a good choice when looking for something nice to eat in the area.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Amazing sushi, amazing service, amazing atmosphere, right price!\n\nI walked past Ryoko and Elephant Sushi and found this terrific gem. The ambiance is more relaxed, not super jam packed like some other places but busy enough to feel like a popular place. The sushi itself was very fresh and delicious. I got a miso soup (one of the best I have had) and some nigiri. The rolls looked amazing as well but I was so happy with the nigiri I just kept ordering them!\n\nAt the end I was having an issue with my card and while I was waiting on hold with the company they brought me an ice cream on the house! I couldn't believe that they went out of their way to prevent me from feeling embarrassed and instead made me more welcome even through I was inconveniencing them (as there was a long line outside). \n\nWill definitely return the next time I am in SF.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Been here twice. I tried their nigiri samplers and sashimi samplers. Overall I give this place 5 stars, why?\n\nFor once, the staff/waiters/service is amazing. They're so nice and friendly. They make you feel welcome. The sushi was fresh and nicely prepared. The presentation (art of plates) was amazing. And the decor/ambiance is super appealing. It's tastefully designed and decorated. \n\nFor now they don't take reservations and there's a huge waiting list after 6 pm, but the wait is totally worth it. When we went first time, we waited up to 1 and a half hours, but they made sure we're doing well while waiting, they kept coming and reassuring we'll be seated soon, and apologized a ton and they brought us complimentary drinks. We had a great time even when waiting. I strongly recommend trying out this place. And I hope you'll enjoy as much as I did.", "author": "Selen A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-13", "description": "I have no idea how the food is here because I've been waiting for 20 minutes with no greeting, menu, or drink. No acknowledgement. Nothing. It's not crowded. No excuse.\n\nUpdate: Finally was acknowledged, ordered, and got food...it was good enough. Nothing special b", "author": "Miss P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Simply put one of the best Sushi experiences I've ever had. The freshness, the presentation the crisp clean flavors were second to none. Owner Rhyo was intent on providing not just a great meal by a great sushi experience. Staff was attentive friendly and well informed. Sake selections were off the charts ! Can't wait to come back!!!", "author": "Russel N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Discriminate against people with disabilities and do not allow people with service animals ( registered in state of California with all necessary certification and training). Their excuse is that chef is allergic to dogs, please note that service animal was hypoallergenic! \n\nIf you believe in equal rights to please avoid this place!", "author": "Jana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Thank you yelp ...we were staying nearby Alexis Park Hotel ...see separate review) and meeting some friends for dinner called for reservations as we were 9 people.  They do not take reservations so we showed up ... you might think the Neighborhood is seedy but this place is top notch.  The fish is not only fresh but really tasty.  The service was great Trevor our waiter was wonderful.  We had a variety of Sashimi and some fantastic cold Sake.  Worth the wait for a spot.", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "It was really a wonderful place the sushi was tasty and satisfying except the size of the rolls and nigiri didn't justify the price of the food.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Sushi is so hit or miss. This place is a great find in the 'loin. \n- Reasonably priced for how fresh it tastes\n- Great selection of \"Americanized\" rolls that are fairly priced with fresh ingredients\n- Cute decor\n\nAlso, THEY USE REAL CRAB MEAT!!! +1000 bonus points.", "author": "Sue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "I have a massive conflict of interest here. I love this place and want as many people as possible to experience it. I also don't want it getting anymore crowded than it already is. \n\nThe food is fantastic. Kuma punches far above its weight class in quality (particularly when you take price point into account). The fish is fresh, the service, fast and friendly. You couldn't ask for anything more out of a neighborhood restaurant.\n\nMy personal favorites are the Hey Girl and Mr. Krabs rolls. I'll also always get two orders of the Kani. Treat yourself to a scoop of the tropical ice cream for dessert. The scoops are generous but two people can finish one of each (3 flavors) if they step up.\n\nNote the restaurant is small. Expect to wait if you come in at a popular hour. Fortunately, Jackalope is across the street and a good place to pound a few tequila cocktails in the interim. You know..if showing up blackout to dinner is your thing.", "author": "Jon O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Their nigiri are wonderful!!!!! If you are looking for a full meal with majorly nigiri, it will cost a bit.", "author": "Huixin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "On an early Sunday evening at about 6:30pm, the sudden craving for sushi came but I didn't want to wait in line for Amami so... I started to yelp some good sushi places in the city! \n\nOne of the choices I came across and decided to go to was Kuma Sushi + Sake. Getting there and finding parking was easy. We walked in and were seated at the window immediately. The server gave us menus and asked us what we wanted to drink. We ordered hot green tea.\n\nWe looked at the menu and decided to order 8 types of nigiris and the Hey Girl roll. (Nigiris: sea bream, escolar, salmon belly, tuna belly, hamachi, red crab, uni (Maine), shrimp.) We also wanted the Ikura nigiri and the hamachi Kama but they were out. \n\nThe waiter took our order and the Hey Girl roll came out pretty quickly. We finished the roll and waited about another 10 minutes for the nigiri to come out. We got 7 of our nigiri orders, finished it in about 10 minutes, and waited for another 5-10 minutes for the shrimp nigiri. Presentation for the shrimp nigiri was great! They even deep fry the shrimp head so you can eat it!\n\nMy favorite items in the order were the hamachi nigiri, uni nigiri, and the salmon belly nigiri. I'd get more of those! In general, the taste was pretty basic but you can tell that their fish is fresh. \n\nWhile leaving, I noticed we beat the rush. There was now a crowd at the door waiting for tables.\n\nIn short, the sushi and nigiri is fresh but they taste pretty basic. I wouldn't come here if I was in a hurry though.", "author": "Carin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Every item tasted fresh and was skillfully prepared. Yum. The sauces and flavors were on point, nothing too overpowering, just there perfectly complimenting the fresh fish/seafood. Exactly the way I like it. \nJust a couple of my faves... \nThe ikura is delicious, and tastes like it is house-marinated. \nThe Uni from Japan is pricey but  delicious. \nThe kani is juicy and fresh. \n\nNot sure if what else to say, we were very happy with everything.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "A friend and I decided to come eat here on a Thursday night. Ordered the salmon roll, tuna roll, and a sweet potato roll. No complaints about the taste. Fast forward to Friday morning, my stomach was cramping and I did not feel well at all. I boarded a flight back home and the whole ride was me combatting whatever was inside coming out. The drive home I was nauseous and faint. At home I was in the restroom every 10-20 minutes. I called up my friend who I had gone to eat with and she too had been throwing up all day. After being in fetal position all day, I called a nurse advice # and was told to head to the ER. I was treated for FOOD POISONING and spent a total of about 6 hours in there. Called out of work the next day. I called the restaurant the night of and was told rudely that no one could help me and that the owner would be in on Sunday. I just got off the phone with the owner and basically all he did was refund the money. Now I am stuck with a 100$ ER visit plus loss of the money I could've made by not calling out. I don't agree that this is fair to not fully treat/follow through with a guest that you SICKENED.\n\nDO NOT COME HERE.", "author": "Mari Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "Absolutely astonished as to how this has 4.5 Stars. Not one piece of fish tasted decent. They must have had a professional photographer take the photos. Go to saru Sushi, that's the gold standard in sf.", "author": "Taher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Very nice little place, quiet, simple and tasty! We took the 4 pieces nigiri plate and the rainbow rolls. I regret that they use fake crab in all the rolls and the plate was little expensive for 4 pieces ($18) but definitely different that any other Japanese place around here. They use less rice than usual and let you enjoy the fish taste.", "author": "Leo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "This is my favorite sushi bar in San Francisco.  Great sushi and the miso soup is the best I've ever had.  Try their sake collection and get the chef's choice sashimi or nigori.  Nice layout, though I prefer to sit at the bar as the tables feel a bit high", "author": "Keith G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "I've been here twice and I wanted to give it four stars, but it lost one star at the last moment. As I was about to finish, I found a hair in my bowl under the rice. Also the celery is not cleaned properly. When I told the waiter, he simply said 'I'll let the chef know' and turned around, without even apologizing. Also the salad tasted quite differently from last time, it was not as fresh. Nigiris are not nicely done and would fall apart easily.\n\nThere aren't many Japanese places open for lunch in the neighborhood. It's a hard choice but I don't think I'm going back.\n\nPros:\nDecent price\nOpen for lunch\n\nCons:\nInconsistency of taste\nHair and dirt in food", "author": "Wei Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Wow!  This is seriously uptown food for small town prices.  We wanted to go some place new and different for our last night in the city before heading back home and I honestly can't say enough about how spectacular our dining experience was.  \n\nWe were greeted with a warm welcome and sat at the sushi bar where we had a up close view of the amazing knife skills of the chef preparing our meal.\n\nWe started with the sashimi sampler - a beautifully plated sampling of 5 different fishes (2 pieces of each), then ordered three rolls and all were delicious. The Tango, a tuna and mango roll topped with ocean trout was luxurious and the trout was almost buttery.  The blind tiger, a spicy hamachi and jicama rolled topped with thinly sliced kumquat had amazing texture and the slight acid from the kumquat really added to the overall exceptional taste of the roll.  The faceplant, a vegetarian roll filled with steamed asparagus and jicama topped with Japanese eggplant could make a vegetarian out of the biggest meat eater. It was amazing!\n\nThe service was impeccable, the food was exceptional and the price was unbelievably reasonable.  This is a place we will visit every time we're in the city.", "author": "Donna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Might be my new favorite restaurant in the city. The salmon avocado is weirdly good, and all the fish tasted very fresh.  Miso comes in a mug and it is perfect.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Vegetarian nigiri:  ordered 2 avocados, 2 eggplants, two asparagus. Far exceeded my expectations- I went back 3 times during my trip. So good.", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Came here on a Monday evening shortly after it opened based on the Yelp reviews.  It's a small restaurant on Polk in a relatively open part of the tenderloin.  Great customer service. \n\nI ordered the Nigiri Sampler for $36 and opted for 8 different fish instead of doubles of 4. Each piece of fish was fresh and delicious.  Definitely exceeded my expectations of a Japanese restaurant in the tenderloin - especially at such reasonable price points. \n\nIf I were to provide constructive feedback, the rice could be improved...a tad more soft. Not a big deal though, as I plan to return and try all the sashimi next time!", "author": "Yvonne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "mmmm.. what more can I say besides that this place blown me away with the quality of the food. \n\nBrowsed through the 'Hot and New' page and stumbled upon Kamu Sushi + Sake! Walked in at 8:30 ish w/o reservation and waited for ~10mins. The restaurant is SMALL but intimate. A sushi bar that fits ~10 and a few tables meant for couples and this three person vertical table looking out at the street. The bf, friend, and I got seated in the tiny tables. Although a bit squishy, it was cozy? i guess. lol. Definitely not a restaurant to go with a big group.\n\nLoved the table setting; very neat, clean, and cutely decorated. Our waitress was this cute bubbly Asian girl. She gave honest and good recommendations. After browsing, we decided on:\n\nAPPETIZERS:\n- Furikake Edamame ($4): soybean pods tossed with a house made seasoning and sea salt. My first time ordering edamame at a restaurant cause honestl, I think its a waste of money, but when we read this we had to try it. It was very appetizing and delicious especially with the sea salt. Had us licking our fingers!\n- Tamago Tofu ($10): chilled version of chawanmushi, Japan's savory egg custard topped with ikura. Never tried chilled tofu before but it was like eating cold egg similar to \"dun dan\". The egg was soft and the ikura was very fresh. \n- Osuimono ($5): slices of shiitake mushroom and tofu suspended in clear soup base made from that morning's fish bones. The soup was clear and pure to drink. \n\nNIGIR'S: (2 pieces per order)\n- Anago (saltwater eel, Pescadero) $9: This was absolutely delicious! So much flavor\n- Mirugai (geoduck, Oregon) $10: Must get! \n- Tai Kobujime (sea breamed cured in Kelp, Miyabi) $7\n- Ama Ebi (sweet shrimp, Japan) $9: the bf and friend loved this; very fresh. Came with the fried fish head. \n- Umi Masu (ocean trout, Scotland) $7: omggg. my ultimate favorite of the night!! So fresh and good. \n- Hirame (fluke, Korea) $7: loved how light this fish was but had a hint of mint flavor from the shiso leaf. another fav. \n- Uni (sea urchin, Santa Barbara) $16: sweet and creamy. yummm.\n\nROLLS:\n- Half Baked Roll ($14)\n- Negi Hama ($6)\n- Salmon Avocado Roll ($7)\n\nDRINKS:\n- Echigo ($6)\n- Hot Sake ($9)\n\nNigiri's were great and the price wasn't too over the top especially for the quality. We ordered seconds and thirds for Umi masu, mirugai, and hirame. In total for 3, our bill was ~239 pretip. Great dinner spot for couples cause of the vibe and atmosphere. Servers were friendly and very attentive.", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "Came in around noon. Several tables and only one waiter serving. Obviously too much for one person to handle. review. The waiter was extremely rude and ignored my request several times. Ordered one Kuma poke bowl and one tuna bowl. It was way too salty. The half baked sushi was barely cut and almost broken for the first few pieces. Mostly disappointed after reading the review. Wouldn't want to come in again with such services. The Ebi sashimi is perhaps the only hightlight for this meal.", "author": "Emma X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "this is a great place with great fresh fish . Hostess is fanky and nice. \nThe interier and the menu is great. Nice vibe here. Will come again!", "author": "Lizzz K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "This place ruined my Sunday morning. The waiter is so rude. He came and take our order, didn't say anything, just stand next to us. I though he is taking drink order first, so I told him green tea. And what happened next is shocking, he gave me a face and said \"that's it\", like I'm a cheap person just go there for a tea. My boyfriend was shocked too but we realized he is here to take the food order so my boyfriend ordered and I ordered after him. We were not very sure about what small plates to order so I wanted to ask him some questions, but he just grabbed the menu away from my hand and left. Leaving me there shocked. \n\nWe were really upset so we decided to tell him that he didn't let us finish our order, but when we tell him he didn't even apologize. We had to leave, there is no other options.", "author": "Yingyu M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "The worst service ever. Went here for lunch and the server was the worst ever. So bad that we had to leave as we couldn't even finish ordering. I wanted to order a drink but the server just snatched the menu away from us before I could even say anything. When we told him that we will leave because of the bad service, he basically told us to get lost. \n\nI think this restaurant could be good but the server is definitely the worst I have ever encountered. I think there are some other yelp reviews describing the same. It would be better for the owners/management to take care of this issue so that they can actually keep their customers. I will never be returning to this place as there are many good places in the city with much better service.", "author": "Amer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-31", "description": "The waiter is so rude at this establishment. I live two blocks away and used to come often when it first open. I really loved it. However after my last two experiences I will never come back. The last time my friend and I were sat in the front window. We waited 20 min and the waiter never ever brought us a menu or water. When we asked for it he acted like we were bothering him. We asked to move to the bar so we could have better service. The main chef was more attentive to us and got us things the waiter neglected to bring us. \n\nTonight I came in by myself. There was one seat available at the bar for a single person. I asked this same waiter if I could sit there and he told me the seat wasn't open. Seriously? A restaurant that takes no reservations, has many people waiting for a table, and you won't let a person who is by themselves sit  at a seat that is clearly available? Then I asked to place a to go order, and again he was extremely rude and with much attitude said we don't do to go orders. \n\nI will never go back and definitely not recommend. I would rather walk 6 blocks to a place that is friendly and wants customers. It's unfortunate this WAITER is so rude and NASTY!!", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "Small and quaint shop with delicious sushi and attentive staff. The chefs are also well versed and can give you additional insight about all the fish. I love coming here for lunch for the Kuma chirashi bowl. Dinner I come for the 8 piece omakase for $38", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Such great sushi and ambiance. It's a bummer that they don't take reservations but we just got drinks next door. We went for my boyfriend da birthday and we can't wait to go back. It's small inside and they were a bit under staffed but the sushi is worth the wait.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-15", "description": "Based on this fantastic rating (4,5 stars), two of my friends and I tonight gathered here for a dinner to plan our holidays. \nWe got specialty rolls:\nHalf Baked - was the tastiest.\nKuma Roll - nobody liked the sweet potato wrapped in rice with some fish on top\nAnd the one with almonds and eel - was not either, as almonds got soggy in the unagi sauce.\nAdditionally, we ordered sashimi: Salmon toro, Hamachi toro, Uni and Hotate. My favorite was Hokkaido hotate, but the rest was pretty good. \nThe atmosphere is modern and light, with good seating.\nI think this place is fantastic for the neighboorhood, and I am thankful for the entrepreneurs who venture into the food service.\nMy favorite is still Wako...", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "I am so excited this new sushi place opened up near my apartment. I was recommended it by a friend. Walking in, I was greeting by a modern vibe. The interior had a few small tables and long bar right in front of the sushi chefs. My friend and I chose to sit at the bar for that authentic sushi experience. During our meal, it was mesmerizing watching the chefs create the sushi. I had the nigiri tasting (4 pieces), Aji nigiri, Chawanmushi and Uni nigiri. Everything was awesome. I could not choose a favorite dish. The bill came out to $78 excluding tip for 2 people which I find is typical for a Japanese restaurant in SF.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Overall: Good.\nFood: Great.\nService: Amazing!\nThe food was delicious and the service was really great. In reading through the reviews, there were (prior) concerns about how well the waitstaff did; the girl who served us was attentive and pleasant and helpful. Really amazing! We went on 5/11/18 in the evening.\n\nThe fish was really fresh and delicate. They have a huge variety of sashimi, rolls, and nigiri to choose from. They also have warm plates and cooked plates -- nice selection. I had to ask our waitstaff to warn me if I was ordering too much -- she was right on!\nI also asked for a saki recommendation from her: perfect!\n\nWhat was not as great was how loud it was in there & all the tech bros. It's popular: as you can see by the Yelp recommendations. That + pricing makes it appealing to a certain crowd. Not \"bad\" people but people who talk loud about block chain and bitcoin and their rarefied lives.\nMeh. \n\nThe neighborhood used to be famous for it's sexual inclusivity, the working \"girls\" and it's pleasant grunginess. Time's are a changing.", "author": "Yasi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Loved it. Come back here again. High quality and value. I've been to all the population and high end places that serve sushi in the bay area. \n\nCome here. The place is small but cozy. Not cramped. Nice vibe, not too quiet but not loud like ryoko.", "author": "Dan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-03", "description": "I rarely write reviews and should more often but yelp is usually dead on for their reviews \nService was very slow for us and they even forgot 80% of our order; we had to remind them two times.  Never checked if we needed more hot tea or another beer; we were there 2 hrs total time.  \nNo apology from them\nThe salad with limu tasted like shredded paper; limu has a very salty seaweed taste and theirs was tasteless.  The daikon salad also tasted bland.  To have tasteless limu & daikon for a Japanese restaurant shows it's not authentic - too many Japanese options in SF for poor service and non-Authentic food.", "author": "ben r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "The 8 piece sushi was extraordinarily fresh and well flavored. We enjoyed the tasting spoons and taro ice cream dessert. So so good. This will likely be a new go to for upper-moderately priced sushi. The staff were super friendly and well informed.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Wow! Kuma Sushi totally obliterates Elephant Sushi. Got an 8-piece nigiri plus California Roll (custom combo) for $32 for lunch and the quality was very high!!! Chef explained each piece and the toppings to complement it. Homemade seasoning  is mild and doesn't overpower the delicate fish.\nHamachi, madai. Exotic pieces. A true gem! They currently only offer takeout at lunch, as dinner is too busy.", "author": "Scott J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Visited Kuma during their soft opening. Their sushi preparation is absolutely divine. There's a wonderful balance of flavors in the rice and the serving temperature of the fish is delightful. \n\nI love the decor and feel of the restaurant. It's warm and inviting with Corey and Ryo at the helm.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Yes! A sushi restaurant after my own heart. We arrived just before 7 on a Friday and had about a 20 minute wait to sit at a table. Others coming in shortly after had to wait around 30-40. While we waited we sipped on sake and had edemame on the small counter at the entrance.\n\nSake and beer offerings were excellent. My boyfriend had a canned Japanese beer that he had never heard of. It was delicious. \n\nSushi itself really impressed me. Great quality fish. Really interesting rolls that impressed me with the flavor combinations. Not all sushi needs to be masked with a sauce and flavor on top of flavor packed into one bite. I thought they did a nice job of choosing really bright fresh ingredients that compliment one another, but also hold their own.", "author": "Hannah Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "This was surprisingly really, really delicious. I'm always skeptical of getting sushi in San Francisco for some reason, but was convinced to come and try the Omakase here. It was a plate of fresh sushi, and the waiter was kind and thorough when walking us through what exactly was what. I'd definitely come here if I was trying to impress someone.", "author": "Jessie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Delicious, fresh sushi at a very reasonable price. This place usually attracts trendy crowd and you might have to wait to be seated but it's well worth it. The owners seem to be experts and truly care about sushi and providing a unique experience to customers.", "author": "Arkady I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "The ambiance of this place was very cute! I had the seaweed salad and great balls of Fire. Both were delicious. Service was great and they were even able to split the tab!", "author": "Kathleen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "OMG YUMMM. I've been meaning to try this place since they opened several months ago. I was able to drop in on Saturday night with three friends. We started with the Edamame and the Hamachi Ponzu. The edamame was hot, delicious, and had the perfect amount of salt. The portion size of the Hamachi Ponzu was very generous having seven slices of hamachi and ample amounts of ponzu and jalepenos. \n\nWe also ordered the Great Balls of Fire, Hey Girl, Half Baked, and a Spicy Tuna Roll. \n\nGreat Balls of Fire - came out perfect hot, very good, but a bit too greasy for me. \n\nHey Girl - my favorite roll! perfect combination of tempura shrimp, tuna, avocado, and unagi! \n\nHalf Baked - my bestie's favorite, salmon was nice and seared from broiling. Very tasty! \n\nSpicy Tuna - great tuna, with lots of cucumber and lettuce. Nice crunch! \n\nWe will definitely be back!", "author": "Whitney P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Based on lunch experience \nFood 5 all of our group ordered Chirashi bowl. It was right  choice! Variety of fish and shellfish were very fresh and vinaigrette sumeshi rice was just on point. \nService 5 the sushi chef was very attentive and informative \nPrice 5 very affordable \nArea 4 kinda sketchy area at night\nDecor 5 clean, minimal, stylish with Japanese traditional accent", "author": "Tory T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "Kuma was pretty packed and the line was pretty long despite the fact the restaurant had only been open a couple of days. My friend is acquainted with head chef Ryo and insisted we sit on his side of the sushi bar so our wait ended up being a LOT longer than I had anticipated. I was definitely ready for some omakase after waiting in line an hour. \n\nAs with every new restaurant service is SLOOOOOOW. I think they're still working out how things should flow and are still in the process of training the wait staff. Also, as there are only two chefs behind the bar and they not only serve the bar but also the floor, things were definitely delayed. \n\nAfter what seemed to be forever, we finally got the arugula salad with dehydrated salmon skin, and the hamachi with ponzu. The arugula salad was pretty basic but the salmon added some dimension to what would've otherwise been a pretty boring salad. The hamachi was bomb. \n\nRyo then gave us some avocado topped with a huge chunk of uni on these little wooden spoons. We got lucky because they were running out. The chawanmushi had run out so I was pretty bummed out but luckily they still had most of the fish available. \n\nWe got a small plate of sashimi, a small plate of sushi, some rolls which were pretty standard but extremely fresh. Unlike the more adventurous appetizers (by Japanese standards) the sushi and sashimi were traditional which I quite like. \n\nHero of the day was the monkfish liver. You should get it. Really. \n\nWe finished off the meal with some ube ice cream from Mitchells which is as San Francisco as it gets. \n\nThere are definitely some kinks to work out but I have high hopes for this place!", "author": "Eunah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Found this really good sushi place on Polk Street. I tried the tasting spoons, the chef's 8 piece sushi tasting and the amaebi. Everything was excellent and reasonably priced. The chef asked if I liked any particular fish and he had great anago and ocean trout. Definitely highly recommended.  Come early. This place gets packed and it's walk-in only.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "Good Sushi but it can get busy especially on weekends! Service will be affected. We had to wait for 30-45 to get our food. \nI have had better sushi. \nOverall, I would say- bang for you buck sushi", "author": "Praveen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "One of my favorite sushi experiences ever. Such great, nice, and helpful staff (our waiter influenced a lot of our order, which is how I like to do sushi). Ambience was fun but cozy. Cool living wall plants. Well curated decor.", "author": "Sam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I have no pictures to show because, I literally ate everything!! food is great, probably the best sushi place in San Fran! Our waiter Matthew was great, friendly environment", "author": "Minka M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "This place is great for lunch. They got great specials. Drop like 15 bucks and get a decent sushi meal, soup, and salad. I got the salmon poke and it was pretty decent. The soup was excellent.", "author": "Vinayak P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "So good! Got the chirashi bowl lunch special. It came with a salad with tofu dressing and a miso soup. Everything was delicious. Great quality and very reasonable prices.", "author": "Reese W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Owners really work to create a quality product here, with considerable interesting nigiri on the daily menu.  Several items sourced from California on last night's menu: anago, uni. See posted photo for an idea of the variety of fish offered. Menu indicates sourced region for each item. Kuma also aims to please the patron interested in the Americanized version of sushi, baked rolls, embedded deep fried items, etc.  Restaurant has nice vibe and neighborhood feel. Will definitely return.", "author": "Carlos D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Very good and fresh sushi. I've been to most of the top sushi places in SF and I would rank these guys at the top with only a select few. There's been a lot of super traditional high price point omakase places opening up but this is the place to go if you just want very solid sushi without being forced to do omakase.\n\nFish is very fresh -- I've sampled basically everything on their nigiri menu and nothing missed the mark. \n\nPrices are a little on the higher end per piece but not unreasonable. It's very good for the top notch level of quality you get here.\n\nI am normally very skeptical of new sushi joints with good Yelp reviews because most people don't know how to rate good sushi but these guys are the real deal.\n\nTry to sit at the sushi bar if you can. Corey and the others are super friendly.\n\nAmbiance is trendy and a good date spot. \n\nThis is now my go to sushi place for a sushi fiend like myself -- I'm only worried that soon it'll be hard getting a seat considering how popular they are getting and how well they are executing.", "author": "William J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Corey one of the Owners and chef is awesome. . Short and simple. The sushi was excellent and the service was just as great. I'll be coming back.", "author": "Marcus Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Amazing - we live nearby and ventured here - going south on Polk is always colorful - worth the hike, loved everything- even Kale Salad included in lunch special is special !", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "I absolutely LOVE this spot. Hesitant to write a good review because I want to keep it all to myself : ) Very attentive staff, extremely knowledgeable sushi chef, great tunes, and just an overall top notch sushi experience. Highly recommend.", "author": "Mandy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Amazing! Some of the best food I've had in a long time. Got the balls of fire small plate and a happy lunch special poke bowl. So fresh, beautifully plated, great atmosphere, great service. Yummm!", "author": "Dian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "What a treat! We came here with our 2.5 year old daughter for a yummy lunch and we had a great time. The lunches come with amazing kale salad with a tofu dressing the our babe couldn't get enough of. Their miso soup was also very tasty and well balanced.\nTheir Saba was perfect as was all their fish. \n\nWe will for sure be coming back with our little lady, I mean, she lived for the kale salad, enough said.", "author": "tinkerbell e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "We arrived at 5:30pm for dinner to avoid the crowd and got seated right away at the bar. Fresh sushi at a reasonable price! We went for the chef's choice nigiri (8 pieces for $38) and we did not regret it! We also added other nigiri: scallop, toro, ama ebi (shrimp), and hamachi belly. Everything was fresh and delicious.", "author": "Jenny Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Absolutely fantastic. Got the sushi lunch special and was amazed. I'm not the biggest sushi fan, but this place turned me around. The variety was fantastic. Also not crazy expensive given the quality. 10/10 recommend", "author": "Solomon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "This was some of the best sushi I've ever had. I got the 8 piece Nigiri Tasting platter and every piece tasted better than the previous bite. If you're hungry, you're going to need to order more...but the taste was out of this world. Definitely worth the $36 price. It's a shame because when you search sushi on Yelp, Kuma doesn't even pop up on the first page! The chef is extremely attentive and precise, service was great. Just be prepared to wait a teeny bit, they were busy. \n\nFavs: \nSeared Tuna Outer Belly\nScallop (SO CREAMY! GET THIS)\nHamachi Belly\nTrout Belly", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "The sushi here is so fresh and reasonably priced. I was looking for a sushi spot close to different bars for date night and this fit the bill. They do not take reservations so I've waited as long as an hour to get a table. The service is quick once you are seated which makes up for it. The owner even gave us free sake the last time we ate there!", "author": "Diana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Amazing quality! Especially for the price; which was super reasonable for SF. We got the golden warrior, tango, and salmon avocado. They were all delicious.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "my friend recommends this place to me. I​ feel like they are a bit short of hand since the waiters are so rush in a Sunday​ afternoon. it's not very welcoming since it's my first time here and being alone. \n\nBut! their sushi definitely​ won my heart. I​ tried the sample menu and was impressed by the tuna belly(not so surprised) and Kuro​ dai. Kuro Dai is a must try! it has such a special aroma​ that I will absolutely come back even just for it.", "author": "R R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "Hmm....I really hope it is a great sushi restaurant, I should say I wish the sushi was better, since it is near where I live.  Oh well, for the price, I still give it a 3 stars. \nI heard during lunch is better and cheaper. We might be back for lunch but not for dinner.", "author": "Kent Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "I cannot express how wonderful my experience was here. The great balls of fire are amazing!!\n\nThe sake is wonderful.  The Hamachi collar is great. The uni was ridiculous. The fish was so fresh. I can't wait to come back.", "author": "Warren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Wow! This place is awesome. So I went during santa con, interesting times in the city... Kuma's atmosphere was a nice escape from the noise outside. They have great ambiance, the music selection was great, and the candle lit tables and semi-low lighting was a nice effect.\n\nAbout the food-while I enjoyed the 4 different rolls I had, I highly recommend trying the \"Great Balls of Fire\" with  panko breaded tuna and salmon roll, topped with sriracha, spicy mayo, unagi sauce, green onions, tobiko, and our house furikake. This roll is amazing! I had sake as well, which is always a nice touch with sushi.\n\nDo note-there was no sign above or in front of the building when I went there so don't just look for a sign. It's one store away from being right on the corner and has big windows in the front. Great for going on a date as well, that's what I did!", "author": "Kevin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Unbelievable! The nigiri sampler is carefully crafted. You even eat it in a certain order. The shochu is unique. And the lidako karaage is amazing. You think it'll basically be calamari but it's actually way better. Can't recommend enough.", "author": "Evan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "I had a sudden craving for sushi and decided to finally give this place a try since I couldn't get last minute reservations to my usual spots; Robin and Hinata. I'm so freakin happy that I gave this place a chance! The fish is so fresh and even more, it's so ridiculously reasonably priced! This for sure will be my new go to sushi spot before attempting to dine some where else.\n\nI arrived around 6-6:30pm on a Sunday night and was able to get seated right away. I think we beat the dinner rush because ~15-30 mins after that, a pretty decent wait started to form.\n\nNigiris:\n- magurozuke (it was alright. I've had way better & would probably not order again)\n- sake toro\n- umi masu\n- masu toro\n- vancouver uni\n- maine uni\n- ikura\n\nRolls:\n- CA roll *REAL CRAB\n- spicy tuna\n- half baked *REAL CRAB\n\nMenu Items:\n- hamachi kama (really good, but could've been grilled better. I would order again though)\n- osuimono\n- chawanmushi\n- Mitchel's be ice cream (biggest scoop I've ever gotten from a restaurant)", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Sooo soooo good! Excellent staff, great atmosphere, and amazing sushi & sashimi. Sat at the bar and was able to watch everything being made! 10/10", "author": "Kasey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Good service - great sushi. If you're trolling through yelp looking for a place with amazing sushi but won't set you back several hundred dollars, this is the place. I started with the chef's choice of 4 pieces of nigiri and wasn't disappointed. We then ordered salmon, yellowtail, ocean trout & fluke nigiri. The fish is fresh and buttery and the sushi rice has just enough vinegar in it and is perfectly soft. Lots of sake options if you're into that. We had ube ice cream to finish which was also delicious. If you're looking for casual sushi dinner in SF make this your first option - they seem to fill up fast, even on weekdays.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "I had one of the best meals of my life here last week, sushi or otherwise.  It was absolutely sublime.  It may have also been the costliest meal I've had.  It was worth every penny.  Traveling on business solo on a Wednesday night, I wandered out of my hotel, happened across this place, checked yelp reviews, and chose to try it.  It was quite busy, but being alone I was seated at the sushi bar within 10 minutes.  I opted first for the Chef's Choice sashimi.  It was a piece of art...absolutely gorgeous.  I almost didn't want to ruin it by digging in.  The Japanese Black Sea Bream was a new experience for me.  It has a fantastic texture.  The Chef clearly knew his stuff; it was a perfect combination.  I added some nigiri.  When uni is right, it's really right, and this was an exemplary example of how good it can be.  I chose the more expensive San Diego caught uni and it was worth it.  They had monkfish liver!  I tried that years ago, loved it, and haven't been able to find it since.  Sounds weird, but if you have an adventurous spirit, I recommend trying it.  Finally, the person sitting next to me had Hamachi Kama - broiled japanese yellowtail collar.  It looked amazing, and he said it was extremely good.  Next time I'm in SF, I WILL be back to try that.", "author": "Andi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Impressed with the service! Always so quick to take our finished plates and take our orders. Love the vibe of this place. The salmon sashimi were all excellent. The octopus starter was the best, the seaweed was crunchy and had a great texture. The fries with eyes had an amazing umami to it. Would have been five stars if not for the tall chairs being so awkward to sit on, I had to slouch over my food. Also the spicy tuna was mediocre at best.", "author": "Eindra K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Best. Sushi. Dinner. Ever. \n\nExceptionally memorable were: Osuimono (soup), Sakekawa Arugula (salad), fried amaebi, Great Balls of Fire, and nigiris of Hirame, Sake toro, Marinated tuna, Saba, Ama Ebi & their fried heads. The Mitchell's ice cream of mango/pineapple/tropical paradise fruits was really nice. That may have been everything I ate sans 1 or 2 nigiris.\n\nI question whether the people who didn't have a good time get to taste their sake. It's Kuma Sushi + *Sake*. Have the sake. Or 3. If something's in the restaurant's name, you have to have it for your review to matter. But this is Yelp. What people say here generally don't matter. What I mean is, your $0.02 is worth $0.02 if you've had the sake. Otherwise it's worth -$10000 because you wasted my damn time. Anyway, we intended to have 1 carafe but ended up having 3, on a school night. It's delicious & you can do it. I believe in you. \n\nWe had Toji-Kan, Kikusui, and then Hakuro Suishu. The Hakuro was really delightful. It had hints of apple & yuzu and it was super smooth. Just go from top to bottom of the sake menu; Professionals thought about this for us so we don't have to. It's easier to tell how good something is if you work your way up and it gets noticeably better and better. Like life!\n\nFinally, the details. I really appreciate Kuma's decor, and how it combines Japanese aesthetic and traditional elements in a very lovely way. I also admire their support of local SF artists in their restaurant. The bar corner I sat featured a beautiful Seasonal Seafood Poster by Young America Creative, a local SF artist. Upon entering I also noticed a beautiful live wall with moss & live plants atop the wall of the back of the restaurant that I later learned that it was from a local artist from around the corner! \n\nThe food, the art, the drinks, the decor, and the people -- all of my favorite things. A new friend that I met 3 days ago who sat next to me at Halu recommended Kuma and I was pleasantly blown away. This is a thoughtful place, and the care that was put into the details is remarkable. \n\nKuma Sushi + Sake is well deserving of their success thus far & this was the best Wednesday I've had. I'd gladly come back every opportunity I get. I don't have any photos because I had my friend take them so I can eat.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Intimate setting interesting rolls. We really liked half baked and hey girl. For the price you pay this is good quality sushi.", "author": "Chelsea L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "Always up for trying a new sushi spot. \n\nFirst off- the interior is awesome. Nice wooden paneling and good setup for a small place. That reminds me, it is a small spot with limited tables which fill up quickly, so the earlier you get here, the better. \n\nSide dishes: Hamachi Ponzu was delicious and nicely balanced. Also the Iidako Karaage (fried baby octopus) was amazing.\n\nNigiri: Here it was just ok. fish portions relative to rice is average.\n\nRolls: Had one (sorry forgot which one) which was good but again average. \n\nOverall: Go for the side dishes vs the sushi. Can't say it stands out from the crowd or worth trekking out to if you are not in the area but its a good attempt.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Decent sushi bar for small groups. Found this place from friend's recommendation. Nigiri are very fresh compared to other sushi bar at the same price level. Hot sake is tasteful too. My favorites are the sweet shrimp and purple yam ice cream. The only con is that foods were served slowly.", "author": "Yaqian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "Food was decent but the sushi chef was rude. Bald Asian dude. Didn't seem interested in serving our party. Oh well, tons of sushi in SF", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "Cute neighbourhood spot with yummy sushi. A little pricey. The great balls of fire and sake tasting flight are delightful. Lots of spots close by to grab a casual drink after if you are in to that.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Excellent food at a very reasonable price. Don't miss the tempura octopus. Will be back!", "author": "Malena S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "Excellent food, questionable service. Rolls, \"great balls of fire\", miso soup, purple yam ice cream and sake were of excellent quality, but unfortunately the magic was broken by the rudeness of one of the servers: When we started ordering ice cream he had an attitude, turned around and left (?!) then came back and rudely replied to our request for advice on ice cream flavors. We picked one, he rudely grabbed the menu from our hands, took away a plate with a sauce we were still munching on, and then harshly put the ice cream on our table. We have his picture so please ask via private message if you want to prevent him from ruining your experience. Without this person I would have given four stars to this restaurant.", "author": "Guillermo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Chef was amazing with great services and good quality of fish! Definitely will come back", "author": "Wing c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Sushi is bomb here! We came in on a Saturday night at about 7:00pm & it was about a thirty minute wait, not too bad. We sat at the bar & ordered quite a lot. \nHouse sake:  pretty good\nAlbacore tataki: AMAZING the spices they use are super tasty\nGreat balls of fire: Boyfriend had it & said it was interesting at first but once you're used to the sauces & flavors it tastes amazing\nNegihama: Yummy, good basic roll. Fish was really fresh \nAnago Nigiri: Flavor was strong but good, hadn't had saltwater eel before but it was a good. Might even like it better than freshwater eel \nOverall a good experience, staff is super friendly & happy to talk to everyone.", "author": "Skylar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "When a place is good and you go back there the next day?!! Yup this is one of them. I first tried it on a Wednesday night and it was pretty busy. Didn't wait long for one person like 15 mins! Everything I got was delicious . Was soooo good I went back the next day! Lol now for a Thursday night it was really busy!!! After being seated at the bar which I recommend. It a great view. I decidedly try something new and it didn't disappoint! Was gonna go here again for the third day in a row but decided to wait lol. So good it's addictive", "author": "Rho G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "The fish is very fresh. It shows the aptitude and technique of the chef of course. We ordered traditional nigiri chef menu and more Americanized roll. Both of them are extremely good. I think the rice is not that excellent comparing to the high quality of the fish, but it's still very good. The price is fair.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-28", "description": "Well,\nI should have read Jennifer L's review lastnight before deciding to eat here.\nI live in the neighbourhood and have been craving for some good sushi. \n\nWe usually go to Ryokos, Sanraku, Akiko's, Wayo or amami down in south sf.\n\nKamu's choice of\n\"let us entertain you\" is pretty poor.\n\nAs a respond to a previous reply of a review, wrote that Ryo and him quote \" trying to build a casual neighbourhood experience where we truly connect with our guests.\"\n\nFirst off. Bare in mind that you are REQUIRED to be seated at the sushi bar if you'd like to try \"let us entertain you\" on the menu.\n\nA normal assumption is that the chef or at least someone would try and get to have a sense of what you prefer and do entertain you according to your flavour if fish isn't the main course here.\nOther wise why should that service be strictly served only by the sushi bar?\n\n1) Ryo was our chef. Standing right in front of us.\nWe tried making conversation without success since all the chef just seems to be rather disinterest in serving us. (The host was probably the only friendly staff there)\nNot once has anyone asked us if we preferred what or if there's anything we like or dislike.\n\n2) well without knowing your customers of course you're not gonna know what they want. Traditional omekase from my experience serves fishes that's fresh or they do accordingly to alternative mix of what the chefs wants to do and how you like it.\nThey fed us kale salad.\nI came to a sushi to have kale... salad hmmmm \nIf that was the case I would be in the marina or wholefoods wouldn't I?\nit was charged separately from the 8 pieces of fish. \n\n\n3) soft shell crab was horrible.\n It came. Well hot but it tasted uncooked. Not talking about the sushi grade sort of uncooked but sort of crewing on dead flesh sort of uncooked. \nDefinitely a 2 star. \nOf course it's not included within the \"let us entertain you.\" It cost around 14usd which was not worth the dime. \n\n4) the fish. It was so-so. Nothing that akiko , ryokos or sanraku can't provide or do better.\n\nMy advice.\nSave your money and go else where.\nSimply by reading others reviews about the friendly staffs, dim lighting and decor.\nWouldn't justify good Japanese food.\n\nFriendly staffs doesn't make the restaurant successful. \nEspecially when your service ain't consistent.\n\nI give 2 compare to the 3 Jennifer previously gave since \"friendly treatment\" was no where to be found on top of the lack of taste there was. \n\nWe walked out with a 120usd bill. 1 beer included.\nWe ordered a steamed egg as an extra but the rest was all charged separately with the \"8 pieces of fish\"\n\nThe fish was not particularly delicious or outstanding either. \n\nThat's all I have to say. Disappointing.", "author": "Alui L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Amazing sushi and service. \nAlso a great lunch special. \nThe atmosphere is a modern classic vibe. A clean restaurant with welcoming servers. \nWould definitely come back again.", "author": "Meghan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Of all the great choices in San Francisco, we ended up here twice. The first time it was by random chance for lunch when we got in town and the second time it was a late night dinner and it we knew it was good so... round 2!\n\nThe hostess was very nice and got us seated quickly both times. Also we ordered a drink while we waited maybe 5 minutes. The service was great both times. Speedy yet not too quick and talkative and friendly. We were remembered on the 2nd trip and welcomed back. \n\nTrip #1 We sat at the Sushi Bar. We split \"Salmon Avocado Roll\" and the \"Hey Girl\". We could tell they were both very fresh and I would recommend them. My girlfriend had a glass of Rose and loved it as I had the Sake Flight (3 glasses) and it was amazing. \n\nTrip #2 we showed up around 10:00pm and waited maybe 5 minutes before being seated. As stated before, recognized us from the day before. We each had a cup of the Miso Soup and the same drinks (glass of Rose and the Sake Flight). This time we had the \"Hey Girl\" again as well as the \"Fresca Roll\". We agreed that the \"Fresca Roll\" is the best sushi we have ever had. We also had the \"Mitchell's Ice Cream\" for dessert in both flavors \"Ube\" and \"Cantaloupe\" (both were phenomenal!!!). \n\nI would recommend Kuma Sushi 100%. We had two great meals in two days!", "author": "Rob P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-31", "description": "Really wanted to love this place cuz I've read amazing reviews. But rice was undercooked and this is simply not acceptable for a sushi place. Enough said. I know this place is not a Michelin star restaurant, but undercooked rice for nigiri is just not ok. \n\nWe went pretty early so there was no wait. Ambience was nice and service wasn't too slow for a new restaurant.\n\nHowever, I don't think this place is good from the price. The sushi bite that comes in a spoon for $7 (for 2 spoons) is kinda tiny. Quite limited selections of the rolls. \n\nUnless I heard some crazy good reviews and been convinced by many people, I would not come back to this place. For similar price point, you can have a legit feast at Otoro in Hayes.", "author": "Ruxin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "The Mimi roll and tomato is very special and super good! Happy that we find this place :D", "author": "Wen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Went here to try out the 8-piece nigiri tasting and was not disappointed! Friendly and knowledgeable staff and well-priced menu :). Small spot which may get crowded, so go early!", "author": "Thalia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "Overpriced mediocre quality sushi + crap service from hipster bros who work here. That about sums up this place. Took 10 mins to get water and tea and another 10 mins for any sort of acknowledgment to order. What a disappointment.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "What a treat. As sushi lovers this is the best sushi I've ever experienced. Very original menu. Looking forward to coming back with my sister and brother-in-law. They'll love it!", "author": "SJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "January 13, 2018, My wife and I escaped the Central Valley for the weekend and were craving Sushi.  For obvious reasons we had high expectations that  we would find a great location in San Francisco.  Kuma Sushi did not disappoint.  Very quaint and clean restaurant located not far from Union Square on Polk Street. We enjoyed four of the specialty rolls, and a spicy tuna roll.  Our favorites were the \"Half Baked Roll\" and the \"Hey Girl Roll\". Followed closely by the \"The Tango Roll\" and \"Fresca Roll\".  Our server was very attentive, friendly, and helpful. I want to apologize to him that I cannot remember his name, he definitely deserves recognition. Fantastic sushi and service at a great price.  I highly recommend eating here!", "author": "Jacky P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Walked around aimlessly and stumbled upon Kuma.  We peeked inside and all the tables were full - we had a 5 minute wait.\n\nThis is a new place - only opened 3 days ago.  Impressed with the decor (very modern), the menu was good and the price point was very good.\n\nEverything you order from the menu will be very good.  My favorite was the baked crab roll!  \n\nHot Sake was filled to the top.\n\nFor dessert, they had a filipino ice cream flavor - Ube!!!  \n\nOne of the owners, Roy (hope i spelled his name right).  came by our table and asked how we were doing, so we got into conversation about the restaurant.  Very nice guy and so are the hosts.  Good music, everything top notch - even the bathroom!\n\nYou should try this place out before it gets well known and you'll be standing in line.  It's a great addition to Polk Street.  All the restaurants in that area are old done.  If you want your sushi fix, this is a great place to go.", "author": "R M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Fresh quality and excellent customer service! This is hands down one of the best sushi spots in the Bay Area, in the heart of SF. This restaurant is quite a hidden gem as not many know about this place...yet. Will be taking advantage of this before it gets way too popular.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Happened in during their soft opening, friendly staff quickly seated me at the bar. Ordered my go-to rainbow roll and  then the half baked. Then sashimi. Salmon and trout. \n\nEverything was beyond good! The half baked tasted incredible, Hot out of the oven and very rich. Rainbow was delicious and the crab had a fresh dry taste, not the overly sauced texture you sometimes get. \n\nSashimi was spot on, crisp and incredibly flavorful. I highly recommend!", "author": "Dustin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "The atmosphere is so nice and inviting; a simple design with lots of warm wood and shaped cement counters, the cement wall is not plain, but patterned with small metal accents. A large bar area is lovely with plenty of elbow room and tall seats to be able to view the Chefs at work. And the Chefs/Owners are incredibly engaging and fun to be around. Ryo and Cory love what they do and were always willing to answer our questions.\n\nFirst we started with a tasty, smoky Osuimono soup - a rich, clear fish broth with pieces of mushrooms and sliced soy. The daikon salad was stacked high with arugula, fish flakes and fried salmon skin, and of course, lots of daikon. Then came the Sashimi tasting, chefs choice (photo below) - 5 kinds of fish (2 each) all the fish was yummy but the highlight was the trout belly - so buttery and rich.\n\nWhile we were deciding they showed us the flown-in box of soft shell crabs from Chesapeake. Of course we had one, fried up and they serve it with finger limes - squeeze and it looks like roe, breaks in your mouth like little lime flavored roe eggs. So delectable. See photos.\n\nThe Great Balls of Fire is just fun and gratifying. Panko breaded and deep fried tuna and salmon roll with several awesome sauces. Crunchy goodness.\n\nOne of their specialty rolls came up next, The Tango - Salmon, Mango, with a touch of spicy green pepper. Not overly sweet or spicey, just delicious.\n\nThen came the coup de grace - Chawanmushi - egg and gouda and mushroom and crab steamed in the same smokey broth as the soup of our first dish - so good. I would go back for this alone.", "author": "Andrew U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Tried this during soft launch after passing it on the way home from work. The prices were very reasonable and the quality was amazing. This will be a much better alternative to Elephant Sushi, which is nearby. Highly recommend if you want good sushi and good service.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "One of the best affordable sushi joints around. The sushi chef Ryo is super friendly and down to earth. The sushi is spectacular, regardless of the price. We managed to come on a quiet night (due to Mayweather vs McGregor fight) and even got some sabisu from Ryo. Definitely worth checking out!", "author": "Joey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "Seaweeds salad, Salmon collar, yellowtail sashimi, mango roll, pineapple roll all very good. salmon colllar was my top pick!", "author": "Dan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Kuma is amazing! We ordered the 8 piece sushi and soft shell crab. The crab was perfectly fried and came with finger limes on the side. The fish is fresh and really good quality - you're definitely getting way more value for the cost. This is going to be my go-to sushi place for when I'm craving sushi but don't want to splurge on an overpriced omakase somewhere else.", "author": "Youri P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "above average sushi\n\nno self respecting sushi place serves rolls\n\nB+ on the sushi\nD- on service\n\nAngry angry service from the beginning. I could go into anecdote after anecdote but why waste my time.\n\nyou can be an angry sushi waiter when there are lines out the door and your sushi quality allows you to be a sushi nazi, but not now.", "author": "joe b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "The hostess was working wonderful.  She didn't seemed phased by a long waiting list. She effortlessly made sure we had drinks while we waited.   \nThe sashimi was melt in your mouth delicious.   We did the chefs platter and although it only had 10 pieces, those 10 were amazing.  The balls of Fire were also very good but you had to make sure you had ample sauce ( which they had) on each one to make up for the dryness of the balls.  With the sauce, it made an excellent combination.  \nWe also tried the tasting spoons. The salmon with capers one was OK, nothing I would make a special trip for but the halibut one was delicious.  It had a very light acid component which paired wonderfully.  \nWe had a problem with our sashimi platter being given to two other tables (a mix up in the checks) but the staff made it right by comping our drinks.", "author": "suz s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Overall, this is a solid sushi option in San Francisco! It's a great intersection between quality and price.\nThere is a wide selection of fish to choose from. We ordered the sashimi special to start and later ordered nigiri to supplement. Everything we ordered tasted fresh and had a very rich taste. \nHere are a few highlights from the many things ordered:\nThe sashimi omakase style plate for $36 dollars was a great deal! It offered 5 different types of fish. To my surprise they gave a good variety with beautiful presentation.\nThe umi-masu(ocean trout) was a must have! It had such a unique flavor and was a stand out. It's great for people who like salmon toro but want something different. I'm sad that the masu-toro was sold out. The hotate nigiri(Japanese scallop) was a bit lacking compared to other places in the city (new oyaji and ryokos). It didn't have the same freshness and creamy taste as other places. The otoro was delicious but a bit pricy at $20 for two pieces. Otoro is good if you're really into the rich fatty taste but not a necessary part of the meal imo. Especially since there are other interesting things to try on this menu. I finished the meal with dashimaki tamago (egg with japanese stock) this was ok but it was lacking the umami flavor that is unique to dashi.  \nI cannot speak to the rolls at this place as I only ordered sashimi and nigiri. However, the fish is already so good and fresh by it self. It feels like rolls would be waste of the great quality and inherent flavor of the fish.\nFinally the bill came. We spent around $115 for 2 people on just food. I left satisfied but not stuffed. For this price point the service could have been better.\nThe service was a bit slow in general. But that was because they seemed understaffed for a Saturday night with only two waiters. They could use an extra person to help with checks and seating people. Numerous tables were waiting for simple things like checks and they could increase turn around on tables quicker if they had the extra help. On side note, I appreciated them refilling my tea and explaining what was presented on each dish despite them being so busy.\nBe sure to call to ask about the wait time. The line can get long around 8pm on the weekends. The place is pretty small and table are cramped. There isn't any privacy between tables so you can basically hear everyone's conversations.\nIdeal weekend scenario: Go here for dinner and go for karaoke at Yamasho after!", "author": "Summer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Been here twice but it's neither memorable nor bad... I like their furikake edamame, but didn't enjoy their hamachi ponzu because it was seared (I prefer it be raw). Good ambiance!", "author": "Reiko P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "This place is amazing! Came to SF for a night and it was such a refreshing change from some of the sushi joints in South Bay. The service and food was absolutely perfect. The rolls are more unique and obviously a lot of thought is put into the menu. We had delicious chef's choice nigiri and a daily special roll, spicy tuna roll, and half baked. They were all delicious, and the ginger served with it was also yummy. We had some ube ice cream to top it off. So good! Quick, attentive service by one guy running through the place, and great food. Highly recommend and wish I was closer to visit again!", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Kuma is a true gem. This is the kind of place that we'd all be lucky to have for as long as forever. Being the sushi and sashimi purist that I am (raised on an island that just offered up some of the best world class cuisine, sushi and sashimi that almost jumped out because of its freshness, to tourists who can afford it), I've been on the hunt for something that would come close. Have been unsuccessful, until last night... Wanted sushi and sashimi for my main bday dinner, in spite of celebrating all weekend, having Malaysian in Milpitas, Italian in Newark, and bar eats to round out the first set of celebrations. We decided to make the trek into the city, hoping the yelp reviews didn't steer us wrong with Kuma. No reservations but came before 5:30pm, so was seated at the bar right away. Place is small, intimate, and easily gets loud. Seating is nice but again, small space means not too much elbow room, especially at the bar. Read through the menu while sitting in traffic on the bay bridge, decided on the omakase, chef's choice, $19, which gave 4 generous sized nigiri. We each had 3 rounds each so got to sample 12 of the Uber yummy and fresh fish, escolar, aka Hawaiian butter fish being our absolute best favorite of the entire offering. Uni was beyond fresh - it was sweet, melt in your mouth sea candy that almost made me swoon from the sensory overload. Just that good! We had the baby octopus karaage, hint of spice, tons of crunch, and boatload of flavor. Even though it was fried, it was not greasy or heavy. Very well done. We also had the daikon salad that was served with generous slivers of fish skin chicharon. Light ponzu sauce is worthy of bottling and being sold on its own. Miso soup was flavorful and served piping hot each time - we each had 4 bowls! I know, guilty. I don't drink anything cold with sushi or sashimi, since I was raised to only have hot green tea, hot sake, and hot miso soup, so yes, my tradition lives on :) Each delectable piece of sushi was artfully and (super yummy) tastefully done. Perfect tiny amount of lightly seasoned rice topped with the heavenly pieces of fish and seafood. Each bite transported you to a different level of appreciation and craving for all things good about sushi. I'd be proud to admit  the experience was transcendent. Our chef, Cory, topped off our amazing meal with 2 (gratis) scoops of Mitchell's ube ice cream - simple flavor, straightforward, wonderfully balanced - a perfect way to end the fantastic foodie experience. Not \"cheap\" or \"economical\" by any stretch of the imagination, but like they say, you get what you pay for. If you want fresh seafood and to be blown away by their true value, nay, their only value, aka flavor and freshness, Kuma delivers on this by giving you the heavenly experience in a well balanced atmosphere, that's also supporting local farms and seafood sources. Can't wait to go back!", "author": "Nida A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "I was overjoyed to find out that they have gluten-free soy sauce. #celiacsrejoice The sushi was fresh and served quickly.", "author": "Yvonne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Exquisite sashimi, great presentation, friendly & helpful service. The chef will gladly answer any questions. Walked in here based on the Yelp rating, and it proved to be absolutely correct.", "author": "Tim Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "It was good but nothing blew me away or made me say oh hell yes I'll be back. Rolls were small and simple, pretty much I was still hungry when I left. \nI got the tango roll, kuma roll, some salmon roll with lemon and avocado and a seaweed salad. \n\nThis was simple sushi maybe it's what we ordered but I wasn't impressed and I wasn't full off of $50.\n\nI won't be back, I didn't hate it and I wasn't dissatisfied but I've been to a lot more places that are way better.", "author": "Maria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Stumbled across Kuma after a concert (open late!) and were blown away by the quality of the food and the warmth of the service. Let them tell you what's in season and go for it!", "author": "Noel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Amazing sushi, knowledgeable staff, and great dinner overall. As a Nyc Sushi snob, I was wowed.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "This is by far my favorite sushi restaurant in SF. We've taken numerous guests here and we typically don't visit restaurants more than once and we've been here 6 times. The hey girl is my favorite and great balls of fire. The custard thing with crab at the bottom is great. The tasting menu is to die for. We absolutely love this place. The wait is challenging but if you get there right when they open you should be alright.", "author": "Shanea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "An excellent sushi dinner here with a daily menu of starter plates and fresh fish. An amazing dinner. I highly recommend!", "author": "Delilah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Went today to celebrate my birthday with good friends. The food was great and the sake was so good it was dangerous. The fish is fresh and for the price it is in San Francisco, it's a place I would recommend to others. The staff are really friendly, not overly attentive (not like those who comes every 20 minutes to ask if you are doing okay or if you want to order more). We stayed for awhile, made three different orders, and the last two were small orders. But the staff didn't make us feel like we have to leave right after we finished our food or we need to make decision base on their timeline. It was a very pleasant experience.\n\nThank you for making my birthday dinner such a good dinner.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I recently discovered this place and was SO glad I did. When we first walked in it was busy and had a great vibe and energy. We were greeted by a very friendly gentleman who brought us sake while we waited to be seated. Luckily we got to sit at the sushi bar and were able to watch the chefs work! As the dishes were coming out I was more and more impressed. The owners were very knowledgeable and friendly and the sushi was so fresh and tasty! I come to SF once a month for work and this will now be my go to sushi spot whenever I'm in town! Clean atmosphere, fresh fish, great service, and passionate business owners! Definitely recommend!", "author": "Monique L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "OMG Kuma, I heart you. I tend to only order nigiri when I come here, because they are just out of this world. I personally think their nigiri is as good as (if not better than) Shiro Sushi up in Seattle. The wait can be quite long since it's a small restaurant, so be prepared for it.", "author": "Lindsey O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "I had a short yet excellent meal at Kuma. The miso soup was unusually good, the service was quick, and my sushi roll was delicious (I had the Hey Girl with shrimp tempura topped with tuna and spicy mayo). They're doing a lot with a small space, and the ambiance is wonderful. Hard to spot from the outside - but that adds to the fun!", "author": "May C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Best sushi in SF. I bring friends here all the time and they think the same. Great service and even better atmosphere", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "This is honestly my favorite sushi restaurant EVER! Great food, very reasonable prices, and a great staff. This is the perfect place if you love sushi as much as I do and also a great place for date night.", "author": "Asante B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Good sushi! A tad overpriced on some rolls.\nOrdered Edamame, Hey Girl and Mango tango", "author": "DD P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "The food is great-- their specialty rolls especially the great balls on fire, half baked and hey girl are great. Nigiri taste is great: salmon is my fav. One star off because the waiter was very very very impatient and rude. He took away our menus even when we were ordering. Never checked in re: food or drink until we checked out.", "author": "Zhonghui Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Roy is the best one! He made the most delicious sushi I ever tried. Also, their sashimi is amazing, try it. Definitely coming up.", "author": "Olga Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Excellent quality fish.  The salmon belly and Fresh Hawaiian albacore stood out, and the sweet potato roll was surprisingly tasty.   Great ambiance and friendly service as well.  I highly recommend.", "author": "Charity F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Awesome sushi! Extremely friendly and great service! The sashimi is beautiful and not super expensive, highly recommend trying this place.", "author": "Robin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "I walk in for lunch and take a seat at the bar. Cool breeze comin in the door, light chatter, and a stellar and smooth 90s hip hop playlist bumping throughout. I look at the lunch specials and order a maki combo. Little did I know this also comes with raw kale salad topped with dressing that could make my kitchen towels taste good and a miso soup. Miso soup was solid, no complaints here. Then comes the maki combo. You're gonna want to hear this. \nI am handed a plate:\nCalifornia roll two ways - one heavy on the cado with a small but powerful piece of crab beneath. Delicious. Other one was like a seafood salad with cado, mostly crab in the salad. Money. Then some fat chunks of spicy tuna piled high with cucumber and the other usual fixings. Absolute fire. Then the shrimp tempura. Shrimp tempura to bring it home. You gotta be kidding me. But these guys don't kid. They don't hit you with a bunch of cucumber and squash rolls when you get the maki combo. They don't throw yesterday's catch along with a bunch of veggies on your plate. None of that. This place is real deal. They leave it vague on the menu, something like \"4 rolls, 3 pieces each.\" So you really never know; it's the lunch combo, a lot of places would screw you and give you very limited raw fish. Not kuma. These guys came to play ball. And as I'm sitting here waiting for the check I remember this whole thing was $15. I'll be back tomorrow, and I would highly recommend.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "My wife and I had a wonderful time here during the Christmas holiday. Service is great for such a busy spot and the food was delicious. This will be our \"spot\" when we are visiting the City.  We sat at the bar so we went home smelling like tempura, but it was well worth the quality of the fish and creativity on the menu. We'll be back!!", "author": "Marcelo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Sushi was Awesome! I would give this place 200 stars! Price was great, service was superb and place was so clean. When I come back, I will definitely be stopping by to try the octopus. I never knew you could add pineapple to sushi!!!", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Love! Fresh, delicious, budget-friendly, with a very kind and attentive staff. The kale salad and fresh roll were amazing. Thanks, Kuma!", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "This is food the way it should be done.\n\nThey add Wasabi to the Nigiri, as they should. Do not drown the sushi, because it's perfect the way you get it.\n\nEnough said.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Hands down the best sushi I've ever had, and not badly priced at all. All the fish was smooth and buttery; I couldn't stop ordering more. Will definitely be going back before I head home again! Well worth it.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I was incredibly fortunate to stumble upon this place this weekend when the city was usually quiet after the holidays. The sushi was incredible, really high quality and innovative flavors. And the sushi chef was a pleasure to chat with, in addition to providing perfect recommendations to our order, while turning out superlative nigiri. Not to mention the awesome octopus kirage appetizer and sake. Excited to return soon!", "author": "Valerie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "5 stars because the quality of food is excellent, service is quick and the waiters are kind, the ambiance is cute (clean, new, good music), and it's right next to my apartment. I will be here often :)", "author": "Selina W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-13", "description": "called ahead of time and was told 20 min wait for a party of 4. came in and sat there for 40 mins while they continued to sit smaller parties who came in and signed their names on the waitlist way after my family and i did. felt like they didnt want to seat us because i had my 9 year old daughter there. came to me after he cleared the list and said he can split us up into two separate parties, only after he gave away all the four person tables to couples. that was fucked up. either then that, menu is minimal and very tacky. wont recommend to other friends or family.", "author": "Jordan I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Had a great experience. Sushi was superb and enjoyed all the creativity. The owners were hands on and made the experience unique. Great and unique sake and look forward to returning on my next visit to san Francsico.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "5 stars due to their very good prices. My chirashi bowl was $15, and really good service. Their fish was very fresh, their rice was on point and their miso soup was remarkable. Will definitely come back.", "author": "SaNtiago R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Super tasty! This was one of the best little neighborhood secrets I have ever been to.  Fresh, fresh ,fresh sushi! Everything was so good.  I would recommend the hamachici!", "author": "Kathleen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "Extremely disappointed. Very poor customer service. My family and I were excited to try this restaurant because of the great write ups. We called ahead for a wait time for a party of 4. We were told 20 to 30 min. The problem was that they only had 2 tables for 4. The rest for 2. After an hour of waiting and watching 5 other couples getting seated ahead of us I asked the waiter. He was completely rude and unhelpful. We left and will never go back.", "author": "Kourosh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "This place is excellent. The fish is incredibly fresh, the service is great, and the place is clean and cozy. I'll definitely be back.", "author": "Callie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "It's been so hard to find a true sushi chef since our regular chef passed away a few years ago. Saw the high reviews and decided to give it a try. The reviews sure did not disappoint me and I thought it was very good. Every fish we ordered were so fresh and the chawanmushi was  one of the best I've had here in the states!  It will definitely be our go to place from now on.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Finally a great sushi place in San Francisco. I've been here for two years and have found some amazing places to eat but never sushi. This place has great service and fresh delicious food. The half baked roll was delicious and the hamachi hand roll was super fresh. Can't wait to go back!", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "This is without a doubt the best sushi I've ever had! Amazing flavors! If you love sushi, you need to eat here!", "author": "Marisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "So happy for Ryo, this place is so good! Definitely top of our list for Omakaze in SF.  The fish is always fresh, with a good Sake selection and intimate setting for date night or small group of friends.  Always willing to throw down for my friends who are hustling to make their dreams come true.  Keep it up man!", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-22", "description": "Small location, nice ambiance. However, we waited over half an hour for any food - only one nigiri chef, apparently. Usually places would give some appetizers for poor service like this, but we were just left with water. The more expensive nigiri was pretty good (uni hokkaido, toro, ebi) but didn't like the roll we got (mr.krab), and nothing special about the rest of the nigiri. Would not come back, quite expensive for the experience.", "author": "Stacy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "This place is BOMB. Great ambiance and the fish was fresh and very well prepared. The appetizers are also delicious and are prepared by a talented chef. Great Sake as well.", "author": "Jake L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "I went here last night and had some of the best sushi I've had in a long time. The menu is creative, all the flavors were bright, and the decor was modern but welcoming. I had the hamachi (excellent) and the rainbow roll (good). I also had a few bites of my partner's spicy tuna roll and found it uniquely flavorful.", "author": "Charlie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "My go-to is chef's sashimi, however, it was an especially nice selection including toro. The chef was also especially friendly & knowledgeable in general with friendly recommendations. Grab a drink across the street while you wait :)", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "This was the only sushi place I tried while in SF so I can't comment on how it compares locally, but the fish was very fresh and the presentation was great. The prices are very reasonable ($6-12 for rolls) so this would be a staple for me if I had stayed in the city longer.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Food is yummy and fresh, service is great, chef is friendly, environment is ambient. I will come back again!", "author": "Janice S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "I work at a high end sushi restaurant in Boston so my taste for good quality sushi needs to be fulfilled often.... and Kuma was exceptional. Very friendly & helpful service, and more importantly the food was phenomenal. Miso soup and seaweed salad were fresh and well prepared. I had the Hey Girl roll and I would HIGHLY recommend it. Shrimp tempura with avocado with raw tuna on top, eel sauce and spicy mayo, it was delicious. So fresh and unique! I will be going back before I leave SF next Wednesday. Thanks again Xo", "author": "Madison R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "I'd give 5 stars if not for their super super super slow service. The dish tastes really good though, but not good enough to take that long for the whole experience.\n\nYou will expect to stand there 5 minutes before seated and another 10-15 minutes to get ordered. After that another 20-25 minutes for the main dish to be served. And the main dish is just sashimi over rice. I didn't have time to wait for the staff give me receipt, so I had to look for him. Probably won't go again for lunch. Basically for each service you need to find the waiter by your own.", "author": "Xiaochen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "I really really enjoyed our dinner at Kuma, even though we went on the hottest day ever in SF. The quality was great and the price was even better. About time a place like this opened in SF! The spoons, especially the uni and avocado, were amazing. The sake sampler was also tasty and showcased a range of different sakes. My only gripes are that they let people sit at the bar with a seat left in between parties. This left two single seats which easily could have sat another party (myself included as I always prefer the sushi bar in front of the chefs). Additionally we ordered another set of spoons but never got the order. Fingers crossed that this place stays a secret so the wait isn't too long (they don't take reservations) but I know people will find out about Kuma sooner rather than later. In any event, it's highly recommended!", "author": "Cathy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This place is sweet. The setting and decor is on point and makes it to be a great date place as well as a quick sushi bite. The hostess was nice and was prompt with our orders. I've been to others and had orders take long and even times where they forgot our orders, so this is much appreciated. Great place, I'd come back again.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "This is one of the best sushi restaurants I've been to in San Francisco. The place itself is small, but the decor is great and tables/bar seats are well spaced out. The panels behind the sushi bar are really nice but my favorite is the wooden shelf. The food is incredible and staff is extremely welcoming and accommodating. They definitely pay attention to their customers. All the dishes I had were delicious - highly recommend the miso soup, steamed egg dish, Mr. Crabbs roll and basically anything the chef recommends. Will definitely be going back regularly!", "author": "Pamela V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Had an excellent meal here for their grand opening. Decided to try it on a whim and was not disappointed. Chef is very knowledgeable and staff are very pleasant. No line because it's new. Very fresh sushi with unique roles that I haven't tried elsewhere.", "author": "Jeremiah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Amazing sushi and awesome chefs who are friendly and kind! Half baked is awesome and they have a rotating specials menu with seasonal fresh sushi that always dazzles", "author": "Jay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Ask for Rio or John. One of the better sushi spots I've gotten to eat at in sf. Great price and excellent quality.", "author": "will l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "I was pregnant and went here and ordered the great balls of fire (they are deep fried). It was sooooo good I ordered another order. My husband had nigiri, and would've liked more of a selection of fish but it was good nonetheless. I'd go back for the great balls of fire any day.", "author": "Sabi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Fresh, beautiful plating, amazing service. 5 stars all around. Finally found my favorite sushi spot in San Francisco (nothing comes close to Kuma!). Sake flight is great, highly recommend sitting at the bar. And ORDER EVERYTHING. Enjoi my friends!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "The best sushi and sake I've had in years. If you're looking for amazing sushi and you want to taste some fantastic sake for lunch or dinner, this is the spot.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "This is the only sushi spot I need for the rest of my sushi eating career. Excellent menu and sake list. service is precise and elegant.", "author": "Brewbacca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Awesome sushi place, it's not Nobu but it's reasonably priced and the quality is excellent", "author": "Felix P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Super mellow sushi place with a nice staff. Would recommend for a local place that's quiet. Will be neck again.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Stopped here last night for dinner unexpectedly, and I'm really glad I did. I had the Half baked, Great balls of fire, and the Hey Girl. Every dish was incredible! The food came quickly and the staff was very attentive! Definitely coming here again!!", "author": "Ren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Fantastic sushi in the neighborhood. The service is great and the sushi is always perfectly fresh and delicious.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "I like their neat interior and presentation. The Chef is very friendly and the food was delicious. Clean table coordination goes well with their food plate and presentation. I would come again.", "author": "Eunice P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "The atmosphere was bustling with good conversation to accompany great food.  The service was excellent and the selection was phenomenal. Fresh,  delicious,  and memorable.", "author": "Gloria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "So many reasons to like this place: menu on the door, $16-17 sake sampler (you get to try 3 and there is a solid amount in each glass, so pretty much, 3 drinks), it's not too loud, they are open relatively late, the lighting is good (not to bright, not to dark), the service is excellent, and they have marimo moss pets in their bathroom (as well as a stash of pads ans tampons! Thank you!). Overall, great experience.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Just stopped by for a bit of Sake and was blown away by the attention to detail, freshness of\nSeafood and conversation!  Ended up trying 4 incredible dishes. As a chef from this neighborhood I'm so excited to have this spot down the street!", "author": "Gabe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Friendly staff and great sushi, especially for the price point.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "The food was decent but not as good as I had expected.  They added several twists to popular rolls that just made it taste bad.  The salmon avocado roll has a slice of lemon inside (including the lemon rhyme).  That totally ruined the taste.  After removing them it was better.  The fish was fresh.  The staff is super friendly and helpful. I know they are new so hopefully they can work out some of the beginner kinks.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "we loved Kuma sushi! It was super busy the night we dropped in, but the staff was so accommodating, seated us right away, and encouraged us to try the delicious green tea ice cream which was SOOO good. The meal was so fresh and we had a great time. Will definitely return!", "author": "Haley D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "Went here for Mother's Day lunch. Place looks decent from outside.  Us and another lady couple were the only ones waiting when it opens.  The guy who opened the door (has tattoos) was so rude and that's before we even go inside. I offered to help hold the door and he declined rudely.  Then we happened to stand in his way in putting his standing signs by the door and without asking politely to move out the way he just put the sign.  Then we got in, when we told him there will be party of 8 (5 of us already there), he told us we can't b seated until all arrived.  Mind you there is no one else in the store except the other lady couple.  So we decided to change to just us, and when my mother-in-law started to sit down, he got upset for that.  He said he needed to reset the table.  That was the last straw....on Mother's Day.....we decided to just walk out...and went to moon star and stuffed ourselves. Glad didn't waste my money in that lousy bad customer service place.  Let's see how long this restaurant will survive with that kind of service in this neighborhood!!!", "author": "D T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Fantastic sushi place, every single choice was amazing! And the service was very friendly and smiley!", "author": "Dimitra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "Very good sushi, nice sake menu, and friendly service. The rolls were very good (salmon avacado, kuma, fresca, konteki), the sushi was good (magurozuke - a type of tuna). the only dish we were not crazy about was the ponzu. recommend/worth it if there's a wait ...", "author": "john r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "Great quality fish, subpar service. Dishes came out in bizarre order all evening, got my edamame halfway through my meal and the staff completely forgot one of my appetizers admitting that he \"gave it to another table\" and then proceeded to say \"my bad.\" I think this is a great staple for the neighborhood but tbh I'd rather go to Domo in Hayes. Similar vibe, more fish choices, better service.", "author": "Cassidy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "The food was amazing- we had the baked crab roll which was the best piece of sushi I have had. Great atmosphere, great saki. The reason I give it 3 stars is the location. After dinner, My friend was assaulted by a man trying to get her purse right to the left of the restaurant on our way out. Go eat here, just please get dropped off right at the door.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-11", "description": "Came here on a Friday night and was able to be seated at the sushi bar immediately. The fish was very fresh and I opted for the $36 chef's choice. My biggest gripe is about their portion size. The cuts of fish were very thin and small and the flavor was a bit bland for a chef's choice tasting. I expected more continuity in the flavors but the only word to describe the taste was bland. Ikura and uni portions were tiny although the ikura was seasoned very well and \"popped\" in my mouth", "author": "Bobby D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "The sushi here was pretty good. Fresh. Nothing out of the ordinary and nothing that makes me crave it and want to go back, but it was good. 3.5 stars.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "My boyfriend and I are big fans of Domo sushi in Hayes Valley so when I heard that Kuma opened up I knew we had to give it a try. We happened to dine here during their soft opening so at the time they were still working on smoothing out the final menu. Service was a little slower than expected given the amount of patrons in the restaurant but the food was very comparable to Domo. We tried a variety of items: ebi, tuna, salmon, yellowtail, marinated tuna. All the sashimi was fresh and delicious. Would def recommend Kuma!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "I sat at the bar and had an enjoyable experience at this new neighborhood sushi spot. The sushi chef, Ryo, was a good conversationalist and made me feel very comfortable and welcome despite the fact that they were quite busy.  I ordered the eight piece sushi tasting. At $32, I thought it was good for the price.", "author": "Tyler H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Fresh delicious sushi, great service! Had the sushi assortment, 8 different pieces that were all beautifully prepared. The rest are magic mushroom roll and hamachi all perfect. Would highly recommend", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "Very small place, nicely decorated interior, overpriced sushi and small portions.  Left feeling hungry and with a large bill.  Sushi was decent but nothing spectacular.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "I'm very picky about sushi being a Southern California native and frequent traveler to japan.    And when I saw this place from the outside, I was hesitant to go in.  The building is old and ugly and the street not that smart.    But once through the front door it was far better.    Excellent service In a small sushi joint.    Highlights where the miso soup, generally something not a highlight food but this is the best miso soups I've ever had and the big rye tuna was very moist and dark red the way it should be.    I found the \"great balls of fire\" to be avoidable , but the service and overall quality of sushi excellent.", "author": "Phil B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "We very much enjoyed our dinner at Kuma. We arrived early on a Saturday night and it wasn't too busy yet. Everything we had was fresh and tasty. My favorites were the Half Baked, Sweet Potato and Hey Girl rolls. Can't wait to go back again very soon!", "author": "Ellie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "This was the first time we ate at Kuma. The place was immaculate, the service excellent, the food delicious and fresh. It was worth the wait.  We will certainly be returning!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Great quality food, authentic taste, and they more than made up for the spotty service when we pointed it out. Polish the service and it'll be a hit!", "author": "Hannah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Outstanding sushi & saki, great staff willing to give welcomed recommendations, and an overall great atmosphere. 5 stars.", "author": "J H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "The sushi here was very good. I greatly enjoyed the meal and enjoyed the atmosphere. The place is a bit small, so there was bit of a wait. (I went at 8pm on a Saturday night). However, it was worth the wait and I would come back.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Been there twice and going back - best Sushi experience I've had in many years.  The space is welcoming, kind of industrial but warm, with a great neighborhood feel, and a diverse, lively clientele, The service was perfect, friendly and attentive but never hovering or rushed. The food was amazing!  All this delivered with a smile, for a fair price.  About the food - that was the best part!  An artful treat composed to satisfy all the senses - nuanced, subtle. Try to eat slowly so you can appreciate it!   Everything I've tried was delicious great, but I especially loved the Anago - local saltwater eel, specially prepared, never had it before [and I'm a huge Unagi fan - come meet its saltwater cousin!]; other winners for me: Osuimono, a clear soup based on stock from the days fresh fish bones with shitake, tofu and kelp - really great!  I have to recommend the Kuma Roll too, it was delicious.and like everything else beautifully prepared and kindly presented.  My friends loved the Sake, but it's not my thing - I ordered a rose, to my delight it paired beautifully with my meal as well. The whole experience was so well thought out, doubtless because the chefs are the owners, have decades of experience making sushi, and it shows! I've seen Polk Street evolve over the last 30 years, Kuma is a welcome addition to the neighborhood.  I would give the place ten stars if I could!", "author": "David D."}
