{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "it was delicious the best pupusasI ever ate!\nit is a clean family environment with great food that welcomes the public to come enjoy a foreign taste\nit was good yeah yeah!", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Best papusas I've had in the city so far! They were super cheap and really large (about 2 could fill me up easily, 3 if I was really hungry). I ordered the revuelto con frijoles and chiccaron papusas. I preferred the former as it had a lot more flavor while the chiccaron was just meat (which I should have expected...). The place was pretty crowded, but it didn't look like people were waiting for a table so I'd say the turnover rate is pretty reasonable. \n\nOnly thing I was a bit disappointed by was the horchata which tasted watered down yet full of an unusual spice. It might be the Morro seed or something else that was not typical in Mexican horchata but i was not a fan. Overall really liked the place and would come back for cheap and tasty papusas.", "author": "Edmund L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "My opinion not worth 5 stars! Place itself is really small maybe ten tables at the most. If you do eat hear consider having a audience of people standing by the door watching you eat and ready to take your table any second you get up.\n\nFood was ok but not worth the price . I can say their are tastier Salvadoran restaurants basically in every block on mission and have better pupusas and the price is about 1.50 to 2.00 a pupusa . Another negative for me was that it doesn't matter if you order two pupusas or five they only give you a small portion of curtido which is the cabbage slaw that goes with it and if you want more it's extra $$! Seems like Their is a up charge for everything hear!\n\nAlso keep in mind that if you order to go it's an up charge so I would reconsider taking out. And it is a cash only place so keep that in mind as well.. \n\nAs for me I won't be coming back again but it was good trying it and giving you my honest opinion.", "author": "Mirna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "This place by far has been the best Salvadorian food I've ever had! The pupusas were super delicious, great flavor and texture. I also would highly recommend the yuca Frita con chicharron. OMG! It was so good I couldn't stop eating! It comes with a sauce poured over it and it just completes the taste. Overall a great place to eat. Very friendly employees. Only thing is that it is cash only, but there's ATM machines close by. Will definitely be making this my go to pupusas spot.", "author": "Diana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "I cannot even begin of saying how delicious the pupusas are at this restaurant. And that goes to say a lot because I do eat a lot of pupusas made by different people and restaurants. This restaurant is very clean, the staff is very friendly, but very small. Sometimes there is a wait for seating but we have no problems with waiting because we love it here. Many times we have ordered different things like the chicken soup or the eggs, beans and cheese or the fried bananas and never once have we ever been dissatisfied.", "author": "Diana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "One of the best in Sf Mission District. Been coming here for years. Introduced so many. Pupusas: the best in northern Cali. Fried yucca...must have. BUT: the tamales are exceptional. Mission District is historic and alive.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "PUPUSA REVIEW:\n\nHoly moly. $7 pupusas with rice and beans?! YES YES YES. I thought I could only get this deal in the South Bay outside of the city, but La Santaneca makes it accessible to feel full, not broke, and enjoy a warm meal in a neighborhood favorite. \n\nThe only slight sad part is that there are only two veggie versions of pupusas, but that's perfect because their pupusa deal gives you two. I had the queso and loroco (wildflowers!) pupusas, which I highly recommend and will definitely order next time I come in. The loroco is a wildflower apparently, and the flavors are definitely more earthy and special however not empowering. The boys also got fried plantains which can be ordered as a side. Portions are huge and filling--my favorite! They serve water upon request and have juices and other drinks available. Almost everyone sitting inside that day we ate there (late lunch) was of Latinx background. I definitely felt like I was eating authentic food at a great price deal! \n\nThe service was a bit slower than I expected, but the tables did always seem to be full. Servers were fast to take our orders, but the food cooking took longer than I thought. We definitely waited 20-25 minutes that day for our pupusa orders. Before we were seated, we had to wait about 8-10 minutes even during the middle of the day! They also have a cute restroom sign and very quaint decor. It makes me feel very at home. It's almost as good as my favorite pupusa place in the South Bay, but it stole my heart for being a great SF place for properly-priced-pupusas.", "author": "Jodi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "Small place with most of the tables full. We arrived well since we had a toddler with us and were able to be immediately seated. They have a sign that says the food takes about 20 minutes as it is all made fresh once ordered. I had the grilled chicken which was a generous portion with rice and received beans. I also ordered the pickles cabbage which was cabbage made with an oil, vinegar & Mexican oregano dressing; very tasty. By the time we left, there were people lined up put the front door waiting for tables. I'd eat here again!", "author": "Terese C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "First experience with Salvadoran food and it is close enough to Spanish and Mexican food.  This place is filled with locals so they must provide authentic Salvadoran food. \n\nOf course i have to have the well-known pupusas, prices are extremely reason $2 - $3 per pupusas with a minimum order of two per customer.  I arrived just before the lunch rush and waited 10-15 minutes.  The place is small and busy, need to have a better system or sign in system for a table.  Few customers just walked by us wanting to sit in the next available table.  \n\nI order two pork pupusas, it is thick tortilla stuffed with savory ground mesh pork, it also comes with cheese and bean, or pork and bean. The texture of the pupusas is chewy and doughy the pork itself has a natural meaty taste, but not crazy about pork finely meshed.  The rice is light and fluffy.  Very interesting, I would say it like quesadilla with a thicker doughy crust.  Interesting food.", "author": "Frances C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Reviewing AGAIN because I decided to bring family here last Sunday and MY GOODNESS I fell in Love all over again and remembered to snap a picture (barely but it still looks decent lol) \n\nthis place is freaking amazing!!!! I want to build a small house in the back so I can eat the pupusas everyday. I need it, I need it, I need it!!!! \n\nI got the fried yuca with chicharrones this time as well and DAMN it's good! That's the empty plate you see in the middle of my picture, clearly I'm not lying. Everything here has to be good, I'm convinced. I will be here every time I visit the city, thank you Mission.\n\nP.S. this place is CASH ONLY! No way around it, but if you do forget there's a bank of the west ATM across the street. They take $3 from you so try to remember CASH ONLY :)", "author": "Leslie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "Some of the best pupusa in The Mission!! I dare say it, may be even in the entire SF Bay Area.  This is the real deal, as good and authentic as it could get!  La Santaneca have 2 location, another one in Bernard and they both get crazy packed.\n\nIf you are not familiar with pupusa, they are a traditional Salvadoran dish of a thick corn tortilla stuffed with a savory filling and served with coleslaw.  You can never go wrong with the Revueltas (pork & cheese) or Chicharron (pork).  If you are looking for vegetarian options, there's also the Queso (cheese) or Frijoles (beans).  Not only are they filling, they are very affordable too!  At only $2 - $2.25 each, order a few and pair it with some rice & beans or a sopa (soup) and you're solid.  It's one of the tastier and more affordable meal you can still get in the city!  \n\nAside from pupusa, they also serve up other traditional Salvadoran dishes including sopa, tamales, fried yuca/plantains and desserts.  Take a look at their drink menu too, they have some tasty juices as well.\n\nWhile service is always friendly, do expect a wait and service may be a bit slow, especially during lunch hours.  Don't forget to bring cash too, cash only.", "author": "Janetto L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Now this place turned out to be really good.  It looks like a counter service place, but it's actually table service.  There's a sign up saying the food can take 25 minutes, but my chicken dish was much faster than that.  What I ordered was chicken with onions, which turned out to be three large and fairly crispy pieces of dark meat, drenched in a slightly creamy but very light tomato sauce just loaded with crunchy but adequately cooked pieces of onion.  Extremely good food.\n\nSigns all over the restaurant said they were out of pupusas.  Don't know what's up with that.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Never had rice pupusas and they were bomb!!! Love coming here for pupusas. I should probably try other stuff on their menu", "author": "Bonnie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "The best pupusas in the city, maybe in the entire bay? \n\nFood: If you're committing to the line at La Santaneca you better be ordering pupusas. My favorites include the revuelta (pork/cheese) and the queso con loroco (sour cheese). Most people enjoy the revueltas and this one is worth indulging over, the pork is always tasty and the portion of cheese to pork is fair. The cheese and pork melt right into each other. I love the Queso con Loroco, though most of my friends are not fans and/or rather just order something else. The texture of the cheese is similar to fresh mozzarella, but the taste is rather sour. I recommend trying the Queso con Loroco at least once, it's very unique since Loroco is an edible flower that is specific to Central America. Take advantage of the $7 plate which includes two pupusas, rice and beans. Seriously major bang for your buck. I've also had ordered their chicken soup which is hearty and on the healthier side. \n\nPrice: Super fairly priced. Portions are generous, prices are just right.\n\nAmbiance: Lively, busy and loud. \n\nService: Friendly and quick service without feeling rushed and like they're solely in the business to make money.\n\nOverall: Authentic, tasty, affordable and just the best pupuseria in the area. You must try it!", "author": "Astrid Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "Calling many times,  don't answer the phone,  after many times trying answer whit bad attitude and say if you want pupusas we don't take orders and hang up", "author": "Oscar V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Authentic place for Latin American food. Line can be long on the weekends but moves quickly. \nTried the chicken enchilada and steak plate with a side of platanos. Everything was really good!", "author": "Coralie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Such a cute little spot. I really really liked the staff. And the fact that I was seated right away. The food was great and very authentic ...", "author": "Vika S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "The food is great! I usually call in advance to order my pupusas since i work a few blocks away and i dont have a long lunch time. But this time when i called they said they dont take phone orders. I told them that last time I called and they took my order. Which is only 3 pupusas, but he said no they dont, that i have to go in person and order. So i said sure! The gentleman who took my order made sure I got my food as soon as it was ready.", "author": "Avelyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Clean and casual.\nService could be more friendly\nPickle cabbage is just enough for 1 pupusas, I feel that they can spare to give you more.\nPupusas flavor was amazing. \nGive them a try.", "author": "Yohanna B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-24", "description": "There's not many tables so the wait is very long. Also, If you want to take the pupusas to go they charge you about 1.25 more for each one and they also charge you for the curtido. The service sucks. They never check on your table you have to look for one of them if you need something and most of the time it seems like they try to avoid you. The only reason I keep coming back is because they are the best pupusas I've ever had and also because taking it to go adds up.", "author": "Frederique R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Bean-only pupusa for vegans. Rice + beans combo is a good value.", "author": "W T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "The pork, cheese, bean Pupusa was amazing. The salsa sauce made it even better that it already was. \n\nI had the entree of grilled prawns with garlic and mushroom. It was in a herbed clear sauce which had a scampi-like gloss and sheen which suggested a good amount of fats in it. The sides of refried beans and seasoned rice rounded out what was a truly delicious meal!", "author": "Umesh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Note: Cash Only\n\nFirst heard about this place from an Uber driver a couple months ago who swore up and down by this place. He lives far away, but sometimes on the weekends his whole family will make a trek to SF just to eat here. Okay I'm sold.\n\nFast forward a couple months, and I finally had a chance to come here with a friend for dinner Saturday around 5:30. The place was full and there was no place to write your name, so we just stood in the entrance area for 10-15 minutes until we got seated.\n\nWe shared some pupusas and also a larger plate as well. Their pupusas range from $2 to $2.50, or you can order their pupusa combo for $7, which comes with two pupusas with rice and beans. The fillings they offer are mostly some combination of pork, cheese, and beans, though they did have one with cheese and loroco, which is a type of Salvadorian flower.\n\nAccording to wiki, a pupusa is a traditional Salvadoran dish of a thick corn tortilla stuffed with a savory filling. I've never had one before and didn't know what to expect, but I loved the chicharron pupusa I got with pork only. They're definitely on the smaller side, but the chicharron filling was generous and perfectly seasoned. If I had been hungrier, I definitely would have ordered more.\n\nI only took a couple bites of the larger shared plate--carne guisado (stewed beef with vegetable)--as I wasn't too hungry, but I was very impressed with how tender and flavorful the beef was. For $10.75, you get a generous portion of beef, rice, beans, and veggies.\n\nI loved my meal here but want to come back again when I am hungrier for the full experience.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "*CASH ONLY\nThis is a cash only restaurant; although not a deal-breaker , definitely not convenient. It's a pretty small restaurant has more of a strip-mall feel to it but it is warm. There's black and white framed photographs that definitely add to the ambiance and appeal. The food was good; there's really sexy waiter there with an accent ; definitely a plus! Lol ! All in all it was a good experience and I do recommend it. Lastly, I visited on a Sunday evening (around 5pm) it was somewhat busy, and by the time I was leaving there was a line formed outside.", "author": "Genaro L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "This place does not have much vegetarian options in the menu, however the staff was very helpful in providing/pointing out the right options.  We ordered pupusa with bean and cheese, and fried plantains it was very good.", "author": "Goutam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Don't go if you're in a hurry. But, do go if you want good food caringly made. For as popular as this place is (it is frequently full at dinner time), everything tastes like it is freshly prepared.\n\nThe papusas are excellent.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Very yummy pupusas! So happy to have come here with my family! Very nice service! Excellent food!! Taking some to go too!!", "author": "Katherine H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "How are you going to take your most popular dish (the pupusas) and stop making them for awhile because the restaurant gets too full? Last week the restaurant made the decision to stop making them....people go in and then leave because you doesn't want to eat pupusas?! Insane\n\nTravel down to 18th and Capp for the recently re opened and remodeled Balompie. They always have better pupusas down there anyways. \n\nAnd hey, if the food is good, then it's worth waiting in line a bit for them. Right?", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "This restaurant never fails me!\nAlways great service and amazing food!\nFood takes a little long to come out and that's b/c they are making it fresh!\nAlways a pleasure to return.\nCASH ONLY.", "author": "D M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-11", "description": "Thieves. They do not provide you an itemized receipt. They give you a grand total and over charge you by as much as $20. \n\nThe food is delicious if you don't mind getting ripped off.", "author": "Rocío G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "I love this place when I get a chance to come. The only thing I am not happy about is that I can no longer make phone orders for pick up. Makes me sad, but that won't stop me from coming in and eating pupusas.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "Not sure why, but the restaurant has temporarily stopped making papusas. We went here specifically to get this item but they didn't have them. I thought that was strange since it's a Salvadorian restaurant. So since it wasn't available, I tried some other things on the menu. The chili relleno de carne (pork stuff bell pepper) was decent. The plate came with rice and refried beans and corn tortillas. I stuff pepper was ok, but I really liked the rice and beans with the tortillas. I also tried the garlic prawns dish with rice refried beans and tortillas and this was pretty good.\n\nThe restaurant was clean and the bathroom was clean which is a plus in my book.", "author": "Ali F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "I love this place!!!\nWe go there once a week if not two. \nIt gets crowded sometimes but it's worth the wait. \nThey should have more small tables (for two person) so we don't have to wait so much. sometimes there is one person on a four people table, taking their sweet time to eat  just a suggestion!", "author": "Karla R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Surprise find!\nMy hubby and I thoroughly enjoyed our breakfast: Carne desilachada (shredded beef mixed with 2 eggs, bell peppers, onions, and tomatoes), eggs not over cooked. I had the Lengua en salsa, the tongue was tender and tomato sauce delicious.  Even the refried beans were tasty.  The portions are generous to the point that we had leftovers for another meal. To validate my point, my 15 yr old son scarfed up my lengua leftovers as soon as I got home and he has a particular palate. We will be back!", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "As authentic as it gets! Food is cheap and cheerful and reminds me of home cooked Latin goodness.\nService was excellent, we were even accommodated when we ordered off menu.\nExpect to wait outside for a table. There is no wait list or reservation system so watching other people eat and being patient is part of the experience. Makes ou appreciate it more!", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-06", "description": "The whole experience was just bad! We came in and no one noticed us and as we sat down I tried to give one of their employees a sign so we get menus and when we finally got them he left without even asking us if we wanted something to drink. My boyfriend wanted to eat pupusas and we noticed they were crossed off from the menu and we just wanted to double check with the restaurant but we never got the chance bc they took so long so we left :( \n2 stars = I've tried their pupusas and they're decent but you can find better", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "This is probably my favorite salvadorian food place. I've been coming here for the past two years and the food is so good, the pupusas are delicious which they were the main reason I would come here. Sadly they're not making any pupusas right now they haven't for the past month or two. I heard the owner took them out off the menu because he wants to see how many people still come to eat here even though they don't serve pupusas since they' cheap and they don't make so much money off  them. I'm pretty sure they are bringing them back soon. Overall very good food, but also very tiny spot, have to look out for people leaving to get a table and you sit yourself.", "author": "Genesis R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "This place is a gem, great food affordable price. Was in town for doctors appointment and decided to explore area, the place is small but you won't be disappointed. I had been craving Pupusas and these had my mouth watering. Highly recommend giving this place a try next time you're hungry.", "author": "Lance R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Came here after, after going to another place down the street that was closed. My husband ordered the chicken burrito and I had the pupusas revueltas. They were hella good! Not greasy at all! My husband said his burrito was very flavorful too!\nThe cons are they are cash only, and always busy! You can't expect to be in and out. Plus, I didn't like the fact that they brought my plate out first, and we had to wait 5 minutes for my husbands. That is very irritating. I can look past it, I hope it doesn't happen again. But I will definitely be back!", "author": "Jeannette C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "Can't order pupusas to go anymore so I won't be coming here anymore...I guess that's what happens when you start getting alot of business. You don't care about the people that have coming eat here since forever...", "author": "Bob D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "I've only been here once, but I can't stop dreaming about the pupusas. Right now I'm drooling thinking about it. \n\nIt's a little restaurant in the mission and the wait isn't too long. It's cash only which is a small inconvenience, but it's not hard to find an atm or bank within the area. \n\nIf you're in the area, definitely check out this place. I've been waiting to go back since.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "Decided to stop in because it looked popular and La Taqueria was closed. I'm glad it was closed because I enjoyed this more. There was a bit of a line, and the food takes a while (which they warn you about on the menu), but it was worth it. I had the huevos desilachada and really enjoyed. The beef was decent, the eggs were good, and the sides were terrific. Everyone I was with enjoyed their food too. The servers were friendly and helpful and the price was pretty good.\n\nIt's kind of awkward but also entertaining to wait in line for the bathroom in the kitchen.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "I have loved coming here for a long time and enjoyed their pupusas! When looking at the menu I realized the pupusas were not on it and so I asked if they were serving them and the answer is NO. They're no longer serving pupusas and didn't say as to why. Unfortunately, I did not stay for another dish because I come here specific for pupusas. I am more than happy to change my review to five stars if the pupusas are back on the menu, they're my favorite and very popular.", "author": "Orlenda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Excellent food in the mission. Their menu warns you that it can take up to 25 minutes for the food, which it did. But when the food came it's worth it. Simple, good portion size, and affordable food in the San Francisco. Really pleasant surprise as we wandered in randomly and really enjoyed our meal. Service was good and accomodating of our group.", "author": "Winnie Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "I am so disappointed!!! I've been coming here 28 years and never have I heard we couldn't order take out. The lady who answered the phone was very rude. Hung up on us three times!!! We come here exclusively for the pupusas!!! And not being able to order them to go is ridiculous!!! Horrible experience. So disappointed. Management has to change back to the old times.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Best pupusas in the Mission! Cash only. \n\nFOOD: Ordered one of each pupusa and the chile relleno. \n- Pupusas each had a lovely ratio of filling to masa outer\n- Chile relleno was flavorful and not too heavy on the cheese. \n- Vegetarian friendly! I brought a vegetarian friend here, and in addition to the standard veg bean/cheese or standalone cheese, you can try more exciting things like loroco (a flower). \n- Inexpensive and casual, but do expect a wait at peak times. Definitely filling. \n\nSERVICE: Very friendly--we walked to the back to ask for a table (not sure if that's what I was supposed to do) and were quickly sat with some menus. Servers were very patient in answering our questions about what was and wasn't vegetarian. \n\nAMBIANCE: Cafe style, with booths and tables filled with locals. A cozy place that's filled with a lot of families and friends catching up :). It can get a little noisy in the small space, but never overwhelmingly so.", "author": "Helen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "I went to La Santaneca during Carnival for some pork pupusas and plantanos omg everything was delicious!!! The horchata wasn't too sweet and very flavorful... I enjoyed every part", "author": "Nika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Great pupusas but the service is a little slow. Definitely worth the wait. I definitely recommend you try the mix pupusas and the strawberry shake", "author": "Hugo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "BAD NEWS & BTW, I love this place!\nI went to eat here last night and there is a sign stating they are NOT selling pupusas indefinitely after Tue!!! OMG - Also, that long line that I always wait on to seat, was gone, surprisingly there were empty seats, which that never happens, so I asked my waiter what's going on with the \"no pupusas after Tue\"? He said they need to replace the cook. BTW, the damn salsa for pupusas was so spicy! SALVADOREANS DO NOT ADD SPICE TO OUR SALSA FOR PUPUSAS, Santaneca you got that wrong. \nI am dissapointed", "author": "Cris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Really love this place. The food is delicious, and the pupusas are fresh and tasty. The other menu items? Also very good, but it's difficult NOT to get pupusas. I also like that it's open for breakfast.", "author": "Jason P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Chile relleno \nBean papusa \nCheese and pork papusa\nTamarind drink\n\n$18\n\nNot much pork in papusa. Seemed like a cheese papusa. The Chile relleno had beef in it too which was weird\n\nService is inattentive but they are super nice. Maybe too busy?\n\nI liked it all but probably order differently next time", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "My overall impression is that the place is ok, but not great. Maybe we didn't order the right stuff but the food was pretty average. The dining room was packed with Spanish speakers so I'm assuming the restaurant is at least authentic, although I've had much better food else where. \n\nWe shared the fried plantains, one order of the meat and cheese pupusas, one order of the zucchini flower pupusas and the combination platter with chile reano and tamales. \n\nThe plantains were not very ripe so it wasn't great. Maybe plantains just aren't in season yet. The pupusas were ok. They were definitely hot, but personally, I prefer a pupusa with thicker masa wrapper than the pupusas at this place. I felt like I was just eating melted cheese and not much else. The combination platter was the low light of our lunch. The chile reano was so salty and the shredded pork was stringy and there's not enough fat mixed in. The tamale was this huge blob of masa, but it didn't have any great flavored or filling. The best part was the retried beans on the plate. \n\nMaybe we should have ordered a soup or something, all in all, the food was average, nothing special.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "There is no place better than La Santaneca for pupusas! I've been going here for at least a decade, had one of my 40th birthday dinners there (and then heading off to Mission Pie) and, now, try to stop in when I visit friends of of 24th Street BART. My/our go to are the revuelta pupusas and plantains con frijoles y crema. I heard that it closed recently, which was heartbreaking and, apparently, a lie, thankfully. Long Live La Santaneca!", "author": "andreana c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "One of my favorite authentic Salvadorian restaurants! Me and my family would come here all the time especially when we were taking my grandma to SFO for her annual trip to El Salvador. The food is amazing and the staff is friendly. I'm bummed that I live in the east bay and don't get to go as often as I want.", "author": "Simone D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "Pretty fast-paced place to grub, but if you get the chance to sit and eat it's quite relaxing.\n\nThe food is pretty friggin' cheap--a plate with two Papusas, beans, and rice cost 7 bucks. Leaves you full enough to tackle the rest of the city at a great price.", "author": "Benjamin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "I'm Honduran so I know pupusas and these are the best I've had in a very long time. The service was A1 and my waitress was very sweet. It was super busy when I arrived no seats were available but it didn't stop them from seating and serving me in seconds.", "author": "Claudio A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Best Pupusas, plantains, and beans in the entire Bay Area. The beans really set them apart from others, as does the cheese/Pupusa texture. Love them!", "author": "Miss B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "My freind can to visit me and decided to try this please. Have to say just okay. Service forgot a couple of request we where waiting and waiting and never came  . Probably not come back again", "author": "Alessandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "The best pupusas I have had in a long time.  Authentic and delicious.  They really taste just like my grandma's.  Revueltas had the perfect mix of cheese and pork, and the queso was also so good!! I love their salsa too! I will definitely be returning when I come back to the city.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "The best pupusas in town! I've been to many other Salvadorian restaurants, but this one is the only one I always come back too. Great food, great service.", "author": "Milos L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "This is a delicious restaurant for inexpensive but so delicious pupusas.  The staff is so friendly.  Their menu has a great variety.  I would definitely return.", "author": "Dahlia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "If you're from the Mission, then you grew up on pupusas from La Santaneca. \n\n$2.00-$2.50 for pupusas.\n\nIt used to be all Latinos that came here, they still do, but ever since the gentrification of the Mission, it's become so popular​ that wait times can build up to two hours for a table and food. \n\nWednesdays they are closed.\n\nThursdays are not as busy.\n\nCash only. \n\nEverything is on point here. If you love Salvadoran comida, then this is the place for you.", "author": "Angela B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Have eaten here several times, always packed but never a long wait. Filled with families, multi-generational tables (and a refreshing, conspicuous, lack of Mission hipsters. Sorry, Mission hipsters). The food is exceptional. Menu has mix of Mexican & Salvadoran dishes, thoughtfully prepared w/ the 3 ladies cooking taking their time. Standouts, obviously, pupusas. The pork chili relleno is amazing. Soups are terrific as is the banana shake...not too sweet, super refreshing on a hot day. New favorite for Mission sit-down.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "I know that Yelp likes long reviews, but in this case I'm just going to say a few words. Incredible, fantastic, delicious, delectable, and yummy yummy yummy.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "As an SF native who has been eating here since the 90's, this spot is legendary for making THE ABSOLUTE, HANDS-DOWN BEST BEST BEST pupusas in town! The Pupusas Revueltas (pork + cheese) are my go-to every visit. Also can't get enough of the fried plantains with refried beans and sour cream and the house-made horchata. Also, super cheap! I am a lifetime customer!!", "author": "K. V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "3 stars for the bad service. Long wait times, no hostess or check in, so they will end up taking your order after they take about 4 other tables orders of people that walked in after you.", "author": "Chelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "DELICIOUS! Very clean place.Been coming here for years. The pupusas are the best. I always get the pork and cheese with rice and beans. Recently I discovered YUCA FRITA & PORK :) and the following week I couldn't stop thinking about it so came back.... wish I lived closer I would eat here more than twice a week....", "author": "Sara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "These pupusas are so tasty. I don't understand how. It's such a simple unassuming dish, but it sure packs a punch. Rice and beans are very flavorful. Wasn't a huge fan of the beef guisado (there was too much meat and it was kind of a rough texture), but I generally don't like chunks of lean meat. Service is fast, not crowded at 8pm Thursday.", "author": "Joyce Man H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "At $2 per pupusa, it's a pretty good deal. The pupusas are a decent size, and they give you a fair amount of cabbage and salsa along with it. Two were definitely enough for me, and I was a hungry mo fo.\n\nTried the revuelta (pork and cheese) and the bean and cheese. They have awesome beans here. So while I liked the revuelta, the bean and cheese was my fave.\n\nThe only downside (not a complaint) is that it takes a fair amount of time to get your food. They warn you of this on their menu (25 minutes, they say), but still, when you're starving, each moment that another table's food streaks by adds to the hunger.\n\nNote to self: Next time get one pupusa and a side of beans.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Second time trying out Salvadorian food, and i have to say this restaurant blew me away! The plates my husband and I got where absolutely delicious!! As I'm righting this review I'm getting hungry just thinking of it lol..\n\nI wanted to really give this place 5 stars, however there poor service got them only 4 stars. When we arrived the place was packed so we waited outside for good 25 min. FYI no place to sit and wait. Upon being seated they also took for ever to take our order and we asked for napkins twice they never brought them my husband had to get up and get them himself. \n\nOverall the food was great! Would definitely come back . food is so good!", "author": "cecilia m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "Really bad service 4$ each pupusa when you ask to go that's robbery 2.50$ if you eat their that makes no sense really bad", "author": "R S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Decided to write an updated review for this place since I was able to visit and dine-in with them this past Saturday night. My friend and I walked in around 5 pm and were able to snag a table right away. They gave us menus and we ordered pretty promptly - it did take about 40 mins for our food to get to our table, but that's how you know they're putting love into the pupusas and that they are freshly made. We ordered the revuelta (pork and cheese), chicarron (pork only), and the queso con loroco  - each at about $2.00 a piece.\n\nThe four stars are for the food and the food MAINLY- the service we received from the 40-something balding server was below mediocre and he ignored me more than once for certain requests. The younger server was more attentive with refilling our cabbage and salsa/sauce, but other than that, this place strong suit definitely is the food and not the service. \n\nI'm retracting my last review, and I will  definitely come back to have some pupusas, especially because they're literally right in front of the 24th Street Bart entrance, but I wouldn't expect 5 star service.", "author": "Kathleene E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "I love me a good pupusa. $2 per? So down. Minimum 2? No problem, wanted to get 2 anyways! Cash only btw.\n\nThe place is pretty small but it could seat probably 50 people. Service was great. Except the waiter got my order wrong... kind of mad but forced me to try something new so that was ok... Food takes about 25 minutes to prepare so be wary of that.\n\nI tried a Revuelta (pork and cheese) $2, Revuelta con Frijol (pork with cheese and beans) $2.25, and Cheese and loroco. The revueltas were oily but delicious. The one with beans didn't have a lot of beans. Probably about a tablespoon of beans. Loroco was definitely different. It was cheese but heavier in taste. There's no actual flower in it. My buddy tells me it's a spice.\n\nLike pupusas and don't have money to spend but have a lot of time, come try this place! I recommend the Revuelta con Frijol.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-25", "description": "I like that you get to try a bunch of different plates at a tapas restaurant with friends, I don't like how sometimes you leave still a little bit hungry cause the portions are so small. The vibe is very good for groups with lots of chatter, but I wouldn't rate it high for value.", "author": "Dion L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Omg. These are the best pupusas ever. You will never find any that are better than the pupusas in this place. I have been coming here for a long time. This is the spot if you ever have that craving. The only thing is that it is always super crowded, but worth the wait.", "author": "Mila R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Gotta get here early or you'll wait forever. Authentic place where most patrons are Latino. Cash only, super affordable place with rich food and incredible waiters! Come here every weekend and love it!", "author": "Anees L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-04", "description": "The worst place to greasy. And they dont care I told the waitress I she didn't bother to ask to change just paid and that's it. Don't waste your money.", "author": "Jorge O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "This place hidden on Mission in San Francisco was a gem!!!! Small place, not a lot of seating so if you go right at lunch time it may be busy!!! But if you love caldos and popusas, this is the place to be! And it's very affordable. My two sisters and I went and the total bill was only $40! We each had a plate with rice and beans and 2 popusas. Plus a plate of caldob de camaron. The chicharon popusas are amazing! And the cabbage salad and salsa to go with it is so good. The caldo de camaron had great flavor. Just the way our mom use to make it! Highly recommend this place. It is in a very busy part of Frisco but worth it! The only reason this didn't get 5 stars is because the service was lacking. We walked in and we're waiting to get seated and didn't get a hello, we'll be right with you..... nothing so we decided to seat ourselves as soon as a table was available.", "author": "Fabiola P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Protip: Cash only!\n\nOur original dinner spot had a super long line and we didn't want to wait so we ended up here for dinner, but I wasn't too sad about.\n\nI ordered 3 pupusas and also the fried plantains and it was more than enough food for me. I got: revueltas (cheese and pork), queso (cheese only) and chicharron (pork only) and they were all really good. The pork was tender and had good flavor and whatever the cheese is was really good! It also comes with some cabbage that you can put on top to eat it with. \n\nThe fried plantains (bananas) were really good too. It's pretty much caramelized bananas and I loved the crispier ones. It's really when it's hot and a really good dessert since it's so sweet.\n\nOverall, I'm definitely a fan.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Great papusas, really nice staff, and close to public transit.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "The service was excellent, the restaurant was clean and well organized. The food was DELICIOUS!!! I can't wait to go back!", "author": "Nae F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "One more excellent meal served fast and efficiently in this Salvadorean restaurant (not sure why it's classed as Mexican on Yelp). Unreasonable complaints about service here are mostly centered around the merciful lack of obsequiousness by the servers. They're very busy and have no time for empty, feel-good comments to please spoiled newcomers. This place has been around for the 25 years I've lived here and has never disappointed, never changed. Let it continue to be so.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "As a San Francisco native who grew up just a few blocks from here, these are the best in the city! Pupusas are authentic, fresh and cheap- can't get better than that! Friendly staff as well. Notes: Cash only and the service takes a while (Because they make everything fresh) so order ahead to-go if you're in a hurry. \nHighly recommend! This is a must try!", "author": "Elena A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "We followed the hype from other reviews and the pupusas were incredible. Also really liked the beef with vegetables soup.", "author": "Raymond J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Took me months to finally write a review about this place. It was my first time going here and my brother recommended to tries their pupusa since it was one if his favorite dish at this restaurant. I decided to 2 combo Pupusa (consists of beans, cheese, and pork). Cost $2 each for the combination. If you just wants cheese, pork, or cheese by itself, it costs 1.75. Pretty cheap for pupusas. Also had this one soup that had scramble eggs and mexican sausage. Don't remember the price, but it was a pretty good soup.. If you put in the lemon in the soup, it taste very lemony and hearty flavor. \n\nIts a small place but chill restaurant. \n\nFriendly staffs. but the service was kind of slow...my brother and i just had soup and a few pupusa and it took about 20 minutes or more for the food to come out. Other than that, i did enjoy their food. Will definitely come back again", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Best Pupusas and horchata! We drive here from Sacramento just to have the best. The place is ALWAYS packed and people are huddled at the door waiting for a seat, but it is definitely worth the wait!", "author": "Dayana Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "All time favorite dishes, all authentic down to the rice and beans. Easily enjoyed also with a horchata or passion fruit", "author": "Eric J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "This is the kind of place where you would bring your family. I ordered two pupusas and a beef soup. Even though the two pupusas contained similar ingredients, they tasted different. The cheese pupusa was full of rich cheese, some oozed out and was a bit crispy. The pork and cheese pupusa was not as cheesy as expected, however it did have a unique meat flavour.  The soup was large. It was not as densly packed as I expected. There was corn, carrots, and zukini. The meat had quite a bit fat on it and was medium in tenderness. They are very busy for dinner as they only have a limited number of tables.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Best salvadorean food around we plan our trips to sf to always include this place. I haven't tried anything I don't like!! If you ever want to taste authentic salvadorean food come here!! The place is a bit small so there usually is a line waiting to be seated but it's well worth the wait.", "author": "Nidya H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "It was okay. A little over priced. Pupusas were fresh, the empanadas were okay. Service was good! Wish they would've had more drink options.", "author": "Dee V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Wow this place is popular on a Sunday night. The entire time there was a rotating cast of people lining up outside the door for a table. But that doesn't mean it's crowded or loud or has long waits. We showed up around 7 and waited about 15 minutes and got a roomy booth for the 3 of us. \n\nEven though the pupusas are cheap and good it's not like a burrito place - this is an actual sit down with table service restaurant. If it looks like the tables are full just wait outside the doors. Someone will come get you when a table opens up. There's no list or anything. \n\nI ordered the revueltas and chicharron pupusas (min order 2 for $4) along with plantain fritos  ($5.75 includes creme and refried beans) on the side and a salvadorean horchata ($2?). The plantain fritos were okay. Almost underfried because they were cut thick and were almost dry in the center. But combined with the refried beans it was really good (I don't like crema so didn't touch that). The refried beans were super tasty. Of the two pupusas the revueltas was much better. My advice is to stick with stuffing that contains cheese. I would probably order the beans & cheese instead of chicharron next time since the beans were so good and the chicharron were a little dry. I really liked the pupusas topped with lots of the oregano slaw and tios hot sauce. The horchata was different than the usual Mexican horchata - less sweet and a lot more cinnamon. BTW, this was a ton of food even though the plantains were split 3 ways. I could easily make a filing meal out of 2 pupusas but if you aren't sure you can get rice/beans for $7.\n\nService was a little slow. It took a long time for our water to come out and they forgot my horchata even though I double-checked they had it when we ordered. Though once we reminded them it came out right away.\n\nCASH ONLY", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "I love this place! The food is amazing and reasonably priced. I always get the pupupas with beans and rice, and then a side order of the plantains. Waiting in line for a table isn't efficient because there is no system--you kinda just wait around and remember who's getting the next table. However, there are those people that will come in after and still try to take the next available table without properly waiting in line. This place is usually busy so be prepared to wait in line. Lastly, this place is cash only. However, I think it's still worth it because the food is delicious! Great place to try traditional Salvadoran dishes. :)", "author": "Hwan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "This made my trip to San Francisco even better.  The pupusas were delicious and the food reminded me of my grandma's food.  My children and my husband lthe food as well, usually they are very picky.  \n\nEven though it took us 20 minutes to find a parking, it was worth it.  The place is small and it seemed that it was always packed, that's how good the food is.  Service was great.  Definitely would recommend this place to my family and friends.", "author": "Iris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "Awesome pupusas! I got three pupusas - two pork and cheese and one just cheese and they were phenomenal. So filling and delicious. The salsa they serve them with is so good!\n\nService was fast and attentive. I had a great experience in this small, dark quiet hole in the wall on Mission Street. Great place to stop for a quick bite to eat.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "This is my favorite restaurant in the mission!\nThey have the best Pupusa I have ever tried! I also like their beef feet soup! It is very tasty and I don't end up feeling thirsty after drinking it, which is a great thing if you know what I mean. \n\nIn addition, everyone there are super friendly! \n\nI would recommend this restaurant to all my friends and family!", "author": "Alberto W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "After El Zocalo closed their location, we had to find another pupusa spot. Thank god we found this place. \n\nEvery time we've gone we've been able to get seated right away and once we are seated the line starts forming. LUCKY US!! \n\nThe food is great. The crispy outside and soft, warm and gooey inside is just to die for. I love their chicharron (pork) and revuelta (pork & cheese) pupusas, for $2.00 you can't beat that. Their horchata is more cinnamon flavor than I'm used to, but its still quenching. \n\ni took a star away because their service is SLOW! Water refills are slim to none, and when they are asked for more curtido they take forever to bring it to you, that you have to remind them. \n\nDELICIOUS and CHEAP EATS!", "author": "Chrissie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "This restaurant literally made my trip! Absolutely delicious food! We ordered pupusas (obviously) and the fried yucca dish. We tried to order pork tamales but they were out so I was bummed I didn't get to try it. Definitely the best Salvadorian restaurant I have been to and I have been to many! The only complaint I had was the service. I have learned the service in cali does not compare to the hospitality I am used to living in Las Vegas. Therefore, I will not knock down a star for it. Try this place! Trust me it's the best!", "author": "Eva B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Probably one of the best places I've ever had Pupusas, crispy and just simply delicious. We also ordered pork tamale but their style is different than what I am use to.  I liked the pupusas so much we ordered 5 to go!! The wait for a table was about 15 mins for lunch on a Saturday but the service for food was about 25-30 mins after we ordered to get  our first dish. I suggest ordering an alcoholic beverage while waiting to kill time.", "author": "Buttercup N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "I've yet to decide if I'm a true foodie or if the fat kid inside of me just likes to drag me from eatery to eatery, but regardless of what I may be labeled as, I always manage to find bomb A** food like they serve here. This place is always perfect in terms of customer service, quality, and price range and they always make everything fresh to order. As soon as you walk through the doors you are instantly greeted with a smile by at least one friendly staff member who does there best to get your party seated in a timely manner. Once you are seated, the real fun begins and you now have the chance to overlook their huge menu of tradional latin food. It can be overwhelming at first, but no matter what you choose, it will be the right choice. I like everything on their menu, but always return for their pupusas, they are a nice size and so D*** delicious, and can't be beat for $2 each :)", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "Great budget friendly place for lunch in the Mission!\n\nThe husband and I knew we'd basically be snacking all day so for lunch we kept it (relatively) light - we ordered the \"Combination Salvadorena\" which consisted of a chile relleno stuffed with meat and cheese, a chicken or pork tamale (I believe we picked chicken) with beans and crema on the side, as well as rice and a small salad, and shared this along with 2 Revuelta Con Frijol pupusas (a mixture of meat, cheese and beans, the husband's fave).\n\nWe also had their version of horchata, which is definitely different from something you'd find in your standard, run of the mill taqueria. Reminded me of the sesame milk tea from Tapioca Express but with a cinnamon kick to it. I don't know how else to describe but it's worth a try. I really liked it.\n\nI had to walk through the kitchen to get to the bathroom in the back, and I noticed that everyone who was cooking looked like grandmas! To me that's what added authenticity to this spot: you literally have someone's grandma cooking your meal. Granted it took a while for our food to get there but there is a reason all the tables at this spot are filled up. \n\nWe'll definitely try to be back for dinner. \n\nCASH ONLY! (There's an ATM across the street.)", "author": "Aivy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "This was my first time having Salvadorian food and I was so so happy I came here. The popusas are wonderful -- I had the meat and cheese, cheese and flower, and the cheese and bean. The cheese and flower one was especially incredible. So reasonably priced, even though it was packed it was worth the wait for our noms to arrive. Definitely will be coming back!", "author": "Abby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "This is the only restaurant I go to for pupusas. You can get a plate of two fluffy pupusas with rice and beans for $7. Where can you get a meal for $7 in San Francisco nowadays?! But note, this place is CASH ONLY.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "I'm a Salvadoreña, and I have been coming to La Santaneca de la Mission since I was a toddler, and I am now 30! Not many restaurants can truly stand the stand the test of time in San Francisco and this one has. That's how good the food is! My personal favorite is the pupusa \"revuelta\" (mixed-cheese, refried red beans, and minced pork). Another favorite is the yuca con chicharrón (cassava and pork rinds). If you haven't tried this place, because you are afraid to venture to the unknown, don't be. It's really hard to go wrong with pupusas! They will be a new favorite.", "author": "Raquel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "My friend introduced me to this place awhile ago, and man these pupusas sure are gooood. Sure beats making my own :)\n\nIt's a small place and the wait can be a bit long mainly because pupusas take a bit to cook. So keep calm and sip on a lovely horchata and wait for the gooey goodness of a cheese pupusa.", "author": "Em C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "When you live in bernal heights, you become a pupusa connoisseur. I'm kinda a big deal in the pupusa community (in my own head). And la Santaneca (de mission) is the best.\n\nWhat makes their pupusas so good? I don't know, you'd have to ask them but of all the pupusas I've sampled, Santaneca has become the gold standard. Not only because of the golden crispness in which they fry up their pupusas but everything about it is flavorful. The pork is salty and porky... Cheese is cheesey... It's a more intense cheese than other places. \n\nI've also had the salvardorian chile releno here which is delicious. Everything here is delicious.\n\nOnly downside here: no beer. And their service can be a little slow. But it's still worth it.\n\nI will still continue my explorations of pupusas in this neighborhood and beyond. But it'll be tough to find anything better than la Santaneca (de mission)!", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Love this place! We come from Oakland  to eat here. I have tried so many dishes and impressed with the original flavors of Salvadoran food. Be patient to wait for food, because it's homemade style, and always full. But more than worth it! Lots of people come for pick up as well.", "author": "Sara F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "When you find a place that's crackin' in the Mission you have to be interested. You at least have to find out what the draw is about. I mean you are not in a location where el salvadorean food is scarce or any Latin American food for that matter. It's a place that's been going strong for years. I remember first going here with my mom when I was in 5th grade. I didn't quite understand it then, I just knew it was good.\n\nLa Santaneca is a good reason for my appreciation of cultures and food. It used to be foreign to me. Now not being able to go there when I want makes me feel foreign when I visit. \n\nIt is only right that my wife visits here with my kids. This Saturday, it was my wife and the two girls. We came here right around 10am. Like I said, it was crackin. I went right to the front counter and asked little \"pepito\" ( that's what I decided to call him) if I could put my name on the sign up sheet. Yes, I know by calling him little pepito I have called him little twice but he is a little pepito. Anyway, he told me in his rude \"scarface extra\" accent that I needed to look around and see the line. He said the line is everyone waiting and I had to wait in line. I said ok, little tike but no need to be rude. I love the food here which is why I'm here but you don't need to be rude. He kinda apologized. Eh, I wasn't going to let speedy Gonzalez ruin this.\n\nHe made up for it by getting us a table pretty quick. Menus were brought out and we knew what we were having immediately. We decided to go with pupusa revuelta which is pork and cheese, fried plantains, beans and rice, a breakfast platter, and of course my favorite sopa de res (beef soup). Heck yes Pepito, suck on that!\n\nI'll admit this is a bias review because it's part of my personal history. But yes, still bomb dot com. Only star I took back was for my little friend. I couldn't get over him. His face just looked shifty to me. The kind of guy that drinks too much wine at communion. You know the kind I'm talking about.\n\nIf you come here you have to order pupusas. They are so decently priced here and filling. Order as many different items as you can. I just love this place. I did get to speak to the owner and he is still cool. I didn't have the heart to tell him about cheech, pepito, speedy, pepe, you know what I mean.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "I've been coming to have pupusas here for about 15 years.  The food is always delicious.  The service varies based on how busy they are. Saturdays and Sundays are always super busy.", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "In town with Salvadorean friend and the neighborhood pupusa choices were overwhelming but glad we chose La Santaneca. Our party had queso con friljoles, loroco and revueltas and they were all great! Delicious, fresh, airy. Cortida was amazing, too. Service friendly.", "author": "Nomad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "I had been coming here years ago with my family whenever I visited SF. Lately I have been going to El Santaneco. I have only tried the pupusas at both, and I prefer La Santaneca De LA Mission!!! They taste fresh and don't over due it on the dough.So glad I visited this place again. I visited Sunday night before heading back into town, me and my boyfriend ordered two pupusas each and waited an hour!!!!!! The wait was ridiculously  long, but food was good.", "author": "Cin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "Probably my favorite out of the restaurants I've tried in 2013.\n\nYou know how people (perhaps only those in romantic comedies) have a neighborhood joint for meeting friends after a hangover morning? I'm going to opt for Santaneca as mine.\n\nPupusas are slinging out of the kitchen and the piping hot little pancakes ooze pork, cheese, loroco (twenty-five cents extra), and beans. The priciest pupusa is $2, so eat up!\n\nThe soups are where Santaneca really shines though. We've so far only had the caldo de res (beef soup) and the sopa de pescado (fish soup), and both have been perfect for chilly days. Big chunks of flavorful meat, lots of veggies, and the lemons really give a nice tang to the soup. I still have no idea what to do with the accompanying tortillas, but I'm working on it.\n\nThe atole makes a nice dessert too, and it comes in a big bowl. Corn bisque, basically.\n\nNever much of a wait even though it's a small place right by the BART.\n\nThe fried plaintains are super popular, but I haven't had a chance to try them yet since the entrees are so hefty!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Ended up here back in January and walked into a candle place and asked where was the closest Salvadoran restaurant and got sent here. Overall a great experience!! The pupusas were amazing!! As a Salvadoran American from LA, I did not know that SF had a large and accommodating Salvadoran population and La Santaneca satisfied my knowledge. Will come again", "author": "Anelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Pupusas: 3.5 stars\nFat, hearty and fulfilling.  We got the Frijoles con queso (bean and cheese) and revueltas (pork and cheese).\n\nSopa de Pescado: 4.5 stars\nA tangy, warming and delicious broth with fish pieces.  Mum liked it so much, she wants to bring my dad here!\n\nChile Relleno con Asada: 5 stars\nBest Chile relleno of my life -- soft thick outer fried batter, savoury pork filling.\n\nPlantains y Crema: 4.5 stars\n\nEmpanadas: 2 stars\nCharred black outside, with none of the doughy goodness you'd expect from an empanada, filled with a coconutty banana cream.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-21", "description": "Food is good, but customer service is horrible. We arrived and had to wait 20 minutes for a table, someone that arrived after us was sat before us because they knew someone that worked there. When I complained to the employee he said that they had held a table for them because their family had arrived at the restaurant earlier and had asked to reserve a table for them. I asked if next time I could call in to reserve a table, but he stated \"No, because we don't hold tables.\"..wow..you just told me you held a table.. I guess it's only for friends. I tried to give them some feedback on how they could improve their service, but the guy just looked away and rolled his eyes.\n\nAnyways, the food took about 20 minutes to come out and we were never asked if we needed anything.\n\nFood is good, but won't be going again because of the service.", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "This place was fantastic. From the service to the food. It's pretty tiny so if you're claustrophobic you might have an issue with the lack of personal space. Still, the food was so flavorful and delicious. I will definitely visit again next time I'm in San Francisco.", "author": "Theresa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Always great food. Be forewarned that because of its popularity and limited seating you usually have to wait 15-20 min for a table", "author": "Yasin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "The food is okay sometimes. The wait is long for the food. And they confuse orders a lot.", "author": "Dora A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "started with a little wait , once we got table service started slow choices look delicious will post more may lose stars or stay a 5 service got better and captured all the flavors of El Salvador. And then I order to go drop it down to 3 stars because soda bottle \"Kolashampan\" was open and spilled all in my car who half way opens a bottle to go? I was going to tip however my friend did not like his plate now happy with 7 dollar tip was going to be 15", "author": "A M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "I had the drunchies one night after partying hard on a monday night at El Rio and got dragged over to this place and fed and I must say it is quite excellent.\n\nYo the food here is hella cheesy just like I like it bruh. \n\nDamn food so good I'll come back and back and back and back again", "author": "Luke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "I have never put away my entire plate of pupusas so fast, until La Santaneca de la Mission. I was hungry, but not so hungry that I couldn't wait 30 minutes for a table on a busy Saturday night, or an additional 25 minutes for the food to be brought out.\n\nMy friend is Salvadorean, not that it matters, but I think it's cool to have your food ordered in the native language to the food you're about to eat, maybe it's a respect thing, maybe it's a street cred thing, I don't know, just feels right. \n\n*My New Favorite/Constant Craving/Human Need: Loroco Cheese Pupusas!* \n\nThese bad boys are bursting with flavor and extremely HOT and fresh. I told my man that *if* he's ever in the dog house, he can redeem himself by giving me some of these, they are just that good. It was also his first time having Salvadorean food (What! That's crazy talk, I know!) so it was funny to watch his attempts at stuffing the cabbage slaw into the hot pockets.\n\nPork and Bean Pupusas are also a solid choice and had previously been my usual until the cheese only hit my tastebuds. I got a plate with rice and refried beans, very good. My table shared the Fried Plantains with sour cream which were bomb; not too sweet, good on their own and better with a dip of sour cream. Man got a soup with taro root and tripe: no one was a big fan of this, it lacked flavor.\n\nI had a Horchata, which I am indifferent to. It had an earthy/sweet/dirt flavor/consistency, not that I've ever gotten down on dirt, but it's what I think sweet dirt mixed with water would taste like. Not the best, but live and learn. \n\nI thought this location was related to the Bernal Heights pupusaria but I got scolded by our waiter when I requested Chicharon when I didn't see it on the menu, but had recently eaten it at the restaurant of the same name in Bernal. Anyway I'm into Santaneca and since it's super Bart accessible I will likely be back asap. CASH ONLY, fyi. Enjoy!", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "By far the best pupusas revueltas I've ever had! I ordered the plate which came with two pupusas and rice and beans. All of that was only $7! The pupusas were so fresh they were steaming hot as I pulled them apart. And the cheese was the best part! I'm definitely coming here again just for pupusas on the go. I noticed everyone else came for the Salvadoran meals as well and the place was packed overall. Such a great place!!", "author": "Brianna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Oh my. From the moment we walked in the place was packed! This meant it was not going to disappoint and it did not!!! Pupusas and hot chocolate is what my boyfriend and I were craving and it's exactly what we got. The hot chocolate was delicious for the crisp cool nighttime weather and the pupusas were absolutely finger licking good. Will definitely go back if I'm in the area.", "author": "Areli A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Fast service and really good food. I'm a fan of the oatmeal pancakes yummy. The sweet plantains are always on point. It could be even better if they had handmade tortillas just a thought..", "author": "Zulma H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "I didn't know rather or not I wanted to give this place a 4 or a five. Upon entering there was no greeting of any sort. The restaurant was completely packed on a Sunday afternoon. So we made our way to the front counter and asked if we needed to put our name on a list and how long the wait was. We were told 20 mins, there was no list, and to just wait outside. Honestly it's so small in there that outside was the only option to wait but the fact that there was no sign up list made me feel like it was an organized. We were the only people waiting but  more and more people started to show up and actually stood in the doorway and outside which made me fearful that they would get picked before we did and there was no way I was going to allow someone to be seated before me. Once a couple left my girlfriend went in and told them that we were next which I didn't think should've been necessary but considering that they don't have a list it was. One seated the waitress was very friendly and attentive. The food was absolutely amazing and the service ended up being good too. In fact the food was so good that it almost made me forget the terrible wait hence the reason I'm giving five stars I would go back in a heartbeat", "author": "Cierra R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Delicious pupusas! I ordered the bean and cheese. There made with really good gooey cheese also pretty big size. The cabbage topping that it comes with goods really good with it. Order a side of sour cream, salty creamy flavor. The combination of the sauce/ cabbage topping/ sour cream is the best ! Love that they have glass bottle coke cola ! I'd love to try different things on there menu but I love there puppusa's so much I can't lol \n\nThe place is pretty small and every time i'v gone has been packed. The wait is worth it. My boyfriend and I defiantly don't mind making a trip here when we're having cravings, we come from the east bay which is a 45 min drive. \n\nCompletely recommend this place you won't be disappointed :)", "author": "Mayra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Santanca is a winner. It is right above the 24th and Mission BART station. I walked in recently after going there since I moved to the Bay Area and as usual it was packed with other Salvadorians. ALWAYS a good sign of older Salvadorian people are there. I had dinner with my girlfriend and we had 4 pupusas and two drinks (horchata) and it was less than $10. Awesome. \n\nTheir pupusas are top notch and in my top 3 pupusas in the city. My parents are from El Salvador and I have had thousands of pupusas over the years both in the US and in El Salvador so I'm pretty familiar with what a pupusa is.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "So here's the deal, mi gente: if you want down-home Latino food that is freshly made by someone's mama or tia(or tastes like it), you will wait. And wait. and wait. \n\nNot to mention, this joint will be crowded.  You'll be squeezing past the locals and hipsters  to get in or out.  You best have cash or head across the street to the ATM(as I did) because they are cash only.  But then your food will arrive.  Tasty pupusas, great grilled chicken, good rice and beans. Well worth all your gripes.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "My friend was craving pupusas (who am I kidding, we ALL were) so we took a trip to this place to get some. \n\nLa Santaneca is really accessible. It's only a few steps away from the 24th and Mission Bart stop. If you're driving there, good luck finding parking.\n\nThe place itself is nice enough. Simple decor, friendly people. \n\nWe were set on pupusas so we all got pupusas and drinks. The pupusa menu does not have a lot of variety but they are all at a good price and in good portions. I chose to get 2 pork/cheese/beans pupusas, a Salvadorian horchata, and an empanada for later. My friends generally got the same thing. \n\nThe food came in good time. The pupusas were delicious! Extremely filling. I could barely eat 2! The horchata was good too. Very strong with the cinnamon. The empanada was delicious too. I had never had an empanada like that before. Banana filled with pudding and fried? Delicious! \n\nI approve of this place. Cheap, tasty, accessible, authentic. They even have Salvadorian soda! So good!", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "This is the best popusa place that I have ever been to. They have so much flavor and the customer service is never bad. Very good", "author": "Ximena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Pupusas are always on point! I also got the fried fish and it was delicious! It gets packed so be prepared to wait, it's 100% worth it! I love love this place! If you're in the city you must give it a try. Authentic salvadorian food", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "The requirements were:\n\n1. Needed to be near Bart\n2. needed to be done in 30 min\n3. had to be tasty\n\nWas originally just going to go hit a taqueria but we saw Santaneca and decided to drop in. Hadn't had Salvadorian in a while so we got revuelta/lorocco pupusas, and the Combanacion Salvadoreno which had a meat relleno, a pork tamale, frioles, crema, and rice. Everything was tasty (except for the ricce), and  a ton of food to boot. For $15 a person we were stuffed. They were also super nice and it was cool to be  basically surrounded by the Salvadorean locals. Space is nice, even the bathroom is clean, especially for the Mission. notch one up for the list of fast affordable eats in the area.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "This is the best Salvadoran food in the Mission! I've gone to a lot of spots, this place just takes the cake and then another cake. Huge portions, very decent price.", "author": "Lucas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "LATIN-AMERICAN FOOD CRAWL IN THE MISSION: Pupusa revuelta, pupusa de frijole\n\nThe undisputed favorite amongst my food crawl friends. For those who don't know what a pupusa is, I would describe it as a little corn-based envelope of magic, the magic in this case being cheese, meat, beans, rice or some combination of these. Pupusas are proof that God walked into El Salvador and went, \"You know? I think I'll share that corn recipe I just invented with THESE guys.\"\n\nI've had some great pupusas in my lifetime and these were among the best. Our group got the pupusa stuffed with cheese and pork, and the pupusa stuffed with cheese, pork and beans because we're uber-healthy like that. One bite and it was heaven in your mouth. Warm, soft, gooey cheese mixed with tender, savory meat in all its rich juices and starchy beans in all their glory, encased by a crisp, fresh shell....Ahhhh! I wants another one nowwwww!!!", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "Worst experience ever!!!! Walked in with my boyfriend and baby, noticed that there were no tables available, so we waited by the door. A waitress walked past is and didn't even greet us or acknowledge us.  So my boyfriend decided to walk up to the cashier and asked, if we needed to find seating or have someone seat us? The cashier simply responded \"there's no tables available!\" No sh**t, so my boyfriend pointed out the fact that we were ignored and not only were we ignored but their response to us were \"there are no tables available,\" and the cashier had the audacity to laugh at us. We just walked out, didn't even try the food. Worst customer service ever, I guess they're not worried about customer satisfaction.", "author": "Raquel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "It's hard to explain how perfect the pupusas were. The chile relleno with meat was also impressive.\nThe place was packed but we were seated in less than 5 mins. The food also arrived pretty soon.\nThe prices are reasonable and the portions are not small.", "author": "Xavier R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "I highly recommend this place. Pupusas are the best! Great customer service and welcoming place :)  it's usually packed but the waiting is worth it", "author": "Maritza S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "First, this place does not have the best pupusas. \nSecond, the people who work at this restaurant are disrespectful. Not only do they lack customer service they refuse to acknowledge that they are\nWrong. \n\nMy mother visited this place last weekend and the coffee was horrible, my mother requested they change it and their response was \"we have been serving the coffee this way for 15 years with no complaints. So we will not change it\". As of that my mother said you know what I will nor be eating here today.\n\nAgain this weekend my mother went with her friends to give the restaurant  it another opportunity. When she order coffee the waiter told her \"that's the same Coffee you disliked\nLast weekend\" in a disrespectful tone. \nThere are better places to eat pupusas in the city. Like Los Panchos.", "author": "Ingrid A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Cozy place, nice atmosphere, and you actualy have to wait a little bit until they make your food, which for me is a great thing..:-)", "author": "Rogerio J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "The food was great, the service quality was fantastic especially for the amount of people inside this small establishment. The food took forever to receive which would be my only complaint. That aside the food was surely tasty and I love Salvadoran style horchata. I could have done without the man peddling pens although he was kind and respectful. As always the Mission delivers great ethnic flavor. They were kind to my young children which is always a plus. My experiences seemed to be mixed when it comes to restaurants and how they treat families. It was obviously fresh and the Papusa's were made to order. This was the first time I've exposed my children to the wonders of Salvadoran cuisine, they enjoyed it. The plantains were made perfectly. The beans were tasty and the Papusa options were amazing. We will definitely return and I surely recommend others to enjoy the food and drink they offer.", "author": "Christina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "I have been eating pupusas here for over 20 years! Yes people, for over 20 years and they still have the best pupusas in Northern California. The place is cozy and small but the wait is not too long, about 5 to 10 minutes tops... las pupusas! hmmm they are delicious, specially the ones of queso con loroco (my favorites). \nThere is a guy waiter and a girl (Margarita) that have served tables there forever and they are super nice, Too bad I can't say the same about a new guy that I had never seen before and if you ask him for something and he is not your waiter he just ignores you.\nOther than that, still the best pupuseria in NorCal!!", "author": "Juan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-31", "description": "The very best place in SF to get pupusas! You want real authentic El Salvadoran food come here. The have it all its very good place its small and only accepts cash just a FYI make sure to bring coins for be ready to pay for street parking but when you come here it's feel good to be in here and food is just that melt in your mouth good! I always come here for there pupusas I was taken here one time and that's all it took for me to love there food. This a must come to place in SF so when in the mission district stop by here and get some great food.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "The pupusas are a must have here. They arrive to your table hot and fresh and while simple, they are delicious. We ordered a couple pork ones a couple cheese, a plantain dish, a bean/rice plate (for protein and I didn't really care for the beans/rice although the sour cream was quite good) and it was enough to make the two of us incredibly stuffed.\n\nThe banana milkshakes are sweeter than I would have liked with too much whipped cream on top (I would have opted for no whipped cream had I known it came with it). \n\nBtw they only accept cash (Bank of the West across the street) but dinner was incredibly cheap for two at $20 and some change. We walked out feeling good and bellies satisfied.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "The best pupusas in the city!  They make them fresh, so be prepared to wait atleast 15 minutes.  Everything here is delish and authentic.", "author": "anne m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-23", "description": "They have $2 pupusas here and they were pretty good. Cash only though. I came in with a couple of friends who have never tried them before. The waiter who took our order was very helpful. It took maybe 25 minutes to get our food, but that's typical of a pupuseria. When the waiter finally came around with our food, it was the most confusing thing ever. He brought all the pupusas in family style plates even though we all ordered different kinds of pupusas. He couldn't tell the food apart! We had to figure it out amongst ourselves.I had to ask him to bring out the salsa and the cabbage that goes with it.\n\nBesides the ok service, the food was good. Maybe next time I'll just order to go.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "Pupusas? PUPUSAS!!! I LOVE!!!\n\nI found this place via Yelp and went to try it. It was deeeelicious and very filling. Service was smooth and the food was everything as expected. The pupusas from my memory weren't too greasy and had a decent amount of meat inside to fill.\n\nI would recommend coming to this place if you're a pupusa addict like me. :)\n\nThe only drawback was that it's CASH ONLY.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Best pupusas in SF (tell me if I'm wrong!).\nAuthentic.\nBetter than a tacqueria (and quieter).\nThey don't have beer or booze, better bring your own.\nChile Relleno gets two thumbs up (because that's all I have). Same with pupusas and fried plantains.\n\nI see somebody complained about the coffee. It's a Mexican/Salvadorian restaurant. Why would the coffee not suck?", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "This is one of the most authentic Salvadorian food restaurant in San Francisco. Every dish I've had it's so delicious, especially the pupusas, always finger licking good! what I love every time I go to this restaurant whether to dine in or pick up, doesn't matter what time of day, there's a very diverse crowd inside eating and/or waiting to get seated.", "author": "Nita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "It was here that I discovered pupusas... And I have been in love with them since! The food is amazing (great pupusas and enchiladas!) and I like how there are Mexican and Salvadorian options. Also, refreshing horchatas! I'm from SoCal, so I came in as a tough critic. However, I must say this food is great! I will come back next time I'm in Mission District... Which will be soon, hopefully!\n\nOne more thing... Did I mention the cute bus boys? Haha ;)", "author": "Mimi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "I was expecting a real hole in the wall pupusa place but La Santaneca is actually cute inside. The wood walls are adorned with pictures of El Salvador. Of course they have a TV so you don't miss any important soccer matches. During my Sunday visit, every table was occupied and most people were enjoying big bowls of seafood soup served with steamed tortillas. I definitely want to come back for a bowl of seafood soup.\n\nThey had 6 kinds of pupusas. \n\n* Revueltas (pork and cheese) pupusa ($2): lots of porky flavor, pork was finely chopped, not much cheese\n\nThe pupusas were greasier than usual but I liked how the exterior was slightly crispy. The cabbage slaw was crunchy and slightly sour, with oregano and tiny carrot bits. The red hot sauce was better than average. \n\nCash only.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "Restaurants are sometimes like people you meet them and you get an immediate vibe. When I walked into La Santaneca I felt a warmth and comfort that many 3 star Michelin restaurants could learn about.\n\nThis wonderful place serves amazing Salvadorian food. The place was mobbed at 7: People waiting to get a table for that amazing Salvadorian home cooking...we were here for the pupusas. \n\nI love their pupusa plate: two of these freshly made gems with seasoned pork inside, add lovely rice and beans...their amazing salsa and their homemade vinegar coleslaw and man you have an amazing meal.....all for $6.25. I had a mandarin Jarritos (hey it says 100% natural). There are many other great Salvadorian treats but I love their pupusas.\n\nI must stress that since the food is made to order it takes a bit to get your food.\n\nFor wonderful food in an amazing atmosphere...check it out!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "I'm a huge pupusa pig! Instead of dining in...I decided on 4 pork, beans & cheese pupusas to go! It is authentic compared to the ones I get from Costco. It was hand-made to order & worth the wait. Service was nice & the place seems very homey. Nothing fancy but still welcoming. One of the server has a strange flipped hair curl in front of his head which kept me entertained during my 15 min wait. I can tell it was going to be good since everyone who had the pupusas were busy cleaning their plates instead of conversing with their company. The relish was fresh & the portion were perfect. Definitely coming back again..", "author": "Kat N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "La Santaneca gets a solid 4!\n\nI ordered the bean and cheese pupusa and the pork and bean pupusa--both were decent. I've had tastier, lighter pupusas in SoCal but La Santaneca's pupusas are definitely up to snuff.\n\nThe true gems that my lady and I had the pleasure of having at this place were the fish soup (sopa de pescado) and their agua fresca drink called mamey. The mamey fruit is endemic to Central America and tastes like a cross between guava and pineapple, but inherently watered down---pretty damn delish in fruit drink form! \n\nRegarding the fish soup, the broth in this beautiful dish is so rich and tomato-y with that undertone of fresh fish flavor and fresh veggies, all in the mix. I'm not sure what kind of fish is in the soup but it's decidely a whole damn fish. So unless you're hungry for a ton of fish and not having another dish on top of it, I would recommend sharing.\n\nDefinitely juiced to try some of their meat dishes on the next go around!", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "My parents are Salvadorean and therefor I grew up with Salvi-soul food. I know wassup. And when it comes to authenticity, this place is the spot! In all my days as a foodie, I have yet to find a place that does PUPUSAS like La Santaneca on 24th & Mission. One could say that they have ruined me lol\n\nI've been coming here since I was a kid and always order the revueltas de maiz. OMG.... Where do I start... The cheese melts in your mouth and the masa is perfectly cooked inside and out. The chicharon they use is divine!! They keep it nice and clean and their servers are very attentive. It's a bit small in there so be wise with what day you choose to come because you might not be seated. \n\nThe only reason why I didn't give that extra star is because the staff can be a bit rude and unfriendly sometimes. But that all goes to the way-side when you take your first bite. \n\nIf you're looking for an authentic taste of El Salvador, visit La Santaneca. And don't forget to try their aguas frescas.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "UNDOUBTEDLY the best bang for your buck in the Mission and probably even the whole city. \n\nI'm not saying anymore because I don't want to reveal all the secrets.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Amazing! They only take cash which it sucks but other than that it's a pretty good place. \nThe food and drinks are great! Feeling like eating Latin food this is theeeee place!", "author": "Vilma C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "I agree, papusas are delish! I ordered pork & cheese - good size, I even decided to share it with my friend. And you cannot bit the price-$1.75 (small salad & salsa are included!)\nFor the main dish I decided to try Salvadorian Combo plate-tasty!", "author": "Ellie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "Best pupusas and casamiento in town. Not too greasy or burned. Just right! Very nice service too. \n\nNo credit cards allowed though and there aren't a ton of ATMs nearby so bring cash.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "I knocked off 1 star was because of the wait time. Although they were nice enough to seat us quickly, we ordered our food and did wait nearly 35-40 minutes. This was on a Sunday, which I totally understand the limitations of supply and demand, but I was a hungry little one by the time we caught the waiter's attention and had him check on the order. My friend and I both got the papusa plates (arroz y frijoles), some addictively good Fried Yucca (will make you think you ate cotton balls by how heavy you feel after), and the Fried Plantains (which were a little limp, compared to some I've had). \n\nI was full, satisfied, and had my delicious guava drank, to wash down all of the starchy, fatty goodness.", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "The pupusas in this cafe are to die for. I strongly recommend getting the cheese, bean AND pork ones. If you get just 2 of the 3 fillings, you'll miss the third. I am salivating just thinking about those delicious little parcels.\n\nCheap prices, crappy decor. Just how I like it.", "author": "Laurie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-10", "description": "I did not have the pupusas, but did have the Salvadoran steak, which I had seen someone else get and it looked delicious.  Mine looked good, but my steak was 1/3 fat and thus inedible, which was disappointing.  The part that I could eat was yummy, and I liked the vegetables it came with.  \nOur server was friendly, but our food took over 45 minutes to come out after we ordered.  I can't be sure, but it looked like our ticket kept getting bumped to the end (based on my observations of the waitress looking at the ticket, looking over at us, and watching as the she or the chef moved things around).  There were five of us in all, and the place was crowded, but that didn't seem to account for the wait.  Several tables who were seated after us were served before us.\nThe place does have a cozy atmosphere, and has a lot of people working in the kitchen-- many generations, which gave it a family-run feel.  I really wanted it to be better.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "Went there last night after we attended a concert. The food was ok. The servers were not friendly at all, almost like they were bothered by the people there. The server taking the orders didn't even look at the people when he took the orders. It was very uncomfortable.  I wish I had gone to another place.  That was my first time there. Will not go back again.", "author": "Maritza R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Seriously the yummiest food we have had in a long time!  I had the Carne Adobado expecting it to be cut up pork in the red sauce, what I got looked like a steak and it was fanfreakingtastic!!!  Highly recommend this place!!!", "author": "Celeste O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "unfortunately, i was introduced to puposas at a late age and did not get to experience a snack that is not only fun to say, but fun to eat. they have lots of options for other snacks - definitely recommend the plantains and it's a good price for what you get.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "If you ever pour out of the 24th Street BART station from the escalator and head left instead of right, chances are pretty good that you've seen this place before. The reason why it stands out is that it's a Mission eatery that actually looks pretty inviting with the nice laminated wood sign and the cleanest-looking storefront on the block near the loudest-looking Mickey D's. I was particularly interested because a colleague of mine recommended it, and her significant other is a Salvadorean. How could I resist since I loves me some homemade pupusas?\n\nOK, so I have to compare this place with my standby Salvadorean/Mexican place, El Zocalo. down the street. La Santaneca de la Mission certainly wins points on cleanliness and dare I say it, friendliness. They seem to have spent more on their decor here. But let's get to the business of the food. I think the pupusas are a dead heat between the two spots. The $1.75 Pupusa Revuelta (see my photo) was excellent, full of pork and cheese inside, although I prefer the curtido (pickled cabbage) at El Zocalo. It's just a little too sour for my taste. Next came the entrees. I had the Carne Guisada, a Salvadorean beef stew with major chunks of meat (see my photo). It's much more tender than it looks and less gut-busting when you make tacos with the hot-to-the-touch tortillas they provide.\n\nJamie W. ordered the Huevos Estilo Salvadoreano, which was a kinda salty combination of pork, scrambled eggs, tomatoes, onions and green peppers (see my photo). Both of us got refried beans, although both of us prefer black beans. I don't remember being given that option. All in all, it was very good, but I have to say I still prefer the taste and portion size of El Zocalo's Salvadorean dishes. They put dressing on their side salad, which La Santaneca most definitely does not. I also like the chips and salsa better at El Zocalo. As we know, the first impression of a place is key, and just like a blind date, you can tell whether you want to spend the rest of your life with a person or get a friend to call your cell within ten minutes to say the pipes just burst at your house. La Santaneca deserves a second date.\n\nFOOD - 4 stars...solid Salvadorean and excellent pupusas...hey, where are the black beans?\nAMBIANCE - 4 stars...clean and nice by Mission standards, for sure\nSERVICE - 4 stars...very friendly\nTOTAL - 4 stars...happy to have another real go-to place for Salvadorean", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-30", "description": "La Santaneca was good.  The highlights of our meal were the delicious pupusas!   The chicken soup with veggies was also satisfying.  The grilled chicken salad was overcooked, and the corn soup appetizer was too sweet to be a starter.  The service was okay.  Overall, a decent but unremarkable experience.", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Great pupusas. Super cheap. Go and get pupusas - they are were really good but especially the pork and cheese. \n\nWe also got chilies reyenos which were great and a steak dish (which was recommended by the waiter) which was not very good. \n\nI'll go back for some pupusas with a side of rice though.", "author": "Jocelyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "These pupusas are fantastic as are the plantanos con creama. The horchata and tamarindos are really nice and the prices are great value. My family loves eating here and we've actually been coming here since I was a kid in the 80s.\n\nI like how clean the restaurant always is and how the ladies in the kitchen wear hair nets. I like that I can see how clean the kitchen is, too.\n\nThe only reason I didn't give 5 stars is because the service could be better, but it's a small restaurant that's always busy and it's understaffed. Also, cash only which can be a pain if an ATM nearby is down. Apart from that, it's a great little restaurant with great food.", "author": "S. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "Outstanding pork and cheese pupusas! Very reasonable prices too. Definitely worthy of a return visit.", "author": "Ben F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "I LOVE me some papusas!!! \nI am so happy I had time to kill before work and came here. Its always a good sign when there is a line out the door waiting for a table. \nI will be coming here again to get my papusa fix ;)", "author": "Natasha I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Great place to get pulpusas in the mission! This place can get pretty busy during dinner hours; so there might be a wait. However; the service is pretty quick and the turnover is also pretty fast. \n\nPulpusas are only $1.75-2.00. The pulpusas is like the size of your hand. \nMy favorites are:\nPork and cheese: I think having cheese in it makes it so tasty and the gooey cheese is delicious. \nBean and cheese: also delicious and flavorful \nAll cheese: It was good but definitely not as tasty as the pork and cheese. The bean and cheese or all cheese are great items for vegetarians. \nOnly pork: This is probably the most disappointing one. I think without the cheese it can get a little dry. \n\nOther items: \nSteak fajitas: it was just alright. I thought the meat was too overcooked and chewy. Also too much oil; after a few bites it was really hard to eat. \n\nNote: Cabbage and the pulpusas are a good combination. They might charge you extra if you ask for more cabbage. \n\nHorchata: So yummy and different from Mexican horchata. I think it was less sweet and had a more cinnamon taste to it.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "I wasn't super impressed with the Pupusas I ordered. The staff were friendly, the food came out pretty fast and the establishment was clean and efficiently run. This place is pretty small and cozy and could be a nice spot for a date night in the mission.", "author": "Eve R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "Me encanta La Santaneca! HmmMMmmm\n\nMy friend and I both had the pupusas and we shared the fried plantains and it was the best dinner I will probably have all week! They are generous with the cheese, as it was oozing out of my pupusa when it was brought to me! PLUS their pupusas are CHEAP! Oh my goodness SO CHEAP! $1.75 for one! :O My only complaint is that I wish they added a tad bit more pork.\nThe plantains were tasty too! Guess I'm a newbie to this, but I had never had them with sour cream and beans. It sounds like a gross combo, but wow! It was FANTASTIC. My friend had a good point regarding this dish though: it's kind of pricey for the amount they give you. Over $6 for about 6 plantains on a plate with a dollop of sour cream and refried beans  -_-\n\nThe lady serving us was very friendly and she made sure we always had water. I really liked the woodwork inside...it gives the place a home-y, cute feeling. Like the bathroom sign!\n\nAm coming back for sure! Cheap prices for delicious food?! Uhm, YES.", "author": "Kei H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Pupusas - the grown-up burrito? TBD, but they're darn good here. Even better are the incredible plantains -- which usually I find are too squishy and flavorless at other restaurants, but La Santaneca's are outstanding, a complete 180 from other places. atisfying latin american comfort food all the way. \n\nNot the spot for late-night bar hopping or anything to go. But absolutely a terrific neighborhood sit-down for a nice inexpensive unpretentious & satisfying meal.  Add in that its just a stone's throw of the 24th St. BART station, plus authentic not just to El Salvador (or so the other Yelp reviewers say) but also to the longtime character of the Mission (before its gourmet cupcake and artisanal water phase), and it earns its stars.", "author": "Kimbro B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Ramdomly stumbled upon La Santaneca De La Mission and was pleasantly surprised.  We were seated immediately and our waiter promptly gave us menus so we could order.  We ordered the Bistec A La Mexicana and some pupusas to share (cheese, pork and cheese, and bean).  Everything was reasonably priced and came out in a timely manner.  Less than $20 for 2 people and more than enough food to leave us stuffed.  The steak was very flavorful and tender.  Pupusas were made fresh and having the cabbage and tomato sauce as garnish put the cherry on top.  I loved this find and will definitely visit again.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "the best pupusas on the planet....we live in Antioch and travel all the way to the mission to eat here....my grandma has memories at this place and we have to make special trips just for her....", "author": "Maya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Probably the best pork chops I've had. I think I ordered the carne adobada, Worth the long wait", "author": "Ligaya P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-19", "description": "After wandering around all day I ended up dropping in, grabbing a booth and trying out Salvadorian food... something I don't believe I'd had before.\n\nMy end decision? I wasn't missing much.\n\nTo begin with the service in this place leaves much to be desired. Beyond giving us menus and taking our order, we were largely ignored. My water was never refilled, even though I set it against the edge of the table and our check took about 5-10 minutes after we'd finished eating to come.\n\nMy tamale was tasty, soggy, yet tasty. But the real negative in my book was my enchilada which tasted... funny. It may have been because it was covered in a weird tasting cheese, or it may have been the chicken was too sweet.... or even that the sauce was just... off. But it was not very good.\n\nOh and they don't take credit cards.\n\nNo thanks.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Incredibly delicious, affordably priced and awesomely nice people. I've been coming to this restaurant since I was a child with my family and if I'm in the area this is the place I go to. You will be wanting more, might as well take some to go, too. Try the horchata yummy!!!", "author": "Daisy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "I've been coming here for almost 10 years now since my folks first took me and I have yet to find a restaurant that makes better or even on par pupusas than Santaneca. \n\nThe place has changed little over the years and it definitely has a very intimate vibe to it. The staff is very friendly but only a few of them speak fluent English, which is fine with me because I speak Spanish. I could see how sometimes orders get mixed up due to the language barrier. All of the plates are authentic and the ingredients are always fresh. The price is reasonable but a little marked up due to their popularity. Pupusas used to be $1 at one time!\n\nThe location is very convenient since BART is right there but the location can also be a little ghetto at night. There is limited parking so I'd suggest taking BART. All in all, I see myself coming here for another 10 years and 10 years after that.", "author": "Javier G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "Fantastic pupusas! Get the combo pork/beans/cheese, and eat it hot. \n\nMost of the plates are in the $11-13 range, but the two pupusa combo is a fabulous deal. Pupusas are big enough that one filled me up - if you aren't too hungry, you might even be able to split the combo with a friend.\n\nThis place was a lot more of a proper sit-down family restaurant than I'd anticipated. Nice place to go with a few friends to have a long catchup, or enjoy an hour or so (not just a quick sting mission).\n\nRed sauce is hot hot hot!", "author": "Megan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "Came here a week ago after a Salvadorian friend recommended their \"cheap, delicious pupusas!\" \nI LOVE pupusas and although I am Mexican, can spot a really authentic pupusa and horchata when I taste it.\nThe horchata tasted authentic, the pupusas as well. AND delicious!\n(I am not a huge fan of horchata, so I ordered a strawberry \"liquado\" (milkshake) while my friends ordered horchata.)\nThe liquado was ALSO authentic & soooo delicous! I recommend you trying one with a pupusa if you go here.\nThey give you a free glass of water alongside your drink so no worries of being too thirsty.\n\nAs for the pupusas, I tried the pupusa with all of the toppings (pork, bean and cheese) and it was delicious! (All like around $1.50 and two can fill you up!) Definitely coming back again.", "author": "Analleli G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "it was sunday and man it was busy. we enjoyed being the only white people in the place, until another hipster couple came in. they talked about star wars. we talked about how hungry we were and tahoe. we got 2 pupusas and some eggs and some plantains. man they were all really good and we ate everything and it was cheap and it felt real.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "I visited a restaurant called La Santaneca in the Bernal Heights area and had a terrible experience. I'm not too sure if La Santaneca on 3781 Mission St and La Santaneca De La Mission are connected, but I have to say that I definitely like this location better. I can't say much about the decor, service, or prices because my mother brought home some pupusas from La Santaneca De La Mission, but I will say that their pupusas are perfectly piping hot, delicious and loaded with ingredients! I hope to make a future visit to La Santaneca De La Mission in the near future.", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "I'm confident in stating that La Santaneca De La Mission has the best pupusas in the city.  The Mission District has an abundance of pupuserias to choose from, but I always find myself coming to La Santaneca.  Undoubtedly, their specialty is making authentic Salvadorian pupusas.  The hearty dish has become a favorite of mine and this warm and welcoming restaurant is a gem in this Hispanic neighborhood.\n\nThe restaurant itself is small, yet has such an appealing atmosphere.  The walls are decorated with pictures of their native home, which adds a nice authenticity of the food you're about to enjoy.  Once you've been seated in one of their booths, a waiter brings over a menu and some drinks.  The menu offers signature Mexican and Salvadorian plates and includes:  tostadas, carne asada, soups, pupusas, etc. \n\nRegardless of my number visits, I always order the pupusa combination plate, which includes two pupusas, beans and rice.  I go with the cheese pupusas, while many of my family and friends go with revueltas (mexican sausage and cheese).  The food takes about ten to twelve minutes to get to your table and is always freshly made.  \n\nThe pupusas themselves ooze with melted cheese and are nowhere near as greasy as other pupuserias.  The freshly made masa really gives their pupusas a notch over the competition.  Additionally, once you slather the house made curtido and house salsa on your pupusas, you'll see why La Santaneca is one of the best.  The rich, yet flavorful, and spicy flavors get your taste buds going and is perfectly accompanied with beans and rice.  \n\nLa Santanecas's food is some of the best in the Mission and I can't help but recommend it to all my gringo friends.  The food is fresh, delicious, and price conscious.  After you devour your plate, be sure to spread the word; however, beware, there is another La Santaneca in the Mission, but is not from the same family, after all, there is only one La Santaneca De La Mission.", "author": "Alexander E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Amazing place!!! The food so good. A try La Lengua en Salsa. Delicious!!!!!!", "author": "Rigoberto O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "Cheap, good, reliable.\n\nThe pupusas are winners, especially the queso. I love the pickled cabbage that comes with them, like saurkraut with chile peppers. Nice heat to balance the savory. Platters are an amazing value, hugely portioned with beans, plain salad and rice. The food does feel homemade. There's a strong local clientelle and you know this place is a Mission institution. They 've done this for a long time and they've created a very special place.", "author": "Mark N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "La Santaneca is more evidence that the Mission is teeming with cheap, delicious eats.\n\nFor South American cuisine novices (like myself), a pupusa can be described as a dense quesadilla or an unusually tasty Hot Pocket.  LSDLM's freshly made version features a warm, delightfully chewy tortilla shell encasing tightly packed flavorful meat.  Both the pork and the pork & cheese pupusas are enhanced by the acidic curtido (basically coleslaw) and mouth-warming, watery yet spicy salsa.\n\nOrders to go require some skill to tackle neatly - the curtido and salsa are poured into plastic grocery bags, so any slight puncture can result in a pupusaster.  \n\nBeware the temptation to order based solely on the pupusa's circumference - the density of the tortilla and meat pack quite the filling punch.  Two pupusas are sufficient for any normal degree of hunger.  At $1.75 each, LSDLM qualifies for a rare sub-$5 meal!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "The food here was great but the service was lacking. They seemed to focus more on the customers waiting in line than those that were already seated. Example: I had to get up and ask for more water while they were taking orders of those in line. With only 3 people cooking in the kitchen this made them have a long back up of orders. \nI don't really think you can mess up pupusas. They were great! It's the only place I've had them in the city thus far and they good. Worth the wait and poor service- probably not.", "author": "Cesie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "This place is the devils butt hole. It's hot inside, no AC. Slow service. Rude workers. Bland food and by far the greasiest pupusa I have EVER had. I might as well had taken a shot of pure oil to the dome. I would NOT recommend this place... Keep away.", "author": "Dina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-25", "description": "La Santaneca, located right across from the BART station next to the McDonald's, serves the best, most consistent pupusas in the city.  It is cash only, so break out the $10 bill for two people, because that's all you'll likely need to leave satisfied\n\nFor those that have never heard of a pupusa, it's a Salvadoran staple food of fried masala and cheese, sometimes with Central American bacon pork or refried beans, topped with optional pickled cabbage.  If that doesn't sound awesome alone, then you can stop reading.  We usually order the pupusas revueltas (with sizzling white quesillo and pork), and a Salvadoran tamale, filled with potatoes and pork or chicken, much thicker and heartier than your typical Mexican tamale.\n\nA good pupusa doesn't get soggy, balances the main ingredients perfectly, and will always leave you satisfied.  La Santaneca does this perfectly, and does it consistently.   After trying a fairly exhaustive search, this has become our regular stop for pupusas.  The white quesillo cheese just oozes deliciously out of the pupusa as you make your first bite, with a nice stretchy quality you would expect from a pizza.  The pork is just salty enough to provide a good change-up of flavor, and they hold together perfectly in the masa pancake.\n\nIt's not the healthiest thing in the world, but you'll find yourself craving something you didn't even know existed after you're done.", "author": "Jeff Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "I only give this place a one star because of their banana + strawberry milkshake. Everyone who I came with didn't enjoy their plate (they know Salvadorian food given they are Salvadorian themselves) one of them looked as if she was eating glass. I, who don't know much about Salvadorian food wasn't wow'd. Safe to say I will not be returning anymore. Sorry.", "author": "Jenny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "I'm Salvadoran and im very picky about Pupusas. I must say the pupusas here were on point. The place is not fancy ......if you're expecting something fancy then go somewhere else. Not here for a fancy place ... here for some damn good pupusas. Their food is on point and workers are very friendly. Can't ask for more.", "author": "Ron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "I love this place.  Everything is fresh and made to order, very traditional. \n\nPupusas are the a small part of the menu but it's what I get every time.  Thick corn tortillas stuffed with cheese, beans, or pork, topped with a traditional (and yummy) slaw.  Get two of these with rice and beans, and you will be set for the day.\n\nService is always excellent - warm, attentive, and friendly.  The restaurant is always meticulously clean, and shows that in every little detail these folks care about getting it right.", "author": "Scott D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "Yummo!! Headed to mission st. after work looking for good eats that would be open past 8 on a Sunday. Saw La Santaneca and was excited to try their papusas, after having being an El Zocalo fan for quite some time.  I'm so glad all the other places that night were closed, because we probably would not have seen this place, my new love.\n\nWe ordered the two papusas platter, one pork, one cheese.  Holy lord these were some taaaasty papusas.  The cheese was gooey and oozy and crunchy in the right places.  The puerco was juicy and flavorful, not dry and hard to swallow like others I've had.  La Santaneca had completely revived my faith in meat filled papusas.  What I liked the most about the papusa was the dough.  I'm certainly no papusa expert, but I know when I really like doughy goodness and this was the best papusa dough i've had yet.  Pounded and mashed to perfection.  Not too thick, not to dry or chewy. YES. \n\nWhat surprised the most about the meal, is that we also shared the Flautas con Pollo.  When they say \"guacamole and sour cream\" they mean an entire fresh avocado sliced on top of your flautas with mexican crema galore (see: photos).  Again, the pollo was not dry, overly pulled, or hard to swallow.  I seriously took out the chicken, ate it on its own, and wrapped it up in the corn tortillas because there was so much goodness!  The rice they make is also great, light and fluffy, perfect with slightly runny refried beans, and a whole lot of papusa-flauta greatness  goin around. Oh and we got the platanos just because we had to, and that was also an unexpected surprise!  Not just fried platanos, but very deliberately friend platanos.  Good flavor, not too oily, and the perfect texture.\n\nTwo dishes, one side, and two drinks for only $25! No complaints at all.  Service wasn't noticeably bad, nor noticeably good.  All around great experience, good homey crowd, great food.  Take note, when you go to the bathroom, you get to walk near/in the kitchen and see all the magic happening.  The decor is fun, welcoming, and interesting too! Hope to see you here!", "author": "Rachelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "If somebody says that he/she doesn't like Mexican and/or Salvadorian cuisine... take him or her to the Las Santaneca De La Mission restaurant, they will fall in love with soon. I am not sure how much authentic the dishes coz never been to Mexico and Salvador yet but I believe they are. And this restaurant is a good reason why these two countries are the first ones on my bucket list  The food is awesome. The environment is really great. The service is wonderful. Don't forget to enjoy their drinks!!! Definitely 5 stars!!!", "author": "Denis U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "I love this place, there's only a few of their dishes that I order and shuffle around so I don't get tired of the food, but when I do order it's always good. The only reason I didn't give them a five (5) star is because of the time it takes to get the food they definitely need to improve that but customer service is great and I would definitely recommend this place to friends.", "author": "Arland B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-13", "description": "Two of the stars are for the food. But the service is HORRIBLE. We waited for like 45 minutes for the food. And that's not an exaggeration...I watched the clock from the moment we sat down until the moment we got our food. And a table that came in after us got ALL of their food BEFORE us. I don't care how loyal the customers are or even that the pupusas are so cheap (which WERE delicious) it's inexcusable to wait that long for good. Even more so when someone who comes in after you gets all their food before you. I don't think Ill be back unless friends drag me here.", "author": "Asia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-05", "description": "I was twisting and turning in my dream having a violent episodic fat pupusa craving until I woke up seeking treatment from this cute pupuseria located across the street from the BART station on 24th and Mission. With dim lighting, spacious red tile floor and wooden layout, this place is very clean, organized, and often filled with pupusa enthusiasts of all ages looking for a quick fix. I was here twice, once for brunch and another for dinner, and few can complain about the cost of these beautifully seductive pupusas at $1.75 each. The first time I had the pupusa revuelta and pupusa chicharron with rice and beans combo ($7 w/tax). These warm pupusas came in the shape of the moon with silky refried beans and delicious Spanish rice to go with sour curtido. My revuelta was filled with pork and cheese while the chicharron was hearty and plentiful. They were really delicious and reconfirm all the reasons why I love to get my hands on these big fat pupusas.\n\nIn my next visit for dinner, I went with the server's recommendation by ordering the combination seafood soup ($15.10 w/tax). With the broth sour and tangy that resembled a milder version of seafood sinigang, my huge bowl was filled to the brim with shrimps, mussels, large chunks of fish, calamari, whole baby crab, and clams. The concept was delicious with robust natural seafood broth and a degree of tang for the wow effect. The only down side was that everything still had its shells so the benefits of using them as anchors for flavoring was also a major barrier to a hands free dining experience. All except the baby crab which was difficult to eat, I absolutely love the thick pieces of fish that still had a lot of moisture and the overflow of clams and mussels was just outright sensational. In addition to the soup, I thought the side of corn tortillas was generous and decent, but the complimentary chips and salsa were a bit watery and generic. It was overall a hearty meal and something that two people could've shared. \n\nAlthough the food costs more than El Zocalo or any of the other places nearby, but the value you get in return is their persistence in keeping the place clean and presentable by wiping everything down daily, including the condiments. Service was slow and distanced during my initial visit but decent during the dinner. For the price, quality, and value, I definitely rank this place among the best in the Mission. I thought the soup was a bit expensive for a cash only place, but for pupusas I would rank them the same as El Zocalo but the lack of variety in the pupusas puts them a grade below Balompie Cafe.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "The pupusas here are extremely good!! Thanks to Yelp I was trying to locate a good place for pupusas in the mission & due to the all the good reviews decided to check this place out. \nThanks to all the yelpers I found a new place for pupusas that are absolutely tasty, especially de revuelta. Besides ordering pupusas, the fried yuca with chicharon is a must as well. MMMM just writing this review i'm craving one right one. LOL anyways, that's all i've had from this place so far, but no doubt am i coming back for when i need to fulfill my cravings for pupusas. MUST TRY!!", "author": "Patricia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Shared 2 pupusas - one pork and a cheese in the rice dough. They were both very good and came with surtido to cut the grease. It was crowded and busy but this was a great place to get a snack.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "Only place I really trust with my pupusas with in the city and their pasteles are the biggest I have ever had and delicious, you may need to wait for seating sometimes but is well worth it...", "author": "Erick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "BEST Pupusas that I've ever had in my life besides my mother's long time friend. \nIt's bothe Mexican and Salvadorean but the Salvadorean is the best part. \n\nI came here with a past co-worker for my birthday.  I also remember coming here twice in the past coming with my mother.\nI had two pupusas revueltas wih rice and bean on the side and a refreshment of horchata. The best part is that it's really inexpensive. It's very authentic and have real Salvadorean starters as well as the food. Pupusas are at a low cost too...$1.75!!!\nI will definitely come here for sure, guaranteed.\nAlso the BART station is extremely close.", "author": "Nadav M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "Amazing food!  By far the best chili relleno and tamale I have ever had.\n\nReally nice service as well and you can tell that the food is made from scratch after you order it. \n\nI will be back!!", "author": "Chad F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "More salv than mex but was very good. Casual restaurant, big menu, service was fine and food was delicious. Cash only. Lots of booths.", "author": "Will D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "My brother & I headed here the other day from a referral from a Salvadorean friend and we both became instant fans.\nThis place is CLEAN, there's abuellas pounding away at the pupusas in the kitchen and the prices are cheap.\n\n5 star Pupusas - just like my friend's abuella used make.  HELL YA!\n\nPlaintains looked amazing, but we split the tamale &  empanadas (sweeter than expected, I'd pass next time)\nTamales were good but good tamales are a dime a dozen in the neighborhood, so I'll stick with this as my go to when I crave pupusas.  The other go to place got knocked aside.  Disregard my past review for that joint.\n\nOther good Mexican places in the MisH, sure, but not a whole lot of good Salvadorean .  This pLace rocks.\n\n\nCash only, fyi - no biggie, there's only about 8 banks within 2 blocks.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "Still loving the pupusas here, revuelta con frijole's is the ONLY way to go! The atole de elote is pretty friggin good too! Bring cash, no Credit Cards here unfortunately! : - (", "author": "Larry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "Delicious food! And good costumer service!! Love this place my family and I come here regularly and have tried most of the menu and have never complained! The good is good and the venue is clean. If I had to give any recommendations it would be the fried fish plate and any kind of pupusa !", "author": "Evelyn Sophia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "This place nails pupusas like it's their business.  Oh wait, it is.\n\nThe pupusas are cheap, the food came out fast and, most importantly, they were delicious.  I got the $6.95 combo platter with two pork pupusas with rice and beans.  The corn tortilla was cooked up to perfection, with a deliciously tasty chicharrón, bean and queso filling.  The rice and beans definitely weren't an afterthought; they were very flavorful and complemented the pupusas nicely.  Throw on the curtido (cabbage slaw) and salsa, and you have a pupusa party on your plate!\n\nOverall, the food takes center stage here.  It's a homey restaurant, nowhere like the \"hole in the wall\" other people are suggesting.  The service was great, friendly and made me want to come back.  In fact, when I asked for a to-go box for my left over pupusa, they brought over a small bag of curtido and salsa to go along with it.  It may seem insignificant, but it really made my day knowing that I could eat my leftovers later along with all the fixings. \n\nI'm pretty stingy with my five-star ratings (I'm Asian after all...), but this place rightfully deserves it.  Balompie gets all the attention for their pupusas, but this place really hits it out of the ballpark.  I'll definitely be back.", "author": "Bobby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "I have walked by this place since November of last year! How embarrassing that I never tried it until yesterday.\n\nI had a huge hunkering for curtido, pupusas too ;-)\n\nThis place was packed, which was a sign--a good sign. After a short wait we got a booth and I ordered 3 revueltas with a tamarind water/juice. I could only eat 2 though!\n\nOh lawd, was the curtido good. The pupusas are made fresh (so they take a while), but once they arrived I practically inhaled the small bowl of curtido on the side. It was heavenly. The chili flakes really added a great dimension to the super warm and fluffy pupusas. Tamarind juice was perfect and made with the real stuff!\n\nFor $1.75 each, these pupusas are a steal and so worth a commute into the city on any day.", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Best pupusas in the city! Love this place. My boyfriend (salvadorian) and his family took me here years ago and I have been here numerous times since, can't get enough! I usually get the loroco cheese pupusas, plaintains, and sometimes the pan con pavo (huge!). Be aware that there may be a bit of a wait since the restaurant isn't too big.  The service is always good and the food never disappoints.", "author": "Daisy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "Takes me back to San Salvador though not as cheep.  The food here is great and it's super close to 24th St. BART. My wife and I like the food so much we brought both our families here for dinner the weekend of our wedding.  The only trick is don't  confuse it with the other La Santaneca further down on Mission in Bernal Heights.", "author": "Eric Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "Now i have been coming here to SF all of my life,and  12 yrs ago i was introduced to Salvadorian food(Via Old girl Friend) and i had my first Pupusa...Even today i make it a field trip with my kids just to go and have awesome food...BUT.....My one and ONLY complaint is that they need to expand...the line at times is all the way out the door .people waiting for a seat. \nAnd trust me the food is worth every moment that you wait for it.", "author": "Hector L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "i've had quite a few things here.\nI think the main courses are the best part of this place, I had a delicious pork shoulder that with a nice crispy skin. It's not too expensive either so it works out pretty well.\n\nThough I also got the Fried Plantains were decent, I was kinda expecting them to be a bit more fried and less squishy than I was hoping. I've had fried plantains crispy fried before and it was quite delicious. \n\nThe Empanada while the crust was good, the pudding inside was very bland. \n\nThe rice also had some weird taste to it, like it wasn't cooked all the way but the tortillas are quite good.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-17", "description": "La Santaneca is cute, cozy and warm. For El Salvadoren food, I have to say I prefer the greasier version of it all further down Mission at El Zocalo - but I can imagine spending many comfortable mealtimes at La Santaneca - in their hospitable fashion they would never hurry you off - whereas El Zocalo is way too brightly lit, service is a slapdash affair, and the bathrooms are usually bordering on disgusting.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "Adorable hidden gem of a restaurant in the Mission! I walked in here with some friends late one night after a long day; we were drawn in by the casual atmosphere (nice lighting and not too noisy) and reasonably priced food. La Santaneca truly did not disappoint. The pupusas are some of the best I've had (just the perfect amount of cheese, unlike some of the insanely cheesy pupusas I've had at other restaurants in the neighborhood), and they serve a number of other Salvadorean/Central American specialties as well (such as elotes, sweet corn tamales, fried plantains etc.) that aren't served at most restaurants. Also appreciate that cleanliness is definitely a priority for them, which definitely cannot be said for all restaurants in the Mission!) Only reason they didn't get 4 stars is that the service was on the slow side.", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "An amazing place to come for some quality Salvadoran food.  Be sure to get their pupusas!  Their full plates are nice as well (especially the yucca), but pupusas are an absolute staple.  Lots of different fillings, affordable and delicious!  \n\nAdditionally, the waitstaff is very friendly and sweet.  Cute interior, easy to find and right next to BART.  The perfect city stop for some authentic Salvadoran cuisine!", "author": "Ivana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Have eaten Mexican (read: Tex-Mex) food my whole life but don't recall eating at a place that was officially salvadoreño so I was looking forward to having it for the first time. It appears I went straight to the top! La Santaneca on 24th and Mission was spectacular. An establishment that clearly has been a local favorite for a long time and definitely stands out among the plethora of latin choices in the Mission. The pupusas were fantastic and honestly every plate looked delicious. It did come with a brief wait as it seems they sustain a crowd for most every meal, but that brief wait should be evidence enough that its definitely worth it!", "author": "Brett N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "Pretty awesome place. The Papusas were really good and this is my favorite papusa place of choice.\n\nA definite must!", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-16", "description": "I really liked the pupusas from here, they were really good!  I ordered a couple of the pork, cheese & beans w/loroca and it came with some curtido on the side and I would have to say this was one of the better pupusas I've had in quite a while.  \n\nThe only reason of the minus one star is that it took way too long for the food to arrive after we ordered.  Also, the waiter didn't seem too attentive when it came to refilling our cups of water unless you caught their attention and spoke up.  If I could rate this place on the food alone, it would be 5 stars, but the service definitely needs some improvement.", "author": "Kahanalei M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "I love papusas!! Ever since I discovered them at street fairs..I have been on the look out for good papusas. \n\nToday, my good friend Jaime took three of newbies to La Santaneca. A San Francisco native and Salvadorean, James vouched that this place has damn good papusas. He wasn't lying. He ordered us each three different kinds of Papusas and other authentic dishes and beverages to try. I love the fried yucca and pork dish! It was topped off generously with a cabbage salad. All the delicious food was washed down by a refreshing Salvadorian soda and a cinnamon flavored drink. \nWe ended of meal with a some pineapple pastries. \nDuring our meal I studied the menu and found several other dishes I would love to try..not to mention the enticing dishes that were being pated on other people's tables. Unfortunately my tummy ran out of room. I guess I will have to wait for trip #2..Lunch anyone?", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-16", "description": "If my review were based solely on their pupusas, this review would be 5+ stars.  I know pupusas, and this place really has the best pupusas in the Mission (especially when you factor in cost).  In fact, I have been going to this place for going on three years, so definitely worth going.  In fact, I pretty much refuse to get pupusas anywhere else.\n\nThe tamales I thought are ok (i say this because I prefer the ones my mother makes to any other tamales I've ever had).  Plantains are awesome as well.\n\nSo why, you ask yourself, am I giving this place three stars instead of five?!?  Well, there is one very important reason.  The service there has been declining.  Whenever I have the great pleasure of having the one female waitress employed by this place, my service is amazing.  Everything is promptly delivered, as ordered.  Unfortunately, the last half dozen times I've had one of their male servers (slightly older, balding) who just doesn't cut it.\n\nEvery single time I've been there, he has forgotten to bring me my water.  This may seem petty, but when you ask for water, wait 20 minutes and it still hasn't been brought out, that is a problem.  The first time I didn't really think too much of it.  The second time was the same.  The third time, I realized that the same waiter had done the same thing the two prior occasions.  Every time since then I've had the same issue with him.  It has gotten to the point that last time I had to tell the waitress that I love how amazing she was and how next time I was going to make sure to ask for her to wait my table.\n\nSo, will this make me go to another pupuseria? HELLS NO.  I love this place.  Does it annoy me that I can't ever seem to get this guy to give me water?  Of course.  Does it pain me to give my favorite pupuseria 3 stars? Yes, but such is life :(", "author": "Banana S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-22", "description": "I have always eaten at this place and always been pleased with the pupusas. But today i was disappointed The pork pupusas tasted like the pork was going bad. On top of it i took some to my co-workers and they didn't like them either. I just hope I don't get sick.", "author": "Ivy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Service is a bit slow but the wait is worth it. Get a pupusa and the platano frito with sour cream, love it!!", "author": "Marlo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "I went here for some papusas, as recommended by a couple of friends.  I tried 3: the cheese, pork, and mixed (pork and cheese) to see how each one differed. They all did and they were fantastic.  The pork is rich, the cheese is slightly gooey, and the mixed was the best of both worlds.  Don't forget the slaw.\n\nAt the end of the meal I exclaimed, \"This is filling!\" in food coma fashion.  Fantastic for the price, therefore they are OUTSTANDING 5 stars. Go give La Santaeca your business now!   \n\nThe horchata isn't anything to ignore either.", "author": "Neil E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-27", "description": "First time having pupusas. Sure - meat, cheese, and beans in cornmeal dough, what's not to love? They're perfectly fine, but that's it. Nothing about them is special or unique. Would've rather had a burrito at almost any local joint. Waited a half-hour for the food. Decent service, other than the wait. Excellent melon water, but that's available at any taqueria here.", "author": "Joe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "Walked upon a hidden gem (in my eyes). I've passed this place so many times, but never thought to drop in. So glad I did. Came here with 3 other adults and 2 kids - we ordered a lot, and ate EVERYTHING.\n\n- rice and beans were flavorful and delicious\n- beef tongue was surprisingly tender and flavorful\n- the papusas were AWESOME, especially when eaten with the sauce and pickled cabbage\n- plantains were fresh, juicy, and served hot. \n\nService was fast and super friendly. Delicious food, must try it out!", "author": "Carol L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-30", "description": "I love this place!\n\nFor about $6 I get to over feed myself a couple of Chicharrón papusa's with beans and rice. The Papusa's are being constantly made in the kitchen ALL DAY LONG which makes me feel good that they're not just grabbing it from the freezer.\n\nI just wish the place was open later at night and things would be a lot cooler if they served beer.\n\nDrinks side, the guava is tasty but the horchata is a little light on the cinnamon.", "author": "Keith A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "Best pupusas in the Mission, possibly the best anywhere ever, and yes I've gone to the trouble to sample every pupuseria between 14th and 30th Street before writing this review. Never tried anything else on the menu because those pupusas are just too irresistible. The homemade coleslaw is so more-ish and the perfect vinegary salty crunch served with the pupusas. Perfection for $2.00 or less. If only this place stayed open later than 8pm on weeknights!", "author": "Nacho C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "Like a lot of other posters, I think La Santaneca De La Mission's pupusas are great. DON'T JUST LIMIT YOURSELF TO THE PUPUSAS, though you'll be doing yourself a great disservice.\n\nShorty and I were making the rounds to the various and sundry tschotskerias on Mission the other day when Shorty started making these sad little half-clucking noises, which when asked Shorty said were the noise chickens make when they freeze to death. Shorty then elaborated that every day hundreds of thousands of chickens were cruelly frozen to death in the name of stocking our supermarkets with frozen chickens. Rather than trying to delve into all the intermediate steps like depriving the chickens of their god-granted feathers and giblets, I decided to take Shorty somewhere where we could fill Shorty with something warming and reviving.\n\nConsequently we stopped in at LSDLM and bypassing the pupusas, opted for big bowls of caldo (soup), for Shorty Caldo de Camarones (shrimp soup) and for me Caldo de Patas (pigs foot soup). For $9-10 we got huge bowls of soup. Shorty's featured a richly seafood flavored tomato-colored broth and 8-10 large shell-on shrimp (no heads much to Shorty's disappointment -- probably went to making that great broth) and a couple of good sized knots of scrambled egg. Mine had several big chunks of pigs feet, sawed into easily manageable pieces, squares of beef tripe, and a piece of corn and a big chunk of yucca in a menudo-like red-chile spiked broth (it also came with a small dish of chopped onions and cilantro). Factory-made, but nicely griddle toasted corn tortillas came on the side, we also split a Pastel de Carne, a deep fried ball of minced beef and potato wrapped in some kind of dough and served at center of the sun like temperature. All really good stuff.\n\nExtra credit for their ultra-clean bathroom which you access by walking by the cadre of women patting out and slapping pupusas on the massive griddle. Only minuses would be the crowding if you don't time things right, the store-bought tortillas, and the can be forgetful (this time they weren't) service.\n\nGood stuff, and Shorty isn't making tragedy-stricken chicken noises anymore.", "author": "Ed T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "If you want the best pupusas in the bay area.. scratch that in Cali come here!! Hands down the best pupusas I've ever had and I've had them all through California due to the fact i love me some authentic Salvodorian pupusas. Cheap and so worth it! I get the combo 2 pupusas w/ rice and beans on the side and that fills me up! The waiters are very welcoming especially if they remember you! LOVE LOVE this place. Right off of 24 st mission bart station you literally cross the street towards McDonalds and your there! Come to La Santaneca for the best pupusas in Cali!!! Pupusa WORLD!!!!!", "author": "Claudia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-20", "description": "This was a decent place for a light dinner and reminded me that I'd been here once before, a couple years ago. The pork/cheese pupusa was tasty, as was my chicken tamale, though both would benefit from a little more seasoning. I got a bite of a chicken enchilada and agreed that there was a flavor that seemed odd; I thought it might have been a slightly musty tortilla. My horchata seemed a bit grainy, like cocoa or kool-aid when not all the powder got fully dissolved.\n\nStill, I was reasonably happy and satisfied with the portions and price, and the staff were friendly, even when informing me that they only take cash.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-11", "description": "Sign reads: bathroom on the back.\nand yet placed so very strategically right under the menu.\nI was so looking forward to eating papusas. It's not everyday I find myself at a papuseria. I ordered, they came, I ate. And it was not long till I was in the bathroom on the back. The food was fast looked good and tasted good but did not sit well with myself or the party that accompanied me. So no, I did not get a bad papusa.", "author": "RICARDO R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "PUPUSAS!!!  Hands down the best I've ever had. I get the ones with pork, cheese, and beans- We usually order 5 pupusas, horchata for two and an empanada and the bill is always less than $20. I drive all the way from San Rafael just to eat them.  I absolutely love this place!!!!!", "author": "Robin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "3 pupusas for $6. Doesn't get any better than that.\n\nA friend brought me here for my first pupusa experience ever and omg, it was a fantastic experience. I ordered a plain pork, a pork with beans and cheese, and a pork with cheese and LOVED these little warm pockets of goodness!\n\nI topped my pupusas with the deliciously spicy, tangy slaw and a light drizzle of hot sauce...HEAVEN! We had to wait awhile for our food to arrive, but it was totally worth the wait.", "author": "Karena Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-02", "description": "This place was a HORRIBLE experience. \nSlow service and food took forever, NO CHIPS N SALSA and loud as hell!\n\nFood was not worth the wait. Too salty and not very authentic  If you're in the mission, keep looking...there's so much more to choose from. \n\nLimited menu and cash only.", "author": "Christos L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "In my opinion, best pupusas in the city. Although, I have noticed an increase in their prices.", "author": "Nemesis J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "Cheap authentic pupusas that taste awesome; this is a plus for my student budget :) though they are known for their pupusas, they have different options as well such as sopas and dish combinations so no need to feel limited to their pupusas in case you're not into that x)", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "Cheap and delicious pupusas!  I went with a friend tonight, and we got two pupusas apiece with one bottle of sangria soda.  All for $10...there oughta be a law against that!!", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "Muy rico pupusas, like abuelas cocina. Seriously this place is so awesome, and super close to the 24th and mission Bart exit.", "author": "Renato S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "The food was delicious. My wife and I wanted to grab a bite to eat and after reading the other Yelp! reviews I was determined to try the pupusas. The cabbage and salsa had a great flavor. She got the Chile Relleno de carne. Both were excellent choices and I would go back in a heartbeat for Salvadorean food.  It doesn't get any more authentic then this place and it was super cheap too!", "author": "Josh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "The pupusas are good. But the pastel de carne was the best! I like the yuca too, but next time I should order it without chicharron because it's not my favorite. \nThe walls are also adorned with great artwork from El Salvador.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-04", "description": "I can't stop going back to this place and I constantly crave the cheese-oozing, pork-filled pupusas.  and the price!  can't beat it.  yesterday my boyfriend and I went for lunch and got 3 pupusas, an order of rice and beans, and fried plantains- all for $16 including tip and we were so stuffed we could hardly walk out of the restaurant...  \n\nI've never tried the Salvadorian dinners- the menu for which is pretty extensive- because I am always so satisfied by the mix-and-match lunches I can create from the pupusa and side dish menus.  One thing I know for sure, though, is that there is something to please everyone.  The atmosphere isn't fancy but I couldn't care less- that makes for cheaper food that is always reliably delicious.", "author": "Luthien N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-23", "description": "This place is just OK. There are so many better places in the mission.\n\nI would go to el farilito any day before I go here.\n\nI had some grilled chicken thing and it was SO DRY. Won't be going back here.", "author": "Josh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "I have to say the best \"PUPUSERIA\" around. They have the best pupusas in the bay area, filling is perfect you can taste the cheese, the chicharron the beans the lorocos etc.. like if you were in El Salvador. I would say that if you really want to make your money worth eating pupusas, this is the place to go. You probably have to wait a little bit, the service is ok but is all compensate it when they bring the food to you and start endulging it. Such a great experience!!!", "author": "Julio N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "My first experience with Salvadorean food and beef tongue. For a hole in the wall, this place exceeded my expectations. Service was friendly, the place was clean, and the ingredients looked and tasted fresh. The food is tasty and is made to order and so if you're looking for a quick eat, this is not the place to go (the menu even says to expect an average wait of 20 minutes for your food).\n\nBeef tongue, I now know, is a very soft and tender meat. It's good, but if you want more texture, you'd probably want to stick to your typical meaty things.\n\nAs a tip, this place DOES NOT accept credit cards! There is are banks nearby, but still, it'd be better to bring cash. Average dish is a little over $10 so plan accordingly!", "author": "Wendy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "Since I first had my first pupusa a few weeks ago, I've been craving them like crazy. I came across this restaurant as I was Yelp-surfing and decided to come try this place. \nFirst and foremost, the pupusas are just as delicious as everyone has been saying. I got the pork and cheese ones and they were huge! And they were filled with goodness! I got three pupusas thinking I would still be hungry but boy was I stuffed by the time I was done with my second one. Also, it is super cheap! One pupusa is only $1.75! The plantains were also delicious. I really like the taste of their beans here and my best friend loved their rice. \nHowever, the service was only alright. They were friendly but didn't really check on us and the service was really slow. It took them 20-30 minutes to bring our food out and there weren't that many people at the restaurant. \nBesides the slow service, I would definitely come here again to get delicious pupusas. I would also like to try some of their other dishes.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "What can I say - fantastic pupusas.  Stumbled in here once my hunger had overwhelmed my ability to decide what to eat, and was very pleasantly surprised.  Pickled cabbage and great salsa.  My only regret is that I didn't eat more.", "author": "Clint H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "Love this place! First came here with my parents and now I love bringing my buddies here too and they always love it too.\n\nI always, always, always get the chicharon and fried yuca appetizer.  Delicious.  Always a pupusa or two to share with whomever I'm with as well in addition to our entrees.  Never disappoints!", "author": "Marco S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "Best pupuseria in the Mission. Service is a little slow, but it is completely worth it. Wish they sold beer. Yuca con chicharon is pretty bomb too. Space is small and hot, they need some ventilation.", "author": "Roberto M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "Best place for pupusas.\nBest place for tamales.\nBest place for fried plantains.\nEven if it means taking BART from the East Bay.\nThe service, while friendly and warm, was a little slow. I look forward to returning when I am not in a rush to get somewhere.", "author": "Eva UnTiger S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "I LOVE this place! I'm Salvadorian and I travel to El Salvador often so I know what salvadorian food is suppose to taste like and most def La Santaneca takes this one! I've been to a few other spots and no one beats this place. The pupusas are the best (pork, cheese & beans) Don't really order anything else but have tried other stuff. The Horchata is really good as well. I love how they remodeled it the place.. If I'm on mission I stop and have some pupusas!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "I would venture to say that they serve the best papusas in the Mission.  Not to mention their fried plantains.  The fact that it is right next to BART, so I can pop over on a whim only adds to my love for this place - and my current craving.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Located near the McDonald's on 24th street and Mission, this place is actually pretty good!\nOffering both Mexican and Salvadorian cuisine, this restaurant has a lot of food options, even for breakfast.\n\nI personally had a Salvadoreño steak, which was very tasty and came in large portion for a cheap price. Other entrees my friends had were also very good, such as the soup or the famous papusas!\n\nThe only regret about that place is the lack of alcoholic drinks (especially beer and alcoholic sangria!), but otherwise it's a very good option.", "author": "Bruno P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "This place is amazing it has the best pupusas ever lol the customer service is great and so is the atmosphere, but I don't recommend the bathroom to tall people cause the ceiling was very low and I'm 5'7\" but other wise absolutely great food also their are some treats in a plastic display box make sure you get the round tart it was buenísimo ( BTW I'm Spanish) also they only take cash but there is an ATM across the street literally right in front. so anyways if your looking for an authentic Spanish themed restaurant you know where to find it \n2815 Mission Street, San Francisco, CA 94110-3907 lol", "author": "Jose D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "The place is cute, it's always hella packed and sometimes you have to wait for a table, but it's a short wait. The menu impressed me, LOTS of delicious salvadorian food.\n\nI came here with my friends after a long night of drinking. I ordered my usual 2 pupusas de chicharon con queso y loroco. They were pretty damn greasy and pupusas should NOT be greasy at all. I ate them because well.. what's the best thing for a hangover?? GREASY FOOD!\nI liked their curtido and that's about it. I'm sure a lot of people like it but go to panchitas 3, it's damn good there.", "author": "Debbie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-12", "description": "The pupusas were okay, but the banana pastries were amazing.", "author": "Carly V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-21", "description": "I used to live and work in San Francisco and loved the Mexican and Salvadorean food in the Mission. I got hooked on pupusas.  I now live in the East Bay, and when I need my pupusa fix, I hop on the Bart and meet a friend at La Santaneca (24th and Mission).  I've been there several times and I'm probably their \"biggest fan.\"  It's loud!  People are laughing, talking and eating great food.  It's not fancy and you have to pay cash!  There's no alcohol!  Trust me, you'll survive!   I go for the pupusas.  They are to die for!", "author": "Blondie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "So the BF and I just left this place and it was so good I had write a review as soon as I was able to feel my fingers from having to walk in the freezing cold! It's a little hole in the wall restaurant, with amazing food. The pupusas did not disappoint. And they're great portions for very cheap. It was 25 bucks out the door including tip for the both of us. The reason I gave four stars, actually there's two. One is that although the waiters were polite they were otherwise indifferent. It also got extremely packed right after we arrived maybe that's why? And secondly while we were eating there was a lady in the already too crowded restaurant asking for money for some charity? Can I please eat my meal with out feeling guilty? After I told her no she proceeded to ask my boyfriend to donate.... Um hello?! No. It would be nice if they had a no soliciting sign somewhere and didn't allow people to come in and do that. Over all the experience was great food was awesome I know we'll be back!", "author": "Bae G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Pupusas!  \nWe had a craving for pupusas, and then we couldn't pass up trying the fried plantains.\nThe pork & cheese pupusa vs the bean & cheese pupusa...surprisingly (we're big pork fans) the bean & cheese was victorious! Was delicious, the beans make it! The pickled cabbage and sauce were good too, but think the cabbage could have a little more to it. The pork & cheese pupusa was still good, but the pork had less flavor than the beans.\nThe fried plantains, beans and sour cream appetizer was sooo good, the plantains were cooked perfectly, we just wish there were more beans with it ;) it's a must! Will definitely be ordering this again!\nDefinitely a great stop in the mission, convenient to BART, friendly staff, and a quaint little place in the heart of the mission district of SF! We'll definitely be back!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-07", "description": "good food. good service. came for the pupusas and we weren't disappointed. not greasy like some places make them.  I tried the Arrayan which is wild guava drink.. Too sweet and gritty but I'll try the mamey next time.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "So I saw on the 7x7 that Pupusas was on the list--went there and it was just okay. However, this place hit it home. It was really delicious and I'm happy that it's right next to Bart. \n\nI've been eating pupusas since I was a kid and this place took me back to the good old days.\n\nSuper satisfying and will definitely come back here again.\n\n:)", "author": "Tina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "Best pupusas hands down!  I wish I lived closer...", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "I love this place! My parents found this authentic eatery as teenagers and we've come to eat here regularly ever since. I live in Sacramento and I can't find a place as good as this one! Every time I come to SF, one of my first stops is to La Santaneca. Everything tastes the same; very consistant. The best Salvadorean food I've had =)", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-17", "description": "Really, it deserves 1 star for my dinner.  However, I suppose I deserved it.  \n\nI ordered off the mexican menu section at a salvadorian restaurant.  However - if you are going to have a mexican section, you should at least try to make it better than what I had tonight.\n\nI had the chile rellano.  I really like this and have had it a great number of times.  This was the worst.   It was in a very runny 'see through' thin sauce and the chile itself was total goo and had a bad texture.  The beans were a goopy pureed paste, and the rice was just rice.\n\nI considered having one bite and paying the check but I thought that would be rude and well, if I didn't order the pupusas at a place like this I suppose I made my bed and deserved to lie in it.\n\nNot returning, except maybe to try one of their pupusas some day.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "This place is great. My family is all from El Salvador and have always loved this place. I do not come here often, but when I do its heaven! The pupusas are just as good as my mothers!", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "Best pupuas I have ever had in life! They have many different choices (meat/cheese, bean/cheese, etc.) and they are made  fresh to order. The cabbage slaw they serve with it is always nice and vinegary, yet still crunchy. I usually call-in my order here because they can get pretty busy. This place is worth trekking on BART from Oakland to get pupas.My step-dad is from El Salvador and agrees that these taste like \"home\" to him.", "author": "Nicky E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-06", "description": "Clean little place in the midst of not so cute area. Great service! The cheese pupusas were wonderful but I can't recommend the pork. Can you say salty ass manteca! Plantain empanada was bland. Of course you have to circle around  for 30 minutes to find parking.", "author": "E. Y. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-02", "description": "definitely THEEE best papusas I've had. mmm. I want some now!", "author": "KevMo G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-31", "description": "The chicharron (pork only) papusa was interesting and new, but the meat was a little grainy.  The crunchy slaw and the red sauce added complementing flavours and texture to the dish, which was brilliant.\n\nI also had a prawn soup, recommended by the waiter who did not speak much English.  The soup was flavourful and saturated with the taste of shrimp -- great!  Unfortunately, the shrimps (they are not shelled, I'm indifferent about this) were extremely overcooked and tasted like rubber.  The soup came in two sizes, and I was told the only difference was the number of prawns.  I am definitely getting small next time.", "author": "Bill T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "i was definitely impressed by la santaneca.  the food is so cheap and SO good, i would totally want to come back.\n\nwe shared the two pupusas with beans and rice (we got the two different mixed pork pupusas) and the fried plantains with beans and sour cream.  seriously, so good.  everything was really tasty without being overly greasy and the flavors were excellent.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "With so many restaurants in the area, you know this place must be decent if the lunch crowd is still waiting for tables at 1:30 on a Monday afternoon.  I chose this place as a meeting spot based on the reviews and was quite pleased with how it turned out.  Most of us went with Salvadoran dishes to try something different--they had a very flavorful and tangy taste you don't have in Mexican food.  I had the steak while others ordered the chicken with mushrooms and imitation crab enchiladas.  Servings were generous, and everyone was pleased! We also ordered a tamale and empanada as appetizers (both vegetarian for the pescatarian at our table).  They were also yummy.  You have an option of \"fried or boiled\" for the tamale...always go with fried!  It was pouring down rain so they offered bags for our umbrellas.  Definitely a good place to go on a rainy day.  Also doesn't hurt that there is a public parking lot around the corner (if you have to drive) and a BART station steps away.  If you like things quiet, this place has a lot of ambient noise.  I didn't mind at all since we were able to have our conversation just fine.", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Absolutely the best Pupusa's in the Bay!!  I drive from San Jose to come here.  Why?!  #1 Pupusa's are NOT greasy at all.  Been to other places where taste is good but grease is all over the plate.  #2 Taste, filling and size are more than plentiful, tasteful and reasonable.  #3 This should prob be reason 1 but, super cheap for a tasty well made authentic Pupusa.  This is coming from someone who's partly of Salvadorian descent and has been to El Salvador to have Pupusa's.  Moms a Salvi and she's a fan!!!  However I recently introduced someone who's American to Pupusa's and to this restaurant and they were instant fans!!  Loved the Pupusa's de frijoles con queso, chicharron con queso and platanos.  But to my surprise he couldn't stop talking about the chicken enchilada...  It was only one but was large and loaded high and wide w/ chicken and topped w/ plenty of cheese and sour cream.  He couldn't get over how delicious, fresh and hot it was when it hit his mouth!  Now I need to expand and try the rest of their menu.\n\n4 stars only because it's cash only so you have to be prepared and customer service sometimes lacks.  Aside from that excellent food!!", "author": "Liss A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "Best pupusas from a restaurant (because no one beats my mom's pupusas)!!! The cheese is nice and guey, the chicarron is mearty, and the loroco is perfect. They are soooooo good that you will want to start ordering other things off the menu, which we did. The yuca frita was nice and crispy and the chicarron was to-die-for.  The platanos fritos are perfectly sweet. Every friend (Salvi and not) that I have ever brought here has loved this place.  Even my verry Salvadorena mother-in-law approved. Check this place out it is amazing!!!", "author": "Grizzy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "This is the super papuseria!  \n\nI thought I didn't like papusas until I came here! These don't even compare with other places -- they are that good, and only about $2 each. The papusas salsa is runny, slighty vinegary, not too spicy, and is the best in the Mission.\n\nI also had a fake crabmeat enchilada that was awesome and the fried plantains were also great. The horchata is very unique and has sesame seeds, isn't too sweet, and is muy authentico. \n\nOnly La Pancha has better papusas.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-05", "description": "It's true that the pupusas here are very good, as are the hand-made tortillas.  If you're going to eat here, I'd stick to these.  I, unfortunately, ordered the sopa de rez instead (as I usually do), and it left a lot to be desired as the quality of the meat was terrible, the broth wasn't very flavorful, and there was a fair layer of grease floating on the surface.", "author": "Zain K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-22", "description": "God I wish I had a pupusa right now...or just half of one. Topped with delicious pickled cabbage, hot sauce, and oozing with pork, beans, and cheese. \n\nIt's the battle of the Santanecas. For the past year, since I discovered pupusas, I have been loyal to La Santaneca up near the Bernal/Excelsior side of Mission St. However, yesterday, I was just a block from THIS location, so I thought I should pick some up for dinner. \n\nWell...\n\nThe verdict is in: The pupusas here are bigger, tastier, and more expensive ($2.00 each for la revuelta con frijol). I did a to-go order and it took less than 10 minutes for my 9 pupusas.\n\nI wouldn't like to stay and eat at the restaurant though...it's too stuffy and humid inside (poor ventilation). It has a nice ranchero-cowboy-vaquero theme going though.  \n\nPupusas=yummers\n\nCASH ONLY--EFFECTIVO", "author": "Misha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "3 words: PUPUSAS and FRIED PLANTAINS!\n\nThey are among the best in town and only cost $1.75 -2 each. I usually get the pork, bean, and cheese or just the plain cheese. They are served with the slaw, salsa and sour cream on the side. Very tasty and super cheap.", "author": "Rex D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "Best pupusas in town!\nI have been going to this restaurant for 10+ years and refuse to go somewhere else for pupusas.  Their food is always fresh, delicious and cheap.  Make sure to try the tamales and platanos as well.  You will be really glad you went to this authentic Salvadorean spot.", "author": "Sofia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Went for the papusas.  These are better than Balompie's!  They are larger with more filling.  The plantains are devine!  The crutido needs more vinegear, but overall, this was a great experience and the food was  yummy and filling without being greasy.", "author": "Sandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "Pupusas are like the stuffed-naan of El Salvadorian cuisine - torn, dipped, eaten with your hands.  And they're sooooo yummy.  I had the bean and cheese; my companion had the bean, cheese and pork; both were fantastic.  Each pupusa is about 6 inches in diameter and about 1/2 - 1 inch thick, and only $2.  I'd order 2 or 3.\n\nDon't foolishly waste your appetite on chips or a tamale.  Just stick to the pupusas.", "author": "Tessa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-29", "description": "Well, I don't care for this place period, but my friend suggested we go here instead of Las Palmeras, so we did. First of all, service sucks, SUCKS! but I got over it. Crowd is \"different\" \n\nI ordered my pupusas, yeah, tasty, not bad, until I took a bite and guess what? I found a chunk of GLASS in it! I spit the damn thing and call the waitress and she still has the balls to question it! \"Fuck you\" was my attitude, just wanted to pay and leave and NEVER come back! \n\nLas Palmeras rock!", "author": "Anabelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-17", "description": "Some of the best pupusas in the country. I've ate them at alot of places and i'm proud to say San Francisco has the best pupusas besides El Salvador.", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "Came here for breakfast after a Sunday morning Taiko class at Dance Mission.\n\nSometimes I want beans with my eggs and tortillas instead of toast.  This place has one of the better dining atmospheres and, as far as a Mexican-style breakfast, delivers just fine.", "author": "Molly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "WTF?  That is the question I have been asking myself.  Why the F#$% have I not been here in years, decades actually. \n\nThis is one of those places that makes me nostalgic for the 'good ol days.'  Way back when my cares in this world were what toy was I going to con my parents out of buying me or what radio station was I going to play in the Aerostar van.  Oh and my sibling's and I were brats too, my parents were nostalgic for food from the motherland and we never were so this place was convenient, they could buy us happy meals right next door, ha!\n\nAnywho I decided to try it again, an acquaintance of mine had told me he LOVES the pupusas here and I said what the hell, lets give it another try.  I ordered a couple pupusas and an authentic Salvadorean horchata.  The pupusas were excellent!  The curtido (cabbage slaw) was on point, with peppers, a very nice kick.  The service was good, cute waiter, attentive and quick.  I am a fan once again, why I quit I will never know.  Now I have too many choices in SF for pupusas, this place is so convenient, you literally walk into it from the Bart station.\n\nNow I feel like Barbara Streisand, \"memories...\"", "author": "La C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-08", "description": "This place is da bomb.   The puposas are so big and tasty, and the cabbage slaw served with them is tangy and crunchy - yum.  \n\nOnly caveat:  Watch out for the gang members who hang on the corner.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "According to an online review, apparently this place has been open since the 1980's, although you would never know that stepping into it's clean, somewhat modern interior. Located at the intersection of 24th Street and Mission Street in San Francisco, it may be difficult to spot this \"diamond in the rough\", hole in the wall restaurant. If you haven't had food from El Salvador, specifically pupusas, give La Santaneca a try. \n\nAt about $1.75 each, the pupusa is a round, flour/corn treat wrapped around your choice combination of chicharron (pork), refried beans, chicken, or cheese. It is served with the native vegetable mix, a shredded, cabbage-like vegetable with a pickled taste.(in addition, I like to spread salsa over the pupusa as well). Definitely different. Most newcomers to pupusas underestimate the density of these little pupusas and order too much. I think the average person should be satisfied with two, maybe three at most. Also your meal is served with chips and spicy salsa. I don't know what it is about places that specialize in El Salvadorean food, but their salsa tends to be more runny as opposed to thick and chunky. Still, a delicious compliment.\n\nThe wait staff is friendly and accomodating. During busy times you may have to wait for a table or for your meal a little longer, but it is worth it, and you never have to wait a ridiculous amount of time. When all is said and done, you will be full from some of Santaneca's delicious pupusas, and even with a drink and their very delicious flan dessert you'll still have some money in your pocket to save for a rainy day.", "author": "Danny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-23", "description": "OK. So we came here just for the pupusas - to try them - because we love trying new foods - and now all of a sudden we're in love with them. And with La Santaneca - and with the ladies in the kitchen who so lovingly made them! Make sure you try the loroco flower one! And don't be afraid of the fried plantain - it's a bit weird to our eyes to consider fried banana, refried beans and sour cream, but trust me, delicious! 4.5 stars! Half off for the no beer thing...\nOh, and one more thing - I noticed during our meal that we were the only white people there - everyone else was Hispanic - and we left just as an older (50s) couple was leaving. I asked if they'd been here before & the lady said, \"Oh yes. We're from El Salvador. This place has the best food from home. We love it here...\"", "author": "Steve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "All I can say about this restaurant is that although it may not be for the vegan, it is an old world hole in the wall place. \n\nWhen my family first came here from El Salvador, we always went to this place. The food is not as good as my grandma's, but it is as close to it as I can ever come. \n\nLocated right in the heart of the Mission District on 24th street, parking may be a difficult task, but if you enjoy good fatty food and a good time, this is the place to go.\n\nFavorite Dish: \n\nPupusas (Meat & Cheese) or Cheese and Vegetables.\nTamal de Elote con crema: Sweet corn tamle with Salvadoren sour cream", "author": "Ana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "A friend suggested La Santaneca for pupusas. I've been dying to try them so we trekked to the Mission....and promptly learned she meant La Santaneca in Bernal Heights. Oops.\n\nNo matter. We were hungry, and it looked tasty enough, so in we went. I do not claim to be a pupusa expert - in fact, this was my first experience - but our group LOVED our meals. Everyone got the two pupusa meal with rice and beans, and we were pleasantly surprised at the amount of food we received for a mere $5.50 each. And while La Santaneca's tortilla chips taste like they're fresh off a Safeway shelf, their salsa is really, really tasty.\n\nOverall, it was a great, cheap, tasty meal in a convenient location, and it embodied two things I love about life in San Francisco: 1) you can find just about any ethnic dish you're dying to try, and 2) even when you arrive at the wrong restaurant there's a great chance the food is still terrific!", "author": "Beth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "Where locals go for BOMB pupusas at a decent price!!!  Their curtido is perfect and I always order the sopa de camarones and platanos y frijoles y crema.  Omg, I'm salivating!  Love you guys!  Don't change a thing!", "author": "Humble T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "Best pupusas in the Mission!\nThey also have a mean caldo de siete mares (seven seas soup).  YUMMY!!!\nI've been here often and I'm always happily satisfied.\nI don't think they serve any alcohol yet.\nLuckily, they have a some fresh fruit juices like tamarindo, my favorite.\nThey are a small restaurant, very latin.  You go through the kitchen to get the the toilets...  LOL  the sort of thing you should not be surprise to see in the mission.\nI love this tiny little place, and I would recommend it to anyone.", "author": "Yamil A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-03", "description": "Yummy pupusas for $1.65 each. Service isn't the best (kinda slow and kinda non-existant after you get your food), but it's still a lot better than El Zocalo - at least I didn't have to wait half an hour for my food to come out.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "We just stumbled in here. It's a cute, clean-looking, hole-in-the-wall, which is about half full for Sunday brunch. It's a great full-service option for Mexican-style breakfast. They serve water out of the yellow 80's diner glasses. The coffee was a bit weak. I ordered a Salvadorean shrimp omelet. The food took a while to come out, but the servers were nice. The omelet was thin, browned, full of scallions and shrimp, and delicious. The corn tortillas were very warm and fresh -- and we asked for a side of fresh butter, which we put on them and that made it delicious. Also, my friend got something with platanos maduros. A little blackened and SO GOOD! On everything, I wish they took the salt one notch down. Overall, the place is a hidden gem. Avoid the rush at rival brunch spots and go for authentic.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "This place looks pretty good.  I am all over that Revuelta pupusas.", "author": "Jim J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "Papusa heaven!\n\nI could wax poetic, but really this can all be wrapped in three words: Quick, cheap, delicious - what more could you ask for?", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Thi!s place is bombing!  This is my official papusa hook up spot! The service is ok. Call ahead for take out!", "author": "Fatima Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "Love. love. love.\n\nI bow to the pupusas that are oh so kind to my wallet. I adore these pancake looking but filled with chicharron goodness papusas. That spicy pickled cabbage and red sauce make me sigh with pleasure. I want it. Again. Maybe after I've recovered a little from my state of fullness. \n\nThe shrimp enchilada plate was ENORMOUS! My eyes oogled that platter wondering where to start. The weird tiny shrimps were not exactly what I was expecting. I might try a different type of enchilada next time. \n\nGo hungry. Leave full. It's great.", "author": "Faye P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "They have such delicious food! I love their papusa and plate selections.", "author": "Wine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "PAPUSAS and SOPA DE CAMARONES are so yummy!  The papusas are fresh and you can see the ladies making them in the back and guess what...it cost only $1.75 to $2.00.   Mainly, I come here to get my fixing of the hot shrimp soup...healthy and very filling.", "author": "Laureen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "This is a good find! Very reasonable and the kitchen is open so you can see them prepare the food.  They seem to be pretty proper.  The food was very good - and not just the pupusas.  We had some grilled shrimp, el salvadorean tamales, and a fried item with meat inside.  Also, shrimp enchiladas.  I'm definitely going back.", "author": "Lana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "This place was awesome.  I got their chicken plate (don't remember which), but it was just a large platter of goodness!  All the food was prepared and seasoned perfectly w/veggie, salad sides and enough food to fill me 3X over!  The hubby also loves their papusas, which he used to order for breakfast when he worked around the area.  I'm not a big fan of papusa, but it does taste quite good w/their vinaigrette coleslaw.  Overall great experience and service was very friendly and informative.", "author": "Julie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "This was the first time I've had Salvadorean pupusas and they were dee-lishous!!!  I had the pork and cheese ones - so warm and oozy and perfect with the bright curtido and salsa.  I also ordered a chicken enchilada and my friend ordered some meat dish, but the pupusas were definitely the stars of the meal.  The place is small and minimal, but inviting enough and comfortable.  The service was friendly and I didn't notice the slow speed that people mentioned in other reviews.  Will definitely go back, especially at the extremely affordable prices!  Thanks Mr. Pollo for being packed that night, otherwise we might not have ever walked into this place.", "author": "Vicente G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-26", "description": "This is a good example of SFGate/Yelping symbiosis.  I saw La Santaneca on the \"Bargain Bites\" section of SFGate.com but had to confirm with my fellow Yelpers for the low down.  And they were right, the place is good (Yelp) and cheap (SFGate).  \n\nThey have a good variety of papusas which I don't need to go into too much detail (see Pa P's review).  Their plantain appetizer and some kind of pork appetizer with yuca plant was well worth it.  Service was \"slow\", but only because they didn't shove the check in our faces at the end of the meal.  So I'm not one to complain...in fact I appreciated it!  \n\nI'm definitely coming back.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-18", "description": "LA SANTANECA that just sounds badass. Anyways this place is a pretty good spot to get some pupusas! I've been eating them since I was a kid (partly from being Salvadorean-American) and also because their yummy. I haven't tried this location until recently and was satisfied with their pupusas and service. The man took my order quickly and I got my food FAST like 10 minutes DONE. I ordered 2 revueltas and they were pretty fantastic, stuffed with cheese and pork just like i like it! Pork was a little salty but nothing to be over powered by. The awesome thing about pupusas is that their cheap and they get you full so their always welcomed in my diet! Definitely give it a try if your in the area!", "author": "Julio S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "I came to eat here for the first time. I have to say the pupusas are yummy. I ordered the rice kind instead of corn.  They had a lot of cheese and the curtido was mmmm good. The only issue I had was it gets packed and finding  a seat can be a bit of wait at times. Over all the pupusas are very tasty.", "author": "Eli R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-24", "description": "I used to come to this place when I lived on Dolores Street and was hungover (the Sopa de Res is a perfect cure) and went there last night with a group of gals- most of whom were Latina.  I had wondered how it would be under the new ownership- they had completely re-done the place which sorely needed it.  And the food? A-mazing.  It is well documented here how wonderful the papusas are, and they did not disappoint.  I also tried the shrimp enchiladas- I have to say I have never had a better enchilada in my life- this truly melted in your mouth and had so much flavor!  The wait staff was great- they put up with a lot- we were catching up and were there for more than 2 hours, but they accomodated us.  The owner Jose was on hand making sure everything in the dining room went smoothly.  Also one of the cleanest restrooms in SF- definitely a plus!\n\nI CANNOT wait to go back!", "author": "Trisha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "In a word, good. Hook yourself up with a couple pupusas to go with rice and beans, reveling momentarily in the pleasures of an approximately seven-dollar bill. Now, for when you get home and open it up to feast, protip: the little baglet they put the salsa in is meant to be cut open carefully over a bowl or some other receptacle. Unless the object, of course, of your exertions is to coat all your napkins with salsa for some bizarre future use that you should just keep to yourself, thank you very much.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-06", "description": "For the life of me, I couldn't remember the name of this place.\n\nSearching pupusa in Yelp, didn't find it either.  Almost tricked myself\ninto thinking it was Las Palmas, but La Santaneca.....  it's one of those names, when you hear it, you remember it.  \n\nI had no idea there were other places in S.F. to find a pupusa, but pupusa's at La Santaneca are AMAZING.  It's a crime that they are so cheap, as I would willingly pay much much more.  Now if they could find away to package them like frozen pizza...  cause driving across town, finding a parking spot in the Mission, although worth it, could be construed as borderline obsessive.  But if you don't know what I'm talking about, you've definitely never had a pupusa from La Santaneca!", "author": "L. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "Cheese and beans pupusas.\n\nThat's all I eat here.\n\nThis was my first experience with pupusas, and still is my favorite pupusas place. \n\nThe place is clean and people here are nice too.", "author": "Wakaknee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "Pretty good. The pupusas are well priced at $1.75 each. They arent quite as soft as some Ive had in LA, but still very tasty. The place also has a nice atmosphere, unlike some of the downright frightening LA spots.", "author": "Kim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-21", "description": "Love this place! \n\nGreat salsa, pupusas, horchata. Cheap, too.", "author": "J K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "I really wanted to give this place a high rating but the chicken was very salty, it was horrible. But I'm a big supporter of the smaller shops so I'll be back again, the staff can't really speak English but they were very nice.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "Recommend this great dish of eggs, fried plantains, rice & beans, sour cream, and tortillas. Plus the papusas were excellent.", "author": "Tammy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "La Santaneca serves up SF's best pupusas with a smile. These are essentially like Mexican gorditas but quite a bit thinner. After eating a substantial amount of food, I resolved it was the best thing on the menu. I plan on going back for a stacked plate of them-- piping hot and fragrant. \n\nThe Sopa de Pollo was a perfect weapon against a looming cold but was a bit on the salty side. The fried yucca, plantains, and elote tamales (sweet corn) are certainly worth a try. I didn't care so much for the slaw but everyone seemed to be enjoying it on their pupusas.\n\nI was a bit frustrated that the bill was illegible and wound up being miscalculated by over ten dollars-- but management was apologetic and resolved the matter quickly. \n\nOverall, our experience was positive and we found that even a vegan will have plenty to eat here-- if you don't mind the starch, that is! The waiter welcomed all of our questions despite how busy it was. \nExpect this tiny, clean place to be packed-- but it will be worth your while.", "author": "OKAY O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-15", "description": "My boyfriend and I popped in for take out and ordered an enchilada and a tostada.  Not only did we wait for half an hour for our food, but it was awful!\n\nThe food was so bad, that it prompted me to finally join yelp and express my disdain for this establishment.", "author": "Katharine F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-23", "description": "Tried this place on a recommendation from a co-worker. Dropped by after Carnaval and was pleasantly surprised. I had the Pupusas (of course coming here and not ordering the pupusas is like going to Fentons Ice Creamery and not ordering ice cream!) which were well made and tasty. The pupusas combo plate (two pupusas with beans and rice) is affordably priced at just under $7. The tables were a little dirty, but what else would you expect from a restaurant on 24th and Mission. On the downside, the restaurant is a little small. Large groups should take the steps for extra planning if coming here to eat. Also, be sure to say hello to the cooks if you go the restroom since its located in the back of the kitchen. And don't worry. I was told the dishwasher gives everyone the \"evil eye\" when you walk back there. LOL", "author": "Black K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-09", "description": "I used to eat here 27 years ago and was back and could not resist going TWICE during my vacation. I love the Mission District and this is the all out best for pupusas. The wait staff is pleasant and efficient and there is no way I will miss this joint EVERY time I am in Frisco!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "The pupusas were authentic and delicious.  Great deal.  The side of slaw is much better than can be gotten at similar restaurants.  Fried plantains were the perfect accompaniment.  Restaurant is clean and efficient.  Only drawback is there is no beer.", "author": "p w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "Still the best pupusas in town (sorry Balompie, it's da truth), though they take way long to make - order in advance if you can!", "author": "Ara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-22", "description": "I've been coming here for years, and they have the best pupusas ever, i like them more than the one is El Salvador. All there food is of da hook. I try to come here every time I'm in the city. All in all this place is the best.", "author": "Moises M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-14", "description": "I've been coming to this place for years now, and today I decided to go out of the norm, and tried something other than pupusas. I tried the pan con pavo, which is a very delicious Salvadorean sandwich made with turkey in a sort of mole sauce, with mayonnaise, tomato, cucumber, watercress and pickled veggies on top. My sandwich at La santaneca was ok tasting but it lacked the authentic flavor of the original version. It didn't even have mayo on it, and instead of the pickled veggies, it just had lettuce on top. The pupusas are in my opinion good here, very close to the ones at home. Side dishes are pretty blah, not much to rave about. I also ordered an atol de elote and it did not have the usual corn kernels in it, so I was a bit disappointed. the flavor was OK, enough to quiet my craving for it. I am Salvadorean and I know my flavors pretty well, having lived there for many years. I have yet to find a Salvadorean place that truly conveys those flavors, and find it sad that these places claim to be \"authentic\". Over all an ok experience, but will not be taking bart into the city for it any time soon.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-09", "description": "Just so you know, the enchiladas de cangrejo do NOT use real cangrejo (crab), (they only use the pink fake stuff)  I ordered the enchiladas for lunch and they are really cheesy (a point for cheese lovers), but I don't really like my enchiladas that cheesy, the order also came with salad, rice and a side of refried beans, I should have gone to El Farolito instead, but I walked by and Mr. Pollo wasn't open for lunch yet, so I thought I would try La Santaneca, maybe the pupusas are better.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-18", "description": "Amazing pupusa with perfectly seasoned curtido. I prefer the pork only (chicharron). This place really REALLY heats up when it's warm in SF, you feel like you're on the streets of El Salvador.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "I've been here three times and twice i've had some of the best fried ripe plantains I've every had, really 5+ star material.  One time they were only good,  not superb.  The pupusas are my favorites in the city, tasty, not greasy.  Excellent Salvadorean food, and so convenient to the 24th street BART stop.", "author": "Dan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "I L-O-V-E this place!!! I especially love getting their breakfast here! Being Salvadorian myself and living away from home and away from San Francisco, I always crave some delicious PUPUSAS and my traditional Salvadorian homemade breakfast...at La Santaneca I gotta get it all: platanos, casamiento (rice mixed with beans), huevos w/salsa (eggs), crema (sour creme), pupusas, curtido and horchata! :) I have tried several pupuserias and by far...this place has definitely impressed me! Their pupusas are stuffed just right and the cheese just melts right out! yuummmmm!!!!! I always leave satisfied and the service is great! Everyone there is so nice and welcoming!! I live in San Jose and I always crave their food...I never mind making a drive out there for some of their pupusas...it's that good that it's well worth the commute! :) I have fallen in love...", "author": "Claudia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "so my girlfriend and i happened in on this place while walking down mission on a saturday afternoon.  we weren't sure what to expect, but I was extremely impressed. \n\nwhy 4 stars?\n* delicious food & horchata! (i had enchiladas de camerones)\n* really friendly wait staff\n* really quick service\n* biodegradable to-go boxes\n* the CLEANEST bathrooms i've seen in the mission\n\nnote: there was a big sign that said cash only, so i'm not sure why there are 4 votes for \"accepts credit cards.\"", "author": "sam h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "LOVE THIS PLACE - the BEST PUPUSAS IN TOWN!!! Great service & great prices....it's a cozy, clean restaurant and the service can be a tad slow but they cook the food fresh and you should really go here to sit down, relax and enjoy your meal and your company. I found this place because I just so happen to have a mother that is Salvadorean and she knows the spots for some good Pupusas :) I def recommend this place...my husband likes the Pupusas and the fish, but didnt really care for the enchiladas...overall this is an awesome place!", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-17", "description": "This is an affordable place to get delicious Central American food. The dishes are not exotic but hearty and simple. Chicken or beef soup, back beans, fried yuca are some of my favorites.", "author": "Sandra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "Best salvadorean breakfast in the city. Platanos con Casamiento Huevos and a little cremita, i'm making myself hungry.\n\nThat said Ive never had their pupusas but they looked tasty, but pupusas arent the reason I come here, next time youre in line at Boogaloos or St Francis keep this place in mind. You wont leave dissapointed.", "author": "Arnold S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-19", "description": "My family and I have been coming here for the last 13 years or so. I hadn't been back here myself in a few years though. I noticed the restaurant has been remodeled. It has recessed lighting and new tables, looks cute. We never fail to find a good place to eat in the city, La Santaneca is an all time favorite. My favorite dishes here are the pupusas revueltas, yucca frita con pescaditos, atole de elote, pasteles de pollo and tamales salvadorenos de pollo. Everything is made to order so it takes a while to get your order but the wait is worth it. True, the wait staff could probably be friendlier but it seems they are understaffed. We went there on a Saturday for lunch and it was super busy, there were two waiters, two cooks and one dishwasher. The owner popped in for an hour or so and left. They had to tend to sit-in customers and take-out orders. They were going crazy!  I still give it five stars for great food!", "author": "Morena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "The pupusas are really good and only $1.75 each, the citrusy cold drink is excellent and refreshing, but it's the fantastic chicken with mushrooms FTW!", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "This place is SO GOOD! Their pupusas are delicious and cheap plus they come with a spicy salsita and that delicious vinegary coleslaw, and the rest of their food is quality as well. The servers and everybody who works are really nice too. For dessert try some Salvadorean special treats, as well as their hot chocolate.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-23", "description": "I love these pupusas.  I live a block away and I can't believe it took me so long to discover them. The first time we ordered the bean and cheese and accidentally got the everything pupusa- what a wonderful mistake- delicious! I have since had the bean and cheese too yummmm- I cna't wait to try all of them. Plus they are super cheap $1.65/pupusa. Two pupusas and some pickled cabbage is plenty to fill you up for dinner. Also the place has a great ambience and the people who run it/work there are really nice and friendly.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "So. good. I have been searching high and low for decent pupusas and I have finally found them: La Santaneca de la Mission has the most perfect pupusas I have ever known.\n\nAlso good: fried yucca, anything with platanos, and the breakfast calamientos plate... Stick with the Salvadorean fare here--you can get good Mexican food anywhere in the city but Salvadorean is harder to come by and this is where you get it!\n\nOH! And the horchata here is amazing, obviously freshly made (unlike some places where they use a powder mix). Mmmmm.\n\nI really like the place aesthetically, too. It doesn't have that fluorescent lighting that so many of the fast-food Mexican places in the Mission have. It's dimmer and so much more appealing. It's very clean, and it has sit-down service. The waiters are really really sweet. Also very fast! We got our food maybe 10 minutes (if that) after ordering.\n\nNB: CASH ONLY.", "author": "Eva G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-08", "description": "We went with 4 people, had pupusas and a burrito and a steak and salad and...I forget what else.They were super friendly and the food was good. The bathroom was clean, the place seemed well tended.", "author": "jen n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-03", "description": "Great place for pupusas.  The other reviews have a good description of them.  Two quite large pupusas plus rice and beans is $5.50. That's a deal.  Used to go to Balompie for my cravings, but this is a great option.\nThe empanada is fantastic.  Mashed sweet plantain filled with a huge amount of \"milk\" - basically milk pudding oozy yummy goodness mmmmmmm.  And it's fried.  If you like fried plantains, try this sometime.\nThe tamal de pollo was really good, too.  Very moist and steamy, and not at all bready.  There was some shredded chicken, potato (maybe yucca) strips, a few chickpeas and pepper.  It's not stuffed full of meat, but the masa was so flavorful and moist that I was glad to have more it that.  Fairly large.\nYou'll need to walk it off, but it tastes great.\nNo alcohol - not sure if that will change.", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-03", "description": "Yummy.  The pupusas are so delicious and filling, and I like their spicy cabbage on the side.  The platanos are kind of overpriced for what you get, and boy are they greasy...not to say that's bad.\n\nIt's a very good deal for what you get.  Be warned that they close pretty early in the evenings, so don't just show up at 8:30 as you'll probably be out of luck.", "author": "Frank S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "I've been coming to this place for the pupusas since I was a little kid.  The pupusas are delish, cheap, and conveniently located across the BART station.", "author": "Rowzbud R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "i died and went to papusa heaven.  so conveniently located close to BART.  so yummy.  so tasty.  i love the way the cheese squirts out the sides on the grill so you get these chewy crusty bites of yummy fried cheese.  slow service (i believe this to be the hallmark of any good pupusaria) but who cares?  you need the time to build up the anticipation of the pupusa goodness to come.  plus, you don't want to be rushed anywhere after pupusa consumption.  it isn't good for the digestion.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-30", "description": "forget el zocalo, this place is the Shitznitz! i got all my friends hooked on it...hahaha! this is totally the best place for pupusas in SF!", "author": "Carolina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "So don't tell the bf this..but i'm conceding that la santaneca makes the best pupusas in SF. It's such a cute little place, the people are nice, and everything is good. My faves: pupusas, fried plantains (I hate bananas...like deathly hate bananas...and love love love these plantains), their prawn sopa: all good. Even their beans are above average deliciousness (much to the bf's chagrin). I came here 3 days this week and still want to go back tomorrow!!!! Oh how do I love thee pupusas!", "author": "Emily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-12", "description": "Nice hole in the wall, great service for a small restaurant. The pupusas were amazing with the melted cheese and beans. The platanos, so delicious, I ate everything on my plate. I'll definitely go back.", "author": "Lulabelle W."}
