{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "This place is delicious.  Super delicious.  \n\nI have never actually been there as it's smack in the middle of the Tenderloin and only open on weekdays at times I should be working.  However, thanks to the occasional work from home day I'll order delivery and then stuff this in my face.\n\nBut here's the thing y'all....the bread is magic.\n\nI'm one of those people everyone looks suspiciously at because I struggle with gluten.  Yes, gluten makes me fat...but....that wasn't really a deterrent before, so I kept eating it.  Some things are worth being fat for, y'all.  But then I realized gluten made me suuuper lethargic and depressed for no reason.  Damn it.  Okay, gluten, I'll limit my intake because while I'm okay being fat I am not okay being depressed for no reason.  I guess I like my mental health more than flour; and I love flour. \n And then...I started throwing up from it.  Okay.  I see how it is gluten.  I will admit...I will Russian Roulette it for a delicious cheeseburger, but I'm unwilling to vomit for croutons.  You know what I'm saying?\n\nHowever, eating sandwiches from this place doesn't make me fat, lethargic, depressed or (most importantly) doesn't make me sick.  I don't know what kind of magic this is, but I'm into it.\n\nPerspective: I am a person who normally eats bread...once or twice a year.  I am a person who replaced my regular lunch with turkey sandwiches for 2 weeks and gained 20 pounds from JUST that change.  I am also a person who ate one stupid water cracker (okay, it was one of those LONG crackers) and then spend the evening throwing up.  That was not worth it.  Stupid cracker, why would you do me like that?  So the fact that I can eat an entire sandwich is kind of a big deal.  I know that's a sad statement but the truth is sometimes sad.\n\nSo I'm excited.\n\nSandwich Wednesdays are officially now in place.  \n\nI've announced my exciting findings to my entire office.  They are humoring me and are supportive.\n\nI've missed bread, you guys.  It's so delicious.  It's one of my favorite things to eat and it's tragic (first world problems) that I am separated from that which I love so dearly.  Thanks to this magical sandwich place, however, we are reunited.\n\nAnd I don't have to vomit.\n\nHooray!", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "I like this place because their sourdough is nice and chewy plus you can get half sandwiches which is pretty sweet if you're not super hungry. I had the chicken and pesto cream one today and it was pretty solid. The sauce didn't really taste like pesto but it was good. I'll probably try a fair amount of their menu in the comings months.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "An office fave and for many reasons! Delicious sammiches delivered hot to our door. From a meeting of 5 to a meeting of 50 we're always taken care of by Caroline. If you're in the mood for a salad she has those too. Can't beat the service or quality here at Le Petitti's!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "My, my, my my. Sandwich hits me, so hard, makes me say oh my Lord; thank you, for blessing me! I'd like to think by now that I'm an honorary Fieri, and I'd probably be right. A handful of places make me salivate just thinking of them and this place is one of them. In the years I've been coming here, two things are consistent: the food and the people. This little gem is tucked between streets of chaos, but SO worth it's weight in gold rush. Warm, tasty, amazing sourdough and a variety of sandwiches make this place worthy of the board room and break room. The owner and her right hand woman Gloria, are two of the most genuine and coolest people I've met who are kind and just trying to change the world for the better- one sandwich at a time.", "author": "Richard F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "This place rocks. Located near the Tenderloin,  is this hole in the wall sandwich spot you'd miss if you weren't looking. The talk is they have the best sourdough bread in town.  I had to give it a try. The space is small with a few indoor tables and a walk up counter to order. Situated on the back wall is the menu.  I salivated as I read each sandwich item. I hate menus like this because everything looked so good. I ended up ordering #15 Turkey and pastrami sandwich with everything on it because I love everything. Took it to-go as a meal,  with chips and soda.  It was exactly what I'd hope for.  The sourdough was perfect,  crunchy outside and tender inside. The sandwich itself was huge...kinda like a tiny baby.  You will not be disappointed. Come hungry or get half a sandwich.", "author": "Dax P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Solid sandwhich shop. Underrated. That hole in the wall you are always looking for in the city. City employees look no further! Off the corner of golden gate, there's great sourdough bread, simple recipes with high quality taste WITH affordable prices.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "It's easy to miss this spot walking around the Tenderloin.  It luckily caught my eye when my go-to sandwich place was closed.  For around $8, I got a full turkey sandwich with their dijon mustard.\n\nWhat makes Le Pettitt stand out, other than the affordable price, is the sourdough bread.  The crust is crispy, and the bread overall is chewy.  I really like the flavor of sourdough, and the bread is full of it.\n\nLe Petitt is small and welcoming, with a few tables.  The woman behind the counter is very nice and enthusiastic.\n\nIf you want a straightforward, delicious sandwich, Le Petit is the way to go.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "Wow, was this place unexpected.  My coworker told me she was taking me to a sandwich shop and we walked through a Tenderloin street , sketchy, and came to this unassuming sandwich shop.  The staff was prompt friendly and very nice.   I got a basil cream chicken sandwich and the tangy basil cream was outstanding on the sourdough bread. It was so fresh and delicious.  Definitely going back often. This bread was almost like Cuban bread.  Thy for great salads and soups too", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Love this place!\nThe staff are so friendly, they bake their own bread and you can get just about any combination you can imagine. And a half sandwich is really big and great value. Yummy, yummy", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "A fast local deli.\n\nI really like their sourdough bread, it has an addictive thin, crunchy crust. Even though I can eat quite a bit, I find myself ordering the half-sized sandwich here. It's plenty enough food for me.\n\nGreat value, friendly owners, quick and delicious sandwiches. What more can you ask for?", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Probably one of the best sandwiches in the area. As mentioned by most Yelpers, their sourdough bread is freshly made and its darn good. The could add more meat, but that's just me because to someone else the meat portion might be just fantastic. Place is small but clean. Ask for a punch card so whenever you ce in you get your card punched (lol)-ouch! But I think after ten punches on a card u get a free sandwich - see store for detail. But anyway try this if your in the area. It's better than Mortys sandwich across the street. And if they knock just 75 cents off their full size sandwich (around $8.50). They will probably give subway a run for their money. It's definitely better than subway to some degree- since it's more of a mom/pop style deli.", "author": "Nixon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "Artisanal sandwiches served on FRESH, HOUSE-BAKED BREAD in the TL?!?!?\n\nIn the heart of the TL, home to the crazies, the druggies, and the trannies, lies a non-descript gem of a sandwich shop. Le Petit's Kitchen has over 30 sandwich combos served on their fresh, house-baked sourdough bread ($3.50 for half, $6.75 for whole). They even roast their own turkey and roast beef. Thanks, Susy C. for this find. \n\nI \"somewhat\" gave up refined carbs (yah, we'll see how long that lasts) so too bad for me that I can't have a taste of Le Petit's Kitchen or is it? They ALSO give you the option to have any sandwich wrapped in lettuce. Whooo Hoooo! Crazy land, here I come... \n\nLast Friday, I passed by Le Petit's Kitchen before heading over to a Dr.'s appointment and ordered the Basil Cream Chicken Lettuce Wrap w/ Avocado. For a mere $4, I got this bad boy which I had no idea how to even begin to eat. The most viable option? FACEPLANT INTO IT! Yeah buddy! http://www.yelp.com/biz_photos/au6IWLg6TlCK7z-QYgTIEA?select=7FO_BqmD7ZyCWXowRrtNMA\nThe freshly crisp iceberg lettuce was nicely filled with tender, seasoned chicken breast generously (but not overwhelmingly) dressed in an herbaceous creamy sauce, ripen tomatoes, and crisp red onion slices. I'm glad I opted to add avocado as it added another layer of creamy decadence. \n\nWith cream all over my face, I was glad they provided extra napkins. The TL ain't sNob Hill so I can wear the lettuce wrap on my head like an overgrown cabbage patch kid and no one would give a sh*t. Or do they? (o_O)\n\nOTHER NOTES:\n*Open Monday to Fridays 9:30 AM - 3 PM\n*Friendly service\n*Free delivery with $15 minimum\n*Catering available\n*Seating for 10\n*1.5 blocks from UC Hastings and 2.5 blocks from the Art Institute \n*CC's accepted", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-26", "description": "How is it that I have been working in this area since 2007 and I haven't tried Le Petit's!??! \nGOODNESS GRACIOUS I HAVE BEEN MISSING OUT!!\n\nMy friend picked me up at hot pastrami sandwich.\n\nOMFG.\n\nMy very first thought after that first bite:\n\nDAMN. This is really good bread. DAMN this pastrami is tasty.  DAM DAM DAM IT'S SO GOOD. \nThen I find out the sourdough bread is made in house. Wow. That's a lot of love. My co-workers took a bite and loved it as well. One of them doesn't even like pastrami but she really liked the pastrami from here. \n\n1/2 of the full sized sandwich is huge. It got me pretty full. I decided to save my other half to eat at the Warriors vs Trailblazers game.\n\nFreaking Oracle Arena security threw away my sandwich.\nI have been lamenting over the loss of that delicious sandwich.\nI am still sad. So sad that I have to go to LePetit myself and grab another hot pastrami.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Incredible sourdough baked fresh for lunch everyday, offering the best sandwich deals in the neighborhood.\n\nThe full sandwiches are huge and typically cost between $7-8, and 1/2 orders actually cost 1/2 the price (and they're still a good size). The staff is always friendly and helpful, and I've never waited more than 3 minutes for my food even during the noon rush. This is a great place to grab lunch to go, or for 2-3 people to sit together.", "author": "Luke F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "Le Petitt's Kitchen is one of the Tenderloin's many hidden gems.\n\nFor those of you who are not familiar with the Tenderloin, it has a reputation for being one of San Francisco's seediest neighborhoods so if dirty sidewalks, smelly homeless people, crazy crackheads and tranny hookers make you feel uncomfortable, I would not suggest you go out of your way to get a sandwich there. I lived in the Loin for a couple years when I first moved to SF back in 2003 so the derelict don't really phase me anymore. I currently work in the Tenderloin and am always on the lookout for lunch spots in the area that are inexpensive yet delicious, fast and somewhat nutritious, and Le Petitt's Kitchen satisfies all of those requirements.\n\nLe Petitt's Kitchen offers a vast selection of yummy sandwiches; all served on fresh-baked housemade sourdough bread. They also have light rye, dark rye and wheat (and lettuce wraps) available for those of you who are not fans of sourdough. Most sandwiches include cheese, lettuce, tomato, red onion, mayo and mustard, and a pickle spear on the side. \n\nHalf sandwiches are only $3.75 and are big enough to satisfy the average appetite. I've tried many of their sandwiches and a few of my favorites include their signature Basil Cream Chicken, the Chicken Cordon Bleu, and The Club.\n\nIn addition to sandwiches, Le Petitt's Kitchen also offers a variety of soups, salads, beverages and snacks. The service is fast and friendly. They accept Visa and MasterCard. And as an added bonus, they have frequent buyer punch cards where you can receive a free sandwich of your choice after you buy ten.\n\nhttp://lepetittskitchen.com/", "author": "Dustin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "Yet another sandwich shop to review in the Bay Area. Not complaining, but coming from HI, I've never eaten so much bread and deli meat in my life. Wonder if NYC is worse?\n\nSo I think this place is fairly new. It is located on the \"clean\" side of the TL Golden Gate Ave. They seem to wash the sidewalk on the south side more often. I get their turkey club often, and it is a good sandwich. Not the best, but still real good. Their signature is using freshly baked and warmed sourdough bread. I'm not even sure they have any other types of bread. The full size sandwich is huge, and can be easily split by two normal adults. But I don't learn as I try to finish the entire sandwich myself. \n\nThey do have a lot of options, and I've yet to try most of the board. But those that I have tried are decent. Again not the best. Their pluses are good bread, familiar sandwiches, good value, and a nice .", "author": "Kris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Best. Sourdough. Ever.\n\nReasons to come here? See above. If that is not enough reason for you, see below.\n\nPROs:\n+ Best. Sourdough. Ever.\n+ Great service.\n+ Reasonable prices.\n+ Always fresh.\n+ More selections than you can shake a stick at.\n\nCONs:\n- In the middle of the Tenderloin.\n- In the middle of the Tenderloin^2.\n\nThose are really the only cons. I used to come here daily when I worked on the ambulance in San Francisco before moving to NYC. I just got back from a vacation in SF with Miss Sarit and had to take her here for a taste of TRUE San Francisco sourdough (not the touristy crap on Pier 39).  After years of absence, the staff still remembered me. Where else can you get that?\n\nHonestly, do yourself a favor and come here. Either walk, take a cab or the Muni which are all very convenient from major city access points. Just get here.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Tried this place for the first time last week and I was definitely not disappointed. If you order the \"half-sandwich\" option, don't worry. They definitely give you more than half, which is always a fun little win.\n\nBottom line: try the \"North Beach,\" which is roast turkey and Italian dry salami with swiss cheese on their amazing sourdough bread.", "author": "Gabriela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "Okay, so yesterday I went here again, and I asked them what their hours are.  They're open 9am - 3pm.  \n\nI also asked them to update their sign (it says 8:30am - 3:30pm), hopefully that happens soon.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "I came in to Le Petitt's every day I was in SF, the sourdough, prices and service were soo good.\n\nThe nice ladies who staff this lunch place are quick and friendly (they really enjoyed helping me practice my spanish). Even with a line, I was in and out in under 7 mins. They have several specials, but I recommend the 1/2 sando (full size to me-6 inches+), chips and soda for like $8. \n\nThe bread is crisp, tart, fully baked and soft on the inside, classic SF! I liked the quality of their turkey meat, but they ran out of avocado a bit too much for my liking. The chips were always fresh, soda fountain just right and the mint/pickle extra's were just great additions to the meal.\n\nStop on by Le Petitt's Kitchen for a really great, well-priced lunch in the civic center area ASAP.", "author": "Jim A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "Cheap decent sandwich on really tasty house baked bread. I recommend getting a half as a whole is always too much for me to finish.", "author": "Cole G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "I love it here!! Excellent service and really nice people!! I had the # 11 cheese sandwich and it was terrific!  Not too cheesy! Great service too and my boyfriend adds great coffee!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "I was like \"OMFG... don't shoot ! \", for my 1st time when I found a parking near by.\nWhat a sketchy location! This is not good for dating.\nGolden Gate Avenue between Leavenworth & Hyde Street is another very filthy street in San Francisco. Oh hell yes, you have to be an alert mood, orange level, at least yellow.\n\n78% you'll see on the Street is that old Black people who has almost no teeth, baseball cap, speak out loud, they call themselves the N word to each other, look like looking for drugs. Yeah, ...  you might have a chance to get mugged, or shot even. (I think that's why the place opens day time only.)\n\nBut, sometimes you have to take chances. \n\nBecause this is a Great Hole In the Wall Sandwich Shop that worth taking the chance!\n\n+ Fresh Baked Sourdough.\n+ Fresh meat.\n+ Big size.\n+ Great service.\n+ Reasonable prices.\n\n5 star Sandwich Shop!\nA Great Hole In the Wall Sandwich Shop.\nI'm lovin' it.\nI am coming here for a few times already.\nBut, Hey, I still do NOT look like an Asian who is looking for drugs, yet, I still have teeth and don't even ware a baseball cap. I was looking for a good sandwich and I found it.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Love this place! One of my favorite lunch spots. I wasnt a Sourdough fan, but the fresh warm bread from this place will make you one. 1/2 a sandwich is definitely the way to go. Salads are good too for the price. Especially for salads in SF. \nOh! and the staff there is pretty cool too! Really sweet ladies always have a smile on their face.", "author": "Diana F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "Their sourdough bread is killer. Stopped in here while working on the building next door. Definitely a good choice. I had the Turkey Club. Only thing that was not so great. Was the lady at the register, she wouldn't upgrade my meal after I realized it was only 20 cents more for a soup and salad. :(", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "Me: \"I have a confession to make.... and please don't judge me.... but I've never actually been to Le Petit's....\" \nHoney Badger Steph: \"YOU HAVEN'T!?!? HOW IS THAT POSSIBLE???\"\nMe: \"I SAID DON'T JUDGE ME! I'm a SHAM! A FRAUD! And I write the food column, for F's sake.\"\n... Honey Badger Steph and I went to Le Petit about an hour after that conversation.\n\n I got a half turkey with spicy mustard and took it the ONE BLOCK back to school. Their sourdough is the best homemade bread I've had in a long time - certainly in that hood its the best PERIOD. I loved it. And they give you a pickle and an andes mint! AND they take card! She happily took my card for a $3.50 charge! Needless to say, I'm going back today, and tomorrow, and several times next week.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-27", "description": "Le Petit's Kitchen offers a wide variety of sandwiches.  You can always count on fresh sourdough bread and a warm greeting from behind the counter.  They also place a piece of chocolate in your bag of food.  It's a very nice personal touch.\n\nThe only reason why I give Le Petit's Kitchen a three-star rating is that there is not enough meat in the sandwiches!!  If they put a little more meat in them, then I would give them a four-star rating.\n\nThat's the only knock on Le Petit's Kitchen.  All in all, a decent lunch option in a not so decent neighborhood.", "author": "Harvey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "The sandwiches are pretty tasty. It's still SF corner store style, so don't except a genuine Reuben or something, but tasty nonetheless with a good amount of meat. I'm partial to the meatball and basil cream chicken, but that's because...\n\n...the bread, as others have commented, is amazing. It's not standard \"hard\" sourdough, but I find their somewhat softer and a bit doughier fresh made version far better for actual sandwiches. Plus, the prices are pretty low given the amount of sandwich you get--and a half sandwich (which is a good lunch size) costs, get this, half the price of a full sandwich. Free delivery too? Yep.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "An extra star for delivering the rare \"WTF?\" Tenderloin experience that DIDN'T involve feeling violated or in need of a shower.\n\nI'm talking about you, Rueben.\n\nWhere to begin?\nIf your idea of a Rueben involves tender rye bread, sliced corned beef, sauerkraut, and Swiss cheese... served up ice cold along with a heaping helping of shredded lettuce, a life-altering portion of red onions, some sliced tomatoes and plenty of mayo, well... where in the heck did you grow up?\nOne imagines Arnold Rueben is turning over in his grave.\nIt's a perfectly acceptable corned beef sandwich, but it ain't no Rueben.\nBuy hey, it's $3.75 for a half and $7.35 for a whole, so it'll do.\n\nOtherwise, the scuttlebutt is right on: the sourdough is fresh - and yes, a little doughy and par-baked-ish, but it doesn't destroy the roof of your mouth, so I'm down with it - and the ladies who run the joint could not be nicer.\nEvery time I order a sandwich I realize I don't really like sandwiches, so although I had perfectly reasonable encounters with the salami and the roast beef, I now order the Cobb salad. \nThe lettuce flows free at Le Petitt's and the salads are no exception. Topped with a generous portion of grilled chicken, you can also expect some cucumbers, tomatoes, blue cheese, hard-boiled egg and smidge of bacon to make it to the party. There isn't so much as a slice of avocado to be found, but they do include  more of that much-lauded sourdough bread on the side.\n\nAt $7.75 for a large, it's easily enough for two people.\n\nPlus, if you're a woman (or maybe even man?) of reasonable attractiveness, prepare to feel like a supermodel. The folks on the streets outside are dying to sing your (beer and god-knows-what-else goggles enhanced) praises: bad hair day, baggy sweatshirt, zero makeup and all.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-07", "description": "Yum!  Apparently there's a place in Marin exactly like this because of something like... an owner letting someone else buy the menu / idea to open one there... anyway, it's great!\n\nThe selection of sandwiches they have there is amazing from what I could tell, though I've only tried one.  I don't think the sandwiches are more than 10 dollars.  I got half of a toasted sandwich + pickle for about $3.50 I believe, which filled me up.  I think the portion was the ideal amount to eat without being overindulgent.\n\nThe sandwich wasn't too soggy or too dry, it was toasted to perfection, fresh, and just perfect for me.  I think some other reviewers had expected more meat, which was not a huge issue for me.  I actually don't like it when there is too much meat from the sandwich because it doesn't balance out the taste of anything else.\n\nOther stuff... service was fast / friendly, even though I was taking foreverrr since I wasn't sure if I had to order first and then pay, or order at the register, etc.  I wouldn't really choose to eat in here, but rather, go out in front of City Hall and eat here or something :)  Location is not my fav.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Inexpensive food. Nice sour dough bread but it's the only bread. Reuben sandwich is not good. Others look good. Meat was stacked not folded. Overall would try again", "author": "Silver T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "Lunch under five dollars? check.\nSandwiches made to order, so I don't have tomato slime on my bread?  check.\nQuick, friendly service?  check and check.\nMany options both hot and cold? yes, and they are delicious.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "I looked up \"sandwich\" on yelp one day for lunch during my internship. This popped up so I thought I'd give it a try. I'm guessing the Tenderloin is the ghetto? Admittedly I don't know my way around the area that well. I went around 1:00pm on a Thursday. There were maybe 3 other people waiting for their sandwiches when I got there...I missed the lunch rush! I ordered from a lady behind the counter, paid at the cash register, and then waited for my sandwich. Maybe 3 minutes later and my sandwich was ready! The first thing I noticed was that the sandwich was huge, it was like two sandwiches disguised as one! I got a regular turkey sandwich and it was delish. It even came with a pickle!", "author": "Mary K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Lots of variety on their menu, the sourdough bread is baked fresh in their kitchen and tastes really good when eaten fresh. The sandwiches are rather large and filling, half is plenty. Staff is very friendly and welcoming.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "Great place and for the price you really can't beat it!  I had half of a BLT and it was very tasty the bread is amazing. After reading some reviews I would stay away from the soup... this place is more like a deli and fits the area perfectly. Again for the price it is a must.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-24", "description": "Customer service is terrible at this location! I placed a hefty order for my work through eat 24 for delivery. The delivery was prompt but my order was incomplete. I called back to this company and they advised me they would deliver me a new sandwich that they messed up. Later they called back and spoke with a colleague and said they couldn't get someone to deliver so they would refund my money. It's been over a week with no refund. I called in again and they told me I had to contact eat 24 for a refund, which I was never told this in the beginning. Overall this place doesn't have their stuff together and the manager is extremely rude and has horrible customer service and argued with me about my order and just kept demanding I call eat 24 even tho THEY messed up my order and THEY got paid.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "I finally tried the Basil Cream Chicken sourdough sandwich after reading all the positive reviews. Just one bite and I entered sourdough heaven. \n\nThe texture of the bread was impeccable- a crispy outer layer enveloping a chewy inside. The creamy basil sauce and tender chicken breast complimented the sourdough perfectly. At $6.75, the size of the sandwich was generous enough for two meals. Reviewing food always becomes a balancing test between taste and value; Le Petit is a winner. \n\nLast but not least, the ladies who work there, as other have described, greeted customers with wonderful service. I highly recommend this place as a quick breakfast or lunch spot. There are few tables inside and the hours are short (M-F 8:30 - 3pm).", "author": "Shan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Reasonable price, clean, friendly. A staple of the workforce in this area. Never tried the soups or salads, but the bread is worth a trip alone.", "author": "e c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-09", "description": "I had not been to this place in years. Last week, a friend  brought me a vegetarian sandwich from here. Gotta say, their vegetarian option has not improved--it was worse. Seriously, if you are vegetarian, go to Morty's across the street.", "author": "Wan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Really like this place for lunch, not a regular fan of Sourdough but their bread is amazing. Great combination to their Turkey Club, one of the best in the bay. Fresh ingredients and reasonable pricing, ~$10 for a sandwich and drink. Like others are saying, the only downside is that it's right smack in the middle of the tenderloin. If you can stomach the walk this place is a hidden gem.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Le Petitt's is affordable, friendly, convenient, and so good. Great little spot! I come here pretty frequently so their friendly and patient staff probably know my order by now: #4 sandwich (roast beef, ham, turkey, swiss cheese, and iceberg lettuce), no mayo, mustard or pickle. You also get an andes chocolate mint, yummy! The bread is great, the customer service is superb, and the facility is cleaner than most in the area. Prices are also very reasonable. I'll be back again and again for their affordable and crispy sourdough sandwiches and next time I will try the #20 North Beach with turkey and dry salami.", "author": "Rodney T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-16", "description": "So disappointed! I did a delivery with this place through Eat24. They made me wait an hour until they told me they couldn't deliver my food.", "author": "Erinne S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-02", "description": "Excellent for the price you pay.  If you're looking for a decent meal on a budget, this is your go.  Enormous portions too.", "author": "Max P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "The sourdough on its own is enough of a reason to pick this deli over any other in the neighborhood. Morty who???????? Don't waste your time anywhere else. Quality, fresh ingredients, great prices, super friendly staff, and did I mention the bread? Every single time I'm in the TL, I gotta go see Gloria and her crew. TRY this spot if you're in the neighborhood, you will not be disappointed", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Love the flavor of the sourdough bread and the spicy mustard they use on all of their sandwiches. As a loyal, repeat customer I've tried most of the sandwiches on the board and they're all solid if not spectacular.", "author": "Brian E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "Scew Mortys! LPK owns! Sourdough bread is so good. Really. I am speechless. Best sandwich I have had all year! It is so unassuming, I would have NEVER imagined the sandwiches could be this delicious. Huge selection, clean quick affordable and you can even do a half a sandwich! This place is just an all around winner. Can not believe it has been under my radar the past 3 years of slumming it over here at work. Super filling, super amazing in your mouth.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Ohh the joy of fresh baked sour dough bread.  Le Petite is a hole in the wall, but the sandwiches are amazing and keep me coming back time and time again.", "author": "Nathan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-06", "description": "Down in the TL, this little shop is banging out big sandwiches with good reviews.  Since I was in the neighborhood (not for crack), I decided to give it a try.  A big, big menu has tons of choices but I stuck to my default, salami on sourdough.  \nThe sandwich was big and hefty.  I also ordered a side cole slaw and Martinelli's sparking cider to go.  The sandwich was good but not exceptional.  I mean not enough for me to go back specifically for it.  Unfortunately, it's a great food held back by the neighborhood.  This place seems more like a call-in place for all the local office workers.  Street parking is tough.", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "The hot pastrami, grill fish and the sourdough sandwiches are delicious. This is one of my favorite spot for lunch. The customer service is excellent. Get the 10th sandwich free when you get the card.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "One of the departments at work uses them for catering so I thought I'd check them out. The half sandwich is filling and the price is great. While I liked what was inside the sandwiches, I liked the sourdough bread even more, very delicious and they bake it themselves. This place is a great lunch option, although tiny, you can order your sandwich to go.", "author": "a f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-30", "description": "An enormous waste of money.   Ordered a chicken parmesan sandwich, caesar salad and clam chowder.   Yuck, yuck, and yuck.   It tasted like chicken flavored bread, the salad had inedible croutons, and the chowder was... well unrecognizable.  This kitchen certainly is small... on taste.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "In an area that has at least 15 options for a decent lunch within a three block radius, this may be the only place where someone could fill themselves up with something fresh for under five bucks. Half orders are plentiful and its nice to find a place that serves an actual salad for under the five mark.\n\nThe stars though, are the sandwiches. With over thirty options, its easy to find the board overwhelming/ confusing. No worries. Peruse the options and don't forget to look towards the bottom right hand side to know the garnishment and condiment choices. The sourdough is a feature here and is apparently made fresh daily. The bread is not the traditional glossy, crunchy sourdough that San Francisco is famous for but it is a nice, chewy consistency that doesn't grow super soggy throughout lunch. I believe nearly all of the menu is under the seven dollar mark for single items. \n\nCustomer service is obviously a priority here. Accuracy in order taking is crucial and whether you are ordering at the counter or calling in your meal, it seems important to the staff that they repeat your order to ensure the details are noted. Punch cards for free sandwiches and their recent summer sale are also nice touches to ensure customer loyalty. Simple atmosphere reminiscent of the quiet sandwich shop in a small town I once lived in. Easy to forget your in the Tenderloin until you step outside. Recommended for a basic lunch.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-21", "description": "Wait.. what... I'm so lost here. Why is this place rated so high??? Why does it have a dedicated cult following and frequent comparisons to Morty's? Aside from being a deli in the ghetto of the 'loin, I see no comparison.\n\nI got the soup and sandwich combo. Soup- their only choice for the day, chicken noodle. Pretty salty with limp noodles and microscopic chicken and veggies. Disappointing, but I didn't mind too much as I came here for the supposedly delicious sandwiches. \n\nSandwich- everyone here raves about the creamy basil chicken, so I gave it a go. My sandwich was sourdough, but it didn't taste like the tangy, crunchy sourdough I know and love. It could have used more tanginess. It was also a little soggy on the inside, like it hadn't been cooked all the way through. Why the creamy basil chicken was named thus was a mystery to me. It was neither creamy nor basil-y. Instead, it seemed to be chicken breast sprinkled with a dried herb mix. The veggies that came with the sandwich seemed like coleslaw minus the dressing. The best part of the meal was the pickle and Andes mint. \n\nOnly reason why I'm giving 2 stars rather than 1 is their excellent service. The ladies there are really nice and very efficient.\n\nI'm losing faith in Yelp. There are countless times when I've gone to a restaurant because of great Yelp reviews, and Yelp completely lets me down.", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "On a day that is hotter than a Thai massage, I pondered the options for lunch from the cool air-conditioned sanctuary of my office.  I was suddenly reminded that this place is having the end of summer sale where sandwiches are $5.  \n\n\"Wow.\"  I thought.  \"I better go capitalize on that deal.\"  \n\nBecause I would spend a dollar to save a quarter.  So little common sense.  Yet so much willpower.  What am I talking about?  Obviously, I have lost my mind in this Arabian heat.\n\nI walk, over bums and crazies, next to the stench of urine and desperation-soaked pavement, until I came upon a scaffolding.  This small dark hot and sweaty space is recessed into the building.  It was not unlike a hobbit hole.  The line was long.  Some guy saw the line and headed across the street without missing a beat.  \n\nThe menu is extensive.  But it all features swiss cheese.  Well.  Trey likes the #4, Katie likes the turkey.  But I saw the pastrami.  Come hell or high water, I will live and die for pastrami.  (because I didn't see the reuben).\n\nUsually, sandwiches on rolls hurt the roof of my mouth.  Because I'm such a fragile lotus blossom, I stay away from certain hard foods.  That's why I recently have given up Viet sandwiches.  Too many casualties.  \n\nBut here, the roll was soft.  It could almost be considered underbaked.  Parbaked.  But it didn't hurt my mouth, so it was fine as sand by me.  \n\nThe filling was unevenly placed on the sandwich to give the appearance of hefty bulk when sliced down the middle.  That was easily remedied by opening the bread and redistributing the meat.  Everything else was pretty uniform.  \n\nThe pastrami was not blindingly salty.  It was juicy.  The lettuce was crisp and shredded.  The tomatoes gave it sufficient moisture.  Spicy mustard added some subtle kick.  The sandwich was tall, but it should not be compressed lest everything squirts out.  Instead, hold it firmly, and take alternating bites from the top half and the bottom half.  Alright, I'm weird.  But if I open my mouth too wide, my face cracks off.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "I love this place.  \n- Absolutely amazing Tangy Basil Cream Sauce!!!\n- Great sourdough bread\n- Friendly service\n- Good combo deals\n\nMy favorite meal: #24 Chicken Cordon Bleu, SunChips and 2 sides of the Tangy Basil Cream Sauce for dipping.", "author": "jennifer r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "Seriously, my favorite sandwich place.  The price is unreal and half a sandwich is more than enough for lunch.\nthey write down the orders, this is CRUCIAL!  I never get stuff I don't want (mustard YUCK!) and it's all just right.\nThe sourdough bread is perfect.  I have never had it underbaked or raw or whatever.  It's crisp on the outside, tangy, soft and usually warm on the inside.  \nThey offer jack cheese if you don't want Swiss.  I don't want Swiss.\n\nFor my office, LePetit is the go to place.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "I went there for a quick lunch and to try out this place. However, I was disappointed with the food. The vegetarian sandwich was big for the price; however, the bread was not fresh and the vegetables were ok. I will probably try out other sandwich places nearby before trying any other sandwich here.", "author": "Sid P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "I still come to Le Petitt's once or twice a week.  I usually get the vegetarian with cucumbers, carrots, and bell peppers in addition to the standard lettuce, tomato, onions and cheese.  I always add avocado for $.25, and it's always good.\n\nI've also become a fan of the half sandwich.  You can get a half (which is still pretty big), plus potato or macaroni salad, and a cookie for under $6.\n\nOh and I previously said sourdough is the only bread, which isn't true.  They also have wheat, rye, and I think white, but I've yet to try any of them because the sourdough is so damn good.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "My major problem with Le Petit's is that I go through phases where it's like all I eat for lunch. If you're like me and eat it for lunch for a week straight, you might get sick of it. On the other hand, I suppose it's a testament to how good the sandwiches are. \n\nAnyway, don't let my weirdness phase you. They've got some pretty delicious sandwiches here.\n\nAt $3.50 for a fresh tasting half sandwich with delightfully delicious bread, it really is a great option for lunch. Even the full sandwiches are cheaper than some of the nearby sandwich spots. The menu features a wide variety of sandwiches to choose from. I tend to go for the corned beef and the pastrami, but the other sandwiches are also good. There really is something for everyone on the menu, though. \n\nThe people there are also incredibly friendly and you'll get your sandwich pretty quickly.", "author": "Alea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "This is a sourdough sandwich place located in the Tenderloin right behind UC Hastings College of the Law. I come here pretty frequently so their friendly and patient staff probably know my order by now: #4 sandwich (roast beef, ham, turkey, swiss cheese, and iceberg lettuce), no mayo/mustard/pickle. You also get an Andes chocolate mint! I'll admit a $3.50 half sandwich is not enough to satisfy my appetite. But I'm OK with it since I try not to overindulge for lunches anyway. Food coma is horrible. They have a \"buy 10 get 1 free\" punch card special, so ask them for one and start today! I suggest coming here 10-15 minutes before the hour as there are usually lunch rushes right around 12 and 1 PM. Lastly, this place takes credit cards. I'll be back again and again for their affordable and crispy sourdough sandwiches.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "I usually go to Morty's when I'm craving a sandwich but decided to give Le Petit a try.  You can get a HUGE half sandwich for only $3.50, and the service is super friendly.  Don't expect anything fancy or uber special though.  The tuna came with weird little pieces of iceberg lettuce (Subway style...except they gave you less) and two slices of tomato.  The only exceptional part of my sandwich was the sourdough - very tasty and would have been perfect with soup. \n\nOverall, great place to come for lunch if you want to get something quick, fast, and cheap.  Not a place to take someone out to lunch though and if you're looking for something more special, I would go to Mortys.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "Such a wonderful TL sandwich place with great bread, great service, and great prices. The Chicken Salad Sandwich is one of my go-to lunch choices close to work. They fresh bake their bread and all the ingredients are fresh and delicious. Plus every 10 sandwiches you get a free one!", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-04", "description": "This is my favorite sandwich place in San Francisco!  A lot of people say  Morty's is better however I think Le Petit Kitchen trumps Morty's any day.  They are right across from each other so I urge you to try both.  \n\nWhat really makes Le Petit Kitchen the best are 3 things.\n\n1.) The sourdough bread is handmade and delicious!  Not too soft and not too crunchy.  The size of the sandwich is perfect too. I recommend the spicy mustard.   \n\n2.) The service is nice, quick, and they give you a chocolate mint with your sandwich which I think is a nice touch.\n\n3.) They are cheap!  A full meal (sandwich, trips, and drink) will cost you about 4-6 dollars depending on half or whole sandwich.  This is what lunch should cost!  I know Morty's is a little more expensive.", "author": "Lori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "I wish this place was open on weekends... if you are in the TL and looking for an awesome sandwich this is totally the spot. What makes it awesome is the fresh sourdough, the rest of the ingredients are above average. The ladies who run this joint are also incredibly nice!", "author": "yoni s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "Awesome, delicious, big sandwiches.  They feature hot fresh-baked sourdough rolls.  You can get other bread if you wish, but you'd be missing out.  I usually get the #32 Club which comes with plenty of turkey and bacon.\nAt the very peak of the lunch rush the line backs up a bit, but they are pretty efficient and you won't be waiting too long.\nI believe they are only open for lunch, about 11 am to 3 pm.", "author": "T M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "It used to be better when it was known as Michael's Sourdough. But I've been going to this place forever. I've probably tried every sandwich on the menu. The golden gate is one if my favorites. I don't think the bread is actually made there anymore because it doesn't taste the same.  It's a big sandwich, you will be full. Workers are friendly, and you always get a pickle and a chocolate in your bag.  Just make sure you eat the sandwich soon after its made because it will get soggy. My co- workers used to all go to mortys across the street. After I enlightened them on le petits, they all get their sandwiches here now.", "author": "P P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "Man oh man... \n\nIf only my work was around here, wait a minute, I take that back.  I really don't like the Loin but it's ironic how many great restaurants and delis are all here centrally located here.  You got Brendas, Dottie's, Little Saigon Sandwiches and of course Le Petitt's.  This place was discovered a few years ago when the GF took me here.  It was instantly love at first site.  This place definitely brought me back to the days in NYC with their sandwiches.  \n\nI usually stick with the cold cuts and the half sandwich is enough to keep you on your toes for the day.  I like the \"Sourdough aka #4\" that includes roast beef, ham, turkey and swiss.  I think I have enough stamps for the free sandwich by now.  The uptown rivalry across the street, Morty's isn't that great despite the ratings.  If only there was a plan to keep it open on the weekends...\n\nThis place is a must try but don't mind the crazies on the street.  The smell of freshly baked sourdough makes the Loin bearable. =)", "author": "Alexander H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "For a sandwich that's $3.75, it satisfied a hungry college students stomach.", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "You have to approach this place from Hyde to prevent getting stuck with a needle, but once you do, it's worth it.  The bread is fantastic and the prices are great.  Super fast too.", "author": "Arik L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "Great little spot in the tenderloin! The bread is great, the customer service is superb, and the facility is cleaner than most in the area. \n\nPrices are also very reasonable, for $7.50 I got a sandwich, soup, and a mineral water. That would be then price for just the sandwhich at many places.", "author": "Luis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Nom nom nom, so good! Le Petit's is affordable, friendly, convenient, and oh so good. Going to school at UC Hastings, I love that this delightful sandwich place is so close to school that I don't even have to cross any streets to get there after class. Also, it's great to minimize the time I spend walking through the Tenderloin. The staff has always been friendly with me and provides quick service. And they have never messed up my order. I love getting Combo B for $5.50, which comes with half a sandwich (which is plenty for me), chips, and a fountain soft drink. I have tried the basil chicken sandwich that everyone raves about, but found it to just be okay and incredibly messy. My favorite sandwich (so far) is the #20 North Beach with turkey and dry salami. I dream about that sandwich.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "First time in I ordered a ham & pastrami full sized. Had no idea it was so damn big. Sourdough was a good consistency for a sandwich as it didn't rip out the top of your mouth with an iron crust. The works with crisp lettuce, tomatoes, cheese etc made a perfect sandwich. I swore next time 1/2 a sandwich. \nNext time got a 1/2 German salami with everything and a small salad for $6.00. How do you beat that? The sandwich was killer and the salad was really fresh and well assembled with lettuce, croutons, cucumbers, tomato, and Parmesan cheese. The folks are friendly and fast. Do not pass this place by for Subway......", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "I loved coming here for a quick bite to eat in between classes...better prices than other sandwich shops in the area and they accept cards!!!! HATE HATE HATE restaurants that are cash only in the TL! Hello, don't you know I don't carry cash?! We're in the TL where Hastings is perpetually sending emails notifying students of every poor soul getting robbed in the area! sorry for the rant...lol, great bread, prices and customer service! Plus they give you a little chocolate for \"dessert\" =)", "author": "Sonya A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "The sandwich is Le Grande in flavor.\nGreat sour dough bread starts it off.\nThen put your favorites between that.\nI recommend the chicken.\nSolid sandwich, just watch where you are walking, you're in the TL, which is hard not to notice.", "author": "Po L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "Oh man, I love the sandwiches here. It's all about the warm, homemade sourdough bread. As long as you make sure what you are ordering comes on the house sourdough, you'll be happy. I promise.\n\nOh, and did I mention they always give you a pickle and a piece of candy? Yeah, it's that awesome.", "author": "Christi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-19", "description": "\"I can't eat beef. I have a degenerative problem with my intestinal lining and beef really gives me gas.\"  But that hasn't stopped me from ordering their roast beef sandwich.  The meat is slightly pink and its juices soak right through their freshly-baked sourdough bread.  \n\nBad gas is a small price to pay for a bite of heaven.\n\n(I also like the Basil Cream Chicken, the Tuna, and the Turkey Pastrami.)", "author": "Dwigt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "I come here at least once a week.  Everybody is so friendly and the sandwiches are great.  The sourdough is the best bread, but it cuts you up a little bit.  So I always get the dark rye, so they're more like really good airport sandwiches.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "I love Le Petitt's Kitchen! The staff is always extremely friendly and helpful and the sandwiches are amazing. Their fresh baked sourdough is what makes the sandwich and it is always delicious. The lady (I think she's the owner) puts a little piece of chocolate in every order. \n\nLast week they had a sale--$2.50 for any half sandwich, and I went almost every day. :)", "author": "Lindsay W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "Warm fresh sourdough bread makes this place ideal if you are in the Tenderloin looking for a sandwich.\n\nI used to go here all the time when I was in law school.  Mainly because it was close, but also because it was good quality.  When I was first in law school it went by another name.  Mike's Sandwiches?  Or something like that.  Anyway, they changed names and possibly owners, but the menu stayed the same.\n\nThey have a decent variety of options to chose from.  I would generally get the chicken apple sausage.  It was delicious.  They didn't have any fries or hot sides.  It is basically deli style.  They have chips, drinks, etc.  I don't remember if they have any cold sides like potato salad, but they might have.  I never tried them.\n\nThey would be busy at lunch time, but they had pretty much an assembly line process that would allow them to move along pretty quickly.\n\nI believe they used to close fairly early.  Maybe 3 or 4 pm.\n\nA very good lunch sandwich in the Tenderloin.", "author": "Shane N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-30", "description": "Gross...Ordered roasted turkey sandwich and got deli meet. Chicken parmesan sandwich had the sorriest excuse for a piece of chicken with little to no sauce. Clam chowder was bland and tasted old. Who puts cucumbers and tomatoes in a caesar salad?? 2 giant croutons, both hard as a rock and inedible. Would never order again. And p.s...you call that a pickle?", "author": "R W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-21", "description": "Three points to be made here:\n\n1. The bread is delicious, if you can get there when it's still warm then you got it made in the shade.\n\n2. The menu is disturbing identical to Michael's Sourdough sandwich shop in San Rafael. Now, probably no one realizes this because Le Pettit is hidden in obscurity in the T-Loin and Michael's is behind some Uhaul shop in San Rafael. Both places have the same sandwiches down to the names such as North Beach and drawings on the blackboard. I will get to the bottom of this some day.\n\n3. Finally in response to Wan and his one star, if you are eating a sandwich which costs you $3 in the Tenderloin then whatever health benefits you have secured from your Vegan diet are void. In a city where a quarter gets you 6 minutes in a parking meter Le Petitt's is reasonably priced.", "author": "Kenny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "I dig it. Cheap sandwiches. Yummy sourdough bread. I still like Morty's better in terms of flavor, but for price this place certainly has Morty's beat. Also conveniently located next to Hastings.", "author": "Andrea L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "Ah!!!! I love this place - the bread, the mustard, the fresh meat and sadly most of all the chopped lettuce :)", "author": "Adriana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "The best thing is the really big half sandwich for 3.50. Just 3.50, not 3.50 plus tax. It's all included! They offer combos, which are about twice the amount of a half sandwich, like $7. Plus, everyone here is super friendly and nice. Great service. Oh, and their jalapenos are truly hot! I've been to some places and their jalapenos aren't even hot! I love this place!", "author": "gabby m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-11", "description": "Good sandwich place in the TL.  Like everyone else says, their bread is good.  Sandwich is huge.  Lots of selection.  People are super nice and the lines move fairly quickly.  \n\nI would give this place 4 stars because it is good, not the most awesome experience ever, but I definitely go whenever I feel like a sandwich.  \n\nWhy 5 stars you ask?  Because of the low rating Wan gave.  I am trying to up the rating because I don't think its low rating is deserved.   I go to those other sandwich places where I pay only 2 and change, but there are times I when I want a really good sandwich instead of something to just get me by and will pay the 6 for Le Petit.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "-Their sourdough bread is perfect for sandwhiches- not too hard and fresh as it could be. \n\n-Meats are always high quality. \n\n-Wide variety of sandwhich combos and they aren't annoyed by substitutions. \n\n-Friendly staff, quick service \n\n-SANDWHICH CARDS! buy 10 get 1 free so get your stamps\n\n-Their sides like macaroni and potato salads could be better.", "author": "Jayme J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "What can I say about this place.  I love the sourdough bread here.  I love the choices and how friendly everyone is here.  I've had most of the sandwiches here and enjoyed the hell out of them.  But why 4 stars?  Well, I've tried most of the sandwiches and there were two I was kind of disappointed in: the meatball and chicken parmesan.  For those two I'd rather to go to Morty's.  However, that being said, this place is awesome and the bread is always delicious.  The side salads are also great and a nice touch.  Definitely recommend and will continue to go here while I attend Hastings.", "author": "Robert I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "I definitely agree with yelper, Brian H., that both Mortys and Le Petit are prime sandwich makers in the area.  I seriously love them both.\n\nBut Morty's is very much a more recent find, and my friends next door at GAAP brought me here for lunch one day.\n\nMy chicken pesto sandwich was outstanding.  It was just the right size, but I kind of wish it was bigger, especially since everyone else is claiming they have huge sandwiches.\n\nNevertheless, it's an excellent establishment, and you can tell it runs busy with the local law students.\n\nBut yes....if you want AMAZING bread, go across the street!", "author": "Vince S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "Yay for another amazing sandwich joint in the Tenderloin! They use homemade sourdough bread (yes, home made) and serve everything nice and warm.  Unless you're Jabba the Hut a half sandwich is probably plenty for you.  As for choices - how about grilled fish?  Veggie?  Turkey? Oh, of course, it'll be best with a pickle on the side, right?", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-07", "description": "Unless you're a BIG eater... just get a half sandwich.  Thats a regular thing now for them.  I think the price is about $2.99 for most 1/2's.  \n\nThe sourdough bread is delicious, fresh, warm, just plan yummy!  The basic turkey, or tuna, or chicken salad are all *great* choices.  The BLT is delicious but not a whole lot of bacon on there.  Lots of people I know rave about the Basil Chicken.  They have a huge menu, so you should be able to pick whatever your heart desires.\n\nAs an added bonus to the sandwiches, the service is fabulous, you get a yummy pickle and a costco-chocolate mint (fake york's)  \n\nHonestly -- The sandwiches are so good I'd go no matter what.  But I feel twice as good because at this small-business the owner and employees are super friendly and efficient.  \n\nYou might want to get it to go... the place has very limited seating.", "author": "Katrina O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-19", "description": "Le Petitt's is a staple lunch spot for me and my co-workers. The sanwiches are big and delicious, on warm, crusty sourdough bread. Tables are few, so it's mostly a take-out spot. \r\n\r\nIt has \"mom-and-pop sandwich joint\" written all over it, in very pleasant, generous ways. You'll always get a carefully-wrapped pickle and a mint with your sandwich, and frequent customers get a free sandwich 1/11th of the time. Right now, for the holidays, each sandwich comes with a little hand-wrapped bag of homemade bonbons. It's adorable.", "author": "Joe G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-23", "description": "My friend and I stopped by for lunch under the impression that we were going to be impressed, since it was recommended by a regular. First off, the location is horrible. It was 11am on a Wednesday and there were already over a dozen people on every corner trying to hustle. We could barely cross the street without the fear that we might have to run for our lives. Once we got inside the tiny little shop, we checked out the menu. My friend is a vegetarian so I'm not sure how many choices they offer but it did seem like her choices were very narrow. I'm not even sure what she ordered but she didn't even finish it. I went w the 'roast beef' sandwich and was very disappointed. There was nothing about it that I wanted more of. The contents of the sandwich kept falling out and it wasn't tasty enough for me to put it back in its place. The only thing that saved me was the caesar salad. I guess you get what you pay for. A sandwich, salad and a drink for $6.75? Super cheap. Got damn.\n\nI needed to use the restroom and when I asked the cashier to direct me to one, she proceeded to tell me the story about the building...and how some of the other occupants there don't like each other so they don't share the bathroom. Uhh...thanks for the story lady, but I still need to pee!", "author": "Dung N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "Decent sammies at very reasonable prices.  The sourdough rolls are fresh and tasty.  The meats and fixin's aren't overwhelming, but plenty satisfying.  Half-sandwich, chips, and small drink only costs you $5.50 with tax and is just the right amount of eats.  They have a frequent flyer program, too, which is always nice.\n\nBonus are the Hershey's Kisses sent along with, sparing you that walk of shame to the candy person back at the office.", "author": "Daryl E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-15", "description": "The sandwiches are bland and boring, like something you might find in a high school cafeteria. Ordered the chicken cordon and some other chicken with cream sauce. Would've probably left after the first bite if I wasn't so hungry and short on time. It's an hour later and I still feel like there's a big sourdough and chicken lump in my stomach. Yuck. +1 star only bc staff were friendly.", "author": "S O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-14", "description": "Have to give it five stars because they roast a lot of their own meats!  That is such a premium.  \n\nI see what Wan is saying.  I too was surprised that their veggie didn't have avocado in it but the other veggies in the sandwich looked really good.  And Morty's veggie that I had was noooooooot good.  The avocado was like an avocado sauce and the whole sandwich was a mess.  I feel bad saying it b/c the guy from Morty's is such a good guy.  But so are the women of Le Petitt's.  Morty's is still prob a better call,  for vegans- they have a vegan sloppy joe- that's pretty awesome.  But for meat-eaters, I'd have to say Le Petitt's.  I'll be going to that side of the street for my veggie and non-veggie sandwiches.  Although some guy raved about the reuben at Morty's and I will try that sloppy joe.  I guess I'll be bistreetal and split my time b/w the two.\n\nAnd that card is a nice way to thank their patrons- it's the first cafe I've seen offer that (I've only been here 2 months).", "author": "Staci M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "I can't say no to house baked sourdough bread. So San Francisco. So good. Le Petitt's did not disappoint. Packed with turkey and veggies, I loved every bite. My only regret is I got a half sandwich instead of a whole. I easily could have had more.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-15", "description": "Le Petitt's Kitchen has some really good sourdough bread! Today I had the chicken salad sandwich which was very filling and delicious! They arent shady with the amount of meat they put in your sandwich which makes it such a good deal! The employees here are really nice!", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-06", "description": "Another place in the TL close to work. The place is small and there seems to be lines during lunch but they move quickly so it's not that big a deal. \n\nFourth star belongs completely to their sourdough bread. Every sammich they have is made with their soft, delicious, fresh baked sourdough and it's worth it to fight the crackheads in the surrounding Tenderloin territory just to get a bite of that bread...", "author": "James Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-24", "description": "Now THIS is a place I would almost seek out and crave*.   3 things:\n\n1. Damn good sandwich - way big, get a half if you don't eat that much.  You can get a combo meal with it, and have room in your tum for the side that comes with it.\n\n2. Around the block from UC Hastings, their lovely courtyard and their lovely view*.   *I went to the art institute.  Art/trade school = complete absence of straight and/or non-D&D loving men.  Law student boys in khaki shorts and flip flops were the best thing since the discovery of le petitt's sandwiches.\n\n3. Line moves fast, and the atmosphere is low-key and the people are nice.  \nGotta do something about the flies in the dining area though, people. ew.\n\n*but that is only because I was always on foot, and when stuck in the Civic Center, your options are quite limited. Please refer to my review of Gyro King for further explanation.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "This place has the best damn samiches!  i like the north beach and the chicken cordon bleu:)  plus the little bitty candy bar they give you with every samich is the perfect dessert.  Friendly, fast service...just the spot for a quick lunch.  although the line can be out the door @ lunch time.  go early, go late, but go...", "author": "Stacey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-19", "description": "O what the heck, a FIVE it is.  Not fancy or sophisticated, but if you are in the TL and need a quick, friendly, independent place to hunker down for a bit with a cup of coffee and/or a sandwich this'll do just fine.", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-04", "description": "Sourdough bread.\n\nFor years I visited Le Petit's Kitchen and bought their bread exclusively. Used it for my own sandwiches, toast, croutons etc. but for some reason I never ate here, just coveted their delicious rolls for at home use. Now I remember why.\n\nGF brought me home a half veggie sandwich. Looks like all my friends made it to the party - there's lettuce, tomato, red onion, peppers, olives, cheese, and then I spot the guest who tried to sneak in without an invitation. Damn carrots. And a lot of them. \n\nJust because I'm a vegetarian doesn't mean I want a garden salad on bread. But when the bread is this good, maybe i dooo......\nIf you live or work in the area its definitely worth trying.", "author": "Corey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-28", "description": "Le Petit's defintely gives Morty's across the street a run for its money, and is a serious challenger for the Tenderloin deli crown. They both make rockin' sandwiches and take credit cards. Le Petit's definitely has Morty's in the bread department- fresh, hot, scrumptious sourdough is Petit's forte. Le Petit's is also quicker and just as consistent, and some of their sandwiches are a little cheaper (especially if you use the frequent buyer card). The salads and soups at Morty's are definitely superior though, and Morty's has a nicer dining area and better vegetarian sandwiches. So ultimately it's a tossup for me. You really can't go wrong with either one.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "they bake their own bread on the spot...it's kinda like a softer dutch crunch.  i've tried both the corned beef and the reuben, and they're both pretty good.  it's right down crack alley, so you'll have to excuse the crackheads smoking near the doorway.  the only problem i have with this place is the price.  the sandwiches are good, but a little pricey for the size of the sandwich.\n\nmy friend didn't like their tuna sandwich either.", "author": "Ray R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "I went to Morty's 'cause they have the rep, but found even with no line at 11 a.m.  I was invisible.  Guessing 'service orientation' is not in the Morty lexicon.\n\nAfter a few minutes of not being acknowledged, crossed the street to Le Pettit - greeted by not one, not two but three smiling, friendly employees.  Went for the 1/2 sandwich and soup, $6.  New England style clam chowder and basil cream chicken on in-store sourdough.\n\nExcellent in all ways!", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-14", "description": "Le Petitt is close to the civic center area where I work, so I probably stop in for a veggie sandwich here about once a week.  The sandwiches are huge, and reasonably priced.  The fresh-baked sourdough bread is actually worth the trek through the surrounding crack-infested, urine-scented tenderloin neighborhood.   But hey, dodging all the panhandlers, drug addicts, and leaping over slumbering homeless and the human excrement (I know it ain't dog droppings...) on the sidewalks will help you burn off all those calories you ingested during lunch.....", "author": "Kimberly T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-15", "description": "They should only offer the half size sandwich. I ordered the Liverwurst and it wasn't very good. The sourdough wasn't anything to write home about. It also seems like there are too many options on the menu considering every choice is just a different meat and/or cheese.", "author": "Paco Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-12", "description": "dang, i don't know what all the fuss is about this place, but it's sooo average!  i had some friends raving about it, so i decided to finally give in and try it.  it wasn't great the first time, but i thought i had bad luck so i went back again.  yea, i definitely could've made the sandwich better myself.  \n\nthe bread (that is baked there) tasted like....sourdough bread.  that i toasted for a minute after buying it from safeway.  and absolutely nothing special about what was inside of the sandwiches.  as cheap as the price is, i seriously felt cheated.  i'm not a professional sandwich chef or anything, but i'm going to make my own sandwich next time.", "author": "Naomi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-11", "description": "This local joint is in the TL ... right by my law school ... so I often ran over to this place to grab a quick bite.  Outside of the chicken salad sandwich and the fact that their bread is freshly made ... the place is just a regular sandwich place.  They do get bonus points b/c the sandwiches are freshly made to order and their freshly baked bread is worthwhile and makes it stand out from most the joints in the TL.  Oh, and the service is always friendly ... so that is always nice.  Oh, be sure to collect your sandwich points!  I never did and probably could've gotten a free sandwich over the three years I spent hopping in and out of this place.  Oh, just one more note ... the place is TINY ... you'll be eating likethisclose to other people, so it may be best if you take your food to go.", "author": "Roni R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-13", "description": "I just had a delicious Chicken Salad Sandwich.  Very good service and its nice that they throw in a little bite-sized candy as a treat.  My sandwich was made very fast even before I could finish going through the rest of the menu.  The sandwich was good and the sourdough bread that is often spoken of was good too.  Even though I am not too big of a sourdough bread fan, I enjoyed it.  One of the reasons I would definitely come back is because I am so close.  Otherwise I probably wouldn't go out of my way for it.  Good stuff though, but I am just not quite hooked yet.", "author": "Bert N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "What I really like about this place is their lunch special, where you can get a half or whole sandwich, chips, a drink and a piece of candy for all pretty cheap.  I usually get the half sandwich and it is a perfect amount of food.  The sandwiches are really good too.  The people that work there are very very nice.  Unfortunately, there is not a lot of seating, but with it is a short walk to civic center to eat in front of city hall!", "author": "Britany F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-20", "description": "I love this place. The owner and other ladies working there are always so nice and make a damn fine sandwich. They have some awesome options for sandwiches, my favorite is the North Beach, turkey and salami on a fresh warm house made sourdough roll. Now that I don't work downtown I miss this place, but still stop by when I'm in the area. They also have a free sandwich card for frequent buyers!", "author": "Troy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-15", "description": "I go here pretty regularly just because its near school.  Its pretty damn good, and the bread is AWESOME, but there isnt a whole lot of meat.  If Le Petite and Morty's (across the street with PILES of fresh deli meat) teamed up (le petite rolls with Morty's filling) they'de have the perfect sandwich.  Instead, they are both fairly average.  Alas", "author": "Caleb R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-16", "description": "Simple, tasty, and the right price. This is my favorite lunch place when I'm in the area (I work across the street) - I've used up 2 of their frequent buyer cards already. No matter what time I come in, the bread is always warm and crispy on the outside, and the filling is enough to make a light meal with only half a sandwich - and the pickle and the bite-sized candy bar make it feel like a three-course meal! The staff is always friendly, with quick service. They treat regular customers very well. What's not to love?", "author": "Wade M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-10", "description": "Sandwiches here rock!  Service is always fast, and the woman who runs the place is very pleasant.  The best part is that they take debit cards, so when cash-strapped law students such as myself need some hot meat (really, the hot sammiches are quite good...and who *doesn't* like hot meat?), we can still get our sammich on.  The line can be long during the lunch rush, but it moves quickly.  I only wish they'd start offering french bread as well as sourdough!", "author": "Jess T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-27", "description": "A pretty good sandwich. They make their own fresh sourdough daily and and offer many sandwich selections. (This is where I go to satisfy my braunschweiger cravings over hot sourdough!!!) These ladies are friendly and really work the place. You will definately come back.", "author": "Eugene G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-18", "description": "The bread is heavenly. I've walked through countless crack deals in order to get my hands on that bread- that's how good it is. And I love the fact you can have both spicy mustard and horseradish. And the punch card is great- buy 10 sandwiches, get one free.", "author": "Noelle Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-12", "description": "I love the sandwiches here and it is all about the bread.  The bread is thick and soft and crunchy all at the same time.  As a bonus you get a peppermint patty with your sandwich!  The sandwiches are large, and if you are just looking for a regular-sized lunch, consider just getting a half sandwich, it is plenty filling.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-30", "description": "My friend Mike just introduced me to this place last week and much to my delight they make a kick ass sandwich.  Specifically the Basil Cream Chicken sandwich was very yummy!  I look forward to my next visit to try something else on their delicious sourdough.", "author": "Derek D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-09", "description": "If the bread that makes up your sandwich is as important as the filling, this is the place for you.  The bread is a gorgeous sourdough (Joe G. took my warm and crusty phrasing!) and very fresh, and there's a wide selection of meat options.  The result is rather large, so they will do halves if you ask nicely.  All the counter people are really nice.  There's usually a line these days since there's no cafeteria at Hastings, but it's worth the wait.", "author": "Nat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-06", "description": "Their lunch special rocks. My personal favorite is a hot pastrami sandwich on their oh-so-good sourdough bread, a side salad, and a drink. Mmmm...a great place to grab lunch since the Hastings Law Cafe (now known as the Hastings Stand) really gets old. Just watch out for pooping people on your walk down Golden Gate Ave.", "author": "Dalia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "when it comes to lunch time at the university of california hastings, there are many options.  most of these options should be summarily avoided, e.g., the law cafe (why sit and eat with law students when you dont have to?), the various mexican food joints (do you really want to be sitting in class or the library with a stomach full of burrito?), fast food joints (gross). then there are the sandwich shops.  subway is cheap, but the subs are not that good. and it is a much further walk than the other two sandwich places.  morty's has the biggest following. there are reasons for this. they have a wide variety of sandwiches and a delicious selection of daily soups. but there are problems with mortys. morty knows it has the biggest following and it acts like it.  as kid cudi said: \n\nshe know she got it/in turn and make a kid not really want it\na bad bitch who know she a bad bitch/worst type in the world if you ask me.\n\nthen there is le petitt's kitchen: the bread is always fresh, the lines are usually short, the ingredients are very tasty.  they have punch cards that grant you a free sub after purchasing enough.  the lady that works the register is really friendly. sure they dont have all the extras that mortys has, but when i am in need of a deli sandwich and i dont want to have to deal with a \"bad bitch who knows she a bad bitch\" i roll to le petitt's. it really is just as tasty as mortys, even if they dont have all the options.  \n\nps if you are a hastings law student. stick to mortys or the law cafe. i like the short lines here and would like them to stay that way.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-01", "description": "Love the sandwiches here. Warm bread. Friendly people. Can order half sandwiches. They remember what I order everytime and that I always want a fork to eat the extra egg salad that always falls out.  I feel guilty when I don't visit at least once a week. How can you hate a place that gives you chocolate when you order a sandwich?", "author": "Alice M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "I love their warm, freshly made bread!! I usually get their tuna ($6) with swiss.. its really good.. their tuna isn't all mayo like in some other places, and it has alittle bit of a tang/heat to it, i don't know what it is, but it's good!! The ladies that work there are really nice and they give you a free peppermint with your order and a card which is good for 10 stamps and a free sandwich..  My boyfriend likes getting the chicken basil cream sandwich... Sometimes we also go for the special which is a half a sandwich of your choice and a choice of soup or salad.", "author": "Karen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-12", "description": "Maybe I've gone a different place than everyone else here.  The place I went to was overpriced, and the bread wasn't particulary that fresh or tasty.  If you're really in the mood for a good sandwich, go across the street to Morty's.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "i get the same sandwich everytime.  #31.  i olive spread is delic.  like most of my tenderloin reviews, you might see or have to step over a crack head or two to get there.", "author": "Hammer Time H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "now here this,now here this!  there is a sandwich sale.ahoy there. $5.00 for  you and me,the whole lot of us. can you beat that? or dance to the beat. i'm gonna eat to this beat even after the sale is over. i's a spring sale. so jump,jump,jump around joe...on your matress and spring on over to petitt's kitchen or is that le petitte's. looks like the french can do. can you do to?", "author": "OSEPH E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "Le Petitt's is a hidden gem.  I had no idea it existed until a co-worker mentioned it by name.  This place in unique for the neighborhood.  It's atmosphere is totally different than Morty's, more importantly - it is totally different than the neighborhood right outside its doors.  More go to Morty's to chat and eat.  Le Petitt's, though it has tables, is more for pick up and run.  It has an impressive selection of sandwiches to go.  Combos include a fountain drink and selection from a good selection of chips.  Canned soda, bottled water, and limited small sides are available.  This place is clean, the service is consistently excellent.  More important, the breads and meats are fresh.  A pickle and candy are also included with the combos.  I find that a half sandwich combo is just right for lunch.", "author": "Antonio E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "I'm obsessed. They bake their bread themselves, its warm and delicious. What more can you ask for!? $3.50 for a BIG half sandwich--YUM.", "author": "Lauren Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "good sandwiches, good price, so what if the alley i have to pass to get to this place from work smells like urine?  1/2 sandwich is enough if you're getting sourdough bread.  if not get a whole sandwich.", "author": "monica c."}
