{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Good food and beautiful view. I had made a reservation for 2 a week in advanced for Thursday at 5pm. We had arrived 10 minutes early, and the host still seated us! He gave us a seat by the window, and even had nice conversation with us. For our meal, we decided on ribeye and filet mignon with a side of truffle tater tots (serves 2). We got both of them medium rare, and they both came out juicy and flavorful. And the truffle tater tots brought tater tots to a whole new level, being tender with a hint of the truffle flavor that wasn't overwhelming. For dessert, we ordered the bread pudding, but we were very full from the meal itself that we weren't able to finish it. I personally would not get this again, as I prefer a more homemade taste of bread pudding.\n\nHowever, the thing that sets this restaurant apart from others is the view and the live music. Even during the day, the view made the meal even more enjoyable. And the live piano was such a lovely touch!", "author": "Julia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "I had a reservation for my wife and I to celebrate our 2nd anniversary. We were in town from Seattle and I had this night planned for quite some time. We show up this evening to our reservation and are turned away. The reason, my business casual attire wasn't good enough. \n\nNow mind you the web site front page only says \"Business Casual\", I had on a starched and pressed pair of golf shorts due to the weather and a nice shirt. The pompous host quickly told me I wouldn't be allowed in the restaurant. Funny how I wasn't allowed in to dine, yet the gentleman who was walking in wearing blue jeans and a Henley was okay. \n\nNow I would hate to think that I was turned away not because of the clothes I was wearing but maybe the braids in my hair and the melanin in my skin had something to do with it. \n\nIt was awesome to get such a warm welcome to San Francisco from this establishment. After being shunned away by this establishment, my wife and I were welcomed with open arms at Zingari Ristorante.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Since, I'm a former Marine you know I had to try this place out.  Very nice restaurant, good views of the city, and the piano player playing music which is wonderful.  We ordered the crab cakes which were delicious, light, nice sear on both sides to form a light brown coat to it, and the corn salsa to go with it was filled with flavor.  The entree was; \n\nprime rib-cooked med rare which I love, cooked perfect, tender, great flavor on it. \n\nrack of lamb-cooked perfect, great flavor to it, tender\n\nSides- green beans were ok, needed a little more seasoning to it. \n\nMac n Cheese-off the hook. Great flavor of cheeses, bread crumbs, and cooked perfect.  \n\nWines were. Very good and reasonable. \n\nDesert-Bread pudding, so delicious, light, good flavor, whip cream perfect. \n\nService was good and the prices are very reasonable. \n\nI will come back to see if it warranted this 5.  \n\nSEMPER FI.....", "author": "Will E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "It was a friend's birthday and we wanted meat. My girlfriend picked Leatherneck Steakhouse and made a reservation the day prior for Wednesday, January 3rd at 7:15pm for our party of three. We had requested a table by the window for the view, but since we showed up early, none were avail. Before we ordered, a table freed up, so they were nice enough to let us move.\n\n*Dungeness Crab Cakes: sweet corn relish ($15)\n*Prosciutto & Mozzarella: warm tomato relish, pesto, on crostini ($12)\n*Corkage Service Fee ($20)\n\nWe brought a bottle of red wine, so we started with that and the apps above. I didn't care for the crabs cakes as they were kind of mushy, but the prosciutto and mozzarella were tasty. Especially with the warm crostini. They also give you complimentary bread with butter, roasted garlic, balsamic and olive oil. I love roasted garlic, so was super happy this was included.\n\nEntrees: includes a Classic Iceberg Wedge with blue cheese dressing, all steaks are certified angus beef\n*Ribeye: twelve ounce ($34) ×2, one with Leatherneck Steak Sauce, one with Roquefort Butter\n*Filled Mignon: six ounce ($36) with Bearnaise\n\nAll entrees come with a salad which is always a throwback to me. (I grew in my dad's old French restaurant and he included a soup of the day or house salad with each main, so it reminds me of my younger days.) The salads were a good size. The dressing had a subtle blue cheese flavor. I ordered my steak rare, but unfortunately, it came out about medium well. Same thing with my gf. I hate complaining, but it was way too overcooked, so we sent them back. The second round came out blue rare which was under, but we didn't want to complain again. Also, I was kinda full by now, so it was better for leftovers anyways.\n\n*Roasted Wild Mushrooms & Shallots ($10)\n*Fried Brussel Sprouts ($10)\n*Truffle Tater Tots ($10)\n*Provenance Cabernet Sauvignon ($60)\n\nWe ran out of wine by the time our entrees arrived, so we got another bottle. It was more full bodied than the one we brought, so it was a good follow up. The sides were tasty. I enjoyed the mushrooms and brussels. I do love my veggies. The tots weren't the traditional tots. They were kind of churro shaped instead. And I didn't get much truffle from the side. Since it was our friend's bday, they gave us what I think was a passion fruit cheesecake. I took a bite and it was creamy with a nice tartness\n\nFun special occasion restaurant. And such a great view. (Probably even prettier if it weren't raining. We had the worst luck with weather that day!) The atmosphere is classy (but not stuffy) and makes me feel like I'm in another decade. Definitely a good place to feel a little fancy and get your steak on.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Just visited it last nights.\nThe environment is really good. We reserved a window side seat, which has fabulous view through the all dining periods. Also a gentleman is playing the piano near us, creating a romantic environment for the whole restaurant! \n\nWe orders three starters: Dungeness crab cakes, oysters Rockefeller,  clam chowder; two entrees: seared sea scallops and 12oz rib eye; one side: asparagus hollandaise.\n\nHighly recommend the Dungeness crab cakes $15, which has a lot of the crab meat and taste yummy.\nFor oysters Rockefeller $15 I am not a fun of oysters, so for me, nothing special for this.\nClam chowder is a cost-effective choice, $8 for a big bowl including various vegetarian and seafood meats.\nSeared sea scallops $29 with 6 pieces of scallops is very yummy and juicy. The wild mushroom and arugula are both delicious, as well.\nThe 12 oz rib eye is little over cooked but is acceptable. It is very tender. I tried the leatherneck steak sauce, which is good. I think it is the repressive and traditional sauce for this restaurant.(just guessing from the name) \nNothing special for the side asparagus hollandaise $10. \n\nThe only thing I am very unhappy unhappy unhappy about this restaurant experience is that our waiter never stopped by and asked for our feeling about the food. I mean Never! Can you believe that it happened in this kind of restaurant? I do not know the reason. Maybe he is too busy to forget.....\n\nOverall, the food and the environment are both nice. From other online reviews, the servers are nice there as well. Maybe I just unlucky to be assigned the unsatisfactory waiter.Welcome to stop and have a try!", "author": "Xuan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "This place sits atop the Marine Club. We found it on Yelp & OpenTable and though we were on vacation didn't really pack super nice clothes we thought we had nice enough clothes to get us in so we went for it. Our server was attentive, helpful & told us all about what he preferred and made some great selections. I should have taken pictures but I was just staying in the moment of a spectacular view & great wine. The rib eye was cooked perfectly and my husband steak Oscar was amazing. The best part about this establishment is it is part of the Marine Club which is a non profit that helps our troops. \n\nDon't miss this place!!", "author": "Alicia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-02", "description": "Please note that this review is for the treatment we received from the staff and we did not eat at this place.\n\nI had the most disappointing experience here with my fiancé. We made reservations for 2 on a Saturday early evening. Nowhere in their website nor on OpenTable does it state that you are not allowed to wear certain clothes in order to be able to dine here.\n\nIt was a sweltering day on Saturday (over 90 degrees) so my fiancé wore a nice designer pair of shorts with his short sleeved button up. \n\nWe got to the restaurant and was seated and then the host told us we would not be allowed to dine there because my fiancé is wearing shorts. Since we had no knowledge of this clothing policy and it was hot as fuck, he did not bring pants.\n\nSo we walked out of the restaurant and noticed that a couple  of the other men in the restaurant were wearing shorts. We asked if we could sit at the bar and order food there and they said yes. We sat at the bar table for 10 mins without anyone acknowledging us and when I went up to the bartender and asked for a menu, he answered rudely and then said he could only give me the wine list and that happy hour is only for hotel guests.\n\nWe ended up eating at Morton's Steakhouse down the street where they happily served me and my shorts wearing fiancé.", "author": "Melody K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Initially we were seated in a table away from The window, and the manager was able to get us seated at a table right next to the window to fully enjoy the view of the city. \nThe servers were attentive without imposing on an intimate dinner. \nWe ordered 2 steaks, the NY and Filet mignon. Both were cooked well and delicious. The live piano player in the background really provided a great ambience. I would come back on our next trip to the bay.", "author": "Carina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Loved it! Good serving size and great ambiance. Spectacular view. I made same day reservations online for 8:15 pm. The skyline was beautiful. There was no wait and I was able to get a table next to the window. The piano player was there and filled the room with soft and calming tones. Upon sitting down, I was served Chibata bead with a whole roasted garlic, vinegar and oil, and butter. I started off with the iceberg wedge salad with blue cheese dressing. The salad was descent. Interesting plate setting. I cut up the salad myself. I tend to notice a lot of high end restaurants like to throw a twist on sale appearance. This one was probably the best I have seen so far without having to feel like I'm making my own salad. I had the roasted garlic mash potato and the 12 oz New York Steak Strip! The steak was cooked medium well. Very juicy and tender. All sides are $10 and can serve two. The mashed potatoes were incredible. However, I did think the mashed potatoes had a bit too much salt, but if you ate the steak and mashed together, the saltiness wasn't noticeable. I tried their steak sauce and it was delicious. I'm more of a vinegar based steak sauce person as this sauce seem to have a bbq based. I skipped out on dessert, but did view the menu. Next time I will save room for dessert.\n\nCheck out my pictures.", "author": "Anita T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-19", "description": "View was nice,  service was fine, not great,  but okay.  Very average.  It was beautiful and the drinks were generous and tasty", "author": "Debbie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "Took three tries and a long time to get a medium rare steak. First time is was cooked more than medium and I got the last porterhouse. Second time I got a ribeye, they dropped it off and said here is your medium steak. Would have expected them to make sure it was right the second time. \n\nDid nothing to make up for the two mistakes. \n\nSteak wasn't very good. :-(", "author": "Chris N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Great view...and unfortunately that's the best part. I come here often as my spouse is in the service, but food and wine are not so great. Steak here is tasteless and over priced. However, I like people who come here and love the jazz piano performance.\nAnd I love cute English Bulldogs at the lobby.", "author": "Lana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "Worst date night experience ever !\nIt was a rare occasion that we don't have our children for the weekend so my wife and I decided to try leatherneck steak house on our date night . Had never been there before but seen decent reviews on Yelp as well as a few other sites. \nWe showed up about 30 minutes early This last Saturday at about 5:30 PM. I approached who I believe was the host and let her know we were here and that we were open to been seated early but preferred to have a few drinks.  She didn't even let me finish my sentence before she rudely interrupted me and told me to walk down the hallway. So me and my wife made ourselves down the hallway to find I guess what they call the lounge for happy hour but there were no seats available. So I went back to the host and explain to her that there were no seats available and if she can accommodate us some house. She pointed to an open seat on one side of the room and another open seat on the other side of the room and told us if we really wanted to have drinks I could sit over there and my wife could sit over here which made completely no sense why would I not want to sit next to my wife! I try to explain to her that wasn't going to work she didn't showed me the elevator door and told me I could leave or I can go sit at my original table and not participated happy hour at that point I told her she was being extremely rude and I wanted to speak to her manager. \n She then brush passed me rolling her eyes and mumbled something under her breath about Trump being president. At that point me and my wife were extremely offended by her comment considering were both Latino and the host is Caucasian, we knew what she was trying to imply. So we left.\nLucky I was able to meet Pete who is the restaurant director In the lobby of the hotel I gave him a rundown of what was going on and what happened and how we were beyond offended by their host  attitude and racist remarks. He offered to buy us a couple cocktails and a glass of wine in an attempt to make things better in hopes that we would stay. My wife felt extremely uncomfortable so we declined his offer and went elsewhere.\nI have never been treated with such disrespect ever in my life I hope you guys seriously deal with this woman . I hope to hear back from the management soon", "author": "Nick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-04", "description": "The VIEW is amazing. The SERVICE is amazing. The food is quite good. Of course, there are many more steak houses in SF that do better, but overall, we were very pleased with our meal. The Boo had a rather rare ribeye, I had the special which was surf 'n' turf (half a crab with slightly medium steak and mushroom sauce over polenta), which was delicious. We had a side of creamed spinach, which was better than House of Prime Rib's (shock, horror!). \n\nThis is definitely a place to bring out of towners for the view, courtesy and ambience.", "author": "Mi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "We came here for my GF's BDAY on our trip to SAN FRAN and it was absolutely incredible. The Steaks and sides were cooked to perfection and the drinks were on point. \n\nThe ambiance is beautiful and if you can, request a window seat after the sun sets, so you can get a view of the city's night lights (downtown san fran) while dining.  \n\nAlso, they have a piano player that sets the tone just right for a romantic dinner.  \n\nHIGHLY RECOMMEND!!", "author": "Johnny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Had great experience.\n\nI've booked a table for two people for a special celebration and although the reservation said it was not guaranteed a specific spot, we were spotted in a really good table. The dinner area is not that big, so you will have a good view anyways.\n\nThe food is tasty. Price is worth the experience.", "author": "Fábio Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Took my mom here on Mother's Day. What a hidden gem! Not overly crowded, food was good but the view is priceless. Both my mom and i had the prime rib. Not the best prime rib in the world but price was reasonable and did I mention the great view? Add a little military history and the memorial wall for those who paid for our freedom, how can you not be compelled do you own little part and support this restaurant and enjoy a good meal? I may be against war, but I always support the soldiers.", "author": "Glen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "I came here with my friend whose father is a benefactor of the Marine Memorial Hotel. We came early for our reservation, but the hostess seated us right away at a window table. I ordered a filet mignon medium rare and we got a side of mashed potatoes to share. In all honesty, I'm not a huge red meat person, but I felt like the cut I got was not the quality I would have expected from such a high end steak house. It was also rarer than I would have liked. That being said, it was excellently seasoned, and the mashed potatoes were delicious. The view of San Francisco's Finanical District and the live piano really made the night for me. \n\nI will say that while I enjoyed the ambiance, the service was subpar. We got drinks at the bar before being seated, and it took what felt like forever to even get the bartender's attention despite there being very few people there. When we finally were able to order, he had the personality of a dead fish and poured two whiskey sours of completely different sizes. It seemed as if he just didn't care. When we were seated the service was very slow, and I had to flag down a waiter every time I needed something even though it was not very busy. \n\nAll together, I had an enjoyable time, but some improvements in the quality of service would be appreciated. I would return for the ambiance.", "author": "Alli S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Semper fi.   Wonderful restaurant. Very good food.  Attentive service.  Lovely piano play.  Gorgeous view from the 12th floor.  Marine Corps heritage on full display in the first floor lobby.  \n\nGive yourself 20-30 minutes to peruse the displays in the lobby and learn more about the Corps. Then head up to the 12th floor and have a cocktail at Chesty's before settling in for dinner.", "author": "Bob H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Such a cute place for date night, an anniversary, or birthday! This is dinner with a view and a live pianoist playing! Definitely a place to dress up for :) \n\nWe reserved seats next to the window so we would have the view from evening until it got dark. \n\nWe ordered:\n* Sparkling wine ($12)\n* Pinot Noir ($10)\n* Mac N Cheese - Decently good ($8)\n* Tater Tots - filled with cheese! So good! Must get! ($8) \n* Ribeye - good sized portion. Pretty good ($33)\n* 6oz Filet Mignon - we asked for medium, but it was a little overcooked. It was a little too tough and hard to chew. The exterior looked a bit burnt too. I wouldn't order this again ($34)\n* Blueberry dessert - I forgot what it's called, but we really only ate the ice cream. Big portion, enough for two people. I wasn't the biggest fan of this ($8) \n\nYou're also served complimentary bread and salad. I loved the salad!! \n\nOverall, I really enjoyed the service and environment. I would definitely come back again and try other items on the menu!", "author": "Miranda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Took the boy here for dinner and he enjoyed it! I found this hidden gem while browsing through Yelp for steakhouses. The view of the Financial District is amazing. You can see from Transamerica all the way over to AT&T Park. Try waiting for a window table if possible!\n\nI ordered the 12 oz rib eye and my boyfriend had the 10 oz prime rib. Both were a bit too over cooked for our preference of medium. However, both entrees were flavorful and filling! We also ordered a side of truffle tater tots. These take tater tots to a whole new level! The outside is crisp and light, while the inside is smooth like mashed potatoes. It's a bit on the salty side! Each side serves 2. Both entrees come with an iceberg lettuce with bleu cheese and ranch dressing. Simple, but delicious! Their desserts are homemade but we were too full from dinner. Maybe we'll skip on a side to try dessert next time. \n\nService was a bit of a miss that night. We waited much too long to have our orders taken, waters refilled, and check given. They did fill up, and seating is quite limited, so make sure you make a reservation in advance. Dress code is enforced! Will definitely be back for another special occasion!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Enjoyed our meal thoroughly.  Beautiful view of the city. Poke tacos were delicious. My husband had a giant prime rib that was cooked to perfection. My scallops were very flavorful. Very relaxing atmosphere with piano music. Great experience!", "author": "Tori P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "It's a vanishing breed, but if you're looking for an old-style cocktail bar and steakhouse with live-but-not-loud piano, this place is a gem. It's got an upscale but not formal environment, and an ambiance quiet enough that you can have a conversation without raising your voice. There's no dress code, yet many of the gentlemen are wearing jackets; a few even don ties. (No one takes note if you're in shirt sleeves.)\n\nThe menu is exactly what you expect: cuts of steak (filet, NY strip, ribeye, Porterhouse, and Prime RIb), sized from small to large, all cooked to perfection with a selection of complementary sauces for those who wish; a few fish dishes for pescatarians whose companions drag them to the steakhouse; and a couple of token vegetarian dishes, probably best avoided, for the vegetarians who could not drag their companions elsewhere. Entrees all come with a salad. There's a good selection of side dishes, but so far we've only tried the creamed spinach and truffled tater tots, both so good that we order them on each visit. \n\nThe food is excellent. The service is friendly. The views from the top floor are great and recommend this spot as a place to entertain out-of-town visitors. The wine list has many good selections at fair-for-a-restaurant prices. \n\nIf this kind of place is your cuppa, you really can't go wrong here.", "author": "David K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-24", "description": "The appetizers and salads were amazing, the service was tough as our waitress had a thick accent and hard to understand.  We tried to order a special drink and it came back without what we requested.  She was nice enough to try a few red wines as they did not have any Chianti.  We even had a reservation but did not get seated a window table with a view, you think they would save those for reservations, maybe those were given to reservation guests...who knows.\n\nThe biggest issue we had was both our filet mignons came out very rare and extremely under-cooked when we requested medium.  Then after 15 minutes with them back in the kitchen they came back out tough and dry.  They were nice enough to comp one of our $16 appetizers yet it did not make up for the $42 x2 delayed and overdone steaks!", "author": "Dave D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "Very good view and reasonable prices! Love the sides, oyster Rockefeller, bueno vista wine. Filet mignon was done well also. Would def come back again", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Celebrated our anniversary here tonight. Ordered the asparagus salad, rib eye, scallops, side of mushrooms, and chocolate bundt cake. Previous reviews were spot on: upscale restaurant, unique venue, but not stuffy at all. Lively atmosphere with live piano player singing great songs, food was excellent (literally everything we ordered was delicious-cooked perfectly), service a bit slow and waiter missed a few things, but overall this place is a gem and worth trying out. Prices very fair for a great dinner, live entertainment with a view.", "author": "Elizabeth J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "Go for the view, not the food.\n\n We had dinner while watching a beautiful sunset from the large windows. The food sucks. I had the filet mignon, Ahi Tuna Au Poivre and Roasted Garlic Mashed Potatoes. \n\nThe only item that was memorable was the mashed potatoes: Delicious!\n\nThe main entrees were a disappointment (6/10). Not one person at the dinner table so much as \"liked\" their food. \n\n I wouldn't go back unless it was to grab a drink. Without the view, I doubt it would have such high yelp reviews.", "author": "Zohra A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "This was hands down the most superb dining experience I've ever had. The real reason for this review is the food. The ribeye steak just melts in your mouth and the New York is the perfect tenderness. Mashed potatoes are my favorite food. And to say they have the best ones I've ever had is a big step, but I'm saying it! We were greeted and seated right away with the best view( of course all of it is) and we really enjoyed our time. The bill was 84 dollars if you were wondering for 2, if you have a little extra money, please come here", "author": "Alexis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "I rarely write reviews, but when something like this happens, it compels one to speak out. \n\nSome night ago, I felt an array of emotions. I felt shocked that I was looking Racism right in the face. I felt thoroughly disrespected because all of us - regardless of race, age, sex and sexual orientation - deserve to be treated with respect. I felt outraged that this man told my sister and me that we had to leave because they were full... when they were about to seat a Caucasian couple that had just stepped into the restaurant (without a reservation), after we were turned away. And I felt sadness... that after all this time of our country fighting for Equality... Racism was still, in fact, flourishing. \n\nAnd It was staring my sister and me right in the face, telling us we were not good enough to dine at the Leatherneck Steakhouse.", "author": "Jocelyn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Overall, it was great! Our first time being here. I ordered a porter steak!! Perfect to a medium, and also tired a little of rib eye. \nThe crab cakes is must, so good.\n\nJust want to thank Tan for being so sweet and funny. She was our server with great attitude, smiles, and helpful.", "author": "Marlui A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This place is amazing!!!!! \n\nMy gf and I came to visit from LA for my birthday and made reservations for us. Everything was perfect! The view is great the food great the service was impeccable! Definitely recommended this place to various friends who are visiting SF in the next couple of months and I would make the trip again just to eat here! \n\nI highly recommend the bison, clam chowder and cheesecake!", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "I took my lady here for her birthday. In the past I have  gone to Ruth Chris steakhouse and was looking to try something new.  I've heard great things and of course the beautiful, so let me tell you about the evening.  The restaurant is on the 12th floor of the Hotel with a view of the entire City. We sat against the window and it was breathtaking.  The wait staff , actually the whole staff was extremely kind  and got us seated 20 mins prior to our reservation.  An amazing jazz pianist was filling the room with ambiance and as a drummer myself I was happy to be seated right next to him.  So for an appetizer we ordered mozarella wrapped in prosciutto with a tomato and pesto spread on thin sliced toasted bread. Absolutely delicious!  The wine I believe was the Pinot noir and was very tasty.  They also bring out a fresh basket of bread with butter and a grilled clove of garlic. For our entree we both ordered the filet mignon medium rare. Out of every steakhouse I've been too, this was hands down the best tasting filet I've ever had. It just melted in my mouth. As a side we ordered mashed potatoes and grilled mushrooms. Best complimentary side's. I must say, to top off the evening the price tag was 40 to 60 dollars less than other steakhouses I've ate at. \nThe pianist babe me a free copy of his new CD and the whole night was a blast.", "author": "M A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "I came cross good reviews on Chinese travel website Ctrip. Thought I'd give it a try. The view is fantastic: light-up San Francisco downtown skyscrapers against pristine dark blue sky, so energetic! Other than that I cannot come up anything that is outstanding. Food is mediocre and old fashion. The waiters are polite but got our orders wrong a few times.", "author": "Emmy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-21", "description": "You must avoid the morning manager Denoria since she is SO angry and above all a very unprofessional person to put it mildly. Unbelievable that such a great club employed her. An awful human being with zero people skills!!!!!\n.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-22", "description": "The prices are equivalent to those of other fine dining steakhouses in town, but the service and the food quality just isn't up to par. We went there for a lunch it wasn't busy, yet our service was so slow.", "author": "Scarlet B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Great view and the food is good, I really thought it was going to be better because of the prices, overall the experience was great, service was awesome. Definitely will come in for drinks again.", "author": "Leticia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "I'm here on work travel and always love to get a good steak. I found this place on Yelp. I didnt expect the beautiful view the pianist Jerome Clay also did am amazing job. I had the oyster rockafellow and Bone in rib eye for dinner. Great choice I would come back again. My server Tammy was also great.", "author": "Cliffie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-19", "description": "We loved the restaurant, the food, and the view! Great value for the City except for one thing! \"The Service\" Our waitress was not very attentive to our party of 4. It was my daughters Birthday and I let them know through Open table when i made the reservation, they had no clue? Good thing I reminded her. Once again it was just the service that was lacking! did not feel happy about it when we left!", "author": "Anthony O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I'm feeling it, ladies and gents. Romantic AND patriotic! That's Leatherneck Steakhouse. Seriously, how many restaurants can produce these vibes? If you're looking for a unique meal with satisfying food, solid service, classy ambiance, and an opportunity to learn about our armed forces, then look no further than this hidden gem. Not to mention, Leatherneck Steakhouse offers one of the most spectacular views of the Financial District--probably one of the best kept secrets in SF. \n\nI believe reservations are required. The steakhouse is located in the Marines' Memorial Club & Hotel. You enter the hotel, pass the lobby, then take the elevator up to the restaurant. Stepping out of the elevator and into the dining room, you're greeted by the restaurant bar and a piano playing. \n\nLeatherneck caters to an older crowd. A majority of the patrons belong to the private club (all active or retired members of the military). This amplifies the patriotism you feel when dining here. This also means the furniture and decor are rather outdated. However, I miss that old-fashioned feel; it's tough to find these days with businesses all caught up in the hipster craze. \n\nThe restaurant delivers classic American fare, highlighted by steaks. The menu is short and simple. All entrees include an iceberg wedge with blue cheese dressing (throwback to the '90s!). I ordered the New York Strip (12 oz) while my partner had the Rib Eye (12 oz). We came with another couple so we opted for two sides: Truffle Tater Tots and Roasted Wild Mushrooms & Shallots. We also had two bottles of wine and desserts. All in all, the food was pretty good. My NY Strip was cooked medium with a nice char on the edges. The meat was a faint pink and tender. My boyfriend enjoyed his Rib Eye as well. Let's talk about the tater tots though! The kitchen nailed it. These babies were deliciously crafted cylinders of mashed potato: crisp ridges, creamy centers, golden brown, and irresistible. You MUST order the tots. It's essential, just like a table right next to the windows. \n\nLet's talk about that view now. Please reference my photo. Phenomenal, right? If you ever get tired of staring into the eyes of your date (which I would never!), this view is just as dreamy.\n\nThe service was friendly and professional. It actually teetered on the edge of quirky but it's all part of experience. The final touch to this lovely dinner was the piano playing in the background. Talk about charm and elegance. Can't beat live music like this!\n\nPrices are on par with other steakhouses. After your meal (or before), you can explore the hotel. Each floor, including the lobby, are decorated with glass cases of military uniforms, photos, medals, and exhibits. It's essentially a museum in a hotel. The displays pay tribute to our brave service members who gave their lives for our country. It's truly an honor dining at this establishment.", "author": "Judy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Had a fabulous meal this evening. Steak was cooked to perfection. Service was exceptional. This place is a hidden gem.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "I discovered Leathernecks when looking for a place to have a celebratory dinner in San Francisco. The restaurant is located on the top floor of the Marines Memorial Club, with a breathtaking view of the city. Make sure that you make a reservation, because it is required! \n\nThere was a pianist playing lovely music throughout the night. As soon as we were seated the waiter brought out a bread basket with butter, balsamic and olive oil, and grilled garlic. I highly recommend trying the grilled garlic as a spread on the bread, I was addicted! \n\nThe menu offers a variety of different steaks, as well as some seafood options. All of the entrees come with a wedge salad appetizer which is very tasty. I ordered the 8 oz Filet Mignon. The filet was delicious, very tasty, and perfectly cooked to my liking.\n\nAll of the sides are $8. We chose to order the truffle tater tots and the macaroni and cheese. While the truffle tots were very tasty, the macaroni and cheese blew me away. Must try! \n\nLeatherneck was a great spot to choose for our celebration. We were spoiled with beautiful views of the city and classical piano music, while enjoying great food and service.", "author": "Kerry O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-09", "description": "The food is great, the truffle tater tots are a must! I got the New York Strip Medium Rare but it came out just rare I wanted to have it heated up more but the server never came to our table.   Service wise id give just a start food could've been better.", "author": "Chanel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "We went for the views and bc very close to our hotel.  Views don't disappoint.  Food was fine.  Not amazing, but solid.  Limited wine menu, but had what we needed.", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Nice view and a classy atmosphere for a special dinner. The food? OK but not remarkable. I was hoping for a completely awesome steak but it was really nothing special , a bit on the thin side. However, for SF the price was reasonable so the value was good. I'd go back but maybe just for drinks and appetizers.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-24", "description": "DO NOT dine at the Leatherneck Steakhouse at The Marines Memorial Club and Hotel in San Francisco, CA. They are RACIST. I have been to countless (Michelin Starred) restaurants all over the country. I have never felt so disrespected by a restaurant. My sister and I were turned away. Supposedly, the restaurant was full even though they were practically empty. My sister and I were about to leave, when a couple behind us came in. They asked, \"Table for 2?\" The guy who turned us away answered, \"We can make room for you.\" My sister and I were in shock. Obviously, this never happened to us before. She went back in and said, \"Why was that couple seated and we were not?\" At that point, the man started screaming at my sister. One of his female coworkers was siding with him. Never stepping foot in that establishment again. They can't control who comes in through online reservations but they can control who gets seated through walk ins. If I could leave 0 stars, I would. They don't even deserve 1 star.", "author": "Mariel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "I just want the say thank you to the restaurant staff at Leathernecks! Your food and service were top notch! Thank you for taking care of my wife and I on my birthday! During our dinner I had ordered a half bottle of wine which was excellent by the way...Carmel Road Pinot Noir, one of my favorites!\nAnyway the wine glass had a particular logo, a bulldog with a USMC dog tag around its neck! I thought it was very cool and something one of my brothers would appreciate as a gift! Unfortunately the gift shop no longer sells them and the restaurant had the only ones left! I contacted the restaurant and spoke with one of the managers...Edda Rodrigues! I explained to her my brother was a retired marine living in San Jose but was moving to South Carolina in a couple of weeks and that these wine glasses would be a perfect going away gift! Edda was so nice in helping me get 4 wine glasses to make the perfect going away gift! Thank you Edda! \n\nSincerely,\nGeorge Francisco", "author": "George F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "I give this place three stars because of the poor service by Kazu, our server.  He was not attentive and had poor guest relations skills.  After taking our orders, he never checked on us to follow-up on our needs.  All around training needed for some of the staff here, Including the manager.", "author": "M Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "We were in SF celebrating our 20th Anniversary and were in the mood for steak.  We picked this restaurant and were immediately in love upon arrival!  One thing to mention - when ordering beef, order a level down from what you want, not a huge deal as it was still delicious and much more than I can eat!!  The view is outstanding, the staff is great and the food is delicious!  All entrees come with a wedge salad and the BEST EVER blue cheese dressing you will ever taste!  We ate way too much to order dessert, but were told they are all made in-house.  Also, they have a Chardonnay and Merlot that is specially vinted for them. We ordered the Merlot and it was very good!  There are memorabilia in the lobby for history and military enthusiasts.  All around a great and unexpected find!  This is a MUST for a romantic dinner with a GREAT view of the city!", "author": "Beth V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-19", "description": "Decent food, decent view. Really poor service. Our server Helga was not helpful, did not offer a dessert menu, did not come back for further drink orders, dropped off check without asking if we needed anything further. We literally eat out for 10-12meals a week and this server was horrible. I was hoping for much more. Female bartender was much more helpful. Piano player was much more kind and welcoming. Would not return.", "author": "Jeremy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "The dress code is business casual I was casual... very nice shorts and a Polo my girlfriend was in a dress the people at the front desk looked us up and down completely judging us by appearance alone probably because I am fully tattooed and so is my girlfriend my hair style is different and so is hers... told us we were weren't properly dressed witch ok I get because I'm in shorts  but they were very rude and judgemental and my girlfriend was completely embarrassed!! Ended up at a nicer restaurant spent alot of money and didn't get judged at all!!!!", "author": "Randomm W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "Food was a 4 \nView was a 10\nServices 5\n\nThe view was stunning \nThey also had a man playing a piano that was pretty romantic. \nGreat vibes overall", "author": "Kristal P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "I had the absolute worst experience today while at happy hour. I'm a due-paying member and while at happy hour I asked to order a salad. Val took my order but then came back 20 minutes later to say it was too busy to get me a salad, meanwhile the couple next to me was just served a salad. I tried to talk to her and she just said sorry abruptly and left! It was very strange. Then I tried to order one in the dining room and they told me they were completely full as we were facing a near empty dining room. Very rude staff...out of control.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-15", "description": "Leathery tough steaks!  Like chewing on rawhide. \n\nNever trust a place with a view. And avoid a place with lots of bad reviews. \n\nLong wait to be acknowledged after we were seated.  Long delays between courses.  No checking back to make sure everything was alright. Long lag in entree delivery time. Our fellow diners found their food got cold while politely waiting for the final person's entree arrival. Steak was med-rare but very tough. No matter what the cut of meat, other diners found the meat to be tough.  No water refills. 15 minutes sitting with empty plates after finished eating. Overzealous pushing of desserts when we just wanted to leave and be done with the whole fiasco.", "author": "tout le monde a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "This place is some kind of marine club, but open to the public with a reservation. Try to reserve a table by the window, though you get a decent view from everywhere. The views are spectacular. There is a very nice bar area. A piano player added great ambience. We ordered champagne, the large filet mignon, a ribeye, and sea scallops. Also, the truffle tater tots and macaroni and cheese. The chocolate bundt cake had sold out. Service was wonderful. The meal started with a bread basket presented with grilled garlic, butter, and balsamic with oil, followed by a large wedge salad. My scallops were served over arugula and were delicious. We all thought our meals were fantastic.", "author": "Cathy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "First time in San Francisco. This is a romantic but casual steakhouse. The You'll find it to be alot more quieter than most high end steakhouses in the area, more likely due to it being located in the Marines Memorial Hotel and with a older 50+ crowd that patronize the restaurant. \n\nThe view is spectacular, the food was great, and the service was on point. The jazz pianist   made this even a more classier experience. If you want a no frills classy steak house experience this would be a great place to visit.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "I came here for dinner with my coworkers and we all enjoyed it a lot! To start, the bread was really good, especially the roasted garlic spread yummmmm. Very pretty views, but also a lot of older people when we were there, 6pm on a Tuesday night.\n\n\nDrinks- We brought our own wine, and the corkage fee was $20.\n\nAppetizers- We started with the crab cakes which I liked a lot, especially the mustard aioli type sauce (4/5). We split it between 3 people and it was plenty to taste.\n\nFood- For the main dish, I spilt the filet and scallops with my one coworker. The filet was really good and juicy and cooked perfectly medium rare (4.5/5). I wasn't a huge fan of the sauce on the scallops though, and they seemed a tad overcooked, but that part could be wrong. I wouldn't get them again though (3/5). For sides, we got the truffle tater tots, which were good but I was honestly too full to eat them (4/5) and the mac and cheese (4.5/5), which was probably my favorite thing that we ate.\n\nOverall- I wouldn't chose to come back here again, but if someone wanted to go then I would join.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Food:\nAmazing!! One of our favorite foods is steak so we can be overly critical at times. However, Leatherneck impressed us. We ordered rib eye and filet and both were sooooo good. I'm sad to read that others didn't have this same experience because these really blew us away. The flavor and quality of the meat were fantastic and they were cooked perfectly. We ordered a side of mac 'n cheese and mushrooms and both of these were delicious as well. With your meat, they include a wedge salad that was full of flavor and a nice surprise since other steakhouses rarely include anything with your beef entree. They were generous with the dressing as well which is different than some places that leave you eating plain lettuce after the first few bites. Also, they bring you bread with butter, roasted garlic, AND olive oil and balsamic. I loved that we got to enjoy all of them!\n\nService:\nThe service was great as the waitstaff were friendly and prompt without making you feel rushed or that you were waiting too long. One of us ordered a drink that was forgotten, but it was okay.\n\nAmbiance:\nThe interior is beautiful and has such a lovely view of the city. We came early and were able to watch the city transform as the sun set. There was live piano music which was a nice touch. The only complaint was that we sat in the very back by the window and there were fruit flies. I'm not sure where they were coming from as there was no reason for them to be there but that did put a damper on the evening.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Great view. Great steak. Great value for an upscale restaurant in downtown San Francisco.", "author": "Lee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Amazing! \n\nBeautiful view. Fantastic service. Excellent food. \n\nHad The BEST experience here Friday night. Our waiter gave us recommendations on what to order and was so helpful. We chose our meals based off his recommendation and we're so glad we did! \n\nPerfect restaurant for a romantic dinner with a city view.\n\nWill absolutely be back.", "author": "Haley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Really enjoyed Leatherneck Steakhouse! We went tonight for my husbands birthday. We started with the calamari. \n\nMy husband had the filet mignon and I had the prime rib, we shared the truffle tater tots and the asparagus with hollandaise sauce. His filet mignon was great and my prime rib was very tender.\n\nTh hollandaise sauce was a little to cheesy for my liking. The tater tots were amazing! The steaks came with a salad that were very fresh! \n\nThe waitress was very nice and attentive. \n\nOverall, it was a great restraint- the lighting was a little to dark though.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "Terrible service.\nVery slow.\nNot friendly staff.\nWe were waiting for a frontdesk guy for 10 minutes. And after that he refused to serve us because my 70 years old father looks not enough good for them.", "author": "Ilya C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "went here with my boyfriend, such a romantic/sophisticated setting. there was a live pianist when we were there as well which made it more romantic. there is also a dress code. service was great and so was the food, the crab cakes were SO GOOD! my boyfriend doesn't like seafood and doesn't like crab at all, but he actually likes crab cake now because of this place! crab cakes and french onion soup. we got steak, fries, and mashed potatoes (i love steak with mashed potatoes) but clearly the servings on that were huge! lol tasted great. my boyfriend had asked for a celebration cake for our anniversary, but when they tried to use the icing to write out the words, they said that it was too liquid-y so they prepared a makeshift cake for us w whipped cream and a candle on top instead- which was still amazing and tasted great! perfect placement for this restaurant as well. great for a special occasion/date night!", "author": "Jazmin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "Breathtaking view. Get a window seat. Service was lacking as our food hit the table while we were still eating apps and the apps that we were done w didn't get cleared. However, the server was polite and was quick to provide when we asked for something. Wine list was small but adequate and steaks had good flavor.  We had the ice cream sundae and bread pudding. I would not recommend those. The bread budding had an anise flavor which is very strange fir a bread pudding. Coming from New Orleans, that was not at all what I was expecting. Overall, I would go out of my way to go back, just get dessert somewhere else. Worth the price based on the food, views  and live music. Very enjoyable.  Near JW Marriott so very nice if you are staying there.", "author": "Nikki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "My girlfriend and I came here on a dinner reservation for our anniversary. Upon entering the restaurant located at the top floor, the first thing I noticed was how dimly lit the lights were. I went to the front desk to check in and I guess even with a reservation they don't reserve window seats. It was fine we ended up waiting for a window seat to open up and it was worth it.\n\nWow the view from the restaurant was amazing. It almost made the food taste better. My girlfriend ordered the prime rib and it was delicious. The meat was very tender and juicy. I ordered the steak and I can't say the same about it. It wasn't anything special and I definitely will be ordering the prime rib next time I come here.\n\nThe service was great. Our waiter was very tentative. He did not bother us too much but he always seemed to be there when we needed something. The dimly lit lights, beautiful city view, and the pianist playing music in the background gave the restaurant a real nice ambience. Overall my girlfriend and I had a wonderful time here.", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "I loved this place. You have a great view of the city. The staff was great and it was air conditioned, which helped since outside was humid.  I had the steak and it was so tender and juicy it melted in your mouth.  My husband had the mussels and he loved it.  Visited the Library over all i recommend this place for dinner you will not be dissapointed", "author": "Susie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "Definitely a cute place for date night. For some reason it feels so much higher than 12 stories up. We felt like we were in a high rise. The food was great, I had the rib eye and it was cooked properly. The wine list was smaller then expected but had solid options. My 3 stars are because of how slow the service was. The staff was really friendly but it took forever for someone to say hello, take our order, check on us, clear our plates, and present dessert options.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "Great experience\n\nThis military members only steakhouse and bar is a great way to have a lovely meal and a great view.", "author": "R P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "I wanted to take my family here for my birthday with my ailing father who fought in Vietnam as a MARINE and show them the beautiful view and the hotel. It was literally the hottest day San Francisco has ever had at 106 degrees so I called ahead to see if shorts were acceptable. The hostess was EXTREMELY rude and said absolutely not. Okay, no problem.. We got some nice slacks on my dad and a polo shirt. We get up there, mind you we had reservations, and had to wait about 20 minutes before anyone even spoke to us. Eventually the hostess came over and said she would go look for a table. I noticed two women in shorts at the bar and another woman that walked into the dining room with shorts on when the hostess wasn't there. She comes back to tell us VERY rudely that they have a strict dress code and my dad wouldn't be allowed in because he wasn't wearing long sleeves! I couldn't believe it! He was wearing a collared shirt and nice dress slacks! The hostess obviously has no CLUE what business casual is and when we pointed out the other people that were in shorts, ripped jeans etc,. she very rudely told me that she was only talking about us. We ended up going to the Italian place next door and spent a ton of money. Thanks for honoring the men that have served our country by making us leave. Whoever the hostess was that was working on September 1st at 6pm needs to go through a customer service training asap.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "5 stars because this place supports VETS.\n\n5 stars because of impeccable service\n\n4 stars for the unimaginative but well executed food. \n\nAre you looking for solid, well priced, american food with great view?\n\nThis is the place!  I have had many business dinners have and have impressed every time.", "author": "Spanky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Fine Dining! Dress appropriately! It's worth it! No gym clothes, sneakers or tank tops!  Business casual ok.\nWe made a reservation and didn't realize the dress code. Thankfully when we got there we were able to change the reservation to later in the evening. Love our military and supporting them! It was truly our best meal in San Francisco in the 3 times I've been there. The prime rib and rib eye had that slight crackle finish and delicate meaty goodness. The seasoning was perfect! The steak came with a wedge salad and a nice bit of blue cheese dressing. \nStarted with their complementary bread, oil and vinegar (yum - good quality Balsamic), roasted garlic head (wow!). We ordered the Prosciutto wrapped mozzarella-\nSo good!  Although the tator tots and Mac n cheese are amazing, we just didn't have enough room in our tummy's to fully appreciate them. We will be sure to stop by again when in San Fran. Truly the best steak and prime rib we've ever had in the city!", "author": "Kris -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star: I walked there.  I'm not sure about the parking situation. No wait.\n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n1/1 Star: service was ok. Clean. The view has a lot of potential, bur there is a lot of glare on the glass at night. \n\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n2/3 Stars: the prime rib was good but nothing special. \n\n_____\n\nOverall Experience\n\n4/5 Stars \n\n_____\n\nLast Words\nFeels like a secret place.", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "Waited for 20 minutes for the wait person, even asked the bus person. No sign. Will keep posting. Latest update. Hungry now. Disappointing so far. Table that was seated next to us was served 15 minutes after we sat down. Waittress finally showed up. Gave order and Food finally arrived faster then the service. Rib eye was mediocre. For the price the steak was like a petite size rib eye. Salty. It looks better than it tastes. \nWife and daughter shared a prime rib. Little dry for medium cooked. Son had filet mignon, small in size. He was still hungry afterwards. Plus was the views and dinner rolls. Not happy, but i think the waitress was glad we left. Oh well. Time to find another restaurant.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-10", "description": "It was disappointing. I have the utmost respect for those in the military, but this restaurant left a lot to be desired, especially considering the price points. \n\nMy favorite parts were the live piano player and the views. Both very good. Although, they sat us right next to the piano and it was hard to hear each other at times. \n\nThe service was okay. It took them a while to greet us when we arrived. It then took the a while to serve us. They then brought me the wrong drink and messed up my salad dressing. \n\nThe food was tasty but the portions were small and the presentation was a little sloppy. \n\nThe decor was very dated. Last upgrade looks like the 80s. Needs a facelift. \n\nI doubt I will be returning anytime soon.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "Steak was below par. (Flavor and desired doneness). Had the fish with saffron sauce. Sounded great but it was terrible too.\n\nSkip this spot...", "author": "S J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Awesome place to get a great steak dinner.  Recommend the new York with sautéed mushrooms and onions/ and their potato tots.  Great drinks at bar as well.  Recommend reservations and it is business casual dress code.", "author": "J N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "This is a late post.  The company I work for was here for AAMOS in October.  We had dinner here and everything from start to finish was great.  The best service, apps and my filet was delicious.  Perfectly cooked to order.  I highly recommend the crab cakes and the Mac n cheese.  The tater totes were good, but a little salty. Some days you can't reserve due to not being a member, so call first!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "We had a birthday dinner here at 7PM & it was just wonderful. The place is on the top floor (so use the elevator unless you prefer the 12 flight of stairs). \n\nThey gave out bread, butter, olive oil, vinegar & roasted garlic cloves for starters. \nUp next we had lettuce w/ diced tomatoes & blue/goat cheese salad (quite filling)\n\nFor the main course, I ordered the medium rare prime rib, & it was pretty decent. Nothing too special. It was a clean cut & came w/ a horse radish sauce on the side. \n\nOverall it was a great way to end the night w/ a surprise cheese cake for the birthday boy (though the cake itself was a tad too sweet for my taste). \n\nEverything was great at the leatherneck. The service was on top of everything that we had asked for. Food was delicious, & everyone had a great time. \n\nThough next time, I would ask to be seated next to the windows, because the night view of the city light looked exquisite!", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-09", "description": "Restaurant is nice but the workers are awful. Especially the manager and host. I have been here several times for business meals. what is the most disappointing. When i was leaving the restaurant I asked to confirm my upcoming restaurant for January 12th . I was told the restaurant was now going to be closed for a private event and all reservations were cancelled. when asked why wasnt  i notified the grouchy nasty man told me \" i dont know and cant help you\". Appalling and bad business. You lost my business an my companies.\n\nTheres are too many restaurants in the area. Pass on this and go elsewhere", "author": "Christine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "I would recommend this hidden steakhouse. The view from the twelfth floor is awesome. The food was delicious, I had the 6oz. Fillet it was cooked perfect. Our waitress was great, I would go back again.", "author": "Mary Jo K M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "Old school charm and sophistication. Great steaks and appetizers. Amazing views. Superb service. Classy decor. Military and civilians alike will like it for many reasons. The ribeye was cooked perfectly. The oysters were delicious. They have clothing restrictions; which adds to the atmosphere.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "What a hidden gem! If you're looking for old-school steakhouse with an amazing view, you found it! We came for my birthday and made reservations the day before. We came in at 7pm on a weeknight, and the place was not very busy. We were the youngest people by 20 years-- but we never mind that! To our delight, there was a pianist playing tunes. We were seated right by the beautiful windows, and had excellent service. The food was great. I had a steak and poor no-red-meat boyfriend struggled between chicken and the veggie dish-- he landed on the chicken and was impressed! Definitely recommend for a nice date.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "One would be hard pressed to find a better value steakhouse.  The steaks are high end and cooked perfectly without the high end prices of Ruth Chris and Mortons.  The views of the city are second to none. They have a solid wine list.  Jerome at the piano tops off the whole experience.  You wont be disappointed.", "author": "Marcus A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-21", "description": "We were here last night and I wish we had a better experience. The night started off fine, we ordered drinks and the oysters Rockefeller were delicious. However, after we ordered our food we never saw our waitress again! Someone else brought our steaks and sides and told us she would come by with the sauces for our steaks but alas the sauces never came and to make it worse our side dishes were freezing cold! For half an hour no one came by to check on us. When we waved someone down they said they would send our waitress over but she still never came by. We were finally able to flag down our waitress and ask for the check. We had to catch a show down the street so we didn't have time to talk to a manager. For such a hefty bill I expected better service...We were really looking forward to this dinner and it was so disappointing.", "author": "Tay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "A classy steakhouse restaurant located in the Marine club hotel near Union Square in San Francisco.  This restaurant is certainly under-reviewed, if not under-rated.  Perhaps thanks to it locating inside of a hotel, not a lot of non-hotel guests tried it or perhaps hotel guests don't bother to write reviews.  Regardless, dining at this place implies you will be listening to some live piano melody during your stay and you don't need to raise  you voice to hold a conversation with your companions.  The restaurant has very good service.    The waiters and waitresses are attentive, with the right degrees.  In terms of food, you won't regret having the crab cake as an appetizer: ample crab meat cooked to perfection.  It does serve some 25 days aged steak if you preferred those along with the \"standards\": filet mignon, porterhouse, sirloin, ribeye, etc.  steaks are well cooked; nothing too dark, grilled or over cooked.  As for the desserts, they are all house made and you won't go wrong with their cheesecake--a very favorable sour-- to draw the period for your meal.", "author": "Edison T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "This is a very classy steakhouse in the nob hill area. I was looking for a steakhouse in the area and was pleasantly surprised to find this one which also came with a great view of the city!\n\nIt's on the 12th floor of the Marine's Club building and the customer base seems to be older, white folks so don't expect a very hip vibe but do expect an old school, classic steakhouse vibe. This means chairs come with clever, unnoticeable wheels so you can easily slide in and out of the table. This made my life a lot easier when I was stuffed at the end of the meal and I could leave my table with ease!\n\nThe food:\n\nRib eye (12 oz) - Perfectly charred on the outside and cooked medium rare, just the way i like it. I'd say not as good as other steakhouses i've been to but its definitely up there. \n\nTater Tots - Get these! Not like other tater tots in that its not ground potatoes but I think they are mashed potato tots. So they are super light and crispy on the outside. Ask for extra steak sauce so you can dip these in it.\n\nPrime rib - Very good, obviously not as good as a place like house of prime rib but It was pretty damn good, very flavorful. It didn't come with any au jus but you can ask for the horseradish sauce which complements it well.\n\nTIPS - \n1) Ask for sauces. I recommend the steak sauce and the horseradish sauce. They will gladly give you more than one if you ask. \n\n2) When making the reservation, ask for a table next to the window. We made our reservation the night of so we had to take what we can get.\n\nOverall, i'd come back for sure! This is a great place to go on a romantic date. I think the food is reasonably priced and you can't beat the views.", "author": "Sheena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Where do I begin.\n\nWent to the bar to order our drinks while we waited, bartender was extremely friendly. Older couple next to us seemed to be regulars as they conversed w/ staff on first name basis'. Great to hear. When our table was ready, our host did something I've never seen. He took my girlfriend's drink off of the bar top and walked it to our table. Then, as I was about to grab her chair for her (no really, I had planned on doing this!) he quickly grabbed it and opened it as she sat. Then immediately opened and placed her napkin on her lap. Now, keep in mind, we don't visit top notch restaurants often, but having experienced this before we even looked at the menu. EXCELLENT.\n\nThen we looked up....... WOW. What a view. Great view of the San Francisco High Rises, as night lit up. Exactly what we were looking for. With such an awesome view and impeccable service thus far, we couldn't wait to order. \n\nShe ordered the filet mignon medium, came out very juicy and perfect! I ordered the ribeye. Awesome! same as the filet just a bigger cut obviously, juicy and perfect. We had a great time here and will definitely be back.\n\nBe aware there is a dress code listed on their website.\n\nVisited November 2014", "author": "Johnny Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Fantastic meal and experience. Wonderful cocktails. Very intimate and quiet location on a Friday night where other places were packed to the rafters with crowds. \n\nI loved the surprize salad with blue cheese dressing. Very tasty. \n\nExcellent dessert to round off the night", "author": "Vee B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "Christmas Eve found my wife, son, and I at the Leatherneck Restaurant. Located on the 12th floor, it offered a good nighttime  view of north SF. The atmosphere was nice with some live music (thankfully, not to many Christmas songs). My wife had the chicken dish, my son the prime rib, and I ordered a petite fillet. The food was good, but not outstanding. Especially disappointing were the wedge salads (stale lettuce) and dessert.\n\nMy fillet was cooked at a perfect medium rare, but I think the meat had an odd texture, almost like tenderizer had been used. Our server, Anthony, did a great job and was upbeat and efficient.", "author": "MC B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-30", "description": "The view is amazing, the food is fantastic, but the host and busser made feel less than welcome.  We went here for my Son's 16th birthday and took 2 of his friends.  The host asked us if everyone was dressed up.  Very insulting.  He could have looked without the comment.  We asked the busser for a clean fork and he said \"sure\" and never brought it. We asked the busser for more water and he said \"sure\" and never brought it.  I guess when you bring teenagers here they dont appreciate your business.  We had steaks all around with apps and multiple side dishes.  The savung grace was our server Tammy.  She made us feel like she was happy we were there.  Maybe she can teach the others about customer service.", "author": "Dave V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "The view from this 12th floor restaurant was incredible.  The food was delicious but the staff seemed off.  Almost amateur?  Everyone enjoyed the food though.", "author": "Lisa Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-05", "description": "They did no accept us. We were 5, the restaurant was empty and they accepted maximum 4 people since the kitchen would be soon very crowded, but not before an hour or so! That is a SHAME for a restaurant", "author": "Charles D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Great location, top floor with an awesome view. Food never disappoints me. This is a place I plan to visit often.", "author": "Xiao Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "I love old fashioned spots. And the view is gorgeous. And the piano. It even plays itself after the pianist goes home. So awesome.\n\nMy NY Strip was perfectly seared and salted. I loved the buttermilky salad dressing. \n\nEven our bottle of pinot noir was great.\n\nAll in all, we had a stellar experience. Good place to celebrate. Bring your folks. Go!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Amazing city view! Great prices and really good food! Strongly recommend the filet mignon. Friendly staff and great service.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "Everything was \"okay\" like an Outback Steakhouse on the 12th floor of an hotel. My salad came with a creepy crawler - in which no one was apologetic about. Our wonderful waiter Anthony took care of us as I told him they needed to buy me a drink to get over the trauma ;) The manhattans were strong albeit in a smaller than usual glass. I had the petite filet Oscar and the filet was the fattiest I have tasted and definitely not medium rare. My husbands New York strip was good. We tried the truffle tater tots which were very delicious. We've had better food and views for the price. I wouldn't go back and wouldn't recommend amongst so many other fine dining choices.", "author": "Jackie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-04", "description": "The food was alright. The food didn't blow my mind or anything, but the reasonable prices and the exceptional view make this place still worth going to. \n\nThey won't guarantee you a window seat (as one of the hosts rudely explained to me since I wasn't a member at the hotel, equal opportunity needs to be given to both groups if the situation arose). We got seated in the middle aisle of tables and still had a wonderful view. It'll just be awkward because the people with window seats will feel like you're staring at them the entire time. As for dress code they have, they don't really enforce it. In other words, I felt stupid for getting all dressed up because when we got in the elevators with people in t-shirts shorts and flip flops they were also seated no questions asked. There is a piano playing in the background which is nice and romantic, if you're into that kind of thing. \n\nTook someone here for a special surprise birthday. We both ordered the prime rib, mine medium rare and his was medium. The meal started off with a wedge salad, which was alright. Their caesar dressing was a little runny and honestly I hate having to fight for my salad when I'm already hungry in the first place. Like my date said \"wedge salads are just the restaurant being too lazy to cut it up in the first place.\" \n\nThe prime rib was served simple with a few greens on the side. The steak wasn't anything memorable or mouth watering. The steak comes with a complimentary sauce, if you don't request one you want, they'll give you the horseradish sauce by default. The side of mac n cheese we ordered was actually more memorable than the steak. It was cooked and then covered with breadcrumbs and then put under a broiler. Just how mac n cheese should be done.\n\nAll-in-all: the view made up for the average food and service. I feel like this place is a little try hard. Like an outback or a black angus putting on their parent's high heels (for the view) and tux (for the trying to be classy part).", "author": "Erika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "Very good food. The steaks should be a little more tender for the price, though they're still very good. The bread is amazing.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Great gem I had not known about. Beautiful view, elegantly styled with an old SF flair. Service was great and steaks were wonderful. Prices were fair to the atmosphere and quality.", "author": "CHARLES N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "I hesitate to write a review of this place in hopes that people will never find it. Even the line cooks can cook meat like executive chefs and the views are some of the best in San Francisco.\n\nI was here for lunch on a Wednesday and there no problem getting in. They have a dress code (collared shirts and no \"loud pants\"), but are not priced like they have a dress code. They were out of the rib-eye sandwich (one of my staple lunch items) so I tried the S.O.S. which is a San Francisco Fresh thick slice of sourdough with a poached egg on top and Chorizo Gravy with kobe flat iron cutlets.I don't know how many years this place has been here they have made sure the food is top quality, and that's what matters to me.  \n\nThe service was okay for lunch, I mean it's no Rotunda, and the mexican who served me could have probably attended a few more customer service classes but he was nothing to complain about.\n\nI cannot wait to get back here and try the elusive steak sandwich!", "author": "Andy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "Horrible food the lamb we ordered was cold thebison that was supposed to be medium was rare. Overall poor experience.", "author": "Jakis P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Fantastic food and service. Love the military heritage and decoration. I would definitely go back here again.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "This place is the quintessential \"old school steakhouse.\"  Service is good but relaxed, food is top quality and classic.  If you want some modern fusion asian foodie thing, don't come here.  This place feels like you stepped back to 1964. The military decorum only adds to the old school atmosphere.  Drinks are classic and strong just the way a marine would have them.  Stop into the bar and there is a good chance you'll overhear some great war stories. This place is real gem that feels decidedly from a different time.", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Took my daughter here for her 18th Birthday dinner. It was a Thursday night & we made reservations on Open Table. We were staying at the Marriott in Union Square which was right around the corner.  Although we didn't have a window seat, the fog had come in which impeded our view anyway.\nThe piano player added to the ambiance. \nThey started us with bread (would've been better warm), roasted garlic (delicious) along w/ butter & olive oil. We ordered calamari as an appetizer & clam chowder & French onion soup. Apps were good & both soups were generous bowl portions. We both ordered the filet which was cooked perfect & I ordered a baked potato which was huge! It came w/ all the fixings & my daughter ordered the garlic mashed potatoes which was very good. \nWe were in food coma when they gave us a surprise chocolate mousse with a candle accompanied by the piano player. Service was great too!\nWill definitely be back, hopefully we'll get a clear day.", "author": "Cheesecake D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "Pros: online reservation, good meat quality and quantity, nice view.\n\nNow the cons.\n\nThe barman that gave us drinks before dinner was grouchy to us for no reason.\nThe place wants to be sophisticated without succeeding. The servers were not professional (ours opened the wine keeping the bottle on our table, which is the first thing they teach you NOT to do).\nThe truffle tots (or whatever they were) didn't have any actual truffle, just truffle-flavored salt.\nThe ladies' restroom was a complete mess.\n\nAll this said, the prices were ridiculously high for no real reason.", "author": "Xavier R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "The staff are friendly and seem to want you to have a good time. Great service, an astounding view and a pianist playing just added to a wonderful experience.", "author": "Mariam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "I really like Leatherneck because of its consistency, ambiance and scenic views.\n\nThe restaurant is located on the top floor of the Marine Memorial Hotel, and as such has a dress code.  It's not a super strict dress code but I like to look nice sometimes so this is as good an excuse as any. No t-shirts is pretty much the general rule. If you're going to wear jeans make sure they look nice.  I'm unsure as to why anyone would complain about this, go elsewhere if you can't show some respect and look decent.\n\nThe food is good, not great but for the price, the view/ambiance and the service that's good enough for me. The stand out item on the menu is the truffle tots, order them, they're like little fried mashed potato chunks. Service is polite and efficient. The place has a wonderful view of downtown SF, and there's a pianist who plays beautifully.  \n\nThe place was just renovated in January, 2015. It's a bit more modern than it was before but it's still got a classic vibe.\n\nI suggest taking guests out of town here for dinner or drinks, just for the view and the fun of dressing up.", "author": "Margaret I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Reasonably priced and great service! LOVED the crabcakes! Family came here for lunch and the entire staff waz very accommodating", "author": "JaxAlani W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Great steaks good service and awesome sundae. \n\nBut not the fucking greatest.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "My husband and I were in San Francisco to see Beauty and the Beast. We were looking for a good place to eat while in town and used Yelp to help guide us. \n\nA lot of places closer to the theatre was booked but we were able to get a reservation same day here. I'm so glad we did because it was great!!! \n\nVery traditional fine dining place but didn't have a stuffy atmosphere. All the veteran decor gave us such a good feeling dining there. \n\nWe started in the bar for a few drinks while we waited for our reservation time. The bartender was very friendly and made great drinks.  \n\nWe transferred to our table and we had an amazing view of the city. We got the crab cake for an appetizer. Very good with great flavor. We each had the filet for dinner. It was cooked perfectly and we really enjoyed the sauce. The waiter was friendly and visited our table enough times where we felt taken care of but not swarmed. The prices were what you would expect from a nice place but not overpriced. Very reasonable for the type of food you receive. \n\nThey had a piano in the corner playing modern music which was fun and different. Great background music. \n\nI can't wait to come back to SF to try it again!", "author": "MISS S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "Exceptional view (the restaurant is on the 12th floor of a hotel)\n\nService was nice but very slow.\n\nWe ended up ordering a steak and a burger with fried calamari as a starter. The steak and the burger were ok, however, calamari looked like fast food quality and taste.\n\nA bit expensive for the quality of food.", "author": "Yuksel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "We had a small dinner party here on Saturday night which everyone enjoyed very much. We made 6:30 reservations for a party of 5 and were fortunate enough to get a window seat. The view of downtown skyline is terrific especially at night. The restaurant is on the 12rh floor of the Marine Memorial Hotel. \nTammy, our waitress was great and took good care of us.\n\n I ordered the rib eye steak which comes with a salad. The sides are a la carte, I chose the wild mushrooms with shallots, the tater tots, and asparagus. The sides are $8.00 and serve 2 people. We also ordered a nice bottle of house merlot- $30,00 which was very good, My partner ordered the pork chop which I needed to send back for more cooking but everyone else enjoyed their meals, Dessert was bread pudding which also was tasty. \nThere is also evening piano music which makes the evening much more special. Service was terrific and they never made us feel hurried or rushed.\nEverything was top notch and I would like to come back. The prices are very reasonable for a steakhouse.", "author": "jack d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Our dinner was 5 stars. Stunning views of the city, attentive service, and the food was amazing! Highly recommend!", "author": "Saule G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Fantastic food &  service...  scenery is unreal. Anthony was our server && he was phenomenal. we shared  a ribeye &  passion fruit cheesecake!", "author": "Maggie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-03", "description": "Very disappointing service. They sat us and we saw no server for 15 minutes, while a table that sat down 5 minutes after us was served right away. We even saw 2 servers visit the same table 3 times all while we were sitting waiting for 15 minutes. I had to ask the bus boy to find our server while he was preparing the table behind us. The manager came over and took our order and did give us a free glass of wine. Nice. But this restaurant only had maybe 10 tables occupied and 3 servers. Why they couldn't get organized as to who had our table is a bit confusing.\n\nFood was decent. We had the crab cakes and they were delicious. Wedge salad was decent enough. My wife had the scallops and they were only cooked on one side. I had the NY strip and it was ok. When the server brought our entrees I asked for another glass of wine and she forgot it- didn't even acknowledge it when she brought our check.\n\nI would not return here due to the service. Terrible to feel ignored at a nice restaurant by the people that are supposed to do the opposite.", "author": "Corey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "Food was good, I'll give them that. Service was horrendous. That's it. Will not come back. I suggest you keep looking for other steak places.", "author": "Gia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "This place offers scenic views of San Francisco and good food at a reasonable price. It's a nice spot to come for a drink or to enjoy a steak & seafood dinner. If you're looking for a lovely meal without completely breaking the bank, I'd highly recommend it. They usually have a live pianist around dinner time, which is a great touch.", "author": "Corbin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Just had a fantastic breakfast with made to order Omelets, fresh orange juice and very delicious fruit!!  By far one of the best breakfast I've had in a long time.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "I've been wanting to try this place for a while. I have a lot of friends in the military and The Marines is my favorite branch. My hubby who is ex Navy finally took me here and I was happy. Kevin our server was awesome. He was attentive and recommended great options. The view is amazing. Although we didn't sit at a window table (we will next time) we were able to see the city from where we sat just fine.", "author": "Cristina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-17", "description": "Great steakhouse with a better view.\n\nThe restaurant is located on the 12th and top floor of the hotel and we got a table in the corner of the house with a million dollar view. The ambiance is nice and dim as you'd expect from a steak house and the bar right up front is a very welcomed sight.\n\nThe appetizers (calamari, oysters rockefeller, and truffle tater tots) were all delicious. Our table got two filet mignons and two ribeyes (all medium rare of course) and it was phenomenal. Probably the best steak I've had in a long time. We were in a rush because we arrived at 8:50 (and the kitchen closes at 9:00 for new orders) but luckily my friends already knew what they wanted. Our waitress was very helpful and always made sure we were doing just fine. A bottle of red wine to accompany our dinner gives this restaurant a guaranteed 5 stars.", "author": "Jerry Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "I came here after my graduation for a graduation dinner that my boyfriend took me to late in May on a Friday night around 6 pm. Although we had reservations, it wasn't crowded at all and I was able to get seated by the window. This restaurant is located at the top of a Marine Corps Memorial Hotel and overlooks part of the city. You can definitely get a good view of the city life if you're seated by the window. \n\nThe employees are very nice and they definitely provide you with great customer service. The hostess was a Filipina lady and she was incredibly sweet to us. Our waitress was also very attentive and did a great job at explaining parts of the menu that were unclear to us. The piano player added to the ambiance, my boyfriend tipped him at the end of our dinner.\n\nWe got the crab cakes as an appetizer and after, they brought out bread and butter. Before our entrees came out, we were served a wedge of iceberg lettuce with dressing. My boyfriend ordered the prime rib and I got the filet mignon, both of which were really tender and flavorful. We also got roasted garlic mashed potatoes as a side, which was also very delicious. The potatoes practically melted in my mouth and ughhhhhhh..... LOL it just tasted so good. As a dessert, we got a chocolate raspberry pot de creme which was also really good. The chocolate was neither too sweet nor too bitter and the raspberry added a sweet tartness to it.\n\nGreat service and great food!", "author": "Monica P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-06", "description": "Very nice location with overview of bay and s.f skyline.  Friendly staff and courteous service.  \nI had the filet. It was meh. Ask for Medium but came out well done. \n\nOverall. Nice pleasant place to visit.", "author": "John D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "If i can give a negative stars i would. We had our annual family xmas dinner celebration here amd it was the biggest mistake ever.  We had a party of 7. The worst service ever and i even complained to their manager and that was useless since we still didnt get any better service from that complaint. We had asked a server name Ken was standing waiting at the side bar to just take a picture of us that we were right next to him.  He said no he is busy yet he just stood there waiting for the bartender by the time the bartender tended to him we could have gotten 5 pictures already. Another incident with Ken was when my sister asked him while he was by the machine to place orders where the restroom is. Yet the same word came out of his mouth saying he is busy. It doesnt take much to just point straight ahead and say over there. We were served our salad wedges whom requested them and had to wait 10min after starring at the salad since we had no utensils. I went to talk to the manager and he didnt even bother for me to finish talking till he walked away from me looking and then i told him the service needs to be much better. He said he will take care of it. I sat down and nothing happened. I had to actually yell out my servers name miguel and tell him we need utensils. If the manager was going to take care of it and still i had to ask for utensils then i now why the service is bad. Only time i saw the manager come is to place knives at our table before entrée came out. Never did he apologize for the lack of services. Then dessert comes we had to wait 15min after all but one of use getting our dessert. I had to yet again flag miguel our server about the missing dessert before all of us can start. He forgot and said a dessert my bro ordered and it was even wrong.  There were more issues i had but to much to write. I will never set foot in this place ever again. Its very sad that it was our family xmas dinner out to have gotten the worst service ever", "author": "L U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "We dined here on our last night in San Fran and could not have been more pleased with our choice. We got a great table facing the window so we're able to enjoy the amazing view.\nThe steaks were cooked perfectly and the sides were also delicious, we had the Mac and cheese and truffle tater tots.\nThe service was also very good and the menu was prices were very reasonable. \nCannot recommend this place highly enough.", "author": "Freya W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Excellent atmosphere!  I was shocked to find that this place existed on my recent trip to San Fran.  As an inactive Marine I enjoyed the Marine history presented on the first floor.  The dinner room was typical of a steakhouse, but the views from high in the building were spectacular.  Steak was fantastic and the drinks were enjoyable and inexpensive. HIGHLY recommend, especially for my fellow Marines.", "author": "Carlos B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "Amazing restaurant. I don't really understand some of the negative reviews. I took my wife here for her birthday. I made reservations 1 week before and they were ae to accommodate. I was 15 min early and was seated at the window after I politely asked for that seat. \nLet's start with the view..wow! Amazing views of my city. My waitress was quick to ask us for our drink selections and provided phenomenal service through our dinner. The food was delicious (calamari, salad with blue cheese, tater tots, cream spinach and prime rib and rib eye). It was all cooked to perfection. They even sang happy bday to my wife and brought her dessert. \nI really enjoyed the piano playing as well.", "author": "Jesse A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "This is a really nice restaurant with a great view of San Francisco! However, this restaurant was pretty hard to find. I celebrated my boyfriends birthday here and it was a great experience. I made reservations in advance on their website asking for a window seat however we were told window seats were first come first serve basis. If only they've sent us an email to warn us ahead, it would've been great. Overall, food was delicious!", "author": "Helen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-27", "description": "Dress code enforced on my friend for having a tshirt on.  8 people at the bar had t shirts on.  We were turned away.\n\nMenu prices didn't seem bad, however I don't appreciate the discrimination.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Super bomb steak (rib eye, NY strip and prime rib were all delicious)! Their house salad seems home made with light cream and mild, creamy blue cheese (not overpowering). The prices weren't overpowering for steak either.\n\nAnd YES! Truffle tater tots! They're more like tiny vessels of truffled mashed potatoes, lightly fried to perfection. Creamed spinach also perfect (not runny, perfectly seasoned and gooey). Seriously, their food is spot on and simple.\n\nSuper bomb view. And a pianist and musician taking me back to the 1940s.\n\nOverall a really nice hidden gem. It's so quiet, though. Only half the restaurant was in use (probably 10-12 tables total, only 1 large party) and I prefer a more lively restaurant, so 4 stars from me. Not because this place wasn't wonderful, just because I prefer a different kind of ambiance--even though the view is really special.", "author": "Steph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Went here for an anniversary dinner with my hubby.  Great view of SF, the food was great, service was fast and pleasant.  My husband got prime rib,  I had the filet mignon.  Perfection!  The decor is a little 90's but your eye is drawn to the view anyway... Nice bottle of wine, piano music in the background, panoramic city view...ahhh, we liked it !  We'll be back.", "author": "Teresa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "If you want to eat deliciously tender steak with a piano playing in the background all the while looking at a gorgeous view then this is the right place for you. Keep in mind if you arrive and there are a lot of people crowded around the bar you may get ignored by the host so be sure to make yourself noticed. The friendly staff more than makes up for it. Also, it is best if you make a reservation ahead of time.", "author": "Katrina G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-01", "description": "Onion soup: too little cheese, and I barely tasted onion in the soup!\n\nPrime ribs: completely flavorless! Even the raw horseradish sauce isn't as strong as that in House of Prime Ribs\n\nAmbiance: good view of SF if you sit right by the windows. This place was like a retirement/senior home, as the avg age of diners there was probably 80.", "author": "Betty T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Great view!! Top notch service and foods of all types. Recommended to everyone who can make it up there.", "author": "Damian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "After carefully researching SF eateries, my daughter chose this restaurant for her 15th birthday for the beautiful view as well as reviews that they had surprised birthday guests with a desert and song.  Sadly, she got neither, but got very rude treatment at an expensive price.  \n\nShe saved her money (a lot for this age), made a reservation through Open Table, got dressed up, and invited her teenaged friend.  She indicated through Open Table that it was a birthday celebration, and her friend also told all the waiters.  \n\nShe was devastated to be told quite unapologetically during her dining experience that she'd have to move to a table without a nice view because someone else had a reservation.  She reminded them that she also came with a reservation and that it was her birthday.  They said her time at the nice table was up, regardless of how long it took them to serve the food!  Still, she was forced to move.  \n\nAfter hearing the staff sing happy birthday to a young child there with a family, my daughter's friend once again told the waiter that it was my daughter's birthday, to no avail.  They ordered their own deserts and even asked for candles to use in order to conduct their own birthday moment, but were denied.  Furthermore, no staff member ever acknowledged her birthday in any way!  \n\nMy husband and I were getting texts throughout this experience.  We were so crushed for my daughter and decided to call the restaurant to see if we could alert someone to treat her with more kindness.  We were also spoken with rudely and completely unapologetically.  \n\nThe service was so poor that it didn't matter that the food was reasonable.", "author": "Jill R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "While in San Francisco my husband and I wanted steak dinner, so I started looking around and found the leather neck steakhouse. The view was magnificent the service without a flaw the meal was good would definitely recommend it to anyone", "author": "Kathie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "Atmosphere :\nafter reading the 5 start reviews i was super excited to take my husband to this place. when i called to make a reservation, the gentleman was not friendly on the phone at all, and in fact made a comment that it was only recently that they opened the doors to the public. made me feel like \"wow, this is an exclusive place\". when we arrived i asked for the window table, and was told \"let's see if i have any\" again, with a snobby attitude. from where we were standing the place looked empty, but figured it must be packed behind the piano that had a bunch of old ladies standing around and signing with not so nice voices. \nwhen we were walked to our seat by the host, we were sat right next to the piano by the window. there were PLENTY of window seats along with many other seats. the entire restaurant had maybe 5 tables. it was loud where we were seated and when we asked to be moved, the waitress said she had to check with the host if that can be done. ARE YOU KIDDING ME? \nwhen i called for reservations, i was told there is a dress code. yet when we arrived there were women walking around in leggings. \n\nFood:\nI got scallops. Can someone really make bad scallops? Well, the answer is yes. I needed dental floss after eating my dinner. My husband got a medium steak, and it was medium well, almost well done. Their salad was good: lettuce, salad dressing, chunk of cheese. \n\nOverall:\ndon't bother.", "author": "a b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-15", "description": "Service:  (2/5) The server John forgot our sauces, our mixed up our entrees, and then decides to call us back (a party of 10) out of our way because he forgot to slide the card.\n\nFood: (2/5) The fillet minion is the one to get.  I give that a 4/5.  The prime rib was not very good (1/5) the cut was extremely fatty (35% of it just fat) and it wasn't very tasty as a usual prime rib.  The crab cakes were alright, mac n cheese / tater tots also okay.  \n\nAmbiance : (4/5) The restaurant is the 12th floor of the hotel, and was fairly nice.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "My boyfriend found this place by looking through yelp reviews and we were pleasantly surprised! We actually came here twice for two years of my birthday, yes it's that good! \n\nLocated atop the Marines Memorial Club and Hotel with spectacular views of downtown SF. The staff is super friendly and ambiance is very old-fashioned/sophisticated. They have a piano bar with a set list of songs, creates a romantic atmosphere.\n\nWhat we ordered:\n- Filet Mignon (cooked perfectly)\n- New York Steak (perfectly cut and seasoned)\n- Truffle tater tots (must order, omg it's mouthwatering!!)\n*all dinner comes with iceberg lettuce\n\nTip: If you check in, you'll get a free glass of wine!", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Steak was great and we all commented that the prices were quite reasonable for downtown SF. We were lucky and seated at a window table with no advance reservation. The place had an easy vibe, with a piano player, great view and we felt the service was spot on.", "author": "Dave J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "My Husband and I had a great dinner here, we loved everything about our experience and will definitely be back if we ever return to San Francisco. \n\nThe food is delicious and will not bankrupt you for the rest of your trip! We had drinks, filets, two sides and dessert for around $150 including tip. They serve rolls with butter and an entire roasted garlic that you can spread on the bread...so good! We had the macaroni and cheese and garlic mash, I preferred the mac. We got the berry crisp for dessert which was good but after seeing the bread pudding being delivered to another table I wished I had gotten that.\n\nThe views are fabulous! Well worth it!", "author": "Amber W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "This restaurant is definitely kicking it old-school. They even have a dress code (although it's mainly just \"wear a collared shirt and long non-ridiculous pants\" if you're a guy). Has a live piano and a small bar, and there seemed to be a lot of people who actually were in the service (or just looked that way).\n\nSpeaking of that - It's on the 12th floor of the Marines Memorial Club & Hotel right off of Union Square. You'd basically never know this restaurant were here if not for sites like Yelp. The view is pretty awesome, actually, esp. considering you're really not paying any extra.\n\nWe had the massive iceberg wedge with blue cheese and a smattering of veggies as the salad, along with some bread and veggies with hummus as the \"free\" thing they serve before the meal (side note: what do you call that?)\n\nThe waiter seemed a little rushed, like he was trying to hard, but everything came pretty promptly and the other staff members kept the glasses filled with water, etc.\n\nBut the steak I had (8oz filet) was excellent - cooked medium (as I asked), bernaise sauce on the side and with not a sour note throughout.\n\nPlus bonus points for having a table with no reservation for me and my boss (always good when you can make that happen last minute).", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "Nice little surprise had the new york steak for lunch with french onion soup the views were great and the food was good.", "author": "N A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-21", "description": "I am currently here for lunch. Only 3 customers here. Server is very slow. I got up to use the restroom when I returned the other guest were gone and my server yelled from across the restaurant \"do you want to order anything else\"?  Not the professionalism I would ever expect :(  I ordered the Crab Cake salad...the crab cakes were ridiculously salty :( I had high hopes, but this place just didn't do it for me. I wonder if the dinner food and wait staff would be better???", "author": "Machelle W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-25", "description": "The food is about 3 stars, but the vibe is more for elderly then anything else. We didn't enjoy the restaurant we ate and left immediately. Would not recommend it if you are looking for fun/trendy restaurant.", "author": "Meme V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "The Leatherneck is on the 12th/top floor of the Marine Memorial building/hotel, whcih also houses a theatre, library and guest rooms in addition to the restaurant.  We came with Father in law who is a member of the club, having served in the armed forces for over 30 years.  This restaurant is small in size, and it has a bar as well as dining tables with wheeled chairs  The views of downtown SF are spectacular and the food is delicious.  i had the petrale sole with green beans and wild rice pilaf and everything was perfecrt and tasty.  Hubby had the chicken club sandwich which was equally delicious.  \nGenerally, it's pretty quiet here and there aren't that many people (at least when we came) and most of the patrons that day were older (hence the wheeled chairs).\n\nEntrees/sandwiches on the menu ranged from $9 to $27.  We didn't try the steaks today  but I would imagine they are good since this is a steakhouse and they executed the other dishes quite well.  This is a great special occasion place and I would visit again.", "author": "Bebe W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Last year my wife and I decided to make celebrating our anniversary here a tradition. I must say after a year this establishment doesn't disappoint. Our server Martin was friendly and the food was excellent. The next morning we both came back for breakfast and were quite impressed with the variety of offerings as well as the impeccable service by the staff. I hope to continue our same tradition next year.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "I was mostly satisfied with Leathernecks, but there are some things I would do differently if I were to try this place again. My boyfriend made the reservations a few weeks in advance for our short stay in SF (we live in Reno, NV). We did not think about it when making reservations, but wish we would have thought to ask for a \"window seat.\" We were in the middle, and the view was just not the same! We were pretty disappointed, but we realize this was our fault, not theirs. \n\nIt took them longer than expected to bring us water and a menu, but we soon received our waters and ordered our meal (filet mignon for me, prime rib for boyfriend and mac and cheese to share). The service dwindled from there. I'm not sure if it was our age (25 and 28, much younger than the rest of the crowd) or what, but our waiter was not too pleasant. Very short (no, I'm not talking height!) and only checked on us once. We definitely expected better service.\n\nThe salad comes with bleu cheese, and I'm not a fan. So, I requested ranch dressing only to find out I had two other options: thousand island or vinaigrette. I opted for the vinaigrette. \"Salad\" is served. A corner chunk of iceberg lettuce with some dressing drizzled on top. Pathetic. I had about two bites and didn't finish the rest. Vinaigrette does not go well with iceberg lettuce. I was expecting a GREEN salad with lots of goodies on top. Very disappointing.\n\nSteaks and mac and cheese were delicious. My boyfriend decided to order the truffle tater tots as well after we had received our meal, and you could tell our waiter was not pleased. Not sure what the big deal was. The tots were also very good! \n\nOverall, the experience was okay. I'd go back for a special occasion, but there are some things I've learned! Service makes a BIG difference, but there's little I can do about that! For a pitiful salad and below-par service, just three stars.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "good steak and good table service. the US open of tennis was playing at the bar--very good. However, the bar service was...perfunctory.", "author": "Arvind R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Absolutely perfect.  Went for the steak Oscar and was not disappointed! Loved the piano bar ambiance. Service was great.", "author": "Leah F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-24", "description": "I saw the good rating of this restaurant and decided to take my parents there for their last dinner in SF. I know steakhouses like this usually run out of space quickly so in the morning, I deliberately came to the restaurant and asked if a reservation was needed. They told me no, that there would always be empty tables on weekdays. Perfect.\n\nWhen we showed up for dinner at 7:30pm, the waitress told us that they actually would have a party in the restaurant and they wouldn't take any walk-ins. I was told that I wouldn't need a reservation, but I understand that things change. However, their way of talking just makes my head burn. Both the waitress and the manager were rude and disrespectful, not showing any signs of regret or apology for the mistakes their people made.\n\nWe walked out and talked to the reception downstairs for the hotel, with whom we had a much better experience. Their staff was a lot understanding and helpful, and got us a reservation at a different steakhouse.\n\nI will come back to SF many times but never walk into this restaurant again.", "author": "Henry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "The food and view are amazing.   You can't go wrong here and the hotel itself is a great museum and dedication to our military.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-06", "description": "Came here with my GF on saturday for a nice dinner after a long day at the academy of science.  The restaurant is located on the top floor of the marines memorial club and hotel and the view is spectacular.  You can see clear out into the bay and into Oakland.\n\nWe were promptly seated and the waiter was super nice, the free glass of wine was pretty awesome too.  They bring out a nice spread of stuff to start you off, bread and butter and some veggies and dip.\n\nWe ordered the prosciutto and mozzarella appetizer, it was a little expensive, $9 for a slice of warm cheese wrapped in the prosciutto and 3 small pieces of bread.  It was however delicious.\n\nThe steaks came with an iceberg wedge salad which I didn't really like, it was drenched in ranch and iceberg lettuce doesn't have much flavor to begin with.  Felt like I was eating a fancier version of a cheapo buffet salad.\n\nOnto the steaks, I got the 12oz new york and my gf got the 6oz filet.  First impressions, why the heck did it come with horseradish sauce?  2nd impression, meh.  The steak was so so, on par with an applebees caliber restaurant steak.  Something worth 15-16 bucks, not 30+.  It felt a little dry and while the meat looked right, it wasn't that warm and there was just something off about it.\n\nWhile the service, view and everything else about the dinner was spectacular, this is a steak house and the steak should be the most important part of the meal.  The sub par steak gets this place a 2, but all the other redeeming qualities brings it up to a 3.", "author": "Tu T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Spectacular views and service, you CANNOT go wrong with Leatherneck Steakhouse.  We were fortunate to get reservations for eight people on short notice during Oracle Open World week, and not ony that, reservations with an amazing view of downtown San Francisco.\n\nThe Leatherneck Steakhouse is located on top of the Marine hotel on Sutter street.  When our party arrived, we were greeted by very friendly hostesses and seated directly in front of the window-front view overlooking downtown.  Our waiter was spectacular and provided incredible service throughout the meal.  \n\nOur table ordered a number of appetizers including the tuna tartar, calamari, and cheese plate.  While most of our table ordered a variety of different steaks, I couldn't refuse the salmon. I must say, while our table highly applauded their dishes, I have truly never had a juicier or more flavorful filet of salmon.  It was absolutely amazing.\n\nOverall we were all really pleased with this restaurant, and by the way, if you're waiting at the bar, they have glasses of goldfish as their bar food.  Can't beat the snack that smiles back :).", "author": "Anjali K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "We ate at Leathernecks our first night in town. The food was amazing and delicious. We both had the prime rib which melted in our mouth. Even though we didn't have a window seat the views were still amazing. Definitely recommend this place for a special night out on the town. One thing though even though it says business casual some people were not dressed up at all. I don't think they take that seriously.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "Dim lighting. Amazing view of the city. Piano on the background. This is one of the most intimate and romantic places to enjoy your steak. \n\nAppetizer: Prosciutto wrap tomato basil \nEntrees: Prime rib and petite filet oscar (crab, asparagus, bearnaise)\nSides: Mashed potatoes and truffle tater tots (MY ABSOLUTE FAVORITE! I will come back just for 'em tots)", "author": "Trish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "This is the closest you'll get to Mad Men in San Francisco.  It's my new favorite pre-theater restaurant!  Perfect location in the heart of Union Square.  Not touristy and not a mob scene.  Great views and natural light since it's on the top floor.  Fun atmosphere with tons of stately looking men in collared shirts quickly and efficiently devouring their steaks.  Classic food with innovative twists.\n\nRoasted Garlic: A simple touch that is so appreciated.  Most places don't offer roasted garlic and, when they do, they charge at least $5 for a bulb that was less than 50¢.  Here it's offered gratis alongside the butter and makes for an amazing bread spread.\n\nIceberg Lettuce Salad: Classic.  Included with the steak purchase.  I'm normally anti-iceberg, but there is something retro about cutting into a quarter of a head doused generously with chunky blue cheese dressing.  Granted, this could have been heavenly with bacon, but  the creamy dressing against the crisp watery lettuce sufficed to keep my palate interested throughout.\n\nPrime Rib: I asked for a medium cut and this was more like medium well, with only a hint of red.  Guess the lesson is to ask for a notch rarer than what you desire.  Loved the sides of the cut that were engulfed by crispy fat wafers resulting from hours of slow braising.  The inner meat was too tough for my tastes, but probably more a factor of the aforementioned doneness issue.  Wasn't a fan of the house steak sauce since it tasted too much of cloves, but the béarnaise was exquisite!\n\nTruffle Tater Tots: Best. Side. Ever.  Imagine mashed potatoes mixed with black truffle then extruded and deep fried to look like mini churros.  Don't even dare taint this with ketchup!  I'm shocked that no other restaurant in San Francisco has tried to bootleg this.\n\nBread Pudding: Massive.  Dense.  Full of hearty goodness, but probably too heavy a pairing after a big steak.  Best to share 1 per 4 or more people.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "Food and service was good. I thought the ambiance was just lacking for a steakhouse. We had a seat next to the window but windows were really dirty.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "Mike is a wonderful bartender, with a great personality!  \n\nHmmm, wonder why all of my reviews seems to revolve around bars and drinks.  Wonder if I should be worried.  NOT!?!!!", "author": "Pat G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "We recently spent four nights at the Marine Corp Hotel on Sutter Street in downtown San Francisco and thoroughly enjoyed the wonderful hospitality and friendly, helpful service from the staff at this hidden treasure.  On the last night of our stay, we\ndined at the Leatherneck Steakhouse, located on the 12th floor of the hotel with terrific views of the City.\n\n Upon our arrival at the restaurant, we were seated at a comfortable window table and presented with fresh, warm bread and butter, and a plate of celery, olives, carrots, tasty hummus for dipping,  Our servers, Kevin and Miguel were charming, attentive, experienced professionals.  Upon my request, Keven suggested a bottle of the delicious Napa Valley House Merlot to compliment our Filet Mignon and Prime Rib entrées.  Beef is the restaurant's speciality!\n\nFrom reading the many reviews of the restaurant, the menu item mentioned most was another house speciality - \"blue cheese tater tots\" - so I had to order this dish to taste for myself.  The dish arrived hot and the tasty tater tots were crisp, fresh, and delicious.  My expectations were exceeded - tater tots like you've never had before - were quickly consumed!\n\nAs I'm not much of a dessert fan, I wasn't interested in ordering anything from the dessert menu.  But I soon realized I had to try something on the dessert menu I had eaten years ago in Italy - the Panna Cotta!  Wow, what a delightful, creamy, sweet and spicy taste - one spoonful was better than the last and then it was gone.  I highly recommend this \"oh so decadent\" treat to complete your evening dining experience at the Leatherneck Steakhouse.\n  \nMany thanks to all the Marine Corp Hotel and Leatherneck Steakhouse restaurant staff for making our stay at the hotel an unexpected pleasure.  We so look forward to our next stay st the Marine Corp Hotel this summer.", "author": "A. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "I loved this place, the food, the service, the views!  All stellar!  I am actually afraid to tell everyone how awesome this place is because I may have a long wait next time I try and go LOL...  I had an end cut prime rib and it was off the hook!  Green beans were amazing and I had some amazing glasses of wine - red wine - Chalone I think... Hubby had the filet and he mowed it down.  We also had the truffle tater tots which were yummy.  We went here on Valentines Day and got to sit at a window seat.  We also came here for lunch the day before and had a great salad and pulled pork sandwich.  This place is not well known but it is definitely and A++ place to eat... Valet parking was nearby and not very expensive either... Highly recommended...", "author": "Heather G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-21", "description": "Made a reservation a week ago for 4 . talked to a gentleman left my name just to make the 1hr trip and told they do not have nor can they find my reservations. How disappointing they did try to compensate or offer alternative just gave me there stupid apology. The lady was a complete idiot thinking her apology would somehow make us feel better. What a moron. Will not recommend this place to any of my friends", "author": "R U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Truly amazing view and great food. I was looking for a place near Union square to take the in laws for dinner and found a true gem. I was pleasantly surprised how easy it was to get a table on a Friday night last minute. The ambiance was simple but classy to accompany the view. I would highly recommend for a date night or special occasion.", "author": "Brooke C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-29", "description": "My wife and I went to Leatherneck for our Christmas dinner this year. For the location and quality of the food, the value is phenomenal. The restaurant is on the top floor of a building that sits on the south face of Nob Hill. We had an excellent view of the San Francisco city.  Our steaks were juicy and flavorful. The house Cabernet was also excellent. The dinning room is narrow so on a busy day like Christmas eve, it was very noisy. The truffle tots that people rave about was just so-so. It was made of fried mashed potatoes and lacked the crispy texture of regular tater tots. Go there on a quiet night, enjoy their house Cabernet and avoid the tots.", "author": "Alfred L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "My spouse and I are members of the Marines' Memorial Association and we visited Leatherneck Steakhouse every morning and evening while we were staying at the hotel. We enjoyed breakfast in the dining room and happy hour in the lounge. The breakfast buffet had a nice selection of hot and cold items and the selection changed daily. They also offered made-to-order omelets, but we never ordered one. The servers were attentive and they began to recognize us after the first morning. The lounge was fairly small, but there were some tables set aside for happy hour in the dining room. The bartenders were aloof and they rarely smiled. Bartending is a social job, but they seemed to be more interested in watching television than interacting with guests. However, we returned to the lounge every evening because of the talented piano player, Jerome Clay. He was warm and friendly with a great attitude and he had a smile from ear to ear. He offered us his playlist and he played several songs for us. We will return to Leatherneck Steakhouse because of our experiences at breakfast and with the piano player.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "I decided to make a reservation here for my boyfriend and I's anniversary mainly because of the view. We thought the view was absolutely gorgeous but it didn't make up what was lacking in the food and service that we received. \n\nFor appetizer, we ordered the calamari and there wasn't anything special about it that made us go, \"Wow!\". It was very basic. I mean, it was good, don't get me wrong, there just wasn't anything special about it to make it memorable. For our entrees, I ordered the prime rib and my boyfriend ordered a steak but I forgot which. The prime rib was on the fatty side. I love prime rib and its fattiness but this prime rib was just too fatty. I'd say 35% fat. So I couldn't eat a good chunk of my entree. On the other hand, my boyfriend enjoyed his steak and have no complaints. We also had the truffle tator tots and my boyfriend enjoyed those little tots! Lastly, we had bread pudding for dessert and I honestly don't remember if I liked it or not. That's how unmemorable some of their food items are. \n\nAs for service, I felt as though our server didn't even want to serve us. He gave off a certain vibe that kind of made me feel uncomfortable. Also, I was kind of expecting Leatherneck to greet my boyfriend and I when we checked in with 'Happy Anniversary' or something because I made the reservations months in advance and I stressed that it was our 6 year anniversary so I wanted it to be extremely special. The whole time it was as if we were there like any other night and they didn't really make us feel like we were celebrating. I mean, my boyfriend and I knew but I guess I shouldn't automatically assume the restaurant would put cute little details here and there to indicate that we were celebrating. I feel as if the least they could do was to write 'Happy Anniversary' on our dessert plate. Maybe I was just expecting too much from a restaurant who appears to be romantic because of the view that comes along with it. \n\nAll in all, I wouldn't come back to Leatherneck to celebrate anything.", "author": "Rosa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "I think it is all about. I can't deserve more than anything from any food shop. It should be the best one in this area. Everything was so cute here.\n\nI never forget to order TRUFFLE TATER TOTS. I never thought it could be o delicious!!! Food decoration is also cool and good looking to raise your appetite!!", "author": "Emma W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Looking for a last night in SF treat during my last visit, I wanted to check out a relatively inexpensive steakhouse and the Yelp monocle led me here. Awesome view, super nice service but I didn't like how I couldn't take my meal at the bar. Instead I had to be THAT guy who sits at a table for 2 by himself but aside from that, I had a delicious rib-eye and those truffle tots, holy crap that was good.\n\nBe sure to eat the tots while they're still hot to get that delicious truffle oil taste and hot crunch. Once they start cooling down, they start losing their properties of awesomeness.\n\nThe view is actually so cool that I could see the floodlights at the stadium in Oakland that night for the Raiders game.", "author": "Andre L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "My husband and I came here for lunch. This was not only a great lunch, but a great experience.  There is a lot to see as well as having a great meal. The staff was all very nice and friendly.  We sat at a table next to the window and enjoyed the beautiful view.  Lunch was delicious!! I had the half sandwich and salad. I also ordered the french onion soup which was wonderful!!! When we were finished with lunch, we went to some of the other floors to see the history that was on display.  It was very nice to walk around together looking at all of the displays.", "author": "Kori M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-12", "description": "We were here on a business dinner, there were 6 of us, we had reservations and arrived 5minutes early. The check in receptionist/greeter was probably the unfriendliest woman we have ever met. She told us the table was not ready, and then disappeared. No smiles, no \"would u like to grab a drink at the bar\" just very unfriendly. I recommend she work on her customer service. \nThe view here is spectacular and I think you come for the view, the food was OK. 2 people in the party had steak, both complained it was cooked to death despite asking for medium and explaining to our waitress. \nAt 10pm this place closes, the lights get turned on, despite there being about 6 other tables still finishing off, they started setting the spare tables for breakfast, talk about killing a mood. I'm not sure why they did this? I understand shifts ending and the need to prep for the next day, but this did feel very very odd.\nA warning, the female bathroom was dirty. Which makes you wonder about the kitchen. No one had checked the bathroom that day, and there was paper towels on the floor. Pretty poor standards I think, and surprisingly so. \nWould not come back. For the money you can find somewhere so much better", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-19", "description": "We found the restaurant to be very quiet with excellent views of San Francisco. We ate at the Seasons a couple of days before and I can honestly say that the steak is far better at this restaurant. Cooked exactly the way you ordered it (RibEye & Filet). The Iceberg Wedge with blue cheese was surprisingly excellent and the Bearnaise sauce is fantastic. The Oysters Rockefeller is exquisite.\n\nService was among the best I have had in SF. The ambiance is similar to a what an officers mess in the military and the attention to detail shows. Best steak restaurant we visited on our 5 day trip to SF.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "Wow!  This steakhouse is so affordable compared to many in the City.  They give you so many lil appies when you sit down, nice breads, dips, crudite and butter of course, with some mighty tasty baked garlic.  We totally enjoyed!\n\nWe each ordered steak and again were amazed at the prices:  $28 for small 6 ozs Filet Mignon and NY Steak.  Both came with wedge salads which define the rich and gooey pleasure of blue cheese \"ole school\" dressing.  We even popped for an amazing rich and creamy Panna Cotta with pear topping dessert, coffee and a nice bottle of Cabernet wine.  \n\nWe really feel that the prices are subsidized overall by Marine's Memorial being a membership club.  Anyone can eat there though, and I do suggest reservations as we were there promptly at 5:15pm and they were already full for the evening.  The piano bar is a nice touch and the views are incredible!  \n\n~Ms. Ali", "author": "A W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "Got in and the temperature is set to somewhere in the neighborhood of 50 degrees. Even though we called ahead and requested to be sat by the window because we were celebrating a special occasion, they told us those tables would be first come first served when we came in. We both ordered the prime rib medium rare. This was extremely dry and served without auju sauce. It took forever for us to catch the attention of our server for this. Confused by the high ratings because we won't be dining here again.", "author": "Zeal B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-04", "description": "The food here was great. We had the clam chowder and ahi tuna for starters. The clam chowder was okay and the tuna tower with the crab and avocado was delicious. \nFor the entrees, I had the 10 ounce prime rib and the fettucini and rock shrimp. The prime rib was good quality and tasted better with the steak sauce. I liked the fettucini better. The mix of shrimp, mushrooms, tomatoes and chard was delicious and had a slightly tangy taste.\nIf the night had been clearer, the view of SF would've been much prettier.", "author": "Kristy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Best price for a steak dinner in the area. Food was good. Atmosphere is a little odd, mixed croud of old and young, hostess a little spacey.  Members just walk in and take tables.  They stick to their funky dress code. Along with reservations, they told us they only had availability for two at 7:45 so we took it, yet as we ate, there were at least a dozen table that were never used.\n\nWould recommend for a good steak at a good price.  Just be aware of the odd atmosphere.", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-25", "description": "Love this classy restaurant with beautiful views! We ordered the absolutely delicious and scrumptious Roast Herb Chicken....it's heavenly! And the Roasted Sea Bass\nis so very tasty and wonderful!....Go ahead and try something other than a steak!\nThe iceberg wedge salad with ranch dressing, which comes with each entree, is visually pleasing and delicious.\nAnd to top it all off, a yummy warm Raspberry Crisp with\nice cream and orchid (to wear later) is the crowning end to a special meal!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "My friend and I came here yesterday night for her birthday after she made reservations a day prior. We had hoped for a seat near the window, but from our knowledge, you cannot specifically reserve tables because they run on a first-come-first-serve basis. Also, make sure to dress formally- you will get turned away for not complying with the dress code.\nMy experience with the food was okay. We enjoyed the calamari for appetizer. I got a salad which tasted really terrible. I had ordered my prime rib medium-well and I guess the waiter heard medium-rare. It was also mostly fat. My friend had already requested a new entree after they put sauce in her burger even though she explicitly requested no condiments so I was too shy and was scared that we would seem too \"high-maintenance\" if I asked for my food to be done longer. That was my mistake. Also, when she got her burger and told the waiter she didn't want sauce, he said that she should've told him as if it was her fault, even though I clearly heard her ask for no condiments. She said her burger was okay. We got the warm berry crisp for dessert and enjoyed it. I wouldn't be able to tell you if the prime rib was worth the money because I didn't get to find out myself. \nNow here's the part that ruined the entire experience for us. We were trying to enjoy our meal and fortunately were seated by the window and were enjoying the view, but within less than an hour and a half the servers had asked us if we were done at least three times. We started getting frustrated with their impatience because it was her birthday and we were only trying to have a good night like everyone else there. I had noticed that the tables around us were not having this problem with the servers, not even the people behind us who had been there even longer than us. Eventually, a server came up to us and said that there were reservations for our table coming in a few minutes. We were ABSOLUTELY furious. Another lady quite rudely came and told us we had been there for an hour and forty minutes (we had been there for an hour and twenty minutes) and must either leave or move tables as if it was our fault that we had eaten longer than they hoped we would. I have eaten at reserved tables for three hours before but was never \"timed.\" We hadn't even had dessert yet and didn't want to leave so she stubbornly moved us into a corner away from the window even though there were many other open tables closer to the window. We were so angry. We made reservations like everyone else. We were paying lots of money just like everyone else. The server told us once again that there was an hour and a half time limit (which didn't seem enforced at any other table but ours). I told the server that if I knew our dinner had a time limit we wouldn't have came. I feel like we were the youngest group there (we were both minors eating alone) and that maybe they thought it wouldn't be a big deal with us. We both feel utterly disrespected. Also, my friend had written a note that it was her birthday on the reservation online. We both explicitly told them multiple times during the dinner that it was her birthday. But they never said anything. However, someone at a different table got sung happy birthday. Our requests had been ignored as if they didn't want us in there any longer. \nI have been to cheaper places with better experiences. I had high expectations and this restaurant wasn't even close to meeting them. NOT AT ALL worth the money. We could have enjoyed our night a lot more at any other restaurant and not have to pay nearly as much as we did. If you are hoping for an enjoyable experience that isn't rushed or rudely interrupted, then this is certainly not the place.", "author": "S J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "We were a bit unsure when we first walked in as the bar is the first thing you see and it didn't scream refined steakhouse. But, we were ushered past the bar and into the main dining room which was very nicely decorated for Christmas and we were able to have a window table with a great view.  A piano player added to a really nice casual, classy ambience. Our waiter was very professional and unobtrusively attentive throughout the evening.  We had the filet, the New York strip, and the chicken and all were just about par with Ruth's Chris.  We ended our meal with the bread pudding which was delicious. Will definitely recommend this restaurant to any friends or colleagues traveling to San Francisco.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "Party of 6 - everyone thoroughly enjoyed their food, our service was great, and the view (as many reviewers share) is breathtaking. \n\nDinner rolls were accompanied by roasted garlic - so good.\n\nFilet mignon was wonderful, cooked perfectly, everyone cleaned their plates. Ice cream sundae is huge & basic & delicious - we shared two of those and a berry crisp for dessert. \n\nAmbiance is hard to beat - loved the live piano music, the view (as mentioned), the lighting, and the Christmas decorations.\n\nOur 2 hour dinner flew by. We will be back!", "author": "Angelica Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-19", "description": "WARNING! Grab your reading glasses because I'm about to go off!!!!! \nYelp, if you were real I would kick you in the teeth! \nI took my girlfriend to San Francisco for valentines day, I thought this would be a nice place for dinner since it had a view, WRONG! \nThe day of valentines, I called just to check on our reservation; I wanted everything to be perfect. While on the phone with the \"hostess\" (an older Asian lady)  I ask, \"Is this a romantic place\" WHAT? she says,  I repeat \"I'm bringing my girlfriend and we never been there so I was just seeing if this place was nice for a romantic dinner\" she replies rudely, \"well it depends on what you consider romantic\". \nI'm speechless, I was just looking for a little validation that I made a good choice in picking Leatherneck Steakhouse. \n\"Well do you think this is a good place to bring a date for valentines? Do you have candles on the table or anything?\" \nIn a very rude annoyed voice, \"Well it all depends, I'm not sure what you would\" \"DAMN IT, JUST FORGET IT!!!\" I interrupt her\" JUST FORGET IT!\"  and I just hang up on her.\nRight there, I should have just said forget this place, but, its valentines and everywhere else is booked! So I stick to the plan. \nWe arrive at Leatherneck which is inside a hotel and proceed up the elevator, I notice that there are quite a few elderly people milling about. My girlfriend who is in her mid 20's is dressed sexy, like a girl who is in her mid 20's. I'm dressed in sports jacket and nice shoes etc. So we take the elevator up to the 12th floor which seems like a cool ride,  a ride that would build the anticipation for a romantic evening. \nWell when the doors flung open we unknowingly step out of a time machine into the year 1968! \nNow I was not there, but I imagine 68 was just an ok year, it wasn't \"the year of romance\".   As we walk in we I see the old ass, rude lady and rather than me wag my finger in her face and tell her about good service, I simply give her my name and we proceed to our table. \nI am in shock, \nAs we walked to our table (like in the movies)  the music stopped, and the entire room looked our way with mouths open.  A woman, head down, about to put soup in her mouth, dropped her spoon in her soup and it splashed in her face but she didn't blink an eye, her mouth was open and  she stared at us in disbelief. \nOK, OK, now that really didn't happen, but it sure felt like it...\nThis place looks as outdated and tacky as saying \"bling\" do describe shiny jewelry. It looked like an old raggedy lounge in the back of an Arizona bowling alley where  they threw in  tables and chairs and called a \"steakhouse\". I mean, I'm not rich, but I have been to some nice restaurants in my time, this place wouldn't rank as decent. \nIf you added up the age of every person,  the average would be 70ish \nI kid you not, the men had long eyebrows and looked like Andy Rooney from 20/20. I love older folk, but this was not the scene I was looking for on a date.\nFirst of all, the chairs had arm rest and rolling wheels, I assume that is to help the older people to get in and out from the table. \nAnyways, we sit down and the music starts and people go back to eating and talking,  I notice we are in the middle isle of the restaurant, that spectacular view of the city, we get no part of. \nMy girlfriend is giving me \"the smile\", the this place sucks sweaty balls but I'm going to smile and act like I'm happy, smile. Immediately  we see a couple leaving the coveted table by the window area and I beg our waiter to move us, he was very nice and says he will see if we can move. He walks over to the manager and I can see them talking. I'm thinking in my head, please please lets us move there. I notice the manager peak over at the two of us, then proceed to shake his head. I was optimistic and thought, \"maybe hes saying: NO problem, move those nice people at once!\"\nNot a chance, the waiter comes back apologetic, saying he cant move us. \nFive mins later, another couple comes and sits in the prized window seats.\nI'm really unhappy and so is my girlfriend. We are sitting in this center isle with people buzzing by us on both sides; like a table in the middle of the sidewalk downtown NYC. So as the manager walks by, I asked him why we couldn't move, he replies, \"we cant just move people\" , in the most rude tone ever and walks away!  This was suppose to be first come first serve and we had not even ordered, It would have been no consequence to move us. We decide to just leave. I give the manager a good lashing on the way out!! To conclude my essay on leatherneck steakhouse, if you are under the age of 40, read my entire rant, and you still dine at Leatherneck, you may want to seek Therapy from a board trained, highly qualified Psychologist or MFT! \nI have done my part, I have warned the masses, I have returned with the tablets from high among the clouds,  the commandments read.. Thou, shall not steal... and don't eat at Leatherneck \"steakhouse", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "WARNING ! ! !\nMy review is below, but here is a warning for certain folks. \nThis is a living memorial, in honor of Marines, and all the branches of the Armed Forces, it is not a hip hop club, or trendy spot.  There is history in all the walls, and a lot of it is walking around, a lot of elderly folks with great history, and of a different generation when respect meant something. So conduct yourself accordingly and be prepared for the ambiance. Yes the view is incredible, make reservations and be polite, the lady at the counter is older and has been working there forever, which is nice to see people not get tossed to the curve because of age, so be polite, most restaurants worth your while show that kind of loyalty, try the Basque cultural center for example.\nOk the steak is not the greatest to you, but for the price and view, good luck finding better. However to me it becomes the greatest steak simply on those merits alone. But it is delicious. \nLASTLY, have a little class when visiting, this place honors servicemen and women, there are Generals, Dignitaries, I sat across from a former Secretary of State, there are police officers in uniform, federal agents, E-1 through Admirals, and spouses of fallen Hero's etc.  Please Show some culture, education, and class unlike that clown that posted a one star bellow. What a troll. David C.\n\nMY REVIEW...\n\nWait staff is incredible, The food is delicious, although I have sent back my steak a few times because I like it medium rare, they get on it, and deliver perfection each time. ( I eat here frequently for business, and pleasure ) The price is very affordable. Selection phenomenal, the wine ( leatherneck wine ) delicious, ask for the port wine, not on the menu. The piano player is excellent. OK the VIEW IS INCREDIBLE ! 5 Stars. you would pay 250 down the street at Morton's for half the food, and not as good a steak, without a view. over here for two with wine, you are looking at half that.", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "I'm assuming this is the lounge on the 12th floor.  We've come in for cocktails, especially during happy hour & for breakfasts in the mornings.  The staff is top notch and the view is gorgeous.  If you're in the area, make sure you stop in & check it out!", "author": "Judy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "Definetly a 5 star experience.\n\nThis is a private club, but allows the general public to eat.  The dining room is on the 12 floor with a beautiful view of the bay from the wall of windows.  We decided to reserve for the sunset, but unfortunately it was a very foggy evening.  But what the hell?  This is after all San Francisco.\n\nWe ordered the 16 oz. prime rib and split it.  Spliting charge was $5, but this included 2 salad wedges with very good blue cheese dressing and crumbles.  After reading about the truffle tater tots we ordered them along with asparagas with hollandaise sauce. The warm rolls were fantastic.\n\nEverything that was said about the potatoes was right on. Absolutely delicious crispiness.  The asparagas was totally tender and yummy.  The prime rib was done perfectly with a slightly salty crispy rub.  \n\nThe service was friendly, attentive, and professional.  Water glasses were constantly refilled and several times the waiter and maitre de stopped by the table to ask if everything was okay.\n\nI would suggest this hidden gem to anyone who wants a unique and memorable dining experience in the City.", "author": "Bradley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-25", "description": "My husband and I stayed at the Marines Memorial Club and Hotel and this restaurant was on the 12th floor of the hotel.  We ate here twice during our trip.  The first time we went, the food was great and the service was wonderful.  The filet was juicy, cooked to order, and came with a delicious sauce.  We shared a side of mac and cheese that we loved.  The Bailey's Cheesecake was a great dessert to end the meal as well.  \n\nThe second time we ate dinner there, I was less impressed.  My steak was cooked to medium well, not medium, and our server was less attentive (it was also pretty busy that night, so he had a lot going on).  Overall, the food was still yummy, but not the same quality as what we had before.\n\nThe restaurant itself is quite nice with a really pretty view of the city lights, even if you aren't at one of the tables right by the window.  I would go back again and hope to get the same experience as our first visit!", "author": "Gina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Thank you to Edda (the manager)! She was amazing! \n\nAnthony was a great server - attentive, informative, and sweet. \n\nGreat view. Awesome food. \n\nA must visit.", "author": "Maria F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "Wonderful experience and delicious food. From the view of SF to the entree the meal was excellent. The bread and roasted garlic was the perfect starter. The rib eye was cooked to a perfect medium rare and seasoned well. I would definitely recommend this wonderful gem to anyone. The romantic setting was wasted as I was dining with a co-worker on a short over night stop. Do yourself a favor and have a meal here.", "author": "Chad G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "The Pros:\n- great view\n- reservations not difficult\n- affordable drinks\n- good house wine\n- prices were pretty good\n- truffle tater tots were awesome\n\nThe Cons:\n- spotty service \n- filet was dry & cold\n- prime rib was off tasting\n\nso overall, the service and food taste will be sacrificed for a great view and a more economical and lower quality meat.  Without the view, the steak isn't worth the price.", "author": "Carrie-C N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-26", "description": "Every so often, you stumble upon a relatively unknown (to you) type of restaurant that you end up loving. Then you leave and find yourself torn between shouting out its praises, or keeping it a secret so it doesn't turn into one of those places that you need to call three months in advance, or promise your firstborn son to, just to get a reservation. \n\nTonight that is precisely what happened to me and my group of five. \n\nNo, I hadn't given away my yet-to-be-conceived firstborn. We happened upon what is clearly one of the best-kept secrets in the city. Who knew there was a steakhouse in the Marines' Memorial Club that could rival Alfred's in San Fran, or Smith & Wollensky in Manhattan, or Luger in Brooklyn (or for those of you who like chains, Ruth's Chris and Morton's)? Unless you are a retired Marine, sailor, or soldier, you probably wouldn't have known, either. (For the record, this restaurant, and I believe the hotel in general, is open to the public. So there's no need for you to enlist just to get a juicy steak here!)\n\nThe food was excellent. We feasted on several appetizers, not realizing how sizable the portions were. For our entrees, our group ordered t-bones and rib eyes, each of which were seasoned, seared and fired up to juicy perfection. Coffee and desserts were equally amazing, and I highly recommend the raspberry crisp and the bread pudding. \n\nService was friendly and efficient. Our server was very attentive and came back repeatedly to refill our water glasses and wine goblets, also to check if our food was to our liking and if we needed anything. The hostess also came by and talked to us for a few minutes before she moved on to the next table. She's like your grandmother or your favorite aunt whose smile warms up any room and makes sure you're eating well.\n\nAnd the view! Whether you're a long-time San Francisco resident or a visitor in town for only a week, you'll love the sweeping view from the 12th floor, which is high enough to see the top of the Trans Am building, yet still low enough to see people walking on Sutter and nearby Union Square. \n\nI see Leatherneck as a good place for business dinners, birthdays, anniversaries and other special occasions. But you can also go there if you just want a quiet dinner of juicy steak with a bottle of red wine. I think there are three dining room sections where you can dress up or dress down as you wish. \n\nWe'll definitely go back to this place the next time we're in the Bay area, next time I'm booking a table for dinner around sunset.", "author": "heidiologies g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-20", "description": "Out of 12,678 restaurants in San Francisco, how and why did I choose this one to go to on our first night of our weekend in S.F.?? If this had been an Apprentice task, Donald Trump so would've fired me.\n\nWe made reservations for 7 pm and were promptly seated (cuz the restaurant wasn't even poppin'). The views that the website boasts about? Well, if your idea of a dazzling view is  looking at the tops of buildings and their A/C units, well then you are in for a treat here! Our drink orders were taken, brought to us, and then our server all but disappeared. We had to flag him down to order our appetizers. Crabcakes were forgettable according to my boyfriend, my friend's proscuitto and mozzarella was equally forgettable and my French onion soup was just ok.\n\nEntrees were blah. My sirloin steak had too much gristle - gross. My BF's New York strip was boring and my friend's shrimp fettucini was way underseasoned. At least the garlic fries were good!\n\nService was atrocious. Where were these servers hiding out at?!! The place wasn't even busy!! Oh my Lord, and don't even get me started on the piano player - the music was nice - but then some old broad sat next to him and started singing \"Wind Beneath My Wings\" at the top of her lungs. FML... This was one of those experiences where you're thinking you would've so been better off going to TGI Friday's and ordering a steak with Jack Daniel's sauce and a jumbo Long Island Iced Tea.\n\nPass on this!!", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Found this restaurant on Yelp and visited during a recent trip to San Fran for my boyfriend's birthday. This restaurant did not disappoint. I got the filet and it was cooked perfect and my boyfriend got the salmon. We got the tater tots and mac n cheese as sides and the mac was definitely our favorite and the tots were unique but tasted good. The view is incredible and what earned this restaurant 5 stars. The restaurant wasn't crowded at all for it being opening night after a large renovation and had a different ambience than I am use to but still overall a great experience and would recommend to others.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-08", "description": "View was beautiful on a Sept eve, but food not so good. Chef does not know what med rare is, sent steak back and still not right. We like bulldogs, but come here for drinks, not dinner.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-26", "description": "I love to be surprised in a good way.  Leatherneck Steakhouse knocked my socks off!  When I heard the name, I immediately thought it was some funky place in the Castro.  I'm just sayin'.  \n\nTurns out, it's on the 12th floor of the Marines Memorial Club (near Union Sq.) with some of the best dining views in the city.  'Leatherneck' is the adorable bulldog mascot whose likeness sits in the lobby and dots everything from the silverware to the table decorations...love!!\n\nFood is old school...iceberg wedges anyone?  There's a pianist most evenings and a bar filled with interesting conversations of war exploits from all eras.  Just get your best 50s vibe on and roll with it, because the steaks are awesome and much more reasonably priced than Morton's or Ruth's Chris.\n\nI've been back for lunch and that's another treat...on a clear day, the views are phenomenal.  The atmosphere is calm, service is very sweet, and you'll find yourself thinking that you'd fit in better if you just had a martini in your hand...\n\nOh, unlike the snooty Olympic Club next door, non-visitors are welcome to dine and even (gasp!) to stay in the hotel.  More on that awesome experience in another review.", "author": "rhonda s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "\"This is the life\" my father expressed while drinking a complementary (as guest of the Marine Memorial Hotel) Gin and Tonic staring out at the beautiful San Francisco cityscape from the 12th floor of the Marines Memorial Club.\nIt's often difficult to see the Forrest through the trees when searching for restaurants on Yelp. I was looking for an experience, not just a decadent food or a well-reviewed restaurant; specifically I wanted an amazing, classic view of the city in an upscale restaurant that had traditional ambience.  Yelper Adam B's description, \"the closest you'll get to Mad Men in San Francisco\" for me sealed the deal like Don Draper as I often long for the bygone era (minus the messy social issues) of sorts, well at least to enjoy with my father in his heyday. My family has been staying almost exclusively at the Marine Memorial Club for years as it's my father's favorite hotel in San Francisco, especially as a retired USAF Colonel. It only seemed fitting that I'd take him for a nice dinner upstairs. \n\nMy brother and I both started with the out of place for a steak house appetizer shrimp and scallop ceviche served \"up\" in a martini glass loosely wrapped in a leaf of butter lettuce. The ceviche was fresh, cilantro loaded and surprisingly spicy. After a few bites my brother and I looked at each other simultaneously and frowned, \"Do you feel that?\" I asked. Gulp. \"Ahhh! Fire! Hot! Hot! Hot!\" We'd both gotten an unexpected bit of habenro realizing we'd overlooked this crucial little ingredient on the menu. \n\nLeatherneck is a steakhouse so I felt somewhat obliged to order, well, a steak - the 6 oz filet and for my brother, the miso glazed salmon with Asian vegetables. As expected, both of our meals were delicious along with the super rich truffle tater tots we ordered as a side as all sides are ordered separately and come family style. Despite feelings of culinary regression, they are totally gourmet tasting of rich, earthy, gooey mashed potatoes encased in a fancily deep fried shell. I could only eat two. \n\nService was impeccable, our waitress was most attentive and I'd expect nothing less of a steak house serving proudly atop a hotel that exists as a living memorial to the USMC. \n\nPS - Leatherneck has a dress code and in an age with increasing casualness, I was excited to don my new salmon hued, drapey, belted H&M dress with classic black satin Max Azaria sling backs. Most of the other patrons were smartly dressed as well, men in jackets and such, except for the distracting man at the adjacent table wearing a baggy velour tracksuit! Is this 1999 and can I ask him to leave, he's spoiling my ambience?!", "author": "Renee S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-18", "description": "Very nice view but doesn't have a very captivating atmosphere... The furniture and decor is very old and worn down. Food is just okay. Not the best steak place I have been to. However, the price meets the food quality expectation. I think the cost is more $$ than $$$.", "author": "Clairy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-04", "description": "I would actually give it 3.5 stars. The .5 star if you dig a retro old school look which I sort of dug after a few drinks. One star deduction for making us gentlemen wait after a reservation made weeks in advance and another star deduction for less than average ambiance.  Service was average - could have been better and food I would give it slightly above average.  It's sad considering the phenomenal location and the spectacular view of the city it offers.  Give it a try though and let me know your thoughts of the restaurant.", "author": "Karol S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "great service, great view, and the food is even better\n\nso glad we randomly found this place\n\nstarted with drinks to enjoy the great view\n\npuree of veggie soup to start was simple and delicious - the way a puree should be made - sans cream\n\nour steaks were cooked perfectly - petit filet for the wife w/ mac n cheese and 12 oz ribeye w/ shrooms for me - we both loved our mains w/ the sides - these are high quality steaks (my ribeye was tender, marbled but not super fatty and packed full of flavor) at a fraction of the cost you pay at other spots \n\nwe cannot wait to come back", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-24", "description": "Nice looking restaurant with great views. I came here wearing a Hugo Boss sweater, Seven jeans and D&G white shoes. The waiter turned me away from the main dining area because I wasn't dressed for appropriately for the floor. She sat me in an dead area with no other diners. I walked away after sitting for a few moments feeling disrespected.", "author": "David C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-06", "description": "This place is the definition of Meh.\n\nOnly thing it has going for it is the view of the city and I like the fact that its supports the marines. And most of the people were either in the military or vets. The bad part is that the service was HORRIBLE, food was mediocre, and the decor is boring.   \n\nThe place is definitely a time warp. I'm pretty sure they are stuck in about 1962. The average age of the guests that come here is about 105. There's nothing wrong with that, but I don't think it's my scene, I also think that's the reason the food is so bland. \n\nI ordered the miso salmon, which I could have made at home, my friends got the prime rib, and filet mignon. They all said it was just ok, not worth the price. \n\nThere are way too many amazing restaurants in San Fran. Stay away from this place!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "Any place that offers complimentary alcoholic beverages to its hotel guests during happy hour deserves five stars!\n\nSemper Fi!", "author": "Jay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-06", "description": "The best part of the restaurant is undoubtedly the view. The prices for lunch are very reasonable, especially considering the location. But the food is nothing incredible. Dinner is definitely more on par with other restaurants for dinner, but I'm not sold that the quality is. I got the sea bass and it was so salty I was chugging my water.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Love this place for the breakfast buffet and happy hour. As a regular guest of the Marine Memorial Hotel, you can't beat the happy hour (great selection and complimentary for guests of the hotel). It also has the best State-side hotel breakfast buffet I've ever had.\n\nHaven't yet had dinner here. I'll need to run out of all the other places in SF that I need to try before I have breakfast AND dinner in the same place.\n\nSECRET TIP: The servers are hustling to take care of everyone during the often busy happy hour. I've found a great system. A generous tip up front triggers the 'bottomless glass' mechanism so you don't have to fight with the crowd. Shhhhhh, it's a well-kept secret.\n\nSemper Fidelis.", "author": "Kirt W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-30", "description": "This place is definitely overrated! Waiter was rude, french guy! Wait was long even with reservations and food was cold. Steak cold and macaroni and cheese was boiling... and there clam chowder sucked! Everybody up there was stuck up and rude! Didn't help explain our menu until we were done with what we ordered, really? Come on, we did ask before! View was nice but service and most plates were bad!", "author": "Mario S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "First time here! The truffle fries are PERFECTION. Crispy, delicious, not too oily, I was in heaven!! Delicioussss!\n\nThey were out of prime rib and two people in my party wanted it, so they were disappointed, but the truffle fries, mmmmmmmm lol", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "*Total San Francisco Hidden Gem*\nThis was a complete 5 star experience. We went here for my dad's birthday and reserved a window table, which I would highly recommend. The view is great. Between the food, service, and piano player, which added a fun and elegant element to the evening, I can not have asked for a better night for my dad's birthday. \n\nP.S. There were even Marine's there...since, ya know, it's at the top of the Marine's Memorial Building.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "My husband took me here for my birthday. We had to park across the street and pay 15 bucks for parking, but it was worth it, imo. When we went in, they told us it would take two hours to get a seat, but to my surprise, we had reservations. Unfortunately, a big group was having a party there and it was really, really loud. That ruined the mood for me a bit. The server was really nice and even gave me some wine to sample since I didn't know which one I preferred. The view was exquisite, and the food was delicious. The tater tots were out of this world. I have never had tater tots like that before. The prime rib was delicious as well. We had the passion fruit cheesecake for dessert. It was a bit sour for us. The sauce kind of overpowered the cheesecake so I didn't like it as much.", "author": "Pika C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-05", "description": "The first time Yelp has let me down!  The decor, service, food, music were a time trip to 1974 - good if you like that kind of thing.\nThe wine list was a paper sheet with 3 Cabs - terrible.\nThe food was awful.  We had a prosciutto wrapped mozzerella that was disgusting - the meet was gray, the cheese too thick.  The cesear \"prepared traditionally\" had no anchovies and the lettuce was gross.\nThe truffle tater tots sounded awesome - they were instead over-fried pieces of potato with zero flavor.  The service was very poor.  The hostess at one point came over to make sure we knew the restaurant was in honor of the military - she tried to name the branches for us, but couldn't remember them!\nAwful.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "The food was great are server was very attentive and not to mention its probably one of the best views in town I definitely recomend going here", "author": "Justin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-22", "description": "One of those diamonds in the rough restaurants in SF.\n\nAwesome view, food and reasonable price. What else can you ask for.  Chopped salad was great. Steak was perfectly cooked.", "author": "Tristan U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-18", "description": "My fiancée and I had a 7:30 reservation on a Saturday night. We showed up at 6:50 but, even though we were early, they got us right in and sat us at a table by the window. The food was delicious (and very affordable) and the view was amazing. The live pianist was extremely talented and personable. He played unlimited requests (I think he played 6 of our requests) and made a point of talking with everyone who came in and left and greeted the regulars by name. For dinner I ordered the petite filet Oscar and it was perfectly cooked and tasted amazing. We also had the truffle tots - definitely a must try! Admittedly, the service was a bit slow. However, we weren't really in a hurry, particularly because we were enjoying the live music and the view, but it could be an issue if you had somewhere to be after dinner. Definitely stop in the bathroom - it has a surprising amount of character! Overall, this place has a level of elegance and style that is hard to find anymore.", "author": "Moira R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-14", "description": "For old people. Good view. Meat is good. But everything else seemed pre-made hours ago. The crudités at the beginning of meal was so dried out. As soon I saw that they served us dry ass jicama, I realized I didn't have to be proper.  The ahi tuna tower was bland. The filet mignon was cooked to order and pretty good. So was the mushroom side. Dessert was panna cotta. It tasted like it was made yesterday. Otherwise, good service. Dinner came out to 160. Wish the food was better.", "author": "Kasey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-19", "description": "Julie M was either high or at another restaurant than the one I ate in last night with my friend. The views were fantastic! One can see the East Bay and the Bay; the ball park, part of the TransAmerica building and a commanding view of the Union Plaza area, altho you can't see the plaza itself.\n\nThe atmosphere was warm and charming, with live piano music, nice linnen and fantastic service. Meals include a nice set up of bread with soft butter balls, a cooked garlic glove and fresh veggies/olives with a pimento cheese dip. \n\nWe had the Ahi tuna tower and the oysters rockefeller to start. B loved her tuna with avacado and crab. I enjoyed the oysters, but the spinach was a little stronger than the rest of the dish.\n\nI had the Alaskan halibut, which was very tasty and tender. B's steak was cooked perfectly and seasoned well enough that nothing was needed to top it. For sides we enjoyed the chard and I do highly recommend the truffle tater tots. Really tender inside with wonderfully crisp exterior and a perfect hint of truffle.\n\nFor dessert, she got the chocolate pot, a mousse with cherreis and topped by whipped cream. When our server, Cynthia, lit up when asked about the bread pudding, I was sold. It was warm and delish with whipped cream on top. I wanted to marry this dessert.\n\nThe service was very warm and attentive and not at all rushed, which was great as B and I had a lot to discuss. A nice meal shouldn't be any less than 90 minutes, so I seriously suspect those who complain about how hard it is to get their servers attention! There were plenty of people to assist any of our needs.\n\nI suggest a dinner reservation to allow for the watching of sunset, as the colors are spectacular and to see the city change from day to evening was magic and romantic.\n\nTheir menu is small but varied and the prices are not bad for the value. Spend some time checking out the floor below (beautiful library) and the ornate lobby of the hotel.\n\nAnd while it's labeled as the 12 floor, realize that there are 2 floors not numbered, so it's actually the 14th floor. FYI.", "author": "Penguin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "This spot is a gem. Phenomenal view and a classy ambiance to compliment it. The bruschetta was on hit, and the truffle tater tots were also quite nice. I may be a little biased since anything with truffle on it makes it better in my eyes, but even still, they were delightful. And the ribeye that i ordered was a fair size, and cooked just how i asked.", "author": "Denny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Wow, this place is incredible! Amazing food, gorgeous views, even a live piano player (who just happened to be playing some of my all time favorite songs from The Phantom of the Opera). \n\nWe started with the crab cakes. Now, I love crab cakes, and pretty much always order them if they are on a menu when I go anywhere, and I've had some really good crab cakes in my life, but these were the best I've ever had. Perfectly seasoned, not overly cooked, and they had a great sauce drizzled on top (not quite sure what it was but it was delicious!) Next was a simple wedge salad, with a blue cheese dressing that was to die for! Then I had the sea bass, and my boyfriend had the glazed salmon. We shared because both were incredible. Every bite I took just melted in my mouth. I loved the food so much, for the first time in my life I asked if I could speak with the Chef to give him my compliments. He came out right away, and was very nice and thanked us for being there. He recommended the passion fruit cheesecake for desert. Now we were quite full, but the way he talked about the cheesecake seamed like we just had to try it. We shared a piece and OH MY GOD it was unbelievable! Anyone going there just has to try it! We also had a bottle of their house red wine with dinner which was a cabernet sauvignon, and was quite nice.\n\n The service was superb, the views were breathtaking. I would recommend going anytime, but especially for a special occasion (we were celebrating an early Valentines Day). Great, high quality food. Definitely feels like a 5 star restaurant without 5 star prices. I cannot wait to go back!", "author": "Jennifer V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "Made day-of reservations for my boyfriends birthday while visiting SF. Requested table w a view, had a perfect spot. Food was great, I believe our steak temperatures were switched-I ordered medium and boyfriend ordered medium rare but they were flip-flopped. I had the filet, boyfriend had ribeye, both steaks were great but my boyfriend just raved about his. Mac and cheese side was delicious, also ordered the truffle tots but I don't see the big deal about these. One side is plenty for two people. We had more food than we could eat. Some confusion with our wine order: ordered a bottle from the wine menu but were then told they didn't have that bottle...or the next one we tried to order from the same menu. Were then given a completely different menu? Server said they were undergoing changes but were eventually given the original bottle we ordered. No big deal, just seemed like they were a bit scattered. Liked all the Marine paraphernalia and decor. Overall, boyfriend enjoyed his birthday dinner here!", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "Lovely, upscale steakhouse feel with fairly reasonable prices. Located in the historic Marines Memorial Club & Hotel, take time before or after your meal to stroll around the lobby and look at the displays. \n\nThe restaurant is on the 12th floor. If available, ask for a seat by the window for a nice view over the city and water. They start you out with a small, complementary crudite plate and bread with roasted cloves of garlic and butter. Yum! All of the entrees also come with a wedge salad with blue cheese dressing. \n\nFor my main course, I got the filet mignon, cooked to my specified medium rare, with a nice, tender texture and seasoning on top. I would preferred slightly more of a char on the exterior for textural contrast, but it was a nice piece of steak nonetheless. \n\nSides are a la carte and say they serve two. I was dining alone (in town on business) and the server was nice enough to bring me a half order of asparagus when I asked (and only charge half the price, which I didn't ask, but certainly appreciated). I love asparagus, but these were steamed (vs. grilled or sauteed, which are both superior methods in my opinion) and over-cooked. Also, the hollandaise sauce was thin and foamy instead of rich and creamy. But, a minor part of the meal, which was great overall.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "yuuuuuuuuum.  solid t-bone that comes with free iceberg lettuce wedge with blue cheese salad.  very inexpensive compare to other steak houses. must order truffle tater tots.  Its mashed potatoes squeezed out of a pastry bag then baked then seasoned with truffle.  an artisinal tater tot....never imagined one existed.\n\nwithout a doubt, a secret dining place.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "Loved the Rib-Eye and mashed potatoes.  \n\nExcellent customer service!\n\nRestaurant is a little small though.\n\nDidn't really like the piano player, more for an older crowd.", "author": "Tin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "During a busy trip to SF for Xmas shopping with the family we went looking for a good place for lunch that wouldn't be crazy. Came across this hotel and restaurant. We arrived at 1:40 pm. We barely made it since they stop lunch at 2 pm. Not busy! What a view and great service! Kids had burgers that were juicy. Husband had a salad. I had soup and chicken sandwich. Everything tasted fresh and delicious! The staff was top notch!  The staff made this a complete 5 star!!", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "Decor is ok, but the food is great. \n\nI personally recommend the Rib-eye, Mac and cheese, and Mashed Potatoes..", "author": "Walter P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "Never heard of this place until I checked out the Marine's Memorial Hotel for a wedding reception venue.  When my fiance and I were shown this restaurant during the tour, i knew we had to come back.  The view our the windows of this top floor restaurant are great.\n\nI had a filet mignon, that was good, just slightly more cooked than I ordered it, but tasty nonetheless.  We had a few appetizers, the ahi tar tar and some baked oysters, I cleaned both plates.\n\nBut the MUST have recommendation I have for the night was the truffle tater totes.  It's a side order to the entrees.  I would come back over and over, just for the tater tots.  Everyone around us ordered them as well, it must be one of their specialties.", "author": "david l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "The service here is really good.  The wait staff is very attentive.  What's more impressive is the view.  When I was eating dinner, the fog kept rolling in and out.  It was really a sight to see.\n\nThe prices are also very reasonable for a steak here.  There was something interesting in the marinade, but I couldn't quite put my finger on it.  I asked out waitress, but she couldn't tell me.  The sides are quite large, so be prepared to share.", "author": "Spencer K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-29", "description": "BF knows I love my meat. Sometimes I crave it pretty bad and we end up at a steakhouse. Since it was Christmas time we thought it would be nice to check out the Christmas tree in Union Square. I booked Leatherneck since it was ideal, location wise, and the reviews seemed to be decent. We showed up and there was hardly anyone there at the bar. We waited about 10 mins and were seated near the window with the awesome view of the city. Beautiful. There were a few large parties in the dining room. It was kind of loud with the kids screaming and crying and the protégé boy playing Christmas tunes on the piano (not by request except from his mother). The more wine I drank, the more the noise level got tolerable. Our meal started off with a wedge of iceberg lettuce with what resembled ranch sauce. The lettuce was so COLD and crisp. It was so good. For the meat, I chose the prime rib, which was very good. Cooked the way I like it. BF chose the peppered steak, which was kinda too pepper-y. For dessert we shared the crème brule which was okay. Not the greatest and not the best either. Service was a bit slow but that was because of the large dinner parties. A few of the items on the menu, like the tater tots and chard were out. I would come back if I was craving steak and in the area. But it didn't wow me as much to make it a recurring visit.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-19", "description": "Was a guest of friends for a very special going away celebration. Have heard wonderful recommendations about this restaurant but had no idea what a true dining experience this would be. From the moment we walked in, we were greeted by the very gracious manager, Edda. Our service was prompt but leisurely. Out wonderful server, Tracy, could not have been more professional or personable. Her knowledge of the menu and assistance in ordering just the right entrees and wines was outstanding.  This was a wonderful dining experience with great food, wonderful ambience and outstanding views. I highly recommend the Leatherneck.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "Sincerely loved this place and would definitely recommend it!\n\nMy boyfriend and I walked in without a reservation around 7 on a Saturday night and were asked to wait about 10 minutes so they could set a table up for us. They put us in one of the two dining rooms with amazing city views (from the 12th floor), which was appreciated (I think they could have sat us sooner otherwise) and allowed us to grab a drink at the bar.\n\nOnce seated, we were given a basket of sliced, toasted bread, butter balls and a clove of roasted garlic (amazing touch). There were also some veggies and a dipping sauce, as well as a couple of olives.\n\nWe ordered the oysters rockefeller for an app, and they were to-die-for! Our meals were equally amazing,..  iceburg wedge, steaks (I got the filet mignon) cooked perfectly, creamy garlic mashed potatoes (to share)... wow! I wish I had room for dessert! \n\nWe also took advantage of the complementary glasses of wine for Yelpers, and got 2 glasses of house cab-which we both loved. However, the waitress had not heard about this and was hesitant to give us the deal until I showed it to her on my phone... so come prepared.\n\nAll in all, $80 plus tip for a two hour dining experience was well worth it.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "Thank you yelp for a great rec! Went there last night for BF's birthday dinner. The bar and restaurant are gorgeous - just too bad with all the crappy weather lately that we couldn't enjoy the view. anyway.\n\nService was impeccable. The food itself was outstanding. we both had filets, shared an order of calamari and the garlic fries. the individual iceberg wedge salads were delish and so cute too!\n\nand for my bf's birthday they brought out dessert on the house and sang for him. i was really, really quite pleased here and would love to go back!", "author": "laura f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-11", "description": "food old OK, nothing special.  Price good, close to Theaters.\n First had reservation time wrong by one hour later. Then told after meal that our table had been needed, yet there were many empty tables an NO ONE WAITING. Very rude!! Would not go back again.", "author": "Carol H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-30", "description": "I made the mistake of coming during the lunch hour. I asked our server is the chef could make us a rib eye steak. After he confirmed with the chef that it was possible we waited quite a while for out food preparation. To my surprise, the food arrived and boy was I surprised. My medium rare steak was nothing other than the rib eye cut from the lunch menu (English cut). The waiter explained that the meat was pre cooked and he was sorry that the temperature wasn't what I expected. What a waste of an hour of my time.", "author": "Lynda E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "Yelped for a steakhouse in SF and this looked intriguing. Here is what I thought:\n1. Nice, intimate setting. No need to raise voices in conversation. Nice live piano in the background.\n2. Drinks very good.\n3. Prices very fair.\n4. Got a window seat so incredible view of the city but no bad seat in the house.\n5. Hubby and I both had the filet mignon. Very tasty but I would say a tad more cooked than asked for (next time would say rare instead of med rare). Garlic mashed were great.\n\nSo overall a very nice evening and would definitely go back!", "author": "Lisa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "This place is very underrated.  Amazing views, food and service.  Mac and cheese is a must!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Interesting throw back in time.....dress code for the guys.....great view, my date and I  arrived for sunset on a clear day.  We split the 16 oz. prime rib and ordered three sides: truffle tater tots, swiss chard and string beans.  Iceberg wedge with delicious ranch dressing.  Plenty of food for two and the service was good.  Piano bar.  Friendly staff.  and again: great view, ask for a window seat.  BTW way she loved it.", "author": "Lou R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "Wow!  What an experience...  $7.71 for a Beefeater Martini.  I am not sure what else I should say.  My colleague and I didn't actually eat a steak here but I had the Cod and he had the chicken.  We were both impressed with our meal and the service--not to mention the view.  Did I mention that a stiff Beefeater Martini was only $7.71?  They even had a live pianist.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "Great burgers and sandwiches for lunch. Very good service and reasonable prices. Decor a little tired but neat and clean.", "author": "Fred T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "Great service. Great view, oysters were best ever.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "So it's my parents' birthdays - significant birthdays - and we asked them how they would like to celebrate.  Ideas included:\n\n- go away for the weekend\n- party at one of our homes\n- party at the old folks' home where they live\n- dinner anywhere their heart desired\n\nWell, their hearts desired to eat at the Leatherneck Steakhouse.  None of us were enthused, but went along with the program.   We thought it was an odd choice since my family is not very pro-military.   My dad was in WWII, but doesn't talk about his experiences, which included the Battle of the Bulge and liberating a Nazi concentration camp.\n\nThe manager of the MM Club was very helpful and gave us a wonderful, semi-private table in the back of the restaurant.   The room itself is lovely - great view, very bright and they have live music.   When we arrived one of the hotel guests was drunkenly serenading the rest of the bar and restaurant with her version of Memories.  \n\nWe had brought our own table decorations, flowers and place cards and the table looked beautiful, set with heavy cutlery, crystal glasses and these way cool salt and apper shakers that had the Leatherneck emblem - a bulldog - engraved on them.  We were taking bets on which one of the four sisters would rip them off.\n\nThe server that was assigned to us was a bit of a problem.  Her English was very poor, and she never approached the table unless I called her over.   She basically stood against the wall for the evening.  It became a little tiresome to beckon her over to take the orders for 12 people, to ask questions about the menu, to order cocktails, etc.\n\nThe food was actually pretty decent, and we even managed to make the vegetarians in the party happy with mac & cheese, salads and truffled potato puffs - yum.  The carnivores enjoyed steak and pork chops that they carved up with their scimitar shaped knives.   My fish entree was also good, even though the crab in my crab cocktail had seen better days.\n\nWe had a bit of a disconnect with dessert.  We had brought separate, special desserts for both parents and they were stashed in the restaurants kitchen.  When I told the server that it was time for dessert, she brought out the two desserts with candles and we all sung happy birthday - but she hadn't taken anyone else's orders, so we all sat there and watched my parents relish their tasty treats.   At this point, we had been at the restaurant for nearly three hours, and we all wanted to leave, so the rest of us skipped dessert.\n\nAll in all, a good place for a special occasion - and the price was right too!  We ate n' drank like fools and it was less than $900 - a bargain by SF standards.\n\nOh - and my parents had a blast, thanks for asking!", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "Great food and even better company at the Leatherneck Steakhouse.\n\nI was the lucky recipient of an invite to dinner at the restaurant on the 12th floor of the Marine's Memorial Club and Hotel by 2 very gracious hosts.  We had a leisurely dinner in honor of a veteran Marine who just happened to be my ex-boss.  A bit of shop talk, a bit of reminiscing, and some really great food.\n\nIn regards to the food: I nibbled on the non-meat parts of the appetizers, a spinach salad was my main course - very good, and I gorged on all of the delicious sides (creamed corn, mashed potatoes, mac n cheese, and asparagus w/ hollandaise).  The saddest part was that everyone around me ordered steaks, which smelled truly mouth watering.  Extremely tempting, but never fear, my vegetarianism remains intact, I didn't surrender!\n\nFor dessert - bread pudding topped with whipped cream, yummy.\n\nVery classy joint, the service was superb - thank you M2W2, I had a lovely time.", "author": "Burrito M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "S.O.S. is to die for. The view is amazing. Service was adequate although I had to ask for a refill which makes me feel like a rubberneck looking for a waiter sometimes. I would not recommend the bread pudding. It reminded me of everything I dislike about conventional bread pudding. Soggy, rum flavored and raisens. Not for me. I came for lunch but to get the true experience I would love to come back for dinner and a sunset.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-01", "description": "Don't ask me how I ended up at Leatherneck Steakhouse located at the Marines Memorial Club and Hotel for dinner. Nevertheless, it was pleasant experience. The dining room resembled one of a typical pricey hotel restaurant, somewhat elegant but extremely quiet. What I remember the most was the spectacular view of the city from our table and my perfectly cooked rib eye. \n\nThe rib eye served literally on a silver platter was so perfect and juicy I still remember it to this day. The entrees come with a classic relish and an iceberg wedge salad. Sides like mashed or baked potato, creamed spinach, mac & cheese, etc are $5 each but serves two. Personally, I think it should also be included with all entrees. Everything else was pretty typical from the crispy calamari, baked potato, NY cheesecake and the warm berry crisp.", "author": "Sara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "We went to a business dinner with a party of 9 and were pleasantly greeted with a phenomenal view of the city. We're thinking about moving here and that view is one that I could get used to! Wow. Not bad to look at while sipping a glass of wine and eating a filet!\n\nThe service was impeccable. The water glasses didn't get 1/3 emptied before being topped off. They were very friendly and professional. Top notch and 5 star worthy.\n\nThe food was good but not great. I always find steak houses to be unexciting but good and serviceable. I've never really had a world-class steak at one of these places but always leave satisfied. They were all perfectly cooked to order and presented well so they do what they do well. The filet was very tender and of great quality. My wife was happy with her kobe au poivre.\n\nTo get a good quality meal and be able to check out that view again I would go back.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-24", "description": "We went here last night with a group of 16 after seeing Dame Edna. It was close by and there were some \"military people\" in the goup. The main dining room seemed very nice with a view. We got put into the second room at two tables for more privacy and space. This room had a more \"banquet hall\" atmosphere. The food was solid what I would expect at a \"good\" restaurant in Kansas or Iowa or some place like that. For SF it was sub-par. Service was acceptable. For the same price you can get much better elsewhere.", "author": "Nobbi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "Tuesday (Valentine's Day) was our second visit. We wouldn't have returned if the first experience hadn't been great. As with the first visit, our food was excellant.\n\nThe problem was the service ... crappy service with a smile ... we arrived 15 minutes early for a 7:45 reservation only to learn that they hadn't started seating their 7:30 resesrvations yet.\n\nWe thought, Oh Well, sit at the bar, get a bottle of wine we'd take into the restaurant later. We asked the bartender if we could do that and were told sure. What did we want? Me: A wine list?  So I tell him we want a bottle off the MMC Merlot. He brings over a partial bottle and is about to pour glasses, I remind him we wanted a bottle. So he comes back and sits the bottle in front of us and walks off an putters around the bar. Finally, we had to ask him to open the bottle and pour our wine. WTF? In a restaurant of this caliber, with the hostess stand in the bar, it should have been obvious we were waiting to be seated and really weren't purchasing a bottle in the bar to have it opened when we were seated.\n\nFinally, 20+ minutes after our reservation, we were seated with semi after thought appologies.\n\nTable service was almost not there. Water wasn't refilled. At one point, my wife pulled a bottle of water from her purse and refilled her glass. Food was slow to arrive. We had to ask for steak knives and if it hadn't been for an alert busboy, we'd have had to box our leftovers ourselves. Table is cleared we were never asked if we'd like coffee, dessert, etc. Finally, after each of us got up and went to the bathroom, we had to flag down someone to get our check.\n\nSomething should have been comped for the late seating, like the hostess might have suggested to go to the bar and have a drink on them? They should have been well aware of the slow table service and again offered some kind of comp.\n\nAfter thought verbal appologies don't make up for late seating and slow service. The great food isn't going to bring us back anytime soon. Too many other choices within 2 blocks.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-16", "description": "Spectacular views, solid food, great service. Strong pours on the drinks and a modest but serviceable wine list.\n\nDon't let the Marine Corps thing scare you away - when you walk into the hotel you'll pass a rack of medals; turn right to the elevators and you're greeted by a statue of a bulldog wearing a USMC uniform. That's it - no bloody murals depicting the landings on Iwo Jima or Herman Hanneken making off with Peralte's body. And no, the waitstaff isn't made up of retired Marine NCOs.\n\nPairing crab cakes with a bottle of Kendall-Jackson reserve chardonnay made a great start to our evening. It's amazing a place like this isn't packed all the time. Great views of the city in a low-stress setting. Recommended, especially at sunset.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "Its hard to make me a fan of anything. Just look at all my other reviews. I arrived early and seemingly there was a full reservation list and most of the tables were taken. We were seated as soon as a table became available earlier than our reservation. This was a nice touch. \n\nThe Salad simple enough was a quarter cut wedge of Iceberg lettuce served with your choice of dressing. In my case I ordered the Blue Cheese and it was nice balance, not too pungent or overpowering blue cheese. I ordered the Seabass it was served in a Safron broth with Manila clams. This was excellent and on this dish alone I give this place high marks. It was perfectly cooked, not overdone, maintained its moist center. \nMy friend had a  New York steak and it seemed a little more than Medium Rare in temperature, but still in the neighborhood of \"Warm Red center\" (barely)  We had the Calamari appetizer, it was well executed with the nice crunch batter. This was served with a a homeade cocktail sauce that was suprisingly well balanced with just enough horseradish to give it the right kick. \nWe also had two sides that are \"a La Carte\"  The Creamed Spinach  was good, but the real kicker was the Truffle flavored Tater tots. This was a nice rendition of mashed potato, a good truffle flavor, reconstituted and shaped into two inch long, Tater Tots then fried.  My other critiques it  that it could have been done with a hotter oil so as to reduce its absorbtion of oil. \nThe service was very attentive to a fault, and anticipated our needs. He made good suggestions without being pushy. The views are great from this location, you can see across the San Francisco city Skyline, and its about 2-3 blocks from Union Square. Looking out the window off the 11th floor (I think thats the correct floor) you can see clear across into the Sir Francis Drake Hotel and the top of it is the Starlight Room. \nThe whole place is rich in history and great tribute to our Armed Forces. I recomend this place and I already have reservations for a second event here.", "author": "Gabriel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "Just celebrated a 55th Birthday at the Leatherneck. Great views. Great food. The piano playing in the back was very soothing. The service was a little slow. This was appreciated because we didn't feel rushed. The bar area is a little dated.", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-06", "description": "The view gets 5 stars, service gets 1 & food gets 3.  All in all, underwhelming and overpriced.  They could do well to start with more competent wait staff.", "author": "T C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-28", "description": "By the time we arrived at the restaurant for our 8 pm reservation, the restaurants as out of Prime Rib.  I ordered 2 first courses, the French Onion soup and the Ahi Tartare. The server came back and said they were out of the French Onion soup.  I ordered a salad instead.  She proceeded to forget my second first course (which was to be my entree).   Then I was informed that the restaurant was also out of the Ahi Tartare.  Our server, Marissa, was rude and totally inattentive to our needs (we couldn't order a second drink until we flagged down a busboy.  But she was quick to deliver the check which included a built-in tip in excess of what we would have been willing to give her in light of her poor attitude.", "author": "Suzanne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "I don't think anybody in our party even knew this place existed prior to our visit last night.  I was a little cynical of a steakhouse that uses the name 'leather' to describe itself, I'm usually not a huge fan of leathery food.\n\nFirst off, don't try to order a fancy drink from the bartender here, he'll inform you that the average age of his clientele is 75 and they don't drink froo-froo drinks...so stick with scotch and soda...\n\nThis place was actually delicious, the ribeye was terrific and cooked perfectly, the truffled tater tots, mushroom platter, onion rings, french onion soup were all fantastic.  \n\nThe only reason for 4 stars and not 5 is that the service wasn't very prompt.  It took about 15 minutes after we sat down for the server to even acknowledge us, which is bizarre considering there were only 3 or 4 other parties in the place.\n\nI would definitely come back here again, but it is fairly touristy, so probably would wait until I have a visitor in town to frequent this place again.", "author": "Craig E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "I absolutely loved the experience I had at this restaurant. It was my first time there and I had a party of 9. We had a very nice and attentive waitress. they set us by the window so we had a chance to enjoy the gorgeous view. And the food was delicious and very reasonable prices.", "author": "Courtney W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "By far the best dining we had the entire time we were in SF,  I had the filet mignon with the asparagus and mushroom and leeks as sides. Perfect steaks. Great views and great staff. The only drawback is the decor which resembles a multi-purpose room or chow hall. If this were changed they'd be at 5 stars. Great experience. Highly recommended.", "author": "Todd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "Excellent restaurant, excellent service, excellent food, and excellent views expecially at night.  I ordered the 16 oz prime rib and it was incredible. I also ordered the garlick mashed potatoes which was full of flavor.  My wife ordered a sole fish dish and it melted in your mouth good.  Great for a romantic dinner or a place to lounge with a great view.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-01", "description": "I found this restaurant using yelp ratings only (no prior experience with the restaurant or even part of town).  \n\nWe held a business dinner here for 10 guests. I was able to call ahead an reserve a table without any trouble. As far as the restaurant goes...Food was good. Service was OK. Average atmosphere but nice view. Overall it worked out well.\n\nThanks Yelp Reviewers!", "author": "Todd P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "Went to the leatherneck steakhouse because it was close to our hotel.  First off the staff was very friendly, courteous, and prompt.  Secondly the view was nice I would say it would have been better after dark or at sundown.  The steak was good, my wife's lamb was good though cooked in a Moroccan style which really seemed strange for the type of restaurant it was.", "author": "Micah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "A hidden Gem in SF - if you are in to steak and a great view come here, but make reservations first.  You don't have to be a Marine to visit, eat at the restaurant, or stay at the hotel - so head up to the 12th floor and let the experience begin.  If you are in to happy hour the bar holds happy hour from 4-6 for guests of the hotel - non guests are welcome as well, but you pay for your drinks. I personally like to get there after 6 - sit at the bar have a drink then head in to dining area for dinner.  Your view is of Union Square, and across the skyline is the Starlight Room & the Bay.  The sunsets are amazing to watch from the 12th floor as the amount of light that fills the place is amazing.  I've read the reviews and while I can appreciate an honest review,  I can say we've  never had a bad experience here and we go regularly.  Just because you have (for example) eight people at your table doesn't mean one appetizer serves all of you - I mean if you ordered crab cakes you probably get two so of course - it's not enough appetizers for everyone at the table.  Also -if you run out of bread ask for more these servers are literally there to make you happy. The meals also come with a salad that is HUGE - so I'm sure once you've had bread & salad you won't be complaining your hungry once your dinner is done.  The pork chops, prime rib, steak all excellent choices, and you get to choose side dishes if you so desire to go with your meal. They are big enough to serve at least 2 people easily so you can share.  It's a somewhat romantic spot, and some evenings they have a pianist come in and play for a few hours which definately sets the mood.  I am a fan of the Marines Memorial Club & The Leatherneck Steakhouse!  p.s.  Try the Leatherneck Ale it's great!\n\n\nP.S. We've been back numerous times since my first review because I can't get enough of this place. Last night we celebrated my birthday and had a nice romantic dinner - window side. I took some pictures of the views & our meals which I've uploaded to Yelp.  It was fabulous and my Filet Mignon melted like butter in my mouth.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "This place was AWESOME!  The food is really simple, traditional American.  What do you expect from a place called Leathernecks?! Anywho, my prime rib was made to perfection, the Fiance's porkchop was huge and tender and the sides were TO DIE for.  My daughter LOVED the mac and cheese and mashed potatoes.  She also really enjoyed the view from the 12th floor.  The servers were very attentive and sweet to us.  The ambiance is calm and maybe it wasnt the best place to have a 6 year old eat at, they were not snotty about it at all.  There is some what of a dress code and you can't use your cell phones up there either.  What I enjoyed was the piano player, who will ask you for your requests.  We tipped him and he played all these cute disney songs for us.  =) It was a great night for us.", "author": "Kristine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Great views, wonderful service, delicious food and a diverse menu. In addition, you support an organization which supports our troops?  A great experience!", "author": "Dylan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "This was a totally funny way for my friends and me to end our Friday after being in Napa for wine tasting. My friend found it on Yelp and made reservations for 7. The restaurant was nearly empty. I must admit, when we all walked in with jeans--and I with my suitcase--I was concerned.  They have a dress code, but we must have been okay. And, c'mon, the place had only a few tables of serious-looking diners. However, my concern was again piqued when a matronly manager-looking woman ran up to me as I followed the hostess back to our table and asked if she could help me. You know, in the 'Can I HELP you because you sure seem to be in the wrong place, sweetie?\" way. I then heard her say to the hostess \"Did they just walk in off the street?\" Frankly, that started things off a bit wrong for me. For all she knew, I was a decorated Marine. (I'm not, but that's not the point. I have seen Marines wear jeans before, even for dinner.) No matter, the rest of the evening made up for it.\n\nThis place is old skool.  It would be fun to dress up in 60s clothing and have a Mad Men themed evening here, for example. I had a Manhattan to memorialize this. The only way to go is old. I had the French Onion soup, which is as expected but satisfying. The lettuce wedge with blue cheese was another retro touch.  I ordered a fillet, which was cooked to my specifications (I'm a medium gal) and creamed spinach and mashed potatoes to share with my friend. We remarked at the end that we easily could have split those with more people, even if it says \"serves 2\" on the menu. I think that if we as a  group of 7 ordered 4 or 5 to share, that would be sufficient. The only thing was was regrettable was the red zin that I ordered to accompany my meal. Since a portion of proceeds from that wine go to our troops, I'll forgive that. (Combined with the fact that I had just spent 2 days tasting all variety of delish reds in Napa). \n\nThe views were fantastic, and they gave us a great table to watch the urban pageantry. Despite my initial experience with the manager, she later came up to make sure everything was as expected. Our waiter was efficient and friendly. The only problem posed was when we tried to pay with 6 credit cards. The waiter, though, fixed the issue by running separate tabs, which some of my party balked at, but I found truly accommodating when you think that they probably don't do this that often. All in all, satisfying, and I'd go back.", "author": "Christine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-30", "description": "Amazing view of the city from this restaurant.  The food was pretty good for the price.  The steak was a little overcooked for medium but still tasty. I recommend getting there well before they close because they tend to rush you out otherwise.", "author": "Keith D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-12", "description": "Well the food here was just about great and the view is pretty. My steak was perfect and the side of garlic mash potatoes were stellar. They should be for the price. The appetizers were lacking. The calamari was sooo salty I had one bite and was done. The shrimp cocktail was pretty but nothing remarkable.\n\nThe service was awful. Some of our party was late so we had drinks at the bar. We were told we had to be seated and order because they were going to close in a hour. Well after a half an hour of the hostess talking to someone else we were still waiting to be seated and felt stress over the time. \n\nThe waiter forgot to put in an order for rack of lamb and then tried to push the prime rib. So we all had our food at different times. Not good. We were the only ones in the place but waited over 15 min for a bottle of wine.  We were then told we had to wait to see the dessert menu. Just weird crappy service. The dessert was great and the specialty coffees were strong just not served when the dessert came. I don't think I will be going back.", "author": "erin k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "Delicious, attentive service, good value -- a really nice night out.\n\nWhat's in a name? Well, lots...and not always what you may think. What about Leatherneck Steakhouse? Sound romantic and elegant? Conjure up warm service and great city views? Turns out it should. My boyfriend and I went late on a Sunday evening. There was live piano music (and there's a huge printed playlist, with styles all over the map, in case you want to make a request).\n\nWhy don't more people know about this place?? \n\nWhen a collection of delicious little slices of bread arrived at our window table with a whole roasted head of garlic, I knew for sure I was in the right place. The timing was good, too, because I needed something to soak up the very generous mixed drink I'd brought over from the bar. We ordered crab cakes to start. I'm a fairly tough crab cake customer. I just don't get dropping a few specks of crabmeat into a mess of breadcrumbs, frying it up and sticking it on a plate with a mound of mayo -- but THIS...this was a fistful of juicy chunks of Dungeness magically held together just well enough for a forkful to get from plate to mouth intact. The corn salsa it came with was yummy, too, a nice change from aioli. \n\nA wedge of iceberg lettuce with blue cheese comes with every entree order. Now it still makes me laugh to see iceberg -- the poor, anemic cousin to REAL lettuces with flavor and texture -- on a high-end menu. But watching my boyfriend devour this dish, grinning and grunting with pleasure (is that too much information?)...well, I guess it's the cheese.\n\nAt the Leatherneck, you order side dishes separately from the entrees, and each side serves two. I wanted to share just one side; BF wanted us each to pick one. I'm thinking, 'Too much food,' but actually it makes sense. An entree usually comes with a veggie and a starch; two sides, right? So he ordered Filet Mignon and I got roasted chicken, with sides of asparagus w/hollandaise and garlic mashed potatoes. Everything was delicious and came to the table hot. The real standout, though, was the filet. He ordered it medium-well (a crime in my book, but I love him anyway). It was as tender and juicy as any properly rare filet I've ever had -- really memorable.\n\nSadly, we were too full for dessert. Maybe next time we'll eat dessert first, just so long as I get my crab cake.\n\nThe Leatherneck Steakhouse is in the Marines' Memorial Club at Sutter and Mason Streets, which houses a really nice hotel and banquet rooms for members and their guests and businesses that hold conferences there.", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "This restaurant is a special gem in the heart of San Francisco. The breathtaking views will immediately grab your attention but it will be the inviting ambience, friendly service and wonderful menu that keep you coming back. Come before the show, after the show... you will not be disappointed!", "author": "hol f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "I would give the food here four stars and the price and value three stars.  I've been to Leatherneck's here in the past for social cocktails and other brunches.  Came here yesterday with co-workers to celebrate a co-worker farewell luncheon.  \n\nLocated on the 12th floor of the Marines Memorial Club and Hotel (see my other review: http://www.yelp.com/biz/marines-memorial-club-and-hotel-san-francisco-3#hrid:Vb_HiUksO8BP579uTvnErQ ).  This restaurant is also open to the public if you want to drop by if in the area to experience some spectacular vistas over looking east to south-east downtown SF.  You can see AT&T park from the restaurant!  \n\nI ordered the Angus Beef hamburger.  I was surprised that it was actually very tasty.  It was cooked medium just the way I like it and came on a sesame bun with fresh leafy lettuce, red onions and potato wedges. I had an ice tea and raspberry sorbet for desert.  The sorbet tasted freshly made with fresh raspberries.  Okay, I was thinking:  \"but for $18.00 ($25.00 including tax+tip), it BETTER be good!!!\"  These prices are anticipated at hotels/places like this but what can you do?  \n\nhttp://www.marineclub.com/leathernecksteakhouse.htm", "author": "Steve J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-29", "description": "Service was great.  View was excellent.  Atmosphere was quiet & there was a live pianist.  The food was delicious.  Icing on the cake was that the prices were quite reasonable - got out for quite a bit less than damage from other steakhouses in SF.\n\nGreat spot.  Fantastic value.  Will definitely be back.", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "good food, amazing ambiance, great staff.\nall in all unbelievable value. perfect spot to dine with that special someone and have a great time watching the city.", "author": "Toygar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "Thank you yelp! Went to Leatherneck on Saturday night and had a fantastic time! While we were by far the youngest people in the restaurant, we had fantastic service and the food was excellent. The view was amazing, despite the rainy weather...\n\nWe ordered the filets, which were great and cooked perfectly, and the tator tots lived up to all the reviews. It was our friends birthday as well, and they brought out a free dessert for him! Also, make sure to ask for the \"yelp\" glass of wine, not only did they give all 5 of us a free glass, but they were not shy on the pour! :)\n\nOverall, had a fabulous experience and would definitely return!", "author": "Cassandra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "I took a group of 6. We had a wonderful time. The service was very attentive and the food was excellent. Don't leave without trying the berry crisp for dessert.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "surprisingly good under-the-radar steakhouse with a killer downtown views. \nold school ambiance and menu; the salad accompanying my steak was a half a head of iceberg lettuce smothered in heavenly bleu cheese dressing. t-bone was very good; side of truffle tater tots nothing less than stellar. \nthe martinis are top-notch too... \ni definitely recommend heading up to the 12th floor of the marines memorial building. you won't be disappointed.", "author": "Brett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "Came here on a whim after reading the reviews on yelp and we were pleasantly surprised. It's not a super fancy place, and the service was a bit on the slow side although very very friendly. Nice ambiance as they had a pianist playing beautiful music at the bar. We ordered a filet mignon and a ribeye - both were cooked as we ordered, and tasted great. Had the bernaise sauce and horseradish sauce on the side. Based on other reviews, we had the truffle tater tots - definitely a MUST HAVE - and the macaroni and cheese. The wine list is unique in that it featured wineries owned by military families. We enjoyed a tasty pinot noir. For dessert, we had the chocolate pot de creme. All in all, a very nice evening and the food was really good. I'd defnitely come back here the next time I'm in San Fran.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "Sitting here right now.  Looking at the beautiful view.  The ribeye was tasty yet lean.  The truffle tots were salty and tasty.  We didn't even use katsup.   The mac and cheese was creamy goodnes.  Service was awesome.  My Makers Manhattan was 7 dollars.  Yep.  Beautiful night, beautiful view, great food, great price.  Awesome service.  Ask for Eddie.", "author": "Tommy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "So I took my dad for his birthday. It was quite lovely. The pianist sang happy birthday and came to the table to personally tell my dad happy birthday and gave his latest CD a little cheesy but cute. My only complaint were some fruit flies or gnats. I look forward to going at night to see the evening view. The steak was so tender no steak knife needed nor did we need any steak sauce. An iceberg wedge came with the entrees which the waitress pointed out as we ordered but since I don't like blue cheese salad dressing she allowed me to substitute to a dressing I liked thus saving me the cost of ordering a different salad. How cool is that! All in all a great experience would give it 5 stars if not for the gnats or fruit flies. I hope they see this review and handle that. Also dress code is mentioned when u make reservations which I loved This place is a class act though dress code loosely followed. Saw some folks in attire that did not class up the place.", "author": "Vicky P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-23", "description": "This review is for the Leatherneck Bar. . .\n\nThis was a fun location to hang out at for awhile on a December Saturday night, before heading out to a \"black tie\" event (remember THOSE days?). We had made reservations to get in, prior, by calling. We were all decked out in our penguin best, and eye-catching dresses as we stepped out of the elevator, which turned a few heads just with our arrival. A quick drop of a name, thanks to the prior reservation, and we were IN. The bar is pretty small, and very crowded. But, to have the opportunity to enjoy a cocktail, and a nice view, both inside the bar and outside to the city, made it worth the extra effort. With most of the clientele being of military relation, the courtesy level was extremely high. And, when was the last time you encountered that in a crowded bar?  Live piano provided the music, as several used the musical device as a bar. Good conversation was enjoyed by all. Did I mention the military personnel? Yeah, just wanted to make sure.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "My wife and I were looking for a nice steakhouse on my birthday.  We didn't want to go somewhere noisy and crowded.  Leatherneck Steakhouse fit the bill perfectly.  We had reservations and were seated promptly upon arrival.  A few minutes later we were given bread, butter, some vegetables, and a nice roasted garlic spread.  There was a live piano in the background and people talking quietly at their tables.  Although we did not have a window seat, the view of downtown San Francisco was incredible.  The word to describe the atmosphere is \"classy.\"\n\nWe ordered a prime rib and rib-eye steak and shared an ice burg lettuce salad, asparagus, and mashed potatoes.  It was just the right portion for two people.  The meat was tasty, succulent, and done just right.  The rib-eye was lean with just a bit of fat trim for flavor.  I didn't put any sauce on it since a good streak should stand on its own.\n\nThrow in a glass of wine and it was truly an enchanting evening.  Since this restaurant is tucked a few blocks away from Union Square, it probably doesn't see a lot of tourist foot traffic.  That provides the peaceful and upscale atmosphere which is sometimes lacking around that area even at nice restaurants.", "author": "Brent V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "Was at the clift hotel and this steakhouse kept coming up as best in area.  Finally found it in the marines hotel on the 12th floor.  Sat at the bar next to a couple awaiting their table which added good conversation.  Vodka tonic was light but good.  Ordered steak at bar s waiting to get seated.  Was excellent.  12 lean ounces and plentiful.  I will be back when I'm in sf on business again.  Great place but make a reservation.", "author": "Myles N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-28", "description": "Good food.  Good service.  Reverent atmosphere.", "author": "Brendon F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-09", "description": "These other reviews make me think there are two Leatherneck Steakhouses in San Francisco.  The one I visited last night with my family was terrible, with problems from start to finish.  \n\nThe bartender was rude and made the worst sidecar I've ever had.  I couldn't drink it.  Not enough bread or appetizers for the table.  My uncle's fish was undercooked.  My crab was overcooked (and they were \"out of\" the crackers and little forks, which the waiter told me with no apology or suggestion for how the hell I'm supposed to eat my \"crab leg dinner.\"  Um, ok?).  My aunt's fork (which was apparently a score) was dirty.  Service was terrible.  The entrees arrived at different times and we had to ask them to bring the side dishes we had ordered.  They weren't hot.  My stepmom had to try three times to get the waiter to take her drink order.  I ordered two glasses of Zinfandel and they came in two different glasses (one a cabernet glass), again without explanation.  The berry crisp was inedible: not hot and no \"crisp.\"  One star for the tater tots, which were great, which was no surprise.  How can a tater tot not be great?  \n\nIf someone could let me know where the other Leatherneck Steakhouse is, the one with the good food, I'm there.", "author": "Pammy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-04", "description": "I picked this place after seeing a higher yelp rating than Morton's!  I had two lovely ladies visitng from Brazil and they wanted a good steak.  We were greeted in the bar by a 75 yr. old drunk Marine with plenty of \"salty\" war stories, oh, but wait it gets better; then a 40 something linebacker type couldn't stop staring at the ladies kinda creepin them out, shoulda left then, but we wanted that 4 star steak.\n\nI have to say the ervice was good and the prosciutto and mozarrella (warmed) was excellent.  I ordered the NY Steak and my frinds had filets.  The NY actually couldn't be cut with an sharp steak knife and was so tough and sinewy it was inedible.  The filet's were definitely tender, but it tasted old and with absolutely zero flavor; like eating a dishrag!\n\nSorry, I'm not out to trash the place, but come on, better than Morton's; don't think so", "author": "Kenneth B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "My husband and I took a quick trip to San Fran. I did some research and searched for a good, fairly priced steakhouse and boy did we enjoy this little hidden gem.  The views of the city are amazing, the piano player is incredible, and the maccaroni and cheese was TO DIE FOR.  Hands down the best mac-n-cheese I have EVER had.  They serve compementary bread, butter, an entire roasted garlic, and also veggies with a delicious cream cheese and sun dried tomato spread.  Our entrees also came with a bleu cheese wedge salad. We had the fried calamari which was some of the best I have had.  My husband had the New York Strip and I had the Ribeye, both were cooked perfectly.  We ordered the truffle tater tots as they seemed to be the big rave here on yelp - and this turned out to be the only thing my husband and I wished we had not ordered. They were very bland and had little flavor.  They may have been better with some sort of sauce to dip in (I dipped in my bernaise sauce and still was not satisfied), but I recommend skipping them altogether.  Overall - HIGHLY recommend Leatherneck Steakhouse!", "author": "Kendall M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Oh man, got off the elevator and walked into this great room and got slapped in the face with this view of the city skyline that knocked me off my feet. Wow. This was a first for us. We were seated right next to the windows. Pure old school. Relish tray and even roasted garlic for the bread. The entrees come with a wedge salad with blue cheese and sides were extra but were plenty for two people. Wife ordered the filet a notch more rare than usual and came out perfect. Every thing was delicious. Our server Miguel took care of us but was not pushy, just right. Great experience. Elevator down and onto the street to become part of that awesome view from the 12th floor of the Leatherneck.", "author": "Don Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-13", "description": "Great service , Great Food ....and oh yeah did anyone mention the VIEW? You are abut even with the start light room.Penguin is right on with the views of the park etc etc. Took wife and cousin for wife's 35th and had great time . Started with calamari french onion soup and the oyster Rockefeller .. all were great. dinners came with wedge salad with their own dressing that was quite impressive.never would have tried a \"wedge\" of lettuce unless it was given to me.but that's just me. roasted garlic for your bread. the Mrs had the prime rib good size and \"pretty good\" her words. Cousin Dre had the shrimp pasta that she \"loved\" her words. and a Beef dish with a 6oz American Kobe which was awesome in flavor aroma and presentation. we all shared the asparagus hollandese , massed potatoes. so good we had to finish those first since they don't travel well. the ladies had way more food so they some to go. Just picked this out with a little from my Yelp friends and it paid off. Thanks!!", "author": "Rich L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-28", "description": "i am giving this restaurant one star because i was very disappointed and displeased with the service here. a few days before coming to this restaurant, i called to make reservations for my brother's birthday. a male hostess answered the phone. he asked if i was a guest at the hotel, my name, and phone number and time and date that i wanted to come in for dinner. he said he will write it down and that i was set for that time and date. so a few days after making this reservation, i come to the restaurant. i told the hostess that i had reservations at 530pm, but then he said that my name was not there. he even let me check the book. and i checked for myself and my name WAS NOT THERE. the person i was talking to on the phone said he would WRITE MY name but OBVIOUSLY didn't because my name was not under the time and date. I was very annoyed and pissed off because the male hostess i talked to the phone lied or forgot or something and did not write the name. it was my brother's birthday and i was pissed that he didn't even write my name like he said he would. the hostess said he didn't even have a table for us and that we had to wait until happy hour was over. he didnt even TRY to accomodate us after not even putting our name on the list in the first place. (im not sure if he was the hostess or not that i talked to on the phone). he just said wait for happy hour to be over. i said okay we'll do that but he didnt even ask for my name or phone number.  For that i am never going back because of the TERRIBLE service. i didnt even try the food... but dont come back here due to poor service and when the employees don't try to accomodate you after forgetting to put your name on the reservation list.", "author": "Sharon E."}
