{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Great place with excellent oysters, and I highly recommend sitting at the bar. \n\n6stars if possible", "author": "Sky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Oh my. This place is amazing from top to bottom.\n\nWe made a last minute reservation for my birthday on a Monday evening. Coming back from a day in Point Reyes, I had oysters on my mind and we were running late. A quick call to the restaurant regarding our delay and it was not a problem that we were running 10 minutes behind schedule.\n\nLocation: Located in FiDi, I can see this place having a pretty happening happy hour. I kind of wished we were back in the city early enough for it, but oh well. \n\nAmbiance: Walking in, it's dimly lit, but the tropical wallpaper keeps the place looking modern and fresh. The seating is limited and it as pretty packed when we walked in - glad we made that reservation! I can see why this place won Best Designed New Restaurant by Bon Appetit (as well as being a James Beard nominee)! Both great for a classy happy hour or a romantic date night.\n\nService: Excellent service! Very friendly and attentive.\n\nDrinks: I didn't have any expectations regarding the cocktails, but after reading captions for pictures of the Garden Party and being a gin lover, I had to order it. Probably one of top three favorite cocktails ever. Delicious. You could taste the gin, but the herbs, jardesca, and egg whites just complemented each other really well and it went down smoothly. There are few cocktails I ever crave, but I can see this being one of them. The second cocktail I had was the Barbarita which was also nice and refreshing, but the Garden Party was hands down my favorite.\n\nFood: We came mainly for the oysters so we basically just went down the list and tried at least one of everything for the plain raw oysters. There were a couple that we ordered doubles. We also tried the uni topped oysters which were divine. They were served with a couple sauces, but honestly, they all tasted better plain. There was one type that was rather salty and the sauce helped cut the salt. In terms of hot food, we ordered the crab and artichoke dip served with potato chips and the octopus. Both were delicious. The dip had nice chunks of crab and wasn't overly creamy. The octopus was perfectly cooked and not chewy at all. For dessert, my date and I split the lemon mousse with brown butter streusel and strawberries. It was just the right amount of sweetness without being too much at the end of the meal.\n\nPrice: This place definitely isn't cheap, but they have a great happy hour deal that could save you some dough. It's worth it for special occasions, though.\n\nWould I return? Anytime!", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Vintage Mermaid Everything.\n\nThis place is gorgeous inside. Dreamy lights, tropical wallpaper, and antique-styled glassware. Prices are a bit high, but it's worth it since the service, space, and food/drinks are bomb. \n\nOysters are $1.50 during happy hour and you can get a delicious Rose for $10 as well. The perfect romantic spot to impress someone or even to just chill and feel fancy.", "author": "Patty B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "For the price, I expected Leo's to be a better experience overall, but I walked away questioning whether I'd want to come here again for food or just nice photos.\n\nAs everyone else has said, this place is absolutely photo worthy. It's beautiful inside and out, particularly the front of the house with the natural light.\n\nWe arrived on a Monday evening at 5:00 pm. A waiter walked up to the hostess desk and looked and sounded about as interested in helping as he would be watching paint dry. When I asked for a table for two, his reply was, \"We're currently only serving from the Happy Hour menu, you ARE aware of that, right?\" I knew very little about Leo's before showing up so, no, I didn't know we'd arrived at the tail end of Happy Hour, but I figured we could order a drink and wait a half an hour before ordering from the dinner menu, which we did. Not sure why the attitude was necessary. We were seated in the corner table, to the right of the entry.\n\nOur waitress was bizarre. She was nice, but with a discernible air of judginess. I ordered the Bubble Bath cocktail ($14), but when my boyfriend tried to order the IPA and was told it was sold out (and had been since Saturday), he decided to go with water instead and her disapproval was noticeable. She perked up a bit when he decided to go with the Station J cocktail ($14), but as the night went on she seemed increasingly less enthusiastic about serving us. She was also a little pushy about trying to get us to order more drinks when we weren't even done with the ones we had.\n\nIt took about 20 minutes for our Happy Hour order of two Little Leo oysters to come to the table ($1.50 each), despite the restaurant not being busy. My boyfriend at least enjoyed the oysters and thought they were very fresh.\n\nJust after 5:30 (and the end of Happy Hour), we ordered the fries with dynamite sauce ($7), tea leaf salad ($15), and the raviolo ($21). Service got slower from this point on; a huge Salesforce party was being held in the back room, which was straining the servers. The fries and salad came out first. The fries were incredibly good, super hot and crispy, with a spicy dipping sauce that had tiny roe mixed in. Interesting, but the fishy flavor wasn't exactly what I wanted out of that sauce. The tea leaf salad was fine, but definitely underwhelming. If you're looking for a tea leaf salad to rival Burma Superstar's, this isn't it. It was lacking that punch of complex flavors I'm accustomed to.\n\nWe saved a portion of the salad to eat with the ravioli, but we didn't know our waitress was waiting for us to finish the salad before bringing the entree. It took a half an hour of sitting with half a plate of salad in front of us for her to come around and confusedly ask if we were done with it. We said we were still working on it, which really threw her off, and she said she hadn't brought the ravioli because our small table wouldn't fit both plates.\n\n...What?\n\nShe asked if we were ok with putting the salad plate on the ledge on the wall we were seated against and we of course had no problem with that. Her hesitancy seemed even more comical when she brought the ravioli and we comfortably fit both plates of food and our serving dishes on the tabletop. Why she took so long to approach us when she'd apparently seen we'd been sitting waiting for the ravioli for so long, I don't know, but I've never had a waiter not bring out food because they thought the table was too small to fit the plates, or wait 30 minutes to express such a minor concern.\n\nRegardless, the ravioli was stunningly plated and looked like a springtime painting, covered in edible flowers. The ravioli were unusual in construction; they were large, flat sheets of pasta filled with ricotta in a brown butter sauce and folded over to house the cheese, rather than the stuffed pasta one might associate with ravioli. The flavors were light and delicate and the heirloom tomatoes were juicy and bright.\n\nWe finished the meal with a pineapple sundae ($7), consisting of vanilla ice cream, candied pineapple, pistachios, and caramel. I thought the sundae was just the right amount of sweet without being nauseating. Perfect size for sharing, and definitely enough for one person without feeling overly stuffed by the end of the meal.\n\nTotal before the tip was $93.00. The only dish that really blew me away was the ravioli, for its presentation, flavors, and portion size; while the sundae was great and the fries were tasty, it's not like spending an arm and a leg at Leo's is the only way to get a good sundae or some decent fries in the Bay Area. It feels like you're paying more for the experience and the bragging rights of saying you've dined at one of the most Instagramable locations in San Francisco. And the slow, strange service isn't exactly a lure to come back.\n\nBut there are a handful of things on the menu I'm still curious about, so I'd be willing to give Leo's one more chance to impress me with the food, rather than the decor.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Had to make a stop for the oysters!  And happy that we did.  We ordered a west coast variety and they were some of the best oysters I have ever had.  Sweet, succulent, plump little morsels of oyster heaven.  Shucking is an art form that Leo's definitely has down.  The presentation is spot on and I love the decor of the entire place.  Photo-worthy, for sure.\n\nIt's an upscale location so be prepared to pay a little bit extra.  I felt like I was living my best life and would happily visit again, our waiter was so friendly and made us feel at home.", "author": "Lindsey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Came for the happy hour but just missed it at 5:30.   Still had a bottle of wine and oysters.   The oysters are quite expensive when not in happy hour so don't do this often.  \n\nNote that the front of the restaurant and bar can be really loud.   If you make it to the way back it's a bit quieter.  They also have a party room which is good to know.  \n\nBesides the raw oysters also had grilled octopus which was very nice.   Add a delicious lobster roll and was quite full.  Delicious.   The lobster roll came with chips not fries like some pictures show.  We did get fries on the side though and they were fresh and hot.", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "When Leo's first opened, the food was spectacular.  I went often on my own dime, but frequently suggested it for business lunches given the higher prices.  My last couple of visits, however, were disappointing.\n\nI have a tendency to stick with the same order if I enjoyed it the first time, so it wasn't until recently after I confirmed a shellfish allergy (Yes, I am heartbroken.) that I ordered entrees other than the lobster roll with skinny fries (and the Leo's deviled egg).\n\nClearly, Leo's is a seafood restaurant, so I guess it shouldn't have come as a complete surprise that the disappointing items were all non-seafood.  For example, the crostini of the beef tartare was rock hard (almost inedible, but worry not, this carboholic powered through and ate most of it anyway).  Now that I can no longer enjoy seafood, I probably won't come to Leo's again.  But, if you decide to go, stick to what they should be good at . . . seafood; and prepare to pay a lot for it.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "It had been a while since I didn't leave a new spot I checked out disappointed, so I give extra thanks to Leo's. \n\nThis is an oyster bar, so, naturally, we opted for alcohol and oysters. Cool concept drinks, and some of the freshest oysters I've had locally. \n\nOn my list as a go-to.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "Get that camera phone ready, this place is all sorts of photoworthy! I've been lusting over Leo's Oyster Bar for about a year now and finally made it in for some fresh oysters and cocktails. I made a reservation for 5:45 pm on a Saturday and while I'm glad our spot was held, we probably would've been just fine without it. The host led us to a secret-feeling back room that's just as fun and kitschy as the front, just sans natural light. Upon sitting down we took a look at both the food and drink menus. I'll note that if you're not into seafood, there are really only a couple things you can eat here (even the deviled eggs has some sort of seafood in them). \n\nWe ordered a round of drinks and a half dozen oysters--oysters are definitely on the pricy side, but really good. We tried two of the Grassy Bars from CA, two of the Drake's Bays from CA, one of the Irish Points from PEI, and one Saquish from MA. Love that they serve them with mignonette and green chile--I've never had green chile on oysters before, but I'm a fan.\n\nThe drinks were yummy, although a tad sweet and not very booze forward. I ordered the Garden Party to start--if you're into pretty cocktails, this is one to order. We were there celebrating my birthday and our very nice server suggested a tequila popsicle cocktail. This drink was as refreshing as it was fun and was honestly more boozy than the first one--not sure what it's called, but I would suggest trying it. I will say that my friend had their spin on a spicy marg and the last sip was so spicy that she was in pain for a little while.\n\nAll in all, I think this is a lovely spot to start your evening for some pretty vibes and not-super-boozy cocktails. This neighborhood, like most in SF, is very walkable for a post-HH dinner in the Financial District, Chinatown, or Union Square.", "author": "Megan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "This place is definitely bougie, with an island hipster twist. I LOVE the decor of this place.\n\n\nFor appetizers, we ordered tater tots and leo's deviled egg. Five dollars for one deviled egg is pricey, but it was SO worth it. The oyster on top with some kind of buffalo sauce, really put a new twist on the deviled egg. The tater tots definitely weren't what I expected, but they had good flavor.\n\nAs an entree, I got the lobster roll which was good, but I don't think it was worth $35. I've had bigger, meatier rolls for about $20 at other places.\n\n\nI'll most likely be back to try out their dinner menu.", "author": "Khrystine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "I really wanted to like this place and was looking forward to eating here and taking pictures (totally Instagram worthy). I was able to score reservation on Friday night and was seated in the middle room that had palm leaf wallpaper. I believe there's three rooms as I saw other guest going to another back room. \n\nOur server was kind and we were quickly given our menus and asked if we wanted sparkling or still water. You were also given a menu for the days oyster picks. Our waiter was kind enough to describe each oyster and where it was from. Each oyster cost about 4 to 6 dollars each. They also had a great selection of cocktails and I highly recommend the garden party. It was refreshing and delicious. \n\nUpon looking at the menu we decided we were going to have an array of appetizers along with oysters. We ordered the french fries the shishito peppers, tater tots, butterfish confit and half a dozen oysters. The highlight of my night was the oysters and unfortunately everything else was \"okay.\" We also never got out shishito peppers but our waiter apologized and I was feeling very underwhelmed by the rest of our dinner. \n\nAside from great photo ops I would only comeback for happy hour. I hear the oysters are $1 and the drinks were tasty!", "author": "Chantal Noelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The restaurant is beautiful, the staff is friendly, and the food is delicious. \n\nSit near the Raw Bar if possible, it's fascinating to watch them shuck the oysters. Each one is carefully checked and beautifully displayed. \n\nThe attention to detail is amazing, from the plating to the decor.", "author": "Tara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Service was outstanding, attentive and thoughtful. We ordered a couple of every oyster and they were all fresh and nicely presented. French fries were also good and paired surprisingly well with the oysters. Treat yourself to a unique experience in the beautifully designed space by Ken Fulk.", "author": "Rad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Had an amazing dinner! Ok server was Rob and he took great care of us. Explained the menu and helped decide our dinner. The lobster roll is out of this world. Great service. Great food. Great vibe. Will be back soon!", "author": "Brandon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Came into Leo's Oyster Bar on a slight whim. The day was overcast and we were instantly transported to a tropical oasis. The decor is so fun!\n\nWe sat at the bar, ordered some drinks and a lot of oysters. (What else would you do at an oyster bar?!) \n\nWhile it was slightly pricey, the quality was great and I would definitely recommend this spot for a few drinks and oysters.", "author": "Alexandra K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "This place was a bit fancier than I expected.  I really like the hip, palm leaves decor and hipster vibe.  I ignored the three $$$, but after getting the bill, that was completely accurate, especially with drinks.  It was worth every penny.\n\nDINNER\nOysters- my favorite are Little Leo\nMushroom toast\nBone marrow\nTuna dip\nLobster roll\nFries\nTater tots\n\nAll the food was really delicious, the service was amazing, and I have no complaints.  I highly recommend getting a reservation, we did walk in and had to wait a while.", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "I had long dreamed of having a seafood tower at Leo's, and talked it up to my friends. We finally went after work one Thursday, and were sort of disappointed. It's not a set tower/plateau as I am used to. This can be good if you like controlling what you get, but the presentation was lacking and I felt like it wasn't worth the price. Bafflingly too, for an oyster bar, the staff are either not knowledgeable or coordinated. My friends described flavor profiles and what they enjoy in oysters, and got wildly conflicting recommendations. \n\nI would skip the \"composed\" oysters, unless you're okay paying an extra dollar for a small shaving of melon or veggies, or extra $3 - $5 for an even smaller amount of uni or caviar. I am especially bitter that the cocktail shrimp was $4 per shrimp, and ONE crab leg was $14. Two lobster claws were equally painful at $26 per order. I am not a cheap person. I will pay a good amount for things that are worth it: anything rare or unusual, or perfectly executed. I understand raw seafood has its price, but I have never felt as badly bilked as I did with Leo's raw menu.\n\nI also felt the servers were very pushy in trying to get us to order more, to the point where I was getting annoyed. We made it clear that we were there to have the seafood plateau - which we had already spent a good amount on - would order something from the cooked menu once the kitchen opened at 5 pm, and were happy with our drinks. At first I thought they were being attentive by coming over to refill our waters or freshen our napkins, but it soon became clear it was always to ask if we would order more. It's a shame, because the ambiance could be great for a date night or special occasion with friends (this was our reunion after over a year of not seeing each other, so I really didn't appreciate all the interruptions). I would like to give them another shot, because the dinner menu sounds incredible and like it could be worth the pricing.", "author": "Cat N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "My first time ever trying oysters(and my first yelp review!) and I couldn't be happier that it was at Leo's! Gui(or however you spell it, pronounced \"ghee\") was incredible at helping my party pick and choose which ones to try. I went with some oyster loving folks and they really enjoyed it as well. Cocktails were wonderfully made. The prices are sliightly higher than just your average joint, but you are paying for the atmosphere, ambiance, and service. Well worth it! \n\nLOVED the interior design. Tip: if you want to snap some good pics, get there right at opening!", "author": "Katya F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "As I was walking in the restaurant, My heart dropped and I fell in love. The interior is just breath taking. \n\nMy friend and I got to sit at the bar, near the oyster station. We got to see the whole restaurant from where I was sitting and I love it. Services was great. Everyone was helpful and knowledgeable because I had a lot of questions. \n\nStarted with cocktails. **Garden Party (GIN, jardesca, egg whites and fresh herbs) It tasted great and super pretty too. From the raw bar, we got half dozen of **Fresh Oysters. They are pricey, around $4 per oyster but they are so sweet and fresh. Wish we got more. Also go some **Baked Oysters (UNI butter baked oysters, ahi tuna and lime) as well because I saw uni and I couldn't resist. They were so good, not overly salted which was great!  **Foie Gras Toast, each bite was full of flavor. They use uni butter too, scream OMG. \n\nLarge entrees I got to try the **Steam Clams. The sake booth was perfect. It's made with octopus, who does that? So delicious! My friend got the **Braised ShortRibs. Very tender but if I'm at Leos, get the seafood. Can't wait to come back.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "Things really add up quick here so if you're not expecting to shell out $80 bucks per person for a nice dinner then you might want to rethink your casual dinner option. But, for a special occasion this place is great, beautiful ambiance, friendly service, water constantly being refilled without asking, exchanging plates consistently, amazing cocktails. This is a Treat Yo Self kinda place.\n\nI came here with my boyfriend to celebrate my birthday. I read on yelp that people could make a reservation and get happy hour. \n\nWhen I asked if we could order from the happy hour menu the waitress said they don't do HH. Disappointed! I'm guessing HH is only at the bar, but she so definitively said they don't offer HH that it was confusing.", "author": "Candice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-22", "description": "3.5 stars.  Came for dinner with my boyfriend tonight.  Everyone was super friendly and attentive.\n\nI had called ahead to see if we could move our reservation up and they said they had availability but in the front area.\n\nI actually didn't realize that the restaurant was so big!\n\nWhen we arrived, we had a nice corner table facing the entrance.\n\nThe menu looked great.  Lots of different choices and I was a bit leary leaning towards the meat but the short rib dish was calling my name.\n\nOur waitress recommended the lobster roll and the salmon.  However, we decided to go with the Hamachi and ribs.\n\nTo start the tea leaf salad... It was ok, honestly felt like I've had better at more low end restaurants so was a tiny bit underwhelmed.\n\nThe Hamachi was simple but probably my favorite dish.  I love me some avocado ha!\n\nThe ribs were good but portion was definitely a bit on the smaller side. \n\nOverall loved the ambiance and the service but the food wasn't spectacular.  Maybe I'll try the lobster roll and give more love though.", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Most romantic cute date restaurant! Loved the decor. Kind of loud but amazing food and drinks", "author": "Lillian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "Atmosphere:  5 Stars. Love the bold floral wall paper, the amber toned lights and gold accented furniture. This place is really beautiful and is great for date night or girls night. Would definitely just come back for the chic atmosphere. \n\nFood:  3 Stars. For 3 people we got 3 raw oysters, 3 cooked oysters ( two uni butter and one deviled egg) Japanese hamachi, foie gras toast, bone marrow. For dessert we got the pineapple sundae and the apple crisp. The bone marrow and foie toast was really good.  The uni butter on the foie toast gave it a smooth decadent flavor. The raw oyster was super small!  Like the size of a clam but it has great flavor. The cooked oysters were not good. They tasted very oceany so I will just stick to raw next time. The hamachi was ok. It was a little salty and tart. Nothing too special about the fish.  \n\nThe desserts were good but again unfortunately nothing really special. The ice cream was in fact a let down for me. A little too icy. \n\nValue:  2 Stars- overpriced.  The portions are incredibly small and the menu is very overpriced. All three of us came not that hungry and left not that full. If you're looking for a satisfying meal be sure to bring the $$$$. \n\nSo overall this is a three star place but I bumped it up to four because I honestly would come back here for the beautiful space and atmosphere. It was a really fun night and if you have the money or don't mind spending it, why not?", "author": "Suzanne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "Super cool space...but i wouldn't expect anything less from designer Ken Fulk.  I love the glam feminine touch everywhere!  \n\nThe food itself is good but slightly pricey.  The oysters and clams are fresh, the baked oysters were delicious.  Bone marrow with uni was on the smaller side.  The deviled eggs were tasty but expensive at $6 a pop. I enjoyed my Lobster Roll as it was filled with large chunk of lobster meat on a buttered bun.  I was able to order a side of ahi tuna instead of getting it with the salad.  Besides the Lobster Roll, the other highlight for me was the Bloody Mary drink- it was spicy and perfect!  One sip woke me up!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-26", "description": "Picked Leo's Oyster Bar for my last hurrah in SF....BAD idea. \nAmbiance and decor is great. \nAmazed at the variety of oysters - so we got all of them!\nAt the time, they tasted great.\nTwo hours later...I'm sick to my stomach and vomiting up my $$$ meal.", "author": "Hieu H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "Mostly incredible food, fun/tropical decor, awesome staff.\n\nThis was almost a 5-star review. It came SOOO close. There were a couple things I had that I didn't love, but damn, this was one of the better meals I've had this year!\n\nThe hits:\n\nCaviar bite with caviar, creme fraiche, and truffled beet pancake - HOLY HELL THIS BITE IS FANTASTIC. It's literally a bite, but wow... I could have eaten these all night long and nothing else. The perfect balance of salty, sweet, and creamy. The beet isn't overwhelming at all (I'm not a huge beet person), nor is the truffle. The tiny little chives and crystals of salt on top are just enough garnish to feel fancy without being pretentious, and the little pancake is a pillowy puff of goodness below a brief taste of ocean. I can't with this. So. Good.\n\nLobster roll with uni butter, brioche, and french fries - this is the best lobster roll I've had in SF. Not ever, but definitely in SF. There was literally nothing in it other than lobster and butter, which is how it should be. Nothing to get in the way... the lobster was fresh, tender, and flavorful. The fries were crispy, topped with flakes of parsley, and served with a side of aioli. This dish truly let the lobster shine and I enjoyed every bite.\n\nSmoked tuna dip with roe and togarashi crackers - all the pieces here were fantastic. The crackers were super crunchy and a little spicy. OMG to the smoke on the dip. It's like eating wood out of the smoker, in the absolute best way. The texture of the cracker paired well with the softer quality of the dip and the roe on top was a nice touch. I wouldn't have minded more of it.\n\nThe others:\n\nJapanese hamachi with charred avocado and sea salt - the fish was super fresh. The hamachi itself was perfect and I liked the earthy flavors brought in from the olive oil. The rest of the dish was kinda just ok though... the avocado was nicely charred, but it was also slightly brown and not quite ripe. The dish also didn't need the extra salt.\n\nCaviar bite with salmon roe, salmon tartare and capers - this one was much fishier than the first caviar bite we had. I was ok with it, though it was a turn off for my friend. Between the salmon and the capers this was also a very salty bite, though it was slightly balanced out by the dill. It was served in a little mini pie crust... the first bite was good for me, but as I got to the crust a mustard-type flavor kicked in and between that and the thick breading, I lost the fish flavors I was enjoying.\n\nCaviar bite with trout roe and broiled trout - slightly gingery, slightly smoky, a bit of soy, crispy broiled trout. I liked this bite, though not as much as the first.\n\nOverall, I loved Leo's and I'd definitely come back. While pricy and small portioned, I thought the quality and freshness of the fish largely justified the prices and our server was beyond excellent.", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "The oysters here were delicious as were the two different soups, bisque and clam chowder. Service was prompt and professional and I loved the design of the space. The great surprise was the amazing desert for $5, the chocolate mousse!", "author": "Andrea Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I have come here twice - once for lunch and once for drinks & dessert. Absolutely loved both times. \n\nFor lunch, what I loved were the oysters, salad, and pineapple sundae. I also tried the shrimp and salmon burger. The shrimp was good, but standard. The salmon burger was lovely, but I think I would like to try a different entree next time. \n\nFor drinks & dessert, I loved the lucky tanuki, station J, and lemon mousse brown sugar streusel strawberry. The garden party was just okay for me, but maybe it's because I like my cocktails less concentrated in alcohol :). \n\nThe servers are extremely knowledgeable and very kind. I highly recommend this place for its food/drinks, service, and interior decor!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Wow! This place was great. Our sever Rob was of great help, and made us feel like we were regulars. The food and ambiance along with a great sever makes for a 5 star experience, and the oysters, lobster roll, and the must try deviled eggs with fried oysters on top all lived up to their hype. We will be back again next summer, thanks!", "author": "Patrick R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "The good: Beautiful decor and the bar looks great. Excellent foie gras toast and specialty oysters (we ordered the fancy oysters and the one with the uni on top). We especially appreciated the chef coming out to apologize to us for the wait on the oysters and gave us two complimentary ones. \n\nThe not so good: The other food that we got, the smoked tuna dip (okay) and clam chowder (good), came out pretty late and out of the order that our waiter mentioned it would be in. Service overall was alright considering that the restaurant was full while we were dining. I would have given this place 4 stars, but docked off one because we paid with large bills and waited to get change back. However, a few minutes later we saw our waiter pocketing the change that we were expecting back at the cash drawer. We had planned on tipping fairly close to the amount that was taken, but I believe that it's just common courtesy to not assume that we didn't need change back or at least ask if we needed the change.", "author": "Tien N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "My favorite restaurant in SF. And I have been to plenty. \n\nAesthetic is awesome, food and service.\n\nDeviled eggs with the fried oyster are a must! Lobster roll is also the bomb. Don't let these broke, tasteless people sway you otherwise lol", "author": "Chelsea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Beautiful place to eat oyster and drink a good wine. They have a Happy hour for $1.50 each oyster!! Amazing I love it", "author": "Stephanny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "I loved it here, & I hardly ever eat oysters!\n\nFront room, middle room, back room.\n\nThe front room is warm & boisterous, w a full bar running along the left, & tables aligning the opposite wall on the right.  The middle room has a much smaller bar, & is far more low key than the front room.  The back room was hosting a private event, so I couldn't check it out.  The palm tree, pineapple, island/plantation decor is fabulous.  This theme runs throughout each room, & the vibe is very old school, very relaxed, while still possessing an element of sophistication.\n\nFrank Sinatra meets Tommy Bahama, & they get along swimmingly.\n\nThe menu continues the elegant vibe...foie gras toast.  Caviar.  And of course, oysters for days.  \n\nUnfortunately, I didn't have caviar this visit.  But the foie gras toast, & the oysters, were fantastic.  I can also recommend the seafood bisque, perfect on a typical SF chilly night, & the crab & lobster cake.  Perfectly moist, w the crab & lobster presence well balanced.\n\nService impressively balances that tightrope between polished & easygoing...which completely befits the whole culture of Leo's.\n\nAnother successful addition to the Park Tavern family.\nAnd a nice escape for a couple of hours.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Tots, oyster carbonara and lobster roll are all you need to leave like a happy little fat kid from the cupcake store.  Would I come on my own dime? ehhh maybe if I were some lucky rich kid that got blessed with a crap ton of money to sit in an office to SAVE THE WORLD WITH TECHNOLOOOGYYY YEUHH...but since I'm not it would be pretty hard to come back and pay for it myself unless it's a special occasion.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-19", "description": "I love them raw.  I love them cheap.  I love them simple, with just lemon and hot sauce.\n\nBut I don't love to share them with the table next to me.\n\nIf you eat at Leo's and want a little privacy, try to avoid the front room and head on to the back dining room.  Even in the back, you still won't find much privacy, and you're certain to hear every word of conversation from the tables next to you.\n\nDon't get me wrong, oysters were good, albeit pricy, but it's the other small dishes that were just marginally good and not really worth the money that I paid.  I guess someone has to pay for the décor.\n\nThe place has a nice vibe, but I can get the same oysters for half the price elsewhere.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "My husband and I had one night in San Francisco and dinner reservations at Mr. Jiu's, so we wanted to squeeze one more dining experience in before heading home. Leo's Oyster Bar suited us nicely. We walked in around 6pm on a Tuesday, and were able to be seated at a table as long as we were out by 8pm. No problem.\n\nThe decor is really pretty, especially the wallpaper. We ordered half a dozen west coast oysters and chilled king crab legs, as well as a martini and champagne for pairing. The oysters were really great, but I loved the king crab leg the most. The shellfish was served with standard shallot mignonette, but also a spicy spiked Japanese mayo, which I preferred on the king crab leg.\n\nOverall, a very pleasant aperitif experience.", "author": "Meghan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "This is another place I wish I could just Live in. I enjoy coming here for boozy lunch during the week or a quick happy hour after work. \n\nI am so in-love with Leo's because it takes me to Miami. The decor never get's old and the service is great. My menu favorites so far are the deviled eggs and oysters on the half shell for apps. Shrimp roll for main and bubble bath or liquid lunch for cocktail (the pickle medley that comes with the liquid lunch is heaven on earth) Every time I order the liquid lunch, I remain buzzed for the rest of the day...not sure how one drink can do that. Magic I guess. \nLast time my friend got the tater tots and they were the fanciest gourmet tater tots I've ever seen so I'm definitely trying next time. I got my eye on the Clam Chowder too for warming up on foggy days.\nEvery time I come the staff has been pretty accommodating with seating us even if we walk in without a reservation. THE ONLY reason I'm not giving 5 stars is that it's just pretty spendy, but, this is SF...", "author": "Shayan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "What an amazing spot! Seriously one of the best places to eat in the city. Definitely the best in financial district if you're looking for fresh, tastey seafood, with a great vibe. Super good music playing, friendly and good looking staff, great wine/cocktails/champagne. \nToday I had the lobster roll which comes with a spicy aoili and a side of fries. I had the dark chocolate moose for desert. Words can't describe the pleasure... \n\nThis is a good spot for a date, casual co-workers on lunch, after work drinks, whatever works honestly. This is all around a great spot to know.\nMy server was Rob, who was friendly, funny, and super cute tbh. \nThe host is super sweet and cute, the manager is also such a nice woman. \nKathrine at the oyster bar was working super hard while I ate at the \"raw bar\" she was friendly and accommodating. \nNot to gush over everyone, but I am just totally impressed by everyone that has served me here.\nI've never had anything short of a perfect experience.\n\nIntimate. Fun. Fresh. Friendly. Incredibly tasty.\n\nDoesn't get much better than this!\n\nDefinitely one of my go-to spots, forever.\nIf you don't try it, you're missing out.", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-27", "description": "Came here for lunch, it was OK. We were seated in the back, I didn't particularly like the decor: the art deco theme with leafy-patterned wallpaper, gold-colored lights, and their cabana chairs. Hip music was playing way too loud for the lunch hour. It's not a good place for a business lunch because it's so noisy in here. \n\nTheir fries are spectacular, especially with that spicy aioli tip. I also had the seafood bisque, it was OK. The lobster roll was not worth $34. In fact, I didn't think it was anything special, and you can probably pay half the price for something tastier at a cheaper place. The lobster meat in the sandwich was quite chunky though, so good chunks of lobster, lots of meat, and not \"watered down\" with mayo. \n\nI didn't try their oysters, because at $5-7 a piece, I'd rather go to Hog Island or some other $1 oyster place.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "They have an awesome happy hour with $1 oysters and $25 bubbles- super cute place with a trendy vibe. Decent wine list and the other food is very nice- the salmon is very good as well as the corn soup (the jalapeño poppers weren't that great). The tea leaf salad was overdressed so probably wouldn't get that again. Overall, good service and great oysters!", "author": "Sashini W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "Came here to grab lunch with some friends.   We had a party of 8 people.  They were very accommodating shuffled some seatings around so we could all sit together. \n\nTook out waitress over 20 minutes to take our orders. We literally had to ask for everything. Customer service was not all that great.\n\nWe ordered a few things to try and thought it was alright expect for the oysters and seafood bisque. They're really worth the try.\n\nTheir little Leo oysters and Eloise were tiny but delicious. \n\nClam chowder was way too salty and didn't taste any clam. \n\nPickled vegetables. This was good.\n\nFries for the kids\n\nChamomile tea: took awhile for it to come out.\nBrooks cider was alright.", "author": "Hollie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "I like the idea of Leo's Oyster Bar far more than the actual food experience; it's masterminded by the same folks that head Park Tavern, of which I absolutely can't get enough. And it was hard to miss the many, many social media pics of not just their lobster roll, but the tropical, chic tiki bar-esque decor. I wanted in. \n\nBetween the four of us, I'd be surprised if there was something we didn't sample between the raw bar and a variety of both Small and Large Plates. I thought the deviled eggs were great, the fries crisp as can be, & the complimentary espresso mousse for dinner was exceptionally rich. Tater Tots and Crab and Lobster Cake were heavy, but not on flavor. The crab or shrimp cocktail didn't have a taste or texture I would come back for. With these negatives, I wasn't surprised when the lobster roll turned out to be just meh. \n\nThe decor is a gorgeous throwback to an era decidedly not ours (hats off to Ken Fulk for his vision.) And the few cocktails on our table were something to write home about. I wish I felt as enamored with the food as I am with the aesthetic here.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "Overrated and overpriced. Came here with two other friends for drinks and appetizers and was very disappointed. \n\nI'll start with the good: I will give them props for the design/ambiance. The decor was cute and inviting, albeit the lighting was so dark you could hardly appreciate it.\n\nNow, the bad:\n\nThough our own fault, we didn't reserve ahead of time and knew we'd end up eating at the bar, which is typically a-ok with us. However, the bartender who served us was rude and short with us the entire time which didn't make for an enjoyable experience.\n\nWe each had a drink and ordered the following appetizers:\n-Mookie Blues Oysters\n-Ahi Tuna Crudo\n-House-Made Tater Tot bites\n-Wild Mushroom Toast bites\n-Farro Risotto\n\nThe crudo and tater tots were yummy but the rest was unsatisfying. Additionally, all of the portions were TINY. Usually when my friends and I go out for \"drinks and apps\" and order 4-5 dishes we're full enough to skip dinner, but this was absolutely was not the case at Leo's. We were so hungry we went and got burgers and fries afterwards! The section labeled \"Bites to Share\" says that each serving comes with 4 pieces, and each piece is literally ONE BITE. Even the crudo which wasn't labeled under the \"bites\" section of the menu was one bite per person. The risotto entree was also quite small and was not an appropriate size for a main dish. \n\nThe worst part was the tab - after tax and tip the bill came out to over $150 for not enough food to fill the stomach of a 5 year old. \n\nThe combination of small portions, subpar food, high prices and bad service is a recipe for boycott. Unless I hear this is Jimmy Garoppolo's new favorite restaurant in SF, your girl will not be back.", "author": "Jessie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Tucked away in S Fran's Financial district, this is a veritable gem, actually three gems. Leo's is the first then in a back room is the Hideaway then beyond that the tiki bar.  \n\nThe cocktails are superb and the menu is both clever and well executed.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "My friends took me here for a late birthday get together. This place is great for happy hour and to hang out in the FIDI. It was super crowded so make sure you call ahead of time to save a table. started off with some drinks, we ordered the Rose, an our server was absolutely wonderful!  \n\nWe ordered a little bit of everything and shared the plates. We started off with Leo's Deviled Eggs with wing fried oysters, and they were great! The spicy sauce that came with it paired really well along with the fried oyster. We ordered two orders of fries because who doesn't love fries? \n\nWe then ordered a dozen raw oysters, house made tater tots, Leos Louie with gem lettuce, ahi tuna, braised short ribs wild mushroom goat cheese and truffle , crab and lobster cake, and Japanese Hamachi. \n\nI have to say all our orders for absolutely wonderful. The flavors and paring with each dish was great. The portions were good enough to share between the three of us. The raw oysters were fresh and creamy. The braised short ribs were cooked just right that the meat would just fall off the  bone. \n\nFor dessert we had the Pineapple Sundae, and lemon mousse. All cooked perfectly and display was awesome. I would effeminately come back to eat and have happy hour. I do have to say the place is very cramp .", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Not your typical \"old man\" oyster bar, has a light hip feel to the room. \n\nFood was on-point with lots of snacks to share over Cool cocktails. \n\nReally tight restaurant concept that gets all the details right to fit into a cohesive package.  Everything looks, tastes, and sounds bang-on!", "author": "Mark G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "Mixed bag\n\nService, oysters, deviled egg with oyster, were all thumbs up - 4 stars\n\nHousemade tater tots - 3 stars - neither good nor bad\n\nHouse sparkling rose - 3 stars - nothing wrong with the taste but priced a bit richly for a Cremant (definitely fair at the hh price of $10/glass - rather absurd for over $70 per bottle....remember, it's a Cremant that sell for under $20/bottle)\n\nThe rest - 2 stars - boring and WAY overpriced:\n1. Lamb Tartare - zero flavor - how is this possible? it's lamb!  lamb naturally has a strong flavor - and what about the spices that normally goes with a tartare?\n2. Crab cake - snooze....\n3. foie gras toast - another snoozer....", "author": "Lev E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Out of everywhere in SF, I chose to celebrate my birthday at Leo's Oyster Bar... and I would say it was a great decision.\n\nWe had reservations for 8:15 on December 1st, however we arrived early and the host was so kind to find us a seat at the main bar. We had cocktails while we waited for our table to be ready. The restaurant seemed full, and busy but certainly not packed.\n\nI had a dirty vodka martini, and it was delicious. My boyfriend had a maitai for some reason??? He enjoyed the drink but didn't love the glass it came in, I told him real men drink bourbon... but thats a whole different story. The bartenders were efficient and moved quickly. Everyone was very pleasant.\n\nI was happy when the host, came and lead us to a table in the back room. (Same room I was in, the last time I came to Leo's in October.)\nAs usual, the decor was beautiful, warm and inviting. We were quickly greeted by the server, who happened to be the same one as I got last time. The girl with the tattoos, Celiss.\n\nShe was very nice, attentive and described most of the menu to us, right away. I immediately knew what I was going to order. \n\nThough I love oysters, I very much prefer East Coast oysters since they tend to be more shallow and saltier. I did see they had oysters from PEI  but I decided to skip them since I am going back to NYC in a few weeks where I'll live off of Oysters for 7 days.\n\nI really wanted Tuna Tar Tar, but she kindly told me that they didn't have any, (bummer) but she recommended I try the Ahi Tuna Apple dish. I started with that, and fell in love. The tuna was very fresh and the apple was crisp. I've never had the combination of the 2, but I am glad I got to try it. Great recommendation! Kudos to the chef for a delicious appetizer.\n\nI spotted bone marrow on the menu and of course I had to order it. I love bone marrow and actively complain that I don't eat it nearly enough since no restaurants seem serve it, which I understand. Every time I see it on a menu, I always order it because if they have it, chances are that they know to cook it. The bone marrow was delicious, they serve it with toast and it spreads on like butter. I wanted to order 9 additional orders to go.\n\nWe had some more drinks, I don't even remember what they were.\nBut I'm sure they were tasty.\n\nFor the entree, I decided to go with the Short Rib and I 100% made the right choice. The short rib was tender, the potatoes were tasty and the butter that came with it, was delicious. I could literally bathe in a bathtub of this Short Rib with a potato puree, and I don't care what anyone thinks of this.\n\nMy boyfriend got the salmon, which was super fresh. It was cooked to a perfect Medium. I love that they didn't over cook it.\n\nFor dessert we had the apple crisp, along with the bittersweet chocolate mouse topped off with gold (for a real princess of course...) in the cutest pineapple shaped dish, along side a birthday candle.\nWe also had a creme de mint, after dinner cocktail which was mixed to perfection by the lovely bartender, Matt who never fails to mix a perfect drink.\n\nI over all had a great time and I would recommend Leo's to any of my friends, neighbors, friendamies, uber drivers, colleages, etc etc etc...\n\nThank you for the continuous warm hospitality and delicious meals/drinks.", "author": "Tati C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "The back 'tiki room', the French fries and amazing aioli sauce, the little Leo oysters from the Puget Sound, the hamachi, the butterfish, a very lovely evening in an uplifting room with fabulous (yes 80's) music.", "author": "Sheryl F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The back room is among my top 5 date spots!  The music and service is always .  10/10 be back for oysters and pineapple dessert trays", "author": "Kai Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "3.5 stars\n\nOysters. You either love them or you hate them and I love them. My friend wanted to check out this place and I was not opposed, especially when she showed me the cool wallpaper this place has (which you can buy online by the way). We got a few of the oysters and they were all really good, but my favorite are the baked ones. The raw ones were fresh and briny (which I like), but they were kind of small. This place was kind of dark and loud, so don't expect to have a deep conversation here.\n\nOverall, they oysters were good, but it was too pricey for my taste.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-17", "description": "Service was great, food was disappointing...\nWe ordered hamachi, lamb tartare, fougrue toasts, oysters, lobster roll and short ribs.\nHamachi was tasteless and pieces were very small. \nLamb tartare had a lack of spices,  wasn't salty nor spicy and therefore was tasteless as well, also meat didn't look fresh.\nFougrue toasts didn't have any fougrue... it had some kind of concentrated salty fougrue paste.\nOysters is the only dish that we really like, since they didn't have to do anything with it, they were kind of small though. \nLobster roll was cold with some tasteless French fries.\nShort ribs were chewy and again LACK OF SPICES!\n\nFor $30-$35 for the entree, I was expecting a much better quality food...\n\nDefinitely overpriced place, Not recommended for dinner, Ok just for drinks after work.", "author": "Roman L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Eat here asap. It reminds me a little of Indochine in NYC. \n\nThe miso trout (lunch menu) is like an Asian niçoise. I love that word... #niçoise ! Fries, well I nearly slapped my dining-mate's hand to get at them. The deviled egg, can you believe it? They put a fried oyster in it! That's some good interspecies mingling on my tastebuds.", "author": "Nia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "LOVED this place. Food was on-point, even while I was on an elimination diet. The server could not have been more pleasant, knowledgeable and accommodating. Atmosphere was awesome, as was the music. Amazing playlist at the perfect volume. Went on a Monday night and it was pretty chill. If you get there at 7 you can park at the meters. If not, there's a crazy expensive but convenient garage down the street (that closes at 9 on weekdays). Def check this place out. Sooooo good.", "author": "Maria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "My husband took me here for our anniversary dinner. Our friend was able to get last minute reservation at 6pm. For a Thursday evening, this place was busy. Cute interior. We sat in the front room next to the bar. Very small and we were all tightly packed. Dimmed lights with candle on table. Felt intimate. I heard there's 2 more dining rooms in the back. \n\nOur server was very attentive, sweet, friendly & helpful. Triple A plus for her service. I forgot her name. We told her it was our first time here. She recommended a few items for us and got us started. Their food is tapas style. Small portion. We ordered quite a few items - side of pickled veggies, toasted spiced nuts, two orders of wing fried oyster deviled eggs, 8 specialty raw oysters, foie gras toast, madai snapper with puffed vermicelli, clam chowder, tater tots, and shared a lobster roll with fries. \n\nMmmm, our favorites were the deviled eggs, foie gras toast & fries. Yes, the fries were addictive. Perfectly thin, crisp & salted. Yum. Foie gras was very delicious. The fried oyster crunchiness paired with deviled eggs is the greatest combo ever. Mmms, our taste buds got excited. Our eyes were LIT!! Next, the clam chowder & tater tots was also very good. We weren't really into the madai snapper. It was thinly sliced. The puffed vermicelli didn't go too well with it. Last, our main entree was the lobster roll. After eating all the other items, we were full by now. Good chunks of lobster in warm toasted bread. Again, those fries...yum. My tummy is growling right now just by typing this review at work.\n\nThey raw oysters were good but not spectacular. Nothing really stand out. We were able to try the specialty topped with uni and caviar. The oysters were too small that we didn't really had time to enjoy the taste. It was gone in an instant when it gets in our mouth. We did taste the saltiness and sweetness from the oyster.\n\nOur server gave us a mousse chocolate for dessert, compliments from the chef. It was creamy and good. You've got to try the garden cocktail. That was one creamy'licious cocktail I've ever had. I had two of these. It had the right amount of alcohol. Not too strong. Not too sweet. \n\nOverall, the food & experience was wonderful. Our server was great. Service was top notch. Water were filled constantly. Napkins were folded each time when we got up to use the restroom. It was a very expensive dinner, but it was worth it. We had an enjoyable anniversary dinner. We will be back for another special occasion.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-21", "description": "2.5 Stars\n\nGreat ambiance!\n\nGreat drinks!\n\nSo why the low rating, you ask?\n\nThe food and service was not up to par. It was not as good as expected and left us unsatisfied that night. We ended up going to another place right after we walked out of this restaurant. \n\nThe food that we ordered:\n\n- Raw oysters = Kusshi from WA ($4.5 per oyster). The only good thing that night. Fresh and sweet. \n\n- Japanese Hamachi ($17) with charred avocado and sprinkle with sea salt. Overpriced and could use more seasoning. \n\n- Class steak tartare ($20) - with uni and marrow. The wasabi sauce on the steak tartare masks the uni and marrow. What a disappointment!\n\n- Black Cod ($34) - with squash, pomegranate, and spinach. Once again they need to season their fish. It was bland and boring. Portion was also small. I'd say skip it!\n\nI'm glad I made a reservation for this place to be in the quiet room; otherwise you'll end up in the main entrance that is cramped and stuffy. Also, did I mention very LOUD!!!\n\nAnother new restaurant off my bookmarked list and definitely not a place I want to revisit. Kthanksbye!", "author": "Owie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "I love Leo's. This is my favorite place to take people for a special night out or just a \"treat yo' self\" kind of day. \n\nVibes.\nRestaurant decor and ambiance is very important to me. Leo's sets a beautiful dining stage-- from the high ceilings and beautiful floral wallpaper to the casual yet chic outfits of the wait staff. I immediately feel comfortable, cozy, and taken care of as soon as I sit down. \n\nDrinks. \nI believe that the menu of cocktails is very good (so other dinner companions tell me). But I cannot bring myself to order anything but the Garden Party-- a light, aromatic, egg-white drink with gorgeous floral garnish. I drink two every time I dine here. \n\nBites. \nRaw oysters-- Fresh, delicious, garnished beautifully. \nDeviled egg with fried oyster-- They are expensive ($6 for 1) but so worth it. I always wish I could eat a whole plate of these. \nHot lobster roll-- OMG so good. And if you want to split with a friend they will make you two smaller lobster rolls. It's precious. Comes with french fries and dynamite sauce (it's all in the name). \nClam chowder-- I used to live in the Boston area and can attest to its deliciousness. \nBraised Short Rib-- Falls apart and melts in your mouth. \n\nI would eat here once a week if my pocketbook and waistline could stand it! Keep it up, Leo's.", "author": "Carson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This place is super cute and the oysters are beyond tasty! Carlos was our waiter and he was very attentive. Amazing staff and amazing food!!! Great ambiance as well!!! Be sure to make a reservation too", "author": "Julie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "Nice place with decent food. A tad pricey for small portions. Be prepared to wait.... and then wait a bit more.", "author": "Brad S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "Food:\n-Oysters were wonderful - we ordered 12 total, they were averaging about $3/each, but were from all over the world - Prince Edward Island, New Brunswick, Washington, Maine, etc. They were delicious, and fun to try a variety from different places. \n-Foie Gras toast - TOO SALTY. Don't get this one. My bf and I love foie gras and uni, but man this dish was just not meant to be.\n-Japanese Hamachi with avocado, sea salt, and scallion - YUM. This was a good one. Not the best hamachi I ever had, but pretty damn good.\n-Leo's Louie combo (crab and shrimp) with gem lettuce, mache, radish, fennel, tobiko and egg. This was a great dish, really fresh ingredients. The dressing was a little too pungent and sour for my taste though.\n-Lobster roll with Uni butter, brioche and French fries - YUM. I hope you get this one. We shared every plate for the night, and what's great about this restaurant is that they just split the plate ahead of time for you. French fries great too. I didn't really taste the uni in the butter, but hey, it was an awesome lobster roll overall. \n\nDrinks:\nFantastic, actually. Probably one of the highlights of my night! My bf got the Mai Tai which was delicious, and came in this really cute tiki-themed cup. I got the Skinny Dip (vodka, aperol, watermelon, lime, tonic popsicle) which was fun - never had a drink with a popsicle in it before! Drinks were on the medium-strong side, and definitely worth $15/each. If I had to come here again, it would be for the drinks.\n\nAmbiance:\nVery cute inside, but hopefully you'll get to sit in the main dining area. We were shoved in this weird back room, with no windows. It was a weird experience. I didn't like being put back there - it made me feel forgotten about. Anyway, decorations are still cute in the back room, and overall the restaurant is super loud, and dark, which is frustrating.\n\nService:\nAlthough very friendly overall, I had one disappointing interaction. A lady who came to bus our empty plates from our table, asked us how we liked the dish. We told her that the Foie Gras toast was too salty. She said, \"I'll go talk to the chef about it.\" We never got an apology, or anything from the chef. That was disappointing. I mean, it's great they said they'd do something about it, but even more disappointing when you anticipate it and they DON'T. \n\nWas it worth it?\nNot for $135/person. I won't return. I know I'm being nit-picky, but if I'm paying that much, I would like to have a table in the main room, with service that follows up with their customers. Drinks were great though, so do remember to try one of their awesome cocktails.", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Yum, yum, YUM. I recommend a stop in at Leo's. \nDo make a reservation in advance.\n\nThings to eat:\n1. ($16) Wild mushroom, goat cheese, and truffle toast: very tasty flavors. I believe it might come with 3 pieces, so ask to add on a 4th if you're a party of even numbers.\n\n2. ($6/oyster) Deviled egg with wing fried oyster: really good flavors, maybe a bit more of a kick than expected, leaves you needing a bit of water but worth trying out\n\n3. ($16) Smoked tuna dip: a nice treat, the roe are a fun addition to the tuna spread\n\n4. Oysters....yeah...oysters\n\n-Great service\n-Cool environment though a bit cramped\n-Get ready to drop some $$$s", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "I love this Leo's oyster bar. Talk about great service and food from the becoming to the end. I didn't know they actually have a private tavern in the back room with a small amount of tables. \nAt first I was wondering why are we walking past the restaurant than we went through these doors and than we arrived at the tavern. \n\nWe tried every type of oysters they had on the menu and than some. They know their oysters and I have to say if you happen to be in San Francisco and looking for a place to eat some good oysters this place is it. \n\nAs busy as they are I recommend you call and make reservations.", "author": "Kalani S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "I love this place.  Their oysters are the BEST in the Bay Area.  You're going to pay for the quality of the food, but I'm happy to do that.  I've only been here for lunch which is fantastic.  I had the lobster roll this past visit with a glass of Verdiccio.  We had some of the specialty oysters as well as the plain ones too.  \n\nThe atmosphere is a fun, 50's style sort of vibe, which reminds me of Mad Men.", "author": "Alyse S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "If your in SF and your looking for an oyster bar, I would without a doubt have to say the Leo's Oyster Bar is the only place that I would ever recommend. First of all I still can't get over the adorable decor, I really felt like I was almost transported back to a cool little cocktail bar in the 1950's in Hawaii. It had an amazing almost island vibe. \nI am a bloody mary gal, so I ordered their bloody mary. It was delicious and exactly what I was looking for. We also ordered a bottle of wine as well. They had a pretty killer wine list both by the glass and bottle. \nTo eat we got two dozen oysters and got a few of every one they were offering that day. We also got each of their composed oysters, some cherry stone clams as well as some pickled king crab and house made pickles. Everything was absolutely delicious, the oysters were fresh and shucked to perfection, the composed oysters were perfectly balanced. Service was attentive with out being intrusive. The only downfall is that we all got there right after 2:30 which is when they stop serving their lunch menu and only serve items from their raw bar. \nNext time I am in San Francisco I will be sure to head back to Leo's to get more yummy oysters and this time get to try their delicious sounding lunch or dinner menu!", "author": "Roxy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Everything is so well done at Leo's. From the plants outside to the gorgeous massive doors to the wallpaper inside to the pictures in the frame - i could keep going- all the details have been so thoughtfully and tastefully done. The design is so spot on. We came for lunch so I got to appreciate all the details in great lighting. There were some high ceilings with skylights and it made for fantastic ambiance. \n\nUpon entering I was a little nervous the place was small and already pretty full. It was pretty cold and the only table available was the one next to the door. To my surprise, the hostess took us to the back where they had two more back rooms still wonderfully decorated and on theme. \n\nThe lunch menu offered a complete raw bar menu, hot oyster starters, appetizers, soups, salads, sandwiches, and entrees all wonderfully seafoodcentric. The fries and the \"dynamite\" sauce was amazing! I'm guessing it's a mix of siracha and mayo and little something extra? It's damn good. \nFor starters we ordered some lil leo oysters, and some other creek oysters and they were delicious and fresh. Nothing unusual to their oysters. They did serve it with a green chile vodka sauce but that wasn't my thing. \n\nI had a Leo's Louie salad with king crab. It wasn't what I was expecting in terms of looks but it tasted delicious! It came with a lot of side dressing but the salad already tasted so flavorful on its own. My coworkers got lobster rolls, and tea leaf salad. Both looked delicious. I'm def gonna have to come back for dinner service and drinks.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "I hear fern walls are very 2017, which means Leo's was ahead of the trend. It really is like stepping into a time warp here - there's been a lot of thought put into the space. Unfortunately, that time warp also applies to stomachs - while I really enjoyed my Bubble Bath cocktail, the items we shared were overwhelmingly rich, and yet I didn't feel full at the end of lunch...just groggy.", "author": "Heidi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Oysters are good but I think they are pricey since it's in financial district. We paid $50 for a dozen of different oysters. Perhaps You can get cheaper from swan oysters depot which is $30 for a dozen. \nThe lobster rolls and the foie gras toast are both good.", "author": "YingTung W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "I finally went back - I ordered the king crab salad, dressing on the side. My lunch companion ordered a seafood burger, I think shrimp and scallop.  All I can really say for certain is this chef LOVES pepper  Again, I was served crab covered in pepper.   I mean really, I ordered a crab salad because I wanted to taste crab, NOT PEPPER.   I had to send it back.  The dressing as well, loaded with pepper.  My dining companion said his burger also had too much pepper to enjoy.  I might go back in for a drink, but not the food - the food could use a taster with a palate imho", "author": "Suzy Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Clam chowder..... AMAZING.\nLittle Leo's oysters..... AMAZING.\nThe risotto...... AMAZING.\nThe clams.... AMAZING!!!!!\nEverything here was so wonderful. The decor was superb. The wait staff was so helpful. The check presenter was so cute!!!! I love the verde chile sauce they serve on the side for the oysters....ugh!! Who would have thought it would pair so well?!\nCOME HAVE AN AMAZING EXPERIENCE HERE", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "The challenge: two Asian girls with a giant appetite. \nThe problem: A table that barely fits more than 2 plates.\nThe order: about 8 different dishes. Plus drinks.\nHenderson, our waiter, was up to the challenge. \n\nI came here the other night with my friend. When I called to make a reservation, the host asked if we were celebrating anything. Uhh...friendship, booze, and food?? But it's a nice touch that they ask. When we arrived, they brought us to the far back side. I mean. Far. We passed three thresholds to get to this back tiki-style room that evidently used to be outdoors, but they turned into a private event space. By the end of the night, I think they showed about 5 different groups the space. Somewhat awkward for us...as after the other party left, we were the only ones there. So...we're part of \"selling\" the space for them? Hurm.\n\nHamachi Crudo: Delicious. Hamachi was very fresh, and the charred avocado was buttery.\n\nOysters (Hammersley, Hog Island, Little Leo, Olympia): Good general assortment. It got better and better, until the Olympia...which to me was too small and didn't have much flavor. Sad.\n\nHouse Tater Tot: Delicious. Seriously get this. It's got the fry of the tater tot, but with some delicious tapenade on top that's just yum.\n\nSalmon Tartare: Really good, and pretty nice portion. Very light and not fishy at all!\n\nCrab Cake: Bacon across the lightest horseradish ever. So delicious. And literally fell apart. \n\nLobster Roll: Probably just as good as the lobster rolls at Chelsea Market in NYC. Buttered roll was delicious, and it was crammed full of lobster. Yum. And hella generous with the fries.\n\nMussels: Very filling and SO good. The bread accompanying it wasn't as great, but we started using the fries...which was worth it. I kind of wish the bread was thicker and just sauce-sopping. Mmm...delicious. \n\nWalnut Cookies: They gave us these (perhaps because we became their showpiece?), and they were pretty good. Not sure if I'd order it though.\n\nBlood Orange Creamsicle Float: Delicious. Just yummy. If you're into creamsicles, get this. If you have a small child (or are one at heart) order it to go with your meal. It's just good. \n\nWe also had a honey gin-based drink, which was really strong and very delicious. Overall. Really nice meal. The service, even though we were in the back, was enough but not annoyingly so. We never felt neglected.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "My friend and I stopped by here for after dinner nibbles. We thought that there would be a wait since the dining and bar area looked crowded. However, we were able to get seated immediately in their cute back room. We followed our friendly hostess past the dining area, past the kitchen, past the restrooms, through a discreet doorway, which lead us to a whole other dining area.  Seating was a bit cozy, but the vibe was great (loved the bumping '90s-'00s music). Our server was very warm, attentive, and friendly.\n\nAs we waited for our foie gras toast and bone marrow, we definitely got food envy watching the raw seafood platters being brought out. We agreed that next time we come back, we definitely Our food was absolutely delicious. The foie gras toast had the perfect ratio of toast to foie gras, with just the right amount of chives to cut and balance out the richness of the foie. The bone marrow was great for sharing, with each scoop of intensely flavored fatty scoop enjoyed on a piece of toast.\n\nUpon initially looking at their menu and seeing other people's food being brought out, I wanted to \"get alllll the things\", but obviously couldn't. Eagerly anticipating the next time I get to come back and try more of their delicious food!", "author": "Gloria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Oysters were phenomenal. We got to sample everything they had on their raw menu.\nDrinks were on point. \nFelt like the seating area was a bit too dark and squished, but other than that I will definitely return for some aphrodisiacs", "author": "Kehaulani K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Definitely a super instagram bait location! The decor is just amazing! I can't imagine how beautiful the front room would be when it's sunny. I ordered their ribeye salad! I normally do not like salads but the dressing that they used was super yummy! Everyone who worked there are super nice and friendly. They even offered to give me a tour of the place because there are two other rooms in the back with completely different decor!", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-12", "description": "I love watching reruns of The Golden Girls. Space cadet Rose (Betty White) and southern vixen Blanche (Rue McClanahan) are my favs. I mean, I don't know anyone who makes being a slut as classy as Blanche does - do you? I mean her initials: Blanche Elizabeth Devereaux spell B-E-D for phuck sakes.\n\nWalking into Leo's Oyster Bar reminded me of The Golden Girls with its quirky, retro garden patio party theme with non-instagrammable lighting. More specifically, it made me think of a place one of Blanche's men would take her before their all night rendezvous. Gotta wine and dine to get in that cookie jar...\n\nOur Plan A (The Morris) fell through since their opening was delayed so my friend and I decided to go to Leo's Oyster Bar after having sat in our bookmarks for months. \n\nDon't even think about coming here without reservations unless you come super early and sit at the bar. It's super cramped and tables are literally inches apart so only come here in pairs. Finding street parking was pretty easy on a Saturday night. \n\nMy friend and I arrived early for our 5:30 pm reservations. We were told our table wasn't ready so we grabbed a drink at the bar which has the most uncomfortable wicker (?) bar stools. I was thanking my lucky stars that the vintage stool didn't break in half when I sat on it.\n\n~ * ~ D R I N K S ~ * ~\n*Garden Party: Hendrick's gin, jardescsa, egg white, fresh herbs ($13): http://bit.ly/2e3FP4Z\n Almost too pretty to drink, the Garden Party was well-balanced and had a good creaminess. \n\nWhen are table was ready at The Hideaway Room, we were disappointed with the cocktails there. They were not as visually appealing as the ones at the front bar and didn't taste as good. \n \n*Honey Lynn: Honey infused gin, absolut elyx, lillet, lemon bitters ($14): http://bit.ly/2dIVSl7\nThe Honey Lynn was their take on a Vesper but there was no honey taste. \n\n*Banana Daiquiri: Pampero rum, banana liquor, lime, spices ($14): http://bit.ly/2eoZf31\nMy friend's Banana Daiquiri oddly smelled and tasted like peach schnapps so it was exchanged for something else.\n\n~ * ~ F O O D ~ * ~\nAs others have mentioned, the food prices are $$$$ which is fine IF the food was amazing. It wasn't.\n \n*Oysters & Cherrystone Clams ($3-$5 each): 3.5 STARS\nhttp://bit.ly/2dJw0Jz\nI only had one of the cherrystone clams which were meaty, tender, and slightly bitter. My friend enjoyed the raw oysters.\n \n*Oyster Carbonara w/ crispy pancetta ($5 each): 3 STARS\nhttp://bit.ly/2ep1G5S\nToo salty. Should have took the advice of other yelpers and skipped this.\n \n*Baked Oyster w/ ahi tuna, seaweed, togarashi ($5 each): 3 STARS\nhttp://bit.ly/2ecO8LE\nToo salty. Again, I should have took the advice of other yelpers and skipped this.\n \n*Leo's Deviled Egg w/ wing fried oyster ($5 each): 5 STARS\nhttp://bit.ly/2d5wFnq\nLove the uber crunchy oyster crowning the deliciously creamy deviled egg. Yah, it was $5 for one bite but it was the perfect luxe bite and we wanted to order more but couldn't. More on that later. \n \n*Salmon Tartar w/ marrow, capers, dill ($16): 3 STARS\nhttp://bit.ly/2du6Fy9\nMy friend thought it was fine but I thought the saltiness of the capers completely overpowered the delicate flavor of the salmon. Plus, the toast points weren't evenly toasted so they were chewy in the center.\n \n*Foie Gras Toast w/ ginger, soy, scallion, uni butter ($20): 2.5 STARS\nhttp://bit.ly/2e3Fxeo\nFoie gras and uni are two of my favorite loves but not in this case. The flavors were muddled and one of the toasts I had was insanely salty while the other piece was too sweet. Ugh, such a letdown since this was the dish I was most excited for.   \n \n ~ * ~ S E R V I C E ~ * ~\nFor the amount that they charge, service was unacceptable. \n\nOur server was unwelcoming and inattentive. When we were seated in the back lounge, we noticed \"The Hideaway\" cocktail menu seemed different than the menu in the front. My friend asked our server about it. She coldly replied, \"It's ALL the same\" and walked away. It wasn't. The lounge area had 4 additional \"Hideaway\" cocktails but whatever. \n \nOk, maybe she was having a bad day. \n\nNOPE, she was noticeably friendlier and chattier with the table next to us. \n\nAfter ordering, our server pretty much ignored us. Since we planned on having a full dinner there, we wanted to order more food and our server was nowhere to be found. When she did pass by, she never bothered checking in with us. There were two servers and two other tables at the time so it wasn't busy. \n \nEff this, why stay somewhere you don't feel welcomed at so we asked another server (who was super sweet) for our bill and bounced to have dinner elsewhere. \n \nGoing in, I knew this place would be pricey but at $93 PER A PERSON for 2 drinks each and light apps which was literally 7-8 mediocre bites of food is ridiculous. And, to top things off with the absence of service, no thanks.\n\nUnless your sugar daddy or a filthy rich friend is paying, Leo's Oyster Bar is a total skip!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "I love the ambiance here and the food with drinks, compliments well with everything!  \n\nTheir crafted cocktails seem, themed!  I got the Island girl and it was tasty fun!\n\nI adore the petite bites here! Get their raw oysters as a starter served with pink champagne mignonette! \n\nDo get their signature Leo's Deviled Eggs with Fried Wing Oyster.  It is warmly delightful!\n\nTheir uni butter toast, topped with foie gras and scallions, is a must get! \n\nOne can't go wrong with any of the crudos!  The hamachi crudo was a sure win for sashimi lovers. \n\nOur waiter recommended the Mussels En Papillote!  The flavor from the mussels in a tomato soup-like plate with side toasted bread, was perfection for a seafood entree! \n\nAs the London lingo would put it, this spendy bar is swish!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "$1 oysters on the happy hour menu - great steal! They were some of the best oysters I've had in the city, just the perfect amount of flavor. Pretty boujee place, would definitely recommend going!", "author": "Cassy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "AMAZING service, atmosphere, food, and drinks. I was happy as a clam from the first deviled egg to the final chocolate mousse and port pairing (do not skip it!). \n\nMy only qualm: portions were surprisingly small for the hefty price tags on each drink and dish. I don't mind paying a lot for excellent food, but it was almost comical ordering the 'deviled eggs' and getting 1/2 of one egg. That said, the deviled egg was incredible and I would do it over and over again now that I've experienced it. \n\nAlso, I absolutely loved that they gave us postcards and pens at the end that they mail out for us at the end of the meal; such a cute idea!", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Went for drinks/oysters with coworkers and I certainly can't complain! The restaurant was very accommodating with the fluctuating number of people in our party - we were a table of 8. \nI was nervous at first that we would be seated in the front of the restaurant, where it was crowded and noisy but tucked away in the back was a quaint, long table by the bar and it was perfect. Unfortunately I don't have any photos as the lighting did not help produce quality photos. \n\nThe prices were pretty steep. I don't think I would have come here and ordered as much as I did if it weren't for the corporate card. We all had about ~2 drinks. I had the The Winter Pimms and a dirty martini. While expensive, they were certainly fresh, delicious and did the trick! The service was impeccable. Always catering to our needs and refilling water, drink orders and bringing oysters in a timely manner. The atmosphere was charming with palm tree leaves across the walls - some coworkers described it as your grandmothers wallpaper in Florida, but I thought it was quite cute!\n\nMy oyster knowledge is not quite as extensive as my coworkers did most of the ordering. We tried 4 different kinds - one we all agreed was not the best and we got a surplus of our favorite two. \n\nWhile I can't comment on the quality of the entrees, I highly suggest coming here if you have money to spend before dinner on drinks and apps!", "author": "Maddy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "Made same day reservations for 6pm on a Friday for 2 people \n\nAmbiance - 4 stars. Definitely make a reservation for the back rooms. The main room in the front was ridiculously loud and crowded. We were in the first back room and the tables were tiny but servers did a very good job coursing out the meal so everything fit on the table. \n\nService - 5 stars. Our waitress was friendly and knowledgeable and service was good and fast. \n\nDrinks - 5 stars\n\nFood - 3 stars. Bone marrow app and combo louie were good. Deviled eggs and baked oysters were meh. Tuna carpaccio tea leaf salad was reallly disappointing and not at all what we were expecting\n\nValue - 3 stars. Was over $150 for two drinks and a few apps. We felt the service level matched the price but not the quality of food\n\nTempted to come back bc there were a few other things on the menu that looked good but probably won't", "author": "Sarina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "Ever since Leo's Oyster Bar opened, I've been wanting to go here. I believe they don't take same day reservations on OpenTable, so that's always been a deterrent. (I don't like waiting, so I tend to gravitate towards places that take reservations.)\n\nOn Wednesday, August 24th, I was having a drink down the street with Peter L. He said Leo's was a few doors down and it didn't look too busy. Perfect time to drop by, right?! We stopped in around 7:45pm for dinner. They told us it would be about a 20 min wait. I asked them to text me when our table was ready since we were going to grab a drink elsewhere. They happily obliged. About 20 mins later, I got the text. We were seated around 8:15pm.\n\nRaw Bar:\n*Kumamoto - CA ($4.25 ea) ×2\n*Peter's Point - MA ($4 ea) ×2\n*Diamonds and Pearls: oyster and caviar ($10 ea) ×2\n\nGotta get some oysters at an oyster bar, right?! I'm not super versed in oysters, but I know I like kumamotos. We just randomly picked Peter's point cuz of Peter's name. I chose the caviar oysters since I love that combination. All oysters were fresh with a nice clean, ocean flavor. Yum!\n\nRegular Menu:\n*Leo's deviled egg: with wing fried oyster ($5)\n*Baked oyster, ahi tuna, seaweed and togarashi ($5)\n*Crab and lobster cake, cucumber and horseradish ($17)\n*Toast: Foie gras, ginger soy, scallions and uni butter ($20)\n*Seafood bisque with lobster, king crab and rock shrimp ($19)\n*New england lobster roll, cultured uni butter, brioche and french fries ($32)\n\nPeter and I tend to over order, so yes, the two of us ordered all this. The deviled egg and baked oyster were fun. I did like the play on the deviled egg. I love crab cakes, so I had to try the crab and lobster cake. Full of seafood, but I found the texture on the inside to be a little too mushy. It was contrasted by the crispy exterior. The foie gras toast was delicious! So rich and decadent! There is a slight sweetness to the toast, which I wasn't expecting, but I didn't mind it much. (I'm not a huge fan of sweet and savory together.) I loved the bisque! Creamy and full of seafood flavor! I thought the lobster roll was okay, but I was super full by the time it came out. I just remember not tasting the uni butter. Since I adore uni, I wanted the flavor to be stronger.\n\nDessert & Wine:\n*Blood orange creamsicle float ($7)\n*Blanc de blancs, pierre moncuit-delos, grand cru, le mesnil-sur-oger, champagne NV ($85)\n*Brut, domaine carneros, napa valley, california 2012 ($60)\n\nWhat's dinner without drinks?! I didn't want dessert, but Peter did, so he ordered the float. I remember taking a sip and thinking it was okay, but I'm not really a dessert person. I definitely enjoyed the bubbly, but we totally drank the bottles backwards. We should have started with the brut and then gone into the blanc de blanc. Regardless, I enjoyed both bottles of bubbly.\n\nOur server was super sweet and fun. We had two seats at the bar, so she was kind enough to split the soup and lobster roll so it was easy to share. I do wish servers would ask before doing that though. Visually, I don't like it when orders are split. This is just a pet peeve of mine. Otherwise, she was awesome and amazing!\n\nSo glad I finally tried Leo's Oyster Bar. Any seafood lover will be happy having a meal here.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-09", "description": "True rating: 2.5\n\nI was quite disappointed with my experience here. I honestly thought it was going to be great by looking at the raving reviews and great food photos. My boyfriend and I went to dinner here, pretty full house, loud and lots of drunkies. It is pretty small, I could barely move.  Staff were attentive and friendly.\n\nWe ordered:\nLeo's Deviled Egg with Fried Wing Oyster: This was OK, you can't go wrong with eggs.\nOyster Carbonora: VERY salty, there was too much salt, I couldn't enjoy my experience\nSalmon Roe Smoked Salmon with Chips: Meh, the chips tasted stale\nFoie Gras Toast with Uni Butter: I couldn't taste any uni butter at all and also very salty\nBraised Short Ribs with Uni Butter: REALLY salty, the sauce was so salty. The uni butter was good, but i felt the short ribs was just drenched in a salty sauce\n\nOverall, I would not come here again. I was disappointed by the meal and most importantly it was pretty expensive with SMALL portions. I mean if it was GOOD then then I wouldn't mind. I could of went to a michelin star restaurant with the price I paid here. PASS ya'll.", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Didn't realize Hawaiian decor could be tre chic... until I found Leo's Oyster Bar. A popular spot for instagrammers (how could you not take pics with those wall coverings?), I celebrated a friend's birthday party here in one of the back rooms. V swanky, i know. A huge part of my experience here was specific to the dinner party (excellent wait staff, endless wine, great company etc.). That being said, I tried to mock up a little food breakdown below:\n\n-Raw Oysters (5/5): Best Oysters I've ever had. They tasted so fresh and flavorful! I loved the sauces they were served with too! A perfect accompaniment.\n\n-Tea Leaf Salad (3/5): Not a huge fan of Tea Leaf Salad in general, this one didn't change my mind. \n\n-Lobster Roll with Fries (4/5): Omg. Could have been that I was four Pinot Noirs deep (see above re: endless wine) but this Lobster roll was HEAVENLY! The roll was toasted and buttery, the lobster delicious and flavorful, and the fries were just bomb.com.\n\n-Salmon (4/5): Top tier salmon. If I come back I would definitely try a portion for myself!\n\n-Cookies (3/5): In comparison to the incredible savory food the cookies disappointed a little bit. I would opt out of this dessert option\n\nTrendy, unique spot in San Francisco! Gotta say it lives up to the hype!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "All I can say is, WOW! I came here with a few co-workers for lunch and we were blown away by the ambiance, service, and delicious food. If I lived in SF, this would absolutely be a regular brunch spot for me! I wanted to stay all day.\n\nOur kind server insisted that the Tea Leaf salad was a must. So, I went ahead and ordered it + added Ahi Tuna Carpaccio + Charred Avocado {yes, charred!!!}. Holy heaven, I want, no wait, NEED this salad in my life on the reg. I wonder if they would send it to AZ?! ;) The Ahi was on the bottom of the salad so it soaked up the delicious dressing. It was so fresh and light. \n\nWe also split a New England Lobster Roll 3 ways because we just couldn't resist. That too was delightful if you're in the mood for a heavier entree. \n\nI will absolutely recommend Leo's to friends, family, everyone I know who either lives in the city or is just heading there for a visit! Thank you for the excellent experience, Leo's team!", "author": "Hailey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "You had me at Wendy Peppercorn. Clever, but I got that reference. Appetizers are amazing - Hamachi Crudo please! I've been coming for midday drinks (tried all the cocktails) and the raw bar - oysters!!! No, I don't have a problem with drinking. Ambience is cool. Staff is amazing. Drinks could be stronger even though I have to get back to work after. You get a neat (yes, neat) postcard after that I don't know what to do with. I have a few now. I'll be back.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "The ambiance at Leo's is awesome. Tucked away in an alley-esque setting, when you walk into Leo's you feel a little more fabulous.\n\nWe were seated in the back, The Hideaway. Super cute decor and awesome music (really awesome). It feels really private back there, which is nice! We ordered a dozen oysters, ranging from $3.5 each to close to $5. They were good, tasty, but in my opinion, overpriced (I can't complain too much, given the price of everything in SF). We ordered fries, the mushroom toast, hamachi and bone marrow. Everything tasted great, the Mushroom toast was delicious (throw some truffle on anything and I'm in). I do think that the price vs. portions is a bit skewed ...I understand that it's seafood and I know the drill, trust me, but nothing was mind blowing enough for me to say the price was justified. The fries were really good, if you're into some fries....\n\nOh, there's more - then we ordered the salmon (large plates), oysters carbonara and the crab cake (yes, it's just 1 crab cake ...no \"s\"). Again, good food, good ingredients. Very tasty and nothing felt super heavy or made me regret my decision in what I ate that evening, which is always nice. We didn't order any cocktails, but enjoyed some good wine and beer - always a safe bet. They have a good selection of wines/sparkling wines and beer as well.\n\nI would come back, maybe just for some drinks and the cool vibe here. Again, nothing knocked my socks off enough for me to want to come back and have it again or come try more menu items.", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Leo's Oyster Bar is a tiny place with a long bar and one row of tables opposite the bar.  The dining room is quite small and other diners are quite close so don't come here expecting to have a private conversation.  That said, the atmosphere is quite lively with craft cocktails and seafood flowing from the bar/raw bar.\n\nThe raw bar offers multiple varieties of oysters, crab legs, shrimp and lobster.  Everything we had was fresh and delicious.  Photo included below.\n\nThe small plates are also great for sharing and sipping cocktails.  The caviar blinis are especially good.\n\nI wasn't a fan of the tots topped with salt cod.  With all of the fresh seafood available, I didn't enjoy the cured cod.  I would have liked to see caviar or crab in this dish.\n\nThe mussels and chorizo were delicious.  Fresh mussels in a spicy sauce served with grilled sourdough.", "author": "Lance W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Leo's Oyster bar is a great place to celebrate a special occasion and relax. Their interior decor is a mix of tiki and tropical colorful Cuban details which created a fun, romantic and relaxed vibe. I took my boyfriend here for his birthday and we really enjoyed the following: \n\nGarden Party cocktails (egg white, gin, fresh herbs and low sugar \n\nAssorted oysters (if you're either an oyster connoisseur or no nothing about it like me, the wait staff is very knowledgeable and will help you find the right thing for your tastes) \n\nTEA LEAF CARPACIO TUNA SALAD (this was the best dish of the night!!!! Wow was this a delicious dish. I love the traditional fermented tea leaf salad. Paired with the fresh tuna it went to a whole new level of deliciousness. I highly recommend trying it - an order was great to split for two but you may just want one for yourself! \n\nChocolate mousse - it tasted rich and dense with a slight coffee flavor. And they served it with gold flakes in a super cute gold pineapple dish. \n\nWhat we also ordered but didn't love as much: \nBone marrow (sure it was very good but it was not my favorite personally) \n\nRaw clams (they are super chewy and briney if you like that kind of thing) \n\nMussels (I'm a huge fan of mussels and the ones they served were large and hearty but the sauce didn't really permeate the mussels well. I much prefer them at Chez Maman.) \n\nThe service here is very attentive and if you can get a table in one of the back rooms do! It is much quieter back there and relaxed than the front bar area which is a cool area but loud on a Friday night. Overall a lovely experience here!", "author": "Claire C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "Oyster Freshness, selection, temperature and presentation are all top notch. One of the best Ive experienced.\n\nThe small dishes were just OK. Nothing stellar or ground breaking.\nCocktails were decent. The dinner for 3 was quite expensive for  appetizers and drinks.\n\nWould come back for the Oysters, but the line may persuade me otherwise.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Love HH here!! Stopped by at 4:30pm on a Friday and got seated right away. Ordered oysters from their happy hour menu and the presentation came out beautiful. $1 oysters were so fresh and for their interior design left me wanting to stay longer. This is the prettiest oyster bar I've been to, they def set the standard.", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Amazing. \n\nLocated in the finance district parking can be a challenge.\nRaw oysters, tea leaf salad and Rosé is all you need to fall in love with this place.", "author": "Marlee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "Leo's is great. What a cute little spot!\n\nWe indulged again for a work lunch, and I loved it from the moment we walked in! They have a few different dining areas with a more traditional looking oyster bar in the front, and a cute little tiki room in the back with Lilly Pulitzer looking pillows, and wicker chairs and tables. \n\nNo one was seemingly in an oyster mood which was a shame given the location, but we had some truffle fries to share and opted for more traditional entreés around the table. I think about half of us opted for the crab cake sandwich, there was a veggie order, and I went for the salad with ahi tuna because...well, I'm a sucker for tuna!\n\nI loved my salad and I'm pretty sure everyone was pleased with their dishes as well since we all made the clean plate club that day! \n\nDessert is also on point! We shared a sundae and some of their cookies. \n\nI'd love to come back for HH and some oysters another time!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Leo's Oyster Bar is a serious upgrade from the old Wexler's and I'm glad they are here. It's another amazing establishment from none other than the people that brought you: Marlowe, Park Tavern and The Cavalier. Seriously, what a line up of restaurants. \n\nI popped by a couple weeks ago to finally check out the space as I've been meaning to get in here for quite some time and it was beautiful. I'm pretty sure Ken Fulk did the design work at Leo's because most of the other restaurants I mentioned above have the same \"feel\". Leo's takes on a more tropical vibe from the 50's and it makes you want to order the classics. \n\nThat being said, I ordered a Gibson martini and some of the pickled vegtables because that's how I roll. The cocktail was fantastic and the vegtables equally as good. I wasn't terribly hungry but, noticed my neighbors lobster roll (which looked heavenly) and the trays of beautiful oysters all over the restaurant. So, next time I will be getting those for sure :) \n\nHead here for classic cocktails and oysters, you won't be disappointed.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "One of my favorite spots in the city for their food, restaurant aesthetic, and warm and accommodating staff.\n\nAsk for Heather or Eric and the ever romantic Table No. 77 when you're making a reservation. \n\nRosè, oysters, the top secret Marlowe fries, and their chocolate mousse are all to die for. \n\nOh! And the Mad Men cocktail. Yum!\n\nI could easily dine here twice a week (and sometimes I do)!", "author": "Tayler H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "I'm pretty much a Leo's addict. Oysters, hamachi, lobster, cocktails... the list goes on. If I could eat ever meal here for the rest of my life, I'd be a happy girl (but also broke). This absolutely deserves 5 stars, but most of the items on the menu are overpriced. \n\nAnything you order on the menu will be outstanding, but I suggest asking your server for a variety of oysters to begin with. Order the hamachi next, and finish with the risotto or lobster roll. I highly recommend splitting with another person so you can taste more dishes!", "author": "Emmy Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "3-3.5 stars but rounding down since the prices are high for the quantity (it could have been just the couple items we ordered). Super cute spot in the FiDi to grab drinks/snacks at. My friend and I walked in before another event to check Leo's out, and we were able to grab two of the last remaining bar seats around 6pm on a Friday. It was definitely busy in the restaurant as well, so reservations are highly recommended to avoid any waiting. We tried:\n\n-Chelsea Gems (Washington, $4.25/ea) & Oyster Eliose (Celery & Melon, $5/ea) [http://www.yelp.com/user_local_photos?select=dTeI9-EUmaLAJc1pALuOAg&userid=76vIFZcC7owykCBjMfGVXg]: We ordered 4 of the Chelsea's and 2 of the Eloise. I loved the size of the Chelsea's since they were Kumamoto sized, but they were a little too briny for my preference. I wouldn't get these again. However, the Eloise oysters were delicious, and I loved the combination of the celery and melon on it. Recommended!\n-Foie Gras Toast (Ginger, Soy, Scallions, Uni Butter, $20, http://www.yelp.com/user_local_photos?select=3MSjiJJ_N7aCXOpXmVpqDQ&userid=76vIFZcC7owykCBjMfGVXg): Holy foie gras, I loved the creaminess of the foie, and the overall flavors. It was a tiny bit too salty for me, and overall this dish is super super rich, but it was worth trying once if you love foie and uni.\n\nDrinks will run you around $12/each, which seems to be the average for the swankier bar/restaurants in the city. Service was very good, even at the bar, and they are really friendly there. Parking was surprisingly fairly easy to find since there are some metered spots on this street.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-26", "description": "I was expecting something special and it turned to be nothing but $$$$. My friend generously picked up the bill at the end so it's not even my $$$$ but I still felt that it was overpriced. \n\nIt's one of the hot new restaurants in FIDI so make sure to make a reservation a week or more in advance.\n\nWe shared:\nGolden Trout Roe Caviar Bites ($15 for 3 pieces)\nCrab & Lobster Cake ($17)\nJapanese Hamachi Crudo ($17)\nRock Shrimp Toast ($15)\nTuna Conserva Toast ($13)\nSeafood Bisque ($19)\nFries with Dynamite Sauce ($7)\n\nThis was barely enough food for 2 not super hungry people. Did anything taste great? Not really. Everything was just ok and about 50%-100% more expensive than it should've been.\n\nThe decor is nice though. We sat in the back tiki lounge, which was more relaxed and quieter than the rest of the restaurant. Each room of the restaurant had a different vibe.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "The space is not big but charming, and the bar looks great. We later found out that there's a lounge area and a tiki event space hidden at the back. We shared a few items between the two of us. We got two deviled eggs with a fried oyster on top. It was a delicious mix of textures, and I love fried oysters. We also got a couple of raw oysters, and it tasted very fresh. \n\nWe got the tuna carpaccio with the tea leaf salad. It was also flavored with peanuts and garlic, and it was a wonderful combination of flavors. This was one of our favorite dishes. We also ordered the albacore dish. The citrus in this dish slightly overpowered the other items, and it was more strange to us though we still finished it. \n\nWe also shared the lobster bisque and the mussels. We made sure to dip all the pieces of bread we had into both soup and sauce, and it was amazing. The lobster bisque was fresh and scrumptious with ample chunks of seafood. The mussels was clean and fresh, and the sauce was just right and perfect with both mussels and the bread. Overall the food and service here were great.", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Leo's Oyster Bar is one of those places that is so classy and well-designed that they could offer a subpar experience and I would still probably give a 5-star review. Stepping through the doors of Leo's is like stepping into a wonderland that's reminiscent of a retro Miami. I was truly blown away by the ambiance and decor of the bar, especially the incredible wallpaper and light fixtures. It really looks like they took immense care when designing and decorating the space. My friend and I met there around 5:30 for happy hour drinks, and were pleasantly surprised to find two open seats at the bar. \n\nI ordered the Garden Party cocktail (gin, egg white, and fresh herbs), and my friend got the Mah Jong (bourbon, raspberry, and tea). Both cocktails were delicious and beautifully presented. I absolutely loved the herbs and small, dried flowers in my drink. Since we knew we'd be there for longer than one drink, we ordered 6 oysters, Leo's deviled eggs, and the classic French fries with dynamite sauce. The oysters were super fresh, the deviled eggs were overflowing with fried oyster goodness, and the dynamite sauce was addictive. We ordered a second round, and I stayed with the Garden Party because it was so good. The bartenders were very attentive and friendly and we were never in need of anything. I can't wait to go back!!", "author": "Regina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Such beautiful ambiance and great oysters but not a place to come for your full meal. I and 3 friends dined here last night for a friend's birthday dinner and we had a variety of things but the plates are all pretty tiny and come at a hefty price. To start we split 16 oysters with 4 different types and each was prepared and tasted so fresh. We sat in front of the shucker and were able to see the care and detail he put plating each oyster. Next, we had the following for our meal:\n- 3 Leo's deviled egg with wing fried oyster ($6 per egg) and an Uni butter baked oyster. 5/5 on the deviled eggs - the wing sauce and crispy oyster paired nicely.  My friend wasn't a huge fan of the uni butter oyster. \n- Rock shrimp toast - 2/5. Bland taste and thought the toast could have been crispier\n- Steak tartar - 4/5 - A Nice big dollop of Uni on top gave it an interesting kick. Enough for 3 people to split and have a couple bites. \n- Japanese hamachi - 4 single pieces, nice fish but nothing that blew me away - 3/5\n- French fries - nice size portion and sauce was amazing - 5/5\n\nFor drinks, we started with a bottle of sparkling rose, 4 garden parties (so beautiful and tasty - you have to get), 4 espresso cocktails for dessert and also split their chocolate mouse. The chocolate mousse was so so tiny but like a thick brownie batter... so tasty but if you're in the mood for dessert, probably better to each get your own or at least only split with 2 people. Looking back, we had a lot of alcohol but not food and our bill came to $400 pre-tip. I'll probably be back for a cocktail and oysters during happy hour or after work, which will likely still amount to an expensive hh but will not be back for a full meal.", "author": "Aryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "Ok, you've heard about, and have probably seen images of, the interior work, here at Leo's... go see it. The atmosphere is intoxicating and and thoroughly envelops you. \n\nI've had the pleasure of delivering some of their oysters for quite some time now, yet hadn't had the opportunity to dine with them until the week before last. The food only elevates the experience. I came here on a first date and while I can't say it overshadowed my glowing charm, it definitely set the stage for a wonderfully blooming relationship. We will be back again... and again. \n\nThe menu is superb and reflects the care put into the design of the whole experience. I'll recommend any of the oyster preparations and appetizer choices; it depends only on your adventurousness. As far as main courses, we had the lobster roll w/ unit butter (drooly grins) and the steamer clams with sake broth (whoa!and yes!) I personally don't drink alcohol, but if the spicy ginger lime-ade with Thai chili is a representation of the care put into the cocktails, I'd say you can't go wrong.  \n\nGo be here awhile. You won't regret it.", "author": "Evan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "In love with Leo's. The decor has an island vibe with a bit of Great Gatsby and the 50s. The wallpaper is already jumping up in Instagram posts. The details are down to the water cup. It's classy, it's fun and if you love Marlowe or Park Tavern as much as i do you'll enjoy your experience here. I made a prime time dinner reservation a few weeks back and arrived very excited . . .\n\nI thoroughly enjoyed a couple beautiful Garden Party cocktails. Refreshing, delicious and seems to be one of their more popular drinks. Leo's Mai Tai came in a fun theme cup inspired by a Polynesian dancer. The Barbarita had a kick for a spicier palette. Liked the Deviled egg with fried oyster. I thought it was fried chicken! That's how good it was. For $6 a piece, glad it packed that much flavor. The tator tot with brandade and tapenade had good crunch for untraditional tots. I savored each piece of the Foie Gras Toast. Surprised by the soy sauce. As a native San Franciscan i've had a lot of Clam Chowder and this is one of the best i've had. I don't rank the Seafood Bisque as highly but i doubt it has the cream and butter the Clam Chowder has :) Salmon was perfectly cooked and the piccata sauce gave it a nice luxurious lemon sauce.\n\nService was not pretentious at all. They were extremely friendly and welcoming. We were well taken care of and the highlight was at the end of night when we asked if they had any mint, gum or similar candy. The restaurant didn't officially have any but they asked around and a staff member had some altoids which they placed on Leo's imprinted coaster over a glass plate. Best presentation i've ever seen for altoids.\n\nWe're not light eaters (or drinkers) so the bill grew very quickly. Probably better for date night as a large party may have a hard time maneuvering though i did get a sneak peek at the Hideaway bar area in the back if you do want a big group.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-21", "description": "Dinner review. \n\nSalmon tartare marrow toast - 2/5\nLeo's Louie Crab Shrimp - 3/5\nLobster roll + uni butter - 1/5\nShort rib + uni butter - 4/5\nFries + dynamite sauce - 3/5\n\nOverall, \"A-OK.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Came for the decor, was decently impressed with the food. I've been hearing about and seeing this place all over Instagram, and since my birthday was approaching, I figured it was worth a visit. I've frequented other restaurants in this group (Park Tavern, Cavalier, Marlowe), and am a fan of their intricate decor and well-thought out menus. Leo's is no different. Beautiful interior and unique, seasonal menu. Service was decent- our server wasn't really into recommending dishes and seemed overwhelmed by serving a group of 4 girls with lots of questions.\n\nThe dishes are definitely small, so if you come with the intention of sharing plates, be aware. That way you're not shocked when the crab cake comes out and is barely enough for 2 people. Or when your chocolate mousse dessert literally arrives in a shot glass, enough for 1 person. I will say that the cocktails are delicious and made with fresh herbs and ingredients. \n\nAll in all, I'm glad I came and experienced, but it's not a place I will be dying to return to in the near future.", "author": "Lex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "This place is so good. A little bit on the spendy side. But come on you're worth it. Good food,  great drinks, wonderful staff", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "I love all-things seafood and oysters and came here on the recommendation of Genevieve Y's yelp review. \n\nMy gf Suany and I made girly date night plans here on Saturday night and were the first ones seated. We sat at at the bar and were pleasantly greeted by a cute girl with chic tats who took care of us all night with drink and food orders.\n\nUpon entrance, I was anticipating a much larger dining room, based on the photos. However, the layout was chic and inviting regardless! The cool retro-Hawaiian wallpaper is only really dominant at the front part of the restaurant with a few tables. The main dining hall is composed of a gorgeous bar along with half a dozen or so white tables parallel to the bar.\n\nEverything we had was delicious and beautifully presented. However, as many have noted, all the dishes here are really dainty and small. We were content at the end of the meal, but certainly could have eaten more. We ordered 3 diff types of Washington oysters  (3.50-5/each)- these were all so sweet and delicious. We also ordered the Salmon Tartare ($16), Foie Gras Toast, and Caviar ($21 for 4 little bites). At the end, we really enjoyed the Lemon dessert with crumbs - it was tart, light, and delish!\n\nWe ordered wine ($13-16/glass) and the Garden cocktail ($14) as well. I loved the Garden Cocktail- it was gorgeous but also tasted refreshing!\n\nThis spot is perfect for drinks & snacks, happy hour, a light dinner for a date night or close friends. The amazing food, drinks and pretty ambiance make it a fun spot! I look forward to returning for the Uni Toast next time.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Loved the atmosphere and the really kind hostess! Food was good but the service was standout!", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "This place is easily my new favorite go to in the city. The food and drink menu are spectacular, the service is outstanding, and the quality of the food you get is fantastic. It's rare that you find a place where each dish is so thoughtfully created and for the employees to love their job so much that they'll tell you about it. Leo's is a rare new gem in this city of all too many disappointing one visit wonders restaurants.\n\nThe SO and I actually only came to Leo's for drinks around 10pm on a Friday night. When we got there, the place was packed. If you've never seen any photos of the place, the walls are pink with tree designs painted on. It's got a sort of tiki bar vibe, but also 1950s swanky classy oyster bar vibe that cater well to the clientele for this place -- mostly saw people that were a bit older dressed fairly well, so basically the FiDi crew. It's not particularly large, and is more conducive to smaller parties. It's basically split into bar seats and small table seats -- people at the bar definitely looked like they were going to bump elbows.\n\nFortunately for us, the waiter brought us to the back of the restaurant where they actually have a not so secret overflow room called The Hideaway. The Hideaway serves drinks and bar bites, which is exactly what we wanted. It was a fairly small room, same decor as outside, but the Sinatra playing in the background made the vibe perfect for date night. \n\nI got the Banana daiquiri and the SO got the mah johng, and the mad men. Most interesting thing about the daiquiri was that the texture of the drink was actually like the consistency of a typical mixed drink rather than a slushy like mixture. Each drink had a generous portion of alcohol, yet the contents of the drink worked really well together. \n\nFor food, we got the salmon roe, smoked salmon on an everything chip, tuna toast, 2 Fanny Bay oysters, and a blood orange creamsicle. We loved the food. Everything was super thoughtfully created on their part -- the waitress told us about how the everything chip was meant to mimic an everything bagel. The oysters were also the freshest oysters I've ever had -- super meaty, but so fresh and rich in flavor and deliciousness. Each bar bite had a lot of small parts contributing to the dish, but unlike other restaurants, it was really apparent what each ingredient was doing on the plate. It didn't seem like it was there for visual garnish, it all improved the flavor experience.\n\nThe most outstanding part of the night was undoubtedly the service. It was evident that the waitresses were having a great time as they would often dance over to the table to chat with us, they were super super personable and fun to talk to and talked to us about the head chef's commitment to fresh, great oysters (they shuck them together as a staff and then if the quality if no up to par, send it back to the source). Most interesting, they told us about how much they loved their job and how they felt like their managers cared for them and cared for the quality of the food that they were putting out there. This effusive positive attitude is something I rarely see in other restaurants, and certainly an often overlooked component about what helps define one's experience at a restaurant.\n\nI really can't tell you enough about how much I love this place. The final price for everything was high ($100 pre tip), but if you're willing to splurge a little for the quality and the experience, I think it's completely worth it. There are a million other money-suck restaurants in this city, but Leo's is certainly not in that crowd.\n\ntldr; probably my favorite new restaurant in SF right now; delicious food and drinks, great service! excellent place for a date night and probably smaller groups", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "Great little spot in the FIDI for some oysters.  Got a good variety of it and a lot of it tasted pretty good.  Has a really chill ambiance type of vibe and the staffs are really attentive! This place is a bit on the pricier side however, but we still definitely enjoyed the oysters.", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Side of pickled veggies\nOne dozen oysters\nRaw hamachi on grilled avocado\nRock shrimp toast\nSeafood bisque\nCrab cake\nLobster roll\n\nWe liked everything. The oysters were great. Our favorite was the lobster roll but what we would order again, and again, is the rock shrimp,toast\n\nI'd skip the crab cake, a bit fishy.\n\nI think the waiter was trying to be nice to make sure we all had food but he brought it all at the same time.   We told him we were sharing. There was barely enough room on the table for all the food when it's all brought at once. It was very awkward.    \n\nThey should have paced it better.   We were done in about 30 minutes and it felt like they were rushing us.\n\nSo be sure to tell them...can we have the soup first, then bring the toast, and then the hamachi, then bring out the lobster roll last...\n\nIt's a cool,space but very loud and you sit very close to other diners. I spent a lot of time saying WHAT DID YOU SAY?", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "Great drinks to choose from and lovely environment. Some of the food choices however, were very poor plain and not as flavorful. I highly recommend the devil eggs and oyster, but not the other three grilled oyster options (3). The clams and octopus dish was not amazing and thought if would be, but could of used extra love because I love octopus (seafood in general). Wished for a better food and drink experience.", "author": "Lola M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Date & Time:  Thursday February 4, 2016 @ 6pm\nDining Companion:  The Husband\nScene:  Battery Members & FiDi Professionals- Gents in Pastel Checkered Shirts & Ladies in LBD's w/ High Boots & Chanel 2.55 Classic Bags \nMusic:  Jazz; Coltrane, Ella Fitzgerald\nDecor:  Preppy at It's Finest.  Pretty Candle-Lit Conservatory, Pastel Painted Walls, Floral WallPaper, Long Bar Parallel to Banquette Seating Makes for a Fun & Lively Dining Experience\nService:  Very Chatty Females Though the Men were On-Point\nDevour:  Deviled Egg w/ Wing Fried Oyster, Oyster Carbonara, Sea Urchin on Toast Points, Osetra Caviar Creme Fraiche and Truffle, Bottarga Tuna Conserva Nicoise, Mussels & Frites.  For Dessert:  Lemon Mousse + Brown Butter Streusel + Cookie\nTotal:  $155.30\nBrought to You By The People of Marlowe, Park Tavern & Cavalier", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Wonderful ambience & setting. We had a group of 4 for lunch- tea leaf salads, oysters, French fries. Service was excellent- fast, friendly. Love that the restaurant is literally right around the corner from our office.\n\nI personally love this restaurant group which also owns The Cavalier, Marlowe, Park Tavern.", "author": "Al G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Overall: Dined at Leo's for Happy Hour. Love this tucked away spot for its cool ambiance, delicious oysters and cocktails.\n\nFood: 5 stars. Love the oyster selection. While they didn't have my favorite Kusshi oysters that day, the server recommended the St. Simone which I loved just as much. The seafood bisque was delcious.\n\nDrinks & Service: 5 stars. Staff is incredibly friendly and helpful. Loved the way the bartender made one of my favorite drinks.\n\nSpace 4-5 stars: Its really beautiful and I love the the warm feel they've done with the lights and arrangement. However, it is really narrow space so come early to grab a seat at the bar.\n\nI definitely want to visit Leo's again.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "5 stars for drinks, oysters, and the environment. It is worth a visit to Leo's for the ambiance and decor. They have a few rooms, and it's fun to see them all. The staff is really great and they go out of their way to make sure you are enjoying yourself.\n\n3 stars for the food. We came for dinner and ordered the Leo's Louie, which was expensive and pretty disappointing. The lobster roll, which I was really looking forward to, also did not meet expectations. The clam chowder was pretty good though. \n\nAll in all, great for happy hour and pictures!", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-20", "description": "Apparently, this is one of the most beautiful restaurants in San Francisco. It has a nice tropical theme with a good soundtrack playing in the background. The service was good and friendly - my glass was always filled with water!\n\nThe food was a bit overpriced and underwhelming. \n\n+ mussels - wasn't stand out; the andouille was a nice touch \n+/- devil's egg - I never understand why you only get half an egg per order...that's a whole other issue. In any case, the filling was quite yummy, the egg was nicely cooked, but is all as expected for half an egg at $6.\n+/- leo's louie with gem lettuce (combo) - a good portion of crab and shrimp; a bit too lemony \n+/- lobster roll - wasn't stand out; the fries were overly salty", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Pricey, but fancy. For two, you'll walk into this place, in awe over the multi million dollar interior, fashioned in retro glam days' ways, down to the very last gilded lamp. \n\nThe oysters are great, the other food is good. They tried really hard to get the aesthetic as authentic as possible, almost too hard.\n\nVery nice- but that price!!! Whew...", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Overall great meal. Split between the two of us, we got the Butterfish, tater tots, and the short rib. Short rib was definitely the highlight, full of flavour and fell off the bone. Wouldn't recommend the butterfish - it's served with white toast that really killed the flavour of the dish. Service was spectacular, we were visiting the city and our waitress wrote us a huge in depth list of places to go for drinks. Only complaint was that the restaurant was very chilly (where half of the guests were wearing their jackets).", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Really cool and swanky place- they serve fancy cocktails and oysters after work. People were dressed up pretty nice. Our party was in a back room that was hidden- reminded me a little bit of a speakeasy! \n\nAlthough the cocktails are pricy, they are delicious! Definitely worth checking out with a friend after work. Would also be perfect for a date.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "Don't get the Foie Gras- it's more like \"foie ugh\"\n\nDeviled eggs  \n\nSkinny dip  cocktail was good.\n\nClam chowder was a safe choice but Boudin still wins the battle.\n\nLobster roll was good, my friend said.\n\nEXPENSIVE! Coz the interior is good i guess. Service is also great. So maybe 3.5 stars.", "author": "Keet K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Great place for fresh oysters and seafood. Went early with a friend so didn't have any problems getting a seat at the oyster bar. Service was fast and attentive. Tried 4 different kinds of oysters, soup, tea leaf salad, bone marrow, and fries. Oysters were fresh and delicious. The soup was good but a bit heavy. I didn't love the tea leaf salad as much as other places in the city. Wouldn't recommend. The bone marrow was great. Definitely get the deviled eggs. Was my favorite after the oysters! It lives up to everyone's reviews of them. A bit pricy but a must try in the city at least once.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "This place. So good. Expensive AF but for the ambiance, service and INSANE seafood it's worth it. Cocktails are great too. Such a nice place for a special occasion!", "author": "Alice U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "New favorite restaurant in SF!  Superb service with a really cool vibe that is chic, modern but also rustic.  If you are passionate about excellent quality seafood, oysters and vino -- Leo's doesn't disappoint.  \n\nThe deviled eggs are ridiculous!  So too is the lobster roll!\n\nFantastic lunch and/or dinner destination.", "author": "Duryea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "Leo Oyster Bar is DEEEELICIOUS!! It just opened couple weeks ago and this place gets packed. I would suggest to either sit at the bar or call in for a reservation. I did a walk-in and was able to get a seat at the bar. The bartenders/servers are awesome and super friendly. \n\nAll the dishes I ordered were on point. The oysters are fresh and they have different types of oysters from different states. The portions are kinda like tapas sized  - so it's good for sharing and you'll be able to try different dishes. \n\nWhat I ordered: \n- Salmon Tartare, Marrow, Capers and Dill (Toast) \n- All the oysters on the menu (total 7 different types)\n- Crab and Lobster Cake, Cucumber, and Horseradish \n- Mussels en Papilote, Tomato, Pancetta, Olive and Chili\n- Pan Seared Salmon, Caramelized Fennel, Radicchio and Piccata Sauce", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "Went there last night (Aug 10.2018) with a couple friends, we ordered 3 appetizers and 3 entrees and 2 desserts, waitress was nice, but honestly no personality, it's business, during our meal from the beginning to the end, she was so eager to clean our tables, even though there are still food on the plate, food was good enough, the place was very nice and charming, good atmosphere, would be nice to get that from the employees as well.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-27", "description": "This place used to be fantastic and now it's just mediocre. Cute decor but the back dining room smells like the adjoining bathrooms. Food was okay, we found the lobster to be mealy and the special oysters to be not so special. The restaurant cleverly disguised our forgotten bisque as simply the last dish to come out which made for a kind of fragmented meal. All in all, this place has gone down stream since it opened.", "author": "Caroline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Love this place. Walking into each beautifully decorated room feels like falling down the rabbit hole. The food and cocktails did not disappoint.  Wonderfully fresh seafood and inspired libations, plus a great bar scene, make this one not to be missed.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "I'm from the East Coast, where \"oyster bar\" has certain connotations. Yes, Leo's has an extensive oyster list, but I was disappointed it wasn't the real deal.\n\nVery cute place...loved the wallpaper...that has more of a cocktail versus oyster bar vibe. Ordered a dozen of the raw Humboldt oysters (thought I couldn't go wrong with the only (?) local oyster on the menu) and disliked them: fatty and tasteless, not briny at all. The hamachi crudo...3 slices of hamachi and two teeny slices of dried avocado for $17, really?...was also tasteless. The salmon roe appetizer...three tiny puff pastry cups with salmon and roe, $18...at that point we were just DONE and didn't stay for entrees. \n\nI rarely complain about prices, but in this case, they really were excessive. The bill for those three dishes and the corking fee for our wine was $150. Go to Hog Island, which is not far from Leo's, they know what they're doing and you won't be disappointed.", "author": "Elisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "When you're in the financial district and you have that expense account at your beck & call then Leo's is the perfect place to spend that dough.\n\nTheir raw bar menu consist of bivalves from both the East Coast as well as the West Coast - (psst, THEY HAVE CHERRYSTONE CLAMS!), along with king crab, lobsters and caviar (only menu available during happy hour I might add)! I tried The Mad Man cocktail made with rye, benedictine & citrus, perfect HH cocktail and you can't stop at just 1 -go on and try; I double dog dare you-.\n\nWhen you do get your fluky hands on the food menu then order the deviled eggs with fried oyster (best in town); I can just keep stuffing those suckers in my face. The sea urchin toasts was a salty creamy fantasy and that tea leaf salad with Ahi Tuna and charred avocado (all extra $$ of course) would put a Burmese restaurant to shame.\n\nAlso, skip the Lobster roll as the brioche gets greasy and go for the Lobster and Crab cakes instead and while we're luxuriously prancing around all over the menu, dodge them baked oysters as well because if it ain't raw (or sometimes deep fried) then \"it ain't worth the whiskey\";*hiccup*..", "author": "Lo-an L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "This place is said to be the most Instagrammed restaurant in San Francisco and I can see why. The eclectic decor just beckons you to start taking pictures from the moment you enter. \nPaired with great food and service makes Leo's a fun spot to hang out with friends. \nGreat selection of Oysters!!", "author": "Sam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "I'm not sure why the ratings are so high here. Perhaps dinner is better? Came here for lunch and some of the items I wanted to order are only available for dinner (like the foie gras toast). The raw oysters were all good although pricey. The cooked ones weren't that great. I had the lobster roll which was ok but nothing special. The bread to lobster ratio was not to my liking...way too much bread. Same with the other sandwiches. The fries were pretty tasty. Service was good. The restaurant itself has an interesting layout. Looks like the inside of a former salon possibly. The front of the restaurant has a long bar and lots of small tables. It looks like the back part of the restaurant can accommodate larger tables.", "author": "Musetta S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Amazing Amazing Amazing\nWe started with the hot oysters and migrated into the raw.  Must haves are bisque diamonds and pearls and fresh oysters. Service is better than home.", "author": "Reed C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "I am so so so thrilled we found this place -- it's amazing.  Being from New England, I am known to be a seafood snob, and I'm usually never impressed...but oh...my..god...this place is phenomenal.\n\nWe started off each with a raw oyster, and these were great -- highly recommend.  Great presentation, great taste. We then each got a \"Leo's Deviled Egg with Wing Fried Oyster,\" these were great as well.    We tried the \"Osetra, Creme Fraiche an Truffled Beet Pancake\" -- which everyone went crazy for.  These are so rich and flavorful, a must try -- like seriously, you have to get these.  Also, do try the \"Sea Urchin, Ginger, Soy, and Scallion Toast\" -- seriously so flavorful and rich -- melts in your mouth (we all loved these too).  \n\nThe \"House-Made Tater Tot, Brandade and Tapenade\" is also a good pic -- but FYI they aren't your average tater tots.  There are like five huge pieces of tots, and they kind of taste like hash browns...but like REALLY GOOD hash browns.  The french fries were french fries, so they were good (nothing crazy).  \n\nOkay I have to end this with the things I did NOT like.  Honestly, the clam chowder...was NOT good.  Like I said, I'm from New England, so I take my chowder very seriously.  I did not like the consistency and the bacon in it/the flavor.  I would not recommend (no one else liked it either).  Also, the mussels....\"Mussels en Papillote, Tomato, Pancetta, Olive, and Chili\" -- I'm sorry I did not like it at all.  They just tasted so strange, not good at all -- and I LOVE mussels, I've never had one I didn't like...until last night. (and again, the group felt the same way)\n\nOh and dessert..we got the chocolate mousse and the strawberry sunday -- both bomb.  Definitely recommend both of them, but will say the chocolate mousse comes in a pineapple shaped dish...soooo it's so Instagram worthy. (lol)\n\nOkay overall, definitely my favorite restaurant in San Francisco right now -- and I highly recommend.  The decor is phenomenal -- its like chic havana style.  The music was this awesome salsa playlist, which I loved.  We sat in \"the hideaway\" in the back -- and ummmmmmmmm it was great.  I only want to sit back there in the future.  It's decorated so well and it is very intimate.  I'm in love with Leo's.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "Once in a while these days, I like to go and grab dinner by myself at nice places. I decided to try out this place myself since my friends either don't want to spend too much money or they don't like seafood. Anyways, I decided to come by and grab a drink and get some food. \n\nI started off with drinks - something fruity and delicious. I don't actually remember the drink's name, but I remember it had flowers and some sparkling wine. The food I ordered was delicious. I started off with oysters - 3 different types - Grassy Bar, Hog Island, and Irish Point. They were all good, but I think my favorite was the Hog Island. Definitely a great oyster. \n\nI then got the dish off of the 7x7 listing - Leo's cobb. I decided to go with a combination of crab and shrimp instead of one or the other. It was beautifully plated and really good, but it was just not enough food. I next decided to go with a toast point. Mine came with crab. \n\nSince I was by myself, I decided to go with sitting at the bar. It was a great place to enjoy some food and drinks. I got there around 7 and it wasn't too hard to find a spot at the bar, but honestly, by the time it was about 7:45/8, the place got packed with people. The mood lighting being red was a bit weird, but I did love the atmosphere overall. \n\nProtip: fresh oysters!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "I looove the ambiance in this restaurant! Walked in on a Friday at noonish and was able to grab a table for 4. As first timers we ordered the clam chowder, seafood bisque , Salmon/shrimp/scallop burger, louie salad. Oysters were fantastic of course. Great food! And not to mention, a REALLY good old fashioned! I highly recommend this restaurant.", "author": "Sarina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "Back several months ago, a former Yelp elite Genevieve Y. (https://www.yelp.com/user_details?userid=_aSs5dSAabuwnXUGBPzASw) posted a five star review (still not sure why she isn't still elite.  If you know her reviews, you'll know that it's all about details with her.\nAbout a month ago, my visit here was for a lunch meeting here.  Arriving around 12:30 pm with reservations, the restaurant was crowded, both at the bar and dining area.  We were seated at the second table from the door so I didn't get much chance to see the rest of the restaurant.  Most of the tables that line the front are two or four toppers while the bar sits to the left.  The walkways are narrow so beware if you are claustrophobic.  After some brief discussion about the menu, we gave our waiter our orders.\nWe shared two small bites or snacks, the assorted housemade pickles and smoked trout dip, trout roe, and chips; great conversation while munching on this, using fingers and toothpicks to try the different things.  For my main meal, I ordered Leo's Louie combination (https://www.yelp.com/user_local_photos?select=HscW7e73Amn83Cji7-QHNw&userid=saJuyv784apZzH--psHZ3Q), which featured rock shrimp and King crab meat.  For $22.00, the seafood portion is generous and liked that all of the ingredients were segregated so nothing got soggy.  \nNormally, I would eat something more substantial, but both of my lunch companions were in a health conscious mood, prompting my nutritious choice.  It was actually filling enough for me.  Service was decent and not particularly memorable as glasses were filled and empty plates removed.  \nYes, I would like to return and, judgining by Cherylynn N.'s (https://www.yelp.com/user_details?userid=eKUGKQRE-Ywi5dY55_zChg) dinner experience, lunch is probably the better choice.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Service was flawless. Oysters fresh and tasty. Bisque was alright. Bone Marrow was lovely. Cocktails were plenty. Did i mention the service and the ambiance? Lots of romantic lighting and amazing seating. It's a gem!", "author": "Mary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Best oyster. Very-good seafood restaurant in town .atmosohere is great. Menu choices are wide with variety of seafood. Fresh and yummy will be back", "author": "Ceseline D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-03", "description": "The oysters are wonderful, fresh and simply delicious. \n\nThe wine was lovely and our server was great. \n\nThe mussels were the worst I've ever had; small, dry, fishy, not fresh. We sent them back. (And I never do this, I usually grin and bear it). Just bad. \n\nThe mushroom, goat cheese toast points had literally no goat cheese and tasted worse than cheap, out-of-the-box frozen apps from smart and final. Horrible. The portion was extremely small and it cost sixteen dollars. Fail. \n\n\nNow the seating. They sat us at one of two tables in front of the host station; yes, IN FRONT of the hostess station by front door. Literally situated were patrons wait for their 'real' table. This is seriously the most awkward place I've ever sat in a restaurant, not to mention an expensive one. Your view at this table: a coat closet, utensil / napkin stand, hostess station and people checking in to their table all night long. The table is set away from the main restaurant. I felt like we needed a dunce hat and were scorned to the detention corner.  For how pricey this spot is, this is unacceptable. They have got to get rid of this table. \n\nThere are too many great spots in town to get oysters. I would definitely pass on this spot. Not worth it whatsoever.", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "I frequent SF often, and this is my favorite spot. The oysters are amazing, service and staff are great too. I usually go one of each oyster and they are excellent in taste and texture. The price is a little on the higher side, but quality is definitely there. \n\nOnly thing I would recommend to mgmt is a more extensive red wine selection.", "author": "Milad S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "It's a 3.3/5\n\nThe Great:\nAmbiance. So super cool and different, even the bathrooms\nService is A+ so sweet and accommodating\nOysters\nCocktails yasssss\n\nThe Not So Great\nNoise - I like my energetic noise bumpin vibe but it's a shouting match\nFood is a big womppppp. Went for dinner and was not blown away by anything other than oysters\nBack area is so dark you can barely see each other. Can't see the menu at all. Can't take pictures (where's the food porn??)\nUncomfortable seating\n\nSo 3.3/5 is for dinner.  BUT it's a 4.5/5 for a cocktails and oyster only bar. Will re-review when I try it for that!", "author": "Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "The ambient lighting, decor, cocktails, food, and service was all great! We lucked out and was able to sneak in a light meal before my husband's holiday party in December.", "author": "Bella B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Maybe the cutest restaurant that I've ever stepped foot in. This is the sort of place that takes you out of the depressing fog of San Francisco and makes you want to order a glass of rosé, sit back and enjoy! Banana leaf wall paper is lined with mirrors, huge funky lights and a gorgeous long, well-lit bar.\n\nWe ordered the tea leaf salad and added charred avocado. There is also the option to add tuna carpaccio which I highly recommend. \n\nLobster roll was good but I prefer a hot lobster roll.  This one was served New England style with uni butter. I did not even notice the uni butter but the lobster was tender and flavorful. The brioche was spot on and the fries were solid.\n \nThe hot oyster with seaweed was way too salty. I'd skip the hot oysters next time. I will absolutely come back the next time I am in SF for dinner, and enjoy a glass of rosé or a cocktail.", "author": "Brittany F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "This was my second visit here, and it will be my last.\nThis meal was a big expensive letdown from my first meal here 6 months earlier.\nBoth the service and food were off.\nService was inconsistent, had slight attitude at times like they were doing me a favor to order me a $15 cocktail.  Other times the staff were slightly aloof or unprofessional.\nOrdered oysters, crab legs, and lobster claws from the raw seafood bar.\nThe $26 lobster claws (2) were overcooked and tough.\nThe lobster bisque was lukewarm.\nTotal came out to $150 for lunch 1-person.\nFor that price I expected better.", "author": "Marcus A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-10", "description": "i expected THE WORLD of leo's oyster bar.  i think that was the downfall though, because when you go in with such expectations, things generally fall a little flat.  we showed up for dins at 8 pm on a monday without a ressie, there was a table available by the door, and a few seats at the bar, so walking in is definitely an option if you cant score a reservation.  this place books up super quickly.  we order cocktails right away, but it takes a long time for them to arrive. the drinks are beautifully made and presented,  the island time, with mezcal, is delicious. my gf really enjoyed the mai tai, which comes in a cute tiki glass. the garden party is really pretty!\n\nfor eats, we ordered so many things - 2x the deviled egg with wing fried oyster, smoked trout dip, house made tater tot, rock shrimp toast, foie gras, ahi tuna carpaccio, and hamachi. oh, and six different oysters.  it was a lot of food, but the portions are small and all the items are light.  the deviled egg arrived first, and that was probably the beginning of leo's downfall, because when you open with such a FANTASTIC bite, you expect everything that follows to be just as good, but they are not, so it's doomed!  everything else was just okay, with the exception of the rock shrimp toast, which came out on kinda soggy bread and tasted like nothing.  meeps. \n\n3 rounds of cocktails for us with the above items, and the bill was just under 400 after tax and tip. so it's not cheap. lol, i would probably come back for the drinks but i feel that the food is sub-par for the prices they charge. atmosphere is great, service is a little eh.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "This place is fabulous! Great Gatsby meets the 1950s with a tropical twist- as mentioned by a fellow Yelper. It's an Instagram moment the second you step foot inside this place. From the menu to the wallpaper and down to the water pitchers, no detail is overlooked. Thankfully this place is more than just about the atmosphere. The service was super attentive and the food was great. The tea leaf salad is a must! Our server highly recommended it and boy was he right. So much bright flavor in that dish. Do add the charred avocado- it's worth it. Or add both the charred avocado and tuna carpaccio. It's delicious. The lobster roll is delightful and if you're not starving- split the roll and the tea leaf salad with a buddy and round out your order with a glass of Rosé. I'll definitely return to Leo's.", "author": "Isabella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Still the best oysters I have EVER had in my life. Period. Yelp isn't letting me post a short review so I'm going to add a couple more words to this in order for my message to be heard by the masses.", "author": "Olya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Came into town for some errands and just searched for a seafood place for lunch. Turned out to be a great place. Large selection of fresh oysters and many other dishes. We had oysters of course, then two appetizers - Lobster bisque and the smoked tuna dip. Both were excellent. We sat at the bar as it was peak hour and we had no reservation but that was a pleasant experience overall. The bar staff was attentive and highly professional.", "author": "Ranny H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "I love the food here and have only been here for dinner, but in December I came here for lunch to have an early x mas celebration with my friend. In the beginning it started off really good-friendly waitress and they even split our food up since we were sharing. Got our first 2 apps then after 45 minutes the tuna tea leaf salad and lobster roll still didn't come out. I asked our waitress a few times and she said soon, or 5 minutes. No apology or any explanation. She would avoid my area and I had to go find her to ask her what's taking so long. She was snappy back at me saying it's coming. It's been an hour....If the kitchen is backed up or you forgot to put in the rest of the order then own up to it. I think waiting an hour for the rest of our food to come without explanation is unacceptable and for you to give me attitude is wrong. The tuna salad finally came and it was super acidic. When the lobster roll came I had to take it to go. I only have an hour lunch and I was gone for an hour and a half already. I couldn't even complain to the manager. Xmas lunch ruined and I haven't been back since. I really like their food, but it went downhill with that and service. Sucks....also this place is pricey so to be treated this way was just annoying and so disappointing.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "The devil eggs are to die for!!!!!! They're amazing - like seriously... talk about the place, super cute and great place. ask for heather she so nice. We even had a chocolate mousse with a golden flake", "author": "Karina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Great 70's vibe done in the most tasteful way possible (i.e. No plastic liners, fabrics, gaudiness). \n\nOur waiter was WONDERFUL and walked us through the complete menu - how large everything is, brine level, everything you could want to know about not only the oysters but entire menu. \n\nThe deviled egg with fried oyster on top has this amazing sriacha aioli and all the textures blend together and make this crazy mouth explosion. I could've easily eaten a dozen. The oysters were perfect, and my extra dirty martini paired very nicely. \n\nThe lobster roll and fries was great to fill us up (split 3 ways) and had \"dynamite sauce\" for fry dipping - more sriacha goodness. The lobster was large clumps and very fresh, not too mayonnaise-y. \n\nAlso, not one but TWO hidden bars in the back. Don't stop at the first door :)", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "LOVE Leo's Oyster Bar! A new official \"must-go-there\" for all my future trips to SF. The decor, atmosphere, service and food is a 5/5. \n\nMy date and I came during the lunch (ends at 3pm)  and dinner (starts at 5:30pm) break but there is still a limited bar/snacks menu available. We sipped on a few specialty cocktails and snacked on fresh oysters and shrimp. It was perfect. \n\nI hands down adore the 1930s-esque urban retreat vibe and the staff makes it more wonderful. It is listed as $$$ so like any other luxury, prepare to splurge on yourself - but if you love good, quality food, it's totally worth it at Leo's.", "author": "Cherish K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "My wife and I really enjoy this restaurant: great service, cocktails and seafood. We've been here a few times and it's been consistently great across the board!", "author": "brett a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-19", "description": "Walking by Sacramento street we decided to try this place.  The ambiance is great.  Lots of people inside we thought... Hmmm happy hour crowd?  Not really.  \n\nI am not biased it's just the fact that I will provide. We looked at the menu and also checked yelp for recommendation.  I have to say Yelp and Yelper's...disappointed me with this one.  So,  here goes.\n\nAtmorsphere = 4 stars \nFor the $$$ Tables are tiny and everyone is in close quarters = 2 stars\nService (Joseph) =5 stars\nKitchen (very slow) = 2 start (Joseph had to apologize, 0the kitchen is backed up) \nDrinks had the Garden cocktail drink = 5 stars\nToast with Foie Gras and buttered Uni = 2 stars (vs Monseiur Benjamin) \nDeviled egg with fried oysters = 3 stars (vs Aquitaine) \nBaked Oyster Carbonara = 2 stars (vs Hog Island ) \nSeafood bisque = 5 stars (this is a homerun) \nMussels en papillon = 3 stars (vs Plouf) \n\nBottom line: 3.5 Stars - We were disappointed.  \nThis place is a shi shi.. foofoo. Service is excellent,  the food is OK with the exception of seafood bisque (homerun) and cocktail is awesome.  With that said it is overpriced.", "author": "SFoodie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "SUPER expensive but it's really really cool inside. Be sure to have a reservation though. If you don't you will not have a table and you better hope there are a few spaces that are together at the bar. Great cocktails and food, but be ready to drop some cash on lunch. Love the decor!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "NIBBLES AND BITS\n\nCelebrated a friend's birthday here 2 weeks ago. The place was packed and fortunately they have a back lounge area for walk ins. It reminded me of a Tiki bar - not all of the umbrellas and candles, but a smaller space with actually more room than the main dining room.\n\nThe front room is long and narrow with tables on the right side - fairly close to each other a small space then the bar patrons - and there was no seat available in the place by the time we got there on a Friday night at 730pm. And there shouldn't be. I'm a big guy so getting back to this area in the tiny path between the tables on the right and the people at the bar was not fun, but that's my problem not there's.\n\nIt's a weird little menu - very small print - Bring those Readers!!\nWe started with a selection of the West Coast Oysters and a 'Raw Bay Scallop' in it's shell. The manager recommended it and it was very small but quite tasty. I highly recommend trying it - apparently it's a Thing now - to eat raw scallops. I'm so out of it. \n\nBob had the Salmon - excellent $27.00 and I had the Lobster Roll for $32.00 - it was okay. It was good but they made up for the lack of Lobster by it being more like a Lobster slaw which does Not bring the Lobster flavor I'm looking for for $32 Bucks. The large plates also known as Dinner in my world - there are only 4 to choose from. I guess this is for nibblers. There's a Short Rib meal, Mussels (which are more appetizer to me), Salmon, & the Lobster Roll. They have a nice wine list. Decidedly this is more of a small plates / after work hors d'oeuvres hour. \n\nAlso the service was excellent, and even though the tables were smaller in the back lounge I liked it more - more space, not as loud, attentive service.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "I went to Leo's Oyster Bar alone for lunch and the waitress was so amazing. I ordered the rock shrimp bacon sandwich and it came in like a light mix salad form on toasted white bread. \n\nBefore my meal, my wonderful waitress gave me a bite of the seasoned chip with tuna. As my meal arrived, my waitress also comp'd me a glass of rose to accompany my sandwich and fries. Truly impressive and made me feel so welcome! Side note: there is no service in the room in the back, at least not for me. \n\nIt's located next to Wayfare Tavern and definitely adheres to that old classic ambiance with a beautiful Palm Springs-y entrance that takes you back in time. \n\nFour stars for the high prices. I'd definitely go back for a happy hour but I'm not convinced this is somewhere that I need to go for the food.", "author": "Christine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Initially came for the dessert to celebrate my birthday, then happily stayed for oysters and caviar. All of which I highly suggest!! The oysters were large and fresh. The dessert rich and perfectly proportioned. And the caviar... Worth it. \n\nI felt so special wine'ing and dining at Leo's- the server was knowledgeable on the menu and so engaging; the decor took me to a Cuba'esque tropical escape from the busy city; and the food was so good I wish I had budgeted for a whole meal.\n\nPerfect intimate birthday celebration spot, or date spot.", "author": "Regina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Delightful little restaurant in the financial district. You will certainly need to like seafood and ideally raw food to be able to appreciate most of the menu. \n\nRaw bar has about 6-10 varieties of oysters from around the States, along with a few other seafood options. Can't go wrong if you like raw oysters. \n\nHighly recommend: deviled eggs with fried oysters. Also the toasts are great- fois gras in particular. \n\nDesserts are fine but not mind-blowing. \n\nGreat service. Small restaurant but lively and cute.", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "The best oyster I've ever had in my life. No words. \n\nWe did ended up trying the other food, everything was amazing. The decor was very cute and service was so friendly! It is on the pricer side but well worth it.", "author": "Tina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Every year we have a restaurant with which we become obsessed. It even gets a mention in our holiday letters. This year, it's looking like that restaurant is Leo's Oyster Bar. We've been 3x the past few weeks and have tried nearly everything on the menu. \nTL;DR EVERYTHING IS FANTASTIC. You can hardly go wrong. \n\n* Raw bar: My new favorite in the city. Nice oyster selection, \"fancy oysters\" with pickled tomatoes and horseradish, prawns, raw clams, and the most delicious king crab legs perfected with the dynamite sauce (kewpie mayo, sriracha, and tobiko). Everything is so cold and fresh! I saw the picked king crab and was pleased we chose the legs. Very satisfying. \n\n* Caviar: loved the American sturgeon platter and all of the bites. Every single one. Seriously. Get the bites. \n\n* Small plates: The \"tater tot\" is like a latke topped with smoked fish & olive tapenade - highly recommend. The crab and lobster cake is good, but not as much of a wow as other items. Still recommend it! The fries are dangerously good - very salty and come with that addictive dynamite sauce. They also come with the lobster roll.\n\n* Toasts: My favorite toast is the mustardy, buttery salmon tartar. Also enjoyed the tuna conserva and rock shrimp toasts. My companions loved the foie gras, if that's your thing. \n\n* Soups: The clam chowder is like liquid velvet - one of the best I've ever had, top 2 or 3 of my life. The rock shrimp bisque is silky, tarragon-y, and my husband's favorite recent discovery. Highly recommend each.\n\n* Salad: The louis is an elegant salad for one, but the only item not optimized for sharing. For sharing, have crab legs from the raw bar or rock shrimp toast instead. \n\n* Crudos: My favorite is the scallop and jalapeño - such flavors and texture. The hamachi on grilled avocado melts in your mouth, the olive oil and flaky salt finish it expertly. The salmon carpaccio is very good and the favorite item of one of my companions, but the other two are truly divine in my eyes.  \n\n* Large Plates: They will slice the lobster roll for easy sharing for up to four. It's good. Not the best lobster roll I've ever had, but maybe the best currently the city? A good amount of lobster, but not the massive mound one might hope for. I've already mentioned the dangerous fries. The mussels are plump and juicy. I think they are better shared so you can enjoy more items. The beef short rib with bordelaise sauce/potato puree/uni butter - that sauce! the meat you could cut with a spoon! What a fantastic meat dish at a seafood restaurant! I watched someone thoroughly enjoy the salmon, but didn't get a chance to try it yet myself. \n\n* Cocktails/wine: Good enough to come just for drinks. Won't be surprised if it starts making lists for the bar alone. Excellent wine list. Of the cocktails, I found the Island Girl too sweet, but someone who likes sweet happily downed it for me. Other than that, they've been perfect. The Mai Tai has been a favorite with everyone we've brought and comes in a delightful mug. It doesn't get smoother and classier than the Office Supplies. The Mah Jong is great. The Grasshopper has modernized the classic - real mint and no green coloring. My personal favorites have been the Garden Party - so fragrant! - and the ultra refreshing Babarita. \n\n* Dessert: I've been too full to partake, but watched friends enjoy the strawberry sundae once. \n\n* Decor: My house needs to be this exact kitschy, midcentury fantasy. \n\n* Service: Top notch. Couldn't be better. Bravo. \n\n* Con: Very loud. Haven't sat in the walk-in only room in the back where they serve everything except the large plates, yet. It looks lovely and I hold out hope it's quieter.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-28", "description": "Don't get me wrong, Leo's was good. Service was great, food was ok, ambiance was \"hipster,\" but honestly, everything was just waaaaay overpriced. $13 minimum for a cocktail or a glass of wine...? Really? We had the mushroom toast, oysters (12), a salad and two drinks each between three people and it was close to $300. I had a good experience, but I think i could have had the same experience for less than $200 a person...", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Oyster was fresh and the waiter was knowledgeable on which ones we would like.\n\nSkip the king crab. They give you so little for $14.\n\nA few mussels were closed so was disappointed by that. Also had the mushroom toast (liked it) and lobster roll (eh had better). Overall not a memorable dinner. Won't be going back.", "author": "Dana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Loved everything about this place. We found it in Instagram because who doesn't decide they are going to eat at a place on Instagram? \n\nSat at the bar because reserves were completely full. That was better anyway. One of the bartenders was a cool guy. Quick with cocktail suggestions (get the one with gin and egg whites was insane), also to call people \"friend\", mean that in best possible way... Great dude. \n\nThe oysters were fantastic and there are several east and west coast options. Stick with west obviously fresher and better. \n\nSeems like it could be a good date spot. Tons of finance folks sitting at the bar and that's not a bad thing either just the type of crowd. Martinis were consumed and why not?", "author": "Josh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Casandra was truly amazing. I am a vodka girl, so I asked for a vodka cocktail with oysters that would pair best. Casandra prepared us an amazing drink with pineapple palms that tasted amazing with kuushii oysters. Ask for her every time you enter this oyster bar.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "Wonderful swanky atmosphere with a pleasant wait staff from the host to the oyster chef. The oysters is what gives this place its charm. They were perfectly shucked with not a grain of shell and well separated. For lunch the food options and actual sandwiches are quite underwhelming. The shrimp sandwich was so dry and maybe had 1.5 shrimp in it total. A $20 sandwich should be a bit more put together. The lobster roll was just ok. Again $36 for a roll in this town should be darn good. They need to improve the very minimal food options thy have to be AWESOME... really no excuse for that. Then they would be a 4-5 star place easy. I would definitely go back, but for the oysters alone.", "author": "Jody M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Solid choice for a seafood raw restaurant. Definitely heavier on the cold food options here. \n\nOysters (4/5) - high end price but all class and delicious\nUni Toast (3/5) - didn't pick as much uni as brioche \nLouie Salad (4/5) - excellent rendition with nice varied greens. The sauce was a bit peppery but was a nice break from normal versions\nLobster roll (5/5) - it was pricey but probably the best lobster roll I've had. Not heavy on sauce and great on the chunks of meat. Fries were nice and the Dynamo dipping sauce was great\n\nService was fantastic. I wish they had bread served but can't have it all. All in all prices were on higher end but this place was worth it.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Came here for our 15 yr anniversary.  Found it on yelp while looking for a good oyster place.  Really nice place, service was great, and the oysters and the plates were amazing.  The lobster roll was perfect, couldn't get enough.  Would definitely come back.", "author": "Dany B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "Food is around 3.5 stars, service is 4 stars, kitchen pacing is 1 star, and the space ambience is 2 stars. \n\nI am so ambivalent with this place. We got there at 5:30, they gave us a table right away and told us that they need it back by 7pm for a RSVP. No problem (1.5 hrs is plenty of time). We order (right away) oysters, crab cake, 2 soups, and mussels. It took 50 min (6:20) for 6 oysters to come out. Really? And the table is super tiny (18 inches by 18 inches) so they can only serve 1 thing at a time. This means we have gulp down all of our food, drinks, and pay for our bill in less than 40 min. \n\nThe food is fine but nothing to write home about. You pay fidi price ($180 is our bill).\n\nWe would not return or recommend to any one with so many better options in the area.", "author": "Tracy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Went to Leo's around 5:30 on a Wednesday and it was super packed, so make sure to get a reservation. Really cute space with multiple rooms. Tropical theme is always a great idea. The front of the restaurant is definitely bustling, but the room we were in was dimly lit and quiet. The service was great! Had multiple servers who were always helping us with refills and our multiple orders of oysters. Food is a bit pricey, at $4 per oyster being the cheapest but it is really good. The dynamite sauce that went with the fries is so delicious!", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "It's always a good sign when you can't decide what to order because you want to eat literally everything on the menu.\n\nAfter much deliberation (and agreeing that we'd have to come back to try everything else), my friend and I settled on the following dishes:\n- Kusshi, Peter's Point, and Fancy Oysters\n- Sea Urchin Toast with Ginger, Soy and Scallion\n- Salmon Tartare with Marrow, Capers and Dill\n- King Crab Leo's Louie with Gem Lettuce, Mache, Radish, Fennel, Tobiko, and Sieved Egg\n- Japanese Hamachi Crudo with Charred Avocado, Sea Salt and Scallions\n- New England Lobster Roll\n- Braised Short Rib\n- Blood Orange Creamsicle Float\n\nThe oysters were super fresh. The Fancy Oysters are served with pickled tomato and horseradish, so be prepared for a little kick! The Hamachi was cut surprisingly thick and paired very well with the charred avocado.\n\nSea urchin is a huge weakness of mine. You could throw sea urchin on almost anything and I would love it. The sea urchin toast, while small, was very flavorful and light. If you're an uni fiend like me, the Lobster Roll and Braised Short Rib are also served with clarified uni butter.\n\nOur entrees were excellent. I think Leo's Lobster Roll was the best lobster roll I've had in SF. I ordered the Braised Short Rib which was so tender it practically fell off the bone. The pureed potatoes were thick and creamy - such perfect texture! The dollop of uni butter was just the icing on the cake. ;)\n\nIf you have room for dessert, I highly recommend the Blood Orange Creamsicle Float. I'd love to try the Pineapple Sundae next time!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "This restaurant had my attention before the doors even opened for biz and I was able to snag a reso opening week.\n\nFirst impression: obsessed with the tropical decor and the lighting. Very warm and inviting. \n\nSat at the bar to wait for the rest of my party and the bartender gave me a thorough run down of the cocktail menu and sold me on the Mah Jong. Stiff. Refreshing. Perfect. \n\nLeo's deviled egg: soooo good. I personally loved this one but my friends thought the sauce overpowered the flavor of the oyster. Maybe I just really loved the flavor of the sauce which was spicey and vinegary. My kind of sauce. \n\nHouse made tater tot: good but not amazing. But any menu item with tater tots must be ordered. \n\nClam chowder: I'm from Boston so I have high standards for clam chowder but I thought this was so delicious. A must try!\n\nLobster roll: my fave lobster roll in SF is still woodhouse. \n\nOysters: all fresh, all good. \n\nWould definitely try again but it's pretty pricey for the amount of food you get so be prepared to spend some dough!", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "This review is for the service only. I was dining with a friend at the bar and the bartender was initially nice, though obviously making comments about me and friend in Spanish. I am fluent, but I chose to ignore them and chalk it up to sexism and machismo, rather than let it ruin my night. \n\nI later mistakenly asked a server  a question and her reply, not only was completely unintelligent, never answered my question. Maybe all that bleach in her hair has seeped into her brain. She then proceeded to insult me in a back handed way and I chose to ignore the millennial attitude. Children are so rude sometimes. I watched her as she walked up to the bartender and started whispering in his ear and they both looked over. The bartender all of a sudden decides to start mixing and shaking cocktails right in front of us, banging the mixers as loudly as possible, as I sat there talking to my friend. I smiled at him and said \"Wow, you're really working those cocktails.\" At this point we are done with our meal, but finishing our wine and I tell my friend was is transpiring, because she normally does not take note of these things. At this time the bartender comes back to make more cocktails in front of us and she says \"Yeah, that splash was not accidental.\" and laughs. \n\nWe enjoyed our meal and the time we had there, but the service really needs to be looked at. From reading others' reviews, this is not the only instance. I am a fan of all the Big Night Restaurant Group locations and even recently dined at Petite Marlowe, which was a completely different dining experience for the service alone. Leo's is unfortunately lacking in employees that will make their location a desirable place to dine at.", "author": "Norma .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-12", "description": "This place is A-OK as yelp says. I really wanted to love this place more but its definitely good. There is a large selection of oysters and some with unique toppings. The bar was also well stocked and had many good drink options. The lobster roll was good, for the price I wish it was a little different special. It was an ok option. All in all a decent meal.", "author": "Ian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "This restaurant has a good vibe. Our server was amazing, helpful and really sweet. I felt the portions were small for the price but everything we had was delicious. We had the deviled egg w/buffalo fried oyster on top, 1 egg $6, pricy and very small but very good. I had several oysters on 1/2 shell, they were delicious and the vinegar sauce served with them was really good. We shared a bowl of the lobster/crab/shrimp bisque it was very rich, filling and really good. The lobster roll is really good!! Lots of lobster and very tasty. The seating was a little uncomfortable, we sat I. The 2nd room with a patio like chair with a pillow, hard to get comfortable in.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "This place is a complete ripoff. I think it caters towards people that can afford it and yet have mediocre taste in food. Pretty overrated. \n\nIf you are coming here, do not get anything else on the menu except for the oysters and the cocktails. \n\nOutside of the oysters, I ordered the tuna dip and they literally brought out shredded tuna which looked like and tasted like Chicken of the Sea canned tuna. The Hamachi dish looked nice when it came out, but was not that flavorful at all. The bone marrow was sub par compared to other bone marrow I've had. Lastly, the crab cake is tiny. Taste wise it was pretty good, however it was pretty skimpy on the size.\n\nLastly, our server did not explain the menu to us at all and did not do a good job selling us on any of the dishes.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-06", "description": "I guess this place is brand new! I really liked the snazzy interior. I wanted some grub late at night after going to Super Bowl 50 events, but I didn't find anything I wanted to pay for and munch on. It's a nice menu though...just not in mood for this food..and bill! I asked the bartender for a non-alcoholic beverage and she made me a fruity fizzy concoction that costed $7.99. The bartender was so attentive, funny, and charming. Yay! This new place is a pretty cool spot in FiDi.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "While perusing Instagram like I normally do, I came across a beautiful room scape that was tropical, urban, feminine, and welcoming all in one. To my surprise it was a restaurant, and to my delight it was in the city I lived in! Times like this remind me of how much of San Francisco I have yet to discover despite having lived here for decades and eating my way through the city.\n\nI made 5:30 reservations for happy hour with a girlfriend of mine and ordered one of their fancy (and probably overpriced) but delicious drinks, The Palm Beach while I waited. It was tart but not sugary sweet, and the Basil Hayden balanced it out. It was also a good indication of how the rest of the night would taste.\n\nWe ordered the ...\n\nGarden Party - Super refreshing gin cocktail with a subtle hint of rosemary. Yep, that's happening again.\n\nBarbarita - Quite possibly my second favorite, if not favorite spicy drink ever. The celery threw me off, but everything worked well. Yep, this is happening again. And again. And again. \n\nRoasted Bone Marrow - You know how criminals get a last meal? This would be on there, because it combines 2 of my most favorite delicacies: uni and bone marrow. Normally, I like both of these things as plain as can be, so that I can enjoy the taste, but this worked out perfectly.\n\nFoie Gras Toast - It's a small serving, 4 toast points to be exact. However, the foie gras is so indulgent anymore might be overload. I'm lying, I could've eaten way more but it was a good amount to enjoy. It was like butter!\n\nLobster Roll - The lobster roll ... was a lobster roll. We only ordered it, because it was easiest to share. However, it wasn't anything special. What saved it was the uni butter. \n\nPineapple sundae - Simple, yet surprisingly delicious. The pistachios were a nice touch. \n\nChocolate mousse - These are tiny, but don't order 2. We both figured since it was told to be the most popular item on the menu that we would want our own. Never mind that neither of us were big chocolate mousse fans lol. Just too rich for our taste, but not bad in general.\n\nAll in all, this is my review for my first experience there. I'm sure there will be many more, as it's the perfect little spot for a girls night out or girls HH. While men will absolutely enjoy it as well, the ambiance just screams girl time.", "author": "Abby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Yuuuum. If u luv oysters, come try this out! Steps away from my office on Sacramento cross Montgomery. Cute little joint. Came here on Tuesday with a vendor for lunch. Tried out 6 different types of fresh oysters. Slurp them all up in two minutes. Fries were good. Lobster bisque superb. Devil egg! I had the tea leaf salad adding tuna carpaccio.  I'm in luv. Loads of herbs.", "author": "Vee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Fantastic quaint little place - superb service. A grand success and fantastic addition to our neighborhood. The service is among the best in the neighborhood, which, with rare exception, is all ready superb. FiDi is a special place which is fiercely competitive and Leo's is quite at home. The decor is relaxing - visit and you will see what I mean.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "leo's has the whole package... ambience... Excellent oysters! Excellent service. Patrick was our waiter great job!!", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "Absolutely one of my favorite spots in the city. I was sooo excited to try this place out, and it did not disappoint! \nMe and my wonderful guest shared: \n-fried oyster deviled egg 5/5 yummy!\n-foie gras toast 5/5 GET. THIS. \n-steak tartare with uni 3.5/5 pretty standard steak tartare, heavy on the Dijon. wish it had more uni. \n-oysters & clams 5/5 clams were especially fantastic! we tried all the selections, the sweetwater oysters were standouts for me. we got a few with uni and caviar, as well... how could you go wrong. \n-garden party 5/5 delicious and beautiful \n\nthe service was a little awkward? we at times couldn't understand/hear our server, but he kept us informed and was attentive enough. however, it was enough to keep this from being 5/5 overall. \n\ndecor is amazing, congrats to them on their james beard nomination. \n\nwill be back... and soon!", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "I looooooove this place. I didn't make a reservation (the only available slot was 9:30pm), so my friend and I did a walk-in for a spot at the bar. The tropical wallpaper/decor you see in pics is maybe 25% of the restaurant (both walls by the entrance, wall next to bathroom, and the bathrooms) and the rest of the restaurant is dark and has an intimate feel. The prices are steep, but the food did not disappoint. I didn't get any oysters because I don't like oysters enough to pay more than $1 each and to know the difference between good and bad ones. I got a deviled egg (for $6 you get one deviled egg... in other words half an egg), foie gras toast (4 small pieces for $20), and lobster roll ($32). The wing fried oyster and sauce on top of the deviled egg made it unique and delicious. The foie gras toast was aaaaaamazing and had strong flavors (so something to nibble on rather than take huge bites of). The lobster roll was delicious, but if I get it again next time, I would want to share it (can get it cut in half). I'll be back!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Man, that was good - ate here the last two nights while in town for business. Sat at the raw bar. Oysters were top notch and clean.  Henry the GM, and the staff were really pleasant and knew the details about the dishes which was nice.  I'd have to say my fav dish was the ahi tuna carpaccio with tea leaf salad on top.\n\nSuperb!", "author": "Nick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Love this space! Cool vibe in a small, intimate space. Amazing raw bar with multiple kinds of oysters and shellfish. They have high quality wines and delicious craft drinks. The bartender, Zaudrey, is so nice as well. A great stop for happy hour or nice dinner. A real SF gem!", "author": "Derek C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "I really thought about giving this a 3-star rating given the crazy prices and chilly attitudes of much of the staff, but the food, wine, and back bar were redeeming enough that I thought 4 stars was more appropriate.\n\nFor dinner, we sat at the bar, which I thought was nice.  They have a really funky backlit marble-like bar top, and you can watch the raw platters being prepared right there.  Generally, I really like the décor - it's like French Polynesian colonial without feeling overly theme-y or Disney-esque.\n\nI was impressed with their wine selection - some really great California options, and I had a fantastic French Melon that paired perfectly with our raw bar choices.  \n\nFor dinner, the two of us ordered the assorted pickled vegetables, cinnamon spiced nuts, 5 Kusshi oysters, 4 Shigoku oysters, 3 Peter's Point oysters, 1 Oyster \"Eloise,\" 1 Fancy Oyster, 4 Cherrystone Clams, and 3 Shrimp Cocktails.  The oyster quality was A+++.  I LOVED the Fancy Oyster, even if the horseradish temporarily blinded me!  I didn't have the Oyster Eloise, but I heard good things.  Their cocktail sauce is amazingly tasty, which is why I had to order a third Shrimp Cocktail.  The bar snacks were fantastic.  The only thing we didn't like were the Cherrystone Clams - they were just so \"fishy.\"  I think that's always a risk with these, but my boyfriend was extra judgmental since he lived in MA for many years and would get them fresh out of the water...\n\nWe had initially planned to get more food from the main menu, but this ended up being quite filling.  After dinner, however, we went and had a drink in the hidden back bar - The Hideaway - where we ended up ordering their AMAZING gravy fries.  They are a must-try.  I look forward to going back in warmer weather once The Hideaway's outdoor patio is open.\n\nOverall, this is a great addition to the area and worth the prices perhaps for special occasions.  I think they'd be well served to add some kind of oyster happy hour, however...", "author": "Tay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "Food was just Okay... \nNothing to write home about. \nI mean the Oysters were great,  very tasty but everything else was just OK and way overpriced. \n\nDecorations were nice and tastefully done but the place was way too small.  So awkward sitting so close to strangers.", "author": "Lulu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Beautiful place. We were charmed from the doors on in. Great space, great bar, great design, and it extends to the menus, the typography, great execution overall. Super nice dinner with oysters, beef tartare, trout roe, tuna carpaccio, black cod, and some very nice champagne. It was a special occasion and Leo's more than made the grade. If I had any complaint at all it's simply that dinner was expensive but that's what you get in downtown SF when you order up a big plate of oysters and bubbles, etc. I do think it's excessive for *anyone* to charge $3+ per oyster when I grew up eating them at Tomales Bay Oyster for $0.43 each, but that's not Leo's fault per se, it's SOP anywhere in the City. Shine your shoes and get your roll of clams ready, eat at Leo's! \n\nPS there are two back rooms and a back bar -- would be a great place for an event!", "author": "Bowen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I came here for my boyfriend's birthday dinner. I chose it because I love the ambiance and decor, it's a small restaurant so it also feels intimate. I came here for happy hour before and didn't order much, so I was excited to try more of the menu. We ordered some fresh oysters, foie gras toast, hamachi, bone marrow, steamed clams, lemon mousse, chocolate mousse and a bottle of wine. Everything was delicious and tasted very fresh. I was very impressed with the service as well, friendly waiters who passed by quietly letting you enjoy your time in the dimly lit space. I'll definitely be back here again sometime soon!", "author": "Stacy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Came here for my 30th birthday and it was great! We sat in the back room and the decor is gorgeous. The service was impeccable and the food - WOW. Get the deviled egg with buffalo oyster. The lobster roll was perfect and the octopus was another favorite. I wish I lived in SF so I could come back often!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Thursday night and this place was jumping! Delicious flavors and excellent drinks. This place gets loud and the tables are small but the bar is very cool and spacious. Great service from everyone!!", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Jennifer Puccio does it again!  Where in the world do I begin??  The space, the ambiance and the staff were all fantastic.  The oysters on the half-shell were delicious, as were the cocktails (I had the Mad Man and Office Supplies).  The deviled egg?  Ridiculous.  The baked oyster carbonara, are you kidding me?  in.SANELY good.\n\nThe lobster cake, foie gras, lobster bisque and steelhead trout were all legendary as well.  Couldn't be happier with the experience and will definitely be back.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "I'm in love with Leo's! If you like fresh seafood this is your spot. \n\nThey have a great raw bar with some of the most delicious oysters and shrimp. They are also very good at recommending a nice wine pairing. I had never tried some of the wines on the list and they have turned out to be some of the best I've had! \n\nIt is a little more on the pricey side but totally worth it!", "author": "Sinem S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Very pleasant experience all around.  Wait staff and bartenders incredibly friendly, attentive, and helpful.  Oysters fresh.  Were willing to work with my gluten free companion.  High energy, but wait staff kept it solid.  Go.", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Magical experience. I will be back again and again. I'm not usually a cocktail drinker but these cocktails are phenomenal - have the garden cocktail. They're not too sweet, not too bland. Such a perfect frothy blend of everything you'd love.\n\nThe food was also great! Start with a deviled egg (it's a bit spicy but amazing) then try the ahi tuna carpaccio tea leaf salad. And for desert, have the chocolate mousse!\n\nThe service is amazing! Kassandra is the best - she came up with the drink menu. And the place is beautiful. Great date spot. A bit small but the lighting, decor, branding, and music were heavenly.\n\nNothing bad to say about this place! Great great place.", "author": "Ley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Leo's might be my new go-to spot! Ambience is like no other I've experienced in the FiDi, the service is top notch, and the various selection of oysters are to die for! If you want something other than oysters I'd recommend the deviled eggs, bone marrow and lamb tartare.", "author": "Constance Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "1 Shrimp salad, 1 lobster roll and 10 non-fancy oysters. Bill came out to $100 exact including tips, no drinks.\n\nThis is definitely on the high side for a business lunch given there were minimal plating skills nor wow-factors involved.\n\nWould not recommend. Nevertheless, I do adore Marlowe.", "author": "Catalina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Most importantly, the food was off the hook. We shared a bunch of small plates/appetizers and were pretty impressed with everything. The caviar bites were awesome, the foie toast was insanely good, and I loved the hamachi (amongst everything else). We had a reservation that ended up being about 20-minutes late, which was no big (we sat at the bar and had a couple of drinks while we waited) and they went way above and beyond for us as an apology, which was totally unnecessary, but much appreciated. Can't wait to get back and pay full price for everything.", "author": "Quinn O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "I heard about this place through a friend, and saw that they had \"lobster rolls\" on the menu, so I went after a doctor's appointment, as I don't live close to here. I was expecting not to be able to be seated, since it was in the middle of the lunch busy time. But I got seated at the bar and started out with an oyster shooter topped with caviar. (Brilliant!). Even though the place was packed, my lobster roll came within 5-10 minutes. It was incredible, on a nice fresh baked artisan roll. The thing that was amazing, is that the lobster meat was served without the usual mayo dressing. They gave you the opportunity to add the red aioli that was on the side as much or as sparingly as you wanted (Nice Touch!). It was served with fries, which were fantastic. All this topped with a great Sauvignon Blanc, made my day. I can't wait to come back here again.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Out-of-the-way location is cool. Main dining room with bar is nice. But we weren't seated there. We walked back to a back dining room. Windowless but bustling. That was okay. But we weren't seated there either. We were then lead into a small room off the back room. Small. Decore was bad tiki. Tiki can be cool, this tiki was an afterhought. The room was a converted outdoor area constructed for the sole purpose of cramming a few more covers into a night's effort. Service was great. Food was okay, but absolutely made less appetizer by the crappy environ. When you're paying that much money for dinner, you should get to enjoy it in nicer surroundings. Much nicer. Lesson learned.", "author": "Norm C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-17", "description": "My girlfriend's hair was burned by the candle on the table because the table is TOO SMALL to avoid the candle!!! Niether the manager nor server said sorry to her. The only words the manager said was 'are you ok? and we have to change the table cloth because we are professional.' How professional would that be!!! EXtremely crowded and loud place. Food was just ok but no worth it AT ALL. We need an apology instead of changing the table cloth. A place we will never go again.", "author": "Yuxiang G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "So so good! Very cute, but small inside so recommend making a reservation. The cocktails were great, clam chowder was like heaven! Probably the best I've ever had. The oysters were fresh and delicious. We also split a lobster roll--no complaints about anything. Lovely dinner!", "author": "Taylor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-01", "description": "Expensive! I mean really expensive.. Our bill was $180 and we didn't even have caviar! We started with some oysters and cherry stone clams. Presentation was beautiful $4-$5 per oyster. The shrimp was a rip off. It looked like pre- packaged peeled and deveined from farmed source. Not good. Clams were excellent. We also had the clam chowder...I recommend skipping this. We also had 1 baked oyster that was not remarkable. The smoked trout dip was presented like cat food and had was so firm the chips they served with it broke as you dipped. Lastly I was an idiot an ordered the $18 Bloody Mary that tasted like worcestershire sauce. Did I mention it was $18!? If you charge that much for a Bloody Mary it better be the business! My husband had an egg dish I think a deviled egg he ate it?\nAnother issue was the nonchalant staff members discussing their personal lives with the bartender at the prices you charge there Should be a floor show! I get it SF rent is expensive but $180 wow.\nPositives \nOur server was very nice and attentive\nThe decor is nice", "author": "Angie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This is a gem. Interesting and bustling atmosphere with really friendly staff. Food was outstanding and we tasted a number of items on the menu. Good service, champagne and fresh and delicious food made for great evening out and one that will be repeated.", "author": "Jeanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Amazingly fresh oysters and excellent service. We sat at the oyster bar and i would highly recommend you do the same!", "author": "Brad T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "A real head-scratcher. On the one hand, I love oysters, tea leaf salad, and adorable-if-eclectic decor. I mean, the tropical wallpaper matches the servers' ties and the menus *hearteyes*\n\nBut, you see, here's what I want when I pay $68 for lunch for two: to not be hungry afterwards. To not wish I had eaten at Chipotle instead. Is this too much to ask? \n\nYou see, the food was good but the portion sizes are oddly small. Come on Leo, a little extra lettuce on that $18 salad won't kill you.", "author": "Millie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Every time we come to SF we come here. Sit at the bar with Danny and/ or Cassandra. They're the best servers ever-- so attentive and will make sure you have the best time!", "author": "Natalie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "I had lunch here yesterday and the food was delicious but watch out because it'll take a chunk of cash out of your wallet!   I got half an assortment of half a dozen raw oysters that ranged between $4 and $4.25: Chelsea Gem (WA), Shigoku (WA), Sweetwater (CA), Peter's Point (MA), Ring Point (ME) and St. Simon (NB).   The presentation was quite elegant and all the oysters were perfectly shucked.   I also got a couple of Hot Oysters:  Leo's Deviled Egg & Oyster Carbonara, each for $5.   Finally, I got the Salmon Tartare for $16.   While it was delicious, I didn't feel like I got my money's worth on that last dish in particular.  When I contrast it to the same dish at Bouchon in Yountville, I find that for the same price, you get a much more generous and delectable dish at Thomas Keller's establishment.  I accompanied my lunch with a nice crisp glass of Verdicchio from Italy which I thought paired beautifully with all my dishes.  All in all, a very nice and elegant lunch, but I can't give them 5 stars because I thought my lunch wasn't quite worth the value.   I walked out of Leo's close to $100 poorer and still somewhat hungry.   Would I come back?   Probably, but only if I was really craving oysters and I'd probably opt for a more substantial entree.", "author": "David O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Leo's GETS it. From excellent and unique cocktails to succulent oysters to incredible decor -- I was there for dinner about 12 hours ago and already can't wait to go back. The experience wasn't even marred by the fact that the party that had our table before us lingered so long we had to wait 30 minutes to be seated and at a different table. Staff was incredibly apologetic and comp'd us not only glasses of champagne but a delicious starter as well. Always appreciated.\n\nThe food: Our waitress told us her and the chef's favorite is the miso-broiled trout with golden trout roe, and honestly, I probably wouldn't have ordered it if she hadn't said to, but boy am I glad she did. It was cooked to perfection, buttery and luscious. \n\nA close second was the ahi tuna carpaccio, served with a tea leaf salad -- two things you wouldn't think go together but somehow are perfect complements. \n\nWe got a secret menu item, called the \"Marlowe\" fries (an homage to the restaurant group who started Leo's, also owns Marlowe and Park Tavern) with braised short rib, cheese and other goodness heaped on top of a bowl of fries. Kind of like the fanciest best poutine I've ever had. \n\nThe oysters were all incredible. Tried the Garden Party cocktail and loved it. Service was great, good music played all night and you can't beat the unique 1950s/tiki vibe (you'll get it if you go). One of the best dining experiences I've had in SF in awhile.", "author": "Elena K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "So I have to confess - I HATE oysters. So of course when my girlfriends suggested this place, I rolled my eyes and seriously started to consider whether I was friends with these ladies or not. I mean don't they know me at all? Oysters. Ick. But I went anyway because I really wanted to maintain the relationship. Well, well, well...to my surprise this place has some of the best french fries in the city!! I also ordered the green salad with rock shrimp for lunch. The light vinaigrette dressing was exactly what I needed so I didn't hit that after lunch \"in need of a major nap\" situation. The waiter was friendly, informative...there was even a bit of singing from the bar staff when the song \"Hotel California\" came on. It's small quaint, feels french and fancy. I topped off the lunch with a nice Floodgate 20 year Tawny Port. In all, it felt like a good little getaway in the middle of my day with my girls and I didn't have to endure not one oyster! I'll be back Leo, dahling. See you soon.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "We did the raw bar and it was delicious! King crab legs and St. Simones were my favorite - paired nicely with a (ok 3 glasses) chilled rosé. The playlist was spot on too ;) James Nicholas really knows that he's doing!", "author": "Brady R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Delectable oysters, wonderful ambiance and impeccable service... And I found a friggin black pearl in the 1 clam I ordered", "author": "Donnie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-03", "description": "Overpriced, bad service but the wallpaper is alluring. \n\nWas enticed by the tropical feel of the welcoming wallpaper, but that feeling stops at the hostess booth. We sat at the bar, very excited about oysters and could not figure out why there were none on the menu. The woman sitting next to us was holding a long piece of paper and we asked her what it was, \"oh, its the oyster menu.\" Hmmm....\n\nBar service was very unamused by our questions, forgot our \"nuts\", granted she comped them, but it did not make up for the condescending attitude.\n\nWhy pay $6 for ONE deviled egg when you can walk next store and eat many delicious eggS for $10.\n\nWould I go there again: NO", "author": "Marla A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Awesome spot to hit up after work for a happy hour. The staff were very gracious and the atmosphere is photoshoot worthy. They have a simple list of oysters to choose from and there cocktails are amazing! A little pricey but definitely worth the splurge.", "author": "Maggie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "I dined at Leo's for the first time on a weekday for lunch.  Its facade and location on a dingy section of Sacramento, prompted me to say, 'these doors better open up to a fantasy Wonderland' (because of the high prices and sophisticated menu)... and they did.  The pink and green South Pacific decor is splendid.  My friend and I were extremely impressed with the oysters, which were phenomenal, as was the service from front to back of house.  My crab louie salad was a bit wet, good, but not great.  Still, I would return for the oysters and service.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "My buddy and I showed up at 8:15 without a reservation. We were told that the wait was 45 minutes. On a Thursday! OK. I gave them my cell and headed to a wine bar around the corner. The oysters were definitely worth the wait as the list was diverse and the bivalves were fresh. The diver scallops with jalapeño on the crudos menu was equally tasty. The lobster roll unfortunately was a bit of a letdown as it really didn't have much lobster on it. Next time I'd stay away from the large plates and focus on the raw shellfish.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-11", "description": "So I am middling one his place. A snazzy completely overpriced bar that charged twice the price for a Jameson should not strictly measure their drinks. \n\nWe paid almost three times for smaller drinks. Didn't bother ordering.", "author": "Wayne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Great quality seafood! The oysters are amazing! Definitely order a sampling of the oysters!! The deviled egg oysters are a must have plus the carbonara. We tried all three and those were our favorite two. The mussels are cooked in parchment paper which really keeps the flavor. The lobster and crab bisque is another great item on the menu. Love the mayo dip for the French fries.. There's a roe flavor which makes it unique and so amazing!", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Delish oysters, ambience is cool. Love this place!", "author": "Lizzz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Most excellent evening. We were well taken care of by the very personable and knowledgeable front-of-house staff, kudos to all and thanks Carlos and Julia for keeping an extra special eye on us.  The food we enjoyed was well conceived, savory, and nicely presented. I had to pace myself not to appear too wolfish in gobbling down my seafood burger special, with a well paired white Bordeaux (I'll have another, please). My wife did equal justice to her lobster roll and champagne.  Chocolate mousse and a delicious confection, fresh strawberries, lemon mousse and brown butter streusel rounded the evening out. Well done all!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "The shrimp, bacon, avo toast here is absolutely amazing! It was really fun to order oysters and drinks because the waiters would ask questions about preferred flavors and suggest pairings. When they say an oyster has a fresh watermelon taste, it really does! \n\nThe staff here is great; really friendly. Anyone who passed us would stop by the check in. I can't wait to come back next time I'm in SF!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Great food and ambiance but pricey.\n\nThe inside reminded me of Liholiho, with the relaxed yet chic Hawaiian decor (but the similarities end there).\n\nWe started with multiple oysters, including red pearl - which I had never heard of. Heaven in a shell! They're gigantic!\n\nWe also had:\nUni toast - perfect!\nTater tots (I would say pass on this - it only comes with four tots...)\nDeviled eggs - delicious, but $5 for one half of one egg\nClam chowder - large serving, flavorful, full of clam, potato.\nSalmon entree - yum\nHamachi crudo - mouth watering\nCrab and lobster cakes - one of the table favorites ($17 for one cake though)\nIce cream sundae - a must get! Vanilla ice cream with pineapple, pistachio, coconut - to die for\n\nSkipped the shrimp cocktail, because like some of the other dishes - it only comes with ONE prawn. \n\nMy cocktail was great, but the server took it while it was still half full. We were there at closing time, but still. \n\nOverall - I recommend but prepare to spend $$$$ if you want to leave satisfied.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "Solid 4 star meal at Leo's Oyster Bar this weekend. As others have said, you walk in and it looks so small, but the restaurant actually has 3 distinct rooms to it (each decorated differently). We loved being seated in the 2nd room and it had an awesome vibe that added to the experience.\n\nWe basically loved everything we tried: the oysters on the half shell, the deviled egg with fried oyster, baked oyster carbonara, house-made tator tots, and lobster roll. The rock shrimp toast was probably the only thing we tried that I wouldn't order again.\n\nWe had originally ordered a crab louie salad, but it was forgotten. When our check came, we were actually relieved they had forgotten it because we were so full (and it wasn't listed on the bill). Plenty of food for 2 people. Total came to $130 including one tonic water (no alcohol) for 2 people.\n\nWill be back!", "author": "K. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "This place is the quintessential financial district lunch spot in San Francisco.  Absolutely first class raw bar and cocktail experience.  The decor and menus display a unique sense of style that make Leo's one of a kind.  San Francisco is one of the best food towns in America, but I make it a point to eat here every time I visit.", "author": "George N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "I love this place, amazing for a date night or 4-5 friends to celebrate before dinner. Interior is great and service is good for sf standards. I live in new york so a bit bias about service and oyster quality. Overall had a great time here", "author": "Emine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Phenomenal old-school place absolutely takes you back in time to an extremely grand era. Unbelievable cocktails fantastic service and expertly a prepared imaginative dishes make this one place you do not want to miss. Take advantage of the incredible selection of fresh oysters he will not be disappointed.", "author": "Jimmy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-05", "description": "Tips: try at all costs to get a table in front room; order and enjoy oysters.\n\nGreat interior design, though we were in a windowless backroom that wasn't so fun.  Servers were super nice people, and service was good when it was available.  However, service was MIA for about half of our time there.  Oysters were excellent.  The wines were not inexpensive, which would have been fine if they had been more remarkable.  The ahi tuna carpaccio we had was tasty, but the salad that came with it was so salty we were only able to eat half of it.  Fries were excellent, too.", "author": "Luke F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Great new place !Staff was very  friendly and helpful and they have a cute room in the back also plus a private room .It is a bit quieter in the back.\nExcellent wines by the glass . A bit on the pricey side but really excellent selection.\nWe had Leo's deviled eggs , excellent .Crab and Lobster cake with cucumber salad and Kampachi . Both dishes were very tasty and also looked pretty.\nAs our main we shared the halibut , pricey at $ 34 . It was slightly overcooked and therefore not too flaky . But all in all a satisfying dinner. We didn't have time to try dessert but would next time.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "OK.     The food is tasty but the portions are quite small for the money.     For example the ahi tuna plate was nearly all salad.    The shrimp bacon club sandwich could fit in one hand.        Come on guys that's just ridiculous.       The decor is fun, so I'd only come back for drinks.", "author": "chris b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "The decor is definitely the highlight of Leo's, the wallpaper and design of it is one of the most beautiful I have seen. Such a shame the food doesn't live up the same standard. I was expecting so much more and felt quite let down especially since it's not a cheap place. \nDrinks were good, and oysters ok but everything else was below par. I would go again for a cocktail but leave the food.", "author": "Allie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "So good! Try the oysters. Drinks are balanced and strong. TRY THE LOBSTER ROLLS!!! Would totally recommend.", "author": "Julius H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-04", "description": "I have been to Leo's twice and have had 2 very mediocre experiences. I have left with buyer's remorse both times, as this place is way overpriced for very average food. My first dinner was not great, and thought I'd give it another shot. But I was disappointed again and will definitely not be returning. Such a bummer since the menu does look so good! The bisque tasted like they forgot to put cream in it, very watery. The crudo is very so-so. The deviled egg with fried oyster is very good, but not good enough to come back just for that. I recommend taking your money elsewhere, as you can get a less expensive much tastier meal at other restaurants.", "author": "Andrea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Tried getting a reservation for weeks, and finally did-- TOTALLY worth it.. the BEST oysters I've had anywhere in a long while..  but save room for dessert!!  The Lemon mousse with brown sugar crumble is worth coming in for .. alone!\nI've already made my next reservation.. find an excuse.. and GO!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "This place is so good! Went for our anniversary and it was great for a special occasion. We tried a bunch of different things on the menu and loved it all. Our personal favorites were the tater tots, short rib, and the oysters. \n\nGreat cocktails. We sampled a few, great presentation. \n\nCheck out the hideaway if you can. It's a lounge in the back with a small bar, great tropical vibes.", "author": "Ron N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "A restaurant that definitely stands out in the financial district!  Leo's is a cocktail and oyster bar with flair.  To the left is a long bar with a vintage vibe.  There are plenty of seats.  Banquets on the right are narrow, but fun.  \n\nWe arrived at opening on a Friday afternoon so the full menu was not yet offered.  However, we tried everything from the raw bar and nothing disappointed!  We stayed long enough to try the uni toast, and it was worth it.  A definite must try.\n\nLeo's is very reminiscent of Maison Premiere in Brooklyn!  Too bad Leo's doesn't offer outdoor seating in a cute, lush-filled patio.\n\nIf the prices weren't so high, I'd come here regularly.", "author": "K V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Have you ever sat down to lunch and prayed to see \"Liquid Lunch\" on a menu, but, alas, no such option existed on the menu? More than once? Me too. Before anyone is too quick to judge, this liquid lunch includes a side of petite pickled veggies with a martini of your preference. So you wouldn't be lying by telling your coworkers you had a light lunch... {Read the rest on Rx Sojourn}", "author": "Roxy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "Henry the General Manager contacted me regarding the issues my wife and I experienced and we appreciate his genuine concerns.  \n\nThis place is clean and we look forward to giving them another shot when we are back in town.  It kind of sounds like our issue may have been an isolated issue.  \n\nThank you Henry.", "author": "B N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Amazing food, if a bit on the pricey side. This might be my favorite restaurant in SF. The lobster roll is to die for, the clam chowder is amazing, and their raw bar offerings are great. Cute bar area as well. Gorgeous space, can easily see why this restaurant gets so many  postings on Insta.", "author": "Allie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-22", "description": "The food was very good but holy heck it was so loud inside we couldn't hear each other across a tiny table. We had the clams and the seafood burger - both delicious. But with that level of noise I wouldn't go back.", "author": "Blake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Love the kitschy Hawaiian vibe. Seafood is good, with tons of raw bar options, but it is EXPENSIVE. Felt overpriced, but what's to be expected in a city where every establishment thinks the inhabitants are all rich.", "author": "Jeanna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Great place to enjoy some oyster but highly recommend the Japanese Hamachi with crusted avocado. One of the best!", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "Delicious!  We got to sit in the back room which was much less noisy and had a romantic feel to it.  Being gluten and dairy free I was worried about how much I would be able to eat off their already limited menu.  To my surprise I was able to get quite a few things and it was all delicious.", "author": "Kyla G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Excellent food and cozy ambience... Fancy Oysters were the best. Worthy of Michelin star!!", "author": "Sanchit G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Superb experience.  The space is gorgeous, the food is excellent, and the service is attentive.  Highlights include the seafood bisque, the foie gras toast, the short ribs, and the chocolate mousse.  Particular thanks to our fantastic, birthday-saving server and a gracious hostess who let us tour the space.", "author": "DarkwingDick _."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "Good oysters, old-time ambiance. However, very expensive considering there are many wonderful places to eat oysters in San Francisco..", "author": "NatdeMontreal G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-04", "description": "I was beyond excited to come here. Mainly cause I LOVE seafood. We left disappointed. And bought food on the way home cause we were still hungry. I'm happy to say we tried it though. That is all.", "author": "mel l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-04", "description": "This place has a very charming old world yet slightly exotic Rick's Café Americain vibe to it. I loved the atmosphere, the service, and the drinks and food, but ultimately, the portion sizes make the prices absolutely absurd. I plan to return for special occasions (and hopefully on someone else's dime!) but am already preparing to leave feeling ripped off.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "Wonderful raw bar. Had 6 excellent oysters and  amazing hazelnut cookies for dessert. Wine pairings are very nice.", "author": "Dodie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Awesome lunch! The oysters (all 16 of them) were amazing!! The deviled egg with the fried oyster and buffalo wing sauce...insane.  Go see Zadri at the bar - great bartender. Cannot say enough about how much we loved this place!!!", "author": "Sean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Highly overrated. Ordered several different oysters. They were ok. Nothing special. Had the tuna carpaccio. The salad was better than the tuna. Next was hamachi with charred avocado. Over priced for the flavor and size. I ordered the house made tatter tots w salted cod and olive tapenade. They were decent but nothing to write home about. I had the clam chowder. It was extremely bland and no clams to be seen in it. Also got the fries. They were ok but their dipping sauce tasted like mayo and schiracha mixed together. Nothing special. All in all the food was over priced and just  so-so.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Been wanting to try for awhile now after hearing a co worker rave about this place. Hidden away behind big doors to a paradise. The hostess greets you with such an upbeat energy and you're off from your high stress day into your oasis. Service was excellent offering coat check and water. Perfect for an after wrk happy hour cocktail and oysters. Love it!", "author": "tricia m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-12", "description": "The food was tasty and the service was friendly, but I walked out the door hungry, sober, and with $200 less in my pocket. Very poor value.", "author": "Da Wei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "I picked this place because I was craving East Coast clams and oysters. They have 'em here. I'm not really sure that the place deserves the accolades or the pricing though. Sparkling wine by the glass was priced way, way over the mark-up and while the shellfish is good; it's not better than anywhere else in the City. Maybe the housing crisis has put it's digs into the inflated prices here. It's new, it's NICE; but it's not worth it for a ditzy server that can't remember a simple wine order or the number of oysters we wanted. I won't return.", "author": "Sherie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "Leo's.\n\nBeautiful setting. Great drinks. Spit in your drink never coming back again, service.\n\nWe went with 6 friends. Called ahead for reservations and were told it wasn't necessary. Showed up, and was given attitude because we didn't have reservations.\n\nHm.\n\nWe were there for about an hour or so, ordered a few rounds of drinks & oysters for everyone. Sipping on the last drink we received, the waitress kept asking if we needed another drink. No, we weren't ready. Can we finish our drink first? \n\nBefore we could finish our drink (6 of us mind you, none were finished, and aren't pacing like your grandma sipping on a hot tea) the waitress says unfortunately if you're not going to order another drink, the hostess needs you to leave...\n\nDid we just get kicked out?\n\nDidn't know it was possible for 6 ppl to get kicked out of a bar, spending plenty of money ($350+ w/ tip), and doing nothing at all? Dang, we had friends flying in town too. What an embarrassment.\n\nMaybe this was our *unique* experience, but with so many great destinations in SF, I would steer clear.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Love this place!\n\nHonestly a gem in the sea of mediocre bars in San Francisco. There's a luxe 'palm beach in the 60's' vibe that is so unique and fun. That being said its definitely not kitschy at all and is really subtle/tasteful. The bar staff are amazing and their cocktails are both creative and delicious. At night its a little dark inside (the light is really soft and the amber bar glows!) but fantastic and bright/whimsical during the day. \n\nTip: If you're in the mood for a cocktail, be sure to try the Garden Party!", "author": "Hailey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "My first thought was how small this place was, we had reservations and a place wasn't ready for us. Eventually we got to sit comfortably and order and we sat next to the owner. Kind of neat! We got to see the extension/addition. That's so friendly!", "author": "Carmelo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "One word, Beautiful! It's a tiny gem of a restaurant in FiDi. You walk in and are overcome with lush beauty. We sat at the bar where the service was warm and welcoming. The food and cocktails were all excellent and as the name suggests, seafood driven. It's like the gritty, genuine Swan Oyster Depot married a beautifully polished Polynesian woman and this is there lovely child. Its teeny and can get crowded, don't be overwhelmed...just enjoy.", "author": "Chili W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "I've been dying to try this place since I moved up here 8 months ago. So for my birthday I finally made reservations. It did not disappoint. First, the decor is absolutely gorgeous, every detail. And the food was amazing! My husband and I split every dish and neither of us had a single complaint. We got CA fresh oysters (5 stars) the tuna carpaccio (5 stars), and the mussels andouille (4.5 stars). Even the French fries were on point. For cocktails I got the Garden Party, which was really refreshing, and the Island Time, which looked like it would be really girly (it had cute little pansies floating in it) but was smoky and delicious. My husband got two Mad Mans and they were also very good. Finally, for dessert we had the Pineapple sundae and I think I literally moaned when I took a bite. On top of that the service was top notch. One note: there are a lot of reviews that complain about the price, but first, you get what you pay for. The seafood was incredibly fresh and well worth it. Second, SF is the second the most expensive city in the US, so if you want to go to a swanky restaurant you'll have to expect it won't be cheap.", "author": "shayna b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "The food at Leo's was very good.  Unfortunately, the portions were also VERY small for the cost.  Everything we ordered and tasted was great.  Unfortunately, the prices for the amount of food you get is just insane.", "author": "Nick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Awesome food!   So fresh and delicious.  You simply MUST try to reveled egg appetizer.  The daisy salad with ahi added was amazing.  Only reason it's not 5 stars is becuase of how close together the tables are - no private conversations can be had here!  Other than that it is great.  Great food and great staff.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "My friend and I love to try new restaurants. We usually order a bunch of dishes so that we can try more things on the menu. We ordered: Leo's Deviled Egg with Wing Fried Oyster - awesome! Osetra - Creme Fraiche and Truffled Beet Pancake, the caviar was delicious! House Made Tater Tot - these were heavy, but delicious! Salmon Tartar - this was one of my favorites! Clam Chowder - this was delicious and hearty! Ahi Tuna Carpaccio - this had the equivalent to a tea salad on top and it was fabulous. And for dessert we had a lemon mousse that was out of this world! I would definitely recommend this place!", "author": "La Tache T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "the food speaks for itself!\nbaked oyster with carbonara sauce, uni toast, foie gras toast, salmon roe caviar and the dynamite sauce for the fries has tobiko! everything was great and very comfortable", "author": "Marie r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Love this place. We came late on a Friday night for drinks and had a great time. We were able to sit at the bar and enjoy a few of their signature cocktails and pickled veggies. I would recommend this place to everyone.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "This place was so good! Service, atmosphere, food, decor...My friend and I were a walk-in at 5:30 on a Wednesday and were able to sit right at the bar.\n\nFood: Hamachi Crudo, Foie Gras Toast, Crab and Shrimp Cake, Clam Chowder.\nAll of it was really good. I would go back to the foie gras any day! The food is a bit pricey, but the quality and taste are worth it.\n\nOur server Jordan was very informative and attentive. We will definitely be coming back here.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Absolutely love this place! Eric is a fantastic server, he had remembered me from my first time there and treated us so well. Mel was also amazing and so sweet to give us a tour of the new patio area. The food is so delicious!! Perfect bites that fill you up, amazing oyster selection and the ambiance couldn't be cuter!", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Fresh seafood, delicious foods and cocktails. Can't go wrong. We got there past 5pm when the restaurant opened and the place was already filled up. Come early!\n\nWe had the oysters, top neck clams, deviled egg buffalo fried oyster, tuna and seaweed fried oyster, strawberry sunday with balsamic and pistachio, live scallop crude, hamachi and chard avocado crude and clam chowder (best chowder we've had). Everything was excellent and on note!", "author": "T. N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "This is my favorite new place this year. Unbelievable service: my dinner mate wittily asked for a \"corpse reviver #3\" after hearing someone else order a #2.... 3 minutes later the waiter came back and said, \"so I did some research and it looks like the #3 is equal parts brandy and fernet... do you still want that?\" Incredible food: the deviled egg was wickedly sour spicy and savory, with a subtle creaminess to it that complimented the spicy fried oyster perfectly. The drinks were superb. The night was the kind of night you imagine when you think about the 50s. After work, 530, long discussions about existential dilemmas and delights with delicious savory bites and palm fronds in the distance. .", "author": "Luz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Stopped in for a drink last night and was impressed! Hostesses were extremely nice and accommodating, bartender was engaging and fun to talk to, and raw bar guys were friendly too. Bartender ran after us down the block when we forgot our umbrella - stellar service all around. Cocktails hand stirred, delish!", "author": "Allison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Went to Leo's with a large group of colleagues after seeing the write up in instyle magazine. We were seated in the back room \"the hideaway\" and were blown away by the food, service and decor. Everything that came out of the kitchen was delicious. From the lobster claws and crab legs to the shrimp toast and lobster roll, everything was fantastic. I will definitely be back!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-09", "description": "Food was good, though I couldn't decide if it was good because of how bourgeoisie the scene was or if it was actually good. I'm not sure that I care never to eat it again. Severely overpriced for what we ordered.", "author": "Tia D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-29", "description": "Ate here on my birthday, on a warm September night. The bar is lovely and the restaurant was bustling. We had reservations and arrived early but were shunted to an empty backroom where we waited to be served expensive food in an unremarkable environment. I requested that we move and we got placed at a small cocktail table in the room between the main restaurant and the backroom. Had the prices or portions been reasonable, it would have been forgivable.  They were not. It was a very expensive disappointment!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Sat at the bar for happy hour with two friends- had pickled veggie side and some beautiful oysters!!! Ordered a few craft cocktails and a bottle of wine! Bartender was great!!!", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Awesome experience.. Delicious food and amazing drinks.. Recommend this place to everyone.. Me and my dad had a great time.. 10 on 10", "author": "Joshi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Leo's was excellent. We had the best waitress there, I think her name was Hillary. She told us the best things on the menu and her recommendations were absolutely spot on, best meal I've had in a while. We especially liked the salmon tartare and smoked trout (which is on the caviar section but as she pointed out, it's sort of misplaced because the caviar is the side show to the actual trout on the dish) which we loved and of course some great oysters. Must try!!!", "author": "Laura V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Beautiful fancy oyster bar in FiDi. Loved the Wing Fried Deviled Egg, Uni Toast, Tuna Carpaccio, Lobster Roll.  Exactly what SF needs #glamorous", "author": "J. SOMA S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-14", "description": "You know, I really wanted to like this place.  Being the old Wexler's location that was near and dear to my heart, I wanted to give this place a shot.  Came here around 3pm hungry and desperate for a late lunch with a buddy of mine, noticing that it was a new restaurant to us, we decided to try it and was given a menu by the lovely hostess.  We ordered the Ostera caviar appetizer with cocktails, and was told the kitchen was closed until 5pm.  No worries, having skipped lunch, I figure, hey we'll go to Wayfare tavern next door and come back when your kitchen reopens at 5pm to try that awesome sounding caviar appetizer on the menu that lured us in.  After my late lunch at Wayfare Tavern (fried chicken was ridiculously good), I went back to Leo's next door to be true to my word to the waitress that I would return at 5pm.  Again we were given the same food menu by a different but equally lovely and polite hostess, and again I ordered the same thing that caught my eye on the menu, the Ostera caviar.  Was told the kitchen doesn't open until 5:30pm.  Well we tried, given misinformation about the kitchen opening at 5pm...  Some suggestions, don't give a food menu when the the kitchen is closed.  Caviar... It's from a jar or can.  All someone has to do is open the jar/can and serve on a plate with the mini pancake and crème fraîche, with minimal preparation.  And although the kitchen was \"closed\", I'm sure someone back there was capable of opening a jar or can of caviar.  As much as I want to rate this place on their food, I sadly never had it.  We tried to give it the benefit of the doubt, came back when told, but no luck.  Came back twice, no food.  0 stars for the restaurant, 4 for the hostesses that were polite yet gave us menus twice when the kitchen was closed.  Average 2.", "author": "John D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-01", "description": "1= My family and I reserved a table a month out (7 people) and they sat us at the worst seat in the house. Right next to the front door that kept swinging open. \n\n2= When we booked a month out they required that we put down our credit card to hold the table which is totally fine. However, they caveated that if we canceled within 24 hours that we would be charged $75 per person which could ONLY be used as a Gift Card toward the restaraunt at a later time. WTF? \n\n3=Aside from from the Raw Bar the food was not very good (oysters were excellent but the rest of the menu was unimpressive).  \n\nI would go back with a smaller party for drinks and raw bar ONLY.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "One of the best new restaurants in San Francisco.  Intimate, fun and the food is delicious!  Chef Puccio has brought luxury dining back to San Francisco in a casual and fun environment.  My favorite drink is the Babarita and you can never go wrong with the caviar service.  I've been twice and look forward to making it my next dining destination.", "author": "claudia r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Stellar addition to the Financial District.  Salt Cod Tater Tots are a must try.  The oyster selection is stellar.  I even had an East Coast Oyster that I've never had before. The cocktails are spot on as well.  Looking forward to trying more that this new gem has to offer.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Obsessed. Hands down, my new favorite restaurant; everything from the decor to the food/drinks and service is perfect. \n\nI don't think you can go wrong ordering anything from the menu but my favorites were the Deviled Eggs with fried oysters on top (literally something conjured from my dreams), the Salmon Tartare toast, and, of course, the hot Lobster Roll. The Tater Tots and the raw oyster bar... I could go on and on!\n\nFor drinks -- I had a wonderfully crisp Sauvignon Blanc recommended by our bartender and the Barbarita is a Leo's dangerously good take on a classic Margarita with some spice. \n\nThe staff is wonderful -- knowledgeable and friendly -- and the ambiance is always fun!", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Oysters were excellent, great vibe, and service was on point. Hostess was attentive, polite and bar tender was friendly.  Little pricey but worth it.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-03", "description": "Go, if you like $14 four sip \"craft cocktails\" and $18 stingy pour chards.  Otherwise, save your $$$.", "author": "Bill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "What can I say? Leo's is the jam! Excellent seafood at a reasonable price. The decor is superb and the music is on point. Perfect date spot or anniversary celebration.", "author": "A A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-07", "description": "All around, not a great experience. My friend and I are big oyster lovers and it didn't seem like our server knew much, or cared much, about oysters. The accompaniments were fine, but fell way short of the oyster experience at, say, Hog Island. Our Louie salad was okay, and our lobster roll was lacking so much in flavor.  I just felt like more care was put into building a good looking, classic restaurant and writing a great menu, than ACTUALLY delivering great food or good service. It was a subpar experience... And I don't think I'll be returning.", "author": "Lucy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Emilia, Cassandra and Matt are amazing it keeps us coming back every weekend. The food is great and so are the drinks and they make you feel welcome.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "Leo's Oyster Bar offers some wonderful seafood dishes, but the cramped space and poor value for money detract from the overall experience. The portions are incredibly small for the price point of each dish. For example, while the lobster bisque is absolutely delicious, a $19 bowl is the equivalent size of a cup of soup elsewhere (albeit served in a bowl). Four tiny bowls for our table, was $76, which is a bit problematic when you consider that you'll need to order a lot more food in order to have a full meal. The sea urchin toast for $18 seems like it would be a fair portion, until you see a plate that consists of 3 very skinny strips of toast with some sea urchin put on top. For those of us who have been in San Francisco for several years, expensive prices are not abnormal. However, objectively speaking, if this restaurant wants to maintain this particular price point, they either need to increase the portion sizes or up the quality and presentation to the next level.", "author": "Justin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Leo's was excellent!! The food was amazing we tried many items and shared everything. The wine list was very impressive. The service was phenomenal! We cannot wait to go back!", "author": "L B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "I wanted to give this place 5 stars because all the small plates we had were insanely good - I'll dream about the salmon roe bites and the foie gras toast - but the mussels that came to the table steamed had only 30-40% of them open so we sent them back. And my husband, who doesn't like fish, ordered a \"large plate\" of beef ribs which was the only thing he could eat on the menu and it was TEENY. What made matters worse was that there was a large bone under the ribs making it even smaller ...and fat on the ribs making it an even SMALLER portion. While most dishes were excellent, they were all very small and the prices were very steep. The restaurant may want to work on adjusting those two things.", "author": "San Fran G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "We had reservations for a late dinner Saturday night at 10:00. We arrived early and our table wasn't ready yet but the staff went out of the way to make sure we were happy. Offered us a place to sit, water, drinks offered. Constantly checking in us. Table wasn't ready until later so they brought us a couple of small plate offerings. Food was great. Service amazing. A bit pricy but not overly so. Will definitely be back!", "author": "Alan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Great new restaurant/bar.  One of my new favorites!  If you love seafood / shell fish / raw bar and mighty mixology, this is the place for you.  Beautiful venue and warm ambience as well.  Go here immediately for a hip lunch, a swanky happy hour, or to impress your date for dinner.  I will be back often.", "author": "Isaac F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Amazing experience! My husband and I were celebrating our 10th anniversary and from the minute we walked in, Leo's staff was accommodating, professional and energetic! Cocktails were seductively delicious, oysters were fresh and briney and lemon mousse was so tart and perfect. Highly recommend this new spot!", "author": "NIcole R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "This is a beautiful new restaurant with great food. The presentation of food looks like a work of art. We had the oysters on top of deviled egg to start- make sure you get two per person as they are delicious and hard to share. We then had the caviar on little crispy beets- it was amazing. also you need to get enough as they are tiny- but great. We the had the Tater Tots mélange. This was probably the best tater tot -type dish we have ever had!! It was so good- we definitely would and probably should have ordered more! This was followed by a lovely (large) portion of super fresh and meaty lobster roll which they nicely split for us (for two people- without our having to ask!) and even gave us each our own delicious fries. The white chardonnay the waiter recommended was perfect for this of  meal. service was impeccable, very professional. We ate at bar- highly recommend. Also, the bar tenders were making lots of interesting drinks that people at bar seemed to really enjoy. We will definitely go back- there were lots of other goodies on the menu that we would like to ry. Even though portions for some dishes were small, we were full and too full for dessert- though they looked amazing. And, also, ladies bathroom was spotless and overall noise level very comfortable- you can hear your dining companions without shouting.  In sum, this was a terrific Friday night dinner out.", "author": "Robyn G."}
