{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Haven't been able to make it out here because of the location--and I came in with some higher expectations being one of the more popular coffee shops in SF as well as earning quite the reputation. \n\nI was met halfway with my expectations. The espresso was very bright, almost too forward--similar to that of a lime. The body had been pretty faint, leading straight to the finish. The end was more dark, dark chocolate--comparative to eating 85% cocoa, with a smoky after taste. I had a cappuccino to led after to see how it would hold up, the flavors had become a lot more complex being dispersed through with milk. A lot more balanced and pleasing. \n\nI was told by a friend their drip was better than their espresso? I'll have to come by again and see if he holds true with his statements. Not bad Linea, not bad at all.", "author": "Rowby O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Best spot I've found in SF in a couple years. I am not sure why the new craze is coffee and espresso that tastes like coffee-flavored water. \n\nLinea serves real espresso, with full pulls that have a kick. I had a cappuccino and was pleasantly surprised to get something that actually tasted like a cappuccino. \n\nI wish the trend was leaning towards strong (tasting) coffee and not that light fruity hinty stuff everyone is charging $6 for. \n\nLinea, at least, is on board with serving good coffee!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Linea is my neighborhood cafe and I go religiously every weekend to start the day. The staff is friendly and their coffee is high quality and delicious. I typically get a latte with almond or oat milk. I'm so thrilled they have Oatly (oat milk) as a dairy free option. \n\nThe shop itself is simple and nicely designed/decorated. They have outdoor seating.", "author": "Kelly F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "I love the atmosphere and look of this place. The logo is super cute too!\n\nWhen I went.. I didn't see any waffles? Am I missing something? Also, nothing spectacular about their lattes. I usually prefer iced lattes and went for a hot one today since I wanted a cute cup and latte art, but it tasted completely like milk. \n\nProbably wouldn't come back.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Till now I would have to admit that Mission district has a great number of coffee shops that are both trendy and able to serve great coffee drinks. Linea is one of those neighborhood coffee bars, that even was tiny in space, provided me a nicely done morning dose.\n\nThey do not carry non fat milk, so substituted with almond milk. I tend to dislike the strong texture carried by almond milk, yet this time I did enjoy my cup. Very smooth and a light finish. This is one of the best almond latte I have ever tried.\n\nReally hope they could have more inside seating...but I guess you cannot ask for too much.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Linea makes some of the best coffee in the Mission, quickly and consistently. It's a small hole-in-the-wall kind of place so is better for takeout, but they do have a couple of tables outside and a bench inside if you want to take a moment to ponder life.\n\nCoffee quality is very good on different days and with different baristas; they do a particularly nice job with the crema, and I've never experienced the overly-milky latte another reviewer mentioned.\n\nOnly downer is that the folks who work there are always so glum, I seriously can't get anyone to crack a smile! It is a hipster coffee place so I know some surliness is expected, but they look so blue I want to jump the counter and give them a hug. Maybe tomorrow I'll shout them a scone or tell a knock-knock joke, see if that cheers them up. Stay tuned.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-11", "description": "No waffles despite lots of waffle photos here on Yelp. \"Haven't had em in 2-3 years\" -", "author": "Brandon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "I love this little shop! We happened to walk by and had to stop. All the features in the window caught out eye. We got the strawberry soda. So good and so unique.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Solid cappuccino, though priced slightly higher than Ritual and Blue Bottle. ($4.50) It was a beautiful day for Carnavale and coffee. Cute interior with outdoor seating.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "The Mission is incredibly lucky to have so many lovely coffee spots to pick from. Linea is always a solid choice for me. I usually go for an Americano as my afternoon pick-me-up before I head back to work. You can't go wrong with any of their espresso-based drinks.\n\nToday in particular their Square payments system was down, and the barista still made me my Americano and said to not worry about. It was really kind of him to do that, and goes to show how great their customer service is.", "author": "Heather N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-24", "description": "$4 ice coffee, order with light ice, but they still fill full of ice. When I asked to take some ice out and fill a bit coffee the server try to told me ice coffee is $4.....that's all I pay for \nWell i think $4 for watery ice coffee or a cup of ice is very expensive.", "author": "Wendy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Came in for a to go cold brew with almond milk. One of the guys shouted \"try the oat milk!\" so I did. It was my first time having oat milk and it was great! Great experience overall for such a brief interaction.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "Small, hipster coffee shop a short walk away from Dolores Park. The menu is small and straightforward and the woman who took my order was pleasant. I ordered an iced coffee and it was bold - just the way I like it. \n\nSeating is limited. There was a small bench inside and right outside the entrance as well as a few beside the cafe. \n\nA good place to stop for a pick-me-up while exploring the mission or chillin' at the park.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Linea occupies a gorgeous, yet tiny, hole-in-the-wall in the Mission. It isn't a place where you can lounge around all day long over one measly cup of coffee, but that having been said, there are a few spaces to sit for a short while inside, as well as a few makeshift tables over by the alley outside. \n\nWhether you're grabbing your drinks to go or to consume on-site, you can count on quite a decent caffeine fix, whether it's a simple espresso or americano, or something richer like a mocha. Service is pretty efficient, if robotic, but given the compact, no-frills nature of the venue, it's all about the coffee anyway.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Great coffee! Some of the best in the Mission area. We love going here after eating at Gracias Madre a block away. They make a great vegan cappuccino with almond milk. It always on in my opinion but there's very little seating available. It's hit or miss for that at any given time but well worth stopping by.", "author": "Theart P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Coffee tastes good, sweet and nutty, they toast their own, cappuccino spuma is smooth with a heart shape. Yum!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Tiny little shop- not too much room for sitting down so know that you'll grab it and go!\n\nDid find it odd that they only have whole milk or almond milk, but I guess since 99.9% of girls drink almond milk now that that works- \n\nCoffee is flavorful, smooth and delicious and they've also got goodies from Tartine if you want a scone or muffin to go along with your coffee.", "author": "Elliott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I love Linea Caffe and their small eco-friendly semi-Italian style coffee-espresso bar on 18th Street in San Francisco's Mission District.  They roast micro-batches of coffee several time every week sourced mostly from Brazil, Guatamala, Columbia and Ethiopia, which are often award winning and reserve lots.  They also feature great espresso (using their own espresso blend) - one of the best I've tried and always have their freshly brewed coffee of the day.  My favorite for making my own pour overs is from their Brazilian beans - grown by several organic and sustainable farms in Brazil.  Linea Caffe was launched by Andrew Barnett, considered by some to be a third wave legend.  Among other things, he has been a Judge at the World Barista Championship and Cup of Excellence Awards.  While they only have one location in San Francisco, they will ship freshly roasted coffee directly to you the day it is roasted.  Yum!", "author": "Eric J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "Good corner spot if you are looking to waste time before heading out to do your evening rounds in the Mission.\n\nGod strong coffee, just know that they do not have any tea, however, so on that warm evening, I had to settle for their soda, which was cola syrup with fizzy water.\n\nGreat spot, with lots of outdoor seating.  We sat and dove into conversation for a good hour before departing on our next mission in the Mission  ;)", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "I loved the coffee here and would drink it every day. My cortado was spectacular! Do it!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "This place is small! Definitely a grab and go type of place. The coffee is amazing though. I usually get cafe au laits when I go to fancy coffee shops, but this one didn't have that as an option on their menu. However, I requested it and they made it for me :)\n\nSome downfalls:\n\n1. They do not have nonfat milk. They only have whole, almond, and half and half.\n2. The 12 oz coffee cost me $3.50, which is a bit hefty.\n3. They do not have sleeves for your coffee cup. I had to use napkins.\n\nIf you're in need of coffee and you're in the area, it's definitely worth trying. I've had better experiences though.", "author": "Remy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "When stumbling upon this place a couple months ago, I thought, yay, another coffee joint!  What I hadn't immediately realised is that this wee spot actually serves food as well.  My inability to 'read' the place could be that when I visited, the kitchen was already closed and there was nary a diner in sight.  As I've never eaten at Linea, this review focuses on the espresso counter. \n\nOn my first visit some weeks ago, I ordered my go-to bev at new-to-me joints: cappuccino.  The drink was creamy, balanced & had a slightly nutty taste.  Also important: it wasn't exceedingly hot.  The kid behind the coffee counter was nice, indulged my questions about the cafe, gave good eye contact and, again, made a damn fine drink.  \n\nCoffee aside, the other half of the joint is dedicated to food prep/service.  The kitchen closes, during the week, at 15.00.  Not being hungry, I barely gave it a glance, to be honest.  However, I did spy some greens.  Based on signage, waffles would appear to be the food du jour.\n\nThis corner spot is tiny and seating is tight with one bench inside, one outside & a decent no. of outside tables--I'd say 5, or so--to boot.  I took a 'lean' at the open window with a nice view of the passersby.\n\nYesterday's second visit had a bit of a 'beardy' vibe.  The interaction was a tad more cut and dried with a no-nonsense demeanor from the other side of the counter.  This time the capp, while good, was much hotter which rather masks the flavors of the bean.  -still fine, still glad I visited. \n\nLinea's roastery is off-site elsewhere in the city.  12oz. bags of beans, different varieties, are sold at the cafe.  Prices range from 15 to 18 bucks.\n\nBonus: although it isn't listed, one can order a flat white.\n\nOnly open about a year and a half, I hope that Linea continues to do well!\n\n9.20.16--no more food prepped/served on premises save a few pastries.", "author": "Bea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "If you guys are reviewing the waffles, that's Lt. Waffle. Linea is the coffee portion of this tiny spot.\n\nSome quality roasted stuff going on here. I only had a plain cup of joe but I'll be back for lattes. That cup revived me. \n\nFriendly staff too", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Linea has solid coffee. Latte was lovely. They obviously use excellent beans.  Iced drinks are small as they all are in the bay area. This is pretty much grab and go... not a huge amount of atmosphere. You probably wouldn't want to meet friends here for coffee but it's a super solid option if you are in the area and want excellent coffee.", "author": "Ari R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "An old friend asked me to lunch. My first response was, \"I am in need of coffee\" and she said \"how about Linea? They have coffee... And waffles\" \"WAFFLES?! I'll see you in there 20 minutes.\" \n\nWe marched over to Linea Cafe on a late Sunday afternoon. It was packed with people inside and out and we were afraid we wouldn't be able to sit to devour our sweets. I had the almond milk latte while she sipped on her cappuccino as we patiently waited outside. The latte was strong and had no trace of almond flavor in the milk. It was frothy and light with a hint of cocoa. \n\nAs our waffle order was called, a couple was nice enough to offer the 2 empty seats on their table for us to share with them! Yes those round tables were meant to bring happy waffle eaters together!\n\nI had the churro waffle while my friend had the bacon and egg waffle. The churro waffle didn't taste significantly like a churro but the similarities came from the cinnamon powder and cane sugar that was sprinkled on top. The chocolate icing on top made it a nice and sweet combination. The waffle itself was very light with a bit of crunch. It was easy to fork off, like I was forking through marshmallow.\n\nOverall, I love their interior decor, their light, portioned meals and their strong, bold espresso. Next time I would definitely try their berry waffle with a mocha to go!", "author": "Linda K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "They stopped serving waffle 3 yrs ago.  The person at the register looked bothered when I asked questions. Iced americano was watered too much, but cappuccino was good.", "author": "Kylie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-15", "description": "Cute coffee joint but very small.. Some seating outside on street but only 3 tables.. Not a lounge around coffee place but no nonsense get your order, drink then leave..\n\nValue 3/5\nAtmosphere 3/5\nService 3/5\nQuality 3/5\n\n12/20", "author": "Nina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Linea is a super small place, with some outdoor seating and a small bench inside.\n\nThe almond latte was tasty here, (I found it creamier and hotter than four barrel). \n\nI'll have to come back to try their food!", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "The cute red sign for Linea Caffe has been calling to me for the past few months, so I finally decided to venture here for a quick afternoon latte. I drank this alongside a ginger scone they had on display. Both were delicious!\n\nThis is somewhere I'd stop by if it wasn't too busy because there is not much seating outside. Around three or four metal tables with chairs. Luckily there were tables available when I visited but I've seen the line get pretty long. Seems best for grab-and-go. I also saw that they have a breakfast and brunch menu which sounds nice! Again, not really worth coming here for breakfast unless there is seating available.\n\nLinea Caffe did not excite me, but I did have a good experience here and would come back again. It's conveniently located near the 33 bus stop I always happen to stop at so why not?", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "Our latte and cappuccino were amazing as always, a nice roasted flavor. Never much of a line at the counter (about 11:30am on a Sunday), and it was maybe 5 minutes before all our food came out. \n\nI always like the un-rushed, laid-back, relaxing vibe here. It's a small spot, people are just enjoying a nice sunny day (in the shade, thankfully), no expectations. \n\nThey've had more sit-down customers every time I visit; all their tables are 2-tops though and all you need is a couple groups of 3 or 4 and you're left with a table with no chairs. We got by with my boyfriend half sitting on a sign and one chair we were able to get from a group using it for their bags, but halfway through our meal a group left and we to chairs again. Point being, Linea: get more chairs please!\n\n* Potato, Pastrami & Leek Waffles - 4 stars\npic: http://www.yelp.com/biz_photos/linea-caffe-san-francisco?select=ukPAzm7Rzj9ePnxgD16xKQ#7RePFfss2kUv3HHVCbe4iQ\nDelicious! Awesome crunch on the outside, with a soft and moist filling; it's almost like a huge hash brown! You get an extra crisp and bits of savory flavor with the pastrami, which I almost thought were bacon. The shape is circular, the criss-cross pattern just ending at the edge (with no \"wall\") so it really feels homemade. \n\n* Egg Sandwich - 3 stars\npic: http://www.yelp.com/biz_photos/linea-caffe-san-francisco?select=ukPAzm7Rzj9ePnxgD16xKQ#ukPAzm7Rzj9ePnxgD16xKQ\nThere was no indication on the menu that this was a waffle sandwich and my boyfriend and I were both surprised when it came out this way. The waffles were plain, a bit soggy, and topped with one sunny side egg and a few squares of equally soggy bacon. It would've been one thing if the waffle was a bit sweet, crisped, and you got that sweet/savory contrast. But these were just very plain, no flavor at all. I would have much more preferred an actual bun to this.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-04", "description": "I was drawn to this spot after drooling over waffle photos on Yelp.\n\nCute little coffee shop with outdoor seating, plus 10 points right there.\n\nI had the churro waffle. Fluffy, crispy on the edges, and drizzled with goodness. Pretty effen good.\n\nMy friend ordered greek yogurt, pineapple, and pomegranate on her waffle. They were stingy on the toppings, which was a turn-off.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Damn that was some good coffee!  I got a small regular coffee, but my god!  \n\nJACKED. Like go run around the block 8 times JACKED. \n\nAnd trust me, I needed it. Great smooth taste too. I usually drink my coffee with milk and sugar...not this one. Black as my heart black, the flavor was so good. Really cool little spot too. Loved all the wood. Very minimal but organic (if that makes sense). Super friendly, non-pretentious staff as well. Wish they were here in the Twin Cities!  \n\nTrust me. I'm more of a tea drinker, but wow. Super jealous, San Francisco!", "author": "Susannah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "My to-go coffee shop in the Mission District. It's at a quiet little corner on 18th street, in between Mission and Valencia. They have great coffee, friendly staff, and a cozy sitting area.\n\nIf you're planning to sit at the outside patio, grab your jacket on the way since it gets a little windy and gives me the shivers, even while I am enjoying my hot cup of cappuccino. I have tried to read here once and the wind just made my time miserable. Other than trying to stay warm, I had to keep my pages from flipping over from the wind.\n\nTo food options are a little limited, I have the BLT sandwich here, I think it was a weekly special, and it was alright. If you're feeling super hungry and want to get a full meal, I wouldn't come here. On the other hand, if you're walking in the Mission and want to get a quick cup of tasty coffee without spending too much time waiting in line, this is your place!", "author": "Zorayr K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "So apparently I missed the memo that the thing to order, aside from their waffles, is their mocha! \n\nCAFE MOCHA ($4.50 - small, $5.00 - large) - 4 STARS:\nMade with what appeared as 1 full cup of Dandelion Chocolate (85%) chocolate chips, this mocha is more like drinking chocolate than an espresso drink. There is no milk, no sugar, just chocolate water and espresso and it will definitely satisfy your chocolate craving! The barista recommends a small for your visit but I don't think he realized who he was talking to. I pretty much chugged this delicious cup of chocolatey goodness. \n\nFor the non chocolate fiends this drink could definitely be overload and would agree with the baristas recommendation for the small. Since there is no milk, it's very chocolate forward and I would have actually liked a higher ratio of espresso flavor. Can't wait to try the waffles!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Great spot with exactly what you would want from a breakfast in the mission at a small cafe. \n\nEgg sandwich was really tasty, fluffy waffles helped. \nAvocado toast was the stand out. \nGrilled cheese sandwich was so so.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "I was so excited to try this place but was a little disappointed on the egg sandwich. I read in another yelp review that the egg sandwich waffle is airy and fluffy which sounds amazing. However, when I had my first bite it was like biting into nothing... There wasn't any chewiness or crunchiness (on the outer layer like it should be) so it was just VERY BLEND. The middle of my waffle was also slightly cold which I was confused about because they do make it fresh one at a time.\n\nMaybe I ordered the wrong item and I may want to try the buckwheat waffle next time. I am a huge fan of waffles so I really hope it was just a bad experience this time round. Their coffee is amazing though, just like how other yelpers have mentioned :) I really enjoyed their drip coffee and now have a bag of their coffee beans at home so I can make it myself!", "author": "Crystal W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "The baristas are good, preparing the drinks exactly as they show be made. The place is simple, basically just for getting your caffeine dose.", "author": "Norcloud S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Great coffee that will kickstart you. This is in an interesting part of the Mission as well. Also, you have outdoor seating here as well. The only drawback, the customer service is a little lacking.", "author": "Stimmy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Fantastic coffee! I can't say enough good things about this place. The space is tiny though and seating is at a premium so don't go there expecting to be able to lounge...", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-27", "description": "My first and last visit to this joint. An overall tepid experience. Ambivalent careless service devoid of any warmth or friendliness.  The kind of service that makes you feel like an a-hole for going there.  A regular arrived after me and received his coffee before me. I waited and waited and finally received my medium warm latte. No \"thank you\" no smile no recognition. Coffee product C+. Customer Service C+.", "author": "Edward D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "Good waffles, a big fan of the buckwheat batter. Both the sweet and savory are tasty! \nGreat coffee, they make a mean cappuccino. Service is very variable.", "author": "Rita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "I've been very excited about Linea Caffe opening, ever since I noticed construction going on in this corner space, which has sat empty for over 4 years.  Things seemed to go into hyper-drive over the past two weeks, when the exterior was painted a lovely reddish color, and new windows were installed!\n\nI went in here on Linea Caffe's opening day (9/18) and ordered up my usual coffeehouse drink:  An Iced Mocha.\n\nWhile I waited for my drink, the owner and employees introduced themselves to me by name and chatted with me in a very friendly manner while the barista crafted my beverage.  I was surprised by how chatty and nice everyone was...I really liked that!  I know it was their first day, but I really appreciated that they were consciously putting their best foot forward!!\n\nWhen my drink was ready, they insisted I take a sip before ringing me up.  When I did, my mouth swooned and my taste buds did the happy dance, once the delicious, strong, fruity flavors of the coffee and creaminess of the milk and chocolate hit my tongue!!!!  I was in love!!!\n\nWhen I told the register guy that it was fantastic, he smiled sheepishly and said, \"Good, then you won't freak out when I ring you up!\"  Apparently, this decadent and delicious piece of heaven costs $6.  SIX BUCKS!!!!!  Okay, calm down, I can do this.  Maybe not EVERY day, but some days.  It's still cheaper than a glass of wine at any decent restaurant in my neighborhood, and it is The Best Cup Of Coffee I've Ever Had!!!!!!\n\nPhew.  Okay.  So it's pricey.  But you know?  It's so worth it.  And the staff is friendly, the space is WHEELCHAIR-ACCESSIBLE, and the location is very convenient, especially if one is walking from 16th and Mission BART to Dolores Park!!\n\nI'll be back.  A lot.  The only thing keeping me from creeping back  there EVERYDAY right now?  The fact that they currently close at 3 pm.  Harrumph!  That's just when I start craving my daily iced mocha!!  Andrew, one of the owners, reassures me that that's just temporary, they'll probably extend hours as business picks up.  In the meantime, I'll just have to get myself over there earlier in the day!!!\n\nCheck this place out if you haven't already...it's a great addition to the neighborhood, the employees are super-friendly, and the coffee is EXQUISITE!!!!!!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Terrific coffee and delicious light-as-air waffles. Surprisingly, this is one of the few places in San Francisco carrying top-notch Brazilian coffee beans, but they don't carry them all the time. Wonder why that's so when Brazil is a major coffee-producing country that's also close to the U.S. If you get a chance, try Brazilian coffee grown at high altitudes.", "author": "Greg T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-22", "description": "Tried out Linea Caffe Sun 9/22/13 for my 2nd breakfast.  Took Bart to 16th St & walk a few blocks on Mission to 18th St, it's behind the Vietnamese grocery store Duc Loi in a tiny space.\n\nThey have sweet or savory waffles.  I got the yeasted waffle topped w/ greek yogurt & fresh fruit which was strawberries $7 - it was made to order so takes a few minutes, I liked the waffle, but I wanted a more crispy waffle it was pretty soft.  Small amount of yogurt & some strawberries.  I did pour their homemade syrup on the waffle.\n\nCaffe latte small $4.5 - nice latte art, I liked the coffee fine.  Added some of the coconut palm sugar into my cup.\n\nNo seating inside or outside, think they still need to get permits lady mentioned to someone else.  Credit cards taken.  Didn't see any public bathroom.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "Buckwheat waffles.\n\nOkay, so I really came here to try the waffles although they do roast their own beans. I was feeling a little coffee'd out that day (I know, what a shocker! me!) so I opted for tea in their heath ceramic cups and tried out one of these buckwheat waffles.\n\nI got the peach and greek yogurt buckwheat waffle. I thought the waffle was tasty but overpriced. It definitely had a particular characteristic to it, and despite the fact that I wasn't very hungry I enjoyed it so that's usually the mark of a pretty good piece of food for me because I could very well not enjoy it.\n\nThey only have outdoor seating, which is a con, and only three tables, which means sometimes you have to wait until a table gets up so you can sit down. I am definitely going to come back to try their coffee next time.", "author": "Lorrie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "Such a cute cafe! Waffles are where it's at. We had a traditional waffle with butter and maple syrup and buckwheat with Greek yogurt. Both delicious and would actually order the buckwheat again. \nThe cappuccino I had was good and complimented our waffles nicely. My friend was impressed with the tea selection. And we both enjoyed their ceramics. I think all things taste better out of a beautiful mug!", "author": "Kimberly D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-23", "description": "I used to really enjoy this place for breakfast or lunch either solo or with friends. However, they've recently cut down their menu to only include a couple basic waffles. And to be honest, their plain waffles aren't good enough to be the only thing on a menu.\n\nI'm really disappointed in this change, and I hope they reverse course.", "author": "Zach K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "I came here on a whim while killing some time before brunch. The coffee was great and I liked the outdoor patio style seating. The only reaction that I had that was confusing was a result of a man who was walking around the shop with a bird in his shoulder, but hey, I guess it's the Mission, so anything goes.", "author": "Lawren B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "This cafe is small and sweet. The barista was laid back and friendly, definitely a Cali-vibe going on there.\n\nThe boyfriend and I ordered an espresso each and enjoyed it outside on the sidewalk where the tables and chairs were. For a moment there, it felt like Paris again. Voted as the Best Espresso of 2015, it didn't disappoint. The rustic feeling of the small red espresso cups gave a vintage twist to the whole caffeine experience. I'd love to come back and try their waffles.", "author": "Linh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Love their espresso! The place is minimalistic, but the baristas are friendly and the drinks are perfect. A tad expensive, but it's something I'd definitely be willing to pay more for ($4 for cappuccino and $5.50 for an 8 oz mocha). They use Dandelion chocolate for their mocha but the chocolate doesn't overwhelm the espresso like many other places.", "author": "Cara R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Im a fan of all things Anthony Myint has done when it comes to food and drink. Linea has always escaped me as they're open very few hours during the day. In my rare instance being here in the afternoon I had to grab something before heading out of town. Got a very solid cold brew for the road. The people working are super nice and I chatted with one of the cooks while waiting for my coffee. It's a tiny space perfect for its little corner.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Cute little neighborhood cafe in the Mission, just a few blocks from Dolores Park. I had a cup of their regular Guatemalan drip - medium roast, but still quite flavorful. They also serve a couple of selections of pastries. There's a couple of tables outside to people watch by, but this isn't a place to park yourself to work. Closes relatively early on weekends (6p).", "author": "MichLee A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "I ordered cafe latte. The product is good. It's same quality as most of $5 cafe latte places. \nThe service was so not welcoming. No smile, loud music, no bathroom, no listening. I couldn't interact w/ server, casher, or anyone unless I yell what I want. \nVery sad experience as the cafe. :'(", "author": "Natsu Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Small little coffee shop with outdoor seating similar to a European corner. that alone makes it worth a trip. they have their own selection of expresso, coffee and cold brew. their hot coffee and cold brew both taste similar so try either depending on your mood. they used to serve waffles but I believe they stopped that recently. if you're passing through its worth a stop although it's not something you'd see if you stayed on Valencia or Mission.", "author": "Mario C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "I'm a fan, and the barista from Oakland who artfully prepared my americano and made great recommendations on which single origin beans to purchase, thank you; you rock.  The space is small but the coffee memorable.  Go and be satisfied!", "author": "Gregg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "Linea Caffe apparently specializes in waffles and salad. I don't get it either, but I can't argue with quality.\n\nThe waffles are light and crisp -- very similar to the cornmeal ones you find over at Brown Sugar Kitchen. The Greek yogurt on top is a nice touch too.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Excellent barista, coffee, food and attitude \nTheir expresso is excellent, love their buckwheat waffles and their avocado toast (not as great)\nBut for coffee I would say one of the top 3 in SF", "author": "Nadim T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "Cute hipster location in the not so gentrified neighborhood of mission and 18th. Cute red mugs for coffee lovers. \n\nNo tables to sit within the establishment but there are 5 tables around the outside of the restaurant that fill fast but people are constantly moving. \n\nThere are few choices on the menu mainly 4 options of waffles and some salads. If you are looking for a large menu this isn't it. \n\nLooked like a small neighborhood spot with great coffee and great employees. I will be returning. :)", "author": "Ramla J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "I checked this place out when they first opened. It was awkward because at the time it was espresso only and no decaf. I know that has changed since.\n\nBut the reason I'm writing this review now is just to give credit to their high quality coffee beans! \nI've seen them for sale at the 18th St BiRight location. They use these beans at the outstanding CRO Cafe in Oakland's Temescal Alley.\nThese coffee beans are curated by the veteran coffee dude who used to do Ecco Caffe. They are pricy but worth it.", "author": "RK W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "There are NO WAFFLES here for future visitors. The waffles were a pop-up, which ended in Feb 2016.", "author": "Monica V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Stopped by for a cappuccino to go on my way to the BART. Expensive at $4.50 but good quality and I'll try it again some time.", "author": "Neil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "This is based off of their coffee and espresso only.\n\nThe coffee I had was delicious. Super nutty with no bitter after taste. Espresso was just as good and it came with a small cup of Pellegrino on the side. Nice guys working the counter though I felt one in particular was a little uppity.", "author": "Kathleen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Coffee and espresso are pretty darn good here, but never ever order the hot chocolate. I brought a couple of non coffee friends here to try the amazing waffles (by the way, that is an entirely different business and tragically they've dissolved their partnership and they are no longer located here nor do they plan to open up again) and both of them order the hot chocolate. One of them brought it back to the barista who told him that it was suppose to be grainy because they \"use real chocolate.\" Generally, the baristas are very nice, but that was utter bull.\n\nBottom line, coffee is too good for me to stop coming here but do not order the hot chocolate.", "author": "Soo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Solid 5 star place based on their espresso and coffee. Exquisitely balanced and flavorful.  \n\nThe brewed coffee they had at the ready when I walked in was the Peru San Ignacio. $3 for 8oz felt cheap to me but I have no concept of price for black coffee anymore. (Shout out to all the small roasters and small coffee spots!)\n\nService was excellent.", "author": "Steph T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Finally stopped by here while waiting for the 33 after walking by for years. The coffee is on point, and even though the selection of pastries was small, the strawberry poppyseed muffin was \"bomb af.\" Also, the blonde girl working was incredibly nice! Like noticably very sweet! Will definitely stop by again during the many times that the 33 bus has a hella long wait.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Great (small) place to go for a quick, unpretentious, and good coffee. The only seating is outside, which is lovely on a sunny day. My favourite place in the area.\n\nThey have waffles too but it doesn't factor into my life.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Great spot, just far enough from the crowded mission. My new spot for a morning coffee. The people are nice too! But I wish their drinks were a little cheaper.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "Linea Caffe roasts their own beans. also in this space is a kitchen serving waffles, salads, and breakfast.\n\npour: american (3.5)\n-soon smooth, velvety, individually brewed\n-no aftertaste,\n\ndrips:\n-seating available inside and outside now.\n-shop behind duc loi market.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "My friend wanted to get some waffles and coffee and she suggested that we come to Linea Caffe.\n\nThe cafe is quite cute except I have a couple of issues with the space.  There is actually no seating inside the cafe.  There are a few tables and chairs scattered outside and some small benches but finding seating can be quite a challenge.  I wouldn't mind as much except waffles and salads (their primary foods here) aren't really that easy to eat while walking at the same time.\n\nThe latte I got was decent.  However, they also don't have syrup shots here.  Every single non-Starbucks I've been to in Seattle has syrup canisters yet in San Francisco I'm discovering that a lot of coffee places don't have syrups. Hmmmmmm.\n\nI got the buckwheat waffle with mascarpone and honey.  The waffle was a bit mediocre yet still costed me like $7 for a waffle.  My friend got a special one, a coconut one and she was also quite disappointed.  \"You're not $9 good\"", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "I went to linea in search of their waffles after having already eaten half of a Tartine sandwich (and if you know their sandwiches, they are large and super filling). I just wanted to try the waffle and didn't intend on eating much of it. I got the chocolate, macadamia nut waffle and it sort of blew my mind. the yeasted batter they used makes it light and sort of whipped while still keeping the integrity of the crisp. I ate half of it even though I was full...so that's saying something. \n\nside note: I saw two very old (late 60's early 70's) fobby looking Chinese women eating savory waffles, which was a weird sight to see. fobby Chinese women and hipster waffles don't really make sense together but maybe I shouldn't judge. for all I know they weren't fobby. maybe they were ABC (American born Chinese for all you Bay Area newbs) but you inevitably grow up lookin fobby anyway (gasp! a glimpse into my own future maybe?)", "author": "Regina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-24", "description": "Cute coffee place. it adds a nice touch to the neighborhood as the only other \"hipster\" coffee place is Ritual. The prices are comparable to Philz and Blue Bottle. I may actually prefer both better. \n\nLinea's latte was good. It wasn't burnt. But i wasn't in \"awe\" if that makes sense. I definitely want to try the waffles and will update my review accordingly after.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-21", "description": "The waffles were terrible, burnt and served with like 2 strawberries. The lemonade was probably the worst there is (and it cost 4 dollars, for a lemonade!!) \n\nThe coffee was cold and overpriced too. Avoid this place like the plague.", "author": "Amol J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "So much yum! Stumbled across this cute little cafe on a Sunday morning when all the other brunch places in the Mission already had crazy long waits. They serve waffles, toasts, sandwiches and a variety of different coffees. \n\nWe ordered the avocado toast and the greek yogurt & fresh fruit waffle. Both were great! I enjoyed the toast more while my friend liked the waffle more so I would recommend both! The avocado toast had a little pesto seasoning on top which added a yummy and unique seasoning. The greek yogurt waffle literally melted in your mouth as you took a bite. We also ordered a iced coffee which wasn't exceptional; I've had better. \n\nThis is a small little cafe with very little sitting area which was a little unfortunate because they serve such great food. If you get lucky, definitely sit at one of the tables outside so your food doesn't get soggy. I will be back to try other coffees and food concoctions.", "author": "Malika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "Best Gibraltar I've ever had. \nYes, better than Blue Bottle's, or anyone else's.\nThe level of complexity and balance achieved was simply sublime.", "author": "Ethan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "WHAT A CUTE PLACE! CUTE CUTE CUTE! and quaint. \n\nThis caffe seems more like a neighborhood caffe than a big, GOTTA GET YO COFFEE HERE kind of caffe. Which is pretty nice! My dude friend and I were early to an appointment in SF around noon, and we hadn't eaten breakfast yet. So, we headed on over here and got some waffles! I got a churro waffle, and my dude friend got a strawberry waffle. mmMMMM. Waffles are nice and CRISPY. Gotta love that crispy. And yet, they seemed to melt in your mouth a bit too. Or maybe that was just the cinnamon and whipped cream. Also, the waffles were overall pretty to look at! \n\nCoffee was nice too! Wasn't drop dead amazeballz, but it was yummy especially with the waffles. \n\nREALLY NICE LITTLE BRUNCH PLACE. (with friendly service! woot!)\n\n... Street parking doh!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "Returned on a super sunny day and the place was perfect. Four tables outside. A standing bar at the window. Not too busy so there's always room somewhere to eat with a steady trickle of customers coming in for coffee to go.\n\nThis time I had the potato pastrami waffle ($9 + tax) for brunch. Another solid offering. The potato and pastrami are baked into the waffle and served up with lightly sour saurkraut and whole grain mustard. Pastrami was really good and nicely distributed throughout the waffle. Completely different than the cucumber, roe, creme fraiche one but just as good.\n\nI'll have to continue to work my way through the menu here.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "5 stars for the coffee, 3 stars for the food and the attitude. \n\nExcellent capp, but the waffle smorgasbord left something to be desired. \n\nMaybe I should have tried the egg soufflé w/herbs or the cucumber fish roe waffle, but ordered the egg sandwich instead - this is basically a tiny waffle with a little bit of over done scrambled eggs and a piece of bacon on top. Not bad but I wish there was something more to it. \n\nThe dude at the register didn't seem to like me, but maybe that's me projecting.\n\nI'd recommend ordering a coffee to go and avoiding the scene.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Can't fault the coffee, it was good and the store is super chic. Our Server on Saturday afternoon 4/16 was beyond surly and unco-operative he was downright rude, we felt like we were imposing on his peaceful Saturday by making him get up and do his job. \nStarting and running a business in this area is expensive , the product and the ambiance has been carefully curated and then you hire this idiot to drive your customers away ???\nI have seriously had better customer service at the DMV ..", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Great coffee, delicious refreshing green tea lemonade, and very tasty savory and sweet waffles. I just wish there were more tables as it's always tough to get one...", "author": "Erin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Coffee in a tiny cafe! Luckily, there is outdoor seating too.  You may see the owner Andrew tasting his latest roast.  Friendly service and excellent coffee served in Heath ceramic cups.  I did visit more often when they served salad and waffles.  Now the coffee is a splurge since it is quite expensive.  I met a woman travelling in Tanzania who was a very devoted fan.  She had packed ground Linea coffee to brew during her safari!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "Barista (white man--we are a group of Asians) was extremely rude and visibly annoyed when he did not fill the $4 iced coffee full. I asked for more almond milk and he acted annoyed and even disgusted. Ruins the entire experience and makes us never want to come back. Customer service is everything when deciding to come here rather than all the other popular coffee shops with actual other customers. Had to go to corner grocery to buy own almond milk. Won't be coming back", "author": "Isabel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "I've had a lot of good coffee, but I'm not sure anything tops this place. Great people (Justin & Andrew) and a nice little outdoor patio.", "author": "Chicago Twenty Something .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Came here once for brunch - Wow!\n\nTheir waffles are stupid good.  Fluffy and a bit chewy on the inside with crisp goodness on the outside.  I took a risk and went for the sweet waffle only - or at least I thought I was taking a risk.  What I later learned was that the waffle risk taker extraordinaire I am not.  This place has savory waffle.  I'm talking salmon roe with cucumber and waffle.  Don't be a jerk, eat a savory waffle.\n\nMinus 1 star cause their coffee isn't very good.  My cappuccino was bland and feasted like warm milk.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Best frickin' waffles in the Mission.\nBest frickin' salads in the Mission.\nBest frickin' coffee in the Mission.\n\nBasically, if you happen to find yourself in the Mission, you should certainly go to Linea Caffe for any of the aforementioned food items.", "author": "Javin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Great find. Came here twice in one week (I live in the East Bay so going to the Mission District is a commitment) and both times was quite satisfied. Just went with a regular iced coffee for the first visit, but the second time decided to go with the waffle with greek yogurt and fruit as a late lunch/afternoon snack. Though it isn't normally made with buckwheat, they had no issues with, and gladly accommodated my request. \n\nIt's a bit small, and the lack of inside seating and limited outside seating is a bit inconvenient however I understand the difficulty in obtaining space in the city so I realize that's not exactly under their control. They're just making do with what they have/can afford. My roommate and dad both got the club sandwich, and we were all mesmerized by the fact that the bacon was cooked INSIDE the waffle bun. Needless to say, it was delicious. It was all delicious and it was different, very unique with the menu. Linea is my go-to coffee joint when in the Mission from now on!", "author": "Dan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Context: looking for morning coffee on a Saturday where you can also get a bite to eat\n\nAtmosphere: small store front with very limited indoor seating and several outdoor tables. Great website. Worth taking a look at.\n\nService: quick, friendly and efficient. Short line\n\nCoffee: roasted on site. It is smooth and flavorful. Very nice latte and cappuccino\n\nFood: we tried the ginger scone which was excellent, crispy edges, soft but mildly chewy interior and full of pieces of ginger. They also sell waffles.", "author": "Vivek V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "This was the best latte I've had in my entire life. \n\nHowever, I had to enjoy my perfect latte and mouthwatering waffle at a counter that was not very ergonomically designed.  You win some, you lose some!", "author": "Zoe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "A cute little cafe with some really good latte. That's all I need.\n\nAlthough, it can be a little expensive. $4.50 for an 8oz Latte... *sniffle*\n\nI do like the concept of specializing in waffles of many kinds. In fact, one of the orders looked so good, that if I hadn't had breakfast already and multiple meals didn't go straight to my thighs & butt, I'd have ordered one for myself!\nI'll be back!", "author": "Ranjani S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Quite honestly the best coffee in the city. These guys source their beans from only the best growers in the world and they roast the coffee to the peak of perfection. Their beans are fantastic! I have yet to be let down by a single batch. I appreciate the fact that they choose to sacrifice a huge variety for a consistent quality product. I'm happy to do it.\n\nThe espressos are also consistently perfect. They definitely put as much thought into their expresso beans as they do to their pour over coffee. I really can't stress the consistency of this place. Any cafe can make a good drink, or have good beans occasionally, but to do it over and over again while sourcing from Eco-conscious, quality, growers, without sacrificing the flavor is astonishing. \n\nI also enjoy the Lt. Waffle and The Green Salad? As well. I find the pairings odd bed-fellows but it helps Linea distinguish themselves and stand above the very dense crowd that is Mission cafes and places it in the realm of Bay Area coffee destinations if such a thing even exists.\n\nAdded props for sourcing from Heath", "author": "Chad B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "When I first frequented this place when it just opened, it was all the rave. This place even earned itself a place in the New York Times.\n\nI have been back numerous times since then but my recent stop today left me utterly shocked--they had took off everything on their menu that had eggs or chicken, avocado, etc. Only 3 items were left on their menu-- yogurt and fruit waffle, buckwheat, and another option which has escaped my mind.\n\nThe line that used to exist here during lunch time was not present today. When I asked the cashier if that was the current menu, he simply replied, \"Yes this is the new menu.\" Since I was really hoping for the BLT waffle, I said thank you and left.\n\nThe lack of options for this place is disappointing. I don't know if the new menu was temporary or permanent, but I hope the other items come back.", "author": "Aggie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "I think the lattes here are top notch. Staff is friendly, and I am pretty sure that Leslie knope would approve of the incredible waffles.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-17", "description": "I really didn't love the pastrami and potato waffle with sauerkraut, mustard and a fried egg. Very dry and bland and the egg was overcooked. My small almond milk latte was great though so that helped. The $18 bill for these two things made me very sad.", "author": "Jessie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "A co-worker of mine has been raving about Linea for a really long time since she lives right around the corner, so naturally when the opportunity to try a new place for our Sunday coffee came up, I recommended that we try here.  I was able to prod Greg out of bed at 8am by telling him that you can get a waffle to go with your coffee, and after hearing that, we were out the door and on Bart.  I was expecting a huge line, but it was pleasantly busy, and we were able to snag two seats outside.  I had a regular coffee, which was served in these AMAZING mugs.  Greg typically orders iced coffee, but was feeling adventurous and ordered their Iced Homemade Almond Milk Latte.  And in tasting said latte, it was truly unpleasant.  The drink was extremely sour, and was to the point where drinking it was a huge task.  Thankfully, me and my hot brew sat and enjoyed the classic Belgian waffle on a beautiful Sunday morning.  I can't wait to come back here for the buckwheat waffle.  I'll most definitely be back!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Really good freshly roasted beans, pretty amazing waffles and delicious cappuccino. Definitely worth a visit!", "author": "Marco R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "What a delight! Order at the register, grab a waffle and coffee and be served from the window right next to you. Adorable :) Perfect place to catch up on a sunny day. \n\nThe staff here are so great too. What lovely and friendly people!", "author": "Margaret S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Great macchiato, one of the best coffee shops in The Mission.", "author": "Danny G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-06", "description": "Lt. Waffle is the name of the food place that is in the caffe. Check out the reviews below. \n\nhttp://www.yelp.com/biz/lt-waffle-san-francisco", "author": "D. P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "Is the coffee good? Yes, very. \nIs $5 for a latte over the top? Yes, pretty much. I don't care how good the coffee is or if each bean was individually read poetry and massaged before roasting. That's just too much.  If I'm planning on tipping I can't walk out of there without spending $6. \n\nIf there are enough people in this neighborhood who share this distorted sense of what's reasonable, then I suppose the spot will thrive which I would be happy to see, but I'm guessing they're losing business from a lot of potential customers. Or losing tips. I'm honestly dissappointed, I live on this street and would love to be a regular, but I can't stand feeling taken like that or feeling like a chump for not leaving a tip.", "author": "Laurel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "A great Cappuccino!   \nSitting out in the sun at their outdoor area was just wonderful...made my day!", "author": "Matt V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "Linea Caffe is a new spot in the Mission that serves their own coffee roasts and light food dishes. The place is really small, with a bench inside, and tiny two-seat tables outside.\n\nI ordered a cappuccino and an egg souffle waffle with chevre and herbs. The cappuccino was really smooth, and the milk and espresso complimented each other perfectly. The egg souffle waffle...was quite forgettable. It's basically an omelette...with a super fancy name. You're basically eating a very airy omelette with cream. Not worth the $7...\n\nA friend of mine recommended this place, and I had some high hopes. Especially as a new place, I was hoping for a place that will boom over time. What I got was a place with clear hits and misses. Time to secure the good and patch up the bad!", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "The waffles are so good. No really, they are freaking good. Okay you don't want a waffle cause you think it's bad for you and you don't want to get fat. Well they got tasty salads too. Or you could eat the waffle and then the salad to make yourself feel better about having a waffle. Which totally makes sense to me. And don't forget to have a latte with your meal and sit outside if it's a nice day. They don't do soy milk, only almond.", "author": "Theresa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "This is The Best coffee in SF, no doubt!\nSmall, simple but so tasty. \nThe service is great! They are on it. No standing in lines for 10 min' just to get a latte. \nAnd the best thing is they don't take themselves too seriously. Yes, good coffee is important but it's only coffee ;)", "author": "T A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "A sweet little corner cafe set up like a bar with bar like vibes. It's a grab and go place, which would be the only reason I'd give it a star less because I'm a huge fan of posting at cafés. There is seating outside and the cold brew (iced coffee) was delicious! Also loved their logo.", "author": "Jinnah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "If espresso is your princess, Linea is your castle.\n\nI love this small, unassuming espresso bar in the mission. They serve the best almond cappuccino in the city, and their espresso is unbeatable -- smooth, complex, delicious.\n\nNot only do they have amazing espresso, but also: both virtuous salads and decadent waffles/pastries, which are on rotation. Kale salad -- yes!!! Every single waffle is delicious. Bring back the vegan pb&j waffle! \n\nAnd... You will not find nicer baristas / cooks. Andrew, Rita, Hector, Ant, Dena, Emma, you da best!!!", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "I love this spot for their Euro feel and the coffee and salads are scrumptious. We buy beans here typically and prepare chemexes at home. Service is friendly and helpful.", "author": "Sandy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-17", "description": "really?! ~$7 for a \"large\" cup of mocha. \n\n- overpriced\n- waffles were not good and not very special. \n- slow service", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "This cute little corner shop has been open about seven weeks, and their business seems to be flourishing. Good for them! \n\nTheir almond milk latte is among my favorites in the Mission. It's silky smooth, rich, flavorful, and made with TLC by their smiling, exuberant baristas. \n\nWarning: the small size is really tiny (8 oz.), so be sure to go for the large.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Good mocha, yummy waffles (I have one with peach salsa and greek yogurt,) and friendly service. It's a low-key hole-in-the-wall cafe with 4 small tables outside. A good quiet brunch alternative in the mission. \n\nThe mocha was delicious and satisfying. The price was on the higher side, so I may not be getting it again though. The waffles were well-priced, delicious, and fresh. I definitely enjoyed it. \n\nThe staff were really nice and friendly. I'd definitely go back, either for brunch or just a coffee. A good quiet stop in the mission.", "author": "Sneha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Simply the best espresso you are going to get in the Bay Area. Amazingly friendly staff and owners, and the place feels warm. Stopped by a few weeks back on a drizzly morning and it just felt right. It was easy and only offering a few things, but that focus allows them to be the best.\n\nThe place is small, and doesn't have a bathroom, or crazy art, or books and CDs for sale, or a wall of pre-made garbage food, and there's no free wi-fi, and bla bla bla... It's minimalist. And since when do any of those things play a part in the crafting of excellent coffee? (NEVER.)\n\nTo ME, all of those things I mentioned that are everywhere else speak to the fact that you need to be distracted from the garbage in your cup. Not to say that there aren't decent coffeehouses around, in which one can camp out and \"work on their screenplay,\" but that's not what Linea is trying to do.\n\nThey are focusing on quality and they are delivering. One of the best coffee tasters/roasters/palate's IN THE WORLD (Andrew Barnett) is behind the scenes (and probably lurking around the shop), and there is serious talent going into every element of their product. From the sourcing to the roasting to the pouring to the serving to the design to the packaging. This is a crack team of people who genuinely care about, and love what they're doing... And they do it well.\n\nThe waffles are different for many folks, but again, they're not trying to replicate what comes out of your freezer and goes into your toaster, or serve you pancake batter cooked with a grid. They are taking it one step further with creative offerings; both sweet and savory. Anthony Myint is (again) bringing something new to the neighborhood. And there's definitely room for his innovations.\n\nDo yourself a favor. Pony up the extra dollar for the quality of the coffee, and another to tip the staff. It's worth it. And you deserve it.", "author": "kainoa r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "Linea's already had serious coffee cred before it opened due to the founder veteran Andrew Barnett who is Coffee-industry veteran. His previous venture was at reputed Ecco Caffe which later merged with Intelligentsia. Plus, he also, judged the World Barista Championship. At this European-style café, the beans range from the super-sustainable (the Bob-o-Link coffee cooperative), to award-winning (the Fazenda Rainha was a seven-time Cup of Excellence winner), to throwback (Linea's Northern Italian-influenced espresso blend). This standing-room-only coffee bar focuses on espresso-based drinks, made from Linea-brand beans roasted in the East Bay and served in cheery red cups made by Cali's Heath Ceramics. Plus it's a bonus, that this cafe doubles as a waffle shop and salad bar run by one of the Mission Chinese dudes - cult-favorite chef/restaurateur -Anthony Myint. At most cafes, food is often an afterthought. Not here! The menu here seems to be meticulously curated which includes Brussels-style yeasted waffles with coconut jam, Gianduja, and macadamia nuts or egg soufflé waffles with chèvre and fresh herbs alongside tossed-to-order salads. \nDrink this: Brazil FAF Bob-o-Link Reserve makes a thick syrupy coffee with notes of sugarcane, honey, and cocoa nibs.", "author": "Rhea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Good coffee and light, crispy waffles. Topped off with some friendly service. It's like the perfect place to go for a breakfast that won't totally slow you down the first half of your morning. \n\nEverything about Linea is perfect, but seating is limited and you may be standing around waiting for a while. Some espresso at home first never hurts.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Love this place! \n\nGet the Caffe mocha. That drink is amazing. \n\nMy friends and I stumbled upon this location while walking around then Dolores Park area. It's very trendy and nice. \n\nService is kind of slow but for the quality of the drink,  I can't complain!", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "There are lots of coffee places tom choose from in the Mission. This one is tops.", "author": "giulietta o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "This place is very cute. She makes Belgian waffles and even makes one with buckwheat - CELIACS BEWARE: she apparently only has one waffle iron and it's cast iron so she can't clean from the regular waffles. I didn't try it - too risky (and not actually gluten free at that point). \n \nLatte is expensive - $4.50 for an 8 oz. it's good - but that's a pretty steep price for a decaf latte.", "author": "Min M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "I ordered a buckwheat waffle and got a regular. Fail! You'd think that with such a minimal menu, they could get it right.", "author": "Vicente G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-13", "description": "Amazing! Excellent coffee, a mix of healthy fresh salads, and waffles. I had the brown rice salad and I think it's one of the best salads I've ever had! Cute cafe with friendly service, highly recommended.", "author": "Kellie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "I can't say anything about the food but the coffee was really excellent. Very nice barista,\ntoo. Sitting outside in the sun is really fun. I also really liked the self made almond milk.", "author": "I R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "Top 5 favorite cafes in the city for sure. I'm knocking down one star because all the drinks are slightly overpriced compared to my other top choices. $4 for a cappuccino is a bit much considering all the other great options in the area - and the espresso drinks here are great but are edged out slightly by one or two other spots.\n\nOn the other hand, the waffles are very good - I tried the savory potato pastrami waffle - and it's definitely a solid casual breakfast spot on warmer days, as all the seating is outside.\n\nWill definitely be back to try more of the waffles.", "author": "Gleb P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Love the vibe of this super cute coffee joint! The staff is so friendly and the coffee and waffles were delicious. I got an almond milk latte and is was so smooth and creamy. My boyfriend got the iced coffee which was equally yummy. Definitely coming back!", "author": "Chauanh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Wonderful new cafe for SF's hipster coffee snobs. This one also serves huge seasonal waffles and salads. OK so the waffle is nothing like the Belgian waffles I've had but it's fluffy and topped with yumminess like greek yogurt, oranges, and olive oil. Also makes a good cup of cappuccino to enjoy outside.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "When in the Mission, this is the place I go for my espresso fix (a cortado/Gibraltar).  It is consistently smooth and delicious, and also beautiful (they do the latte art very well).  Also, the waffles are delicious.  Last time there our party had a strawberries & cream one and an \"egg sandwich\" with fried egg & bacon.", "author": "George O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "I just went there for the first time & ordered an Anericano and let me just say, HALLELU HALLELU!! This is the smoothest Americano's EVER!! So DAMN good! And I don't add creamer to my coffees ever! \nBased off this first visit, I am SO going back and their eats look & sound AWESOME!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "Adorable little coffee roastery & cafe staffed by some PDX expatriates.\n\nFantastic short menu of waffles - WAFFLES! - from Lt. Waffle.\n\nI highly recommend all of it. The mocha is a unique mix of espresso and drinking chocolate. I had a cappuccino that made my spine tingle. Shots weren't super noteworthy, to be honest (but, I mean, that's being super picky: they're still, like, 4-star, and everything else we tried was 5-star), and it'll be nice to see how these guys evolve as roasters: their priorities are clearly in the right place, and everything about this little corner shop in the Mission reflects that; bravo!", "author": "myrrh l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "It is really silly that I paid eight dollars for two coffees. It is also very silly that they only sell espresso drinks.\n\nHowever, as a very picky coffee drinker, I have to acknowledge that this coffee is clearly made from fresh beans and is really delicious for store-bought coffee.", "author": "A T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "Lovely sunny spot to grab a tasty coffee and fluffy waffle before work. Gets busier on weekends but none of the crazy lines as at Tartine. Everything is tasty but expensive.\n\nEgg soufflé waffle is a solid savory option. The salmon roe waffle is for adventurous palates, but not mine.\n\nThe mac nut/chocolate sweet waffle?! Dessert. Delicious. Tooth decay.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Excellent, strong coffee plus incredible waffles by Lt. Waffle. Try the peach salsa with fresh cream and mint, my goodness, you'll never look at a waffle the same way again.", "author": "Priscilla M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "Through the window.\n\nMichael Cassette's brilliant version: https://www.youtube.com/watch?v=Jz6niV7qeu0\n\nLinea's brilliant version: Huge open windows set the relaxed mood for an Americano so smooth no additives are needed. House roasted quality comes with a worth it $4 price.\n\nInside the small yet highly functional space you'll also find delicious eats from Lt. Waffle (http://www.yelp.com/biz/lt-waffle-san-francisco?hrid=l1gjDe9dV8NI5crFy0z9wA) and GreenSalads (http://www.yelp.com/biz/green-salads-san-francisco?hrid=VSTJddjRzBzt79_zAzfBtQ).\n\nGrab any of the above and a table outside the open window. Enjoy the melody.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "Solid espresso, and dig the Aeropress-only option for drip/press. A bit on the slow side for waffles/food and the waiting/standing area is small, but the baristas are crazy friendly and ambiance is cute.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Coffee and waffle. Great way to start a day!\n\nSmall place; best if u grab coffee to go. Hopefully they will get seating permits soon.", "author": "Ankur V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "This place is cute. It's a cozy coffee shop just off the hustle and bustle. They have great small meals - especially the waffles - whoa. They are a bit pricey and they only have one size coffee. I'm still in love with the starbucks ingrained idea of having a super sized venti. The coffee is great and the people are cool.", "author": "Katherine J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "They play sick music, and the cheese scone and iced americano I got this morning helped me survive a stellar hangover on my way to the airport", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Pro: interesting concept/mix of offerings, great service, well balanced drinks, and decent waffles.\n\nCons: have to pay extra for maple syrup, little pricey ($6+ for a mocha), and the waffles was more interesting than it was tasty - it was on the eggy side, so it reminded me of a crispy souffle in the shape of a waffle.\n\nStill, if I happen to pass by, and have money burning a hole in my pocket, I may stop in again.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Great waffles. Started with a savory waffle with avocado and egg ( with some siracha )  and then a sweet dessert waffle with strawberries and chocolate drizzle to split with a friend! So good. Their coffee was good too.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-15", "description": "This place is a total ripoff! First of all I pay 5 bucks for a tiny 8oz cup of latte and I get lukewarm coffee after mentioning I'd like it extra hot. Definitely not worth it!", "author": "Somas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "I can't comment on the quality of the coffee (but knowing who is behind roasting I am sure it is stellar), but I've gotten salads from here once or twice... every time I think, why am i spending $10 on a salad? Today was no difference - I got the arugula salad and it tastes fine. But $10 for arugula, a handful of cherry tomatoes, a slop of goat cheese and some very thinly sliced squash? This place just seems like ti falls in the overwhelming common pricing of SF \"$2 too much\".", "author": "B. Rabbit m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I've not yet had the food here but I daresay this place has saved me on multiple occasions with its amazing Americanos. When you're a teacher en route to work at 7 am, this kind of elixir is less a luxury than necessity, and these guys know how to make them right. High quality espresso at the perfect temp, always served with a smile & efficiency. Waffles, you're next.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Literally unbeatable friendly service matched with phenomenal coffee and a unique food menu.  Try any coffee or any food item, or both, and let the satisfaction pour all over you!  The atmosphere is pretty cozy tight inside, where you most likely will stand to drink your coffee, but I like that.  The staff and owner really seal the deal.  Sitting outside you certainly get that neighborhood coffee shop vibe.  Hats off to Linea!", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-15", "description": "Not impressed.  $4 for a small cappuccino that had almost no foam and took 20 mins to make.  They are too hip for me.", "author": "Jim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Tired of all that sour hipster coffee that tastes like lemon juice+cat pee? Linea makes a smooth, toasty, deliciously well-rounded roast, and their baristas do justice to every bean! The best cappuccinos I've had in the city, consistently, served with a smile and  no attitude. Plus, waffles and kale salad. I love waffles. I like kale salad. Linea sees into my soul (or at least my stomach) and makes me happy. My husband gets the \"coffee subscription\" (1 lb sent to our house every couple weeks) and while it's expensive, their exquisitely chosen and roasted beans make a damn, damn fine cup of coffee.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "One of the best cappuccinos in my entire life.. And i'm italian! Perfect temperature, perfect sweetness (no need to add sugar) & perfect aroma coming through! Haven't tried the waffles yet but I'll surely be back! Everyone was perfectly nice and the atmosphere on a foggy sunday morning was relaxing & welcoming!", "author": "Valeria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Can't decide what I like most: the waffle, the hot chocolate, or the hilarious baristas. If this place were a woman, I would marry it.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "Had the espresso. Solid. I just wish it was open past 3pm.", "author": "Nasci N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "What a wonderful cafe in San Francisco. Very quaint, with not much seating, but the friendly vibe and amazing coffee give this 5 stars for sure. I had a small latte, and was very pleased with both the smooth taste and the beautiful presentation! I must admit that I'm a sucker for good latte art. Definitely to stop by Linea if you're in the city!", "author": "Lindsey A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-05", "description": "Food is pretty good but does not justify the price.  A cup of black coffee is $3.  If you want a refill its $1.75   For a $5 coffee I rather go to four barrel.", "author": "Yanina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "I got a latte and a waffle this morning, which I guess was the first day they opened. The latte was as good as any I've ever had, and they serve it in Heath cups, which I love. On the waffle side, I got mine with greek yogurt, strawberries, and (I think) tarragon. Probably the best waffle I've ever had, due to the amazing texture: crispy on the outside and soft on the inside. I was also impressed with how fast it all came out, even though they were pretty busy. I guess other people in the neighborhood have been walking past and watching this place come together. The wood tiling on the wall is really modern and appealing.", "author": "George L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-05", "description": "$3.50 for twelve ounces of drip coffee is over the line. I admit that it tasted really good, though!", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "Linea provides good coffee on an unassuming street corner.  Try the waffles; they are not your run of the mill variety and surprisingly delicious.  There are also salads but I have not tried them yet so can't comment on the quality.  Technically I think the waffles and salads might be separate businesses distinct from Linea, but you order everything from the same person anyway.  There's no indoor seating and only limited sidewalk space outside... so I wonder how this will work when we finally have a rainy winter.  Bonus points for the bike rack out front.", "author": "Alan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-22", "description": "I'm glad they're here. Every new business adds to our property value.\nThey make a fair to middling $3.00 latte, except that they have no non-fat milk.\nHowever, it's not worth the $4.50 they charge for it.\nThe rest of the menu looks good, albeit pricey.", "author": "Carl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "Best Belgian waffle I've had yet! Except for the ones in Brussels. Delicious. And my espresso shot was well done too.", "author": "Will D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-06", "description": "Its ironic that here I was just last week bragging about this cafe to friends that they did the best coffees in the city...& thats quite an endorsement as there are many great ones to choose from. Last time we were here and ordered cofee's and a bag of beans one of the coffee's was comped (#nicetouch) but our coffee's & beans on the weekend were the full price deal. The other major downer was the kale salad with a side of chicken...um, hello where was the chicken? It was there but blink and you'll miss it - #toolittlechicken  A really disappointing $46 experience and I missed not having my coffee made by the stellar italian barista from my previous occasion.", "author": "Nicole E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "I use to wander the streets of San Francisco when I was a loser. I was only fueled by espresso and Vietnamese sandwiches. Now that I'm superman again Linea Caffe is where it's at. Best espresso in San Francisco. That's it.", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-08", "description": "Ordered a waffle, which took forever despite no line. Once I got it, definitely delicious. I just wish the staff would have been a bit more on point this morning.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-15", "description": "Cute new spot. The espresso I got was one of the smallest portions I've ever had, barely a sip. The flavor was ok. My sis loves this place which is why I stopped by. Maybe i'll be back again to try a waffle and give the coffee a second shot.", "author": "Bon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Another quick note: the drinks menu is pretty much limited to just espresso drinks -- don't expect to get drip coffee, iced coffee, or orange juice to go with your waffle.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "Almond milk latte. Yum. Buckwheat waffle with mascarpone. Yum. A definite winner on a sunny Sunday morning.", "author": "Marie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Their espresso is great and served up in brilliant Heath stonewear. I am however a little grumpy that the taste-makers at Sightglass et al have raised the going price of an espresso to $3.00. This either means that the baristas don't get a tip (not cool), or that you can't walk away for less than $4.00 (not cool)...", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "Nothing spectacular, especially considering there are so many other nice coffee shops in SF (Philz, Blue Bottle, etc.) But I dined in Tartine and found that Linea was nearby, so decided to go get a cup of cappuccino. (Small for $4, which is a bit pricey).", "author": "Jingjing Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "This place needs to get it together. When I asked for a large cup of coffee  they told me they only serve 7oz sized servings, and suggested I order an Americano.  Why open  a cafe if you sort of don't serve coffee? Or you want to encourage something besides what most everyone is ordering?", "author": "Juniper M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-15", "description": "Yikes, I feel bad writing this review but not as bad as my wallet felt after trying this place today.  Steer clear!  We got off to a great start - the atmosphere is bright, clean, pleasant and oozes that cool, casual Mission vibe most of us love.  The barista was also very friendly, engaging and helpful with suggestions.  We ordered a cappuccino, an americano and two of the Belgian waffles - one waffle breakfast sandwich with eggs and bacon, and one with yogurt and poached pear.  \n\nThen, the food arrived.   My partner's $9 waffle \"sandwich\" had 1 very small fried egg, maybe 1/2 a piece of bacon broken into even smaller pieces and a tiny bit of mustard sauce.  My equally expensive waffle had maybe 2 tablespoons of yogurt, a bit of poached pear pieces and an even smaller sprinkle of pomegranates.  We were taken aback by the paltry portions given the price, but the taste was good - a light fluffy waffle with the right crunch is not easy to come by.  However, the lack of topping left us each with more than 1/2 a waffle with NOTHING to put on it - dry, bare, nada!  My husband had 1/2 his waffle left with no egg or bacon or sauce on it at all.   We thought maybe a bit of maple syrup and butter might help us enjoy the rest of our overpriced breakfast.  I went in and asked the cook if we could have a bit of maple syrup and she said \"Sure!\" but that she \"had to charge $1 for syrup.\"  What?  We just spent $25 for two coffees (the cappuccino was $4, also the most expensive I've yet seen in our neighborhood), and two waffles.  \n\nSTINGY. EXPENSIVE. Not right!  Those waffles should have been $6.50, maybe $7 or if not, then served properly - two eggs, a slice or two of bacon and a side of the mustard sauce, a portion of yogurt and fruit that allowed the waffle to have bits of topping on most bites.  I expressed surprise to the chef for the upcharge, and also told her we would not be returning.  She was totally nonplussed - also too bad for a number of reasons - but mainly for the fact that we get coffees every day in the neighborhood.  As we left, my husband said it best,  \"this place needs to get over itself.\"", "author": "L S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "I've been eager for this place to open because co-owner Andrew Barnett has a legendary palate in the coffee world. And guess what? The place is awesome -- the espresso is perfectly pulled and has a nice roundness that extends all the way across the palate to the finish without a single jarring note. It is smoooooooth!", "author": "Greg D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-07", "description": "Just sitting here waiting for a waffle. Weekday morning. Not busy. Something is wrong. Just me sitting here waiting.  Super calm woman chopping carrots. Reaching down eating a few pieces. Then putting the rest in lunch for some poor soul today. Yikes! The order taker not saying anything. Why am i still sitting here? Older man with stripped shirt not saying anything. Carrot chopper staring off eating carrot bits. After 20 minutes i say \"did my order get skipped. \" Carrot chopper says \"sorry i didn't see the order. Ill refund your order.\" Waffle is fine. She comes out and uses my name and says she refunded my charge. Nice but overall weird experience.", "author": "Mission I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-17", "description": "They do a great job of getting into your head with the hipster vibe, hipster staff, and hipster clientele, but in reality, the food is extremely simple and way overpriced. Not a bad waffle egg sandwich, but considering it's literally about four bites of food, there's better things to be done with $8. Same goes with the $3 coffee served in an artisan one-inch thick mug that leaves about 3 ounces of space for the contents. Be careful cutting your waffles on the flimsy tables outside, because your coffee will spill and the chair may collapse. Friendly service, though. Also like the paperless receipt.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "I ran into this place by a nice coincidence and its coffee has immediately become my favorite 'Italian' inspired espresso in town. Grazie Andrew!", "author": "Alessandra V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-17", "description": "Good coffee...but way overpriced for sooo little. had the kale salad w/ chicken & avocado for $15.00 no thanks", "author": "Elena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "best cappuccino i've had in SF. the only comparison is one I'd once had in Japan. i've yet to try their food - but looking forward to it!!!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Delicious espresso beverages, interesting sweet and savory waffles. It's a small place so be prepared to snipe a table or stand at the little window counter thing. Pleasant service, cozy atmosphere.", "author": "yoon p."}
