{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Awesome.  Saturday and Sunday's Oyster/Champagne deal simply cannot be beat.  Your choice of three different types of fresh oysters for only $1 a piece.  If oysters aren't your thing, they also have spectacularly succulent jumbo prawns for you to devour.  This is one of the best deals anywhere in the city.  Highest quality seafood and prices that encourage you to eat all the food in the restaurant.  \n\nBottom line:  You need to add Lord George to your list of must stops anytime you have a craving for killer seafood!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "Dropped by here a few hours after a Sunday day game for drinks and a quick bite with friends. It was one of the few places in the area that was open with good reviews and a few seats to spare.\n\nWe grabbed a table for six and waited a bit at the bar to be served. It wasn't that busy but the servers seemed out of it and like they weren't aware of what was going on. Took awhile to get our food orders in, and in the meantime a couple of meals came out of the kitchen and they didn't know who they were for.\n\nFortunately we finally got our drinks and our food orders were placed. The food came out within 10 minutes or so. The burgers were decent and I liked the fries. I got the ham sandwich which was bomb - smoky black forest ham on toasted sourdough with gruyere cheese and a fried egg on top. The cheese melted out the sides and got a bit lost, but it was a great balance of smokiness, creaminess and fat. The side salad was just leaves which was a little underwhelming.\n\nAll in, not a bad spot and the food was above average, but there wasn't much of an atmosphere and most of the people around us were sloppy drunk. Sunday evening probably isn't the best time to visit.", "author": "Nicola B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Good cocktails--especially the (possibly transient) tropical separate menu they've been featuring lately. \n\n$1 oysters 7 days a week? What's not to love! It's such a rarity to see that in the city. \n\nCertainly on my list of spots to return to.", "author": "Sam R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-30", "description": "I think this is one of the more underrated bars in the neighborhood. Partially because the super-popular 21st amendment is next door (which is also a great bar, but with a much different vibe). Lord George has great cocktails and very quality food. The food menu is limited, but everything I've ordered has been excellent. I've had the burger, the ham & cheese sandwich, the charcuterie and the fries. I'm not exaggerating when I say they have the best ham & cheese sandwich I've ever had. Also, the cocktail selection is excellent and the service is always great. I really like the Anejo Old Fashioned.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "Lord George is a sports bar, and they have loads of specials for Giants fans. The fries here are fantastic, and it's a nice place to relax. The fries are much yummier than the burger, and the drinks are alright.\n\nThey were playing the World Cup, and the place was full, but you could chat with a friend and hear them speak. \n\nOrdered the bistro burger with foie gras, clam chowder, and cider. I tried the Slow Clap because it smelled amazing, but I didn't love the taste. \n\nThe burger did not come with any foie gras, which we paid extra for. We asked the bartender about this, he assured us it was there. We could not see what he was pointing at, or taste it. The bun was dry. \n\nThe chowder was fine. They give you bread to dip in your chowder, this was a nice touch. \n\nThe fries were fantastic: they were salty and tangy, and these were garnished with parsley and rubbed with garlic. They tasted like a fancier version of McDonald's fries, in the best way possible.", "author": "Jenée S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Great bar! I stopped by for a drink and the dollar oysters on the weekends which was fantastic! Oysters tasted great and the Mint mule I was excellent. This place is definitely a steal for oyster fans with all of the oyster deals they do!! I was a little confused that the bathroom was less than ideal especially since I visited around the time that it opened but this is probably a one off.", "author": "Helen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Excellent cocktails - try the Cobra Kai for a fresh citrus twist on a whiskey cocktail", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "Quick drinks before going to the Giants game so I wanted to check out this place. It was on my list of cocktail places to try. \n\nWe sat at the bar and ordered some drinks. My favorite drinks always contain mezcal as a liquor base. Love it! \n\nI would like to come back for their happy hour, I want to get the oysters! \n\nOverall, great spot to get your grub and drinks on before the game. I hope you give this place a try. Cheers!", "author": "Owie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Overview:\n\"Weekend Oyster Party\" ($1 oysters and $25 champ bottle) all day all weekend\nBusy during the week, chill on the weekends\n\nThis has became one of my watering holes when I visit SF. Drinks are solid, vibes are chill, and it's not busy. Normally, it's just a few of my friends and a stranger or two from the previous night closing out their bar tap.\n\nThey also have themed cocktails that change often so it's nice to have a have a bar menu that constantly refreshes.", "author": "Nichole K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "My bf and I stopped by for a late night snack because I was craving oysters. It was Sunday night and they had a great all day happy hour special going on. EVERY Saturday and Sunday, ALL DAY, you can get half off oysters and $25 bottles of bubbles. Our main draw was the $1 oyster special. \n\nWe got a dozen of fanny bay oysters for $1 each (they were the dollar special ones for that day) and a dozen of the church point oysters for $1.87 each. All the oysters were cold and fresh. The church points were incredibly creamy with a slight sweetness. The fanny bays weren't as creamy which was a nice texture difference since we got so many oysters. To balance out our meal, we also ordered some french fries ($7). They came with a delicious garlic aioli and were super crisp and tasty.\n\nOverall will definitely be back for the oyster specials.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "Food - We ordered the fries in the afternoon. It was very delicious. You could tell they were made fresh. It was perfectly cooked. I cannot complain about that! I ended up ordering two plates for myself. \n\nService - It can definitely be worked on. The bartender was not very friendly. After we ordered our drinks, a group of 6 people came in and sat in the back (couch area?). They sat there for 30 minutes before being able to flag down the bartender. He was pretty rude when he walked over and responded to them by saying cant you see I'm the only one working? I get that he was stressed or was having a bad day, but it isn't an excuse to snap at customers. He wasn't exactly the most polite when he came to our table either. The French fries took about 30 minutes to come out -well worth the wait. When we checked on the status he told us it'll come when it comes... well then, okay lol. \n\nEnvironment - Very inviting and casual. I would definitely come here more often if I lived in Berkeley. \n\nRecommendation - Give this place a chance. But there is a very grumpy bartender that works Saturdays. Beware if he is the only one working. He does get upset if you take too long or ask too many questions. I am giving him the benefit of doubt by assuming he was going through some personal things and that was a one time interaction. I will give this place another shot if I return to Berkley.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Walked in on a Saturday night, and it was relatively empty.  We had a few drinks and some food:\n- Charcuterie/crudités - The salami and pate were fine, but the broccolini was actually really good.\n- Ham and cheese sandwich - Super greasy but surprisingly tasty.\n- $1 oysters - Can't go wrong with these.  I think they're available every weekend when there's no game.\n\nWe'll definitely be back for low key dinner / drinks again.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-24", "description": "A decent neighborhood bar located near AT&T Park, Lord George offers the usual array of cocktails, beer, wine, and bar bites that you'd expect of a pub-like establishment. \n\nHappy hour is a good bet, with discounted drinks and $1 oysters. Cocktails are quite good here, with a seasonally rotating selection at that. If you're not in the mood for bivalves, there are also apps, soups, salads, burgers, and cheese/salumi plates. \n\nService is OK, and there's a modest amount of seating either at the bar or at compact communal tables for 4-6 each.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "To celebrate my gf's new job, she chose this place. \n\nDrinks: 3/5 - There's an Alice in Wonderland themed menu. She ordered a drink from that menu that came in a tea cup & she said it wasn't strong. I had the Cobra Kai, which is a Japanese whiskey, but I liked my gf's drink more - Jungle Spy. The price for the Cobra Kai was $14.... after tax, SF tax (4%) and tip, my total came out to be $18 for one drink.", "author": "Anna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "I have to second the review about the bartenders seeming out of it. Showed up here for weekend oyster HH on a Saturday afternoon around 3pm a few weeks ago. There were maybe 7 people there total and it still took forever to get our oysters and drinks. When the Giants game let out, the place got packed and the bartenders were totally useless. One of them took my order for another dozen oysters. 30 min later, frustrated, I asked to close out and he did it - no questions asked. Looked down to see he hadn't even added my order in, despite acknowledging it 30 min prior.\n\n3 stars because the oysters we did have were tasty and because weekend oyster HHs are awesome.", "author": "Jen N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-10", "description": "Came here on a Friday night and the place was practically empty. Oh and it was a cold night out and I don't think they bothered to put the heat on so it was freezing as well.\n\nMy friend and I both ordered the burger--which was decent, but the lack of any energy in the restaurant and the fact that I had to eat with my jacket on will probably keep me from returning any time soon.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "I came here with some coworkers last Friday after a long work week.  When it's Friday, there's a Giants game coming up, and you just want to kick back and relax with your friends and/or coworkers, a bar like Lord George is the place to be.\n\nI'm a big fan of hard ciders so I ordered the South Bay Cider.  For a $6 cider, which is ridiculously cheap for SF prices, it was pretty damn good.  Their menus for both drinks and food are extensive.  Variety and choice are always good things.  As is the case with pretty much every bar, if you look young, you'll be asked for your ID.  Be ready.  The bartenders were also nice and easygoing and everybody there seemed to enjoy themselves.  \n\nI didn't end up staying for any food, but I hope to be back again for both food and drinks.  If 21st Amendment is too busy (which is usually the case), don't hesitate to come here instead.  Matter of fact, you might be even better off coming here first no matter what.\n\n4 stars", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Lord George was a spot I wanted to try for a long time due to the hype given by my coworkers.\n\nI finally got to try the place and was not disappointed. The only thing I had in mind when coming here was to order the burger. I did not fail that mission and neither did they. It was really good, but I felt it was actually the sauce that carried it to glory and not the hamburger patty itself.\n\nThe seatings are all on tall bar seats so I definitely can not recommend bringing a toddler here. The alcohol menu was pretty extensive and although I didn't have any alcohol, my colleagues that did enjoyed them.\n\nWe came here on a Friday for lunch and there was no other party. There was only one server manning the place which could mean longer wait times if the place was packed. As of this writing it seems that they no longer open at 11:30am on Fridays!", "author": "Benny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "*** In Short ***\n\nFantastic bar focusing on classics and their own originals built upon the classics.\n\n*** In Depth ***\n\nI've been to Lord George a couple of times now, though I can't quite seem to recall my earlier visits. Drinks are a little bit on the pricier end for the city, at an average of $13 per, but their pours are generous and their cocktails are strong, and the staff is pretty friendly too.\n\nIf you're looking for something really stiff, give the Dreams Old Men Dream a go: it's a combination Manhattan, Negroni, and Old-Fashioned, and it definitely shows in the size of the glass!\n\n***Accessibility Info***\n\nVenue - Pretty much all high-top counter seating, so not really particularly accessible. But hey, if you don't mind sitting a bit lower than everyone else, and having to reach a bit for your glass, there's usually enough space to just park yourself somewhere.\n\nBathroom - Didn't try them.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "The food is pretty good but the demeanor and customer service of the bartender (manager) is unacceptable.  \n\nThis gentleman (beard and bun) is unfriendly, doesn't smile, and appears annoyed with his job.  \n\nI've frequented this establishment recently as of late, however, tonight was the last time. \n\nThere's restaurants like 21st Amendment (right next door) that clearly understands the need to be consumer centric.  \n\nLord George does not.", "author": "Jeffrey K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "Came here for postgame drinks after Giants game on Fri 6/23/18.  Ordered 3 old fashions from bar tender.  He looked like he knew what he was doing but the drinks came out tasting like methanol (yuck).  I've been here before when it was slow and mixed drinks were ok. I don't know what happened- I probably should have taken them back & asked for a redo.\n\nBottom line - ask the bar tending what drinks he/she are good making.  Go with those.", "author": "Bob V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "Not what I was expecting when my friend said to meet for happy hour here.\n\nFrom the name I was thinking British Pub. Instead I found a Hipster-ish, artisinal cocktail (https://www.yelp.com/biz_photos/lord-george-san-francisco?select=huQA08nb4LElKlCxLq710g) & raw oyster bar (https://www.yelp.com/biz_photos/lord-george-san-francisco?select=2kou47zmtV8SYT4S4-biqw)!\n\nThey have a good selection of shareable snacks (https://www.yelp.com/biz_photos/lord-george-san-francisco?select=uY2ZrlH_HAYD0YXi3sWYTA https://www.yelp.com/biz_photos/lord-george-san-francisco?select=9s9g0Z0GDuPU-oI6LTnbEQ)\n\nService got spotty after it started filling up and a few drinks never came or had to be re(re(re)))-ordered. Be prepared for some waits or muscle your way to the bar.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "Decent drinks but terrible bartender- the others were good. Even after we ordered drinks from a bartender covering another area she did not acknowledge us. Told her we had ordered from somebody else because we got tired of waiting and she said \"oh cool\".", "author": "Bruce P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "Oysters for the win here!  Fresh and one can taste it!\n\nCocktails stirred and shaken up well! \n\nCharcuterie is spot on. \n\nNice bar to gather about!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Came here for a quick date on a weekend night and had a good meal with decent service!\n\nVenue / Service: dark blue walls with lot of old photos framed on the walls.  We sat at the bar and there were a few decent sized tables behind us.  Though it had a pub vibe and atmosphere, it wasn't too crowded when we went (probably because we went on a Tuesday night at 8pm); it was almost like a tamed version of your typical bar scene.  Service was quick enough that we were there for 45 min though I do find it a bit weird that all of our cooked food / charcuterie came out first before our oysters did (does it take 15 min to shuck 8 oysters and bring them out?).  \n\nFood: quick, comforting, and relatively simple bar food, which worked for us that night!  Highlights of this place are the oysters and clam chowder. \n\n-- Oysters (MP) - we ordered 4 types of oysters; Kumamoto (small, not fleshy, sweet); Kusshi (large, fleshy, balanced between sweet and briny); Marin Miyagi (small, not fleshy, balanced but more toward sweet); another oyster from New Brunswick(blanking on name, almost like a fatter version of Marin Miyagi, recommended by waiter).  All served with lemon and sauces, but they were fine with just lemon.  My favorites in order were the Kumamoto, Kusshi, unknown NB oyster, and Marin Miyagi.\n\nCharcuterie (Salame Calabrese)($8) - they gave quite a bit heap of this salame (esp. when looking at what else we ordered) so that we had a bit of trouble finishing it.  Slightly spicy (as expected with salame) but not too tongue-numbing.  I could have done without this one, but that's just because I'm not the biggest salame fan.  \n\nLa Tur cheese board ($7) - we decided to try this Italian goat/sheep milk cheese and it came on the same board as the salame.  This is a soft cheese and has a bit of a pungent taste to it, which I didn't mind but my boyfriend wasn't too crazy about.  They give you toast to eat the cheese with.  \n\nClam Chowder (Manila Clam, Bacon, Toast)($8 for cup, $15 for bowl) - one of the best clam chowders I've had in a long time.  Not super creamy / thick (I don't like mine super viscous) but not flavorless and watery.  The bacon wasn't too overpowering and there were lots of clams in the soup.  Comes with slices of toast, which I didn't need.\n\nHam and Cheese Sandwich (Black Forest Ham, Gruyere, Egg, Mustard Aioli and side salad)($15) - shared this with my boyfriend, which in the end was a good decision considering how rich/greasy this was in the end.  Reminded me of a croque madame (except egg inside).  Slightly greasy but quite delicious- the cheese went well with the ham and mustard aioli was able to cut some of the richness.  Would have liked the egg slightly more runny.  The side salad was a good palatte cleanser so might be a good idea to eat these greens afterwards.\n\nAll an all, was pleased with my (food) experience at Lord George and would come back again.", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "3.5 stars, rounded up.\n\nCame by for oysters one time, but they were closed.\n\nCame by again for drinks, succeeded!\n\nWe had a Bloody Mary and Manhattan, and both were good. I'm very particular with my Bloodies, and this one was about a 6.5 on a 10-point scale. (I have bloody standards; I wasn't kidding.)\n\nThe Manhattan was great. I'm far from a whiskey-drinker, but I think I could have actually drank this one on my own. Pretty crazy, but it speaks to how good it was.\n\nService was slooooow, and the ambiance is just alright; if you have good company - which I thankfully did - you won't mind.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "Here's a quick and to the point review for you based on a couple of drinks and the clam chowder. The Minty Mule was good. The beer was nice and cold, I wish that they had a better draft beer selection.The clam chowder was nice and chunky, the bacon was a yummy added touch. The service was just okay, not as welcoming as it could have been. I didn't stay very long because the vibe wasn't there. Overall, this was just another typical bar.", "author": "Valerie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I have only come here before a Giants game for drinks but they were excellent. Very interesting and crafted well. I was buzzed after 2. I definitely will be back", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "LOCATION: we just need a place to goo.. you know... somewhere before a Giant's game... somewhere with Oysters & Alchy! PLUS... it's soooo cool and hip lookin'... you just wanna enter in! \n\nSERVICE: Feel so welcomed here with happy smiles!! LOVE IT 5 stars!\n\nFOOD:\n(1) OYSTERS! \n(2) Calm Chowder - this is one of best calm chowder since I had a long time! OMG... BACON... BACON! 5 STARS!\n(3) The Bistro Burger - juicey, juicey angus beef burger... the juices just drips down your mouth... excellent\n(4) Smoked Salmon - my girlfriend got this... I was sooo tempted to try this... and no doubt.. cream cheese just soft and the salmon.. mMm! \n\nDRINKS:\nWINE!\n\n**OVERALL: maybe next time... I'll come back for the happy hour menu... happy hour oysters 4-6pm!", "author": "Mindy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Great place to chill, watch sports, and eat good food. \nStopped by to see what they had to offer since I was needing a stiff drink for the night. Unfortunately they don't serve Crown, but had multiple bourbon selections to make up for it. I also felt a little hungry and decided to try their burger with bacon and fois gras (skipped out on the avocado and egg since it was already a fat burger). \n\nHow it tasted:\n- The burger was good and the fois gras made it a little messy, but I knew what I was getting myself into when I ordered it. The fries were PERFECTLY cooked and piping hot! Loved it!\n\nCustomer service:\n5* for customer service. All the staff members I met were great and friendly! LEGIT!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "This is a really great place to stop by and have a drink, especially before the ballgame. The bartender served up an amazing \"gold rush\" cocktail. Pricing is fairly reasonable.", "author": "Martin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Nice place for a drink, the decor is adorable and service is really good. The tables seat 4-6 so good for groups :)", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-09", "description": "Good cocktails in a relatively calm part of the city, so the place would be ~4.5 stars, but a bar tender made a couple uncalled for comments last night, most unappreciated was encouraging a guy to continue his night with me. Not funny.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "Great place for a cocktail or three.  There is a brief but nice list of Bourbons from which to choose. They try new distillers now-and-then, so you may find something entirely new and delicious to taste!\n\nExcellent selection of oysters!\n\nCan't wait to return for more food and to try some of their named/theme cocktails.", "author": "Albert Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Great group of employees with drinks that you crave. The service and food are just what you need when you want a day to enjoy yourself.", "author": "Aili P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-21", "description": "My SO and I had tickets for a Giants game on Friday. I read the reviews on Yelp and saw the pictures of $1 oysters during Happy Hour, which led me to decide on Lord George for our dinner-stop. Unfortunately, I was misguided and a little misinformed...\n\nTheir HH is Monday-Friday from 4-6pm EXCEPT on game days. So no half-priced oysters or specialty drinks when there's a Giants game (which is really the only reason I ever make it up the city anyways). Welp, that sucks.\n\nWhen we got there around 5pm, there was only maybe 3 people at the bar and 3 tables occupied. Although it's a little small, there's a decent amount of seating, as long as you don't mind sharing a communal table with some folks like we did once it started picking up around 6pm.\n\nThe waiter came by to take our drink order after we seated ourselves, but we only got water. Prices in SF really make my wallet cry TBH. With the disappointment of no oysters, SO and I begrudgingly ordered the Angus burger ($16) and a cup of their clam chowder ($8). The burger was good and the side of fries were crispy. I thought the clam chowder was kind of bland, but the texture and portion was decent. \n\nAftering ordering and before our food even came, they asked for our card to start a tab, even though we didn't order any drinks. They said it gets way too busy and they needed to keep track of customers. We told them to just close out the tab.\n\nService was good in that they always kept our water refilled. The waiter even brought us a whole pitcher of water since we were drinking so much.\n\nI'd love to come back and try their oysters during HH. One day!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-02", "description": "I visited on a Friday evening, the place was half full... but very noisy. Not impressed with the service and the food. Before I even finished asking for food and drinks, I was asked for my credit card to keep the tap open. The waiter could have at least waited until I finished ordering.\nChowder was ok, too much celery in my opinion. Oysters were nice and fresh. \nOverall, ok... but there are much better bars in the area. I will not come back.", "author": "Juncal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Best Oyster Happy hour I have been to in 25 years.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Been here a few times for drinks after work. It's conveniently located about 5-10 minutes away from AT&T Park, and there always seems to be some seating during happy hour. Seating can be very limited though, so if you aren't comfortable sharing a table or sitting at the bar, this isn't the place for you. They have a decent selection of draft beers, but this bar is a bit more upscale with a nice menu of actually good bar food. We got some meats + cheeses and fries that were gourmet-tasting.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Cocktails and oysters. Lively and friendly vibe. Great food and even better drinks. What more can you ask for?\n\nPre-Giants game the whole AT&T Park area is crowded, and we were lucky to still get a table here. Our attentive waiter took great care of our group and brought out a tasty Clam Chowder ($8), a dozen oysters ($33), and French Fries ($5). \n\nThe real gem here are the drinks though: nicely crafted, we got the boozy Dreams Old Men Dream (Manhattan, Negroni, Old Fashioned combined, $12), the Snake Bite Kit (Mezcal, Tequila, Galliano, $12) and the Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters, $12).\n\nDefinitely a great pre-gamer. Will be back for more.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-24", "description": "Oyster, beer, oyster, beer and repeat. I have been here for many happy hours because it was right below us.\n\nOysters are very fresh with decent drink selection. Perfect place for happy hour!", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "In an area that's ruled by pubs and sports bars due to its proximity to AT&T park, I squeal with delight that Lord George broke the norm!!!\n\nThe wonderfully crafted cocktails spiked my curiosity -- which is hard to do nowadays -- since I'm a well researched cocktail aficionado. Another thing I really appreciate is, when a bar spends money ($$) in their glassware. Reed thin coupe stems, gold etchings on the glass,um can you say sexy stemware?! RAWR. \n\nI had the 2nd Street Shim with cocchi americano, grenadine, bitters and sparkling wine. The description on the menu was spot on: perfect with afternoon oysters followed by a long night. It's an easy drink to start with and goes really well with those creamy, briny mollusks if you're looking to pair it with something other than bubbly. As a second/third/fourth drink (and you will have consecutive ones, since everything is so damn good!) you can go by route of simple vs. fancy cocktails as stated on the menu.\n\nThe Constant Gardener has calvados, dry white port, Amaro montenegro, grenadine, celery & chocolate bitters garnished with a flamed grapefruit zest. I love that even though this cocktail tastes boozy, all the ingredients are on the lower end of the proof spectrum so you can imbibe and not be trashed while still giving you those savory and complex flavors. \n\nThe Dragon's Blood made me smile! there must bartenders in the house who are G.O.T. fans! Genever is a \"softer\" style gin and the vermouths mixed in this drink plus the grape molasses, actually make this dark drink on the sweeter side. It's a nice chaser after having their bacon clam chowder ;-)\n\nIf you stop by on non-game days, the best oyster deal can be had on this side of the street. $1.50 oysters from 4pm to 6pm! Check your oyster board for the daily specials. The oysters I ordered were fresh and grit-free. I like the Marin Miyagi and Buckley Bay from BC. Even at the regular $3.50 price, I'd buy these over and over again. But like my friend said, they taste even better at $1.50!\n\nCome early and come often because this place fills up quick. I'm not surprised since where else can you drink like a Lord on this side of the park? \n\nGO GIGANTES!", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "If Yelp had a feature that allowed responses to reviews, I would respond specifically to Bruce P.'s. We were there the same night and time, and while they might have experienced slow service, it doesn't warrant Lord George getting a 1 star. This was right after the Giants game so it was pretty steady, and keep in mind this is a specialty cocktail bar - good cocktails take time to make. \n\nThe oysters are great and there's a nice variety. Certain oysters are $1 are the weekends! We also had the avocado toast and the smoked salmon, both very good. The avocado toast came with a burrata cheese on the side topped with kalamata olives, cherry tomatoes and sweet corn. It was a delicious topping, and I appreciated that it was on the side so it gives you the option of using it as a topping or not. Since we were just at the game, I stuck with beer and didn't get a cocktail, but I could tell the quality of the cocktails just by watching them being made. The bartenders were doing the best job they could, and were friendly. Will definitely be back.", "author": "Lynne H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-15", "description": "My friend and I got there around 8:30 after a few drinks from another place.  \nWe wanted somewhere that served good drinks and decent food. \n\nI got a cocktail, which is pretty good. \nThe food was just okay.  The tuna tartare was so different.  It had cucumber and avacado in it.  I guess that's not what I expected. The duck rillette was just okay.  The burger was probably the best. Very juicy.  I probably will go back for drinks only.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "Came here for happy hour thinking they would have more on the HH menu.  However, it was only a selection of 3 oysters that were discounted.  As we're making our rounds around SF for HH, we'd likely not come back here again.  At least not for happy hour.  As a place for drinks, there's just not a lot of space to eat/drink and hang out since it's all high top bar tables and no real seating to have a meal.  Maybe a good place to grab a drink, but not too much more than that.  We were in and out in 30 minutes and on to the next place.  \n\nkudos for having Kushi on the menu though...but not on the HH menu. :(", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Classy little pub, great oyster selection and 1/2 price on a couple over the weekend. Good bloodies, pretty and had a good flavor, although a tad thick for my personal preference. Warm olives were delightful and the oysters we ordered came w/ 3 different sauces. My husbands drink, \"Advice From a Caterpillar\" was complex, truly an interesting drink. Had a smoky aroma but lighter, citrus flavor. Well done Lord George, well done.", "author": "Lauren E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "Went to this place on a Friday afternoon at around 5:30. We just ordered some oysters and a beer each. Everything was decent, with a fun artsy, kind of grungy chic aesthetic, with prices about 25% higher than desired.  The bartenders were nice and there was free wi-fi which is a plus. Overall I was content. I'll have to return to try more of their menu before I can give a longer, more extensive review.", "author": "Quinn Li O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Stopped by Saturday around 6:30, and there was no wait at all. They happened to have a weekend deal for half off oysters, so we of course had to try them!\n\nHonestly don't know too much about raw oysters and the different regions they're from, but the oysters they had were fine, though if you like creamier/more buttery ones, the ones I tried don't fit that descriptions.\n\nIn addition to the oysters, I also ordered a clam chowder. The portion size was decent and it also came with toast. There was a good amount of clams in it though the chowder seemed a bit thinner than most that I've had, but it was still quite good, and having toast on the side to dip into it was nice.\n\nBased on the menus, it seemed like this place would be good for drinks, but I unfortunately did not order any so I can't comment on those.\n\nI got a stomach ache shortly after eating here, but it's probably because I have a weak stomach as other people in my group also had the oysters and the chowder and were fine after.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Met up a few friends for Happy Hour at Lord George last Wednesday, May 4th a little before 6pm. HH is Monday through Friday, 4pm to 6pm, so I had my friend order a HH item before I got there. He arrived around 5:30pm to snag a table as I wasn't sure if I was going to make it in time for HH.\n\nHappy Hour: Mon - Fri, 4-6pm\n*Half priced oyster of the day: Fanny Bay, BC ($19 for a dozen)\n*Beer: Carlsberg ($4)\n*Wine: Cava ($7), Rose ($8)\n*Cocktail: John Rose - rye, apple brandy, grenadine, lime, bitters ($8)\n\nI wanted to try the oysters, so we got a dozen HH oysters. They are half priced during HH, so they were $1.58 each making them $3.16 at full price. The oysters were crisp, creamy and clean with a nice briny flavor. My favorite way to eat them was just with some lemon and hot sauce. My friend got a HH beer and I got a HH cava. Though they charged me for a Rose which I didn't notice til after we left. Oh well, it's only a dollar difference.\n\n*Rye Manhattan: rye, Italian vermouth, bitters ($12) x2\n*Carlsberg ($6)\n*Money For Nothin': bonded rye, reposado tequila, pineau de charentes, ginger, grapefruit, lemon, walnut bitters\n*Nikka coffey still ($14)\n*Cobra Kai: Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters ($14)\n*Highland park 12 year ($14)\n*Springbank 12 year cask strength ($15)\n\nWe spent a good two hours at Lord George, so I needed some drinks! I love the rye manhattan. It was nice and strong and not too sweet. After that, I just stuck with straight ours. I wanted Oban 14, but they didn;t have it. So I got a highland park 12 and nikka coffey.\n\n*French fries ($6): meyer lemon aioli\n*Ham & Cheese ($13): prosciutto, gruyere, egg\n*Clam Chowder ($15 bowl): manila clam, bacon, toast\n\nWe got a couple snacks as well. I only tried the clam chowder. I really only wanted a cup, but a friend of mine wanted to have some as well so we ordered the bowl. This bowl is huge, so unless you want A LOT of soup, a cup should be fine. It had a nice savory flavor due to the bacon and lots of clams, but it was a little too salty for me. And I love salty food!\n\nGreat place for HH. If you can make it by 6pm, order the HH oysters! That and a glass of HH bubbly and I'm a happy girl!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "The have a great Saturday Sunday all day oyster special. However we, my wife and I came in right at 4:00pm on a Monday sat relaxed ate some very good avocado toast, I love burrata, proceeded to order one dozen of the happy hour oysters until we had finished 4 dozen.\nThey were clean cold and crispy, the fanny bay oyster are what is the happy hour oyster and we thoroughly enjoyed them. \nLord George was quite a find.", "author": "pua R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Such amazing service! The waiters are attentive, so kind, and beyond diligent. \n\nCan't recommend Lord George enough. Shout out to the man bun server! \n\nNEW FAVORITE PLACE ALERT!", "author": "Amina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "My new go-to happy hour spot! Inside is very clean and bright, I love the layout, it's definitely a good place to catch the game.\n\nWe ordered:\nOysters + Prawns: It was all very fresh and prawns were juicy! You can choose from different oysters, they have 3 different kinds, so we get four of each. Delicious, I prefer the big oysters. \nThe Broads: SO good, definitely a good snack to munch on. You can mix and match. The meat inside had bits of pistachios, and cheese was super smooth and carrots were yummy with their green sauce!\nBloody Mary: Some of the best blood mary I've have had, it's not too strong and has a great kick to it! Loved it.\nCobra Kai: Delicious and fruity. It had hard liquor in the recipe, but you can't waste it at all.\nFries: Thin and crispy and fresh out the over.\n\nOverall, love this place and service was great, the bartenders are super friendly and has great recommendations!", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "Stopped in for a cocktail and light snack. The chowder with bits of bacon and sourdough bread was really tasty. The first bartender was so soft spoken, I could barely hear her. Another bartender took over and he was on top of checking on us. I got the Cobra Kai cocktail that sounded really interesting, but it was just kind of meh. I've had better hand crafted cocktails at other places, so that's why I'm giving this bar 3 stars. Definitely a cool ambiance though and lots of people were ordering oysters.", "author": "Caitlin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "4.5 stars. I love oysters, and I love happy hour. Put those together, and you get a post-work visit to Lord George! My friend and I sat at the bar and ordered oysters, fries, and a few cocktails. Everything was delicious. The oysters were pretty big, and the cocktails were strong. I love the vibe of this place. The bartenders were friendly, as were the other customers here. Everyone is just here to have a good time. Not much else to say, other than how much I look forward to coming here again!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "I love this place as an alternative is to just drinking beer in a loud bar. They have good wine and cocktails by the pitcher! Went here during a Giants game and they have a great happy hour deal depending on what inning it is. And $1 oysters!!! \nService was good but when they got busy they messed up our bill. So be sure to check it!  They were super nice and apologetic when I pointed it out. Comped is a drink while we waited for it to be corrected.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "What is not to like about this place?\n\n+  Excellent happy hour\n+  Quality oysters\n+  Charcuterie\n+  Craft cocktails\n+  Small batch brews\n+  Decent wines\n\nWe ate and drank our hearts content during happy hour, and it came out to about $40 a head.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Trendy, fun, chic and a great spot for Happy hour. The fries are amazing, my friends loved the oysters. The neon sign is also fun and good IG fodder.", "author": "Sandip D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "Good food, nice spot, but the service is terrible, these kids are in a bubble and ignore you, at best. Management needs to step up", "author": "Rafael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "came in here to the end the night with one last drink and I was not disappointed. Ordered off of their special rotating menu and everything was great! I got the cactus cooler which was delicious, refreshing and the perfect summer cocktail! Will definitely be back to try more.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Lord George is a cute cocktail bar by South Park. I've been there a few times and it works. I haven't tried the oysters but I expected more from the rest of the menu. The tartines were difficult to eat and looked better than they tasted.\n\nThe shape of the space is long and narrow, not my favorite layout. On the right hand side are tables for up to 6-8 people. Essentially all of the seating is on high stools. It's not very comfortable for sitting for long periods of time and I wish they had more seating designated for parties of 2 so that you don't either have to 1) sit at the bar, or 2) sit at a large table and hope that no one comes to share the table with you.\n\nThis is one of the better options if you're in the area for a game. But if you're looking for a nice bar to take a girl out on a date, go somewhere else.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-10", "description": "This place has changed a lot. Used to come before Giants games for the decent happy hour, now they took it all away. We still decided to stay which was a mistake we waited 45 minutes for oysters yes 45 minutes. When they came out they were just ok. They only apologized a little and did nothing to make their mistake correct. I would save your hard earned money and spend it elsewhere", "author": "Richard W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-18", "description": "Lords George is close to my work and has oysters on the happy hour menu, that means get here before 6PM. The food is pretty tasty and there's a great cocktail selection; but apart from happy hour, nothing too special and super inflated prices in which you are obviously shelling out for the convenience of walking here after work a stones throw from the ballpark. Fries, oysters and 2 glasses of wine was over 70 bucks after tip. \n\nWaitress gets 10 stars for being super friendly and personable even though they were moderately busy. I'll be back for the great service and the convenience. It's pretty loud in here so don't bring a date for the first time unless you like yelling at your dates.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Fantastic food! Lots of delicious options. We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. AH-MAZING. We will definitely be back!", "author": "Alexis N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "My coworkers and I were \"going up on a Tuesday\" (did I use this correctly? I don't think I'm as hip as I used to be...) at Lord George since it is conveniently located a block away. It definitely reminds me of a smaller and more mature looking Southside Spirit House.\n\n5pm on a Tuesday, the whole place was packed. Crazy! I guess everyone had the same idea as us. Although it says they don't take reservations on Yelp, a few tables in the back were reserved. They have 2 TVs, so yay sports!\n\nHappy Hour (4pm-6pm):\n- 1/2 off oysters (oysters are normally $3)\n- $4 Trumer\n- $7 cava\n- $8 rose\n\nTheir beers on tap are around $6-8, and they have my second favorite beer (Black Butte Porter)! Simple and fancy cocktails cost around $10-13. The difference? The fancy cocktails have a few more ingredients than the simple ones. \n\nRecommendations:\n\n- Cobra Kai ($12): Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters. \n- Gold Rush ($11) bourbon, lemon, honey.\nThese two are very popular! A bit on the sweet side.\n\n- Oxford Comma ($13): armagnac, aged rum, French and Italian Vermouth, grenadine, bitters.\n\n- Snake Bite Kit ($12): mezcal, tequila, Galliano, grapefruit, lime, bitters.\nThis was very easy to drink. A bit too light for my taste!\n\n- Dreams Old Men Dream ($12): Manhattan, negroni, Old Fashioned, combined!\nThis dream sounds like the dream! Smokey and overall a great drink!\n\nBesides drinks, they also serve oysters and food. The food items are definitely on the pricey side, and they're not full meals, just light bar bites. The bartenders at Lord George seem like the cool kind of bartenders you want to be great buddies with! \n\nCheers to new and awesome bars!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Dinner review. \n\nChowder - 3/5\nTartare - 4/5\nHam and cheese - 4/5\nSteak and potatoes - 3/5\nFries - 3/5\nOysters \nGood cocktail list.\n\nOverall, \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Delicious oysters and charcuterie / cheese boards! I love the seasonal drinking menu too. This is convenient and close to my office. Great place for team happy hour!", "author": "L F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "I love this place. It's vibrant yet laid back at the same time. \n\nGreat food and great drinks. \n\nOrder the oysters, you can't go wrong. The clam chowder is great too!", "author": "Laurina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Great time with friends... quick bite to eat before going to AT&T park. Location was perfect for walking distance. Food was good service was fast and friendly. The oysters are now a favorite...", "author": "Monica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "+ Good cocktails\n+ Good seasonal soup\n\nNot worth going out of your way for", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Really great place to grab brunch or drinks.  On our visit we had beers and an amazing 30 piece charcuterie  plate.  The soft cheese was amazing!  It was shared among three people and we had no trouble finishing it all.  Kind and friendly service and would definitely come back.", "author": "Nyla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "Only had two drinks here with a side of fries. For the most part this bar was cool. The dude helping us out though forgot to bring water on two separate occasions, after being asked. Definitely recommend the minted mule that drink was amazing", "author": "Steven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Great bistro style bar. If you go a little later (post the after business rush) the place is quite comfortable with a good vibe and service. Definitely try the ham, cheese and egg sandwich. Chef Matt makes sure it is cooked to perfection. Toasted so it's slightly crunchy outside and chewy inside. Awesome! Pair with Dream of Old Men and you are set for the evening.\n\nCheck'em out.", "author": "Denzo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "Came here for happy hour (M-F 4-6pm) around 530pm and was pleasantly surprised to find that it wasn't insanely crowded like most bars during the post-work rush. My friend and I ordered a dozen oysters, which were about $1.75 each after the HH 50% off, and all four of the HH drinks (I guess we were a little thirsty? LOL). The oysters came out very slowly - we were almost done with our first round of drinks before they arrived, but they were pretty big and juicy so that made up for it. The cava sparkling wine recommendation is on point! The rosé wine wasn't as sweet as I expected, but not bad either. I liked the Carlsberg beer, which was a pretty light lager, but thought the daiquiri was a little too acidic for my taste. Props to them for making a strong drink though!\n\nYou can sit at either the bar or a table, but there are probably less than 50 seats total; one group actually asked to join our table because there were no other seats available. The atmosphere here is more chill and quiet compared to bars closer to downtown/FiDi, but it's nice to be able to converse with your friends at a normal speaking tone. It is a little on the expensive side, as my friend and I each paid $30, so I probably would only come for HH. Parking in this neighborhood is horrendous as expected but the bus is only a couple blocks away. The storefront doesn't have any identifying markings aside from \"wine and oysters\" but it's definitely a nice place to check out if you're looking for a more lowkey post-work hangout spot.", "author": "KC W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Love this place.. Needed a chill spot for my girlfriend and I's last night in SF and we were in luck! Great beers and even better oysters.. staff is super knowledgeable and can make recommendations according to your taste in oysters! Definitely coming back :)", "author": "Justin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "Oysters were kinda small and they were half off on happy hour so it came out to be about 1.75$ a piece, not really worth the value :/", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Great Charcuterie tray, delicious signature cocktails. Dark inside, ambience is nice. Great for chilly day. Highly recommend the French 75 and Moscow Mule. I would definitely revisit again. They have a great happy hour with oysters as well.", "author": "Kristen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Great low-key place for grabbing drinks with friends in the area, which is otherwise a bit lacking. There's a good selection of craft cocktails and wines, as well as assorted bites such as charcuterie plates and tartines. There's also an oyster bar, with great deals to be had during happy hour. The interior feels pleasantly casual, and the staff are all friendly and personable as well.", "author": "Oliver L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "My boyfriend and I like to come here occasionally for drinks and small plates. They usually have a pretty fun cocktail menu. I remember coming once during an Alice in Wonderland theme period. They served a cocktail in a tea cup! Super cute. We have been happy with their cheese and other snacks. Never overly crowded (though we haven't been late at night).", "author": "Susan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "A friend and I stopped here on a whim for a drink. I have to say we were pleasantly surprised to say the least. We came in right before the bar was about to close but the bartender was very accommodating and made us drinks. The drinks were out of this world to say the least and I wish I could have tried more.", "author": "Angela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "4 stars for your yummy, yummy oysters! Thanks for not skimping out on the portions. Yes, some of them were tiny, shriveled, little puked-up-lookin' pieces of animal. But hey, most of them were a mouthful! :3 Definitely satiated my cravings. \n\nKnocked off a star for the spoilt cabernet sauvignon. I thought I hit a jackpot when they filled up half my cup (chu know those establishments that give you that taster sized cup of wine lol). But alas, twas because it was no bueno! :( \n\nI'd go again though. Their lemon drink with bourbon or whatever the hell it was with that spicy kick to it was pretty intense- a must try, I'd say.", "author": "Andra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "A relatively new addition to SOMA and the ATT Park gateway, Lord George is very welcome in my book. It's a much needed elevation of craft cocktails, oysters and charcuterie boards in a neighborhood surrounded with beer bars and baseball pregame spots (not that there's anything wrong with that). \n\nFormerly NOVA (a diver where I used to drink branca and coors light before Giants games), I'm fully behind this concept as the space is better utilized and more people can enjoy the plethora of options behind the bar. \n\nHappy Hour (4pm-6pm) is legit. \n\n- 1/2 off oysters \n- $4 Trumer\n- $7 cava (spanish for sparkling wine/champagne)\n- $8 rose\n\nA toast to the new kid on the block!", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-27", "description": "Charcuterie board here is huge if you get the 5 option for $30. The opened face sandwiches were decent. Nothing amazing. Cocktails are strong and tasty. The drinks were definitely something I'd come back for. The happy hour is only on a few things. If you like oysters, this place is good for happy hour as they are half off.", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "Can't go wrong with happy hour dollar oysters! They were very fresh and delish! They usually offer at least four different kinds. Generous portions for the clam chowder and it tasted very bacon-ish. I'll recommend to order less or one dish at a time to avoid wasting food.\n\nNo reservation needed on weekdays. The girl waitress seem confused and a bit slow. Try to sit at the bar for better service.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "Went here before when it was called Nova and its remodel looks better. Oysters are really good but really expensive. For miyagi oysters it's $3.50! Cocktails were good but my fav was pretty damn high. Guess I'd do anything for oysters!", "author": "KB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Their cocktail menu is off the chain, and their bartender was super nice. Best thing was, that place was pretty empty on a Sunday afternoon so we could just waltz right in with a group of ladies and snag a table. Yes, their cocktails are expensive but they're interesting and intricate and this is San Francisco.\n\nAlso, oysters.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Drinks are stiff and oysters are on point! I can say I thoroughly enjoyed the assorted oysters we ordered while sipping on my drink waiting for my family to meet up. The bartender was very attentive and nice. Prices are just right and not bad at all. Do yourself a favor and get yourself a tray of oysters and enjoy some drinks here.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Lord George!! Trendy bar with a great setting. Seating at the bar or at one of the high tops. We went on a Saturday evening, around 6:30 and there were only a few people there. Then again, who eats at 6:30 in the City on a Saturday night?!\n\nOur server was friendly, courteous and helpful. We had a dozen of assorted oysters, fries, duck confit Tartine, steak & potatoes Tartine. Their Tartine is an open faced sandwich. Lord George's specialty drinks were infused with lots of flavor. I had the Cobra Kai and my GF had the Trampoline Jack. They had other specialty drinks that sounded interesting but I will save that for another visit.\n\nI mentioned no HH on weekends but they do have HH Mon-Fri from 4-6PM but not on game nights. AT&T Park is a few blocks away. Good place to have a pre game drink. Great for groups.\n\nThe only complaint I have is that they charged us a SF Mandate fee.  I understand why they have it but if they embedded that charge in the price of the food, I wouldn't be that bitter about it. Lol!!", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "***************************** 1452 ***************************\n\n  After our training for Saint Emilion Bordeaux wine down the street, we wanted some happy hour. We turned to Yelp, and boom, Lord George showed up at Hot & New. We stopped in.\n\n  What a nice surprise by the cute barman Adam, he recommended my friends some cocktails and both was solid. He surely took the time to shake it up nicely. He was attentive, nice, and seems truly enjoyed what he's doing there. \n\n He also recommended us the corn soup and the HALF OFF oysters during 4-7 PM happy hour. While I enjoyed the classic Champagne vinegar mignonette sauce, my friends thought the modern ponzu with onion was their things.\n\n Small menu, a few salad, soup, sandwich, cheese, charcuterie, and oyster. So if you are looking for a real meal, this is not the place for you. However, it's a perfect spot for happy hour, good cocktails, attentive service, and a good place to hang out. I'll be back!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Fun spot, delicious oysters, and great meat, cheese, and veggie boards. It's first come first serve seating, and you seat yourself, so it can be tough to get a spot during happy hour. The cocktails also looked great, but I didn't try one. The rosé was on happy hour when I was there, and it was delicious. The ouster shucker smelled each oyster before serving them, which is probably why each of our half dozen oysters were delicious. Our server was kind of off, couldn't really understand her. She was nice though! There are tvs but we had to ask for the Sharks Stanley cup game to be played, the crowd wasn't too into sports.", "author": "Mollie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "Because 21st Amendment is always packed... Lord George ups the ante with great classic cocktails with a twist, oysters and finger foods. \n\nThe service runs a little slow if you are at one of the open tables, especially when busy. But if its slow and you're at the bar, service is top notch. \n\nThey do serve coffee, even though its not on the menu. The chef recommended cheese and meat platter was delicious. Drinks were strong and had great profiles. \n\nIf I'm ever in the area, would definitely love to come back for their happy hour!", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Came here for a quick bite, a little happy hour, and a tasty cocktail while I was showing a friend from NY around SF.  \nBoth of us loved this place, the bartenders were attentive and quite chatty, him and the bartender actually had oodles in common.\nThe oysters were delectable and the drinks were divine, I would definitely recommend this place for happy hour. I could also see myself coming back here for a full meal or to grab a drink+bite with some friends while watching a game of sorts.\nOverall it was quaint, had a great location, and the service was pretty stellar.  \nSee you soon Lord Gorge!", "author": "Sara N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "This is my and my happy hour crew's go-to place when we're hankering for a drink. The bartenders are fantastic--super friendly and patient, even when it's crazy busy. The minted mules are YUM, and they make two versions: one with vodka and one with bourbon. Their fries are fried to crispy perfection and served with an amazing garlic aioli (and I normally don't even like aioli). \n\nAlso a great place to people watch. :) BRING ON THE EYE CANDY!\n\nUPDATE (12/8/2016): I also love their Manhattans. :D", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Went here recently after a Giant's game and had great oysters. They were a good price, really cold, and fresh. The only downside to this place is they aren't open for lunch M-F.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "Cocktails - solid place to grab a cocktail. The menu of drink options is great and their execution is as good as it gets. \n\nI look forward to returning for oysters and food.", "author": "Darin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "What a great place to hang out! Went on a Tuesday at around 3pm (pretty empty) and left around 8 (place was packed by then). I would like to give Adam a shoutout, thank you for making sure I had a great time and for taking care of me and Shaina during our whole time there. \n\nAll of the other bartenders were equally as great, always attentive and friendly. It's a great place to hang out with a group of friends or even for a fun date. They have great background music. Place is casual, they take their service and food very seriously but not themselves! Definitely will be back!!!!", "author": "Cristal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Kim and Adam / \"Reggie\" are two exceptional reasons to go here. You'll see them in many peoples location photos at LGs for a reason. they make this place more like a neighborhood pub than a bar/restaurant. Too bad people don't walk SOMA much on weekends or interact with their neighbors. If they did, this place would be a second home.\n\nThe food was almost as good as the service (and the food was 5 stars), especially the duck and the oysters. Can't go wrong there.\n\nGreat beer selection, drink creations (i lost track) and they had the game on. It's a long thin space though so if there's a game you really want to watch, be sure to be positioned right in front (and arrive early).", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "A perfect happy hour spot during the week and with great service! I arrived here around 5:20pm, and it was pretty surprisingly empty. I did a 360 degree observation of the crowd once we received our food around 6:15pm, and the place definitely got crowded, really quick. I do that from time to time since I love people watching. But if you're someone like me, I guess you get used to the 1-2 hr waits and standing around in the bar section for a good 30-45 minutes.\n\nHH was a bit pricier than we expected and would not recommend this spot if you're looking for a full meal... but the oysters really fresh and the craft cocktails were delicious! The smallest oysters ( I forgot the name) were my favorite, and I just couldn't get enough of the Cobra Kai ($12). Had to order it twice, back to back. The charcuterie plate was also one of the better ones I've had and was huge! \n\nOverall, I enjoyed my experience here and would come back if I wanted a quick bite and/or drinks. And as they say, drink like a lord!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "If I had the skill and temperament to open an establishment it would be LORD GEORGE.\n\nThis place is in a class of its own. I don't have the bar history to give a great comparative review, but there is something special about the way this gastropub carries itself.\n\nIt is warm and inviting with a modern and masculine twist.\n\nThe drinks were awesome! The fries were awesome! The oysters were awesome!\n\nEven the bathroom is awesome!!!!\n\nI have to come here a few more times though to make sure the experience and service are consistent. You know how all that new hype works. The drinks here are top notch and really worth a try.\n\nThis is a place I would go out of my way for.\n\nI dream of Cobra Kais and Gold Rush's now. \n\n(p.s if you have the extra dough and it is deserved tip the oyster man - he is just awesome and shucking there all day and the sun tends to reside right above his station - or not - live your own life! LOL)", "author": "Niana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Highly recommend the oysters! Very fresh and tasty! I saw George, he has many stories to tell!", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "The bar area has a polished quaint charm serving a wide variety of cocktails and range of spirit choices \nFood wise, they offer fresh seafood and typical bar staples\nDrinks are made well with a strong finish \nSeating can be challenging when it gets packed \n\nOverall Thoughts\n\nA great bar to sit down with friends over drinks", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "This is right next to my fav nail place, za za. I love the green goddess salad. It's so good. Of course drinks are never a bad idea either !  Fries are amazing.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Went here to grab drinks and some oysters with my gal pal and the service was amazing! GIna was soo sooo kind and we are actually trying to host a party there for our company!\nThe place has good vibes, good drinks, and wasn't insanely crowded at the time we went so it was nice to have that time.\n\nCan't wait to go back.", "author": "Bori B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Solid bar. I ordered the French 75 New Orleans style (cognac instead of gin) which tasted really good I was happy. Then we ordered the French fries with garlic aioli sauce which was good. Wish the portion was a little larger but they were delicious. Our server was very friendly and had great memory with our order. Nice space, will be back again someday!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Stopped in here for a drink and was presently surprised by the atmosphere, service, and drink selection. Might be a bit premature to give it a 5-star rating after only spending 30-minutes inside, but first impressions are everything. Right?\n\nI'm a big Old Fashioned connoisseur. So naturally, when I saw a drink that encompasses an Old Fashioned, Manhattan, AND a Negroni, I was intrigued! And, I wasn't disappointment - it was yummy.\n\nThey also have a raw bar and a really good looking charcuterie (you can select what you want as well - cheese, meat, and veggie options).\n\nCheck this place out, I think you'll be a fan, too!", "author": "Derrick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "Closed even though all web resources indicated that it was open.  Hours not posted at restaurant.  Very disappointed!", "author": "John N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Much needed spot by the ball park. Classy & inviting location with friendly & knowledge staff. The Lord George has great spirits and a growing food menu. Oysters, shrimp cocktail & french fries for the soft opening...yes please!!  Great for groups, work outing or a date.\n\nI hear they'll have brunch too ;) \n\nI'll be back for the Grand Opening next Thursday!!", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-24", "description": "Listen, I'm probably being nitpicky here, but if you're going to advertise half priced happy hour oysters, I don't think it's too much to ask for your bartender or your signage to dictate which oysters are exempt from the special. Happy to pay full price, just let me know in advance so I don't feel swindled.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "This is only a review of the cocktails, but in a city where craft cocktails are abundant Lord George just doesn't quite make the cut.  I had the Captain Deathwish (cognac, aged rum, curacao, campari, citrus, cinnamon, chocolate, sea salt) - Sounds incredible right?  Well unfortunately it was off balance - the curacao was way overpowering.  I got a hint of chocolate in the finish but otherwise could not detect any cinnamon or savoriness from the sea salt, and frankly the curacao just ruined instead of complemented the otherwise good spirits.  My friend ordered the Federal Sword (rye, calvados, ginger, lemon, almond, caraway, bitters) and it was definitely better than my drink - I liked the ginger.  But unfortunately I'm still not particularly keen on returning.", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Good bar with food. Went early Saturday afternoon and it was pretty quiet since Giants played at night. Nice raw bar and oysters were half price on Saturdays; great deal. Drinks looked interesting but we had beers. Nice selection. I liked the Modern Times from the San Diego Brewery, Fortunate Island. Good clam chowder. Fries were good but nothing special.", "author": "Bob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "This place is a little pricey for the selection, but the quality is good. The drinks were yummy, though maybe slightly watered down in the fancifying process. The oysters and sauces were delicious and the avocado toast was not too shabby. We had hoped for a little more mischief, as advertised in the window....Maybe next time? \n\nMusic was fantastic-90's R&B made it all worthwhile!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "5 minute walk from my apartment, half off oysters on Saturday & Sunday, plus burrata served with avocado toast... omg. My new favorite place! Oysters were SO fresh. Thank you Lord George!", "author": "Madison F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Need a classy spot for cocktails and tasty apps before dinner? Or maybe you need the perfect post-work happy hour hangout? Well, my friends, Lord George is the place you seek. This chic cocktail bar is exactly the type of spot we were hoping to find for celebratory cocktails upon first arriving in San Francisco for a 5 day vacay. We thoroughly enjoyed our specialty cocktails and talking with the bartender about San Fran's finest spots. Our charcuterie plate satisfied us thoroughly, tiding us over until dinner down the street. If I lived in SF this is where I'd be all the time!", "author": "Carlie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "Great beer selection, amazing clam chowder and attentive service. Highly recommended!", "author": "Joseph K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Cocktails, Oysters & Mischief. I stumbled upon this place and decided to give it a try and I'm so glad that I did! The oysters are half off and weekends and are absolutely delicious. I also had the smoked salmon which seemed small at first but was ultimately satisfying. The bartender was nice and very knowledgeable about the oysters on the list", "author": "Eliza J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "Love their drinks, they are YUMMY! and they are one of the very few places that still serve my MULE in copper mug. The services was tentative and not pushy. My friends and I order food as well. Small dishes but good enough to tie us over until the next gathering. We had soup and salad because that Friday night was chilly. The atmosphere I love, roomy and not to dark or bright. Great location.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Came here for a office holiday party last week -- the bartender was wonderfully nice and lovely and the cocktails drinks were the TASTIEST I've ever had (I couldn't taste the alcohol, but they definitely had an effect on me).\n\nOysters and food were great -- definitely the best in drinks and food in a bar I've come across. Was extremely impressed.", "author": "Florence T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-07", "description": "We were in right at opening on a sleepy Saturday. Had some nice oysters and sauv blanc. A few shell shards due to some hurried shucking. All in all, it was just what we were looking for. Check it out.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "The blackberry Moscow Mule is to die for!!!!!!  Classy yet laid back vibe. Friendly bartenders!", "author": "Beth F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Came here for a late Sunday lunch. Usually I'm skeptical of bars that also advertise themselves as slash \"gastropubs.\" Seems to me like a pretentious way of labeling food that's slightly better than the typical fish n chips and sliders. However, Lord George's food menu deserves whatever added prestige that silly label is meant to confer. \n\nWe had a dozen oysters to start with, sampling all the different types offered. They were all quite fresh and tasty, although I later balked at the $38 price tag (my fault, really, for throwing caution to the wind with Market Prices). I had the Duck Confit Banh Mi Tartine, basically a roast duck open-faced sandwich. The duck was smoky and flavorful without being too dry, but it wasn't actually anything like a banh mi, and it was a bit unnecessarily difficult to eat (I guess I don't understand the point of serving two halves of a sandwich separately, but to each their own). My girlfriend had the clam chowder, which wasn't too salty and had a nice home-cooked taste.\n\nThe beer and cocktail selection has some quirky looking options and I will definitely want to try some other options when I come back. The Jungle Spy is a refreshing gin-based drink that reminds me of a cross between a mojito and a mint julep.\n\nOverall a solid, classier bar with better than average food. I'll come back if I'm hungry and happen to be in the area.", "author": "Terry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Pre-Giants game\n\nWith the crowds growing pre game, I was shocked that we were able to walk into venue and get a table.  \n\nIf you are looking for some of the best craft cocktails, and fresh oysters, this is the place. \n\nDreams Old Men Dream,  Cobra Kai, Rye Manhattan, all stellar\n\nThe freshest oysters, Duck Confit Tartine, and assorted meats and cheeses on a board. All amazing. \n\nI might also add , that service was impeccable !!\n\nThis will be my go to, for any future games or events at the ballpark. \n\nCheers", "author": "Tom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Came here post giants dodger game. It's a classy cocktail lounge in a sea of cheesy sport bars.  If you are looking for an outstanding cocktail without the stadium douche fest, I'm confident you will be supremely happy. My friends and I ordered minted mules and anejo old fashions. Both were outstanding   \n\nThis is my new post game stop. Do it.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Loved hanging out at the spot last night, it had good ambience and the service was fantastic. The cheese plates were amazing and drinks done just right. Adam and his team stepped their game up. I ended up having him come to AT&T ballpark. Im definitely coming back as the service was fantastic!", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Incredible cocktails, really creative menu.  Cocktail menu is inspired by Alice in the Wonderland.  Try the Advice by a caterpillar", "author": "Chris W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-23", "description": "After the change of menu, the prices are not what you'd expect from the old menu. The old menu had filling tartines, now it is mainly just small snacks which are above $12 and you can order a burger for $16.\n\nDrinks are solid with a good selection, but food has went a little downhill from the old menu.\n\nDefinitely would come here for a drink and their charcuterie, but would prefer their old menu for a meal.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Stopped for an afternoon snack. Found it on Yelp. Was a little hard to find but we were walking so it's not like we had to drive around the block for a while. \n\nThe food and service was very good.\n\nWould recommend!", "author": "Renee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "I LOVED Lord George. I wish there were more places like it in Phoenix!\n\nMy boyfriend and I went in to split a bottle of wine before the Giants game. It was quiet but not dead when we went in. People were watching the Olympics but mostly talking quietly. The staff was outstanding: really friendly and polite. Thanks for giving your patrons space! To the guy who risked his life to grab us a fancy ice bucket from over the bar... THANK YOU, and be careful!\n\nReasonable prices for the location. We didn't have any food, but the stuff I did see looked great. 10/10, would return!", "author": "Laura R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-10", "description": "Food is OK, no happy hour on Giants game days but nothing says that on their website or menus. I was expecting a nice plate of 1/2 price oysters but they were $3.50 and $4.50 each which is ridiculous. There are other places nearby that serve the same varieties much cheaper. For a fancier yet more affordable experience and a great view go to the Waterfront.\n\nI had the smoked salmon tartine and the broccolini and they were presented nicely. They tasted OK. My martini was pretty good. \n\nA nice place to hang with friends but I doubt I'll go back.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-24", "description": "A couple of weeks ago, a few of us were looking for a bite on a Sunday evening in SOMA. The reviews for Lord George looked pretty good, so we decided to try it out.\n\nWhen we arrived, the kitchen was closing (so most of the main menu was unavailable to us), but our server told us that there were a few things we could still order. So order we did.\n\nThe charcuterie plate was good. We had 3 meats and 2 cheeses, and added the asparagus to that as well. The asparagus was great. There's no way to screw up cured meats and cheese (unless you offer bad selections), so that was a win.\n\nWe also ordered some french fries to share. They were good, but again, a side dish that's hard to mess up.\n\nI had two glasses of wine, both of which I enjoyed.\n\nTwo of us also order the clam chowder. This is where it went south (record scratch!). Not trying to sound overly sensationalistic, but I've had better chowder out of a can. It was watery with very little flavour, the clams were rubbery (perhaps forgivable since it was the end of the night for their kitchen), but essentially I got a big bowl of potatoes. The menu described it as being made with bacon (as a good chowder should), but instead, we got bacon bits crumbled on top. No smoky flavour in the soup. In fact, no flavour at all.\n\nWe also had the tuna tartare, and to be quite frank, this was the most disappointing tuna tartare I've ever had. The fish seemed fresh enough, but there were too many cucumbers, and the avocado was nowhere near ripe enough. On top of that, there seemed to be no flavour in it at all -- just completely bland (see a theme here?).\n\nI'm not completely writing them off, as I didn't get to try their mains, and we caught them at a time which might not have allowed them to put their best foot forward. But between the lousy chowder and tartare, and the grim, unwelcoming, snarky attitude of our server (don't worry, the rest of the staff were nice), I would have to be pretty desperate not to immediately go elsewhere.", "author": "Yasir S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Great food, staff was very knowledgeable. Their happy hour specials were great and loved the cocktails.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I think this is my new favorite place! One of my friends invited me here for happy hour after work Friday. Of course we wanted to come for the 1.50 oysters. And boy were they good! They were a good size and deviously fresh. We also got the fries and the duck tartine. I thought the fries were also delicious and they duck tartine was good not great. I can't forget about the drinks! The drinks are so yummy. I will most definitely come back here again!", "author": "Eileen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "We had a great experience at an oyster bar in Seattle and was looking for something similar here in SF and this place was the closest thing we found. Although this isn't an oyster bar per se they had 3-4 varietals which were great. Paired with some sparkling water, clam chowder and fries it makes a great oyster bar-like experience.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "The bartender was super SUPER nice, gave us some pretty classy and delicious beverages, and the oysters were fresh and delicious. I did get one oyster that had that hint of meh flavor, but out of a dozen, the rest were all as fresh and delicious as is oysterly possible (see what I did there? you'd better be chuckling).  They offer cocktail sauce, onion champagne sauce, and some kind of garlicky soy saucey sauce for putting on your oysters. It is nice to switch up the flavors a little bit, and the sauces all go perfect with oyster.\n\nThe prices are for hipsters and techies, but the quality is also quite high, and it was a nice place to splurge on some excellent oysters and excellent drinks.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Walked into the restaurant after watching a Giants game.  My wife and I don't drink but were interested in getting dinner here after reading the Yelp reviews about the clam chowder.  There was a small party in the back and people seated at the bar.  Upon arrival, no one greeted us or told us what to do.  We saw a sign that read seat your self so my wife and I sat at a table.  We waited and waited and waited.  Another couple walked into the restaurant and sat at the bar.  They received their drinks as we waited for a server.  My wife and I decided to go to the remaining two seats at the bar instead of continue waiting for a server.  The area we sat at was still a little wet so I asked the bartender to wipe it.  He did not do a good job since there was a puddle of water on my side of the bar.  I asked him if he can give me a towel so that I can clean it.  He gave me a towel and smirked, \"Normally people don't sit at the bar where it is dirty.\"  Was it our fault that we did not get acknowledged on the way in or waited at a table with no service?   Already I am thinking the raving reviews on Yelp was misguided and this will probably be my last time here.  The only saving grace for this restaurant is that the food was decent.  We had clam chowder, kale Cesar salad, avocado toast, and oysters.  The food was quite pricey for what it was.  The oysters were half price because it was a weekend.  The total tab for the two of us without ordering any alcohol came out to be about $80.  During the dinner, the bar lost several group of customers who wandered into the establishment but left since no one greeted them or seated them; one was a big group of 8 people.  As we paid our bill, one of the bartenders came out and put signs onto the tables that informed customers to give their orders to the bartenders to get service.  Here is my advice for the restaurant:  GREET YOUR CUSTOMERS and teach workers to be hospitable (even the people chucking oysters in front.", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Stopped by for happy hour (which ends at 6pm, not 7pm). We got a dozen oysters (50% off), a Carlsberg, a daiquiri ($8 cocktail of the day). The game was running on a few monitors, laidback vibe. Definitely would come back.", "author": "Irene H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "This was our 2nd visit to Lord George. We stop there on our way to the Giants game. Great food and service. Look forward to our next visit.", "author": "Diane B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-12", "description": "Horrible. This place used to be so great. The service here is so, so, so horrible now. I wish I could give zero stars.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Nothing but the best here!!! Awesome drinks, good service, Berto behind the bar is awesome-sauce!!!!! Trampoline Jack is the best drink!!", "author": "Vanessa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "Stopped in for a quick happy hour.  Super friendly staff, Adam our bartender was really nice and attentive.  Gave the place a nice neighborhood hangout vibe, but with a fancier feel.  I say fancier because we ordered cava, oysters, and a charcuterie platter.  \n\nCava was good and on the happy hour special.  Definitely want to try the other items on the charcuterie platter options.  It was really hard just choosing 2 items, but Adam the bartender was also really helpful in giving recommendations on our platter.  Next time, I try the pickled carrots!!", "author": "Janel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "The bartender here is just awesome - he is even pictured in the yelp photos, because he really is that great. A great bartender = awesome drinks, and you can definitely expect that here. Really great fancy cocktails and they served up a decent dirty martini as well!\n\nOther than the bartender/drinks, it was meh in terms of service. The gentleman who brought us our food (2 tartines: whipped avocado and duck confit) didn't seem to want to help with anything, just drop off the food. We asked if the Tartines could be cut into 3 pieces, he said \"they are\" ....they definitely were not. I don't know what is difficult about taking the food back to the kitchen and asking for a couple slices in the bread, but he was not having it. Also, why lie to paying customers? Whatever.\n\nTartine's were tasty - we were fans of both that we selected. I also ordered some oysters, which were very fresh and tasty. I would go back for the oysters alone and not ask for anything that needs extra attention (I'd rather not be lied to by the staff who doesn't want do anything). \n\nOur server was nice, but kept walking away when we wanted to place an order (pretty bizarre). The tasty food makes up for the lackluster staff/service. A cute place if you are in the area and fancy a \"fancy\" cocktail (pun intended).", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Impressive, attentive, generous.\n\nThis a fantastic option for gathering after work with friends for deftly crafted cocktails, huge charcuterie plates, and wonderful fries, all in a comfortable, convenient and pleasant room hitting on all cylinders.  We had a great time and expect to go back soon!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Let me start out with saying I Never give 5 stars. Best customer service I've ever come across.\n\nScrew 21st amendment after/before the game come here! I had one small issue and the bar and the more than exceeded my expectations on solving the problem. \n\nThe drinks were 10 out of 10!!! The food way amazing, far better than any stadium food!  I will be coming back here whenever I'm in town again for a game.", "author": "Justin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "You guys. Holy Cow. \n\nWe liked this bar so much that we went before anddddd after the baseball game. 21st Amendment doesn't have hard alcohol so they recommended that we check out the new place next door. This place was amazing. Definitely more upscale than your typical \"sports\" bar but still not pretentious. Apparently they make all of their mixers and juices in house so everything was super fresh and delicious. I had 2 drinks there, one, the bartender made up just after I told him my favorite alcohol and it was ridiculously good. The bartender, Adam, was so professional, knowledgable and kind. I really hope to be able to come back here again soon because everything was so good. \n\nMy boyfriend is a bourbon drinker and there were so many interesting, hard to find choices on their shelves that he wanted to try. \n\nBUT, I mostly can't wait to come back and try the food! Their menu was upscale bar food with beautiful charcuterie choices and light sandwiches. \n\nHave I made it clear that I really liked this place?", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "What What a cool place. \n\nI don't go often to other pubs. I usually have one place that I go often.   On my way home I stop here.  For a pint.  Place look great.  Staff  are grand.      Well done", "author": "Ford T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "I went with a friend to Lord George on Sunday night and had such a fantastic time! Adam, our bartender, was first of all attentive, knowledgeable and prompt, but more than that, he really talked with us- he made the \"sitting at the bar\" experience the best it could be- you sit there to interact with the bartender right? We had such great conversation and he gave us suggestions on where to eat and drink in SF- two or three we acted on and THOSE were awesome, which just made Lord George and Adam that much more awesome (thank you Adam!). \nAlso, this bar is open late night, with late night food options, which we found oddly scarce in San Francisco. So cheers to a late night option!\nOur drinks were so good we ordered more; the entire experience was so nice we didn't want to leave. I'll absolutely be back the next time I am in San Francisco.", "author": "Kristine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Great ambiance, amazing drinks and awesome workers.\n\nIf you want a place with great snacks and great drinks, this is it. \n\nThis is not a place where you would have a first date. I ended up losing my voice at the end of the night because I was shouting so much with a girlfriend. I would definitely come back once I regain strength in my vocals.", "author": "Tiana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "Adam is a fucking hilarious bartender. Great food and great drinks! Chill music. Just stop in its worth it! trust me!", "author": "Masara V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "We found them on Eater SF. Place was basically empty at 11am on Saturday. The food and service was top shelf considering we were 1 of 3 tables there. The New Yorker was to die for, whitefish salad, salmon, rye, onions, etc. Amazinggh", "author": "Paul P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Right in the heart of SOMA tech district, this bar got the whole package - innovative cocktails and good food. The only drawback is that the happy hour ends really early at 6pm (or maybe it's a good reason to start off Friday early).", "author": "Joy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "totally cool spot. good crowd and excellent bartending! obsessed with their negroni/manhattan/old fashioned combo. and the snake bite. my friends really enjoyed their cocktails as well! we ordered all three cheese and all three meats (boards are deelish), the fries (good) and duck confit tartine (good but messy and hard to eat). i'd come back for sure but i think they overcharged us by a drink or two... :(", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "The drinks are fantastic, as is the food. I'm glad that SOMA finally has a quality pub with decent food. \n\nI would highly recommend Lord George, after only three visits it is quickly becoming a neighborhood favorite.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "I like their whiskey menu but nothing really stands out here for me. Staff is nice and good is okay as well. It's close to work but won't have a great reason to come all the way here. Will give it another try.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-07", "description": "These guys don't not get it. Take care of the neighbors don't BS them when you screw up there meals. When the ball crowd and tech kids are not around you need our business. We do tip well!\n\nThis is the 411. I ordered Streak & Potatoes. Received no potato", "author": "Scott T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Wonderful place. Staff is very nice and helpful and dress very dashing  Food is amazing and extra special for a meal that would just be another meal but they make it much more. Service is wonderful. Couldn't be happier and will definitely be back.", "author": "Ally B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-20", "description": "Well Yelp didn't like my honesty so I'll rewrite my review of this place. The rude service explains why this place was EMPTY on a game day. In addition, every drink we asked for they did not offer. Advice - if you go here - plan to over pay, be treated poorly and whatever you do don't chat with the back of the house staff, they're not allowed to socialize. This was literally the worst bar I've ever stepped into in SF. Don't waste a second here.", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "The Jungle Spy was perfection and you could really taste the lemongrass, mint, citrus, and honey. The Clam Chowder was on point (creamy with lots of clams and topped with crispy bacon).", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "We came here on probably the busiest day Lord George has had with the Super Bowl festivities and Metallica playing.  But they did a great job in serving us promptly and with great food.  We got the charcuterie board which was delicious and super filling.  We also got the duck tartine which had a really good flavor.  Others next to us got the oysters and they looked good too.  Great spot before a Giants game.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "Being a huge Belgian beer fan, this joint was right up my alley.  Craft Belgian style brews up the kazoo!  Funky pub type atmosphere with concrete floors, well used tables and straight back wooden chairs.  Definitely for the serious beer drinker. A bit noisy, but hey, it's Friday night!  I'm told this is a hangout for those who work in the area and I believe it...wall to wall nerds!\n\nService was prompt...waiter asked me what I wanted before my butt hit the chair!  Menu is typical burgers, pizza, and pub food.  Decided to eat elsewhere...too much great food in SF to settle for the mundane.", "author": "Howard B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "They have done a nice job on the new place. I like the tables they have installed - the previous place didn't have one table that was stable. The bar staff was good and friendly and I think the prices are reasonable, too. Nice drink menu and wines/beer choices were more than acceptable. I see Christine S compared it to Southside Spirit House and I agree the look and feel is similar.\n\nSadly, I am not a fan of oysters so some of the thrill of the menu is lost on me. There really was only one thing on the menu well suited for me so if I have a criticism, its the menu choices - they are nice but limited. Its not unusual to sell a burger for $15 these days so just having a burger on the menu would open up some choices for a lot of people. I know its not trying to be Perry's or anything like it, but having some standards (i.e.; fancy burger) would be a nice expansion.\n\nIn the end, I had the \"ham & cheese\" sandwich which was very good, my partner had the whipped avocado sandwich - also very good. \n\nSo if the menu were to expand a bit, I'd say this is the best place in the immediate area. But without it, I'll stop in for drinks, but unlikely they will get much of dinning dollars.", "author": "JX C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "I really loved having Adam as my bartender at Lord George! It should be Lord Adam, not Lord George. ;) He made me such yummy cocktails included Cobra Kai. I cannot remember the second cocktail he made with Bourbon for me. Will ask him about it when I go back there this weekend. Since it was the Game day, Happy hour specials were unavailable. I had no idea. Loved the decor and ambience. The place got filled up quickly. Great, friendly, professional and attentive service with delicious fresh oysters and cocktails. Look forward to going there soon.", "author": "Athena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Total gem. I'll definitely be back x 10. \n\nOysters were on point. The cocktail list and wine selection are both solid. Would definitely recommend for drinks or a light dinner!", "author": "Naureen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Came here after work on a Friday. I had a mojito, but they didn't have flavored mojitos. My co workers had oysters, they were bomb! The bartender was hospitable. Great ambiance for Friday after work drinks.", "author": "Marisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Decided to stop by here after work with some friends and I am now a fan.  All the tables were occupied but there were four seats at the bar open which was perfect for us. The noise level was not excessive and they had a baseball game on the big screen and it gave the place a laid back and sporty atmosphere.  Jason(?), our bartender, was courteous and kept an eye out for us in case we needed anything. \n\nWe ordered drinks first, mine was a Manhattan and it came out perfect.  I got similar feedback from my friends regarding their drinks, a minted mule, a mojito and I forgot what the last one was but I think it was a gold rush. For food, we ordered a dozen mixed oysters and they came out on a raised, iced tray with 3 different sauces (one had soy sauce, one had vinegar, and the last was cocktail, none plain, all altered to compliment the oysters). The oysters were chilled, fresh and very tasty, although we ordered a dozen I could've eaten a 100. We also ordered some fries and they came out great. They came with a side of ketchup and mayo but the mayo seemed either made from scratch or something was added which did not turn out bad at all.  We enjoyed the drinks so much our \"one drink, we're in a hurry\" turned into an \"alright, one more lets get a cobra Kai\" which was a tasty and unique drink that came out tasting like oranges, lemons and chocolate. We will definitely be back! Our total tab for a dozen oysters, fries and six drinks came out to $110 including tip.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "Delicious, strong cocktails but this place is far too loud and far too small for my taste. There is nowhere enough seating on busy nights. Staff is friendly and helpful but I need to be able to hear what the other person is saying and would like to not share a table with strangers. There are many other options for good cocktails in the city.\nBe warned, they don't take reservations.", "author": "Klara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-25", "description": "Several weeks after writing a review, the owner reached out apologetically. Any business where management does its best to improve to make an enjoyable experience for customers gets another star. For this, we are happy to try Lord George again.", "author": "Kiai K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Amazing experience. I love finding little bars with big character and didn't disappoint! The Ham and Cheese is to die for!", "author": "Tate H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-11", "description": "20 of us stopped in for brunch on a Sunday around 11, and they were able to accommodate us pretty effortlessly (5 stars for service and ambiance). I had the baked eggs, which were pretty good (3 stars), but the huge smoked salmon tartine looked even better! Would love to try it next time. I've also been here once for cocktails on a weeknight and really liked the vibe and the fact that it was not too loud so you can easily have a conversation and actually hear each other.", "author": "Jia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Love Lord George! We went very shortly after they opened and received excellent service.  Bartenders were very friendly and took the time to share with us their favorite cocktail.\n\nThe boards are delicious (got the veggie board), and the fries are amazing!", "author": "Melody J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Came here the first time for happy hour, and found a seat at the bar before it got too crowded. They had decent happy hour drink and food specials (oysters, beer, wine, drinks, etc). Prices were reasonable considering the location. Service was extremely quick and friendly, and I never had an empty drink during the time I was there. Would definitely consider coming back again.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "I give 5 stars based amazing drinks they have. The bartenders are very knowledgeable and friendly as well. I would say this place has the best cocktails I had in SF. Thumbs up!", "author": "mona k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Love this place! Great little secret (or not so secret) spot! I just discovered it & already been there lots. Music is great, vegetable board, avocado toast , duck confit Tartine .. So so good! Friendly service! Will be back .", "author": "C A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Go! GREAT Service and bomb food!!! Say Hi to Adam (AKA \"Boots\"), he's hilarious!!! Also, have the chowder", "author": "Melissa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "huge fan of this place! i went here with a couple of friends to grab drinks before a holiday party and it was so cozy. it wasn't super crowded at happy hour on a saturday, but there was a good mix of jolly people on their way back from and to santacon/holiday parties.\n\nactually went again last night, and their cheese plate is BOMB: get the soft cow cheese and the sheep's milk with lavendar rind (not ewenique), and get the spicy salami. YUM!!!! affordable, tasty and cozy, this is my ideal neighborhood bar.", "author": "Reyana F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "came here on a friday night after a wine tasting event and it was somewhat crowded. they were playing great old school hip hop and R&B. service tried to be good but it was just too many people with not enough servers.\noysters were ok, we also ordered the charcuterie board and fries for snacks.\ncocktails were really really good.\noverall a fun atmosphere.", "author": "Marie r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "A friend and I went on a Tuesday night so it wasn't super busy. Really good drinks, friendly bartenders, and non-hipster patrons. My favorite cocktails were the  Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters) and the Snakebite Kit (mezcal, tequila, Galliano, vanilla, grapefruit, lemon, and bitters.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "Good food, friendly. Odd cow smell in the back booth.", "author": "Ona A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Great drink selection and the first place where I've had a John Daly!  The owner's very very cool and he always welcomes my wife and baby with open arms.  Very friendly and great food as well!  An absolute must location to pregame before a Giants game!", "author": "Steve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Checked out this spot last minute and glad I went. Bartender Roberto was attentive and the drinks were bomb.com. I got the mint mules and so crisp and good. The clam chowder was soooooo good too. I was by myself so it was a bit busy for what I was looking for, but still had a great time.", "author": "Katherine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Exceptional cocktails -- heard tables on either side remarking on how good their cocktails were as well. Highly recommend the French 75, husband had a gin martini.  Both were as good as it gets.  Nice a strong, and tasty.  \nReally good food too. We ordered prawns, the duck confit open faced sandwich and a side of fries.  All delicious. The fries were noteworthy, probably double fried. Crispy with delish aoli that wasn't overpowering.  Nice!  \nThe decor is sophisticated but comfortable,the lighting perfect. Our bartender and waiter were the kind of people you'd like to invite to join you for a drink.  Smart and genuine,acted as if they owned the place, which maybe they do. Good job Lord George!", "author": "Stacey O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "Stopped by here at 5pm on a Friday for a drink with a friend, and really liked their drink options. The bartender recommended the Cobra Kai - Japanese wiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, and bitter. And man was it good! Great concoction of flavors. My friend asked for something sweet and the classic daiquiri they brought her hit the spot. Nice spot.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "Good neighborhood bar.Tasty bar food,stiff drinks and friendly bartenders.FAVE DRINK:DREAMS OLD MEN DREAM", "author": "aj s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Great place to grab a drink and great food too! try the oysters", "author": "Hara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "Drinks are ok. Servers have great customer service. The happy hour oysters are the best in the city. Not the cheapest, but the freshest and cleanest. Their HH oysters were better shucked than the oysters from Epic on their regular menu. I'll definitely be back.", "author": "Yvonne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "I'm impressed by their old fashion and their whiskey sour (two of my favorite cocktails).  They pretty much nailed it and I couldn't ask for any more.  Money well spent and no hangovers the next day.", "author": "Ronald L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "Good drinks, nice long bar so plenty of stools, and nice bartenders. They have a large whiskey selection as well as anything else you might crave. Haven't tried the food but it looks decent as well. Good spot if you are in the hood for happy hour...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "This place is legit. I came here post Saturday brunch and it was the exactly wha my group and I needed. Great drinks. Great bourbon. Amazing oyster selection. Highly recommend this place. Wonderful staff as well!!!", "author": "Mallory Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Great spot, very loud before Giants game but great food and good beers.", "author": "Chaz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "First time at this lovely/quaint bar. Definitely coming back again. The drink menu is superb and the bar tender--Adam--is just as impressive. He is very attentive and knows how to  work the crowd effectively and humorously. The food was great (dunk confit bahn mi!!!)amongst many other carnivorous choices. Well done Lord George!", "author": "Ewa U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Had a great time at Lord George on night #2.  Fun vibe, relaxed, tasty cocktails and really great food. Don't miss the roasted strawberry tartine! Great addition to the neighborhood.", "author": "Sue A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "What an incredible place---if I was a local this would be my hangout.  Beautiful bar and killer lighting at night with incredible mixologists. Especially Adam. Good God he knows his craft. Made the most amazing drinks and gave us hella good recommendations in the City. Lord George has my heart!", "author": "ThatGirl T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-22", "description": "My spouse and I recently met a friend here for drinks. We each had two drinks. Specifically, I had Dreams Old Men Dream and Federal Sword. Dreams was a combination of three cocktails: Negroni, Manhattan, and Old Fashioned. And despite the enthusiasm displayed by our waitress for the drink, I felt that it was disappointing. The unique characteristics of each of the 'constituent drinks' were sacrificed in the creation of this cocktail. And while I like innovation--and absurdity even--I also like thoughtful balance. Harmony is the key to a good cocktail, and this one lacked it. Federal Sword, meanwhile, was much better balanced and had a delightful nose, though that is to be expected from rye and calvados.\n\nTo eat, we had the chopped salad, which didn't captivate my taste buds. In fact, I felt it was a bit soupy (likely owing to the small amount of lettuce in favor of cucumber and the choice of dressing). However, the other two members of my party were delighted by it, so I'd give the salad 4 stars with the understanding that its execution was fine and that it simply didn't agree with my palate.", "author": "Alastair C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "Lord George is the perfect spot for a cocktail and quick bite before or after dinner. We stopped by for an afternoon pick me up and that is exactly what we got. The cocktails are perfectly curated without being pretentious; nor do they take forever to make. My personal favorite was the Clean Getaway (yum). If you're an oyster person, this will be your heaven and if not, there are plenty tartines and snacks to keep you full and happy. Loved the atmosphere and the service was great. Honestly, I rarely have no complaints, but I really can't think of one.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "This review is long overdue. Lord George has quickly become our neighborhood favorite. Delicious cocktails with a unique flair, tasty bites, a funky vibe, and unparalleled service. We've made great friends with nearly all of the bartenders, who each go above and beyond to create a warm and welcoming environment for locals and visitors alike. Highly recommended!", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Awesome to get drinks! Alyssa, our server, was great! Definitely one of the best places in soma for drinks with friends. Delicious oysters :)", "author": "Carissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Great service! Friendly from the moment you walk in. Oysters are amazing and the drinks are great! Will come back again and again!", "author": "Jose C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Wow!   It takes a lot for this crusty character to give 5 stars, but I'd give this place 6 stars if I could.   Everybody sez they have the best martini, but this place does (stirred not shaken).   Oysters were fresh and excellent fries and salad.   Finished off with a recommendation from Gina (who must be one of SF's best bartenders) for a post meal cocktail (perfect gin fizz).   Outstanding!   Reasonable price.  Great vibe.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-26", "description": "This place offers food, but theres not too much on the menu! Cocktails were pretty good. The space was nice. Have more (and better) food and this will be unstoppable!", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Wow what a fantastic addition to the neighborhood! Delicious drinks and food. Exceptional and friendly staff. Looking forward to enjoying my evenings after work here.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "I wandered into this bar by accident.  What a treat.  Order \"Dreams Old Men Dream\" and don't look back.  It's a Manhattan, Negroni and Old Fashioned...combined.  One of the best cocktails I've ever had.  Fun bartenders and better vibe.  Stumble in or plan it out, you won't go wrong.", "author": "Gustavo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "My office had our holiday party here in 2015. The whole process was seamless from planning to execution, and the event was a huge success! The staff is fun and friendly, the food was delicious, and the drinks were on point. Now whenever a visitor to the office or a friend in the area asks for a recommendation for a bar/restaurant in SOMA, this is where I send them. They'll take good care of you.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Woah - this place kicks ass. My first impression was great ambiance then when I began interacting with the staff, I was so surprised at how friendly and sociable they were. Boots is quite literally the best bartender EVER. He recommended me the Cobra Kai - which I proudly had 6 of throughout the night - and is now one of my favorite drinks. The food was also spectacular - Fresh tuna bites on a crisp cracker was FANTASTIC!! So happy I found this place. Highly recommend it! :)", "author": "Allen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Came to San Francisco for the superbowl. Great drinks and environment to watch the game. Amazing Drinks and attentive service!", "author": "Troy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Just found this spot!  Great bar, great cocktail menu and great staff.  They will do very well in this location if they are able to keep the quality of service up!", "author": "Clark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Great drinks, nice atmosphere, AMAZING staff! I came here for a cocktail on a Wednesday afternoon before a company scavenger hunt. Got a gin drink, Jungle Fever or something, tasted like sunshine and Summer in a glass. \n\nLater in the day when we were on our scavenger hunt we needed help taking a paparazzi style picture. The staff was happy to help, made me a fake martini, and let us take over a booth for our photo shoot. They were great sports. I will def be back for happy hour 1/2 oysters!!", "author": "Aimee A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Fantastic bar, Shane be bartender is great. Oysters were fresh and awesome, good cocktails (with quality mixers) and one of the best charcuterie boards ever. Epic.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "Nice sports bar. I love the name and just love the attitude. It's a bit uppity but anyplace where you can get Oysters and cocktails is ok with me.", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "This place was awesome the staff is really nice and the people that I met there were also great. The atmosphere is chill and inviting considering they just opened I think the already have a pretty good vibe established I highly recommend it", "author": "Allan I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "This review will be short. I am SERIOUS about my manhattans. I make them at home often, and I order them at virtually every place I go. So, I've tried many. Until I'm proven wrong, the best manhattan to be had in SF is at Lord George. Try it, prove wrong!", "author": "Drew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-24", "description": "Creative cocktails, good selection of wine and beer. I would pass on the food as the menu is limited.. I wasn't that impressed with the selection and a few things we wanted to order were no longer available and food was only okay.  It's definitely a happening place but really loud so be prepared for a lot of yelling to carry a conversation. Service was good even though it was a busy night. I think I'll head to 21st amendment next door the next time I'm in the area.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "Solid place for drinks and food near AT&T park. I ordered the Dreams Old Men Dream (combo of Old Fashioned, Negroni, and Manhatten) and really enjoyed it. It's definitely on the sweeter side and but still enjoyable. We also ordered the oysters, charcuterie platter, clam chowder and duck confit open sandwich. I thought the food was solid but very typical of what you can find in many other similar venues in SF. I found the volume a bit loud loud to the point where it required us to yell so the waiter could get our order. Also made it hard for a conversation between two people. I recommend coming here with a larger group or make sure to sit at the bar of its just for a party of two. Kind of felt like an a-hole for taking up a whole table with just two people.", "author": "Victor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Love that they had Modern Time (think hoppy wheat beer) in their bottle/can program. The staff takes their beverage and food menu seriously but they do not take themselves seriously, which is what I want in a bar. We will be back again!", "author": "Shane C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "This is for the bartenders working on 8/27/16. Didn't pay attention to anyone at the bar. Took us 20 minutes to get a drink. One bartender left his station to chat up friends at a table. I usually love getting food before giants Games. Not sure we will come back. Get new bartenders!", "author": "Nikki A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Lord George is great! Drinks were perfect. Oysters were fresh. The staff was fun to talk to. We were there on a Saturday afternoon - was empty when we got there and was starting to fill up by the time we left. The French fries hit the spot too. I'd come back anytime.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "Pretty cool bar. Not much of a food menu. Drinks were good, bartenders were good as well. Food menu can approve. If your looking for drinks on the low, Lord George knows.", "author": "D P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "My friend took me here when I visited and I was blown away.  Their happy hour menu is such an amazing deal and I ended up ordering too many oysters.  The bartender was amazing (the whole service was amazing,  actually) and everything came out promptly despite the number of people there. I can't wait to come back!", "author": "Taylor K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "First time for our party of six and, lucky for us, we got the VIP treatment!  Our original plans included a few drinks and a few bites and then off to a restaurant for a \"real\" meal but we liked the place so much that we ended up staying and enjoying a feast of nearly every item on the menu!  Actually, I think it was the fancy cocktails that kept us there.  I don't even know what I was drinking (I just asked Adam our gifted bartender to \"surprise me!\") and he succeeded by serving one deliciously potent potion after another.  All the staff treated us like lords and ladies, but it was special thanks to Adam that we all staggered off happily ever after (with Uber drivers taking us safely home)!", "author": "Shirley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "I come here about twice a week. They have good selection of whisky and friendly staff. The atmosphere is what this place is all about. You will come upset and leave happy!", "author": "Khalad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Just returned from SANTA FE and this place is out of sight compared to some of the restaurants that I visit Lord George by far superior service great menu selection and above all friendly friendly clean establishment I will rate thisfive star", "author": "David J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Grand Opening-9/3/15\n7pm-?\nArrived at 8:15, jammed, loud with a great crowd.\nThe entrance is now glass so you can see the oyster bar and energy.\nAtmosphere: light, contemporary, but \"Olde English\" Lord George\nBarset: same as Nova-long bar left, 4-top tables right with intimate lounge seating for 8 at end.\nStaff: Adam, Dustin and Daniel (didn't get all names), very attentive, exceptional knowledge of Simple and Fancy cocktails, fun but not contrived.\nMy boyfriend and I will return to experience the above AND the menu.\n\nSouth Park by day.....Lord George by night\nAnn", "author": "Ann F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Oh my gosh! This place is so awesome, we will for sure be back. We went to SF for our anniversary and decided to go here for \"brunch\". I was craving oysters and this seemed like the best place with that and a bar. According to yelp, there were two other places that might have had really delicious menus but they weren't hungry and/or were on the wharf. And I totally did not feel like dealing with the parking, crowds, etc. So Lord George it was. We were the first ones there (pretty much got there at 11am when they opened).  I'm so glad we went there because the oysters were delicious!! We also started off with bloody marys which went perfect. We were going to go off and bar hop after that but the bartender was so awesome we decided to stay. We also had to find wi-fi around 1pm so my boyfriend could do some work stuff and they had it there. We stayed until probably two oclock because the bartender made us feel so comfortable and  was making us awesome drinks! I can't wait to go back to SF and make this one of our regular places.", "author": "Veronica R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-20", "description": "Service was very bad, we had 3 checks and each contained items we didn't order!!! It's good we paid attention", "author": "Elena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "A great addition to SOMA. Fresh oysters, solid beer list,  and creative dishes. Excited to welcome Lord George to the neighborhood!", "author": "Danyal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "great bar. great service.  Jessica was so attentive and helpful.  My buddy asked for a rare drink (like a Sazerac) and the bartender not only knew it but it was fantastic.", "author": "Nolan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Great neighborhood gastropub! The cocktails are fantastic and you won't get any attitude from the friendly bartenders.", "author": "Rebecca P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "The place is perfect for before a ball game or just hanging out after work. Love the raw bar... they had a great selection of oysters and all the seafood is super fresh and clean. Great drink list too. Lord George is a perfect compliment to the neighborhood.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Liked Nova but love the Lord George. Perfect place to grab a cocktail before a Giants game or grab some oysters for happy hour after work. Fancy food but not intimidating. Enjoyed the Ham and Cheese Tartine, fries along with the meat and cheese platter. Stylish bar and timeless glass wear that matches what Lords and Ladies should be drinking out of. SOMA needed a place like this.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Cocktails are well made. Food is not your typical bar bites. We had the clam chowder and the butternut squash soup, both excellent, as were the ham and cheese tartine, and the beet and quinoa salad. The jumbo prawns were chilled & fresh. We sat at the bar, enjoyed great service and light conversation with the staff. Will definitely be back!", "author": "Vicky W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "Very nice decor and atmosphere. Food was very good, cocktails excellent, service outstanding. Price fairly reasonable for what you get.", "author": "Cole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Had a fantastic time at Lord George this past Friday! The cocktails, food and vibe about this place is great. Jason the bartender is awesome, very professional and made our night one to remember! I'd recommend this place to anyone.... 5 stars!!!", "author": "Ann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "Great addition to the neighborhood!  I had the salad and everything tasted very fresh and flavorful.  Can't wait to go back and try more things from the menu!", "author": "nara n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Amazing cocktail selection and delicious food. We had a big group so we sampled most of the menu. Favorites were the strawberry tartine, daiquiri, fries, and charcuterie, but everything was great!", "author": "S O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "food is really good and service as well. they have very nice sea food and very nice service. my only concern was drinks. drinks  were not so good. you guys need to work on it for sure. but still coming back for food and nice atmosphere.", "author": "Dahlia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "My new favorite bar in sf. Staff is awesome, drinks are awesome, snacks are awesome. I'm a big gin guy and it's so rare when you find a bar that can actually make a good gin martini. Also had the clean getaway cocktail and damn was that thing smooth. Super fresh oysters, crispy salty fries, And legit charcuterie board. These are pretty much all the things I need. I see some people hating on them because they don't serve a full menu. It's a bar people. Enjoy the delicious bar bites they serve, or go back to the Cheesecake Factory for your popcorn shrimp and 7 alarm chili. This place is the real deal and I'm spreading the word.", "author": "jeff w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "We came here after a baseball game the other night. First off the staff was extremely friendly and had no problem waiting on all of us while we decided on what we wanted. Second their drink selection is great and third, we will be going back soon just from how friendly the bartenders were. They made us feel at home even though we had never been there before. We got fries, empanadas and several beers. The empanadas were great and extremely flavorful. Fries were good also! But they best part was that I had an event going on and I had to leave my girlfriend here while I was at it, the bartender almost watched over her and kept checking on her the entire time she was there alone since I couldn't be there with her. He kept asking if anyone was bothering her and made her feel very welcomed which doesn't happen too often especially in a big city. We are extremely grateful that the staff was so friendly and we would all recommend this place to anyone wanting to have a good night out.", "author": "Josh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "Came here after a late night long run with a friend at 10pm. We were starving and we were bummed at first when the waiter/bartender said there were only oysters, fries, and charcuterie to eat. We ordered all of the above to share and it was all delicious and filled us up! 1/2 dozen of a variety of oysters, 3 item board (calabrese, buzzed cheese, and broccolini), and fries. The cheese had an espresso/lavender rind and was amazing. Presentation for everything was very good. The waiter was very nice and explained our food each time and was super patient. When we ordered the Cobra Kai cocktail to taste/share he even put it in 2 glasses for us. That was also very well made and delicious with a lemon twist in it. The oysters were incredibly fresh (one of the freshest I've tasted in the city thus far). The price is higher than many other gastropubs/bars nearby but truly well worth it! I would definitely come back for the food and good service!", "author": "m s."}
