{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "They make a wonderful al pastor burrito. I wish for something green inside the filling, but the al pastor burrito manages, somehow, to be satisfying all the way to the last bite. No burrito fatigue here - it looks like Los Compadres mashes/splits the rice grains before rolling them in, creating a texture almost similar to cornmeal. Perfect burrito diameter too - small enough to lop off in two bites, yet large enough to remain a proper burrito.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "I got the quesadilla with carne asada mild. It was OK, the beef was a little chewy. I liked how they had like a wrap which made it possible to eat while I was driving... I was being extra careful.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "I ordered a burrito today and was very explicit about NO CILANTRO and when I got back to my office and took a bite.....FULL OF CILANTRO! \n\nI wasted $11 (incl tip) on a burrito that wound up going directly into the trash.\n\nAt the very least, I'd like a free burrito. This time, with no damn cilantro!", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "Don't judge a book by its cover.  On a typical day during the work week you will usually find a line at this taco truck. For the last few months I've been perusing by thinking I should probably try out the taco truck. If that many people are in line, it must be good... but wait there's more.\n\nWhile the price point is very reasonable and service is efficient, I was disappointed with the final product. Hungry and with urgency, I took my hefty carne asada burrito to a bench a few blocks away and quickly unwrapped it only to discover that the end I opened was on the soggy side. Greasy, the oil ran down my hands, hmmm. I didn't have enough napkins to absorb it all, but managed to eat half of it. \n\nNow about the burrito itself. The burrito was missing key ingredients that were listed in the menu in front of the truck. No cilantro. No salsa. What? Anyway, the meat seemed over cooked and the flavor was okay. Interestingly, they used a shorter rice grain which reminded me of couscous.\n\nTruth. The taco truck serves a purpose as casual Mexican joints are pretty scarce in the area. Los Compadres continues to have its long lines and customers, I'm just not a fan.", "author": "Nova P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "I went to try Los Compadres Taco Truck on 2nd Street for lunch with two coworkers and found the food to be fairly average. They both ordered burritos while I got their al pastor quesadilla. Both of them mentioned that the burritos tasted fairly plain and I felt the same way about the quesadilla. It was not bad by any means, but it was also very simple without much flair. The al pastor was cooked well and the cheese helped to balance it out. In addition to a bag of chips at the office, it made for a fairly decent lunch though I found it to be a slight bit expensive.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "3.5 stars but I'll round up. Pleasantly surprised by how tasty my quesadilla from here was. The line at noon wasn't bad, maybe just 2 people ahead of us, but I did notice more people start to queue up after we were done ordering so you might want to go right at noon or just before noon to avoid waiting in a line. \n\nQuesadilla was only $7 + tax, really affordable compared to a lot of the other options in the area! I count myself lucky if I'm able to get lunch in the $10 range. I ordered the chicken quesadilla and it came out piping hot and with a perfectly chewy + crispy tortilla. Nicely sized portions, I was very full after eating the whole thing. \n\nFriendly service as well, I plan to be back!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "Is it La Taqueria or any of the greats in the mission? No. Is it the best Mexican in South Beach? Yes.\n\nGreat price is probably best thing going for it. Portion and quality are standard but nothing special. I got the carnitas burrito and found the meat a bit dry. It also wasn't folded really well but overall this place gets the job done. More flavor than your local Chipotle.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "Standard taco truck. $3 for a taco (plus tax)  but the tacos are bigger than most taco trucks. Not the greatest tacos but they are serviceable and the employees are  very nice. \n\n\nThe world needs a San Francisco Taco ranking...so I'm here to provide my humble list/rankings. \n\nRanking explained:  #1 (listed at the top) is my favorite/ #?  (listed at the bottom) is my least favorite. \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba, Bakeries and Ramen , Chicken and Waffles as well (random right?)  Follow my profile to see my most recent reviews.  I hope I can be helpful since so many Yelpers have helped me discover new places.  \n\nRod's SF Taco Rankings:\n\n1 El Gallo Giro Taco truck\n2 Garajito\n3 Belmar La Gallinita Meat Market\n4 La Corneta\n5 Chisme\n6 El Norteno Taco Truck\n7 Taqueria Los Mayas \n8 Garaje\n9 Taqueria Vallarta\n10 Little Taqueria\n11 La Taqueria\n12 Taqueria Castillo\n13 El Farolito\n14 Pancho Villa Taqueria \n15 Taqueria el Buen Sabor\n16 Panuchos\n17 Taqueria Gudalajara\n18 La Palma Mexicatessen\n19 El Tonayense\n20 Tropisueno\n21 La Espiga de Oro\n22 Papito Hayes\n23 Tacos San Buena\n24 Los Compadres Taco Truck\n25 Cochinita Mayan Cuisine\n26 El Taco Loco\n27 Gordo Taqueria\n28 Nick's Crispy Tacos\n\nBelow is my top 10 for the Bay Area in case you were curious.\n1 El Gallo Giro Taco truck\n2 El Jaliciense\n3 Taqueria Sinaloa\n4 Garajito\n5 Belmar La Gallinita Meat Market\n6 Belly\n7 La Corneta\n8 Chisme\n9 El Norteno Taco Truck\n10 Taqueria Los Mayas", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "I found them! On 2nd between Harrison and Folsom (Dow is nearby). I guess it's posted somewhere online, but I wasn't able to find it. Super happy I did. Their burritos are amazing as ever, and they have breakfast burritos with ham or chorizo. :D", "author": "Josh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "I came here for lunch and ordered the carne asada burrito. This burrito had a good mixture of meat, rice, and beans. Their hot sauce had a lot of heat to it and had me sweating at the end. Ask for the spicy carrots if you enjoy pickled vegetables.", "author": "Carter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "My personal favorite lunch truck, though I haven't been able to find them recently since their spot on Spear is under construction.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "The best tacos in SoMa. Conveniently located on Spear an Folsom this is a well-visited local spot. Quick service, they accept credit cards, and the prices are fire. Two tacos for $6 or three tacos for $9. They also offer burritos, quesadillas, and a variety of add-ons (guac, sour cream, chips, etc). The quality is good and the food is consistent over many visits. \n\nAlso, the spicy salsa is genuinely hot, so order with care.", "author": "Irina P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-09", "description": "Recommendation: For a dollar more you can go to Pepe's Taqueria up the street and get a bigger burrito with a better proportion of ingredients.\n\nAfter visiting Pepe's Taqueria last week, a friend had suggested that there were much better burritos down the street at a food truck. We all went this week to see what all the fuss was about. He ordered a super burrito for $9 which came with pico de gallo, sour cream, cheese, and guacamole, and everyone else ordered regular burritos without the extra filling. Note that the super burrito saves $0.50 over choosing the toppings individually, so since it's not listed on the menu it's a good thing to know if you want to save some money.\n\nRegardless, I got my burrito after a 5-10 minute wait, which came wrapped in foil and placed in a paper bag along with a napkin. It felt heavy, despite its size! Once we got back to the office to eat though, I found it to be much less appetizing than I would have liked. As other Yelp reviewers have mentioned, there is a LOT of rice and not a lot of anything else. I wouldn't go as far as saying there's 5% meat, but it certainly was in the minority on the ingredients list. I got the spicy salsa, and it had a good amount of kick and added extra flavor, which I suppose was necessary to compensate for the lack of meat. It was also smaller in girth than the Pepe's Taqueria burrito, so I wouldn't be surprised if it were less food in general. \n\nTo wrap it up, I think it was a meh burrito. Nothing I'd crave to eat but not like eating poison. It was pretty unremarkable. I don't think I'd recommend it, when Pepe's is right up the street in the Rincon Center, which in my opinion serves better burritos faster.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "You can't beat 2 bucks for 2 tacos! \n\nThey offer burritos and quesadillas at unbeatable prices as well - especially in this area!\n\nThe owners at this taco truck is super nice.\n\nGreat location and with great prices!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-29", "description": "Their super burrito is alright, like I'm not disappointed in trying it but I wouldn't come back. \n\nI gave them 2 stars bc I asked them first what is in their super burrito. After telling me \"everything that's in the regular burrito but with guacamole, sour cream and pico de gallo\", yes I ordered the super burrito. First bite I took, I noticed NO guacamole or sour cream (I told them no pico). Wait... So I basically got jipped for my money and paid for a super burrito only to get a regular burrito. It sucks you can't tell whether they included everything or not until you go home and take that first bite and it's too late to go back. \n\nI just hope it was an honest mistake and that their intentions were not to rip me off.", "author": "Cindy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "The burritos are really tasty but their expediting needs improvement. I ordered a burrito with  added guac and no beans and they gave me a burrito with just chicken and rice....no salsa or the extra item I paid for. \n\nThis is not the first time that my colleagues and I have ordered add on items like guacamole or sour cream and they've forgotten to include them. And when you they do actually include the add on's its a pretty small serving. No longer worth the two block walk from the office.", "author": "Lillie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "I can't speak for their other burritos, but the al pastor burrito is extremely DELICIOUS. Why do people still go to chipotle when they can come here for a burrito that is a little bit cheaper? Admittedly, it might not be as big as a chipotle burrito, but it is definitely miles better in terms of taste. Wait is a bit long during lunch time busy hours. \n$7 burrito in SF...definitely one of the cheaper options for lunch.", "author": "Kay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Either they have stepped up their game since the price increase or I came on a really really great day \n\nSimply put, my carne asada burrito was the best one I have had to date from them, period! \n\nOverall Thoughts\n\nIf the price increase is being used to elevate the food then they have certainly done a fantastic job", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "PROS:\ngrilled burritos\nlocal\nplenty of meat\n\nCONS:\nbland\nsmall\nbad wrap- one side is meat and the other side beans\nso little salsa, I thought there was none\n\nSo it is not a bad place but definitely not one of the best.  They need to up the flavor in the meat, add more salsa, wrap it better.  They would get a extra boost if they offered the burrito for less than $7 and a veggie version or a simple beans rice cheese and salsa version.\n\nStaff was friendly.", "author": "Bucky W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "I had just eaten at BBQ food truck when I happened by this place and thought, why not!  I ordered the mini taco plate with chicken and spicy red sauce and since it was only $5 (and had mini in its name) I thought it might be more like a snack. Turned out it was a reasonably sized meal and a real bargain at that price when compared to the $8 sandwich I had just eaten.\n\nDouble wrapped tortilla's were fresh, soft and  thick.  Meat was excellent and the sauce was very hot, but not stupid hot.", "author": "Raymond M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I went to college in Southern California. I am now a Mexican food snob. That being said, I always saw this truck parked by my office on Sacramento. There's never been an excessive line so I always walked by it. Tuesday came around and I wanted some tacos...or Mexican food in general. I grabbed my colleague and down we went...to the food truck. For Mexican food. Luckily having a food truck is the thing to do now, because I can clearly remember when the only people that ate off of those things were the people building the houses in my subdivision. I digress.\n\nJ and I went to the truck and low and behold, there were a couple of people waiting for food and only one other person waiting to order. My spidey senses started tingling. The prices were also so cheap. I couldn't believe I was in the FiDi about to order food for less than $10. Something had to be wrong.\n\nI ordered a carne asada burrito. Being the snotty brat that I am, I had to add some Tomatillo salsa, cheese, and duh guacamole. The dude took my order, swiped my card, handed me a receipt and a number. Then came the wait.\n\nIt was so fast, I was surprised. Once again, I was curious as to how the eff a food truck just made my food so quickly. J ordered two tacos -- for $5. Weird? I thought so. \n\nWe received our meals. They even gave me a paper plate and napkin. Cute right?\n\nWe walked back around the corner and decided to indulge outside since it's finally Summer in San Francisco. I unwrapped my burrito and took a bite. Holy shit....it was amazing! That burrito was full of juice and flavor. The carne asada made me remember all of my delicious burritos from San Diego. I couldn't stop. I had to keep eating. It was that good. I even considered going back for a second because it was that delicious. BUT I didn't. I remembered that the scale is not friend right now....but I sure AF will be going back to get another burrito from there. SOON.\n\nBest Mexican food in the FiDi!!!!", "author": "Sierra R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "Had a terrible experience with ordering a vegetarian dish and was given steak quesadilla. Mistakes happen, but the way they responded when I returned the quesadilla was rather rude.", "author": "Arjun S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Short Story:\nA good place for burritos for a fantastic price!\n\nLong Story:\nI've been to many taco trucks and low cost Mexican restaurants and I would have to say that this place rocks!  The wait time at this place can vary.  On a rainy day it can be a few minutes but on a nice and sunny day (especially Friday) it can be up to 30 minutes!\n\nThere's a reason why the wait can be so long because the food is so awesome for such a great price.  Regular burritos are $6 and deluxe are $8.  Soft tacos are $2 per with a minimum of 2 orders.  Chips are $1.25 each.\n\nVerdict:\nI'm going back this week!", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Best quesadillas in the city. Haven't tried their burritos or tacos yet, but I'm sure it's just as good. I haven't found a place in San Francisco that has sauce that is has flavourful and spicy as Los Compadres!\n\nHighly recommend ordering the al pastor quesadilla with the spiciest sauce. You will NOT regret it. It's $6 and so. so. good. \n\nIt's taken me 3 years to find a good \"mexican\" place in San Francisco... and this is it! Sadly, it's only open at Spear and Folsom from 11:30 - early afternoon :( Not sure what the rest of its schedule is.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "Finally, a great taco place in the financial district. How long have you been there? Why have you been hiding from me? Unfortunately for you, I'm announcing you to the world (possibly unfortunate for me too if the line starts to get long). Thankful to my coworker who shared the secret spot, I was able to enjoy great tacos for $2 each. Nothing fancy, just straight up basic tacos that hits the spot.\n\nThis place accepts credit card so don't worry about not having enough cash!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "I will be detailed because I love this taco truck! \n\nBrief notes:\n- I consider myself a taco expert \n- please trust my taco taste buds\n- I usually go to Oakland taco trucks\n- I have high expectations for tacos\n\nPrice: \n2 bucks a taco\n6 bucks for a burrito\n8 for super burrito\n\nTime:\nLong lines during lunch, I was in line behind maybe 8 people and after I ordered, only took me around 8 minutes to get my food\n\nService:\nWhat service. It's a taco truck. \n\nTHE TACO:\nI ordered 3 tacos for 6 bucks. YES they do take card and not just cash. Usually taco trucks only take cash which is why this is important to point out yadadamean? \nIt was absolutely amazing. Very flavorful and leaves you wanting much more. Al pastor, or spicy pork tacos is my suggestion. \n\nPros: \n-they take card, still surprised \n-bomb tacos, top 5 truck I've been to ever\n-located a block from the water/dock so there's a good spot to eat after you get food\n\nCons:\n-tacos at other taco trucks are only 1.50 max\n-lines can be long during lunch\n\nOverall conclusion:\nLong lines is a good thing to me, it means the food is worth waiting for. Although this trucks prices are a tad bit more, it's only 50 cents per taco more and it is after all in the financial district where most food places ask for 10+ for sure. Quality of the food is top notch. Once again, I live for tacos so just trust me.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "I've had the burritos, tacos and quesadillas and all were good. I usually get the carnitas or al pastor which are both very good.\n\nAlso, they are not very pricey. The line can be long but it moves quickly.", "author": "Ed G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "Overall pretty good stuff offered there. Good flavors, seems like quality ingredients are used. Friendly staff. Couple ways they could improve. Size- it's not a huge or even a large burrito. Very medium, really could use a bit more heft. Dry- I like way they package them more of a tubular versus chunky as it makes it easier to eat especially if you are driving. I also order it on the drier side but these need just a bit more something, sour cream, more cheese and salsa. Chips and salsa - always wish for just a few with the meal and a side of salsa. If you want extras then charge. \n\nI do recommend this place just with a few tweaks could be great.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "I usually go to this place during lunch. I would have to say that it is the best taco/mexican food place within the vicinity. The line gets pretty long real fast during lunch time, so if you get there around 12:30 expect a long line. Overall the food is very good, meat is flavorful and comes with good sauce. Only thing is the tacos are kind of small. Even 3 does not fill me up sometimes and it cost almost $8. I would recommend getting the burrito if you are really hungry.\n\nOverall I would rate this place as 4 star. Food is tasty but the long lines make it less appealing.", "author": "Tony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "While it's not my favorite Taco truck in SF, it definitely does the job of providing a tasty non-Tex-Mex burrito or taco if you are nearby in FiDi. The price is pretty reasonable for what you are getting... if you add extra toppings such as sour cream, cheese and guacamole, and also add chips/salsa to your order, the total cost comes out to be similar to what you would pay for a burrito elsewhere. The chips are homemade and are definitely tasty. The staff is also very friendly, which is a plus. Again, not my favorite taco truck, but definitely, if you are craving a burrito or taco in FiDi, stop by here.", "author": "Kunal N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "I found Los Compadres while searching Yelp for some Mexican restaurants around a new office I had started working at. It is located down the street on Spear between Howard and Folsom streets.\n\nFREQUENCY: This was my first time ordering at this establishment.\n\nFOOD: Los Compadres tacos are $3. Being a huge Mexican food fan I indulged and got 3. I got two spicy pork and one chicken. I live in the Mission District so I've become accustomed to delicious traditional Mexican food places. Los Compadres is definitely a traditional taco truck. I got served my three tacos on a plate with tin foil covering them. When I sat down to eat my taco-y awesomeness that plate looked like a battle had been fought on it. I don't know about everyone else but I like a messy taco when ordering from a place like this. To me that means its really good. That aside, the tacos were all delicious when it came to meat and toppings. I'm a big fan of spicy so I think I enjoyed the spicy pork more than the chicken but both were great. I'd really like to try their other taco types. Apparently the taco's used to be cheaper which has caused some lower reviews but since I never experienced anything other than the $3 tacos I was very satisfied with what I got for what I paid.\n\nDRINK: I didn't order any drinks while at Los Compadres so I can't speak much to what they offer. I'm assuming they have the standard food truck offerings of fountain drinks and water.\n\nATMOSPHERE: Since this is an outdoor stand I can't say there is much an atmosphere for Los Compadres. It's located on the sidewalk and you just wait in line to order, get your taco's, and most likely eat somewhere else.\n\nSTAFF: The staff was friendly when taking my order. Since taco stands serve in a fast food like style you don't really spend much time talking with the staff.\n\nPAYMENT: Credit cards or cash were acceptable.\n\nThis taco stand had good food and I plan to work this into my regular lunch stops. I'll update this review once I've tried all of the taco's offered.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "They've increased their prices a bit, so burritos are now $7. It's still decently priced, but considering it's gone from $6 to $6.50 and now to $7 in the span of one year, I'm wondering if they are going to keep raising the prices.", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-10", "description": "Rice burritos where the price keeps going up (I believe from $5.50 to $7.50 in less that 2 years). Visited for the 1st time in nearly a year out of desperation and learned that they also change tax now....so you are looking at a rice burrito for just about 9 bucks that not long ago was $5.50. Pepe's at Rincon Center has much better burritos with a fair portion of meat for the same price now. Go to Pepe's, its just 1 block away from Los Compadres. My guess is these Los Compadres guys are on their last legs....", "author": "Jim R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "I asked for my receipt after I received my food from the pickup window and the guy had a little tantrum. He slammed his fist on the counter and mumbled something under his breath. If it's too much to ask for a recipt then many you should switch to cash only. I'll stick to PePe's in the Rincon center. I almost didn't eat my tacos because the service left a bad taste in my mouth. Even though the tacos were good I won't be back.", "author": "Kaylan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Best burrito in FiDi/SOMA, no doubt.  The options in this part of town aren't much, but Los Compadres easily wins the competition by a significant margin.\n\nI've been a regular here during the lunch hour for 4+ months and I'll be sad to leave it behind when I move offices to another part of the Bay Area.  Like clockwork, every day I show up for my al pastor burrito and like clockwork, every day they make a delicious and very filling lunch at a highly affordable price, especially for the neighborhood.  Their chicken burritos are pretty good and their carne asada burritos are superb, but the al pastor burrito is heavenly delicious.  For the FiDi/SOMA area, this place is a steal (I guess it's because they don't have to pay insane commercial rent).\n\nThe folks that work the truck are really friendly and know all the loyal customers' faces.  The only real problem is that sometimes they run out of ingredients due to popularity, and at times they are overwhelmed by the long lines during lunchtime and the wait can be 15-20 minutes.  These are pretty minor complaints in my book.", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-13", "description": "WARNING: this place hates vegetarians!\n\nI went there for a quick lunch the other day and asked for two vegetarian taco's. \"We don't have vegetarian taco's,\" I was told. \"That's okay, just make it with beans and cheese and not meat.\" \"We've been open for ten years and we've never done vegetarian.\"  Which is odd because old menus show vegetarian burritos. \"I'll pay full price, just please don't put any meat in the tortillas.\" \"I can't do that. The computer isn't set up that way.\" \"Put in any meat you want in the computer.\" Just don't put meat in the taco.\" \"Can't.\" \"Wow. You know you're losing business.\" \"No I'm not.\" \nReally!!!\n\nI suggest walking two blocks to Market and 2nd to Uno Dos. Food way better and service great!", "author": "SCOTT L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "If you're wondering if this truck is good, visit at 12:30 on any day. Go on, I'll wait here for you  . . .\n\nRidiculously long line, right? That's because this is the best burrito in the FiDi; trust me, I've tried them all and Compadres is the best. This place has been open since well before the food truck craze, back when food trucks were known as roach coaches. Pioneers indeed.\n\nI can't put my finger on what it is exactly, but I think the fact they grill the burrito after it's constructed is key. The texture is just right; who likes a gummy tortilla? And that quick grill gets stuff inside slightly runny and all mixed together. The amount of spice is great (you can ask for mild or spicy), the meat is tasty without being overly salty, and the ratios are just right (meat to other stuff). \n\nI used to work closer; a mere three blocks away and I'd go about twice a month, but I now work north of Market, which is a shame because I hardly ever visit Compadres anymore. But on those rare occasions I don't eat at my desk, I walk the 15 minutes for a Compadres burrito. Yes, I'm willing to walk 15 minutes AND stand in a long line for this place. That means it's really good or I'm really stupid. Probably both.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Los Compadres, tu eres mi amigo\nYou're pretty solid mexican, a lot more than just so-so\nYou're Carne asada is the bomb, and I like the pastor too\nYou run a tight ship, a pretty efficient burrito making crew.\n\nBest Mexican taco truck this side of SOMA.  I really like their Carne Asada and Pastor burritos.  Their regular burritos are like $6.50, which is ridiculous in the city, but that's their charm.  Cheap tasty burritos, it's a winner!", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "OMG YAAAAASSSSSSSSS!!!!  I was fiending for a burrito yesterday (hey, cheat meal: go hard or go home) so I went here yesterday for lunch and ordered a carne asada burrito.  This was DIVINE!  The best part is the burrito is so skinny (maybe bc I skipped the beans?), that I took it and sat on a bench on the embarcadero right by one of those windows opposite of Crunch where the people are working out on the treadmill and trying to not make awkward eye contact with me. \n\nT'was quite the fun experience bc I sat there like a bad (more like, evil) bish slowly devouring this beautiful burrito while these folks are in there working out at noon on a Friday.  I will be back!", "author": "Mia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "Split burritos with a friend so was able to try their beef and pork. Both were tasty and nicely prices. I got the salsa on the side but both the mild and the hot were fresh and the hot was not very hot. All in all a great burrito at a solid price :)", "author": "Steven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "Good Mexican food and business men in dress shirts and slacks. Good combo :)\n*note: Guys in business clothes may be seen here on the weekdays during lunchtime, but no they don't come with your order!    \n\nThis taco truck is tucked away a block or 2 away from the Embarcadaro near Cupid's Span & the Muni stop. Great location for grabbing some tacos or burritos and enjoying the view of the Bay bridge on a nice day. \n\nI got the 3 carne asada tacos for $5 & chips w/ salsa for $1.50. The tacos were great and chips were crispy and I loved the mild green sauce. You get your order within 5 minutes.. yay!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Fresh & consistently delicious taco truck on the corner of Folsom & Spear. Perfect for a filling meal when you don't want to spend $15 for lunch in the Financial District. \n\nThe salsas are some of my favorite I have ever tasted- as a Mexican, I am rightfully picky about my salsas. The line can get to about a 30 minute wait if you go during peak lunch time- but definitely worth it.", "author": "Nika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "It Ian amazing tack truck! The taco was so tasty and  fresh. Thus taco truck tace card ! Very good price!", "author": "Komar T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "The craftsmanship and packaging of the burritos is amazing. I've never had a burrito so well put together! That being said, I had myself a carnitas burrito sans the beans (not the biggest fan of beans), and there is definitely a reason why the burritos are packaged so beautifully.\n\nIf you're looking for a place that will give you an overwhelming amount of salsa, rice, meat, etc, this is def not your place. I feel like it's portion controlled and I appreciate that! I don't like biting into a burrito and having all the contents fall onto the table for me to stare at with dismay. Hence, the limited amount of contents in the burrito is what makes it so compact and in my opinion easy to eat and more enjoyable. \n\nThe ratio of meat to tortilla was a little off. I felt there was more tortilla than actual carnitas so I was a little disappointed there. Also, although carnitas is fried pork, I wasn't keen on all the oil left at the bottom of my burrito from the carnitas. - 1 star for the leftover cooking oil in my burrito. The meat wasn't cut into eatable pieces either. I had a huge piece of skin in mine which was a little unique to me for a burrito. -1 star for the meat's presentation.\n\nLove their speed from order to getting your food though! There was a line but they're quite efficient with their order to food service is great! Didn't have to wait longer than 5 -  7 minutes. I would come here if I was craving a portion controlled burrito. And you really can't beat the price $6.50 for a decent burrito!", "author": "Jo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "Mighty fine burrito for a taco truck. Great service, well organized, friendly and fast. I'll be back. I came here on a busy Friday lunch hour rush and had my lunch very fast. These people are pros with great flavor, that's why there is always a line. \n\nGo here, you'll like it/", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "My co-workers and I stopped by here for tacos--though most of us got burritos. We waited for like 15 minutes because these guys took too long to round up. But the food is pretty decent for the price. I got a Carne Asada burrito with guac and sour cream for only $7.75.  My colleagues who had been here before had good things to say about the Spicy Pork but I elected against that this go-round.  Overall, a decent burrito--will be back.", "author": "Juan T. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Good tacos, that is all.", "author": "Christopher Steven O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Whoa. Somehow I came to this truck at 12 noon and there were only 2 people in line. Definitely had to take advantage. \n\nCarnitas here are delicious! Very juicy and flavorful. The burrito is good but I should have coughed up the $0.75 for the guacamole... It was definitely missing something, but it was not bad! I like that it's not a huge brick of a burrito too. Good portion for lunch and didn't feel disgustingly full afterwards. And for $6.50, it's a great deal. I ordered and got my food in under 5 minutes. \n\nNext time I may try the carne asada. Give it a go!", "author": "Kelly E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "I've gotten burritos from this truck hundreds of time, and I'm still hungry for more! Burritos are big and delicious (BBQ pork is a favorite). Tacos are great too!", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Pretty good al pastor and the service is pretty quick. Pretty busy at lunch and they wont open until 11:30am even if they have nothing to do other than sit there and talk.", "author": "Derek F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-09", "description": "I'm going for five - I can't see giving these guys any less.\n\nPerfectly located 1 block from my work, they are always super friendly, super fast, super inexpensive and omg *a-maz-ing*! I've never had Mexican food that feels healthy...until now.\n\nI got into a habit of ordering the 3 chicken soft tacos: exquisitely spiced meat, seasoning and radishes on light tortillas for just $5. Never felt full after the fact, as this proves to be JUST the right amount of protein and carbs to keep you going through the day guilt-free. Then yesterday, I finally broke loose and went for the burrito. It, too, was the right amount and \"light\" in that the meat, the rice, the beans - all food that normally falls like a rock in your stomach - went down like oil. Smooth, delicious and leaving me feeling light as ever even AFTER the fact. Even the tortilla felt light! Just a buck more than the tortillas at $6. For \"reals\" [insert Mexican accent here].\n\nI don't know what the secret is to their chicken, but I'm fine to live in sublime ignorance.", "author": "Diane B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-16", "description": "I need to remind myself these are not real mission burritos. It's the only burrito spot in the area and I give into my cravings. But each time I pay 50 cents for sour cream on top of the $7 charge, my heart breaks every time. What a waste. What a joke. Are you really Mexican? Are you really my compadre?", "author": "Sofiya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Excellent and legitimately spicy burritos and other assortment of mexican food. I like the chicken and beef burrito. Line gets pretty long during lunch rush, but be careful about how early you get in line as I've gotten old/dried out meat in my meal before (probably from the night/day before that they're trying to use up). Also, it might be a good idea to open up the exquisitely wrapped items as you might be missing some add-ons that you paid extra for.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "My favorite mexican place in the area.   Burritos are pretty solid, but i don't like that they charge extra for chips.  Chips should be free!", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "Venga vale, vale venga!\n\nThis place is delicioso!  The al pastor is SO, SO good.  I've been here about 4 times now, and every time I am rewarded with delicious goodness.  Their Super Taco is hands down my favorite, but their Burrito and Super Burritos are just as divine.\n\nMy colleagues love the quesadilla - it weighs about 5 lbs and looks like it is just asking to be devoured.\n\nProps to these guys also, as everything always tastes super fresh and their guacamole is super good - consistently excellent.  They also don't go crazy on the oil or fat - the meat is always fresh and satisfying - none of that 'wow this is super good, but I will definitely regret it later' type of meat.\n\nBottom line: If you crave Mexican para almuerzo - GO already!", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "Super yummy. Al pastor and carnitas burritos are my favorite. Gets crowded but line moves fast. One of my favorites.", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "I went here because I wanted the quintessential San Francisco burrito truck experience. This absolutely did not disappoint.\n\nThe burrito could feed a small army. It's huge and DELICIOUS. I ordered mine with a side of guac. All sides are relatively cheap for a small container.\n\n(As an added perk, I was glad to see that they had about two tables and a few chairs.)", "author": "N. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "High quality food from another SF food truck. $6 carnitas quesadilla! Extra .75 for guacamole, you can't go wrong. Messy & tasty. Looking forward to trying the other items. Long line, but they move it fast. Wish they gave more napkins & a fork or spoon when you order guacamole.", "author": "B K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "I've been here a couple of times and usually it's packed with the lunch crowd.. but today I caught a nice break between rushes. I order a spicy quesadilla and I should have known to get a drink cause they don't play around on the spice. I had a job interview up the block so I only had like one bite before I had to go but that could have potentially sent me to the emergency room! \n\nI went into a coughing spell( pretty embarassing) so my next review will go into what happened next.\n\nGreat food and Atmosphere..just remember to be cautious about \"spicy\" anything!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Love this truck!  I get the chicken burrito with everything, I've never experienced dry chicken, it's always been excellent!  The flavors are great, the salsas are nice.  I have no complaints about this truck  -- highly recommend.", "author": "Naps V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "On my expedition to try the various food stands of SF, I decided to try Los Compadres. It was on my way and the price range fit my newly graduated poor student/person food budget. Plus, it was on the way to my future destination. \n\nI first heard about this taco truck 2 years ago while I was interning and my coworkers recommended that if I were to go anywhere for tacos, go to the place on Folsom and Spear.\n\nSadly, despite the wonderful line/wait of 2-3 people in front of me, those high expectations fell short after I got my tacos and reached for that dream of mouthwatering, yummy deliciousness. \n\nDon't get me wrong, the taco's not bad. It's ok. But, I was expecting to taste the motherhood of all tacos and it's probably because I bought the taco at 1:30PM instead of at 11AM, when the meat was fresh, that my taco didn't taste as sinfully orgasmic as I hoped it would. The carnitas had decent flavor, but was slightly dry, and the taco just didn't have multiple or even one flavor explosion in my mouth. \n\nMaybe, next time?", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "This place has some good tacos.  The 3 soft tacos for $6 is a good price.  They come topped with cilantro, onions and radish.  The carne asada and lengua meats were both very tender.  Also, get a jarrito soda too, only $1 more.\n\nI arrived at 11:35am on a Monday and there was no line, but maybe because it was chilly too.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "As an Southwestern exile in a City that really doesn't seem to grasp Mexicn food, I love this truck.  Cheap, plentiful, usally served on a corn tortilla.  I still don't understand, and probably never will, this City's insitence on stuffing rice into burritos, but I can live with it.  The Supertaco is almost too much food for six dollars.\n\nThis good stuff.  Mexican street food, staright from the soul.", "author": "Rob F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "I might have higher Mexican food expectations than most people since I recently moved from Texas. The burritos here are ok. Nothing amazing, but they are good enough whenever I have a burrito craving. I've gotten the carne asada and the carnitas burritos and both are good, but not very memorable. If you're nearby and craving burritos, it's a good spot to get food, but you won't be blown away.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "The bomb!  I am soooo burnt out on Chipotle, this truck is pumping out some great grub.  I will be making it a weekly stop.\n\nGreat job guys!", "author": "Clark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "One of the better taco trucks.  City health rating is very high as well.  Get there early, the line backs up quickly, but they are pretty quick to move it along.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-28", "description": "Great tacos served in a truck?  Believe it!  What a perfect place for a take out lunch.  While you can easily have lunch here for under $8, I wouldn't call their $1.50 tacos cheap since each taco is so small.  I needed to eat 2 tacos and a cheese quesedia to become completely full.\n\nBy the way, the beef they use in their tacos is SO good.  Not one of those completely ground down meat like Taco Bell, but half-way ground beef with tasty seasoning and nice hot sauce.  The hot peper it comes with is also very good.  Thumbs up!", "author": "トモ T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-24", "description": "The carne asada burrito is dry and underwhelming. The flavors and spices used are good but the meat and beans make up the majority of the burrito and lack moisture. Haven't tried their other items. Burrito came very neatly and tightly wrapped in tin foil in a paper bag. There were about 10 other people in line when I got there around 12:15pm. Was about a 10 min wait for an order of one burrito and one quesadilla.", "author": "Ning T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Fast, delicious, and they accept credit card. What more could you want from a taco truck?", "author": "Victoria W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "got the super sized taco and they weren't kidding about the super size part.  I got the beef tongue taco and it was delicious.  I did ask for the spicy one but i thought the spice was just perfect. \n\nget their super sized taco!!!!!", "author": "JY L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "How do they make the carne asada so delicious?? I've been coming here for lunch for several months now and this place is quick (even if there's a line), well priced (for fidi) and sevice is friendly. Thanks taco truck!", "author": "katrina w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-13", "description": "Maybe I shouldn't write this review; that way, there won't be a longer lunch line when I come back. :)\n\nFinally! A food place that isn't overpriced/tasteless/borderline inedible in the Financial District of San Francisco! I am thrilled to have discovered this place, with the help of some coworkers. Like a bright gleaming beacon of hope, it is only a few blocks from where I work! \n\nI am a huge, huge fan of taco trucks. They taste better than any Mexican restaurant I've been in. For some reason, SF's food trucks like to jack up their prices to unreasonable amounts -- $10 for a lunch?!(To account for the extremely difficult task of of handling a social media page, mayhaps?) No thanks. I am incredibly thankful that this little treasure, an authentic Mexican food truck, does not exhibit the same horrible characteristics.\n\nI tried 3 carne asada tacos for $5, and was not disappointed. They certainly filled me up for lunch! I will be back to try the burrito, super taco, super burrito: all of the above.", "author": "Mina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "I'm loving the tacos at Los Compadres!  3 tacos for $5...and they're filling too.  The pollo asado, carnitas, & al pastor are all excellent.  \n\nThey also have a massive super taco for $6.  Silly me thought that one taco would surely not be enough for my huge lunchtime appetite.  Wrong!  I could barely finish it.  It ended up being more like a tostada salad with meat, beans, rice, cheese, sour cream, pico de gallo, lettuce, guac, & salsa, with a side of radish, pickled jalapenos & carrots.  I had to eat 2/3 of the filling before I could pick the darned thing up.  They also serve quesadillas & burritos, so I'll try those next.  \n\nYou can eat your meal at one of their cute little tables next to the truck or walk a block over to the sunny Embarcadero waterfront & enjoy the view.\n\nMy new cheap meal deal in SOMA!", "author": "Erin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-23", "description": "Yummy yum yum...I'm so glad to have a taco truck like this only a couple of blocks away from my office!\n\nIt can get really busy during the height of the lunch hour, but I usually try to go on the early side when the wait isn't so bad.  The carne asada super taco (my usual) comes with a generous helping of meat and it's loaded down with rice, beans, lettuce, salsa, cheese, onion, guac and sour cream.  This thing is huge...and heavy!  It's on a soft taco and they provide you with a fork, but I end up picking up the taco part with my hands once I've eaten some of the fixings off the top.  (I eat this at my desk so nobody has to witness me tackling this monster!)  Combine the taco with a bag of their thick, crispy chips and a side of salsa (which is included with the order) and you have some goooood tasty eatin'...all for $7.50!  I always order mine spicy (vs. mild) because I love spicy food, but you should know that it really IS spicy.  \n\nFor anyone who might be wary about eating from a taco truck (like I originally was), they have a perfect 100 rating from the health department.  That definitely set my mind at ease!\n\nOK, I'm going back to eating now....", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "I love fine dining as much as any girl, but I equally love food trucks!  This isn't one of those \"fancy\" food trucks (complete with Twitter page) by any means... but I love their street tacos, and at 3 for $5, the price is right.  For your taco order, You get your choice of meats and salsa.  My favorite meats: carne asada, carnitas, al pastor.  I typically like my sauces mixed (red + green salsa on each taco).  There's no place to sit nearby, but you can eat outside at South Park (about 2 blocks away) or bring them back with you to enjoy!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "Go-to spot for burritos. Their quesadillas are very good too. I like the carnitas -- tender and a little bit crispy in some places. Their salsas have great flavors.", "author": "Leah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "Great source of Mexican food and joy. The \"super\" items in the menu are good for two portions.\n\nThe Super Quesadilla is great and the 3 tacos deal is something to try.", "author": "Ibai G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-02", "description": "I've been frequenting this taco truck for a few years and it was always great! Sometimes there could be a crazy long line but the food was always worth it. I hadn't been in a few months and went a couple of weeks ago. The regular crew was gone, and I was informed that I could no longer order a super taco which was always my favorite! I was sad, but ordered some chicken tacos instead. When I ate my tacos I was very disappointed because the meat was dry & rubbery. I don't know what happened but it's just not the same and I doubt that I will be back. So very sad :(", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "$8 super carne asada burrito minus the beans and cheese. Side of chips and tomatillo for a buck something more. What a satisfying meal and thankfully something different. I love my salads and soups but this chubby girl needs her guilty pleasures and I've found another stop to add to my list. I'm definitely going for the tacos next!!!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-11", "description": "This place just plain sucks. It's a freakin truck yet they charge you *more* than a brick and mortar taco place and the portions are minuscule. But hey, you'll be handed your tacos wrapped in a ghetto paper plate by a hipster with tats & Elvis Costello glasses.\n\nDo yourself a service, walk a few blocks east to mexico au park, you will be able to sit, eat more quantities of better stuff and pay less.", "author": "Ho N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "First off, note that this review is relative to the location; move this to the Mission, it'd only get two stars.  But, there's much fewer options around here.\n\nTheir burritos are one-meal sized, not two.  Their chips are outstanding (for a dollar extra).  They have two tables out front to sit at, and a long line at lunch, but one that usually doesn't take more than five minutes or so to get through.  \n\nThis review is part of a series on lunch places near my office.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "For what it is and where it is, it's 5 stars. I like getting 3 tasty authentic tacos for $5. That's a real value for the neighborhood. Very similar to the style tacos at Mijita nearby at the Ferry Building, which are also quite tasty, but those are $4.25 each. \n\nThere's often a line, but if you go a little early before noon, it's a much shorter wait. Even when there's a long line, it moves relatively fast. 5-10 minute wait tops.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-16", "description": "Slowest taco truck in existence and they never have anything to drink. Overpriced. Not that good.", "author": "Spyro K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-08", "description": "Not a very good burrito.  Ordered the Carne Asada burrito, I must've been unlucky or something, but it's probably the worst burrito I've ever had.  The beef was so gristly that it was actually crunchy... and when it wasn't grisly I was just chewing on chunks of stringy fat.  Barely got any bites of actual meat.  Even if I had gotten unlucky with a bad batch of meat, the rice also tasted like that \"instant spanish rice\" you find at the dollar store and there was almost no salsa.  Don't understand why this place has such good reviews.  At least I know not to come back.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-25", "description": "Lone taco truck in the outer reaches of the FiDi, well hidden in a parking lot.  The tacos use tiny soft corn tortillas that are good, but not freshly griddled.  A nice mix of cilantro, onions, red salsa and green salsa top each taco.  Probably better Mexican food than most restaurants in the hood, though some of the meats tend to be bland.\n\nQuesadilla: I really wasn't enthusiastic about getting this at first, but I figured I wanted a little extra food in case I was still hungry after the tacos.  This was by the far the best menu item!  It wasn't like those half moon quesadillas I'm quite familiar with, but more of a crispy rectangle with all the sides closed off.  Inside was gooey queso blanco with fresh cilantro leaves and a tomato-based hot sauce.  I still can't get over how perfectly crispy it was!!!\n\nCarne Asada Taco: Little morsels of steak with a bit of grill charring.  All well done, no rare or medium rare sections like found in hoity-toity carne asada.  Good for a humble taco truck.\n\nAl Pastor Taco: My favorite of the tacos.  Extremely crispy and spicy small cubes of pork.  Even dripping a bit of flavoring (i.e. grease) to add extra taste.\n\nCarnitas Taco: Got the texture right: some soft pulled pork and some crispy.  The flavor just wasn't there, seemed a bit bland.  Decent, but so many better carnitas around town.\n\nChicken Taco: Probably the most boring.  Tasted like boiled chicken without any spices.  I prefer chicken tacos that have a chicken which has been stewing for hours.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-31", "description": "This place sucks... It's right across from my building and they nickle and dime you for every little thing.  The burritos are small as hell.  Don't waste your time when you can go to other places that are much better in the city", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-14", "description": "Quick fix for Mexican food.  Great tacos.  Be prepared for a wait during the lunch hour", "author": "C G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "This is the finest Mexican fare around.  Don't get me wrong, I'm all about the greasy, dive taquerias, but this is well-made food for sure.  On first site, I knew it was good from the number of people waiting patiently for their lunch orders.  I will definitely stop by again my next time in the Bay Area!", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-27", "description": "Overall, not bad - just whoever the guy is that replaced the girl, (he always wears his sunglasses), has the \"too cool for school\" attitude.  No, please don't look up from your phone to let me know that the truck isn't open till 11:30, (I thought it was 11).  \"yeah\" consistitutes the least amount of effort, but when you're the face of a business, kick it up a notch \"bro\"", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Super solid taco truck. Legit and lives up to the hype. Burrito was downright amazing. Misses one star, because it is, after all, a food truck.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "The burritos here are bomb diggity!!\n\nThis place is quite a bit of a walk from my office, but the food is worth every step rain or shine! Last time my co-worker and I came here, we walked in the pouring rain to get our burrito fix. \n\nThe burritos here are HUGE. Between 3 people we split 2 super burritos and 2 chips and salsa, and we were STUFFED. Now you can imagine how big the burritos are. They are also packed tight! They are so dense and heavy that the paper bag almost ripped when we were carrying our feast back to the office in the rain. Thanks to my co-worker's cat like reflexes, our lunch was saved!! Besides the size of the burrito, I think it is constructed pretty well. Every ingredient that is in there is of the right amount. Not too much or not too little. I also like how the burrito itself doesn't seem to greasy. Some of the burritos I've eaten around the city have pools of oil in them, and that REALLY bothers me. \n\nMinus one star for charging us for extra salsa. I'm glad that the chips comes with a rather large salsa, but when you ask for more they will charge you. There are 2 kinds and personally, I like the green one better because the red one has this smokey taste which I don't really like too much. But, why do they charge us for more salsa? The other taco trucks don't...", "author": "Ayaka S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "Had them for a few times, asked what was in the super/deluxe burrito and I ordered 3 times 2 deluxe 1 normal and they were the same. My 2 deluxe burritos didn't have the guac or anything special compare to the regular. Save your 2 dollars and just get regular... unless they forgot to put those extras in twice", "author": "Harold W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "Flatly, the best lunch place in the neighborhood. The burritos are soooo good. \n\nVery friendly. Fast service.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-08", "description": "They raised prices this week. Gave you less and didn't have carnitas, black beans,  al pastor or refrained beans.  I don't like paying more for less. No more:(", "author": "Eduardo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "I eat here regularly because it is so close to my office and have a great experience every time. The line gets ridiculously long but it's worth the wait. Plus if you come back 30 mins later then the line is usually gone. I love the chicken burrito (w/ pico, guac, cheese and sour cream) and the quesadillas are amazing. The quesadillas are not a typical quesadilla because you eat it like a compact burrito. The food is always fresh, always hot and always good time after time - what more could you ask for in a food truck?", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "I go to this truck for lunch every so often. It helps if you get there in the 11:45 timeframe or earlier, as the line can get pretty long.\n\nThe phrase \"El Tonayense\" is visible along the lower edge of the truck, but the dude handling the money assured one of my coworkers that they are not affiliated with that chain of trucks. Hmm.\n\nGood food, good value. For $6, you can get a burrito that's not overstuffed with rice, with meat that's marinated very nicely. Throw in $2 more, and they'll add in the obligatory artery-cloggers (sour cream, etc.). The tacos are very tasty as well. Vegetarian options available. And of course, they'll put on the red sauce as liberally as you want.\n\nThis is how a roach coach (note: that is NOT a derogatory term) should do food: Good, cheap, fast, and easy.\n\nThose are desirable adjectives when describing an eatery.\n\nNot all of them are so great if descriptive of you while on dates. But that's another story...\n\nBut um, anyway, yeah: 4.0 stars.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-19", "description": "Bankrupt, divorced from his Doberman Pinscher wife (..she would later claim that size did matter) and no longer with a corporate sponsor, the little chihuahua staggered on the street with its tiny, bony legs barely able to move. In a state of doggie dementia (much like a post-Ellen, pre-hetero Anne Heche wandering Fresno), he repeats his rainman-like mantra over and over again...\n\n\"Yo quiero Taco Bell...Yo quiero Taco Bell...Yo quiero Taco Bell...\"\n\nLuckily, he came upon the Los Compadres Taco Truck on Spear and Folsom. But it's not Taco Bell - \"Donde estan los Gorditas??\" - and the line is so long. He pants with hunger, and as the clock strikes noon, he has to wait a full half-hour before getting his fairly hefty $5.00 Carnitas Burrito.\n\nIt's good - not great - but filling with the appropriately overstuffed combination of black beans, rice and grilled pulled pork (though it tasted like it was sitting on the grill a little too long). It hit the spot on an unbearably hot day. Oh wait, my muchacho, I forgot about you...have a bite...how does it taste?\n\n\"Here, lizard, lizard, lizard...\"\n\nEveryone's a critic. \n\nFOOD - 3 stars...a solid street burrito, not quite up to the hype\nAMBIANCE - 3 stars...uh, it's a truck, dummy....though there are tables and chairs but mostly for people waiting for their orders\nSERVICE - 3 stars...not the fastest guns in the West\nTOTAL - 3 stars...hankering for a burrito and not in a hurry?...try it", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-05", "description": "Went at 1PM on a Monday.\n\nThey mixed up my order with the person before mine, but I got the correct burrito.  The wait was about five minutes.  I ordered a regular burrito with Carne Asada and the meat is a bit dry-either overcooked or old or both.  I asked for some extra salsa verde and the guy told me it was made with salsa verde (which it wasn't) and an extra would cost me $.50.\n\nIf it weren't for the beautiful day outside, I may have given this truck one star.\n\nEvery place has their bad days.  I love Mexican food and I will try this truck again earlier in the day and hope for the four star food I've been promised.", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-11", "description": "The food can be pretty decent, but is woefully inconsistent and a ripoff. About half the time I get guac even though I've paid for it - no excuse for that. Or it will be all jammed into the last bite, so I don't know if i've been ripped off until the end. They also don't do refried beans - what's up with that?", "author": "Dan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-31", "description": "Perhaps I have been spoiled by the taco trucks in LA, but Los Compadres simply did not cut it for me.  I've been in SF for 3 months now and the two things I miss most about LA are taco trucks & good Korean BBQ.  As I was chasing my male coworkers up the 2nd street hill (between Howard & Folsom) yesterday on our way back from lunch, I saw a sign pointing to a roach coach.  I was super excited and if I hadn't already had lunch, I would have gone immediately.  I thought about it all afternoon and this morning and I just had to try it today for lunch.\n\nHere are the issues I have with the taco truck:\n1) $4.50 for 3 tacos??? Tacos in LA are $1 or $1.25 and I can buy as many or as few as I want.  Why must I buy 3 and why are they $1.50 each?\n\n2) Long wait.  I ordered prior to noon and it still took 5-10 minutes to get my food.  In LA, it's instantaneous because there are more than 2 people working on the truck.\n\n3) Most importantly - Cold meat.  I got 2 carnitas & 1 al pastor tacos and the meat was not warm by the time I got back to my desk (5 min. walk from the truck).  \n\n4) Lemon - I'm sorry, but when did taco joints start giving out lemon instead of lime?  I know, their juice is almost the same, but it's just a sign of lack of authenticity.\n\nMaybe if this was my first time at a taco truck, I may have been amused.  Perhaps my expectations are unrealistically high for SF.  All I can say is I can't wait to get back to LA in a month and eat as many taco truck tacos as I want!", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "this truck is across the street from my office, so i can see how long the line is at all times! BEST 3 tacos plate for $5.00. i always get the lingua, so tender and moist. the health review is a mind blowing 100, so you know it's super clean!", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "The tacos are excellent at this taco truck. The meat is very tender and flavorful and the balance of tortilla, meat, onions and cilantro really makes the flavor come alive. On my last visit the pollo was juicy, tasty and not dry. The carnitas was also quite spectacular - just hopping with flavor. If you are in the area and don't mind the lines, definitely grab the 3 tacos for $5, it is well worth it.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "Hang over cure? Lol \n\nPeople just go here for location. Hard to find a good mexican spot in Embarcadero. This truck is pricey. Expect to pay $8 for a super.  Decent meat, not the best. The meat is my only complaint, i guess. Dry? During lunch time the line gets pretty long so try to go there right before 12pm. The super tacos are huge but then again you probably need like 3 slices of lime to drench over the dryness of the meat (carne asada).", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-18", "description": "Pretty sure this place gave me food poisoning. Unlike everyone else here I am a Mexican and a cook myself. The lines for this place make you think it's all that...then you realize your in San Francisco, where folks simply have no clue the depth, diversity and what to look for in mexican food. Granted this is just a truck, street food. But there are some basics you look for, is the meat marinated, moist? is there a lot of fat? Is the salsa fresh? They seem to have turned down the volume to cater to their clientele. Good news for SF is that a Rosa Mexicana just opened on Steuart st in Embarcadero. Sadly this is a DC/NY restaraunt chain !! But they have dishes there you simply cannot find in SF restaraunts which cater to the taco/nacho/margarita crowd", "author": "Armando Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "The Best burritos this side of Mission street. You consume an entire meal for under 6 bucks. Wait until 1:30 if you can and the lunch line will die down. The salsa is also own the house. Holy frijoles!!", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-21", "description": "HEAVEN!!!!  \n\nPERFECTION! Best burrito in all of San Francisco, if not the world. \n\nThe chicken here is so, so, so delicious I can't handle it! The problem at some tacquieras is that sometimes the meat is fatty or gristly, but the Taco Truck meat is immaculate!!! And their salsas (especially the red) are out of this world.  Nothing is better than snagging a burrito here and then walking over to the Embarcadero and picnicking with a view of the Bay Bridge. This place is amazing!!!!!!!!!!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-09", "description": "You have no idea how excited I was to find this gem across the street from my office.  They set up shop around 11AM, and stay open until about 3PM.  Their menu includes tacos, burritos and quesadillas filled with veggies, chicken, tongue, beef or carne asada, and they have a vegetarian option!  Once a week I order their regular sized, vegetarian burrito filled with white rice, lettuce, black beans, cheddar cheese, and guacamole.  I always order their hot salsa, which is a spicy, flavorful chipotle salsa (not just hot for hots sake).  \n\nWhen you arrive at the corner of Spear and Folsom at lunchtime, you'll find a huge line and an even larger crowd of patrons waiting for their orders.  What you won't find, are angry faces.  This place is well worth the wait (the longest wait for me was 15 minutes) and everything is always fresh, whether you order at peak lunch time, or not.  \n\nHope to see you in line sometime!", "author": "Lacey H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-03", "description": "The carne asada was over seasoned, meat was just okay.  I guess I've been spoiled by Three Brothers in Palo Alto.  But if SF is your only spot, then this will do.  Just expect long lines during lunch.", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-28", "description": "I got a burrito today when the truck was at the G-food lounge on 2nd Street.\n\nThe quality of the burrito was very good, and it was quite tasty.  However the burrito was so small it left me hungry.   This burrito was the size of a child's burrito. I expect more for $8.", "author": "Doug S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-24", "description": "I don't know who started the trend of obnoxious burritos... but I'm sure glad that this place doesn't follow that trend. There are way too many burrito joints that make burritos the size of footballs just to get some hype. . They make the perfect sized burrito here... not too fat, not too short, but just right.\n\nAs far as taste... this truck ranks up there with the some of the best that the Mission has to offer.", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "It's so hard to find a taco truck in the Embarcadero area. So my co-worker told me about this truck on Spear/Folsom. So I went and tried it and it was pretty decent tacos. You get 3 soft tacos for $5. Any extra taco is $2.  I really like their beef tacos. I have also tried their beef tongue taco which was very tender. The only thing that I don't like was their carnitas, because it was very oily. I just don't know how much oil can you put on that taco shell. The oil soaks through my paper plate whenever I ordered carnitas tacos. Nevertheless, I usually just ordered beef or beef tongue. Also their mega taco for $6 is pretty good too. I have yet to try their burritos, but I am sure is good since many people order it.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Great tacos, great burritos, what more can you ask for? Their carnitas is good, not dry like many places and their al pastor is even better.", "author": "Dave T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "Delicious super taco! I'm glad I only ordered one, not realizing how super it actually was. It's basically like a burrito bowl from Chipotle, with a tiny little taco tortilla at the bottom. There's actually really no point in the tortilla, since it can in no way handle the massive amount of meat, cheese, sour cream, rice, beans, etc that's on top of it, but I do enjoy my carbs. I got the carne asada without beans and it was yummy!", "author": "Jacqueline K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-19", "description": "Damn fine burritos! I will miss you guys when you have to move out of your usual lot!", "author": "Cody W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-01", "description": "While the meat is not as tasty as La Taqueria, it's still pretty damn good.  \n\nI recommend the $1.50 taquitos (3 is enough for lunch for me) - carnitas and el pastor are both good.  You need to order 2 but how anyone can eat just one I don't know.  The taquitos come with sliced radishes, pickled carrots, and pickled peppers of some kind (banana pepper type spicy but long and green).\n\nI haven't tried the burrito yet, but having peeked around at everyone elses, I'm not convinced enough to convert from the taquitos.\n\nBe prepared to wait.  I arrived around 12:20 and there were 15 people in line in front of me as well as another 5-10 waiting around for their food.  In the end it took about 10 min to get through the line and then another 10 to get my food.  Bring a friend or some reading material.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-06", "description": "What I had: Carne Asada Super Burrito\n\nThey give you all the ingredients, including guacamole, which is included without extra fee. Pretty cheap. I didn't find it that special though. I'm fine with just getting Chipotle. I hope I didn't offend anyone... I'm not a Mexican food connoisseur.", "author": "Vera W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "It isn't amazing, but what do you expect? It scratches that greasy-not-qyite-authentic-mexican-food itch that everybody knows they have sometimes.. The guys in the truck are nice and patient, food is made quickly, and it doesn't break the bank!", "author": "Haak S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "Got there at 11:45 to beat the lunch crowd with a group of friends. Its also nice to get there early so you can get a small table.\n\nI had the carne asada regular burrito. It was too much food for me. Next time i think i'll just grab the 3 soft tacos. flavors were there and i loved how they added bits of the beef fat to really give it some flavor. it was the good beef.\n\ni will come again and i will try their entire menu. its nice to have something healthy and good.", "author": "KK M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "This taco truck is amazing.\n\nI always pass by this place when going to other restaurants off the embarcardero and I would tell myself that \"next time\", I would try it out. After a few weeks of \"next times\", I finally went. The long line was a good sign, especially since it was 12:15, the time when hungry office people come out to feed.\n\nI decided to get 2 spicy chicken taco  and 1 spicy pork taco for the grand total of $4.50. And for good measure, I got some chips to hold me over while I waited for my food. The chips were yummy and the mild green salsa I got was delicious, although I managed to spill all the salsa in the bag of chips later on. After a good 10 minute wait, I got my food and walked down to the embarcardero to enjoy my lunch. Between the pork and the chicken, I definitely enjoyed the pork a bit more, mostly because the chicken was really oily and didn't have as much flavor as the pork. But I vowed to return. For the pork.\n\nIt's not the best taco in the whole world, that award goes to the taquerias in San Diego and Mexico, but for the area, it's pretty darn goood.", "author": "Viola L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "This is a truck.  They serve tacos.  It doesn't get any simpler than that.  There's beauty in that simplicity.\n\nYes, the menu is limited, and that is a good thing.  It is not a restaurant, it is not a burrito joint, it is not a hole-in-the-wall or even a shack.  I can dig the fact that this taco truck will never aspire to be anything more than a taco truck, nor does it ever need to. \n\nYou come to this truck for tacos or burritos and you can choose between chicken, steak, pork and lengua.  As for salsa, you have two options: spicy or mild, and they apply it for you.  I have to applaud the people who run this operation for making it so efficient and so simple.  As a bonus, you will get pickled peppers and carrots and radishes with your food.  To me, that shows that this truck is legit.  They weren't the best three tacos I've ever had, but I can easily think of far worse ways to spend $4.50.  Los Compadres on wheels has taken the quintessential taco eating experience and kept it in it's purest form.  You can appreciate it, or you can get the hell out and cry to your nachos bellgrande.\n\nSo if you're in the area, and are craving an authentic taco experience, don't fear the taco truck.  Just pretend that all the dudes in business suits are actually hard-laboring caballeros...", "author": "Tim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "Ummm . . . Yes, please!! It definitely doesn't help that I can see the line forming every lunch hour from my office.  San Francisco has so much to offer with respect to Mexican food, but if you want fresh, reasonably priced, and super flavorful Mexican food in the SOMA, Los Compadres is perfect. I've tried the tacos (pollo and carne asada), and the quesadilla. All with the spicier sauce (which is amazing).  They also have burritos and I will definitely be back to try one!", "author": "Nadia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-23", "description": "Fast, cheap, and easy--I'm in love!\n\nWhen I have to pay for my lunch, I like to tap Los Compadres for a $7.50 super burrito with carnitas. It has all the fixins' plus a nice kick. Actually the firm bought me a burrito here once, and it tasted even better than usual because it was fantastically free.\n\nThe first time I went to the truck it was after 12p and I had to wait 45 minutes. The second time it was 11:30 and the wait was 10 minutes. Here's time-saving tip: Go before the noon rush.\n\nI love eating at nice restaurants, but at times I just want something huge and heavy to hit the spot--you know, underneath my seven fat rolls. =)", "author": "Liz T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "I'm comparing this to my beloved El Taco de Oro in Alviso.\n\nThe carnitas burrito (with spicy sauce is a must) I had was a solid 4 star burrito.  Not huge, like many burritos you'll encounter at taco trucks, but not tiny enough to leave you hungry, it was definitely the right size.  With a good amount of cilantro, sauce, meat, black beans, and rice, I couldn't complain about anything but the dryness of it.  Not sure how this would be remedied without going too overboard on the spicy sauce.\n\n\nI also had a lengua taco, which I compared directly to my ETdO benchmark.  While good, it still doesn't come near to the standard.  Some lengua pieces were too chewy and the sauce/taste of the entire taco wasn't as savory as ETdO.  The taco itself is a 3 star taco, which averages the overall rating to around a 3.5.  \n\nI have yet to try the other meats, as the price for this and ETdO are the same, however, the lack of cabeza may lower this rating to just a 3 star in the future.", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-30", "description": "I come here often, it's near my office. I imagine in total I've probably been here more than 30 times. The food is OK, not bad, but not good either. I'd recommend coming to this place only if you work nearby and have a hankering for some average Mexican food (there aren't any other nearby walkable options). Ultimately, there are so many taquerias (both mobile and not) that are significantly better than this place that I wouldn't recommend coming here for any other reason. Don't be deceived by the long lines, you're not going to get anything memorable here. If you have a car, go elsewhere. If you have a bus pass, go elsewhere. If you're stuck in the office, this place will do.", "author": "Russ N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "Agree with all the comments re - \"best tacos ever\" - no equal in terms of the tacos (carnitas, pastor, lengua all excellent)\n\nwould skip the quesidallas and burritos are ok -\n\ntop it off with a vietnamese coffee (in the coffee wagon next door!)", "author": "Ben P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-02", "description": "Just read some of these other reviews, people.  Does this sound like an over-hyped gut-truck swarming with Yelpers to you?  Because it is.  \n\nSalsa, no bueno.  Mushy, flavorless tomatoes and not enough of the good stuff.  I fear the bacteria count in such salsa and recommend getting your burrito without it because I don't want to see you get dysentery or something. \n\nThe al pastor was just OK but nothing I'd wait for again; I could get down to Cancun on 6th and Market in that amount of time.  \n\nAt least it was big.  I finished it, but regretted it.", "author": "Jared L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "The Legua is great.  On a warm day the line can get a little out of hand.  M\nI still think this is one of the best tacos in the city.\n\nOn a side note.  It isn't cool to hold a place in line for 4 of your friends.  You know who you are.", "author": "Nopadon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-15", "description": "I have always been weary of mobile food places, especially taco trucks. I have a fear that once I order a burrito and I get my order, all warm and nice, and then open it only to realize that instead of my burrito they just gave me a brick wrapped in tinfoil, but when I turn around to discuss this minor oversight they would have already sped away BECAUSE THEY'RE IN A FUCKING MOTOR VICHICAL! Then I would be left standing their with a brick wrapped in tinfoil when I really have a craving for just that, except instead of the brick it would be a burrito, and instead of tinfoil there would be a puppy that totally wants to be friends, but instead of that I would just have a damn brick wrapped in damn tinfoil. This is one of my biggest fears, right in front of my fear of not getting over my problem with having irrational fears. \n\nThat's why I approach mobile food stands cautiously, which is how I approached the Los Compadres Taco Truck., like a baboon.... A SAFETY BABOON!!! (if yelp reviews allowed to have pictures I would insert a picture of a baboon in a safety helmet and a crossing guard uniform). But there are always a few signs of reassurance that the business will not just take off and fee to peddle more bricks to other unsuspecting consumers. Such as a flat tire, or a push cart operated by someone who didn't look that healthy and probably couldn't push/run that fast, or me siphoning the gas from their gas tanks. Though Los Compadres did not have any of these, it did have a stable location where I've never seen the truck move from since I started working in the city. I still wanted to slash the tires just to be safe, but I decided against it.\n\nI was there early for lunch (around 11:45) but there was already a line there, so I begrudgingly got in line and reopened the option of deflating a tire. I ordered the lengua regular burrito, which was kinda pricey for a taco truck. I handed over the money suspiciously, like an antelope.... A DETECTIVE ANTALOPE!!!  (use your imagination).\n\nAs I got my number I made sure I gave them a look that conveyed the message \"you better be cooking meat on that grill and not a brick, because bricks aren't food at all it's building material (or food for rock monsters I guess) BUT DEFINITELY NOT FOOD FOR HUMANS!!!\" I think the cook got my message exactly because he scribbled something on the order paper, which I assume said something like \"Not a Rock Monster\". \n\nOnce I got my burrito unwrapped and took a few test bites to make sure it wasn't a brick or have traces of brick like material in there, I started to fully enjoy my order. The meat had just the right texture that allowed all the ingredients to mix well in the mouth, and a little bit of spice to provide an extra kick. It wasn't too salty or too bland and each bite was just like a fiesta in my mouth (and no one invited that weird kid no one likes). \n\nOverall it was a very good burrito, without any trace of physical construction material, but there was plenty of metaphorical construction material, building a bridge to my heart. The only downside was the higher than usual price for a taco truck and the smaller than usual size of the burrito relative to other taquerias, then again you can't really humor the idea of slashing the tires on other taquerias.", "author": "Youchen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "Tasty super tacos.  Great burritos.  Always a line.\n100 percent on the cleanliness report.\nI work nearby and it's my comfort food.\nSure, you'll be sleepy in the afternoon if you eat the whole burrito.\nThe Al Pastor is spicy and greasy and really good.\nI don't understand the negative reviews, except maybe they're from people who don't want it to get more crowded than it already is.\nAnd they blast indie rock playing from an iPod while you wait.\nSuper cool truck that I've gotten lunch from many, many times.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "I can't help it, I love food. Earlier this week I ate my brought-from-home lunch and was still hungry, so I ordered lunch #2 at Los Compadres - a carnitas quesadilla with guac - and it was delicious. The salsa was spicy and added the right amount of kick. I'd definitely come back and try other items on the menu, and I'll probably come back soon since it's a stone's throw away from my office (such a dangerous place to work for someone with an inner fat kid). Prices are a tad expensive for Mexican, but everything's expensive in the city, especially in the Embarcadero.", "author": "Bella L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "I love the al pastor super taco.  It's a nice amount of food for $6.  You can walk to the water and enjoy your lunch with views of the bay.  Can't beat it!  It's a great escape from the office on a nice day.", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-01", "description": "Its been a while since I ate here last. I went today and have a less enthusiastic review. Unfortunately the burrito now has less flavor. But the biggest difference is the burrito is about an inch and a half in diameter. Tiny. I just finished one and I'm still hungry. Its too bad, I guess I need to find a new burrito in the neighborhood.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "Awesome lunchtime spicy vegetarian burrito fix!\n\nThe truck was missing from the corner for weeks in late December & early January. It's back, now.", "author": "Mars H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Excellent food. I had this place prepare catering trays of make-your own tacos for a large party and the food was delicious and was reasonably priced.", "author": "marc c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-28", "description": "I was really hoping that the food was as good as all the reviews said but I was disappointed...so disappointed smh. :/\n\nI come from Mexico so I know good Mexican food vs imitation food. And I have you know one quick fact burritos are non existent in Mexico, they're Tex-Mex. \n\nSo here are the facts from my order:\nOrder: Carne Asada regular burrito with green salsa; \nPrice: $6 even\nReview: I found the meat dry, probably from sitting too long or being overcooked\nThe pinto beans had no flavor\nRice was okay, but pretty bland\nThe green salsa, well it was no where in sight\n\nIf your looking for authentic Mexican food with some flavor this isn't it and they charge for extra salsa and the burritos need it... desperately. I ate about 1/4 of the burrito before tossing it out and I dislike wasting my money like that.", "author": "Myra E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "Very blah...From all the good reviews I expected way more from this taco truck. I was craving Mexican food, but my craving wasn't satisfied sadly. I had the super taco with carne asada. I don't think they flavor their meats (perhaps I chose the wrong kind of meat?) well so overall it did not have an exciting flavor. On top of that, the salsa did not taste fresh...neither was the lettuce in my super taco. I barely remember having guacamole in my taco and I definitely didn't taste the cheese even though i saw mozzarella cheese in it. I asked for spicy and it did not taste a bit spicy...even though many reviewers mentioned \"when they say spicy, they mean it.\" I probably won't come back unless I am dying for some Mexican.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-24", "description": "I begged to differ here but I'm new to the area and had a few burritos and  tacos at this place but his place is nothing to write home about. \nOverpriced for just an average tacos truck food. The steak burritos have some nasty after taste that a cold beverage could not wash away. The super and regular burritos are practically the same. I would expect the super burritos would come more with salsa but non-whatsoever. No chip that comes with it. With 7.50 for a super burrito, it is overpriced compare to any other truck that are out there. The tacos also lack additional salsa. It was dry and average at best. The only good thing is the location is very close to my work.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-22", "description": "The. Best. Burritos. Hands-down.\n$5.50 for a full meal (which can easily be split into lunch and dinner!) near the Embarcadero is unheard of.\nJust be forewarned: if you can wait until ~1:30/2:00 for lunch, you should wait. Otherwise, the noon-ish wait times can easily take up half your lunch hour. (I love peaking down at the taco truck from my 7th floor office window - I'd know exactly when the lines are dying down) :-)", "author": "Jill T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-31", "description": "The Truck!!! The lines can get ridiculous for lunch. You either have to go early or late. I always scope it out from the office window before deciding to go. \n\nI didn't realize what a great taco truck they were until I ate my way through the mission. The flavors are fresh, all the meat taste great. It's super delish. \n\nAlso, they're probably one of the cleanest eating establishments in the city. They always rate 100 from the health department. That's hard to do!", "author": "Thanya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-05", "description": "AKA El Toyanese taco truck.\n\nI've heard about the taco truck within walking distance of the FiDi for a long time but it's only recently that I've added Los Compadres to my lunch list, now that  friend works only a block away.  The first thing I noticed was how good the flour tortilla tasted.  Usually the flour tortillas are pretty forgettable, if noticed at all.  This was a decent flour tortilla.  Their al pastor was tasty, although I can't tell whether it's roasted on a spit or it's just marinated pork bits that are grilled up like everything else.  Their carne asada is also juicy and flavorful.  The corn tortillas for their tacos are not greasy like at the hard core taco trucks.  That could be a plus or minus depending on what your preference is.  It's nice for lunch though because I don't have to deal with greasy fingers or splotches all over my shirt.\n\nCilantro haters beware, they throw some in on their cheese quesadilla.  I thought it made it taste a million times better than your standard quesadilla and will have to start adding cilantro to my quesadillas at home.\n\nFor your basic tacos, burritos, and quesadilla this is going to be my spot from now on at lunch time.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "Big fan of Los Compadres, I live right across the street from there and it's a great value and a great meal. You can't beat the 3 tacos for $5. There burritos are nothing spectacular, but their chips & salsa are great. There's always a long line so I recommend getting there at 10:50am, they open at 11am sharp. They even have a few tables and chairs so you can eat by the truck if it's nice outside. I recommend the carne asada & carnitas tacos above the pastor, chicken or lengua.", "author": "mehul p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "I used to work down the street from the truck. I already miss it. Good stuff. Can't go wrong with any of the burrito choices or tacos.", "author": "El T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-08", "description": "I  had heard good things about this truck.\nI got in line.  I chose to order a simple chicken burrito. \nI asked the guy taking orders VERY CLEARLY if I could have it without cilantro.  To make sure I was covering my bases, I asked if the salsa had cilantro or if the chicken might be marinated in it, or if the guacamole had any in it.  He answered \"NO\" on all counts.  I was very very clear that I did not want cilantro in any part of my burrito.\n\nSo I ordered it.\n\nAnd you know what I got?  \n\nA burrito INFECTED with tons and tons of cilantro.\n\nThis place is close to where I work, but I'd rather just walk the mile to Orale Orale.", "author": "Courtney Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-30", "description": "I'm pretty sure if my coworkers read this, I will be expelled from my place of work. Los Compadres is less than a block away and everybody's favorite.\n\nEverybody except me!\n\nAs pros, it's cheap and really quick.\n\nAs a negative, it's too spicy for me (I have a bland palate OK?!) and the al pastor is greasy....\n\nI prefer Mexico Au Parc or even Maya.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-04", "description": "This is about the best you can get for a Taco Truck and definitely the best burrito in the area.  The plain old grilled chicken burrito with black beans rocks, great spice and flavor.  The tacos are also very tasty, especially the carnitas!  Very consistent.\n\nGet there before 12 and all the CNET/CBSers!", "author": "Christopher P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-04", "description": "EDIT: OMG OMG OMG, after scarving down 3/4 of my burrito, i JUST found a freakin EYELASH IN MY STINKIN BURRITO.. *gag*\n\n***\n\n{again, wordy review, but c'mon folks, ya know how i roll} =o\n\n10/4/07 LUNCH\nthe perks in working at the place i'm at, i have such easy access to the FiDi/SOMA.\n\nLA folks: please, i need some love and some pity ... you'd think i was in for a REAL SOLID treat coming to a taco truck for some BOMB ASS burritos...\n\nfor ALL: i am biased, i am from LA, forgive me, but forget me not, i am spoiled by LA standards, so mind me.\n\nlet's just say, i'm ok, not content, not filled with joy, but ok. for $5 i got myself a burrito, daydreaming about LA... \n\n-1 not having my horchata.. WTH? what taco truck in CALI only carry soda and water? BOO...\n-1 no tapatio? (the guy looks at me and says, \"we never carried that before\")\n-1 having it in an area where they are doing construction, who KNOWS what kinda dust particles or what not went in my food while MAKING my burrito, but i'll cancel this out by giving it neutral because they wrapped my burrito so tight, kinda reminded me of those kimbap style...\n-1 you have to PURCHASE CHIPS? wow, mebe i AM spoiled by LA.\n-1 you HAVE TO GET A MINIMUM OF 2 taquitos/tacos if you want to buy one. SO UNHEARD OF IN LA... not that it costed a lot, but sometimes you just want one. \n-1 oh, i also wanted to get a sope, and the guy in front says, \"oh we dont ahve that...\" (boink! then why is written on the bus dummy)\n\ni swear i was prolly asking for MORE mexican food than i should've...\n\nok, so for the +.\n\n+1 all prices are included w/tax \n+1 reasonable prices (no more than $5 tops)\n+1 fast moving line... it may seem like it will take forever, but once you order, you prolly wait max 10 minutes, but idk if this is a good concept or not, but anywys, they give you a #, and you wait, and then, the guy calls out like 5 #s at a time.\n+1 they got an award for being clean, you know, those grading scale ratings LA has at every restaurant, well, they got a 100.\n\nif you know me, i'm all about cleanliness when it comes to food...\n\nanyways, the wait was ok, and there's quite a number of soma/fidi monkeys waiting patiently, and in the end, i have to say, food was good ...  peek fotos.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-25", "description": "YES TAQUITOS. The little tacos are DELICIOUS. and they are not the horrible abomination that Taco Bell calls a taquito, these are just small soft corn tortilla tacos, with meat, salsa, onions and cilantro and nothing else to get in the way, except maybe a squeeze of lime juice. At $1.50 a pop, they are affordable in BULK, too. Get about 4 of these and a coke then head down to the Embarcadero = perfect lunch. I suggest the al pastor, the grilled chicken is a little too plain.  I'll have to come back to try the carnitas. Also, consider hitting this place up a little bit later than the usual lunch hour, because the line can get pretty long during lunch rush.\n\np.s. if you come to this location looking for the El Tonayense taco truck, if you look at the front of this truck, you can faintly make out where there used to be letters spelling out \"El Tonayense\", so I think there was a name change at one point.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-04", "description": "I agree with most of the low reviews here. \n\nFour years ago, I used to think that this place was \"the best.\" But after eating other at other Taco Trucks (like El Tonayense), I know better. \n\nOver the last four years, this place has increased its prices by $2 for a burrito (I remember when I could get a burrito for $5 here and when the super taco was truly 'super'). I would stay away from the pollo asado here as I have found numerous bone chunks/rocks in my burritos. \n\nUnfortunately, this is the only taco truck in the SoMA area so most of us enjoy the allure of a taco truck in downtown. However, poor quality meats, a long wait (I can see the truck from my desk so if we do eat here we try to arrive before 11:45 or after 12:45 to beat the rush at noon which would cause us to literally wait 20 minutes for a burrito). \n\nSorry, Los Compadres. I've had better at taco trucks in the Mission and I do not appreciate the $2 inflation combined with degradation of product and increase in wait-time over the last four years. You will always have a special place in my heart, but not because of the sweet oils from your burritos.\n\nBy the way, a close, better alternative, is the burrito place in the Rincon Center.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-01", "description": "Yes, everything Patrick E. said.  Burritos are served HOT, and they are well constructed. \n\nI don't like how they charge for their hot sauce though.", "author": "shaun l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-09", "description": "Ok, so I have not actually been here myself, but everyone at my work goes here for lunch and they love it. They all say its the best lunch ever. And the boys who run this stand are super nice.\n\nHi George!\n\nSo go here! Eat well for your buck! And never underestimate the power of a good taco truck!", "author": "Cat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "This is the closest decent Mexican near my work place. \n\nI live in the Mission and am picky about my Mexican food; I give them 4 stars for the food.\n\nI almost always get the carnitas...and it tastes a little different each time. I love seeing how the carnitas will be...crispy or more tender.  I've had the carnitas in the super taco and the burritos.  As one other reviewer commented, the super taco is not just a taco.  It's a box filled up with all sorts of goodness.\n\nI've had better lengua in the Mission, so I don't recommend that.\n\nI was just commenting to my friend today that the place would be so perfect if they opened a beer garden in the parking lot as well.\n\nOh, that last star: it's for all the eye candy while waiting for my carnitas.", "author": "Sooj O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "This is not the best Al Pastor in the City - that title is currently held by Balazo in the Haight(!?!)  (IMHO). But:\n\nThis is my favorite Al Pastor Burrito in the entire City. \n\nThis is the best taqueria in the entire FiDi. And it's not even close. But consider:\n\nThis taco truck is always clear of people from the window in your office, but packed once you finally make it there. Which sucks because:\n\nThis is a slow moving line. And:\n\nThis is probably not where you want to go on Friday if you went out Thursday night, and maybe you're a wee bit hungover. Because:\n\nThis is the third worst example of sidewalk etiquette. (Nothing holds a candle to the self-satisfied clientele at Tartine, or the oblivious post dinner ice cream eaters at Bi Rite Creamery). But:\n\nThis is the best taco truck I've eaten at in the City. (So far - suck it El Tonayense near Best Buy! Your shit is bland.)", "author": "Olu J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-25", "description": "So I read a couple of reviews on Yelp about the \"Taco Truck\". I make some frequent emergency trips down to the Colo at 365, and most of the time, our paths cross.  \n\nOn Thursday, as I was departing from the Colo, I was HUN-GRY! Skipped breakfast (that's bad kids, definately a big no-no!) and it was almost 1:45pm! I proceeded to \"The Taco Truck\" since there was only a couple of people waiting in line.\n\nWhen I got there, they were just waiting for their food, so I stared at their menu for a couple of mins. Picture two small, white sheets of paper taped on the truck with ultra small fonts... Yeah..\n\nWhenever I go to a Mexican place, whether that's a full-fledged, sit my ass down restaurant or a walk up restaurant like this one, I always order one thing: THE SUPER BURITTO. Just like my obsession with \"Chicken Teriyaki\", without gauging the \"common\" food, its hard to tell how good a restaurant is...\n\nNot only does it have beans, cheese, meats and salsa, but with the SUPER in front of it, which means that they'll add some guacamole, onions and cliantro to it and you got a delicious meal good to go.\n\nYum-O!!\n\nI got a carna asda super burrito for $5.50. Popped 50 cents in the tip jar for good karma and BAM! My # 52 was called about 5 mins later and I got a HUGE ass burrito, wraped in foil and a paper plate for easy portability.\n\nGot back to the office and it was still hot. Good job! I unveiled IT to my fellow co-workers and they wondered where I got it. I had to tell them, but even so, the burrito could NOT be finished in 1 sitting. Simply too much meat, not that much beans and a lot of salsa (I LIKE Salsa)\n\nSo today, I wrapped up the burrito, popped it in the microwave and tried it again, expecting it would suck.  But it did not suck. It still was filled with the mouth-watering spices and had lotsa FLAVA!\n\nI'd definately go back for sure and try their tacos. I for one, love Taco Trucks! For that reason along, I wrote a small haiku just for you..\n\nHere's a haiku written in 5-7-5 form:\nYour big \"Taco Truck\"\nAt the parking lot corner\nMexican food good!", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-08", "description": "Jury still out on this place.  The price is right.  The food is inconsistent and the line can be really long.\n\nI prefer the burritos to the tacos. WAY too many onions on the tacos, but WAY too much rice in the burrito.  Spicy is really hot so be careful.  That said, I find the al pastor and carnitas to be quite tasty.  A little sour cream and guac go a long way.\n\nIf they balanced out the ingredients a little better and they'd be fine.", "author": "Tom R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-21", "description": "Great lunch for very little cash! $4 for a super taco and it' s not your ordinary taco. It's a to-go container filled to the top with corn tortillas, your choice of meat (I prefer carne asada), guac and the usual fixings. I like spicy food, but holy spicy! The hot sauce is HOT! I try to go during off-peak times so I don't get stuck in the 10-20 minute wait. \n\nDefinitely worth a go if you work in the area.", "author": "Defne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "Hey if you're into cheap burritos with plenty of cilantro (like me) then this is the place oops...I mean truck for you!\n\nThe line can get kinda long during lunch but hey at least you're out of the building getting some sun and fresh air.  No complaints here.\n\nI usually stick with the carne asada regular burrito and have tried the \"super\" variety but I don't see much difference for the additional dollar or so.  I've ventured out and tried the al pastor which was OK.\n\nI always order a side of their hot salsa for an extra 50 cents its muy caliente!!", "author": "TobikoJoe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "My friend eats here every day.  He gets a Veggie Burrito at around 11:15am literally 4 out of 5 days/week.\n\nHe convinced me to overcome my taco truck fears and get a burrito here.  I've now been back 4 or 5 times.  It's nice to know that they get a 100 score on their health inspection.  It is clean, and the fact that it's off the ground (on wheels) probably helps keep pests away.\n\nThe selection is somewhat limited, but they have the basics.  Certainly not as tasty as Pancho Villa, but it's quick, the price is right, and it's a decent burrito.", "author": "Bill V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-05", "description": "Oh sweet Taco Truck of life. \nCarnitas Super Taco. Addictive. Delicious. Exquisite. Authentic. Cheap.\nI had it once and went back at least twice a week for the next month. \nThis is the Mexican food I dream about when I'm not near it.", "author": "Terika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-06", "description": "Super burrito, spicy, with chicken = yummmmmmy\n\nwaiting on a crowded corner in windy SOMA = brrrrrrr\n\nyummy (greater than) brrrrr = Taco Truck wins!\n\nps: Yelp, really? I can't insert a greater than symbol?? Lame.", "author": "Maryam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "Being from So Cal, it was hard to find a really good taco truck in the city.  I know, everyone says to hit up the Mission...but, nothing really impressed my highly-delicate palate.  Until now...\n\nLos Compadres Taco Truck in SoMa...I've tracked you down and now I'm addicted.  They keep it simple.  Meat, beans, rice, & hot sauce.  The rest you can add to your heart's desire.  Me?  I like it straightforward.  You have hot sauce to die for.  \n\n3-4 on the heartburn scale, but that's a good thing.  Anything less wouldn't be legitimate, anything more would force me to reduce my intake to once a week.  \n\nVenture down the alley...you'll be glad you did...", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "I love this place (truck)! I've only had their $6 super tacos even though I've been there several times, it's so good that I don't even want to try anything else. I highly recommend this truck!", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-17", "description": "three tacos is the best deal around.  The burrito is a little small for how much it costs and these guys cannot for the life of them figure how not to force all the guac & sour cream into the ends of the burritto rather than have everything evenly distributed throughout the wrap which in my estimation seems to be an art rather than as simple as it sounds.  A solid go to for lunch but get there early or you will be waiting...", "author": "Jon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "For a roach coach, it's pretty good. \n\nFor cheap Mexican food in the FiDi, it rocks. It's a bit of a hike from where I work, but worth the journey, on a nice day. \n\nBeen there twice and haven't been disappointed yet. Both times had the carne asada Super B. I was expecting the meat and rice to be crunchy, but was pleasantly surprised when both were fresh and full of flavor. Six bucks for the super burrito and it's way better than it's closest competitor, Chiptole. \n\nDefinitely a long line around lunch time, but they're usually johnny-on-the-spot with the service. \n\nThe guys working the truck are always nice and word on the streets is they received an A from the health dept. No worries about receiving an actual roach with your food.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "Super Soft Taco with meat, beans, and salsa of your choice, guacamole, sour cream, and cheese on two soft corn tortillas.  For $6 bucks, it's a solid option for a take-out lunch.  Lines are always long at the lunch hour rush, so go at 11:30 or after 1ish to avoid the crowds and wait.", "author": "Kalista W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "Once we figured out where to order (It's a little window about a foot above my head), everything was GREAT.  I had 3 carnitas tacos that were very tasty.  The meat was tender in parts, crunchy in others and tasted fantastic.  My wife had 3 different tacos and liked them all.  The salsas were just OK.  \n\nSince they were street style Mexican, they really aren't much different than what I get in Dallas at Fuel City.  The only difference is that I get some radish slices.  In Texas we get some extra sautéed onion slices.  Both are good, just different.  We did get some chips that tasted a little stale.  The tacos were great and the burritos looked really good and big, but we didn't get any.  \n\nIt is funny seeing the looks you get walking through the lobby of a very nice hotel on the Embarcadero with a plate of taco truck food!  The other guests looked at us like we were eating their dog, but the people at the front desk asked what we had and gave us a big smile and a thumb's up!", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-27", "description": "I can see this place from the window of my 9th floor cubicle...I picked up a burrito at around 11:10 when there was no line. Now it's around 11:50 and I can see about 15 to 20 people milling about. I think the crowds flock to this roach coach on the corner because it's really the only decent burrito to be had in the area. DECENT is the key word here. Clearly the place called \"Pepe's Taqueria\" at the nearby Rincon Center is just god awful gut bomb served up to people who don't know any better!\n\nToday's burrito session had me eating the super burrito with carne asada and whole beans. I always ask for salsa on the side because their pico de gallo is way too heavy on the cilantro for my taste. I tend to be a big carnitas guy and it bums me out that their carnitas can sometimes be hard and dry...seriously...dried out, almost like eating pork jerky! Go with the carne asada or pastor and you'll be in good shape.\n\nNot the best burrito in town, certainly not the worst. This will always be my workday burrito - unless La Taqueria opens a restaurant nearby!", "author": "Nate R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-03", "description": "This place is great for a truck.  They have places to sit right beneath the window, decent food, and are situated a block away from the gorgeous embarcadero...minus that damn arrow in the ground, it's such a great spot to nap after this truck's food (on a sunny day of course).\n\nAs far as taqueria food goes, it's just ok for me.  I got their lengua tacos, because for me, if a taqueria doesn't have good lengua, they just don't serve good food...period.  And I was seriously underwhelmed.  The chunks were way too big, allowing me to get a true glimpse of what I was eating...taste buds as all, and it was chewy and not flavorful(normal lengua is to die for...).  \n\nAside from my tongue gripe, I feel as though it's a good spot.  I have gotten their carnitas, no complaints, their chicken tacos, eh-kinda bland...and I have been wanting to go back for their al pastor taquitos, but I haven't made the trip..weather has been a bit too ominous as of late.  \n\nThis is however one of the first taco trucks that doesn't make me nervous (a la truck outside of kaiser on geary and divis), they seen extremely clean...from what I can see over their high counter tops...\n\nmuchas gracias a los compadres, en realidad, la comida que sirven es la mejor comida mexicana en SOMA! Ole! :-)", "author": "Kristin E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-30", "description": "After a long walk from New Montgomery down to the water and back, I happened to run across the \"truck\".  I questioned for a second if I should cross the street and try it out or just keep walking, but my addiction to Mexican food made me walk the crosswalk!  Uh...I should have just kept walking.  \n\nThe menu looked interesting and promising, but it didn't deliver.  My carnitas were like hard crunchy rocks of nothingness.  Not even a bit of salt was recognizable.  I thought I was being safe by getting the carnitas, but I guess I chose wrong.  I also asked for no onions in my tacos but yes on the cilantro and what did I get...heaping spoonfuls of onions and a pinch of cilantro (My bf will not be happy when I get home)  :(  \n\nIt was cheap for 3 tacos at $4.50 and there is no tax or SF health surcharge added so that was a plus.  However, I would rather go to my ultimate favorite place for even better tacos and definitely better quality meat for about the same cost.  At least I finally ate at a taco truck so I can cross that off my list of things to do in my life.", "author": "Ayrn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "\"Hell, it's 11:45am. Let's hurry over to the roach coach before the GAP crowd kills it.\"\n\nAround the office, that's a typical line when speaking about my favorite taco truck. Or tacqueria, period. No other place can rival their burritos, a hefty lump of meat and cheese and rice and beans, even big enough to feed two people.\n\nAnd, oh, the place is damn cheap.\n\nRight across the Gap building, on a corner between spear and folsom, the Roach Coach roosts on a crammed parking lot five days a week, from morning to mid afternoon. But if you're not in line before the lunch rush, then you can kiss your appetite goodbye. Frequently, a crowd floods the truck (ostensibly from the adjacent GAP building), sending you packing in line, waiting for a half-hour just to make your order.\n\nBeat the rush and go early. Arriving late isn's a good plan, either, since the roach coach often runs out of meat or rice or chips. When this happen, they over substitute on something, which could be a good or bad thing: See how well your heart and arteries responds when you gorge yourself on a carne asada-laden burrito. . . without the rice and beans. Three pounds of beef. Yum.\n\nBut if you like your steak, then El Tonayense fits right up your alley. It's one of the few places where the meat tastes fresh, unlike El Farolito and La Tacqueria, Cancun and San Francisco Taq. Saturated with a special mix of herbs and sauce, the carne asada is perfectly cooked, perfectly cut, and perfectly presented.\n\nOnce you take your first bite into the savory burrito, you'll marvel at the level of care placed on its construction. From top to bottom, each section is balanced with the right amount of meat, of guacamole, of beans and cheese. None overpower each other; instead, the ingredients complement each other, giving a subliminal taste with each bite.\n\nThe chips, too, serve as equally awesome complement. Only a few tacquerias make their chips, instead relying on prepackaged tortilla chips. El Tonyanese, on the other hand, fries their chips, batters them with salt, and packages them in limited supply. There's a reason why the chips run out around 1pm: they're that good.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "Thank the gods there's alternative to the fail that is El Faro. Not having worked in this part of the city for many years, I was afraid I would have to put Mexican food lunches aside. Happily, a coworker told me about Los Compadres and their truck full o' win.\n\nI enjoyed a good burrito, very tasty spicy salsa, unstale chips (hello Taqueria Cancun, we're looking at you), and reasonably fast service considering the sizable line.\n\nLos Compadres, you have earned a friend. I'll be back.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "Real deal tacos, dressed with the typical cilantro, onion, and hot sauce.  The Al Pastor tacos, which were great, were surprisingly not saucy and not that greasy.  The carnitas were very good but didn't have any of the carmalized bits.  Still very good.\n\nSpicy means spicy here, so only say it if you mean it.\n\nThey hook you up with a jalapeño, radish coins, and jalapeño pickled carrots  - which are marinated long enough that they are super soft.\n\n3 tacos for $4.50.  Somehow 4 is $6.25.  Fine with me.\n\nDidn't see tortas on their menu.  \n\nBest tacos within walking distance of the Financial District.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "I am totally down with this taco truck.\n\nLike many people, I thought the idea of a taco truck was super sketchy, until I saw that show on KQED where a small group of people review each others favorite places to eat.  I was shocked when someone picked a taco truck (although I do not think this particular taco truck was the one they reviewed).  They showed the inside of the truck and said that in fact taco trucks are extremely clean and get very high marks on their inspections.  \n\nI walked up to the truck and checked out the menu.  Everything was either $4 or $5, which works for me!  They have a good selection of meats.  I ordered a carnitas super taco, which comes piled with your choice of beans, rice, salsa, guac, sour cream, cheese, letuce, and a lime wedge.  AWESOME.  I was impressed with the quality of the salsa and guacamole--they seemed freshly made and made from ripe tomatos and avocados.  This is my new favorite mexican joint--well, at least in this part of town.", "author": "Kandi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-06", "description": "Excellent burritos.  Pastor regular burrito with pinto beans spicy definitely hits the spot.  $5.00 is a steal for anything fresh and filling in downtown SF.  Why would people go to Chipotle?  I tried the carne asada once and it's okay.  I usually stick to the Al Pastor (marinated BBQ pork for those who don't speak or understand Spanish)", "author": "Josh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "Finally...a good taco near my work (since I can't get 'em anywhere near my home).\n\nI had heard rumors of this taco truck since worked moved to this neighborhood about 2 weeks ago. Figured today was as good as any to try.\n\n3 small tacos, 4.50$. Would be nice if they were a little less expensive, but such is the plight of the city and real estate (even in a small truck). The side of sour cream was huge, and the pico de gallo delicious. I had one of my tacos spicey, and it was right at that good edge of too spicy, which is how I like 'em. Both the pollo and carne asadas were yummers.\n\nOh, how I wished I had time to go park my butt at the Embarcadero park and watch people while i chowed down. Tomorrow, perhaps!", "author": "Annie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "Ahh the legend of the Taco Truck.\n\nOnce thought of as trashy food on the side of the road. \nNow...Gourmet. \nOkay lets not get carried away, not gourmet, but sure is delicious!\n\nI have to credit Los Compadres with altering my perception of the Taco Truck.  Up until about a year ago I would have never eaten anything that was served from a giant aluminum-plated box on wheels.\n\nBut ever since a co-worker told me that it was something I MUST try, I havent looked back.  \n\nThough the lines are often long (the secret is out) the atomophere (oh yes there is atmophere) is amazing, some days you are at the club, some days you are at a rock concert, which helps pass the time.\n\nThe food is always hot and delicious.  I typically go with the chicken taquitos (mini-tacos), but I have also enjoyed their burritos which are a nice size.  The one thing about their burritos is that they dont come with quacamole, which is a must for me.  So make sure to have them add it if you are an avo-adict like me.\n\nI cant say that all Taco Trucks are created equal, but I can say that Los Compadres is the real deal, so if you find yourself in the neighborhood, cruise on up to Los Campadres.", "author": "Sara Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-09", "description": "I'll eat anything from these guys...it's all delicious.  My co-workers and I make it out here at least once a week.  Current obsession is the $6 super taco: it comes in a box filled with meat, beans, rice, lettuce, guacamole, sour cream, salsa, and cheese.  Fabuloso!  \n\nBonus points for the really nice service and awesome music blasting from this pimped-out taco truck.  (P.S. Don't you dare hate on the fact that this restaurant has wheels...it's probably cleaner than most of the places you eat at - 100 pt health score!)", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-27", "description": "Im a Carnivorous Tacosaurus. I am a fan of mobile taco dispensers and my stars are based on the meat. At this place, you gotta be vigilant of the time that you come to get your tacos. If its after 2pm, fogettaboutit. The meat will be fairly dry and overcooked by that time cuz its been sitting in the chaving/heating pans. Go for early lunch and do your stomach and taste buds a favor.\n\nIn order of best to worst meats for tacos at this joint (IMO):\n1.Pollo Asado\n2.Carnitas\n3.Al Pastor\n4.Lengua\n5.Carne Asada\n\nBest deal is the 3 tacos for like $4.50...Get 6!!!", "author": "Nick V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-20", "description": "My first time at a Taco Truck since moving to the Bay Area, and ironically it happens right across the street from Gap Headquarters.  Huh.\n\nAnyway, as you'd expect from the above statement, this taco truck is larger, newer, and cleaner than most, and offers up some pretty tasty eats.\n\nI went with the super burrito, which includes avacado, sour cream, and a very unique pico de gallo.   For $7.50, it was nicely sized.  But the real kick here was the spice - just warm enough to feel it, but not overwhelming.  It almost had the same kick as certain types of curry which thew me off at first, but once you got used it it  - delicious.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "I feel like I write too many 4 star reviews. I like to think it's due to the fact that you have to EARN 5 stars from me, but it can kinda come off as a cop out: \"Well I like this place for sure, but dare I bestow 5-star status???\" So I take the safe route, and hand out 4 stars. I guess I could go the route of esteemed Yelper Blake W, and give EVERY SINGLE REVIEW 5 stars. Cool? Maybe. Useful? Not so much.\n\nAnyway, I ramble for a reason: Los Compadres, if situated in the heart of the Mission, would be forgettable. Don't get me wrong, it's good, but Christ, it's a burrito joint - unless something is seriously wrong, it's gonna be at least GOOD. But the catch is, this taco truck is literally 50 feet from the front door of my office. It's everything a taco truck should be - no frills, cheap, speedy (unless it's the height of lunch hour), and consistent.\n\nSo while Los Compadres would merely be an average 3-star joint, the fact it's so accessible for me easily raises it up a notch. Good stuff.", "author": "Drew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "Try The Quesadilla.\n\nThe quesadilla (the one with meat, at least - I've never had just the cheese ) is special.   I've had either carnitas or chorizo as my meat choice.  Generous cilantro is included.  The meat to cheese ratio is about 1:1.   Usually I'm a cheese-only kind of gal when it comes to quesadillas, but I think of this as something slightly different from a quesadilla.  It's shaped like a little packet and lightly sliced diagonally - perforated, almost - for easy eating with fingers.  The tortilla has always been grilled perfectly, with that mottling between gold and tan that you see on things that are grilled perfectly.   \n\nI haven't been wowed by the burrito, although with the carnitas as the filling you can't really go wrong.  You could put their carnitas in an old tire and I'd give it at least 3 stars.", "author": "April D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-19", "description": "SHAME ON ME:\n\n*  for ignoring the warnings of my fellow yelpers and thinking that the super tacos would not be enough to satisfy my hunger.  I certainly did not need the side of chips and salsa.\n\n*  for heeding the warnings of my fellow yelpers and requesting a \"mild\" order.  I might have enjoyed a bit more kick!\n\n*  for waiting nearly three years before trying out Los Compadres Taco Truck.\n\n*  for daring to leave my desk to grab lunch.  There is work to do!\n\nI will return.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "I have been here twice and it has been great both times. I didn't have to wait more than 5-10 minutes either time. I've been there at 12:00 and 12:45. Even if there is occassionally a long wait, I don't understand the complaining. If you know of a good place that doesn't have a long wait, dont attract attention by writing about it on yelp!\n\nI've talked to 3 other people who have been here and they enjoyed the food as well.\n\nThe people are also very nice. \n\nI've only had chicken here, so that's what I can reccommend. Very juicy and flavorful.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-12", "description": "\"The Truck,\" as it is affectionately known, makes me smile because pretty tasty Mexican food at pretty inexpensive prices equals happiness in my book. I'm lovin' the al pastor (BBQ pork) burritos, chicken and steak tacos, chicken super tacos, plus the chips and salsa.\n\nI should, however, mention the one time I got sick from eating here. It was nothing catastrophic: a few nausious hours compared to the many, many lunchtimes filled with tortilla-wrapped pleasure. (Okay, that sounds gross).", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "Look, if you are looking for gourmet cuisine (which it sounds like some of the reviews are), then this isn't the place for you.  There is a reason taco trucks have earned the name \"roach coach\".\n\nThat being said, if you want a good, tasty, filling burrito for less than $6, then there isn't any place better.  The truck looks clean (at least from the outside), the guys working are always friendly, and the food tastes great.  I'll admit it can be hit-or-miss sometimes with the carnitas, but I've never had an issue with the carne asada or al pastor.\n\nI'm sure there are probably some places in the Mission that are better, but for a quick lunch at a more than reasonable price, it doesn't get any better than Los Compadres.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-29", "description": "This is hand's down my second favorite taco truck (1st being Los Compadres at Polk and Hayes) outside of Los Angeles.  \n\nMy usual:\nCarne Asada Burrito, no arroz, con frioles (beef burrito, no rice, w/ refried beans) & a Mexican Coke!", "author": "Rod C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-13", "description": "Went here for a quick lunch before heading to Embarcadero.   There was a pretty long line for lunch, and decent reviews, so I gave it a shot.   \n\nWasnt disappointed, wasnt impressed.    Pretty decent flavors, but I ordered spicy and I didnt even break a sweat.\n\nGood deals if you're in the area, but otherwise, there's better places out there.", "author": "Ben N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-22", "description": "Not impressed. I could make better tacos.\n\nThere are better mexican joints nearby.  \n\nWARNING: NO TAPATIO IN SIGHT. AND HOT SAUCE COSTS YOU 50 CENTS (WTF????) Stinginess at a restaurant is a huge turn-off - especially if it's a friggin taco truck. I mean come on people.\n\nThe employees could be friendlier.", "author": "Chili B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "Super burrito, spicy, al pastor is the way to go. It was delicious! Place is busy but they are pretty quick.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "Clarification: Los Compadres is not the same as El Toyanese that you find over by Best Buy. However, I found out that besides the Spear/Folsom location, they have another truck off of Polk and Hayes.\n\nThe food: What can I say? I love, love, love the truck! I frequent this joint at least twice a week - working across the street makes it WAY too easy. Despite the frequency of my visits, I haven't tried most of the menu. \"Why?\" you ask? Because I can't tear myself away from my usual orders!\n\nTry the Super Taco or the Quesadilla Suiza! Try them with carne asada, carnitas (fried pork, come on), or al pastor.\n\n\"...And I would eat them in a boat.\nAnd I would eat them with a goat...\n\nAnd I will eat them in the rain.\nAnd in the dark. And on a train.\nAnd in a car. And in a tree.\nThey are so good, so good, you see!\"\n\nThe catering: Last month, I got the truck to cater a lunch for 75 people at my company. They did a great job. Aside from the usual fixings that they offer at the truck, we also got an assortment of enchiladas that they brought over from their SSF restaurant which totes the same name. Makes me want to venture out there to try the full menu...", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-22", "description": "Really a 3 1/2, The tacos are good, but not great but for downtown it is one of the best deals you can get.  The carne asada is a bit greasy, and the rice they use in the burritos is not all that, but other than that it is pretty good.  The salsa they use is nice and spicy, with good flavor, and the tortillas they use for the tacos are good.\n\nAll around solid.\n\nPlus, I ate here once a week for over two years and NEVER got sick or had any problems with the food, so if people are whining about dumb stuff they need to get over it.", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-19", "description": "The burritos taste OK. They're a little dry and lack any sauce.  For $6 you get a big burrito with meat, beans, and rice. They close at 2:30pm.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "Oh taco truck! Your burrito hits the right spot. Your veggie burrito is yummy.", "author": "Sherry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "Taco truck, you are the reason to why I have been jogging so much to lose weight. \n\nI found this taco truck while I was working at CNET, and as disgusting as it may sound. I once went a whole week, only eating at taco truck. But do you blame me? The burritos here are the best i've ever had, possibly the best i've had in general. \n\nFor the price of a burrito (roughly $7), and the sheer convenience of just walking outside of my building, taco truck i love you.\n\n[APPROVED]", "author": "Eric T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-17", "description": "Amazing tacos from a taco truck operating out of the parking lot at Spear and Folsom. Walking distance from downtown and parts of SoMA. Absolutely worth the trip. Far better than any I've had in this area.\r\n\r\nSteak tacos and chicken tacos are both wonderfully tasty and spicy. And they include a whole radish as a side. It's the perfect balance to the spiciness of the taco.\r\n\r\nIf this were an indoor sit-down place, I'd give it five stars.", "author": "Pat T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "OMG! Have to share this.\nSo we *used to* have a Los Compadres taco truck right near work (over by Pier 39) and my friend and I were the first two people on our floor to try it. It was so good that we raved at a department meeting and soon everyone was going there for their cheap luch fix. \nSadly the port authority ran them off cuz they were parking in a paid parking lot owned by the port. Now I think that particular truck lingers in the VanNess @ Market area. We tried to drum up an email campaign to get the Port to let them stay but it did no good. *sigh*", "author": "Rosana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-22", "description": "I like this place. And compared to Poncho Villa on the warf or the other mexian joint in the ferry building, you're better off going to this place if you like honest/decent prices (dont want to get ripped off) and dont want to be overwelmed with what to order. Obviously its  taco truck, so its down to the basics here. \n\nMy favorites and best deal here: \nSuper Taco for $4 - i dont know who came up with this price, but it is a steal considering the amount of food you get. not to mention it is the best super Taco compared to anywhere! it includes choice of meat, rice, lettuce, salsa, guac, sour cream, choice of sauce, pickled jalapenos, radish, limes.. oh god its soo good.. i didnt think you can get stuffed for $4.\n\nThe next best thing: Quesadilla a little over $3. Ok, you think  you've had a good quesadilla.. but not liek this place. there's something i really appreciate about simple food thats made right, and it makes a whole difference. \n\nTry the Tongue when you can - its awsome. \n\nReason why it I did not give it a perfect rating - the burritos and regular tacos are just average. \n\nBut order the right thing here, and its 5 stars all the way.", "author": "Mai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "These are probably some of the best burritos I've ever had.  I usually get carne asade or the al pastor with black beans, and if I'm being good (which is rare) I only add the guac.  \"Super burrito\" isn't on the menu anymore, but it's just the regular burrito with all the extras, making it a 7 dollar totally-worth-it lunch.  If you're able to pace yourself and not devour the whole thing in one sitting, the burrito is at least a meal and a half if not two.\n\nA friend noticed these burritos were not as soggy as others, and long and thin instead of short and fat.  This makes the burrito portable, and while you can use a fork/spoon to scoop out the goods like you would an ice cream sundae, utensils are not required.\n\nGet here early (before noon), grab some burritos, walk down a few blocks, sit on the grass and look out at the water.  Relaxing, low key lunch with friends.\n\nCarnitas: Mix of tender pork and chewy, really fried up pork.  Doesn't particularly float my boat, but tastes good.\n\nSalsa hotness: Sometimes I get mild and sometimes I don't, and when it's mild it's spicy and when I ask for spicy it's mild.  I think it's the pico de gallo you can specify spiciness for, but I never know what to expect.  Still, always tasty.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-21", "description": "First timer at Los Compadres and I must admit I wasn't expecting a food truck at all. When my brother asked me if I wanted to go to a burrito place I thought he meant a restaraunt!\n\nHowever after eating street meat in NY, Los Compadres wasn't at all intimidating. \n\nGot here around 11:20am on a Friday for lunch and there were already a couple orders in front of us.\n\nOrdered a carne asada burrito with guac and pico de gallo = $6. I think the best thing about my burrito is it's size. It's not so huge that you will go comatose back in your cubicle. I also did not feel guilty (about the calorie content) after eating this burrito like I usually do after Chipotle. The rice was really good and the meat was juicy. Also the burrito was really hot (temperature wise) which I love because I hate luke warm meals. Even though to add guac and salsa is an extra $0.50 each....the portion was generous and evenly spread (my guac was not all on one side like how some places do it).\n\nI would definitely go back again if I need a burrito fix.", "author": "Terry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-10", "description": "One word: AWESOME! Who knew street food from a taco truck could be so good and cheap. The lines tend to be long around Noon so plan accordingly. I ordered a carne asada burrito with black beans and hot sauce so they hand me my burrito after a couple of minutes waiting. As I sit in my office, I totally forgot to get salsa and figured what's done is done so I take a bite and it was one of the best tasting burritos I have had in quite a while. Normally I slather the thing in salsa to give it moisture and believe me when I say it was cooked perfectly -- needing nothing more than extra napkins as you devour the thing. I will be back to try the tacos which I heard are da bomb. \n\nP.S. Don't be the douche who wants to see the sliced jalapenos to ensure they are cut correctly. People behind you are hungry and your stupid questions only make things worse for everyone. BTW: I know they probably didn't but you never know if they added a little something something to your order for all those wonderfully time wasting questions.", "author": "S L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "warning: this is spicy and it's _no_ joke. I learned that the hard way and I seriously can eat most hot stuff without a problem.  I admit i thought this was a place that served Gap and Google employees \"mexican\" food.  boy was i wrong.  it's real mexican. The green pepper had me drinking 2 glasses of tap water and 2 glasses of milk! haha. it wasn't funny then. Enjoy but be warned. it's local spicy.  I had the el pastor tacos w/spicy sauce.", "author": "Emm C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-16", "description": "I used to not be a very big fan of Mexican food but ever since my first encounter with the taco truck I have been forever turned...carnitas super burritos will someday be the death of me, but until then, they're like christmas presents all wrapped up in shiny foil and I'm like a little kid waiting to unwrap my gifts.", "author": "laura q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-01", "description": "I've only tried the burritos so far (~5 visits), and liked the chicken better than carnitas (although it is my favorite usually).  I agree with James J. who said the carnitas wasn't as good as he would have liked. IF the carnitas was better I would eat there every week, because the taco truck is SO close to my work!\n\nGood sized portions for the price.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-25", "description": "This is some of the best Mexican food I've ever had.  The fact that this amazing truck is right next to my work is even better.  On a long Friday filled with reporting while hungover from going out the night before, this taco truck is my salvation.  \n\nThe first time my coworkers took me here they recommended the carne asada super taco, which was dead on.  I order it spicy with black beans.  It comes in a nice box and is huge with lettuce, guacamole, cheese, sour cream, beans, carne asada, tortillas, radish and lime.  This truck has never given me bad food and I usually hit it up once a week.\n\nDon't be afraid that it's food from a truck - once you try it you'll understand.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-18", "description": "Not sure why anyone would give this place less than 4 stars.  It's the real deal... just like the taco wagons in the Central Valley towns of Riverbank, Hughson, Patterson, etc.\n\nI had the chicken burrito... VERY good.  I ordered it with black beans which were slightly undercooked; next time I'll go for the refried beans and I'm sure it will be excellent.\n\nAs for those of you that are a little wary about grabbing a burrito from a taco truck... Los Compadres proudly displays their perfect Food Safety score (100%) from the San Francisco Department of Public Health.", "author": "Marc H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-27", "description": "The tacologists at Los Compadres make a pretty good burrito for a reasonable price.  Also they can wrap like no other.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "most taco trucks i've been to always have delicious mexican food. this is the only decent place to get mexican food. the place in rincon sucks, burr-eat-o's sucks. there isn't really anything else in a half mile radius at least that can compete with this truck. \n\nI'm not saying this is the best mexican food EVAR, but in the area, there is no contest. You will not be disappointed if you eat here", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-13", "description": "Delicious tacos!  The al pastor and pollo asado are amazing.\n\nMy coworker discovered this place on Monday, and he has been every day this week (it's now Wednesday) while I have joined him the past two.\n\nCheap, easy, and tasty.", "author": "Travis R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-27", "description": "me: \"hey liz, are there any good places around here to get a burrito?\"\nliz: \"i think there's a taco truck down folsom but I'm not sure\".\n\nsuch a simple banter ended so magnificently it's just disgusting.  I only get 30 minutes for lunch, so the further I walked from 3rd street the more scared I became. \n\nLo and behold a lone sign saying \"taco truck\" took me down an alley and there she was.  \n\n10 people in line before me, I figured this place had something special so I chose to wait.  20 minutes later armed with my carne asada super burrito (exttra spicy of course) I rushed my ass back to work, making it back juuust in time for an at desk meal.\n\nnow at this point, my standards were raised.  I mean i could have gotten a pita wrap down stairs and not walked or eaten uncomfortably, but goddamn did this burrito make it worth while!!!\n\nYUM.  the tortilla was grilled to perfection, and the ingredients were happily mushed together into a delightful burrito surprise exactly the way they should be.   The hotsauce wasn't really spicy at all... but I got chips/salsa on the side that made up for it.\n\nI'll be back again, and next time I'll run faster!  i wonder if the tacos are just as good..", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "These are the greatest al pastor tacos of all time. I think I ate 150 of them over the course of the 3 months I was in SF on my internship, working nearby....those tacos have yet to be challenged. (Get the spicy ones!)", "author": "Sanketh Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "My go-to mexican place for tacos/burritos in the fidi. Forget the El Faro, baja fresh, and such. This is comparable to mission taquerias! I usually get the super tacos and a bag of chips and eat it as nachos but the super burritos fill me right up when i'm famished. best to get there when they open at 11 or you'll end up waiting a bit for your food.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "So good!  Big ass chicken burrito (beans, cheese, rice, hot salsa and chicken) for $5!  Loves it.   Why is Pancho Villa charging me $8 for the same thing?\n\nAnd there were cute guys in line, too!", "author": "Jackie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "Deliciousness.\n\nIt's a regular stop for lunch. At work, on almost a weekly basis, one of us will suggest the \"taco truck run.\"\n\nYummy tacos (the carne asada and the el pastor are both so good...) It's worth the wait. $1.50 per taco. I always get around 3-4 depending on how hungry I am. Although one time I scarfed down 6 in one sitting, which I believe makes me the record holder in the office. \n\nWe'll usually buy some and on a nice day, take it down by the water off the Embarcadero. Niiicceee.", "author": "lily l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-20", "description": "This is the best option I've found thus far for a decent burrito in the Financial District.  There is usually a pretty long line, but on a nice day I don't mind.  I like the El Pastor Burrito with black beans.  They usually ask  you what kind of beans you want and if you want it spicy or not.  Their version of spicy has a pretty decent kick to it.  The wait is usually about 5-15 minutes depending on the line, but the burritos are pretty damn tasty and worth the walk over from Market/Beale.  \n\nIts not to far from the water, so ordering a burrito and taking it down to the waterfront on a nice day is the bomb!", "author": "Ed B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-04", "description": "If you work in SOMA, you'll know that it's difficult to find good, affordable eats.  Which is exactly why I first tried The Taco Truck.  $5.50 for a burrito was a rare find.  The veggie burrito and the chicken burrito were okay.  The chicken was a bit heavy on the onions, but I am NOT an onion fan.  Now the Al Pastor (bbq pork) burrito...nothing less than a spicey, flavorful party in your mouth.  I always get the mild salsa, but even that has quite a kick.  The rice to meat to bean ratio is perfect and the quality of the burrito has been consistently satisfying.  Be sure to have some TUMS on hand (hey, eating spicey comes with a price) and if you come here any time after 12pm, expect to wait in line.", "author": "Joy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-10", "description": "2 chicken tacos\n1 carne asada burrito with guac\n\nGrand total: $9.  If you have a healthy appetite and less than 10 clams, this is the place.  \n\nThe chicken tacos were probably the best I've had in a long time.  The carne asada was pretty average (although authentic). There was a good sized line around the truck, but things moved along quickly and was well worth the ~10 minute wait.", "author": "Sunil A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-17", "description": "In an area lacking good Mexican, this place is better than the rest and cheaper. I usually get the chicken burrito which for five bucks is an aiiight deal. Be careful though, the salsa espicy is spicy ~! \n\nA great place to grab a burrito on a sunny day and enjoy the views from the embarcadero.. seen!", "author": "john C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-14", "description": "For me, Los Compadres makes the perfect (regular) burrito -- fresh ingredients (cilantro and tomatoes burst), carnitas (crispy and tender in the right places), and it's the right size (I can easily over eat a whole forearm-sized burrito and always regret it). I hate over-stuffed, mushy, wet burritos, so no guac, salsa juice, or sour cream. Service has always been fast, organized, and accurate. At $5 (veggie) and $5.50 (carnitas), it's the right price, too. My only complaint is that I have to walk 4 blocks from work to get one.", "author": "D F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-30", "description": "I was really excited to eat here. I read the reviews and was excited for greasy, basic, San Diego-esque taco truck food. I ordered the three soft tacos, one carne asada, one carnitas, and one pollo. All spicy. The guys were awesome and it was fast, but when I went to eat it, I honestly couldn't tell the difference between the three. At all. I'm wondering if maybe I got another person's order. \nTo that effect, whatever meat I did eat was just alright, not a ton of flavor. I've definitely had better and cheaper taco truck food.", "author": "Brittany B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "I got the 3 tacos (I chose tongue!) for $4.50.  The tacos were loaded with onions, cilantro, and hot sauce, and the tongue meat was very tender with good fatty bits.  The picante sauce wasn't quite hot enough for my taste, but kept a nice warmth in my mouth for the next five blocks of walking after I'd scarfed down my tacos like some sort of disgusting crack fox.  As an extra bonus, I was very happy to see the cleanliness score of 100% they had been awarded last March.  Good street food, all around, even though they were out of carnitas and there was no head/brain meat.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "I love the spicy carne asada burrito w/ black beans and guacamole for only $5.50. It's big, cheap, and delicious. Get here early or prepare for a long wait as they prepare your food. Today I waited 20 minutes because there were about 15 people ahead of me. Crazy, but oh so worth it!\n\nBonus point--they serve Coke in glass bottles!", "author": "Alice N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-15", "description": "Absolutely love this place and I'm one of those transplanted Texans that always complains about Cal-Mex.  This place rocks!  Expect lines, but they move through it pretty quickly.", "author": "Rene H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-22", "description": "*tear*  \n\ngood, authentic & CHEAP mexican food.  HOT hot sauce.  nice guys in a truck cookin'.\n\nmakes this native San Diegan feel like i'm just steps from the border again.\n\nit's like \"home\" :)", "author": "Carol O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "On a sunny day, there's almost nothing better than grabbing a budget-friendly carnitas super taco (fully loaded with rice & beans, lettuce, cheese, avocado, sour cream, fresh salsa and a perfectly tongue-tingling hot sauce) for an outdoor lunch along the Embarcadero.  The pork is perfectly salted, and chewy/crisp -- in other words, perfect.  Don't plan on being productive after finishing a meal at Los Compadres, though -- you'll be blissed out in a food coma.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-06", "description": "it's decent. i ordered a super burrito w/ carnitas. i asked for \"mild\" sauce. oh boy, i'd hate to try their \"hot\" sauce ... my mouth / face was on fire ... sweat pouring down my face. the carnitas wasn't as good as i would have liked - it was a little tough. i'll have to give this place a few more tries (perhaps order the chicken next time, which is supposed to be good) before i base an overall honest opinion about this place.\n\nUPDATE: so i went back today and ordered the grilled chicken super burrito - thinking it'd be better. not the case. the chicken tasted old and there were a lot of pieces with gristle in it. this place is getting rave reviews, but i want to like it and i've given it two chances thus far, but i think i'm done with this place. i originally rated it 3 stars, but i removed one - based on today's experience. maybe the tacos are better?", "author": "James J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-23", "description": "Unreal.\n\nI was born and raised in LA (yeah yeah, get over it and keep reading) , and while I can honestly say that I find SF to be superior to that sprawling megalopolis in just about every way...Mexican food ain't one of 'em. Yet, for the near decade I've lived in this city, I've had to suffer through Bay Area denizens praising such-and-such taqueria for their \"great chips\" and \"awesome burritos.\" But you know what? You don't get Mexican food for chips and rolled tortillas. Don't get me wrong, those things are good..but there's a lot more to it than that. The pinto beans (you want black beans, go to Cuba, honey) melding ever-so-perfectly with seasoned meat of your choice and a mixture of sour cream and guacamole that is a concoction in and of itself...cheese that's not froufrou and overpowering, but puts just the right finishing touch on a pico de gallo with a kick low enough to allow you to keep eating without putting your fork down. This is Mexican food. And where did I FINALLY find this in SF? My beloved Los Compadres Taco Truck.\n\nThat's right. Tucked elusively on a corner across the street from the Gap building, with maybe 4 metal tables and chairs on a pigeon-visited sidewalk, my Mexican haven sits and beckons passerbys with smells reminiscent of East LA's El Tepeyac (a.k.a. Manuel's). That's a good thing, btw. And like any good taco wagon, it's dirt cheap. I'm pretty sure you pay dollar for pound at this place, which means my Super Taco (don't let the name fool you - you can't imagine what this really is) is 5 pounds. When I add my Specialty's cookie from up the street to that order, sure, I'm too weighed down to get up from my desk for an hour. But after that hour passes and I've washed it all down,  I'm ready to do it again - no regrets!", "author": "Kiesha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "Everyone else has said it, but it bears repeating....  Not as cheap or as tasty as you'd get in the Mission, but one of your best bets for Mex food in CubicleLand.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "Certainly not the best truck in the Bay, but the food is very decent and damned if the super taco isn't enough food for both lunch and dinner... for $5.", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-29", "description": "Los Compadres (or El Tonyaense if you're at Best Buy) is just ok. It's not the cheapest, fastest or most delicious of taco trucks, but it's nice just having one there. The best part about these guys is that they rent out their services (mobile catering anyone?) for parties. If you decide to brave the truck, here are a few things to keep in mind: 1. DO speak up; the order window was made for guys 6ft tall and up, 2.) DON'T pay any attention to the section of the menu with the regular tacos, they're teeny and more like potstickers made with tortillas before they get rolled up, 3.) DO try the super tacos, mmm, they're the star of this show for sure. Somehow they're closer to nachos than tacos, but delicious nonetheless, and way better than the burritos, which are just so-so.", "author": "Mandy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-02", "description": "Twice, I tried the super veggie burrito ($5) and it was terrible. The rice was burnt. The beans were dry. Way too much sour cream. No salsa to speak of. Not spicy. No chips. One napkin.\n\nIt's nice to have mexican food close to your work, but I think any Mission tacqueria that was reheated would beat the soggy mess of this taco truck.\n\nAs I was picking up my order I asked for salsa and the guy said it was already in the burrito. I asked for extra and he said it was 50 cents. Give me a break: you're charging for a thimble of salsa??!!?", "author": "Mac G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-26", "description": "Had a al pastor burrito from here.  Nonplussed.  Meat was overcooked, oily (not the good kind either), mushy and not very tasty.  I seriously doubt I'll be back.", "author": "Mary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "3 tacos for $4.50, one pollo, asada, & carnitas...can't beat that.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-02", "description": "I used to work in the Gap buildings on this street, and so I've had my share of their chicken burrito many times. I always told myself that I'd just eat half of the burrito, but it was always too good to leave any leftovers. What I like about their burrito is the meat, which is infused with great flavor. The cilantro makes it even better! I agree that it's better to go earlier than later because there's always a line of people.", "author": "Michele O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-05", "description": "Not to sound like hater or anything but i got violent food poisoning from eating here. If you read my pass reviews you can tell i heart Mexican food. i ordered 3 tacos carne asada and carnitas quesadilla for lunch. That evening around 5 pm something didn't feel right. Next day PTO day due to violent yakking and dookie booty. aiyaaa no good for me.", "author": "maria t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "I usually get tacos here, which I feel deserve 4 stars.  But the burritos are MEHHH!  2 stars.  They're ok but I've had better.  Maybe it's the seasoning of the rice & beans.. don't know what it is but I would rather get the burritos at Rincon Center instead, which taste better and are cheaper...  Unfortunately I have to bring down my rating to 3 stars.  Regardless I will continue to be a dedicated customer... but I'm going to stick to the tacos from now on!", "author": "Justine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-10", "description": "They don't call it the super taco for nothing, the burritos are asi asi, but i'm so down with my friend supertaco, and i love spicy mexican food and if you tell them to spice it up they will", "author": "Chrammy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "This truck won't be replacing my regular lunch routine spots, nor will it be replacing my burrito vendor but in a pinch and considering it's the only one in the area,it fills a need. The pastor was tasty, but a little light for a \"super\" and I got the majority of the cheese in the south end of my north-travelling 'ritto.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "I was shocked that I could get a burrito this delicious from a taco truck. You will not be disappointed if you go for the carnitas super burrito. Yum yum yum!", "author": "Erin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "Oh, those little tacos, I love them good.  Perfect little tacos (not the super tacos) with radish and jalapeno on the side. Well worth the walk and the wait!", "author": "Ashton E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "amaze. great service. awesome fried pork and bbq pork tacos.  quesadilla with chicken was shockingly good too, v fresh and chicken-y.  $6 for 3 small soft tacos.  so delicious.  would go again if i lived in the area. and by again i mean several times a week.", "author": "mary l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "The carne asada quesadilla is FANTASTIC. I often get two quesadillas (the other one al pastor) and a bottle of coke. I'll eat half and half of each and save the other halves for an afternoon snack or dinner.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "This taco truck is good for 1 menu item - Tacos! Go figure! The burritos aren't all that. But their tacos are perfect. The sauce definitely has a kick, so be cautious. But I love spicy food, so I loved it.  I always get 3 tacos with carnitas - $4.50. Never been disappointed!", "author": "Samir P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "update 5/29 -- just had the super taco and wow!!!!  4 bucks and a good hearty meal.  not too unhealthy either especially if you dump the sour cream and get the black beans!  can wait to go back!\n\n---\n\na good burrito for the price!  the key here is to order no rice and you in turn get lots more meat.  i had the carne asada super burrito and while being tasty, it had way too much cilantro, not enough cheese and not enough guac.  the burrito was a definite gut bomb that effectively stopped me from being productive at work afterwards.  next time i'll try out the tacos, which i hear is quite good.", "author": "Swarup B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-01", "description": "I loved my chicken burrito.  Loved it so much that I ate the whole thing.  Yes, that's right - the whole thing.  Packed full of spicy salsa, cilantro, and the perfect balance of rice/cheese/guac to chicken, I am ridiculously full and equally happy.  Next time, I swear I'll cut it in half immediately and save the rest for the next day.  Really, I will...", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-03", "description": "came here to get some tacos cause it's close to work. i'm not a big fan of soft tacos but hard shells arent exactly REALLL MEXICAN either, but still i prefer hard shells. anyways for $5, you get 3 soft tacos, some beets, carrots, and a big pepper which was pretty good. It wasn't that filling for me (maybe cause I havent eaten all day), but it was pretty good and spicy. It was a little too spicy but then again, i didn't pick which spice I wanted. Overall, it was affordable in the area and it was decent. I will come here again and try the burritos or quesadillas!!", "author": "Marsha C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-11", "description": "So many had bad stuff to say about \"the Taco Truck\".  I have not had a bad experience at this mobile establishment.  All pretty delicious and delightfully spicy.  I was a little disappointed in the price increases, but still cheaper then eating at a lot of the other places downtown.  I gave it 3 stars for being a tasty taco truck.  I've had better, but it hits the spot.  Pull up Folsom St & Spear St on Google maps Street View and you will see the taco truck in action.", "author": "Shea B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-02", "description": "decent food. i made the mistake of ordering 2 super tacos one day- whooa nelly 2 much food!!!!!!!!! Great taco though. Pretty big portions.", "author": "Dizzy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-04", "description": "Get the chicken if it hasn't run out. There's something about this place. Service isn't always the fastest, but the taste keeps me coming.", "author": "Wil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "For lunch the other day I decided to get out of the office and treat myself to the taco truck.. I've heard so much about it from my co-workers so I went over there and stood in the LONG line. I was there about 1:00 on a Friday so who knows if the line is longer or shorter at 12:00 noon but it is a bit of a wait. I ordered a Chicken Taco with the works- I think it is the Grande? It comes in a box with 2 flour tortillas at the bottom and the \"filling\" on top. Technically this is an open-faced taco.. aka Tostada. I just want you to know what to expect when you open the box as it doesn't look like a taco. This was the perfect amount of food for me; I think the burrito would have given me a serious food coma. I will definitely go back  when I visit our SF office on Spear.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-05", "description": "Stellar al pastor and pollo asado tacos. Probably the best I've had in the Bay Area. Normally I don't get carne asada or pollo asado since they tend to be flavorless and dry, but the meats here were tender and juicy. Next time I'll try the carnitas and lengua.", "author": "Brooks S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-12", "description": "I got a regular carne asada burrito for $6, and it was just ok. Not as big as burritos in the Mission at comparable prices, and the meat had too many tendons (or whatever those hard-to-chew bits are), making it awkward to eat in front of coworkers.", "author": "M H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "i've been to the taco truck in the civic center hood, and both times have been pleased with my orders.\n\nthe supertacos are heaping with lettuce, cheese, radishes (yay), and come with a side of hot pickled peppers (yay again). awesome.  you'll find the meat and beans buried at the bottom. squirt some lime on the whole thing, stir it all up, and go to town. \n\nmy friend had the super burrito and that was really tasty as well!\nin fact, i dare say it was one of the better burritos i've had in a long, long time.", "author": "jennifer y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "I don't know WHAT took me so long to review Los Compadres, but they have the best deal and yummy food. They pack my all meat burrito with carnitas that I get like a pig in a tub full o'mud - HAPPY! Oh and their three taco deal for $4.50 is a steal. After I've cleared my head w/a walk along the Embarcadero I usually reward myself with a trip to the truck. Ahhh life's simple pleasures...", "author": "C P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-28", "description": "I so badly wanted to love this place. I work two blocks away and am a burritoholic. Nuff said. But now that I finally had the chance to try it out after my office moved the neighborhood a few months back, I'm disappointed, and the chances that I will become a regular are slim. \n\nIn fairness, there was a lot to like about the carne asada burrito I ordered. Good balance between meat and beans and rice and other ingredients. (You gotta hate a bad beans-to-rice-to-meat ratio.) Salsa flavorful. But overall, the thing was just too damn greasy. A little bit is understandable, especially from a taco truck. But this was out-of-bounds oily. Oh yeah, and when I want salsa picante, I want it picante. So-hot-you're-wiping-sweat-from-your-brow hot. This didn't come close.\n\nI'll give this place another chance to redeem itself and will revisit my review if it does. But for now, sorry Compadres, I'm taking my bad burrito-eating self elsewhere.", "author": "Tom G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-15", "description": "Just had a carne asada taco there. Delicious! Service was great, price is outstanding, I will definitely be coming back soon, like, in an hour. =)", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "This truck ranks in my top three favorite restaurants in the city, I'm still trying to think of the other two. I used to work down there, so it was perfect, the little seating area is brilliant, with the canopy protecting you from the sun, giving you a 5 star, fine dining feel, you know? My only gripe is that there's no beer, and how perfect would that be? C'mon fellas, just keep an iced cold tub full, no one will say anything. They'll be thrown into the sea. Have I been to heaven? Well, try the carnitas quesadilla, with a little extra cilantro, and spicy, and you'll know what I mean. EAT THERE!!!!", "author": "Maui G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-07", "description": "I wish they sold Mexican coke, but they do have a great burrito for 5 bucks.  I like the little seats right along side the truck.  It's a good spot to sit away from my tiny little cube and people watch for an hour at lunch.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-01", "description": "This burrito truck is fantastic and the price is right.  It is about a block away from my office and I make it a point to go at least once a week.  I also make it my responsibility to introduce any new hires to the burrito truck when they join us.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "Hey, picked up lunch a few days ago ... and good food for a truck.  Not bad!", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-16", "description": "love this truck! i am a sucker for street tacos and the ones coming from this truck make it seem unreal. how can such a delicious fete come from such a mobile home? the tortillas are some of the best and do their due diligence in holding the yummy within. the carne asada is tender and juicy. and, i am in love with cilantro and lime...so, the more the better. the side of pickled veggies are just a bonus. taco truck...i am sold, where do i sign?", "author": "Marjie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-25", "description": "since i work across the street, i frequent this place A LOT because it's consistently good and consistently cheap. \n\ncarne asada super taco :)\n\n\ncan't go wrong with this place.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-04", "description": "Pros:\nGood flavor. \nMeat is seasoned well and juicy\nHot sauce is spicy\nFresh ingredients\nPrice\n\nCons:\nNo $1 taco truck tacos!\nCharged me for a super burrito and gave me a regular burrito!\n\nCome back? \nYes. I will give them a second chance to give me what I ordered", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-18", "description": "I am new to the city and a co-worker introduced me to this taco truck.  It is fair to say I was skeptical at first, i mean common, street meat?  However this place is extremely clean and the food is delicious, I am by no means a expert of mexican cuisine however this is the best burrito I have to date in San Fran.  The pork is so tasty I want to eat it until I lose consciousness.  Need I say more?", "author": "Nolan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-20", "description": "i heart the taco truck!!  first of all, it cracks me up that its a truck that randomly parks near my office and has yummy mexican food.  but once you get around the part that your food is cooked in a truck, its all good!  my faves include the tacos and the quesadilla, but i havent tried the burritos yet (although they look bigger than my head!).  i am all about the spicy chicken - its great.  some people have said that it can be a little dodgy, but my experiences have been okay so i stick by my 4 stars!  caliente!", "author": "Carolyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-07", "description": "OK, I finally tried this place again and it is pretty good.  Not as good as most joints in the Mission but hey this is a taco truck after all.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "pretty good burritos for downtown, definitely kicks bur-eat-tos ass on both flavor and price, ouch bet that boins! proud mary keep on boining... Also just a note to that person flipping out about an eyelash in their burrito, did it ever occur to you that it was probably your eyelash?", "author": "Ian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-19", "description": "I heard great things about this taco truck from several of my friends. Shared the taco plate and the burrito. Tacos had the typical cilantro, onion, and hot sauce with a radish coin. Hot sauce was really spicy, but I enjoyed it. The carne asada and fried pork were good but the lengua I didn't like too much. It had a weird taste to it. I know, it's beef tongue but, still weird. I've had them at other places and the beef tongue flavor is usually well masked so you don't taste the \"tongue\". I'd probably just stick with the carne asada and fried pork next time. The burrito was good. Great deal. I'd go back.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "thanks to all the yelpers my bf found this taco truck ....i love taco trucks!  we got here during lunch rush hour so the line was pretty long but worth the wait.  we ordered 3 tacos and a super burrito...let me just say carne asada is the way to go.  i havent found a taco truck that ive loved in a while.  now i have two favs....one in the city and another in the east side of san jose.  i cant wait to go back.", "author": "Sheryll D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-01", "description": "Went there today to order a carne asada regular burrito for $5.50.  sign said meat, beans, rice, hot sauce, and cilantro.  apparently, they forgot the cilantro.  also, meat was on the dry side and a bit salty.  size WAS NOT huge.  just okay.  cheese, pico de gallo, guac cost extra.  so based on this visit, i give it 2 stars only (per yep, that means, \"Meh. I've experienced better\").  honestly, i think i prefer chipotle because i can get lettuce, cheese, and pico de gallo added for no extra costs along with a bigger size burrito for $6.85.  without any special reason, i don't plan to go back.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-04", "description": "When I hear taco truck, I say \"where?\"  I'm all for it.  So I had to venture out to try this one out, esp since Mexican food around my work is sub par.  The truck is very clean and they have some seating-- quite an upgrade I think.  I order a steak burrito and I am thinking that I really like it.  Except I spend the entire time thinking, is this beef or is this pork?  Beef or pork??  The meat was that mysterious.  I still dont know what it was.  It tasted good, was a little greasy (but I would expect that), I just have to know what I am eating, so that's why I gave it 2 stars.", "author": "Erica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-11", "description": "Awsome super taco! I was skeptical, but after seeing the crowd standing on the street corner, I figured there must be something to this and gave it a try. I live in the Mission and this is definitely on par with what I'm used to. However, $5 for a super taco is more than you would pay in the Mission, but a good deal for downtown. BTW, this is way better than the taco joint in Rincon Center.", "author": "V M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "had the carne asada burrito and it was just ok. the meat was a little over-cooked, as was the rice. if i worked close by, i'd probably still go here on a regular basis because i love burritos, but since i'm closer to taqueria mana, which i think is much better, i'll just stick with that.", "author": "AJ C."}
