{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "I only had their fish tacos and a small bag of tortilla chips, but I have to say these tortilla chips were even better than my homemade chips. They were delicious!!\nI wish there were more \nThe fish tacos were very good too.\nThe seasoning was just right.\nSpeedy delivery through grub hub too, right on time. Overall, a great experience.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "What's yum\n-fish tacos are amazing (it's an entire fish basically)\nChurros (delicious) \n\nAtmosphere\n-for the adventurous foodie who likes hole in the walls", "author": "Dianna Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "Super bummed. \n\nMy order was both wrong and cold...\n\nWas a very simple order and they arrived to me in a decent time so i'm not sure what would cause this..feels a bit careless sadly.", "author": "Sierra B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-30", "description": "a few summers ago, i started running errands & odd jobs for my chemistry teacher. he had me drive burritos back & forth every week.\n\ni began to notice some buckets of burritos had blacklight stamps on them. turned out those buckets contained burritos with blue crystal salsa.\n\nidk what that was all about, but i sure had plenty of pocket $ every time i was off from school.\n\n(^_^) Steak & Prawn Burrito $12\ntasty leaky #district9 good portion\n\n(-_^) Chicken Mexican Salad $12\nok wish had some kind of dressing\n\ni'll skip the salads n stick w other format dishes next time.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Probably the go-to taqueria choice in the 'Loin.\n\nIt's open late, there's plenty of seats and it's attached to a corner store so no need to be claustrophobic. There's a friendly cat that watches you eat your burrito. And most importantly, GOOD salsa! One of the main requirements of a good taqueria is good salsa, which Los Hermanos has in the bag. Also you can get free chips to eat with said salsa, which is always a win in my book.\n\nOpted for a super burrito with pollo asado. The burrito was huge, definitely more than I could finish. Not oh my god, I dream about this burrito but definitely made me feel better about getting a burrito outside of my normal go-to taqueria spots.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Solidly good food, friendly counter staff and the portion sizes are generous. The price is great and the salsas are delicious. Glad to have this place so close.", "author": "Lovely L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Best delivery option yet! I ordered tacos; they were fresh, had generous portions of meats, and anything I could think of having was included in the delivery bag. Forks, napkins, pickled jalapeños, salsa, pico de gallo, chips! I'd highly recommend this restaurant if you are looking for a good deal, generous amount of food, good food, and service. \n\nThank you so much Los Hermanos!", "author": "Asia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "I used to love going to this place and never had issues. The food was good. But tonight wasn't a good night for decent customer service. I called ahead to come pick up my food and I could hear the irritation in her voice when I asked for my guacamole and sour cream separate. Of course it wasn't separated and the beans are old and stiff as can be. It's not the cheapest either.", "author": "Mariah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I always get the California burrito and it's delicious to me!! Ya got fries inside and it comes with a side of chips. You can choose what salsas you want. Their agua frescas are good and vary. \n\nI usually only go here if I'm next door shopping at goodwill but overall it's a solid good place to get some Mexican food in my opinion", "author": "Cecilia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Mushroom quesadilla had more peppers and onions than mushrooms. Edible.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "This place gives you huge portions for a very reasonable price! I was a little disappointed when I went because they were out of enchiladas, but the burrito I bought instead was delicious!", "author": "Eden A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "REVIEW FROM A REAL MEXICAN. They down graded a lot lately. In 2018 they got the NASTIEST BURRITOZ FOR THE HIGHEST PRICES. Totally not worth getting your burritos from here. I live in the Tenderloin and I come here often. Im starting not to trust them with my food. I highly recommend you get them in the Mission District instead for a much LOWER PRICE and much HIGHER QUALITY. Every single time I buy here I feel completely ripped off for the quality of my burrito. They always fold the torilla up to take extra space in my burrito and put nasty left over meat inside my burrito. Its just completely fuken nasty. I suggest you check your food. Just tryna help you out. Eating nasty food can be really disturbing and disappointing. Especially when you look forward to eating all day. I actually threw away nearly my whole burrito. Have never done that in my life. This has also occurred on many separate occasions not just one single time. Please consider other places before getting your nasty burritos here. Just trying to save your life.", "author": "A E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "The taqueria, which also shares the location with a grocery store, has the honorable recognition from Yelp with a plaque posted by the taqueria's entrance-way. With the plaque and high ratings, that means the food has gotta be good. https://www.yelp.com/biz_photos/los-hermanos-taqueria-san-francisco?select=Fc1sl1hTHg2gFKga02m13g\n\nI have been here several times, even before Yelp existed. Despite not being here in a decade, the food is still solid as it once was when I was here when I was younger and fatter. \n\nOn my return back, I had my usual Carne Asada (Grilled Steak) Super burrito. For $7.99, the burrito has all the freshest ingredients, plus the Grilled steak was spiced and grilled perfectly. \n\nAs I was gnawing on my meal, I was continuing to browse the menu. The taqueria has also added Carne Asada over fries. We all know where they get the French Fries from. Something I might try on my next visit. \n\nThere is much seating at this taqueria. But when there are available seating, you will enjoy a great tasting burrito from the Tenderloin. \n\nCredit Cards are also accepted, which is also a plus.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "Avoid this place at all costs. The staff are incredibly rude. They act as if it's an inconvenience that you are ordering food from them. When I received my quesadilla, it was saturated in grease. The most unhealthy quesadilla I could fathom. Lastly, I left my wallet accidentally on the table I was sitting at. When I went back there to get it, It was gone. I was the only customer sitting in the restaurant at the time. And I know that they had to have cleaned up my table shortly after I left. I'm very questionable if it was an inside job. This place is as sketchy as the neighborhood it's in!!", "author": "Clint M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "A rainy night in SF calls for tacos. I ordered delivery to my hotel and it got there super fast even though they said it would be much longer. I got two chicken tacos and a churro (dinner of champions). The tacos were super flavorful and authentic. I had requested some salsa on the side which they forgot but ended up not missing it. The churro was so fluffy and warm -- perfect end to the meal. I'm not sure how the actual restaurant is but delivery service is great.", "author": "Pooja C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "I have ordered here twice over Grubhub and my first time was good. I wished they labeled my food so I didn't have to go through all of them. The food had lots of flavor and was proportioned right. Second time I ordered here the food was really dry. It was so hard to swallow my food because of how dry it was. I was really disappointed because this seemed like a good place to order tacos. I would recommend coming back but marking sure it wasn't dry.", "author": "Meryl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "I would really give this place 3.5 stars if I could.\n\nFor not being in the mission, this place is pretty good. I ordered an al pastor chimichanga and the bf ordered a carne asada burrito.\n\nThe chimichanga was just okay. The al pastor didn't have much flavor. The tortilla was perfectly fried, and the rice/beans were yummy. Overall 3/5\n\nThe carne asada burrito was good. The meat was very moist. Overall 4/5\n\nWhat really bugs me about Los Hermanos is the limit on salsa. You are only allowed 2 cups for a burrito, and the cups are small -about one ounce. If you want more, you have to pay $.75. I'd really like to see the limit increased to 3, or make the cup sizes bigger.\n\nService was just okay, this is your standard hole in the wall, with counter ordering. A smile and thank you would have been nice.\n\nThe price makes this place a 4 star and not a 3 star review. The food and drinks are very affordable by SF standards.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "Hate to be mean but definitely NOT living up to the hype. Not even close. Worst guacamole I've ever had! It tasted like a banana in a blender with some green food coloring. \n\nBut I hear several great reviews about this place so maybe whoever was working didn't know what was going on.", "author": "Yasmeen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Sometimes it's the unassuming small places that turn out to be the hidden gems. Sketchy neighborhood and an odd location, Los Hermanos is located within a grocery store. You might even pass it by if you didn't realize it was there. \n\nYears ago I tried Los Hermanos when out with friends for drinks, I had a couple tacos which were inexpensive and delicious. Now that I frequent the area, I stop in for lunch often. The plates are pretty big, so I always end up full or taking half back with me. \n\nI still love the tacos, however my favorites are the soups. Caldo de Pollo, Camarones and Res. A big hot bowl of comforting soup, like my grandmother would make. They use large shrimp in their dishes, which are my favorite. The Shrimp burrito is swoon-worthy. The chips are good, but the salsa bar is fantastic. I love the habanero salsa, es spicy!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "HANDS DIWN THE BEST MEXICAN FOOD IN THAT AREA... They're cooking food with love inside there the portions are huge it's small seating with a small grocery on the other side it's a awesome family business I've had the fried burritos quesadillas tacos prawns chorizo but I always order a burrito or the super burrito which should be called a MEGA burrito so many choices and options make sure to leave a tip for this family business cooking food with love not to many places doing that anywhere anymore!!!!! Food made with love!!!!!", "author": "Rolin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "This place is so solid. They accept online orders, so I can use my handy Yelp weekend coupons that I get (score!). The folks who work there are super nice. I think that the one main lady remembers me. She always give me that same look: you're gonna eat ALL THAT food? By yourself? (lol)\n\nI've had a fair sampling of their menu, and all of the items are of reliable quality. And when I request an extra thing of chips, they don't charge me :3 Real heroes, they be.", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "They don't honor their own hours and just close whenever they feel like it. The food is ok when you can get it but you can't count on this place to actually be open even though the only reason to ever go is that it's open late.", "author": "Randy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-09", "description": "It was my own fault for ordering fish tacos from a taqueria which is housed within a corner store. I don't know why I thought that a taqueria within a corner store would take the time to fry the fish to order, rather than tossing some pre-cooked fish sticks on the grill to warm them up. I cannot blame Los Hermanos for my own naïveté.\n\nBut I *can* blame them for the deceptive descriptions on their menu. To wit, \"cilantro & onions\" are not listed as ingredients included on the fish tacos. Nevertheless, after I observed the cook remove the fish sticks from the grill and toss them onto tortillas, I was horrified to watch helplessly as he sprinkled - nay, doused - the fish sticks with cilantro & onions. I do not eat onions. If the threat of onions had been advertised on the menu, I would have requested that the onions be omitted from my order. But I had no way of knowing that onions were even in the conversation! And before you say, \"Alexandra P., this is your own fault, you should have known that cilantro & onions are standard toppings at a taqueria,\" consider this: cilantro & onions are explicitly listed as ingredients in several other tacos featured on the menu. Because they are listed as ingredients on other tacos, and were not listed as ingredients on the fish tacos, the reasonable inference is that they are not ingredients on the fish tacos! This is a case where the absence of evidence should be evidence of absence, Los Hermanos! Get your menu right!\n\nI was not heartbroken when, on my third attempt at a bite, one of the fish sticks slid out of the tortilla and landed on the floor, rendering the taco inedible.", "author": "Alexandra P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "I wanted tacos from the Mission, but the roommate didn't want to go to the Mission after work and I didn't want to pay to get them delivered. After Yelping for lengua tacos in all areas between work and home, I found Los Hermanos. Located inside a grocery store, you can grab some Mexican food and buy drinks at the store to bring home. We stopped by Tuesday, September 1st around 5:45pm to grab takeout for dinner.\n\n*Special mojado (wet burrito): carnitas (fried pork), rice, beans, topped with enchilada sauce, melted cheese, guacamole and salsa, no sour cream ($9.45)\nThis thing is huge! The roommate seemed to like it and finished the entire thing.\n\nRegular taco ($2.95 each): corn tortillas, any meat, onions, cilantro and sauce\n*Carne asada: grilled steak\n*Al pastor: bbq pork\n*Lengua: beef tongue\n*Cabeza: beef head\nThe tacos were tasty and a good size. I wish they also had tripas as I was craving that as well.\n\nSalsa bar: \n*1 salsa per taco order\n*2 salsas per burrito order\n*4 salsas per plate order\n*Any more than that will result in being charged $0.75 for each\nI've never seen a salsa bar with rules, so this was a little off putting. I grabbed the six salsas I was allowed, but I probably would have grabbed a few more as we ended up using some salsa we had at home. $0.75 is too steep for a tiny container of salsa.\n\nThe food itself is probably a 3, but I'm bumping my rating up due to the sweet lady at the cashier. She was super nice and made sure my order was right before I left. That extra customer service always makes a difference to me!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-08", "description": "Came here and ordered to go. Got the enchilada plate with carne asada, when I finally opened it up to enjoy it. Guess what?! No meat whatsoever!! Big kine disappointed. Oh joy.", "author": "Keith Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Dude,  this place is freaking awesome.  All their sauses are fresh and on point.  The chicken is perfect.  Iv had the wet super burrito and the super chicken nacho and both we some of the best in sf.  This place is completely slept on.  Yes it is in a shared space with a store but just think of it as a bar lol.I love this place.   And they take EBT!", "author": "Jessii J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "This is my go to burrito place in the area. I only stumbled upon it after seeing the reviews on Yelp- so thanks for that! \nIt's very unassuming in the corner of a grocery store. But the food is really good. My favorite tends to be the steak and prawn burrito but recently I've been moving to the California chicken burrito. That's a great one to have when tipsy. As this place is on my way home\nI go here more often than I should. But for the area it's the best place i know. Wonder if they also do breakfast burritos....", "author": "Derek M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "Super bummed on the Prawn n Steak dinner. The prawns were good but would not describe the meat that suppose to be meat.\nOrdered Salsa and received 2 bags of chips with my order but no salsa.\nThis meal was sub par and not what I was excepted.\nVery appreciative of the delivery person to come out on a cold rainy night 5 stars to that guy.\nBut will not order the steak again.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Wicked!\nThis little place is a gem.... Has a liquor licence and a great little space for sit down. It's right in real San Fran... Inside the mid city foods supermarket. It's an experience for sure but the food is awesome. This might be the secret burrito place in San Fran! I did the custom order fish and prawn taco. It arrived the size of my THIGH! Wow... Really good. And free nacho chips with a selection of fresh homemade salsas. If your in this area and hungry... DONT MISS THIS LITTLE JOINT. I'll be back!", "author": "Blake R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "Avoid avoid and completely avoid Worst place ever ..ordered a super burrito veggie...was supposed to come with beans rice salsa lettuce sour cream and guacamole...instead got burrito filled with sour cream salsa rice and lettuce.no guacamole or no beans at all....spoilt my lunch....complete waste of money for $10....better eat somewhere else....wen I complained the waitress gave me a lil salsa cup of guacamole.....great where do I put it...she said open up the burrito and put it .....never ever again", "author": "Puneet N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-01", "description": "They intentionally put extra spices on their chicken to cover it's bad smell and taste, I only found out this when I ordered the mexican salad.\n\nAdd to that it's only thighs and wings meat , no a single breast!\n\nWhoever cooks or manages this place should really be ashamed, YOU'RE A MEXICAN RESTAURANT WHICH CANNOT DELIVER A MEXICAN SALAD!", "author": "Abdulrahman A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-12", "description": "Too many rules. Signs everywhere of what I can and cannot do. \n\nOrdered a shrimp burrito, it was relatively okay. It came apart halfway through eating it. Shrimp was overbooked. Boyfriend ordered the chicken burrito and he seemed to enjoy it.\n\nThe only upside to this was there was kitty snoozin in the chair next to me.", "author": "Shela D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-21", "description": "Terrible customer service, the food is nothing special either watered down or mostly bones.", "author": "Stacy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "Meh....\n\nIt's open until 2 AM and therefore perfect for when you've just gotten out of a concert and are craving a burrito, but at the end of the day the food is totally unremarkable. It's edible, it's cheap, it fills you up nicely, but it is undeniably low on flavor.\n\nI got a veggie burrito; so did a friend, and I confess I was rather miffed to see that his was quite a bit larger than mine. We paid the same price, so what's up with that? Consistency, folks; it's important. Rice and beans were bland and the burrito itself was understuffed and skinny. With added salt and salsa, it was fine and I polished off the entire thing in one go.\n\nChips were good and there was a nice variety of salsas, but they put a limit on how many you can try per order. I got the pico and an oily red one--both were lacking in salt and heat.\n\nThe water situation needs rethinking. Cups are the size of a thimble, forcing one to continually go back for refills.\n\nService is friendly and quick. Others have commented on the ambiance, but frankly who cares when the place is also a supermarket? Just doesn't seem relevant when they're clearly not trying to cultivate any image but cheap, hole-in-the-wall taqueria.", "author": "Ellery D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "One of my favorite places for Mexican in SF. They don't have much in the way of seating, but that's pretty rarely a problem. All the food is quickly made with fresh ingredients. Great place to check out if you're in the neighborhood!", "author": "Ally F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-19", "description": "Awful service. Gave me the wrong order and that order was taken back and delivery person disappeared.  No one responded until 30 mins. after.  When they told me they made another burrito for me, I had to wait another 30 mins. and it came out crispy,  browned wrap and inside tasted hella good at the time cause I was starving.  Won't recommend this place. Delivery kid on the bike, learn to take care of delivering the food.", "author": "Theo A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "Good place for an easy burrito or taco. The rice has that's placed in the burritos has cheese in which adds to the flavor. There should be a bit more spice in the meat and salsas placed within the burrito.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Came here for some quick tacos. It was close to our hotel and looked decent. We got al pastor and carne asada. The asada was ok and if you really are craving a street taco this could help. Now the al pastor was another story, it wasn't bad but not what an al pastor taco should taste like. It's cool they're open late and they were super nice!", "author": "Carly B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "WORST BURRITO EVER. the salsa is weird tasting, the guacamole is more of a purred avocado/banana taste. The only good thing was the Michealada. For a good ass burrito go one block down to Los Colores. Amazing!", "author": "Michael W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "Stopped by to have a late lunch with my grandparents only because it was one of the first restaurants to pop up on Yelp with decent reviews nearby where we were headed and ordered: chicken fajitas, camarones a la diabla and a vegetarian burrito.. the beans lacked salt on both of the plates the fajitas were cold with no flavor. Shrimp lacked flavor as well. What really threw me off was that when I went to use their restroom there was a cat laying on some boxes in the back which I consider a potential health  code violation. I understand that this a taqueria inside of a \"liquor store\" but that is very concerning and a bit disgusting. However we had ordered and paid by the time I saw the cat. Once we were leaving it has actually come up front and was just eyeing the kitchen! Yuck.. I hope we do not get sick!", "author": "Celeste R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "Really wanted to like this place because it's so close to my home. But wow. Worst guacamole I've ever had. I think they've mixed it with water or some other liquid to save on costs. Their other food might be tolerable, but without edible guacamole it's just not worth it...", "author": "Sherry N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "Your delivery drivers are stupid. They handed my food to some random person standing in front of my building and left. Are you kidding me? Ask for the persons name before you hand off the food. Not \"hey is your name Laurie? Here's your burritos.\" And some random idiot is like \"well yes, my name is Laurie and I will take those burritos.\" You guys suck and your drivers are stupid.", "author": "L N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "If you're expecting gringo Mexican like Chipotle, or are scared away from divey places, stay away. However, if you're looking for affordable, tasty, fresh-made legit Mexican food, this place is just right.\n\nBased on Yelp reviews I stopped in tonight. As the reviews suggest the place is like a little diner in the front of a Hispanic grocery. The lady at the front counter was extremely friendly, and I ordered an assortment of tacos to really experience the place. These are classic street tacos with meat and a sprinkling of cilantro and onions and a very tasty charred salsa. The Carne Asada and Pollo Asado were excellent; the Chorizo I could have used to be browned a bit more; but the real star was the Al Pastor. Awesome.\n\nNext time I would do one of their super burritos, which the locals seemed to prefer. As big as your head, and wrapped in what looked like a beautifully soft tortilla.\n\nFor kickers they have a salsa bar with a habanero sauce with some good heat.\n\nHappy birthday to ME.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "Ah, boy.  Ordered enchiladas and they had so little sauce that they weren't even tinted red, basically tortillas melted in gobs of cheese.  Also chips taste like cardboard and beans were flavorless. Sadly, no good Mexican food around here, which is amazing because it's pretty easy good to make tasty!", "author": "Tyson C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-26", "description": "Packaged flan --- way over marinated meats and soggy tacos and all .. threw most of the take away into the garbage. Not good.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "Ehh. Wasn't impressed. The burritos were hyped to be so great but I've definitely had a lot better. I just didn't feel like it was made with love. More so just slopped together quickly.", "author": "Saundra A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "Ordered 1 fish taco and vegetarian nacho through the Yelp delivery app. The food arrived completely soggy and cold. Most places I've been to make their chips in house and fresh, these chips tasted like they bought a giant bag from Costco and let them sit out all day and night. The taco tasted like depression and mushy lettuce, I had to dig through the pit of lettuce to make sure the fish was even there.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "This review is for the customer service and the poor shape the food was in when it arrived.\n\nI placed an order for 10 people - for a work meeting. When you view the menu on Yelp before entering your address to order, there are beverage options available that then disappear when you start the ordering process, namely the horchata and the fresh juices. That is probably an issue that Yelp needs to fix, however the restaurant did a horrible job of responding to me when I called them for help ordering juice (since the whole group wanted juice or horchata).\n\nThe woman who answered the phone frustrated me quite a bit. I told her the drink options were not available and asked her if I could add them on to the order via phone. She didn't say yes or no, but repeatedly said \"I don't know\" and then told me to call \"them.\" She wouldn't clarify who \"they\" were, and when I said \"I'm ordering through Yelp/Eat24 but I don't see a way to contact them/don't have time, can I please order the drinks with you and give you a credit card number over the phone\" she kept saying \"call them.\" After a few times going back and forth with unclear responses from her, I said, \"So you can't help me?\" and instead of giving any sort of normal response, i.e. no I'm sorry or yes, what would you like and I'll add it to your order, she started talking to someone else in the background and ignored me, and then a few seconds later, she hung up on me! \n\nI have worked in a restaurant before, so I understand the pressure and stress of having to answer the phone in the middle of lunch service. But all she had to say was, I'm sorry it's not possible, the drinks aren't available, and I would have hung up, but keeping me on the phone for a few minutes, to say nothing concrete or direct and then to straight up hang up on me was the wrong way to go about it.\n\nI had to go through with the order since it was too late to find an alternative. I chose sodas for the drinks. And here comes the next problem: a delivery man arrived with the food in 2 backpacks - the kind you use to hike. It was all squished - the regular burritos were ok but the sauce from a wet burrito and enchiladas had dripped all over them! It was an unacceptable condition for the food to be in.\n\nWe will never reorder from this restaurant. The restaurant should consider changing how they transport their deliveries so that the food is in a presentable condition when it arrives. The enchiladas and wet burrito looked really gross, with the guac and sour cream and beans all messed up and squished onto the top of the box. I really hope they reconsider their approach to customer service - the people answering the phones should be polite to the customers. And PLEASE update your menus with Yelp if you can!", "author": "Madeleine B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "What I love about this place is the service, and the fact that they are open late! The food is decent not the best taco joint in town but they give you options. The salsa bar is not consistent when it comes to quality and freshness so I think there is room for improvement there. Aside from that, everything else is good. Would I go back? Yes, late at night.", "author": "Miguel Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "On a romantic rainy night in San Francisco we felt like eating Mexican.  Went to yelp to find local delivery.  The delivery icon showed up under Los Hermanos so we ordered.  Shocked to get a phone call an hour later saying they don't do delivery.  We go to pick up and on their outside sign it even says \"FREE DELIVERY.\"  Drove all the way over there in the rain - lot's of employees there - they could  have delivered.\n\nIT GETS WORSE:  the food.  If you can call it that.  Only 1 out of my 6 flautas had any flavor or meat.  Looks like they stuffed the top flauta with lots of goodness and then decided to just fry the shells for the rest of the 5.  They were horrible - I couldn't even eat them.  So I paid for 6 flautas, ate 1, had to throw the other 5 out.\n\nHusband's Burrito:  He ate it - never complained but an hour later he threw up.  \n\nSo disappointed in this place.  Owner could have gone out on a limb to deliver our food.  We ordered Delivery dude! \n\nGotta throw this out there - I am very critical when it comes to food in San Francisco.  So many great places to eat so keep in mind when you read my 1 star review - my standards are very high.  Just want to be realistic and honest.", "author": "G G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "I felt it was necessary to do an update after tonight's delicious dinner.\n\nI pick up something to go from here at least once a week.  It is in my opinion the best Taqueria in the Lower Nob / Union Square / Tenderloin area.   I like the feel of this place and the people are always very pleasant.\n\nLately it has seemed as though they've had a little turnover in the kitchen.  Maybe they rotate different friends or family in -- who knows.  For the most part the food is always great, but I've found a couple of the less familiar faces to be a little less consistent than the rest of them.  Anyway, tonight they had someone back there I had never seen before.\n\nI ordered the pollo asado super burrito with black beans on one of the flavored tortillas, and it ended up being the best burrito I have ever gotten here (and among the best I've gotten from any taqueria ever).  Perfect.  Fuck it was good.  The tortilla was warmed perfectly, it had the perfect mix of ingredients, and the meat was cooked perfectly.  Everything was just perfect.  \n\nReally you might be thinking \"BFD\" but I've had a lot of burritos in my life and this thing was perfect.  Good on the guy they had working tonight, I hope they keep him around.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-13", "description": "Food is good but do not ever order through eat24, they are late every time and never send salsa, even when you make a point to them.", "author": "Raul G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "DELICIOUS! It is a little sketchy, just because it's literally INSIDE a liquor store, but the lady who took our order was very sweet and giving.\nTheir meat has so much flavor, and it cooked just right.\nThey have a dining area which is nice and a wide variety of salsas. Definitely made me a happy girl!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "The food quality in the place has really gone downhill. Trying to save money by serving old, burnt, dried out food will hurt the business, not help it.", "author": "JJoyce R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "I just ordered 3 al pastor tacos for Cinco de Mayo today and they were pretty tasty. There were 2 corn tortilla tacos topped with tons of al pastor pork on top, cilantro, onions, and some verde sauce. It also included some sliced radishes and fresh lime wedges on the side. \n\nI think it could have been seasoned a little more with salt. I wish it had come with some more chile verde or salsa picante on the side.\n\nI also ordered some nachos with carne asada meat. They came delivered soggy and too much sliced tomatoes on top. I rate their nachos the worst so far in my life. \n\nPlease deliver my guacamole next time ! Thanks! \n\nDon't order from this place. Period.", "author": "Mina Joy E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-22", "description": "From a vegetarian's perspective, this isn't the place you'll want to pick. I got a super veggie burrito and nachos. Both were incredibly bland. Salsa was odd tasting. Flan was prepackaged. Wont visit again.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-12", "description": "I can't explain how disappointed I was when I receive half of my order cause they didn't pack the chicken soup I had. DONT order that. It seems like they don't put effort into making authentic Mexican food. I don't know if it was the cook or just careless staff.\n\nHad my camarones a la diabla and they were made with ketchup and some sort of spice that didn't do anything to help the sauce. More onions than anything. I asked for salsa or chilles and none were in my bag. The driver is to go back cause they forgot to pack my soup and I ordered strawberry water , they gave me hibiscus. Called to make sure that I was getting my food and the person that was at fault with my order....smh gave me excuses, told me her story ... Which was truly none of my business... But the business that they should be caring is the food, I hated myself for paying that much money for something that disappointed me at the end. Owner of this restaurant or what ever it is. Please make sure your food is on point, specially if ours charging $6.50 for delivery. And don't call it authentic, I'm Mexican and I never have thrown away Mexican food that I know I'm in love with. \n\nGood luck with your place of business, cheers.", "author": "Isaac M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "This was a great meal after a 7 hour flight. Delivery was really quick and the food was great.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "By far my favorite Mexican food in the city! Hot, fresh and friendly service!!! Omg their quesadillas and tacos are my absolute favorite, but there are so many things on the menu it would make anyone happy!!!! Fresh homemade salsas and fantastic food!!!! A must when you want Mexican food", "author": "Lena Lena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "We read the reviews and they weren't kidding... Fantastic food. I got 2 lengua tacos and one shrimp and enjoyed every bite! The green sauce-amazzzzing and the pink sauce-WOW a sweet hint I loved! The service is super friendly and nice!", "author": "Fairouz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "My wife an I were in San Francisco for our anniversary and of all things she wanted a chimichanga! We live in San Diego, so Mexican food is a staple for us.\n\nI found this spot on yelp because it was within walking distance of the hotel we were staying in. \n\nThe chimichangas were really good and the rice and beans that came with it weren't half bad. The service was perfectly fine.\n\nIf you're in the area and want a chimichanga check them out.\n\nThey're located inside a market store, so you could miss it.", "author": "Garner A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-16", "description": "Inedible. Ordered delivery. Opened up carnitas burrito to find a giant piece of pure fat. They didn't even bother to cut it up. Second burrito order was a \"super\" however it contained no trace of guac just tons of sour cream. Worst delivery.", "author": "Jojo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Ordered here for delivery while in town and I was pleasantly surprised. For was delivered ahead of schedule and was great... Exceeded my expectations... Five stars...", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "This place is as good as any Mission street Taqueria. I eat here every week. Usually its the only meal I eat. \n\nThe super chicken quesadilla with garlic tortilla is perfection. Also, you can order breakfast burrito's anytime! You can customize any burrito you want, just ask them. Really friendly, authentic Mexican staff. \n\nYou can use your EBT hot food here too. THE best place to use your EBT card in SF.", "author": "Keith D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-08", "description": "I ordered delivery from this place.  They replaced items without letting me know, I also gave them specific ingredients, but instead they sent out food that I am allergic too.  By the time I received my order they closed and I could not send the food back.  Just wanted to say thanks guys for not paying attention, ruining my food and the rash I have on my neck.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "quick and dirty mexican food- that's all it's about after a long night of raging on polk. This place is predominantly a grocery store, but serves tacos, burritos, etc. and smoothies on the side.\n\nThe food here is pretty bangin'- think burritos perfectly toasted on the outside stuffed with delicious chicken, carnitas, or even lengua. \n\nDon't be deterred by it's location, or how this place looks on the outside. It's clean, the food is cheap, and it's exactly what you need.\n\nYou have to ask them for it, but don't forget about the free chips and salsa.", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Pretty good place for a more authentic approach for Mexican food. A bit small, but the food will make you forget that. Great salsa bar too and a lot of options that go out out your traditional, semi-boring menu everywhere else. \nBe back for sure.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-15", "description": "Seriously, there is so much better Mexican food in this town, that you should not waste your hard earned bucks here.\n\nI got an absolute staple of SF taquerias, the super asada burrito. Sad boring rice, sad boring beef and a glop of sour cream. No avocado, no salsa, no way!\n\nShe got camarones Diablo which seemed to be beans, rice, iceberg lettuce and Safeway shrimp all drowning in a not spicy, uninspired red soup of oil and salt. \n\nThe fish taco looks appetizing but is languishing on the counter as neither had the interest or daring to continue on to it...", "author": "Sam R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-17", "description": "I ordered deliver of a burrito and rice and got a mess absolutely not acceptable i really want a refund", "author": "Juju D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "What is the point of ordering delivery if I have to go downstairs and pick it up?! I'm getting charged a delivery fee for what? He claimed there was no space but clearly was parked out front while he made me come down, first and last time I order here.", "author": "America R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Ok so I had to come back and change my review I literally love their food I work weird hours so I have to order my lunch I always get the quesadillas or the Los Hermanos nachos which is steak fries thank God they have these lol I had some issues earlier last year but they came back in the clutch with the correct order and hot food I literally have to eat everything on the menu before I go somewhere else lol thanks for the great service", "author": "Erica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "This place has changed names many times, yet it seems to be the same people running the joint.\n\nPretty reliable burritos, one of two reliable burrito places downtown, open til 2am most weekends. What's not to like?", "author": "Stevie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "I live in San Mateo and everytime im in the city i have to stop here...The burrito is definetly one of the best in the city...highly recommend this place", "author": "Sharif S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "So funny!  In California, let's try some Mexican food so we look up places to have lunch.  Jump in a cab and go... wait a minute, where are you dropping us off?  There's no restaurant around here just this liquor store, it's kind of a seedy area. Yep the restaurant is more like a lunch counter inside of a bodega/liquor store. Only a couple of tables, not exactly what we were expecting. The beef and pork in our dishes was a bit over cooked and tough but the overall flavor was really good. I would try the chicken. There is a little salsa bar with a couple of salsas which were very flavorful. It was a great local experience, glad we did it. When you're done eating pick up a 40 for the cab ride back to your hotel. Not the place for you if a bit of real life freaks you out", "author": "Fred D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Just dined here for the first time! The food was authentic & fresh, and the portion was huge for the price paid! Such a cute little taqueria with a huge market right in the same location! It was like a one stop shop!TV was an added benefit! If your passing through the area or not, it's a MUST try!!!", "author": "Leese K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "Delicious, a fair price, and located nearby the Van Ness AMC so it's a great alternative to Mel's Diner when you want to grab some dinner before your show! It's a hole in the wall location, with a few seats crammed into a tiny space next to the food counter (it's located inside of a supermarket, so there's really not much space to work with -- I'd recommend only bringing a small group here).\n\nStill, service is friendly and prompt! Boyfriend and I had our food within about 10 minutes of us ordering. His carnitas burrito was hefty for a regular and my lengua tacos had some huge chunks of meat (I'm used to seeing smaller cubes, but they seem pretty generous here at Los Hermanos). The salsa was spicy, but not overwhelmingly so. This is also the first place I've been to where they used a red salsa instead of a green salsa with their lengua. Regardless, it was yummy!\n\nI also highly recommend getting their cantaloupe juice if they have it -- their agua fresca selection is available on a rotating basis. It's refreshingly delicious and not crazy sweet. It's a little pulpy towards the bottom (I'm pretty sure they just straight up juice the fruit and pour it for you), but if you can get past the texture of it then you are golden.\n\nDefinitely recommend this, though it's a bit of a hike from Civic Center BART. Unless you're going to be in the area, it's a little out of the way to get to.", "author": "Anna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "This is a super sketchy area of town.  While we were eating here a guy got chased out of the grocery store with a broom handle.\n\nThat being said, the nachos were delicious!  My friend and I split the super nachos with carne asada, monterrey jack cheese, delicious green salsa, and refried beans.  So I mean, if you don't mind the epitome of a dive, then this is a good place to get some food.", "author": "Christy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "Love this place and how they're open late.  I love how there's always been a line at this place, usually means its good right? it is.  Also, something about their green salsa, its bomb dot com. I've only had their super carnitas burrito and no complaints.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-20", "description": "Big ups to them substituting Chicken for Fish. Haven't eaten Chicken on purpose since the '80s. Go F Yourself", "author": "Crispin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "This place was a awesome surprise. The food is AMAZING. Really fresh and priced appropriately. I had the prawn and steak burrito and the prawns were so fresh and juicy - I still can't get over how bomb they were.", "author": "Caroline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Everything is fresh and delicious! My favorite are the nachos! With some grilled prawns! Even better is the watermelon agua fresca. I double up on it because it's so tastey and refreshing. So happy to have a place like this in the neighborhood!", "author": "V V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "Now that SF's Best Burritos has shut down, may Juan be forever successful, this is the next best thing.  \n\nThe burritos here are simple, no fuss no muss. I get the california burrito and it can't be simpler. Meat, Cheese, Fries, Guac.   Add your own salsa if you want.\n\nThey have a super spicy salsa, the orange one. Wow that will knock your face off.\n\nService is fast, the're very nice if you're not a drunk asshole, and being in the heart of the TL, you usually get a show with your dinner!", "author": "Tu T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "Very delicious SF Taqueria food! Their avo-tomatillo salsa is the bomb! Love their quesadillas -- you can get a bunch of stuff in them -- so I got a mushroom one with beans and avocado. Fabulous! The lady who works there is really nice. I've gotten both delivery and to go. It's greasy, it's great and it hits the spot. Disclaimer: I prefer my burritos & quesadilla's veggie, so I can't speak to the quality of the meat.", "author": "Yasi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "I was craving a burrito and this place was rated fairly high around my neighborhood.  It's at the very front of the grocery store so you can't miss it.  I actually enjoy the decor.  The liquor store has a sign that says \"You buy from me...I'm happy.  You steal from me, your ass is mine\".\n\nService was quick.  There was no line for me to order.  It was nice that they had a variety of tortillas to choose from besides the usual corn and wheat.  I had the garlic tortilla and it has a hint of garlic but not over powering.  I ordered it with the super burrito which does come with sour cream and guacamole, but I felt there wasn't much of either in the burrito.  \n\nOverall the burrito satisfied my craving. It wasn't the best burrito but it was good enough and the place was very clean.  I would recommend it if you want something quick and decent.", "author": "Alan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Stumbled upon this place by chance a few days ago. Food is amazing! Had a asada burrito, asada taco and the asada torta which Is my favorite so far. We did good to go and the torta was a bit soggy. But still delicious. I highly recommend coming here. Great Mexican food.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Very good, and very reasonable Mexican food. Both the tacos and quesadillas are great. And a nice choice of salsas. I love the red sauce. Just the right amount of heat for me. You might find it a bit much if you are not into spicy foods.", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "It was okay, there Tortas bread gets too soggy, the meat was alright too, there avocado is pretty good. Made up\nFor everything else. Not bad for the price and the amount of food you get.", "author": "Daniel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Really, really good by any measure.  Food that is.  Atmosphere is bodega-ish and service is walk up.  Shrimp burrito was very, very good.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "What a hidden gem right in the city! Tried the tacos and the nachos and you can tell everything is fresh:) went there for the Mexican food but they have a grocery store so ended up getting a few things for the house. Great service all around and walked away pretty full and happy.", "author": "Ruba R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "This place was a good burrito spot my boyfriend and I tried out while in SF. Our burrito was huge so thank god we shared it! Their service was good, but I do have to say the reason for the four stars is because they limit their salsa! I love salsa so when I saw I could only have two per burrito order I was a bit upset and if you need more then they charge?! Other then that I recommend this place if you are craving a good burrito.", "author": "Samantha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Food was so good, lots of flavor,  huge portions, great price.  Only thing odd was yes it's inside of a liquor store, but there was a cat roaming around the store/restaurant. Overall,  worth every penny", "author": "Meli C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "Good food, great service at a fair price! This taqueria is located in a grocery call mid-city so it's really convenient to grab lunch/dinner while picking up other things. I love that they take credit cards! The food is cooked to order and flavorful. I've only tried the tacos but they were really tasty and had fresh veggies and well-seasoned meat. Portions are generous too. I've always had great service here. It's a small place but there are tables if you want to eat in. Nice neighborhood place that will continue to have my business.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "Ordered a carne asada burrito and a supreme quessedilla. Asked them to give me extra salsa in the instructions area; but only got one Salsa for both orders . Burrito was ok and quessedilla was good. Nothing special though. Not bad for a late night greasy food but not the best for sure.", "author": "The M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Another one of these rare restaurants that are open on the weekend! Def good Mexican food. The chips and salsa was alright, (free) so what you expect. Ol dude smashed my burrito a little up but I mean I was gonna do that myself. Worth checking out.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "Alright, listen. If you thought \"Ehhh... taqueria inside of grocery?\" WELL GUESS AGAIN.\n\nTaco is good and smoky. They serve beer and pops. Portions are fair enough!\n\nIf you live in neighborhood and cravin' for some tacos, try this place and say viva Mehicco.\n\nGod im full.", "author": "Brandon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "*Almost feel like youre in Mexico, seriously authentic\n*Prompt and friendly service, amazing salsas\n*Value cannot be beat, just sooo good", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "very small hole in the wall place in side of a liquor store/ tiny supermarket. Food was really good and reasonably priced", "author": "Irma B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Just ordered delivery... a super carne asada quesadilla with beef tongue and it was so good", "author": "Jewdee J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-09", "description": "Don't go here if you are hungry at 11:30pm because they will ignore you for 5 min before telling that they are closed, even if they aren't supposed to close till 12. Luckily El Tesoro on Ofarrell and Leavenworth will happily serve you until they actually close.", "author": "Adriel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Really enjoyed this place. I went two days in a row. The taco salad was good, but the steak and prawn burrito was outstanding. Both were very large portions. Sat at a table with the cat that roams the store. Some might be bothered by that, I thought it was fun haha.", "author": "Bree V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-12", "description": "HIDEOUS burrito. I ordered a pork super burrito with no sour cream. I get back to my hotel and there is tons of sour cream. Not totally unforgivable, if not for the huge hunks of gloopy pork fat in the burrito and the funky smell/taste of the meat that left me feeling like it was as far from fresh as you can get. I picked at about 1/4 of the monstrosity and then threw it away. Yikes!", "author": "Kelsie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-03", "description": "Located inside Mid City Market, this is one of two El Tesoro's - the other is a free standing one on the corner of O'Farrell and Leavenworth.\n\nThey have a broad menu including tacos, burritos, quesadillas, soups, salads, nachos, enchiladas, tortas and a small salsa bar. They also offer a rotisserie chicken dinner with salad, rice and beans.\n\nI had a couple of regular chicken tacos which came with chips and salsa. They were good and satisfied my hunger on a rare, hot summer night in San Francisco ~ the perfect place to catch a breeze in front of their open window.\n\nA great place for a bite when you're on a budget and looking for something tasty, and a bonus that you're in a supermarket to shop on your way out.\n\nPS: $2.19 happy hour beer special from 3p to 6p.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "I didn't expect to eat some of the best Mexican food in a place that's half restaurant / half convenience story, but there you go. \n\nI noticed something cooking in the distance, asked what is was and they showed me a batch they'd prepared earlier. It was this moist, delicious looking slow cooked pork. \n\nI ordered that and it came in a burrito the size of a baby's arm. You could share one with someone and both be full. Or eat a whole one yourself, I'm not judging. \n\nWill definitely be visiting again!", "author": "Steve G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Had prawn tacos here with my one-year-old daughter. She went crazy for the guacamole and we had free refill with our tortilla chips. The taco was fantastic, fresh, juicy and so tasty. I hope to go back again before I leave the city. \n\nThe place is far from fancy but clean and staff is nice.", "author": "Annamaria S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-13", "description": "Food is ok but the staff is angry and rude. Good here if you are starving and can't make it to the mission for a decent meal.", "author": "Oscar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "My go to Taqueria, and it's in my neighborhood!  I've been going here for about a year.  The staff is always friendly and smiling. The food is excellent.  For my money, Los Hermanos Taqueria, has the best wet super buritto in the city.", "author": "Skot L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Last night my neighbor Julie and I needed a bite to eat but didn't want to go out so we agreed on burritos but from  where? Apparently my go to taqueria El Castellito on Golden Gate is closed so I had to find a new place and that's where Yelp comes in. Using the neighborhood search I found Los Hermanos which was only 6blocks from my apartment plus they had solid reviews, sold!\n\nVery friendly staff, good price on the Carne Asada regular burrito, added some spicy salsa, jalapenos and cilantro to give it that kick I need and in under 10 minutes I was on my way home with dinner. The Salsa bar looked fresh and colorful. The bonus for me was the grocery store that Los Hermanos is located in, it has all the Latin food groceries that you need, I'll definitely be back!\n\nMuchisimas Gracias Los Hermanos!", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "what a great gem inside of Mid City Foods! Directly across the street from A La Turca. had the fish tacos and regular tacos (beef and chicken) and loved it. Salsas are amazing as well. \n\nWhen we walked it the woman working the register was cutting soft tortillas into chips.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "The food here is tasty! I usually order a super burrito or quesadilla and grab a six pack from the grocery store.  Nice people here too!", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Great SF Mexican food not in the Mission. Like others have said it's in a grocery store but the flavors are great. Recommend getting the steak super burrito and then not eating anything else that day. Prices are reasonable and it's hard to find this much food for this price anywhere in SF", "author": "Jack V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "ABSOLUTEYLY HORRIBLE!!!  Arrived freezing cold.  I live 10 minutes from the place - I'll put that on Grubhub.  EVERYTHING I ordered was TERRIBLE!  Burrito soggy and gross, chips stale, disgusting grocery store quality salsa and the most horrible fish tacos I have EVER seen.  I asked for sour cream in the burrito and they put it on the tacos.  Who the hell puts sour cream on a taco???  I literally threw it all in the TRASH !!!  Currently waiting for another food delivery.  It was that BAD!  SO upset!!!", "author": "Lynne P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "Two of the four orders were not up to par. The salsa was not at the correct spiciness and the carnitas were 90% fat.", "author": "Ashley N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-30", "description": "Nothing too amazing. I ordered online and added special instructions which they ignored. I ate my order anyway because I was starving.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "i'm a fan but i think it should be listed as $$ instead of $. \n\nthe tacos are legit meat/onions/cilantro/radish but kinda small for $3 each. \n\nsalsa bar is nice, go green. \n\nenjoy the huge lime wedges. \n\nmost importantly, they sell 40oz tecate bottles with the tacos :boom:", "author": "Blair A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "The super burrito was amazing!!! I had it with carnitas and black beans. I travel to northern california at least 6 times a year. I live in wash dc and there is nothing like the taquerias in California. Damn i miss the true Mexican food that Northern California offers.  I have 6 more days here i will be back a couple more times here specially to get the breakfast burrito.", "author": "Valentino V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "I was lazy and didn't feel like venturing out to the Mission for authentic Mexican food. I was craving tacos al pastor for a while, so I got that with the customary side of chips and salsa and a Victoria. I didn't expect much from this place upon first glance, but I was impressed with the food!", "author": "Gloria A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "Was not expecting much when I first walked in as it is in a market in a crappy part of town, but this place blew my socks off.  The veggie burrito was soooo good.  Perfect ratio of rice to veggies, beans, and cheese.  The girl at the register and the dude making the burrito were nice and after an irritating day at work a cold corona was calling my name.  Sat at the little tables inside and enjoyed a beer while I waited for my burrito.   They were super speedy with the order too.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Hidden gem !!! I Am so glad I came here for lunch. I ordered 2 al pastor tacos and a carne asada burrito. I could only finish the tacos their was so much meat. Very flavorful and fresh. I can't wait to eat my burrito later. I will definitely be back for more.", "author": "Ronald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "The California Burrito is my special treat after a long week. The burrito is always huge, and not once have they gotten my order wrong (I always swap out the guacamole for sour cream). The food is ready quickly, and everyone I've met there is so sweet. I usually take my food to go, but there's also a nice small eating area. This is the best place for Mexican food in this area, hands down.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "One of the best super burritos/super nachos/ tostadas in sf. Somewhat like a hidden gem since its part of a liquor/ grocery store. The service is nice and fast, they have complimentary Salsa amongst other condiments depend on what you order. One of my favorite is free grilled onion slices and jalapeños on the side!", "author": "Thanh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "Best burrito I've had in this neighborhood, close to the best Mexican food I've had in SF since moving here from S. California a few months ago. \n\nSuper Chicken Burrito -- no sour cream -- this was basically next-level-burritoing.  I'll tell you what elevated the experience: they grill the tortilla. Makes for a melty/cohesive/piping hot Mexican masterpiece. Option for black beans on ordering -- no regrets here. \n\nI give it 4 stars because it was WAY too much burrito for one finite human to eat, but if you're into eating so much that it impedes your personal comfort to walk down the street, this is your jam. \n\nBonus is that this place is inside a market, so you have near-infinite beverage options, at your fingertips.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "Today my daughter and her friend each had the steak and shrimp burrito (they got it wet) and my husband had the super burrito. I ordered the chiliquilis (spelled incorrectly), the burritos were huge and the meat inside was super tender. Everything was yummy! The lady was very nice. Our food order was 40 dollars which was great for what we got. We had also bought a bucket of corona for 9.99 (6 beers), but when it came they were the small bottles. No where did it specify the size. But still a great deal for eating out. I would for sure visit here again. Their soups looked amazing. Didn't give them a 5 star rating cause it was kinda dirty. Food on the floor.", "author": "Dawn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "The BEST burritos! The tortilla is soft yet crispy and holds up well. We found this place late Saturday night after a night of dancing. The burritos were made quickly and were just amazing. Between all of us we got 2 different meat burritos and also a veggie burrito - all were fantastic and were good portions. The salsas that you get at the bar are great too -- one is mild, one is pretty spicy, and one is extremely spicy (habanero). Next time I go to the city I am definitely coming back here!", "author": "A C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "A great burrito on it's own, the fact that you can order DELIVERY until 1:45am made it love at first bite. \n\nThis place rocks. Super carne asada; get some.", "author": "Phil C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Great food and very sweet women at the register.  Inside a store, setup like a deli counter, but they do have a few seats and we ate there.", "author": "Todd M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "All I can say is holy crap! Me and my good friends were skeptical about eating here at first because it's in a liquor market, but hey yelpers pointed us in the right direction. My girlfriend had a carne asada burrito mojado (burrito smothered in sauce and cheese) I ended up taking a few bites of hers and by god it was amazing. I personally had the Lengua Chimichanga (deep fried burrito). I typically almost always order lengua whenever I go to a New Mexican restaurant; because, well lengua's my favorite and if you make a good lengua you've got my vote. Don't be scared to eat here guys. You won't be disappointed. Everything looked so amazing. Seating is limited so get in quick. I will be back whenever I'm in the area.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-20", "description": "I ordered a torta de milanesa on line, delivery was ok but the milanesa was soooo salty and burned...as a Mexican, this is really disappointing for me.", "author": "Elisa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "My favorite taqueria! The portions are big and both the tacos and burritos taste authentic. Also the nachos are great and the salsa bar offers a wide variety of salsas. The people running the place are really friendly. If you want great Mexican food and great service, look no further.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "Very nice people and service but the food is pretty sub-par even for a taco spot. The pastor sauce doesn't really come together. The chicken is alright. Still holding out for a great taco spot in the neighborhood.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "The only taqueria on tenderloin, where you get what you paid. Best selection of salsas, not old chips like other places, delicious deep fried CHURROS, and great service. I always get a super quesadilla :)", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "I'm inspired by all the nooks and crannies that people manage to find to express their culinary visions.  This obscure spot for a Taqueria is in a liquor store!  \n\nI ordered my carnitas burrito.  It came cheap and fast.  Who doesn't like cheap and fast right?  Th burrito itself was well constructed.  The tortilla was toasty.  The fillings were good and tasty.  It definitely had pleasing chewy nature to the entire thing.  I was supposed to eat half, I ate the whole thing.\n\nThe burrito is seriously big enough to feed even the most starving of large burly lumberjack men in plaid shirts.  It will feed the guy who just spent 4 months on a desert island eating nothing but coconuts.  And most importantly, it is enough to leave a little Asian girl in a food coma.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Burritos are HUGE! Asada/steak is thee best! The tacos are filled meat! Worth the price and it's a must try! The burritos come with chips! What more can you ask for?", "author": "Marlene E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "Love this spot. Great tacos and really good salsa. They're fast and really nice. Plus they're attached to a grocery store making them all the more easy and accessible if you need to run errands.", "author": "Breana L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-09", "description": "Look, I'm from NYC, so I KNOW bad Mexican food. I don't understand it; why can't anyone in California make some crappy enchiladas? Where I grew up, there are bland, inauthentic tacos on every corner! \n\nWell, thank GOD for El Tesoro. \n\nAfter searching high and low, a late-night stop here convinced me that I really can get sub-par Mexican food in California. Consider my mind blown. Maybe there really is lousy food everywhere! Perhaps I should stop making blanket statements about the lack of a certain type of cuisine in an entire region, simply because I'm too lazy to seek it out and eat at the nearby Chipotle.\n\nI will admit though, by Super Taco, they mean SUPER. At first I thought it was drastically overpriced, but that shit was a MEAL. Unfortunately, it didn't taste very good.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "I love this place.  They have good breakfast items and great tacos.  I like getting their meals.  Unless you're a sumo wrestler or linebacker I suggest sharing a plate with someone.  You can always order a couple of tacos to go with it.\n\nIt's nice to sit there by the window and watch the people go by on a warm day.  They have a pretty decent salsa bar, especially if you like spice like me.\n\nIt's also convenient to get food to go and take it to one of the many bars down the street, or just get a cider from the market that shares the same space and drink it there along with your food.\n\nI am a fan.\n\nBy the way, this taqueria is located inside this market, which is much easier to see the sign for:\n\nhttp://www.yelp.com/biz/mid-city-foods-san-francisco", "author": "Theron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "They were so hospitable and I love that they are an actual store as well, reminds me of Mexico :) great service and delicious food which is hard to find in the tl's", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "!!\nOther reviews are damn near spot on. \nProbably the best Mexican food/taqueria in the area. I usually always get a super burrito, and have never been dissatisfied. \nLike other reviews have stated, don't be weary because of the area/ exterior appearance, Restaurant is clean inside, and service is friendly.", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-22", "description": "I live around the corner from this place and I would go there 3 times a week if they would get their shit together.\n\nIn how many ways can I say \"no tomatoes\", only to come home and finger pick tomatoes out of my burrito.\n\nWent there for my last time a few weeks ago. Generally stale and poor in quality.\n\nfuck this place.", "author": "Gilbert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Whoa this place is seriously good.  Walked by looking for a burrito place and saw the taqueria counter on the side of this small grocery store with a handful of nice clean tables and some seriously happy looking customers.  I used to live in the Bay Area and this just looked like the real deal.  And it did not disappoint.  Excellent super burrito with fish.  Everything down to the tortilla was fresh, flavorful and delicious.  As good as my favorite Mission District burrito house (which sadly is not there anymore), and maybe better!", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "My friend and I wandered down Polk to a closed Super Burrito location - at the time we thought it was the biggest disappointment of the night, turns out it was the best thing that ever happened to us. We quickly pulled up Yelp and stared at our phones while we walked into the Tenderloin at 12am - thats safe right? We found what I like to call a \"hidden burrito gem\". The people are nice and the burritos are delicious. To quote Arnold Schwarzenegger, we will be back!", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "I ordered a carnitas regular burrito. It was super bland, soggy, the tortilla was doughy, very little meat, and I bit into a piece of fat that was nearly the size of a ping pong ball.", "author": "Sean Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-18", "description": "I traveled for a taste of this burrito, I heard about it from Ben the Bachelor, he said it was his favorite burrito spot in SF, yeah i believed him. So I went all out and got the wet super grilled chicken burrito and I was a bummed. The meat was diced to the point on minced chicken no chunks, and it was dry. Service was blah and atmosphere, well it was a supermarket. I was not amused, that's what i get for listening to the Bachelor.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "best mexican food in the tenderloin .. huge portions, cheap, and delicious ... and the salsa verde tho, I could swim in it!!", "author": "Cassy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "One of the worst burrito I've ever had in SF, seriously! Less meat, dry and cold inside...", "author": "Andrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "This place is the real deal, serving up tasty, authentic Mexican food.  You won't find any Americanized Mexican food here!\n\nTheir menudo and pozole is excellent.  If soup isn't your thing, the burritos and flautas are quite good.  The portions are large, and the prices are reasonable.  I always leave this place feeling gut busted.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "a mega jump up from the previous management and kitchen.  for old hands, it'll be enough to tell you that i recognized at the grills an old face from chile verde (on 6th near market) and castillito b (when it was first starting).  a master taquerieño, this one.\n\nright on, los hermanos!", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "Fantastic Mexican food! Don't judge me, I had to be super white and get the prawn chimichanga. Bomb salsas too! Happy to have you in the hood, I hate traveling to the mission for good Mexicali action! Next up, fish tacos!", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "This is garbage food the worst in my life the quesadilla tastes trash and the meat on tacos are plastics", "author": "Majed S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "This is the best taqueria near me, so I'm biased, but I believe it to be one of the best if not the top in the Tenderloin / Tendernob area. Why? \n\n* Consistently good - everything I've eaten here is top-notch\n* Great salsa bar, from mild to hot habanero sauce\n* Variety - for example, you can get pollo asado, or you can get it shredded, or bbq style\n* Portions - big burritos, not the biggest, but about the best for size w/ good quality\n\nI used to live in Bernal just off Mission Street, and had so many great options nearby - Taqueria Cancun, La Corneta, and El Farolito just to name a few. The Tenderloin is not the best for taquerias, and is better for great, cheap Asian food. \n\nSo location is part of why El Tesoro stands out - it lives up to the name!", "author": "Justin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Delicious, convenient, and reasonably priced. Not 5 stars because it didn't wow me in any way (food, service, ambience, price). The tacos are stuffed pretty well. We had a chicken, a prawn, and a fish. All were overstuffed and delicious.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "After leaving a bar with a buddy of mine I got the hunger pains that only a burrito can satisfy but a lass I'm in the Tenderloin. But wait I walk out and what do I see? A grocery store? Wait no, yes, kinda it's also a taqueria. Hmmm. It's midweek and it's empty so I walk up order a super carnitas burrito. I impulse buy what I thought was a bag of chips for a buck. Turned out to be cinnamon sugar chips mmmm.\n\nGot home and bite into the burrito and it's delicious and the burrito is massive. My fiance asks for a couple bites and she proceeds to engulf half my burrito. Argh. The burrito was awesome. Tons of carnitas and nice flavor. Nice surprise in the TL.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-12", "description": "Didn't know they had a Mexican spot open this late in any place outside of the Mission. \n\nI ordered their super nachos, which was pretty standard/nothing special. There was a decent amount of cheese, and the beans weren't overly plentiful, which was good. There was a slightly underaverage amount of sour cream/guac that I am used to.  The carne asada was nicely seasoned and perfectly tender. My only issue was that there was so little meat! It was good steak, but there was hardly any, in contrast to other establishments which pile it on pretty well (this probably had maybe 2oz of meat as opposed to 2x-3x that at other places... it was like taco bell steak portions). It seriously was sprinkled on the side as opposed to covering the top.\n\nHabanero Sauce - addicting and absolutely delicious, followed with a lingering heat that makes you want to soak your mouth in milk. This sauce is legit. spicy habanero flavors mixed with the sweetness of the same pepper. Painful, but addicting.\n\nGreen Sauce - this was that creamy green chie sauce found in all mexican restaurants... This one was actually spicier than most but had a ton of flavor because of that added spice.\n\nAll in all, great sauces, good meat, but shady meat portion, which absolutely kills me, because it would be better if they gave out similar portions to other mexican restaurants.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "Staff was very nice, got a vegetarian super burrito for my girlfriend and a chicken torta for myself and we were not disappointed at all. Its also located inside of a market so if you're just picking up some food on the way home you can also pick up some snacks for later.", "author": "Krish P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "The carne asada tacos were outstanding, fast service, great price. Chips and salsa are on par, would eat here again.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "I don't know of many stellar mexican food places around nob hill or the tenderloin, so I was excited to read the reviews here. We grabbed a quick dinner here one night. We ordered a pollo asado taco, pollo asado deluxe taco and a pollo en salsa burrito. Everything was pretty good. I would give this 3.5 stars if I could, but not quite 4 because the food was a bit lukewarm and didn't have that punch of flavor that I was hoping for. I'd go again in the future when that burrito craving hits and I don't want to head to the Mission. The customer service was excellent. The lady at the counter was cheerful and helpful.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "I live in Nob Hill and while we don't have a lot of great options for authentic mexican food, Tesoro fills my burrito needs.  They have really good carnitas and pork in chile verde.  Their pastor meat is just ok.  They offer California burritos which I think is pretty damn cool and they have a bunch of tortilla options like spinach, tomato, garlic... pretty crazy for a random corner mexican place.  The prawn burrito is pretty awesome too.  They have a big screen TV in the back where they play soccer games and they sell beer so it definitely makes for a nice lunch spot in the TL.  Side note- their hamburgers are actually really good.  I have a friend that swears by hamburgers made at mexican places and they make a delicious cheesy fried burger.  \n\nThey also have a salsa bar with some really good salsas ranging from mild-habanero hot.  All in all I would say that this is a pretty decent place if you're craving a burrito.  Don't order the torta or the tacos- they're not that amazing.", "author": "S. G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-23", "description": "I have absolutely no idea how on earth this place has such a high rating.  I will give it the benefit of the doubt with the 2 stars.\n\nIt took forever to get the food, no idea how it took so long since there was only two people in line. The cook AND the cashier were coughing like crazy, clearly sick, and not even the slightest remorse as they handled the food with their germ infested hands.\n\nAfter eating the food, a steak burrito with possibly the driest meat besides beef jerky on the planet, I instantly became sick with nausea and the dreaded runs.\n\nI wouldn't recommend it in the slightest.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-11", "description": "I would never recommend this place to anyone. It's a small dirty take out restaurant inside of a small market.  My experience here was very bad. I had purchased a groupon for this place due to its close proximity to my apartment. The staff at El Tesoro clearly does not like accepting groupons because I was told \"I'm not supposed to let you use that for more than one person.\" I ordered for 4 people and was going to use one groupon for $10. It made no sense that they did not want to take the groupon for a $40 order. Also they did not have fish for the multiple fish items on their menu, which does not help if you are pescetarian. Lastly, after finally trying their food, it was very mediocre and the tortilla chips were stale. You should be able to easily find better mexican food somewhere else with better customer service.", "author": "Alisha R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "I had the grilled veggie burrito and it tasted like asian stir fry wrapped up into a tortilla. Fair prices for burritos but next time if I can't make it to the Mission I'm going to their other location for the California burrito, which is really good.", "author": "Josie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "It's been two years since I came here for a first (or second?) date! After a rough day at work, we met up for drinks at a pub nearby and then headed over to the taqueria for dinner. Normally I don't update reviews but I wanted to add that I had the quesadillas this time around and they were definitely the best I'd ever had in a long time. Full of cheese and mushrooms and just insanely delicious, I would love to go back for more!", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-30", "description": "Just OK unfortunately. I am somewhat of a burrito aficionado and this one came up a little short. Steak super burrito. The portion size was decent but the taste and just overall burrito experience was lacking lol On top of that, it cost $9, $8.97 to be exact. Totally not worth it. Worth only $6 if you ask me, even with the portion size. Sucks because this place is really close to my house and I had high hopes, but my quest for a very close, great tasting and reasonably priced burrito place goes on. My favorite so far is El Super Burrito on Polk but it is a little distance away from my house :( Won't be back.", "author": "Rick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "This food is definitely not vegan friendly. They barely speak english, And i swear I am a regular customer and I go there every other week - they still gave me burrito with cheese. Which I have not tried in months!!!!!! In months! And i am a regular!!!!!! I wish I can put 0 stars.", "author": "Ashley R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "Just grabbed some chicken super nachos here, and all is well with the world. Friendly staff too!", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "A great surprise and a great find. Working off Van Ness today and was craving Mexican food. The super carnitas burrito left me very satisfied. I'll be trying the tacos next time.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "I hate the word \"discovered\" for restaurants--maybe uncovered is better?--but this is the kind of unobtrusive place in an unexpected location that you do have to discover.\n \nIn my 20 years of SF taqueria trolling, I've never found a menu as fresh and yummy as this for taqueria-style Mexican. Everything is fresh cooked in-house, including fall-off-the-bone meats and rice and beans you can tell are made with a recipe and not just used as filler for gringos. The cheese they use is amazing, especially when it's melted into a huge, drippy quesadilla. And the salsas in the back are fresh, tangy, and tasty, not bland and mushy. \n\nYou can tell if a taqueria cares by the size and freshness of the lime wedges they provide at the salsa bar (unlike the fingernails of lemon at Chipotle), and in this area too El Tesoro is a standout. \n\nOn the Tenderloin side of the Tendernob, the location may not be a draw, but the seating is all behind the counter/kitchen area, well away from street noise.... which makes it something of a sanctuary, even if you just stop by for a Corona. \n\n(I almost forgot: The super-low prices are the only thing that's below average about this place.)", "author": "Brent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "Tacos, tacos, tacos!\nI needed a carnitas taco.\nThey had carnitas tacos. \nI ordered, my lumberjack paid, we ate, and I left happy. \n\nHighlights of my experience at El Tesoro:\n- they were really tasty $2-something tacos\n- I got to enjoy my tacos at a table indoors with other taco lovers\n- it was right across the street from Ha-Ra Club, where I returned after eating said tacos. \n- it was still open when I left the Ha-Ra Club", "author": "Loli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "Quick pit stop for a late lunch... Excellent quality and excellent flavor.  Three tacos with carne asada, well priced and quickly served and out the door!", "author": "Daniel J. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-22", "description": "This is for the 1am food on Saturday night.  I had a really good regular burrito but it took FOREVER for them to make despite having very few orders.\nI definitely wanna come here for a beer and a burrito and spend some time here like the other patrons while I get some random grocery shopping done.  It's funny that it's a grocery store but a great late night option for burritos in the TL.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Excellent ingredients with a friendly, efficient staff.  Free chips with your order, and one of the most impressive selections of housemade salsas I've seen in the Bay Area.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "This taqueria is in the front of a grocery store. It's a pretty good and unique Mexican spot. What makes it unqiue is that offers different kinds of tortillas to wrap your burritos, quesadillas, or whatever you get. They offer garlic, chipolte, and spinach just to name a few. I'm a person who loves cheese on their burrito and they did it right. Not only was it melted, but also when I bit into it, the melted cheese came out and pulled away with my bite instead of it being clumped in with the or fillings or the tortilla. Also, they had guava jarritos there which I've never seen before and that me and my friends almost took all of. This place does have a couple of down sides. They are a little pricey compared to most Mexican spots that I have been to and they have a limit to how many salsas you can have (2) for free before they charge you despite them having a salsa bar. Although these two negatives are definitely understandable and minor because of the quality and there desire not to waste anything.", "author": "Brent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "This place was delicious. The burrito was full of flavor. One the best burritos I've ever eaten. Perfect balance of meat, beans, and salsa. Only four stars because the Horchata was not the best", "author": "Christian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Amazing food! Great burritos! Very fast and everything is super fresh. The employees were really nice and polite. The burrito I ordered was called the \"California Burrito\" with carne asada for the meat. It tasted very good and the meat was seasoned very well. There was tons of guacamole and cheese in the burrito too. We were very happy that they weren't stingy with the ingredients or meat in the burrito either. They also give you chips to eat and there's a fresh salsa bar as well. Overall this was a great little place to eat, even though it's inside the corner of a grocery market. We would definitely go back and enjoy eating here in the future.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-16", "description": "This place is great.  I am the product of three generation of Swedish Mexican pig farmers. Therefore, I am uniquely qualified to know that the carnitas here are succulent and ripe with flavor. \n\nThis place offers a burrito in the TL superior to Cancun (on Market), superior to all the Castilitos, and easily on par with the savory All-Star tamales at the farmers market.\n\nThis place is ridiculously clean for a taqueria. Especially a place in the TL. Cancun is a great burrito, but I always feel like I'm going to find some dirt in my burrito (much less get accosted inside the place). Clean cooking area and clean seating area - solid. \n\nAwesome selection of 6 salsas.\n\nIf you order a \"salad\" at a TAQUERIA you deserve ZERO stars.", "author": "Sven S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-02", "description": "My fish taco order took WAY too long (about five other people's orders were processed in the meantime) and when I finally did get it, it was soggy, bland and littered with absurd amounts of cilantro.\n\nI was not a fan - tossed the remaining two thirds into the rubbish bin and mentally psyched myself up for the daunting walk back to the hotel.", "author": "Kat F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-08", "description": "The portions are good, the food is tasty. While waiting for your food, you can peruse one of the best stocked convenience stores in the neighborhood. There are cheaper taquerias in the 'Loin, but this is probably my favorite. \n\nNow if only they had half orders for nachos.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-09", "description": "Great food! The flautas are fabulous and it's a large portion!", "author": "Emma S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "If you are too hungover or too hungry to get all the way to the mission for a bomb authentic burrito this is the place to go. Everything on the menu is amazing (real talk). The burritos are huge, the chicken is amazing, the salsa bar is diverse. No complaints, so glad I found you El Tesoro! Its a hidden gem within a grocery store, which also means you know its fresh.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "I finally tried El Tesoro on my way home from work a few weeks ago and was very happy with my burrito.  Well-prepared burrito with the right proportion of good ingredients.  Chips were decent (and they don't charge extra) and the place is pretty big, so plenty of seating.\n\nThey didn't have bottles of Tapatio sitting out, I had to ask for it but they have it behind the counter.  They're open pretty late too, which is nice.  I'll be back for sure.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-02", "description": "I won't recomment anybody to try It. First, It is not a restaurent . It is a supermaket. The food is not very tasty.The restaurent is in a wacky neighborhood.holy moly!!", "author": "Jerome B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Tacos were awesome. Not tiny not dry... We stayed right across street from here. Wish I would've know about this place earlier in vacation.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "I consistently hit this place up for a burrito.\n\nCarnitas could be more crispy. Sometimes the burritos are huge and sometimes not so much. Sometimes the tortillas are deliciously fried to a golden hue, sometimes equally yummy charred and smoky, sometimes neither. Not a huge fan of the pico de gallo here but their orange habanero sauce is bomb.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "After looking this restaurant up and seeing all the great reviews I decided to try it.  I am visiting San Francisco and was craving some Mexican food.  Most of the other restaurants were closed because I was looking for a late night snack at 11PM.  \n\nThe first thing I discovered, it is located inside a grocery store called MID CITY.  This makes it very convenient but hard to find if you don't know what you are looking for.  The service was great, although they don't really understand English.  They understood enough to give me my order exactly how I wanted it.\n\nThe food was spectacular, and for a very inexpensive price.  The servings are huge.  So don't over order, or you will have plenty of left over's.  As for the location itself, it's a hole in a wall.  I didn't go there for the decor or ambience.  I went there for the great and affordable food.  They had great service and were very fast.  I would definitely go back.", "author": "Stephan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "This place is amazing and I don't get hyperbolic often. I ate here for the first time about a week ago and, I kid you not, I have eaten here every day since. It really feels like what a taqueria should. It is a little weird that it is house in a convenience store, but don't let that detract from the fantastic. The food is great. I can say with out hesitation that this is literally my favorite place to get a burrito. Even the complimentary salsa is exquisite. Stop reading this and just go give it a try already!", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "Great burritos and tacos, among other things. The prices are definitely reasonable and they have a great selection of Mexican beer, most being only $2. Good people watching as well. And yes, this little place is inside a market, no biggie. Oh and there is a daily Happy Hour from 3-5 or so, with deals on drinks as well as food.", "author": "Bass T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Burritos are so delish ! Will definitely recommend this taqueria! Awesome people!", "author": "Beth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-17", "description": "My favorite Taqueria in the whole bay area; and it's inside a liquor store.  How much better can it get?\n\nThe prices some of the more reasonable around and the portions are some of the most generous.   They have a large selection of items other than your standard burrito (tostadas, roast chicken, tortas, flautas-- you get the picture).\n\nThe free chips are homemade, thin and delicious...\n\nToday I tried the breakfast burrito (+steak) and it was awesome.  It was essentially just a regular burrito with an extra kick of protein from the egg.  I also highly recommend trying the bbq chicken or bbq pork (pastor).\n\nThey have a tendency to go a little overboard with the rice here, so I'd recommend asking for \"less rice\".  There's also a good collection of salsas and jalapenos available if you need a little more spice.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-02", "description": "Came here with Annie and Shawn yesterday mid afternoon, Annie spotted this place and thought that we should check it out and so we did.\nThis place is a Mexican place to eat at a  grocery store. \nThe service was good, the place looked very clean and the food was really\ngood. I will be back.", "author": "Der Maibaum L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "New outpost of the smaller original a scant three blocks away.\n\nFifteen seats along several tables and a counter span the western 1/3 of a cheerful high-ceilinged mini-supermarket.  Over a generous heaping plate of cheesy tex-mex fresh-grilled meat with the usual salad, guacamole, rice, beans, five kinds of salsa, limes there was a constant drone of small children singing mexi-rap on the radio, families with kids running around, cashiers yelling across the room at stock boys.  \n\nBurritos go $5.45 for standard to $9.50 for the steak and prawn.  A few extras beyond basic taqueria -- four kinds of soup, breakfast, eleven meats from chicken up through lengua and cabeza but nothing scarier than that. Vegetarian option is grilled red and green peppers fried on a grill dripping with beef fat.  Homemade chips were fresh and good.\n\nSome great extra features -- a strong wifi signal from elsewhere, big storefront windows on the sunny site of the street, an ATM, adequate heat.  Best for last: you can buy extra food and alcohol in the grocery to eat at your table!", "author": "Gil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-08", "description": "So far I have not had a bad experience here.\nI've had the burrito (SO BIG!! I ate half one day and the other half the next. very filling) with chicken. I've had the tostada and the tamale plate. The have delish black beans and their tamales are pretty good (and spicey). \n\nI'm a big fan of their rice too- the peas and carrots are never extemely soggy ( I'm not a big fan of mushy veggies in my rice, thanks). One of my favorite taquerias in the area. And I think on average I get a huge meal for under $8. Can't beat that.\n\nOh, and even though I'm from South America all I can manage to say is \"hello\" in spanish. They always speak to me in spanish and I have to make a sad face and say \"no habla espanol\" :( They're always extremely nice so whoever says there is bad service here is most likely a prick who gave them attitude to begin with ;)", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-07", "description": "The food is pretty good, but it is insanely expensive... 3 dollars for a little taco is rediculous. Burritos are the industry standard 7 bucks or so but damn 3 tacos usually costs like 6 bucks not 10.\n\nBut all of that could be forgiven if it wasnt for one thing.... The employees there do not consider the fact that many Californians understand spanish. When your sitting there listening to them make fun of you and the other white customers in spanish its hard to want to go back.", "author": "Val M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "Ordered the Chile-Verde Super Burrito and man it was YUMMO!! I will be returning back.", "author": "Vincent D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-14", "description": "Man, I wanted to like this place since both of their TL locations are so close but the food's just gross. I got fries and they tasted really rancid - like they were made with super old oil. Then I tried their nachos and it was 98% soggy toppings and three corn chips. Obviously I'm exaggerating but not by much.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "This was it.  This (I thought just by virtue of the preparation), was the SD style burrito I've been looking for.  Perfect (and i mean PERFECT) tortilla.  Really good meat.  Really good pico de gallo.  Ideal proportions.  Then, my corazon was broken: really mediocre guac.  This was the SD style burrito beauty queen that got beat up when the ugly SF style burrito heard she was in town. No you dit-ent SD style burrito at El Tesoro, no you dit-ent...but you were damned close.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-20", "description": "Good neighborhood taqueria with friendly service. Burritos never disappoint and they have a good salsa selection. Not quite the mission though!", "author": "Avinash S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "Love this place. Authentic taqueria. It's in the corner of a market. The prices are low for the size of the portions. The food is really good. Carnitas are excellent as are the chicharrones when they have them. Great salsa bar too.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-19", "description": "El Tesoro is kind of like my designated late night burrito destination when I am starving. They whip up a very tasty burrito. I have had the super burrito with pollo en salsa and al pastor. Eating one of these burritos isn't a life changing moment by any stretch of the imagination, but I think it's worth a try. On some nights it's brilliant and on others not so much; that's part of why I am giving it only 3 stars.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "woo hoo! best mexican i've had in the tl! i recommend the carne asada chimichanga.", "author": "Nigel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-10", "description": "A really, really good super burrito. The tortilla is tasty and chewy, a perfect blend - not thick and leathery like some taquerias (Pancho's), nor thin and prone to rupture as at others (La Canasta). And it's griddled just right, browned even -- delish!\n\nSo lessee. I happen to have an El Tesoro super burrito right here. The pollo asado is fine, though my preference would be to blacken it up like Gordo's does. There are peas and carrots in these babies -- a thoughtful little enhancement.\n \nI just picked up the second half and gooey cheese dripped out. That's a burrito, mmm-mmmm good.\n\nAnd get this - they have a HAPPY HOUR for burritos! Between 3 and 5 p.m. a regular is $4 and a super is $5. Compare that to $8.60 or so with tax for a super at the overpriced El Patron a block to the west. And they have a steamer so once the burrito is in foil, they zap it so it's piping hot. You don't see that at a lot of taquerias, and it should warm the cockles of any burrito-lover's heart.\n\nMore -- there's a nice, clean salsa bar with a variety of selections. Two are green and they're legitimately spicy, and this from a guy who puts Dave's Insanity Sauce on his Cheerios. There's a pleasant seating area from which one may watch the entertaining drama that is the Tenderloin through an open-air window. Upbeat Mexican music plays in the background.\n\nAnother poster panned the place after ordering a green salad and French fries. Um, it's a freaking taqueria. Get a freaking burrito!", "author": "Fred S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-04", "description": "Great food at great prices. Carnitas, shrimps are really yummy. Not a fan of their tortillas, chips or fries though.", "author": "Erik C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-05", "description": "This place was alright. Having recently moved into the area I've kinda been feeling the restaurants around here out and I doubt that I'll be a regular at this one. I bit into a chunk of bone in my burrito which kinda sucks. They're a little pricier than the other taqueria down the block and not as good in my opinion. The one good thing that this place does have is a salsa bar with like 6 different salsas, all really good. Sometimes I feel like going into Chunky's for food then just coming here to get some salsa. Don't think they'd appreciate that though.", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-15", "description": "Ok, I swear this place was better but yesterday my burrito was the PITS. Cold and undercooked (umm I don't eat meat, but gimme a break...my veggies were raw and my rice cold). Plus where are the beans?? I barely saw any wrapped in my tortilla! I have issues with the rice as well. First off, why is it orange? Secondly, I don't want peas in my burrito. And I love peas, but that's just weird to me. Eating peas with avocado just doesn't seem right. Maybe it was an off day???", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "Best spot in the TL for a burrito. I mean its still not as great as some of the Mission taquerias, but hey its open late, reasonably priced and everything I have had has been pretty good.", "author": "Vilen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "Saw a review of this place on a burrito blog and since it's so close to where I live, I figured I'd give it a shot. i was not disappointed. Though maybe not as crazy good as some spots in the mission, the chicken burrito I got was made quickly, with the ingredients incorporated well, and quite flavorful. I didn't feel that it was too greasy or wet from salsa, beans, etc. The meat was tasty, tender and didn't have grissle. It was exactly what I was craving and it was exactly what I got.", "author": "Barbara J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "Tasty Mexican meals whipped up quickly. Friendly service and grocery store attached. Great Mexican food for the neighborhood (because selection is limited!)  but the (un)cleanliness might be a bit too much for some.", "author": "Anne A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "bonus for open late for a street taco without having to go to the mission.  only got a single taco (al pastor) and they forget the additives.  average flavor.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-26", "description": "eh skip this taqueria. cold burrito after a 20 minute wait. no thanks", "author": "Jaide F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "They didn't mind when my roommate and I came in and had a food fight at their salsa bar.", "author": "Randall T. Bogus, I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "Okay, I love El Tesoro...but whoever catagorized it as Tex-Mex has never been to Texas. It is stricktly California taqeria food. Its good, better than most...but NOT tex-mex.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-09", "description": "These people are on drugs. They look at you like they're sorry they have to give you this crap. then they give it to you and ask for money. We ordered a green salad and some French fries hoping that this could be a simple enough task for an orangutan to do blindfolded. No such luck. The salad was old and withered hidden under some cO2 sprayed tomatoes. The fries were limper than bob dole. I get a queasy nausea whenever I walk by. Utterly Offended.", "author": "N O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-24", "description": "wonder g.. who da f@!$ orders a salad and fries at this place!!! funny!!", "author": "giovanni o."}
