{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "San Francisco has a lot of public staircases where streets belong.  Mostly because the streets would be steeper than Filbert if they were built.  The result is a plethora of places to get your lungs and legs in shape.  And of these, the Lyon Street Steps are the most scenic.\n\nWhether you start at the top on Broadway close to the Getty compound, or at the bottom on Green near the house that was portrayed as the prep school in \"The Princess Diaries\", you'll get a good workout in only two blocks.  Luke L counted them, there's either 288 or 332 steps, roughly double the amount on the 16th Avenue set.  Be careful;  if you trip going up, you'll get a damaged knee, and if you trip going down, you'll get a concussion.\n\nI've been here several times, and I've always seen people working out here.  And no wonder:  mansions on the east side, a jaw-dropping view on the north side, and beautiful landscaping.  Hidden away from the street is one of the hearts that was left in San Francisco.  And to clarify Korina Y's comment, there are not 40 million-dollar homes here, these homes sell for $40 million.\n\nThe Lyon Street Steps are good for locals and tourists alike.  Enjoy.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Super nice viewpoint, just a very scenic place. It's a good place for photos but it's also difficult because a lot of people will probably be around. Regardless, it's nice to be there and look around and take everything in. \n\nThere is a long staircase so it's something to note for those that aren't able to walk stairs.\n\nThe green sidelines next to the staircase help make the staircase more elegant. \n\nThere's also one of those famous San Francisco hearts at the bottom of the stairs.\n\nI would recommend a quick drop by to this location. You can then continue on to the Palace of Fine Arts and/or Presidio as they are in walking distance.", "author": "Karishma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Lyon Street Steps one of the more famous public stairways in San Francisco. There are a total of 332 steps (or 288 steps depending on where you count these steps) and they cover about two entire blocks (from Broadway [top of the steps] to Green St. [bottom of the steps]). Our group used a ridesharing app and the driver dropped us off on top of the steps. The view was simply marvelous - you can see the Palace of Fine Arts, the \"Billionaires\" Row (including Senator Dianne Feinstein's house which is right next to a heart sculpture), a heart sculpture (one of the \"Hearts in San Francisco\" sculptures scattered across the city), beautiful zen-like gardens, and the San Francisco Bay. If you are a fan of the Princess Diaries, Grove High School is located at the bottom of the steps (or dead end of Green Street).\n\nA lot of people come here for stair workout, but it is also a must-visit instagrammable tourist spot in SF.", "author": "Luke L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "First time here on a weekend morning.\n\nThis place is incredibly beautiful! Many runners taking advantage of the stairs to work out, as well as families taking their kids to hang out. \n\nOverall it's a very friendly and cozy enviornment. \n\nThe steps oversees the ocean and the buildings of the city. \nThe heart-shaped landmark is a great photography spot. \n\nI was able to find parking easily near the top of the steps. The classy tour cable cars also make a stop there. \n\nMy Google map took me to the top of the steps, instead of the bottom. (If you're not feelin' the climb then that's an alternative.)", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Did you know there's a great free \"gym\" in one of the most scenic, beautiful and wealthy areas in SF? Zero initiation fees, zero monthly dues, no contract, and open 24 hours.  OK, so it's not technically a gym, but you'll definitely get in a great work out here!\n\nIn an attempt to get outdoors in between the rain, I headed directly to the Lyon Steps. I like to start at Filbert and Lyon, go up and down a couple of times, and then walk along Broadway (aka Billionaires' Row).\n\nOn a busy weekend, you'll find lots of healthy, super fit folks bobbing up and down the steps with their headphones on. Even if you don't do a work out here, come for the views, take your out of town friends here, or just come to sneak in a few minutes of zen. It's truly one of my most favorite spots in all of SF!\n\nP.S. And tell Diane I said hello...", "author": "Lori N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "If you live in the city or if you're visiting the city, you must check these steps out. Really random because they're just steps after all...right? \n\nI love it though because it's something outside of the city...while still actually being in the city. Here you can see people from all over the world converge...on steps...with an incredible view. \n\nYou can see people taking in the views or you can see group yoga classes. You can see families doing a workout circuit running up and down the steps or even see a dog walker with 10 dogs (seriously, I just saw this yesterday). \n\nTake in the views but be sure to take a walk up and down the steps! It'll be your workout for the day. T\n\nIt's definitely a hike up the steps. There's a lot and they're steep so just something to keep in mind as you look to walk them.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "I came to Lyon Street Steps for the view, not the hike. I think I got a good enough working out walking up the SF hills to get there. \n\nThe area around and it is truly beautiful. One of those places with an iconic SF view of the houses, geography, ocean and city all in one. \nThere were a lot of people here doing yoga, running the steps and hanging out with their dogs. It's clearly a hot destination for locals and visitors alike. \n\nI wish I had more time to spend here to explore a bit more but we were in a hurry. You should definitely check out Lyon Street Steps.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Surrounded by 40 million dollar homes. Lots of well known people live in this affluent neighborhood of San Francisco. Gorgeous view of the bay and the palace of fine arts.  Some locals running up and down the stairs. One of the \"heart \" sculpture is here. There are 130 of those heart sculptures all over the city. Nice to take a walk in this neighborhood looking at the architecture of 30 - 40 million dollar mansions. Most residents are gone this time of the year , on vacation or staying at their other homes. Everyone returns in August . Parking spot might be hard to find then.", "author": "Korina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "Heck yeah!  The view at the top of these steps is awesome.  Also, the steps provide infrastructure to a nice workout.  There's a reason why outdoor bootcamps and individual fitness buffs flock here.  If you have to burn calories, you deserve a view!  \n\nI like to enter the Presidio from the top of these steps.  Tip:  if you want a view with fewer tourist in your photo, take a pic from the inside of the Presidio, just west of the top of the stairs.", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Very nice view!! \nI see a lot of people doing there photo shoots (great place for graduation photos). It's hard to find parking as it is in a residential area. But when you are taking photos, please be mindful for the locals. There was an old guy running, and people did not move for him. I understand you guys want a nice photo, but people do use this step to go up and down Lyon street. \n\nOther than that, enjoy the view of the bay and the Marina district!", "author": "Kiyomi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Need a workout??    This is the place to get some cardio in.   \n\nPARK on Lyon St and Green TO GET THE FULL EXPERIENCE because the stairs are cut in half by a street PLUS it gets more impressive as you walk up.   Then top it off with the view, WOWWWWW!!!!!!   You will feel amazing, the air, the view, everything is just glorious.   \n\nAt the top to the right, there is a gate that kind of looks like a cemetery gate, walk thru, it's like a mini getaway from city life.   It's a mini trail maybe a few hundred feet long, but the view and being surrounded by forestry made it so serene.", "author": "Roxana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "YOU WILL DIE OF EXHAUSTION, but you will die happy because the view is phenomenal. This whole area is a visual delight--unique homes with fascinating architectural elements everywhere. My legs burned. But my eyes were happy.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "If you feel like you've completely exhausted your San Francisco to-do list (believe me, it can happen quickly whether or not you actually live here), there's always the stairways. While searching through different lists of \"off-the-beaten\" things to do in the city, I came across the Lyon Street Steps. Lyon Street Steps is one of 8 different stairways that can be found throughout San Francisco (see more here: http://www.sftourismtips.com/stairways-of-san-francisco.html). Basically, due to the hilly nature of SF, there are going to be some opportunities for architects to use their creativity and construct beautiful steps that carry people from one end of a street to another. The steps on Lyon Street is one such creation. \n\nLyon Street Steps, as indicated by its name, is located on Lyon Street right outside San Francisco's Presidio. The really amazing thing about this stairway (as well as the other 7+ in SF), is that it really does serve a necessary purpose. Essentially, these steps facilitate direct access between Green Street (the top), to Vallejo Street (the middle), and to Broadway (the bottom end). And plus, there are actually houses that lie along Lyon, making it imperative for such a stairway to exist. \n\nMy girlfriend and I decided to visit the Lyon Street Steps as part of our whirlwind tour through San Francisco's hidden attractions. The great feature about this place is that it's situated right next to the Presidio, meaning that there shouldn't be TOO much traffic. It's usually very quiet here since it's in a mostly residential neighborhood + there should be PLENTY of parking spaces. You're almost guaranteed to find a spot right in front of the top of the stairway. And, since it's next to the Presidio, why not pass by whenever you plan that one day trip to the famous national park?? I know you're planning on visiting lover's lane anyway ;) \n\nAs many people have mentioned, Lyon Street Steps is GORGEOUS. I don't know who has been hired to keep this area in tip-top shape, but that person should be paid well. It's almost impossible to imagine that Lyon Street Steps is a public space because 1. it's so clean, and 2. the bushes are so well maintained and manicured. This place is totally PERFECT for photographers. Like you don't even need skill to be able to take a great picture. Plus, if you are brave enough to walk down the stairs (kind of steep, but there's guardrails), you will find one of San Francisco's \"hearts.\" Yes, the city has more than just the one in Union Square. I think the heart is a fitting emblem of the beauty and love that this area evokes. \n\nI totally recommend adventurers and thrill-seekers to come out and explore the Lyon Street Steps. You can definitely spend longer than you plan here. I may actually just drive up and run around the area because it's so beautiful and you can get a workout climbing those stairs. Thus, I give Lyon Street Steps an \"omg, I'd travel 2 hours for this.\" Heck yea, come visit one of the more underrated and lesser-known places in the city! \n\nHave fun and prosper,", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "This street is so cool- when you climb up the stairs and look back, you can see The Palace of Arts. I've been here twice and most people come here to see the view or the locals run through. \n\nThe first time was in April and the trees were green. The second time was in February and the trees were pink! \n\nLyon Street Steps is a beautiful spot to check out if you're in SF!", "author": "Evelina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Note to self: Do not attempt to run up and down these steps numerous times with your very energetic and athletic friend Fiona, after not having exercised for more than a year. Will wind up in the chiropractic office.\n \nSaying that, the Lyon Street Steps are oh-so-San Francisco and a real treat to immerse oneself in. To me they are a celebration of being a local.", "author": "Camille L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Beautiful, breathtaking view. \nThis is definitely a good spot to work out, or just enjoy the view. \n\nThe steps here are insane and it's definitely going to put you to work! It gets fairly busy with many local residents working out, jogging the stairs. \n\nMainly street parking, so prepare to go during off hours if you want to be parked closed by. The area is extremely clean. There's the presidio park nearby so you'll also see families and their kids and dogs.", "author": "Kaily V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Beautiful neighborhood surrounding the Lyon Street Steps. Everything from the landscaping and gardens to the exquisite homes along the steps and the view from the top and seeing the bay. It can be breathtaking... \n\nThe homes are something else. I have a few favorites along the way. They are what San Francisco dreams are made of. The gardens are beautiful and expertly manicured. The view from the of the steps is something to behold. You see the Marina, the Palace of Fine Arts and the Bay. It's a great view, a great look. \n\nLot's of people are taking photos and even more are using these steps for their aerobic workout. So definitely try and not get in anyone's way. I cant blame them for wanting to workout there. What a backdrop to their exercise... It's too bad the heart sculpture was gone. It was one of the things we wanted to see. It's still a nice SF spot to visit. \n\nStreet parking only. Check the signs for street cleaning. Turn your wheels. This is San Francisco. Hills and inclines are the norm.", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Last year, Yuri and I found the Hidden Garden Steps and the 16th Avenue Tiled Steps, but somehow, we missed these Lyon Street Steps...\n\nThanks to Daniel C. for pointing them out to us!\n\nWOW!  The surrounding gardens are so beautiful!  The landscaping is amazing!  The views of the city are breathtaking!\n\nWe were so sad that the Heart Sculpture was missing.  It is one of 131 Hearts in the City of San Francisco.  Hopefully, it's being repaired and will return soon.  We'll visit again and check on it!\n\nNote: The Hearts in San Francisco Project began in 2004 to benefit the San Francisco General Hospital Foundation.  The most famous Heart could be the one at Union Square on the corner of Powell and Post.  This Heart is named \"America's Greatest City By the Bay\" and was created by Tony Bennett who sang, \" I Left My Heart in San Francisco\".", "author": "Nadine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "So. Kinduv a not-so spur of the moment trip to SF this morning (1/18). As soon as I rolled into bed trying to readjust my clock on a night off, I rolled out seeing as the clock read close to 0445. I'm usually up an hour after to get my fasting workouts done in the morning anyway.\n\nI wanted to keep today's activity outdoors as I'm still coming down from a week-long virus.. so whaddaya do? Don't check the weather, throw on your regularly-layered \"SJ\" gear and make an hr+ trek up to The City in sketchy overcast... solid sponto-thinking on my part, no?\n\nThese steps were wettt when I got here! It was cold, dark and hard to read parking signs despite the generous streetspace up on Broadway. Currently there's construction going on in the area, don't think I need to say come early.\n\nLyons has its varying degrees of inclines, flat breaks and step sizings. I'm more used to having a difficult leg towards the top of stairwells like this, but here it gets worse going down. Steps are wide and long coming from the top with some breaks around the big house and steep and narrow on the last two flights.\n\nI'm sure the view's a lot more pleasant on a nicer day.. but is it worth the drive? Maybe. Probably more worth it for locals to exert themselves here, but for commuters like me who like to make the most out of their time in SF... you're already gonna be walking the streets anyway. Your thighs will not love you the next day.\n\nGo for it if you're game/athletic/The Rock.", "author": "Jason A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "\"Where you from?\"\n\"What brings you here?\"\n\nThese were just some of the questions I got asked as I was at the top of the stairs. I obviously looked and acted like a tourist and I don't blame them. I've lived in SF for 24 years (minus 2 years in LA) and this is the first time I've been here. \n\nThe view from top is excellent when there's no fog, but hey, that's Bay Area for you. I was lucky and there were just light scattering of clouds, but overall good visibility. \n\nThe Lyon steps is kinda tucked on the side of Presidio Park and near a lot of expensive houses. Expensive as in millionss (double s was intended). The good thing is the ample amount of parking available. \n\nAs it's a great place to take someone not from SF, I've also learned it's a great place to get your sweat on. There are tons of people going down and up these stairs and people bringing their yoga mats. \n\nLyon steps is a great way to start as it can lead to various Presidio trails.", "author": "Fiona L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Great work out and the best views ever. Lucky to be part of it!!! Also saw many people do by the same and it was inspirational. Any one can do the Lyon Street Steps!!", "author": "Rosemarie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "We came here right around sunset and it was so pretty ! The view was great, and there were not many people there at all! Totally awesome photo op. Just some local people exercising on the steps. \nThere are a lot of steps and I got a little by tired but the view was totally worth it. There are lots of flowers and one for the heart statues are also there on the way up. \n\nThe only thing is that there were a lot of mosquitos or some other kind of bug there and I got a few bites. The location is also in a residential area so parking is tricky and being really loud would be really rude I think.", "author": "Seia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Lyon street steps is a must every time I visit San Francisco. For the gorgeous and expansive views, the gardens, and did I mention the actual steps? Serious calorie burning can happening at the Lyon Street Steps. If you want to exercise outside and enjoy amazing views it's doesn't get better than this. If you're cruising around the city and want to check it out it's greedy for that too! I do recommend Wearing comfortable shoes- that way the walk up isn't so painful. The walk up\nIs well worth it!", "author": "Isabella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Wanna workout?\n\nWanna spot one of those amazing San Fran Heart sculptures? \n\nWanna beautiful panoramic view of the Bay?\n\nWanna capture some of San Fran's most beautiful homes?\n\nGo to the Lyon Street Steps and get it all.\n\n~Christy", "author": "Christy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Lyfted to the steps but \"unfortunately\" was taken to the top of the stairs instead of the bottom.  Aw man...guess we can't climb it.  Darn.\n\nThere are several people working out at the top of the steps.  From instructor-guided workout groups to people doing burpees on their own, this is a GREAT alternative to your standard gym.  The rewarding view of the ocean + city is absolutely incredible.  If you go down one flight, you'll also get this take pictures with an SF heart. \n\nDef recommend, and also to stop by the Andy Goldsworthy's Wood Line and Lover's Lane just a block away for an easy walking trail.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Breathtakingly beautiful. There's quite a view from here, both up at the steps and down from. It's a lot of cardio, but the sight is worth it.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "I feel these are the next level steps for after walking up Moraga Steps. When you walk up the first flight of steps, once you get to the top, you think it's over. But, that's only the beginning! That wasn't actually the actual Lyon Steps. There are two more flights of steps after the entrance. You may be left out of breath after getting to the top, but trust me, the cardio game is worth it. The view of the bay is amazing! On a bright day, you get a view of the beautiful waters and the bright blue skies. You can see the Palace of Fine Arts in the distance. Halfway through the steps, there's a garden area and ledge to take pictures. Also, there's a heart shaped monument that people enjoy taking pictures with as they're running the flights of steps. The views are amazing and while you're at it, you're upping your cardio as well! Definitely be ready to sweat buckets afterwards!", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Don't be a sissy. I saw a pregnant lady climbing these steps!\n\nHow many steps exactly? about 330. At a very, very steep incline.\n\nThe Lyon Steps are SF's worst kept secret. (This and anything with the words \"hidden gems\" in a yelp review!) But I ain't hating! if you are standing at the top of these steps with your jaw dropped down to the ground and are just stunned by the magnificent views of the bay, the golden dome of Palace of Fine Arts and the mysterious forest that is the Presidio, SF has definitely done its job. Just give way to the serious boot camp work out folks who will breathe down on your neck if you're sloooow to climb these steps. \n\nTourists have managed to find these steps because the 45 bus drops you off at Union/Baker sts. and it's a short walk from there. Parking is never an issue around here either. No matter whichever way you get here, save some time to gawk at Billionaire's Row (mansions on Broadway st) and wish/dream how it is to live inside these houses. I know I have!", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "[Out-of-Towner Review]\n\nSweat. Check.\nThe view. Check.\nPeople watching. Check.\nPublic Heart. Check.\nBeautiful Homes. Check.\n\nFunny thing is, there are two sets of steps here and there are THREE different streets you can use to park to get to any beginning or end of either set. But we didn't know that, so like touristy Sacramentans we started at the very bottom (insert Drake voice), no we're here!\n\nWe did this leisurely, but I loved seeing people use them for their workout. I was sympathy sweating for them. Definitely a spot that has high foot traffic, but it's a great, quick little spot to visit. You get a great view of the bay and a semi decent view of the Palace of Fine Arts.\n\nI loved seeing another \"Public Heart\" here too. Finding these all over the City makes me smile. It's interesting that there is a gorgeous home right at this spot, but it's gorgeous, to say the least!\n\nTourist or local, they're good for everyone!", "author": "Steph G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "One of the best places to get a natural cardio workout. \n\nAmazing views of the San Francisco Bay, The Presidio, and Pacific heights Mansions.\n\nJust look out for all the MILF's running up and down the stairs with commando workout attitudes.\n\nTourists  Definitely  a great off the beaten path place to visit.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "This is a steep hike, and it's beautiful! I was hiking with my mom the other day. So yes, we did need to stop once in a while to enjoy the scene (actaully taking a break). You get to have a very nice view of the city. You will enjoy it!", "author": "Missy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "These are a short distance of stairs that provide a beautiful view of the Golden Gate Bridge at a distance.  For those coming for the view, you will be satisfied at the photo opportunities up here.  But the main purpose of these stairs is to burn calories and work those leg muscles!\n\nAfter eating all the fantastic food in San Francisco, I desperately looked for a place where it would provide a nice scenery, but also giving me a good work out.  I found the right place here; it was stairs and more stairs.  It wasn't too hard, as the steps were actually low and flat, so it was easy to keep going.   You can probably go up and down several times before you actually feel winded and exhausted.\n\nParking is plentiful on the street and on the top is an entrance to a park that leads to several walking trails.  Bring some water, run those steps, and turn back and enjoy the view!", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "Great place to get some stair work done. The first round of going up and down is ok, but repeat this several times and the workout is killer. I ran through the city the other day and hit Lyon Street Stairs. Did 4 rounds in between my run and I definitely felt the burn. The view is SO AMAZING-- it's motivation to keep going up to see it again.", "author": "Elysse P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "A hidden gem in the Pacific Heights neighborhood!\n\nI was staying with a friend in Cow Hollow during my trip to SF. One afternoon, we decided to explore her neighborhood since it was a beautiful sunny day (apparently very rare in SF) and we eventually stumbled to the bottom of the Lyon Street Steps.  What followed was experiencing one of the most beautiful spots in San Francisco. \n\nThere are several sets of steps. The middle of the staircase has a beautiful heart shaped sculpture - a great spot for a photo op. The very top of the steps has the most breathtaking panoramic views of the Bay Palace of Fine Arts, neighborhood mansions, Presidio forest and even Alcatraz in sight. \n\nThe steps are steep, but this spot is scenic and worth doing. It also seems to be a popular place for locals to work out as we saw several (athletic) people running up and down the stairs. Someone even did a few pushups and sit-ups at the top - so intense. \n\nHighly recommend the Lyon Steps for scenic views of the bay and a less touristy spot in the city! A beautiful spot in SF.", "author": "Syyu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Gorgeous set of steps that provides picture-perfect views of Alcatraz and the Bay while running alongside a number of mansions, including that of Sen. Dianne Feinstein, in an exclusive neighborhood. \n\nAlthough many West Bay locals go up and down these steps as part of their workout routines, there usually isn't a whole lot of douchery or entitlement on display here, as joggers and tourists alike usually watch out and make room for others accordingly. Definitely worth a visit, especially as part of a walk through Pacific Heights.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "\" I LEFT MY HEART IN SAN FRANCISCO\" \n\nAfter reading the little placard that was by the heart, I understand why I hear that phrase a lot. It stated that the Hearts of San Francisco, this golden heart was one of 130 sculptures beautifully and inspired heart sculptures that were created by local Bay Area artists in an exhibit of public hearts project that was debuted in 2004. Never realized that there were that many hearts. I'd love to see all the hearts in my lifetime.\n\nI was on a hunt for hearts during my past SF day trip with a friend. She told me about this Lyon Street Steps that beholds a golden heart. It's another hidden gem spot located in the Pacific Heights neighborhood. Such a beautiful sight to take pictures at and also overlooking the neighborhood. SF must love their stairs, I've seen so many during this one day trip to SF. Of course, we weren't prepared for hiking another set of stairs after coming from the mosaic steps. But I've seen a few people do their cardio here. Although it looks pretty intense, it'll probably take me a while just to get up there. haha.", "author": "Roxanne Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "Great views of the ocean, palace of fine arts. It seems like a great place to work out as well because running up and down the stairs sure made me tired! There's also a SF heart there that makes it the picturesque spot! Not many tourists so ample space to take great photos!", "author": "Sunny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I didn't actually climb all the stairs but if you park on top and walk towards this area, you won't be disappointed with the beautiful view of San Fran.  There is a ton of parking and the Lyon Street Steps are surrounded by amazing homes that can stir envy in the most humble of people.", "author": "Monica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "You want to do some nice legs workout? This is the perfect opportunity. What a view, amazing stairs, pretty heart for the 'picture with a SF hearts' selfie collection. Free parking nearby at this beautiful Pacific Heights neighborhood. In a sunny day is just such a wonderful place to get an amazing view of the ocean and do some 'street yoga' or any soft workout (I saw some ladies with their mats and weights and it was very motivational'. Even though you will see so many people running up and down those stairs, there is a sense or order that is actually quite impressive.", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "If you're looking to get your ass kicked by some steps, this set is more appropriate than the 16th Avenue Tiled ones.  Motivation will come as you watch tons of other people run up and down with you.  Occasionally, there will be tourists who get dropped off at the top (lucky bastards) only to get winded just coming down.\n\nOnce you've done this however many times, you can cool off by continuing the walk at the bottom towards Palace of Fine Arts.  The sidewalk to that area is wide so you walk or run comfortably.  \n\nAt Lyon and Lombard St., you'll get to these set of buildings that look like they're in a park.  You can walk through, lay on the grass, or use the bathrooms at Starbucks.  Truly a lovely way to spend an afternoon!", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "I rarely climb these steps since I work in the neighborhood. Lots of people cross train here.", "author": "Julio B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "The best thing about the Lyon Street Steps is the view. A prominent part of the steps is the \"Heart of SF\", which also makes for great pictures. There are lots of people working out- running up and down the steps. While I on the other hand was trying to catch my breath.", "author": "Helen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Some say this place is one of the  \"Top 10 THE Best Places to  Kiss in San Francisco..other's say it is a runner's dream.\nEither way - it will take your breath away!\nCount the steps - I Double Dare you...", "author": "Miami S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "332 beautifully manicured steps with incredible views! The steps are a little busy with people working out and running up and down, but everyone worked well together no matter the pace. Good mix of people just casually walking around too.\n\nWorth a visit regardless of whether you want a workout. The neighborhood includes mind-boggling multi-million dollar mansions, and the view goes for miles.", "author": "Miranda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "As long as there are not to many joggers these steps amazing. A work out, a view and nice gardens. A must do in SF.", "author": "Kelli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Drove up here from Andy Goldsworthy's Wood Line, so we didn't have to trek on the super steep slope to the top of the stairs. The view was amazing, and going down and up the stairs was surprisingly not too tiring because the steps are pretty shallow. The steps are in a nice neighborhood in the Presidio, so definitely check it out if you're hiking in Lands' End and want another gorgeous view!", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "So I used to live 3 blocks from here and walked my dogs here almost every day. One of the best views in the city!!!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "This is definitely a hidden treasure of SF. My group of friends exploring SF just finished exploring the 16th Avenue Tiled Steps and they hated me for wanting to stop by another steps tourist attraction. We parked in the neighborhood and walked to the set of stairs. Originally, we weren't going to go up because the firs set of stairs looked boring and plain so we sent our two guys to go up and tell us if it's worth it to go up to the 2nd flight of stairs.\n\nAnd they reported back that it is pretty! So the girls made the trek up the stairs, slowly but surely. And at the second set, there is one of those SF hearts and it was decorated with flowers all around. After a few minutes of catching our breaths, we squeezed in a few photo ops and continued on our exploring SF agenda.", "author": "Minh-An C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "I love exploring SF whenever I'm back. We went here just to check it out and it was busy with a bunch of people working out! The stairs are steep and perfect for a leg workout. Not to mention the view from the top is breathtaking (as are most views from Pac Heights). Just a nice place for a walk or workout.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Gorgeous set of stairs they lead you up to a great view of the bay. It was clear but not sunny in the November Sunday but the view was still amazing. Lots of people doing exercise here as the staircases provide quite the cardio! If you are visiting and stopping by in the marina, check it out, it's definitely a new fave place of mine!", "author": "Betty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "I went to Lyon and Green St.\nParked.\n\nIt's a dead end leading to Lyon Street Steps but where Lyon meets Green, there's a house that was used as Grove High School in Princess Diaries. I have nieces. I love Princess Diaries. \n\nLyon Street Steps are two sets of steps with one of the hearts of San Francisco between the two sets. These steps connect Pacific Heights to Cow Hollow.. all 244 steps of them. It's a good workout.. Just ask all the people that run up and down these steps. People lapped me. It was a little ridiculous. The top of the steps are at Lyon and Broadway where you can take in some views.. You can take in this view all the way back down actually but you can appreciate it more at the top where you don't have to worry about each step you take and people passing you by..", "author": "O M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "I absolutely love this place. My boyfriend and I came here to take maternity pictures. It was absolutely breathtaking. We were so pleased with the view of the city we climbed every step. Mind you I'm 9 months pregnant and die in 9 days. If I can climb those steps I know you can too. \n\nIf you live in the city or anywhere in the baby you should pay this place a visit. I moved to the bay two years ago and this was my first time to this place. If it wasn't for maternity shoot I would have never found this place.\n\nIf I live here in the city I would probably be here every weekend running those steps. There are at least 200 steps here. It's worth the try if you want some intense workout while overlooking the city. \n\nYou will not regret coming here I promise you. Be sure to come in your tennis shoes though because there ARE A LOT OF STEPS!!!!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "Another Gem in San Francisco with an AMAZING view!!! This view looks out into the ocean towards Alcatraz and the end of the warf/ where the presido is. The Lyon Street Steps are located in Pacific Heights above the Palace of Fine Arts. \n\nThese stairs are no joke!! It is a great way to enjoy beautiful scenery while getting a killer workout. They have about 3 blocks worth of stairs upward. Many locals come here to run up and down the stairs to get their work out. While tourists climb to the top to enjoy the view. Either or Lyon Street Steps are the perfect for either or. \n\nNow that I know what I am in for, I will definitely come more prepared with running shoes and workout gear, because the workout we got just walking up and down was great, I can only imagine the workout someone could get running up and down!!!", "author": "Rochelle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Secret spot around the city! Must place to go for a beautiful view of the city. Princess Diaries fans: down the street you'll find the location of Grove High School", "author": "Florence D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "First of all steps are one of my biggest fears along with heights! And these were so worth getting over my fear! Beautiful views! People working out were really nice about me going slow going down as I stayed to one side. Definitely worth the stop!", "author": "Lydia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-04", "description": "STAIRMASTER PLUS BUTT LIFT\n\nThe stairs start at Lyon/Green and go up to Lyon/Broadway. This is the last flight of steps, all nicely landscaped and pretty (unlike the first set of steps at the bottom):\nhttp://www.yelp.com/biz_photos/lyon-street-steps-san-francisco?userid=QhYJx2jQdPuSq3fGe3aGcA#e1DG7GOmI0541PN47a3O-g\n\nThere are approximately 250 stairs and at the top you are rewarded with stunning views of the bay, Alcatraz, and the bridge (depending on how clear it is). \nhttp://www.yelp.com/biz_photos/lyon-street-steps-san-francisco?select=5hCYVWg9qndc0HCcfcQ3ig#5hCYVWg9qndc0HCcfcQ3ig\n\nThere are crazy ass ninjas who run up and down this for exercise, and there are some who walk up one flight and give up and go back down. Then there are some who drive to the top of the steps and park (on Broadway) for free and just take in the beautiful scenery. Don't judge. If you still want more, there are some hiking trails at the top of the steps that go into the \"forest\" but we didn't venture out there this time.\n\nThank you Phillip for leading the way. This place was a true hidden gem! We even got to catch a glimpse of the City Grazers (goats) who were still munching away!\nhttp://www.yelp.com/biz_photos/lyon-street-steps-san-francisco?select=Ry1QRE_NtmgCn_rjduIyrw#Ry1QRE_NtmgCn_rjduIyrw\n\nBest of all, it was FREE!", "author": "Lori I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "First came to these stairs with my love. It was one of our first few places we had gone together. Tonight came back with my bestie. Great place, gorgeous view, hick of an exercise", "author": "Samineh H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "The address listed for the Lyon Street Steps should be changed from Lyon Street & Green Street to Lyon Street & Broadway Street.  If you go to Lyon & Green, you'll be at the bottom of the steps, which is nothing special.  So, type into your GPS Lyon Street & Broadway Street and you'll be at the top of the steps.\n\nAt the top of the steps, there are stunning views of San Francisco facing north towards the bay.  From here, you can see Cow Hollow, the Palace of Fine Arts and the Marina District.  The steps themselves are located in Pacific Heights.  These neighborhoods are mostly residential and very ritzy.  The good thing about this is parking is easy to find.  There isn't much here, so the area isn't touristy nor trafficky.\n\nA lot of folks like to exercise on the steps.  There are eight flights of 15 steps on the upper, more \"scenic\" and decorative, section of the steps.  There are two flights of 62 steps on the lower section that ends at Green St.  That's 244 steps total.  I don't recommend walking them unless you're specifically looking for a workout.\n\nIt's widely known California Senator Dianne Feinstein owns a house on the steps.  Guess which one it is.  The entire stretch of steps is privately landscaped, so it always look quite nice.  The steps are certainly worth a visit if you have a car and you're in the area.  Visiting during the daytime is better.  The fancy houses are fun to look at and admire too.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "I got bored at the gym so I yelped \"best stair workout\". Low and behold, I came across this gem. \n\nI love living in this city and still finding new places to go. Not crowded when I went and even with the flux of people passing through and working out, it was never packed and I got my workout on peacefully. I'm always looking for stairs to utilize for my workouts and I would recommend this spot. \n\nThe view is toward the ocean and the north point area. Not 360, but it was nice to see something I don't always see. And there's an entrance to the presidio next to it.", "author": "Jenna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Location Location Location\n\nThe steps themselves are not the focal point.  But - Wow! - everything around them certainly is!  If you like large, expensive homes, beautiful gardens, and amazing views of the bay, these are the steps for you!", "author": "Ted Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Great quick set of stairs with a nice view. The neighborhood is amazing - so many extravagant, fancy hou$es. If you must choose only one set of stairs in SF, though, do the 16th ave tiled stairs - much better view and less crowded. \n\nI did this on the way to Lombard St. (taking the bus) which turned out to be a good route. \n\nIt's pretty entertaining to watch all the people working out. They sure do love these stairs.", "author": "Marcia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Who needs a stairmaster when you have the Lyon Street Steps?  This is a popular place for people getting their fitness on.  However, I wasn't coming here to run up and down the steps while carrying two 5-gallon water jugs.  I actually just wanted to check out the garden in front of Senator Feinstein's home and also see the view from the top of the staircase.  This neighborhood is filled with multi-million dollar homes only one could dream of living in.  Ocean views are beautiful and the Lyon Street Steps with surrounding landscaping add to the appeal of the area.  One of the 130 hearts around the city are found here - makes for a nice photo-op.  There are two sets of stairs but nothing too challenging unless you plan to join the cross-fitters!", "author": "Liv A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-20", "description": "Damn.  What a workout!  The view ain't too shabby either.  :)\n\nWatch out for all the other people working out.  They're like sweaty machines out there!  It's also great motivation because everyone running the steps is in incredible shape. \n\nThe air is so fresh that if you're used to LA air like I am, it'll hurt your lungs.  Just saying", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "Not sure if I derped and if there is more to these steps but as I was walking toward the Presidio Park, I came upon the steps. I didnt realize it warranted its own yelp page since I thought it was part of the Presidio. It has a nice view of the city as you walk down and it will lead you to the Palace of Fine Arts or the park. This is a short staircase but I guess if you came here to work out and went up and down the stairs, then it would be legit. Make sure to take a photo with one of the SF hearts!", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Long steep set of stairs right next to the Presidio with the hearts (next to Dianne Feinstein's house) and lots of exercisers. If you can avoid the sweaty people and make it up the stairs you'll be rewarded with some great views of the Marina.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Oh how I love outdoor training in San Francisco. The weather is always nice, the scenery is beautiful and there's plenty of hills and stairs to challenge your runs. The Lyon street stairs is one of my favorite outdoor workout spots. The stairs are super long and get steeper towards the bottom. There's no doubt that you'll get a great cardio workout regardless of your athleticism. \n\nDepending on when you go, you may run into bootcamp classes, teams and other exercisers. I like to make my rounds here in the mornings, just as the sun is rising and the temperatures are cool. \n\nYou get picturesque views of the bay, Palace of Fine Arts, Marina, etc. It's also in a nice and bougie neighborhood and parking is pretty easy here.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Get steps for a killer workout! The views are gorgeous and the air is fresh & clean.\n\nIts also great inspiration once you've reach the top and see the view, take a deep breath and be happy & thankful for the life you live.", "author": "Court S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "Left... Left... Left, Right, Left! \n\nIf you're interested in undergoing your own personal bootcamp then search no further! Lyon Street Steps will whip your tush right into shape. \n\nUnassumingly so, I took the challenge of these steps as if it were a piece of cake. Half way up the first flight, I was already panting and out of breath. My calves and thighs were buuuurning.\n\nAfter reaching the very top, I paused for a moment to regain my strength and slowly began to descend down the stairs. Thank goodness for side rails; my legs felt like jelly and I feared I might tumble down the rest of the way.\n\nRoughly three days after, my legs were still sore. I've been maneuvering myself throughout the city like a bow legged cowboy, Yosemite Sam style, grimacing each time I dropped something on the floor and had to stoop down to pick it up. \n\nWith all that said, no pain, no gain. These steps will surely deliver results if you stick with it long enough. Then again, I'm still a work in progress. I'll let you know when I get thurrrr.\n\nThis is an awesome way to challenge your endurance and a great addition to any workout regimen!\n\nAtten-hut!", "author": "Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "This is a must visit plce of San Francisco for sure if you like beautiful views! I would imagine it's hard to get to this area if you don't have a car, but it's worth the Uber fare, trust me! There are some cool things to see on the way to the top of the view, so remember to stop by and take pictures.  \nOne slightly annoying catch about this place was that there's always somebody working out and running up and down the steps, so you're always in somebody's way.  \nWhile you're here in the city remember to visit the Moraga steps too!", "author": "Vishaal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "I wished I would've guzzled some h20 along with my mass amounts of coffee before going to this gem of SF. \n\nEven though I don't have a fitbit (yet,) I ask Colin how many steps we are at when we get to spend the day together. Knowing this and how I was complaining about my pants not fitting after indulging (a lot) in the city this week, he planned a date here. (What a catch, huh?)\n\nBesides the breathtaking views and literal breathtaking steps, I might not have to leave my then tight pants in San Francisco!\n\nGo. Smell the flowers. Be prepared to de-layer. Pet some really cute dogs that are along with their athletic mom or dad.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "There's nothing quite like trying to get to your destination and stumbling on a mini-gym in downtown San Francisco. Impromptu work out, anyone? Okay, I lied. There are better things in life, but you get one in when you can, right? Even if you're wearing dress shoes and on your way to meet some people. What's a little sweat?\n\nI was floored when I got to the top of the street steps. What a gorgeous view --- overlooking San Francisco. It stopped me dead in my tracks. The smells, the sounds, the flood of endorphins that comes after running up so many steps. If I lived in San Francisco, I'd come here often. It wasn't too crowded for a Sunday afternoon (I wonder what it's like in the mornings?) and a total must-visit if you enjoy city views, exercise and fresh air.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Today was a cloudy gloomy day so I decided to head out to Lyon Street steps- one of the many items on my bucket list of places to explore in SF. There are three sets of stairs here- not just one set like I thought! Lots of in shape people running up and down these steps, sweating and out of breath when they reached the top, but they would turn around and do it all over again! Definitely a great place to check out if you want to change up your workout. The area is surrounded by multi-million dollar homes with great architecture which makes it a unique spot in the city to explore. It was also just a few blocks from the Presidio entrance that has a Starbucks if you need a restroom break or just want to hang out in a great relaxing setting.", "author": "Elaine Tiffany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "One of the hidden gems of SF. Top 10 views? I think so. Take a drive through the neighborhood while you're at it. $10 million dollar homes definitely give you something to think about.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "If you're in the area, definitely take a walk up and down these steps. I had just visited the Disney Museum, and this was a nice walk over.\n\nYou'll have to avoid a few joggers, but it's a great view that's well worth the mild panting going up the stairs may induce.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Amazing view of this gorgeous city  if you go to the too sure will you will get your heart rate up.", "author": "Angiel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "Blocks have 3 hr free parking? Check\nGetting your exercise on? Definitely Check\nAmazing view at the top of the steps? Check..well, only when you're blessed with a rare bright and sunny day in San Francisco. \n\nThe first leg of the steps from Green street is STEEP. Man, don't take it lightly. I was huffing and puffing by the time I got to the bleeding bird heart thing. Now the 2nd leg of the steps are not too bad. and by the time you get up there, you'll be hit with an amazing, breathless (heh) view. \n\nAfter you're done with this, you can head down to visit the Palace of Fine Arts or wander around Laurel Village for a cup of coffee. :)", "author": "Sandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Absolutely wonderful!  We enjoyed the staircase - and views! - on a lovely Saturday afternoon. I can see how it may be crowded so try to go mid-day.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "By far, this remains one of my favorite stairways in SF.  On a clear day, the sweeping and grandiose views of the Pacific Height palatial residences, the GG bridge, Alcatraz, Marin County (Tiburon & Sausalito) and the BAY are just breathtaking and awe-inspiring.  I always blame the runner's high or utter exhaustion and pain after completing stair climbs, but I've been known to weep over the beauty when I reach the top landing.\n\nNot to mention, you can get a killer core, quad and glute work-out here.  A fellow NPC bodybuilding competitor almost killed me here during a training day this week.  I ran the full stairs once, performed lunges, squats and calf-raises and then, back to back stair climb repeats followed by more lunges, squats and calf-raises...and one more run up the full set of stairs and then, a half set of stairs.  Needless to say, I was DYING by the time we hit our last set of lunges and squats.  \n\nIf you happened to remember witnessing a little Asian lady crying at the bottom of the stairs while performing squats...well, that was me... hahaha.  OMG!   Best memories!", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I loved this place! I went for an exercise and this was my exercise route: start from top of lyon steps and go down all the way, go to palace of fine arts and go around the small lake, come back to lyon steps via presidio park, and climb up the lyon steps! The view is amazing from up there and it's a great exercise place to go for locals.", "author": "Erika S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Love the incredible stair cases in San Francisco. Lyon Street Steps are no exception! They are super intense. Lace up and give running them a shot. There is a gorgeous heart in the center or you can simply soak in the view from the top. It's located in a stunning neighborhood and is worth a visit. Word to the wise: tour buses stop here so go earlier in the morning to avoid the chaos!", "author": "Kari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Wow, so many intense people working out here and with such impressive bodies, at that. Figures, as these stairs are in-tense. Up close, the reward is definitely the beautifully landscaped and well-maintained gardens, as well as impressive homes. The SF heart with a flying bird in the middle of the main garden was a pleasant find. As you reach higher and higher, the overlooking view of the bay is also a nice perk. Keep right to stay out of the way of the intense stair climbers. The area is a nice mix of tourists and locals, which I appreciated.", "author": "Phoebe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "Holy crap. There are so many stairs. I thought there were only a few sets but it turns out there are much more. I only made i up two sets but I could tell the view was pretty amazing. It's a bit out there in the city, but if you want to get some good exercise and some nice views of SF, by all means seek it out. \n\nIf you want to get into shape, run or walk up these stairs regularly you'll be bootielicious in no time. I plan on finding more steps like these to get into shape after gorging myself...maybe before?", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Great walk, but difficult for people who have children. The view is spectacular and lots of areas to stop and take pictures. Not much of a wait to walk up or down for a Saturday morning.", "author": "Michele N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "GREAT. WORKOUT. with a great view!\n\nI overheard it was 291 stairs. I did a circuit of 4 sets, at the top did pushups and sit ups then got back to it. My goal is to work my way up to 10 sets by June.\n\nBonus: one of the SF Hearts is located here!", "author": "Megan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "The perfect place to exercise in the northern / Marina / Pacific Heights area of SF. First, parking is free all Saturdays and Sundays (a rarity in SF), and there's a ton of it. Second, everyone is nice and not pushy like other workout / makeout point / tourist / sky viewing areas. \n\nThe stairs are separated in sections and with one of the beautiful SF Hearts art displays. Your water bottles and bags are safe and likely won't be stolen. People are there to jog or walk up the well maintained stairs that lead to a breathtaking view of the city, the Palace of Fine Arts, and the Bay.\n\nLove it. Come workout and get a great view.", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "What's not to love about these steps?  Great workout, easily accessible for most parts of The City, and, oh yeah, kick ass views!!\n\nSo usually when I am in town, I will run from my hotel through Pac Hts and end up at the steps, hit them for a while, and run back. Perfect workout and a perfect route to see some of the great parts of The City. Right at the edge of Pac Hts and the Presidio, the views can distract you from your workout, and, frankly, they should!  The bottom half of the steps is a little narrower and steeper, with the top half being wider with a ton of perfectly manicured landscaping.  At the top, there is plenty of room to get in sit ups, push ups, or using your thigh master between trips to the bottom and back.  You can get a great workout here if you hit it hard, and there are plenty of people that do.  \n\nOn weekends it can get crowded with some tourists milling about, taking pictures, and all the stuff that tourist typically do.  They can and do slow down a workout (especially on the top half), but that's the price you pay when you choose to exercise at a venue with a great view.  Hit the stairs hard and then enjoy the surrounding as you are catching your breath!!", "author": "Gee W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Went up and down the steps 2x. 3 days later I'm still feeling it in my legs! Definitely a great workout! Will be back for more happy but not so fun pain :)", "author": "Nimisa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-23", "description": "These steps will make you oooo,  ahhhh, and ugh.  \n\nFrom the bottom, make your way up the first two sets of extremely steep cement steps.  This is the \"ugh\" part.  This will be tough for first-timers, but an addictive challenge for regulars who come here for a gruesome workout fix.  At the top of these steep steps, you will come to another set of wider steps leading up to some of the most beautiful homes in the Marina.  This is the \"oooo\" part.  Along the way, you will be surrounded with beautiful flowers and architecture.  When you finally reach the top, you will be rewarded with the most breathtaking view of the Marina.  You guessed it.  This is the \"ahhhh\" part.  It is worth every dreadful step.\n\nNow, take a deep breath and make your way back down so you can make your way back up all over again.  Your butt and calves will thank you.  The most I've done in one visit is 9 times.  Bring a face towel.  You will be sweating.  Bring a camera.  You will want to capture the scenery.", "author": "Gloria Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "My hiking buddies and I are in perfect agreement that this is the best workout ever for hiking and endurance training.  The view is phenomenal and the often time cool weather is the best.   Its getting to be a little more crowded these days, but still the best workout ever.  \n\nI've done these steps in my third trimester, with my baby strapped on a hiking carrier, and on my own.   I always walk away feeling like I've done good - and I'm going to feel some pain.  :D", "author": "Regi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "Great place go to for an outdoor workout! It's not an urban hike, or any hike for that matter.  You can either start at Broadway or at Green.  The section from Broadway to Vallejo is slightly easier because the steps are larger, while the section from Vallejo to Green is steeper and narrower. \n\nWhether you're looking at the mansions on Billionaire's Row or the view of the Palace of Fine Arts, there are great views all around.\n\nI guess you could say that this is San Francisco's version of the Santa Monica Stairs.", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Great place to run up and down the stairs with an amazing view!!!  Seriously, you'll get vertigo, but who cares... you can recover from the dizziness by enjoying the view.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "Just ran the Lyon Street Steps during this week's beer run and wow was it an absolute pace-killer. On the flip side, it made the beer after taste extra good. \n\nRunning up the first flight, you realize you are beginning to lose some steam but that's okay because you are almost at the top. Then BAM! You realize that's just the first of three flights. The run up the steps becomes a brisk climb and then a slow trudge. The greenery is pretty though and the view once you get to the top makes it all worthwhile. \n\nIf you want to add some spice into your run, the Lyon Street Steps will definitely add some challenge to it but think about the extra calories burned... and the lovely view when you are done.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "The views, houses and garden are amazing. The steps can give you a good jump start work out. Never been too crowded when Ive been here.\n\nMany doing these steps and looking at these homes makes you dream about what could be then when you finish and wake up then leave the area, damn.\n\nThis is another somewhat hidden SF gem. And parking around here isnt too bad at all.", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "5 stars for the level of difficulty of running up and down these stairs + the beautiful view.\n\nIt's been a while since I came here to test my endurance. Last time, I couldn't make it up and down without taking 2-3 breaks. It's a difficult work out but for the fresh air, nice views, and a free \"stair master,\" it is worth it. \n\nBy the way, in the middle of the stairs, there's a gold SF Heart with a bird on it. How pretty!  \n\nAlso, if you've ever watched the Princess Diaries, one of the buildings they used in the movie is just down the hill.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "I'm sitting here typing between rounds with the rolling pin on my quads after tackling these steps yesterday for the first time.  I've been running, climbing hills, and using the elliptical sporadically and these stairs kicked my ass - legs felt like Jell-o after just one time up and down the full set of stairs.\n\nNow, don't get me wrong - I ran there from Crissy Field, ran up the hill to the steps, THEN ran up the steps, so I don't want to hear any \"you need to do these steps at least twice for a real workout\" business.  Crissy Field to the top of the steps and back is about a 22 minute round trip.  If you're looking for a good 20-30 minute strenuous workout, look no further.\n\nRan up the bottom two flights two steps at a time, then did the next 1 step at a time, then alternated 1 and 2 to the top.  The top part is a blur - I was in survival mode, basically, since the legs felt like noodles after the second flight.\n\nNot too busy at mid-day on a Tuesday.  There were a few other runners here, but none of the crowds that others have mentioned.\n\nThese are going to end up part of the workout rotation to keep it interesting, and I'll be making excuses to go into the city just to tackle them.  I'll build up those Rickey Henderson legs one of these days . . .", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Oh my golly goodness....what is there not to love about this place!\n\nCame here on a rainy day and I loved everything about it!!!\n\nI died making it up the first 2 batch of STEEP stairs, and saw that I was the only one out of breath...then turned around...Oh BOY!  loved the view.\n\nAs we made it all the way to the top oh boy...it started sprinkling, sun was peaking through the clouds...it was just so perfect. I wanna live here just to go up and down the steps everyday....prolly need to find a side business to make that happen :-I\n\nBy the way the houses along the stairs are nice too.", "author": "Navdha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "A nice challenge for anyone who likes running up and down stairs.  The first half is a lot harder than the second half.  The first flight is steeper and narrower while the second flight has wider steps that are friendlier to anyone who likes going up two at a time. \n\nI highly recommend you come here to catch an awesome view of the Marina District.  It took me like 4  hours to get here from DTSF because I had no sense of direction and ended up getting lost.  Good thing there were a bunch of nice folks here willing to give me direction.\n\nI did the steps 2.5 times and was pooped.  It might also have been because I did the Filbert Street steps earlier in the day, but I really think the Lyon Street Step Sisters (har har har) will give you a run for your money!", "author": "May W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-01", "description": "There is nothing to it by walking down these mile-long steps with glamorous views of Pacific Heights and the Marina District.\nhttp://www.yelp.com/biz_photos/5ZoeIusBHVOP1Fip5Hydtw?select=GrQZJqu0cl4S_UGA_2D2aw\n\nBut going back and walking back up these steep stairs:\nhttp://www.yelp.com/biz_photos/5ZoeIusBHVOP1Fip5Hydtw?select=fgaxaWbxHNWlswydpDnEaA\n\nSCREW THAT... unless there is an El Farolito Super Burrito waiting for me on top of Broadway St.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "Started from Broadway/Lyon, walked down to Green, up, down, up, down, up.\n\nDone,  I was pooped and sweaty.", "author": "qirk z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "I haven't felt my heart rate get this high in so long. This is an excellent place to work out and there were even some people giving away coconut water! I'm sore now.\n\nThere was lots of parking, even on a beautiful day, near the top.", "author": "Tomas P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "This is definitely a hidden treasure of SF.", "author": "Gavin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "Awesome views all around and a great workout to boot!  Walking distance from Palace of Fine Arts and always seems like parking is available. \n\nThere's a good mix of people getting their workout in and tourists, which at times block the stairways for others. \n\nAt the top of the stairs (Broadway and Lyon) walk about 200 feet past the Presidio gate for a stunning view of Alcatraz.", "author": "Christina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-07", "description": "Lyon Street Stairs is a great place to get a hard work out. It is comprise of three sections. The bottom of the stairs is located at Lyon Street and Green Street. \n\nFrom there it is 120 small but grueling steps, up Lyon Street, to the top of the first section. Then you must walk across a cul-de-sac (Vallejo Street) to another set of 35 wider spaced steps that take you around a beautifully planted garden. On the other side of the garden is the remaining 120 steps up that will take you to Broadway Street, where you can celebrate your cardiovascular victory! \n\nIt's a very hard work out but the people that go there are generally very nice, pleasant and nonjudgmental. Stay to the right if you are a beginner and get motivation from the pros. Go at your own pace and you will make it to the top! \n\nEach time I do it, it gets easier and I feel healthier and I know you will too. Good Luck!", "author": "Joyce H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "Best workout in Cow Hollow and perhaps in all of Marina/Pac Heights! Go with some friends because you will need the encouragement. A couple of times up and down and your heart will want to pop out of your chest and your legs will feel like overcooked spaghetti. Time efficient, fun workout with a view!", "author": "Annika B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "This was one of my favorite places in SF to work out for years- Beautiful views of Pacific Heights, the Presidio and the Marina. I'd actually do the stairs several times and then run to the GG Bridge along the Marina. I loved seeing the new flowers and plants each season, really impeccably cared for. Also, there are benches and things to help with stretching and different exercises. And I loved that I always saw others working out here- even personal trainers, boot camps, etc. Inspiring and felt safe. Best time to go was early in the am so not too many folks and air was fresh and crisp/not too hot. I've moved from SF, but still remember how much I enjoyed this place.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "These are the finest stairs in SF. \n\nI love climbing them. \n\nI don't like when people congregate halfway up the flight.\n\nWhy am I reviewing stairs on Yelp? \n\nWhy are you reading reviews on a set of stairs? How could this review not have 5 stars:\n\n\"Err, I didn't like the climb up. Too many stairs. Fog was too dense. The stairs didn't carry me up\"\n\nLike... what?", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "Two times up and down, and I am flat on the floor hyperventilating. Want some serious cardio and butt blasting? Look no further.\n\nAnd don't forget about the perks!! Easy neighborhood parking, beautiful view (you really are climbing quite high), gorgeous landscaping, huge mansions to gawk at.\n\nAlso keep in mind that the stairs are not that wide at some parts. Make room for those crazy sprinters.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-01", "description": "I was at the bottom. \nContemplated goin up. Swear.\nGave it one star ONLY because nobody else did & I wanted to be a brat.\nI dont work out", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Love coming here, especially because it's in one of my favorite neighborhoods in SF. It's walking distance to the Palace of Fine Arts, too, if you're feeling ambitious. And that view at the top -- so worth the 5-7 minutes climb. Oh, and parking is never an issue.", "author": "Diana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Perfect place to work out outdoors when the weather permits it. Great views of Pac Heights with things like the GG Bridge and Palace of Fine Arts in the distance. If you're looking to take your pups, walk down a block or two and there's a set of older steps that's less crowded and a good workout for your dogs and you.", "author": "Ashley Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "To ALL of you amazing people who RUN these stairs, and sometimes two at a time, my hat is off to you.  You guys are sick.\n\nBut, I can't give it \"Woohoo!  As Good As it Gets!\" because if it got any better/harder, I'd be dead.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "\"Did the Steps\" as part of my training for promotion at the Shaolin Temple last summer.  \n   I am so GLAD to live in San Francisco and have this available.  NOTHING like almost dying and enjoying the view at the same time.  I love this hilly dilly town.     \n   Check out the Moraga steps for more heart stopping and outright gasping views...", "author": "UnitedStudios S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-05", "description": "WHAT!!! the basketball hoop is gone! This is tragic. Used to be gorgeous place to shoot around....how can we get it back?", "author": "Preston Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-22", "description": "I love these steps - but they are definitely challenging.  Not exactly the Dipsea.  When the weather and the music on my Ipod is right - I am not complaining.\n\nRounding this stack can get pretty busy with lots of trainers and teams.  Unfortunately, I have trouble getting my friends to agree to actually hiking these with me.  I recommend hiking with a friend or creating a \"balls to the wall\" playlist to help you plunge through.   \n\nAs with all of the stairs that I recommend - do not forget to hydrate, turn around, and check out the view!", "author": "Rayna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "Have your breath taken away...with a workout and a fantastic view !!! \nIf you love stairs like I do, this is the place for you. Plenty of room to stretch in between with that amazing view to look at. \nEven better, the Presidio is close by!!!!", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Me and my honey bunches (of oats) as I like to call her went to the Lyon Street Steps for our honey moon. Let me tell you I was not disappointed. We camped outside for the first three days just observing the steps from a historical perspective (We were both history majors in college). on the fourth day of our wild adventure we decided we were finally gonna climb them. Boy what a treat! It took us only 2 hrs 17 mins to get all the way to the top without rest. We really powered through it! As soon as we got to the top and gazed upon the beautiful San Francisco bay, I looked into her eyes. Nothing in this world could have better reassured me that I wanted to spend the rest of my life with someone than that moment. Thank you Lyon Street Steps for creating this priceless moment for me.", "author": "Donald W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "These are great steps for a full workout, but are also close to a couple of easy trails in the Presidio like Lover's Lane, so if you want a casual walk, the option is there.  The first steps are narrow and steep and the second set are more evenly spaced and at a moderate incline.  The views on top are spectacular.", "author": "Katharine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "Let the city be your work out and get some killer instagram pictures while you're at it! The steps are definitely a hard work out, like any steep hill in San Francisco you'll be huffing and puffing but at least it's outdoors and you can do it with a group of people. It may not be the cardio workout that you serious gym bunnies look for but it's a nice alternative in my opinion.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Another great spot that people love to exercise on. Anyways, such a gorgeous view, if on a clear day. The stairs are nice and even seems like they cut into people's backyard. Definitely an affluent area!", "author": "Roger A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Walked these on the way to a 5k and back- killer set of stairs with beautiful scenery!", "author": "Jess T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "Very nice and popular place to go for a workout.  There were a lot of people here when I came for exercise after work one day last week.  The steps on the block between Broadway and Vallejo are of a moderate grade with much nice landscaping.  The steps on the next block then, between Vallejo and Green, are much steeper and can be a test of knee power when going in the downhill direction.\n\nNow that I rediscovered this spot as a place for exercise, I will definitely make it a point to come more often, especially during these summer months when it doesn't get dark until later in the evening.  I like including these Lyon Street steps in a loop walk going that covers some of the nearby steep hills, and also a walk amongst the nice mansions located along Broadway between Divisadero and Lyon.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "Partial city view on top (Broadway Street). Presidio hiking trail literally next door.\n\nGood exercise, average to moderate difficulty for fit people.\n\nPark at Green Street (bottom of stairs), climb, then meander back down. Beware steep steps at Vallejo Street. Or park at Broadway Street (top) where spots are aplenty.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "Some of the best steps to run in the City, with incredible vistas and plenty of room to pass or be passed. Other top contenders for stairs to run in SF:\n- Filbert Street Steps (to Coit Tower)\n- Baker Beach Sand Stairs (aka: Sand Ladder)", "author": "J. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "This is a hidden gem of SF and a must-visit!  Basically, it's a huge staircase that is perfect for tourists and workout junkies alike.  I love to take these steps down to the water.  So gorgeous and great exercise.", "author": "Ashley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Another little special place for a good view of part of the city. I can see that it gets busy since the narrowness of the steps. There are often people running up and down to exercise.", "author": "Lianna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "great views of the bay especially at dusk. hope we had gotten there a little earlier to setup. there is a mix of exercise folks (regulars) and a bunch of visitors. there is never an issue with the regulars. folks living there i envy you and maybe someday will join the likes to live there.", "author": "Ram S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "The absolute best workout you can get for free. The stairs will kick your ass even if you do them once, but the view is so worth all the heavy breathing. Sometimes gets a little crowded but everyone is friendly and keeps out of each others way. Even if you aren't in the mood for a workout- the view and people/house watching is spectacular and shouldnt be missed!", "author": "A H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Tassels flapping in the breeze, wind on my face, map in my basket,  tires fully pumped, I took my freshly cleaned bike from the Richmond District, where I live, down California Street, turned left on Presidio and went to the top of the Lyon Street Steps. And I must say; this is not the way to do it! Even if you were an Olympic athlete, this is NOT the route to take; or at very least, take a car.  This small, affluent neighborhood, where housing prices soar into the multi-millions-(the average being 15 mill), and neighbors like Robin Williams, Danielle Steele and Dianne Feinstein walk the streets, is known as Presidio Heights.  She has well earned the Heights part of  her name as I huffed and puffed, struggling to push my bike up her several hills.\n\nOnce I arrived, I sprawled out at the top of the steps,trying to keep my heart firmly encased in my chest cavity. After those hills, the Lyon Street steps, located in the Marina/Cow Hollow District, didn't look too menacing. I was to learn (again), don't judge a book by its cover, or in this case a staircase by its steps.\n\nI began at the intersection of Lyon and Pacific Street(s), the elevation is 379 feet, with stunning views of The Palace of Fine Arts and the hills of Marin.  With less than 300 steps, the sensation directly following your awe at the spectacular scenery, is one of vertigo.  379 foot elevation, 288 steps-do the math.  (The other entry point is at Green Street, at a pleasant cul de sac under shade trees.)\n\nThe nice thing about the steps is that they are even, concrete, well maintained, and broken up into four (very steep) sections with little cul de sacs, gardens and 'rest' places.  On the other side of the coin, these steps are a prime exercise destination taken over by power walking grannies and sweating exercise fiends.  I went during the week, so the steps were pretty empty, but, I can imagine that on the weekends, they are packed.  These would be like the Santa Monica Stairs or the Thousand Steps in Laguna Beach, both awesome workout spots.\n\nApproximately halfway down (or up) the steps, there is a lovely garden and one of the many 'hearts of San Francisco'.  This is a really great program started in 2004, as a fundraiser for San Francisco General Hospital.  Each year, heart sculptures are painted and installed throughout the city, Union Square, Golden Gate Park, Moscone Center, SFO, etc...  At years end, they are auctioned off and the project begins anew.  This heart, is called the Migrant Heart, and was designed by Hung Liu in 2004.\n\nThese are great steps for sights and exercise.  Due to their steepness, I would rate them at a 7 or 8 on a scale of 10.  But then again, I don't like to sweat; I like to meander-so, it really is a matter of perspective.\n\n For photos and more information, cruise over to our site at: The Noise Beneath the Apple (dot) com.\n\nCheers!", "author": "Heather J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Not the first place in SF I'd visit, but if you've already seen all the touristy places, its a great place to checkout. Nice views of the bay", "author": "Charlie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "What an unexpected hidden gem! It a very short set of steps to lead up to an entrance to presidio. Nice peaceful view at the top of Alcatraz and the water. There wasnt a lot of ppl when i went. Mostly locals exercising and walking about.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "An amazing source of cardio for those who can't afford a gym membership. Although the obstacle may seem mediocre because \"it's only stairs\", make no mistake about this one! The incline is definitely a challenge and the steps you climb is definitely tiresome. I try to lunge my way up if I don't run/jog. The houses are so majestical as you work your way to the top. And the view at the peak is the stairs of breath taking! Couldn't of asked for a better scene. Thanks, San Francisco.", "author": "Kat Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "Beautiful views, beautiful houses and beautiful landscaping. Lyon street steps have become a weekly, if not daily, ritual. It's such a nice feeling exercising in San Francisco's \"Beverly Hills.\" I love running down Broadway, usually spotting Gordon Getty outside his home. He usually mean mugs me (assuming I'm going to rob his wallet or something)", "author": "Andrew V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-11", "description": "A grueling workout:\nTwo hundred eighty eight steps\nWith a nice top view.\n\nNo need for a gym.\nLots of masochists climbing,\nUp and down, repeat.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "Beautiful houses, many cement steps, a San Francisco heart, and a breathtaking view.  \n\nWhat a lovely way to spend a Saturday morning.  We had brunch on Chestnut and then burned off the calories here (definitely within walking distance if you want to grab a bite/get some energy before attempting the stairs).\n\nThe steps are great for a workout, a simple stroll and even a photoshoot (yep! bring your SLR out on a blue-skied San Francisco morning and you'll have a blast not only with the bay in the background, but also the flowers and magnificent homes around you). \n\nAt the top of the steps, there's a trail to the right that leads into the Presidio - if you are so inclined, you could definitely continue the workout from there.", "author": "Kimya P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-14", "description": "I am giving these steps a three.  Why?  The views?  No...the views are stunning.  The architecture?  No...it's just about perfect.  \n\nThe steps get three stars because so many people have decided that they are not meant for private contemplation and enjoyment of the vista, but rather, are, in fact, their outdoor stair master.  \n\nI dislike intensely the boot camp craze in San Francisco and cannot wait for it to pass.  Most of us exercise to stay in shape.  A very small amount of us exercise because they are soldiers and often have to fight for their lives.  If you are a  28 year old management consultant, you do not need to enter a program designed by a navy seal.  Try playing tennis on the weekends instead?\n\nTo those new to the stairs, when you visit, do not be surprised when you are jostled by some kid, dying of heat and other forms of exhaustion, as he \"sprints\" up the stairs.  Perhaps we should station an ambulance there?", "author": "Steven R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "OUCH! UGH! AWW....WHOA!\n\nWere the only words that filtered outta my mouth as I climbed those steep steps of what I thought was an easy breezy flight up. Nope. Thighs, quads, hams and the works-hurt. But it was a good hurt and most def worth it as I reached the top and was presented with a magnificent view of a chunk of the city. Breath taking, stunning and as usual, reinforces the fact of why I heart SF so much. Seriously, if you want to turn that flab into fab, then do the steps-all 240? 241? I lost count after 240.", "author": "Laurel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "Wow.  Just wow.\n\nThe Lyon Street Steps have been \"bookmarked\" forever, and finally on this beautiful January day  I finally made it out there. (I still can't believe I was out in shorts in January- I feel like I was on an episode of Beverly Hills 90210...the old one).  Parking was also plentiful here, but that could have been because it was a weekday.\n\nI think of myself somewhat of a steps connoisseur (actually I think I'm a connoisseur of a lot of things), but as working my booty is a priority of mine and steps are the best way to do that, I've tried a bunch.  These are great because the incline and space between the steps changes.  You want less of a grade?  You do the upper steps.  You want to do what basically amounts to a sprint up the steps?  You do the lower steps.  You want to work yourself so hard that you almost vomit, but because the view and surrounding houses take away your breath in such a way that you can't think about hurling?  You do the whole thing.  More than once.\n\nAs I am still recovering from the broken foot, I didn't do as many rounds as I would have liked, but got a decent post-lifting workout anyway.\n\nJust a note:\n\nFor how tall I am (relatively so), I'm glad I have little feet.  Those steps on the really steep part are tiny, and as I managed to fall just in my driveway and break my foot, I now have a little PTSD when it comes to falling in general.  Just be careful on those things.\n\nAlso: Thanks to the woman who told those jerks who were SMOKING CIGARETTES  on the bench off.  Who does that where you clearly see people working out?  Why don't you just trip us, too?  Much quicker death if we land properly.  Sheesh.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "San Francisco is a great city for people who want to work out but don't want to join a gym. Not only is the city full of hills to work your buns but has over 300 stairways to get a maximum workout in minimal time. My six favorite workouts are free and have fabulous views to keep you entertained. \n\n1. Lyon Street Steps- Start at the corner of Lyon and Green Street and walk or better run up these popular steps all the way to Broadway and back. Great workout. Popular but there's no finger pointing or mocking when you need a break and grasp the handrail gasping for air. \n\n2. Presidio's Immigrant Point/Coastal Connector better known as the \"1000 Steps\"- It's actually only 808 steps but its sure to make you feel the burn. The trail starts at Overlook Point and takes you all the way to Baker Beach. Beautiful views and a shady canopy make this a great weekend walk or run. \n\n3. Coit Tower- The Telegraph Hill walk up to Coit Tower is the most scenic city hike on a clear day. I've had the pleasure of running up to Coit Tower (unintentionally) on the main street and it's a great workout sans steps. You will 100% feel the burn. You can also take the Filbert Street Steps of the Greenwich Street Steps for a more scenic and classic trip up to Coit Tower. Anyway you do it, you'll be sure to appreciate the sweeping views and benches to rest on at the top of the tower. \n\n4. Crissy Field- For those who desire no incline try walking or running Chrissy Field. This dead flat trail takes you from the Marina/ Fort Point to the foot of the Golden Gate Bridge. A good resting point is the Sports Basement for a drink or restroom break. \n\n5. Golden Gate Bridge- I attempted to give my mother a heart attack a few years ago when I came up with the fantastic idea to bike across the Golden Gate Bridge. This is a strenuous bike ride which should not be taken lightly. If you aren't into biking the bridge, an easier (and more enjoyable) trip is to walk the bridge or run. The views can't be beat and since you are walking the bridge you get twice the work out as you have to walk back across to the city. \n\nThe City has so many wonderful exercise possibilities. Take advantage of the city's natural topography and get a workout while exploring the city by the bay!", "author": "Alice S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "The Lyon St. Stairs are a gray place to get a workout. Another great thing for the parents is that while you are working out, you children can shout hoops.", "author": "C B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-12", "description": "Close by the Presidio. Pretty easy flight of stairs actually. I need a BIGGER challenge! Hehehehe :)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Steps are great. Beautiful view, houses are lovely. Middle garden is very picturesque... For tourists the best view is half way down both the upper steps - allows you to see around the house - and lower steps - for the same reason. \n\nAs a rule of etiquette, please don't bring your dog on a lease for the 80% of the people that use the stairs as a workout there's nothing more frustrating than having to watch out for a chihuahua leash at your feet. Additionally, please understand that it's not nice for either party to have to pass someone on the lower portion of the stairs so timing your start is important if someone is running the stairs slower or more quickly than you are. Enjoy!", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-18", "description": "When we rolled up, I saw some guy puking in a trash can.  (Don't worry, it was the compost bin.)  That really should have been a clue as to how painful these steps can be.\n\nBut you know what they say - the best things require work.  And it's especially true in this case.  The view from the top will make the burning sensation in your lungs and quads worth it.\n\nThis is definitely somewhere that everyone should check out, especially if you are looking for a spot to get a workout.\n\nJust remember - aim for the compost bin.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "Super great steps, nice views and steep. Not much new to add here that others haven't already said.\n\nAlthough, some of the Marina workouters are either very rude or just completely oblivious (which honestly, is another form of rude). They walk/pretend to jog slowly with their earphones in and take up the whole width of the stairs (or worse are going the wrong direction). People should be more aware of their surroundings when working out, especially in a public location.\n\nWatch out for tourists on nice afternoons in the summer, they ruin everything if you actually want a decent workout.", "author": "Ninja R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-26", "description": "Finally finally made it to this beautiful place.  I always thought I had to drive over here, but I can see I can leave the car behind and access it through the Presidio Avenue in through the Presidio gate.  There are plenty of others heaving and puffing, but they definitely have been going up and down more than once.  I loved the Heart with the crane sculpture in the middle with the well groomed garden.  How appropriate.  It's like your own backyard and stair climber, but you are actually outdoors breathing in the fresh air.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "Absolute love.\nThe first time I made it out to the Steps I got the butt-kicking of my life - this is despite my 4+ years of competitive cross country running.\n\nNow, it's a wonderful way to start a day (or to fit in a quick workout any time of the day).", "author": "Jessie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Beautiful! A place to chill and enjoy the sights and views of the bay. It's also a place where you can exercise by doing the stairs. Just an all around gem in SF.", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "You and I have become like hidden lovers.  You're not exactly close but, actually out of my way when I'm not in the city, yet I have such affinity for you that I will travel your way for a quickie (workout)\n\nI love your view, it reminds me of how amazing SF is.  Stopping randomly for some pilates moves and/or masochistic push-ups also is my definition of fun.\n\nOh ya, beloved Lyon Street Steps, we will rendezvous again soon.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "One of my favorite places in the city to get a workout in.  Lots of steps and an amazing view.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-16", "description": "I run these steps all the time.  It's great to go up and down a few times, run to the hands at the Golden Gate Bridge and back.  Stop off for some push ups and sit ups at the top of the steps.  \nGreat place to work out, run, and be in your own zone.  The view is amazing.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "looking down is already good cardio, it'll get your heart racing.", "author": "Margarita T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-27", "description": "The Lyon street steps are hidden but after you climb over 200 steps, you finally reach the main stairs which are surrounded by gardens and beautiful flowers. You can see amazing views of the SF bay and Palace of Fine Arts from this location. Parking was easy along the residential areas and the neighbors are really friendly here. Some even came up to us to chit chat. However, my calves and ankles were hurting for days after we had gone all the way to the top and back down. Definitely stretch if you are going to tackle the Lyon. Funny enough, we had already tackled the Green street steps earlier in the day and my friend and I were already aching. Beautiful flowers align the steps and a beautifully painted heart highlights the garden.", "author": "Danster L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-31", "description": "The Lyon Street Steps wins for fancy-panciest steps in San Francisco. Park at the top on Broadway in Pacific Heights and work your way down brick steps next to mini Versailles Gardens. Ooh la la! No overgrown bushes and homeless encampments here.\n\nI saw people doing workouts here running and up and down the steps. Oh how I wish I lived in San Francisco so I could do the same.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "A great workout of course, but the best part is that you have the option of continuing your run through the Presidio or Pacific Heights.   Less tourists than the stairs up to Coit Tower and a little safer than the run up Buena Vista Park.  I'm also hoping that by osmosis I can absorb some mojo from the mansions I'm running next to.  \n\nAdded bonus is that Liverpool Lil's is just down the block for post run beers.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "One of the best workouts in San Francisco - I believe there are ~250 steps in total, I usually do 4 rounds and then that's enough to completely wipe me out!  There's an incredible view to enjoy while you recover up the top, and as an added bonus there's a San Francisco heart there!", "author": "Lorna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-30", "description": "These stairs are located near some of the loveliest homes in SF (my favorite is a grey one on Green St.) and right next to the Presidio.  As you descend, be sure to take a moment to enjoy the view of the Palace of Fine Arts and the Marina district and the flowers along the way.  The stairs and the surrounding landscaped areas are well maintained - a very pretty spot!\n\nTry to come early (if you want to workout) to avoid tourists who want to take pictures on the steps.  While it can get crowded even in the AM (boot camps meet here), at least the early crowd isn't stopping to take pictures.  \n\nIf it gets too crowded, there are plenty of steep hills around (such as the one on Baker St.) or run through the Presidio (try Lover's Lane).  \n\nIt's surprisingly easy to find free parking (I guess since it's in a residential neighborhood).", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-12", "description": "Exactly how do drunk people get around that city with so many steps in the way? \n\nI'd like to thank those stairs for this booty. Thanks.", "author": "Sahar R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-23", "description": "I got engaged here, and she said, \"Yes!\"  If that doesn't earn 5 stars, I don't know what will!", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "This place inspires me... to work out more.  I'm thoroughly impressed by the  reviewers that had the wherewithal to count the total number of steps.  I would've lost count at 32 as I focused on not keeling over while others (in obviously much better shape) easily darted past.  You'll reach the first flight, only to see that you're only half-way there.  But at the top of the stairs is a reward - beautiful views of the city and easy access to a small part of the Presidio with old trees and lush knolls.  Plus the satisfaction of having a that-much-better physique.", "author": "Tara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-24", "description": "Took our two year old with us. He finished 1/3 of the stairs and daddy carried him up the hill. We loved it!! The neighborhood is very very nice too. We went back down to the green street from another street that is parallel to the stairs, fun too. It is a great stop on a sunny day. totally worth it.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-21", "description": "Second only to running in the eucalyptus grove in the Persidio, I love the lyon street steps. Every time I finish them I feel like I've cheated death and/or am superhuman.  You see, as I approach the top, I'm too afraid I'll trip so I refrain from looking up to see how many steps remain. I keep my head down and keep truckin' hoping the end will suddenly appear. I prefer the second set with the wide/deep stairs that I take two-by-two. \n\nEveryone doing the stairs is courteous and I never feel like I'm going to get run over on the steps although it can get crowded around 5pm. Gorgeous views of the bay, Pac heights and the Palace of Fine Arts. \n\nPS Please don't talk on your cell phone and hog the entire staircase--weaving from left to right. It's really hard to get your attention so that I can go around you. k, thanks.", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-28", "description": "I always figured being in San Francisco, I would just take advantage of public transportation and walk everywhere -- which would amount to my work out. I haven't felt guilty in a long time, however, my appetite finally caught up with my conscience and I decided to go back to the Lyon street steps. I've only been here one other time, but it tore me up HARD CORE. Since then, I haven't been back.... til today. \n\nLovely views, and work out enthusiasts you will find here. As I was slowly ascending up Lyon street to get to the steps, I see Hard core man (HCM). He was descending Lyon street FAST. and backwards may I add... Ok, i'm not intimidated by his intensity. I trudge on. \n\nThere were several people getting a work out in so I decide to join. First set of steps -- not bad. the second set started to worry me. More narrow and steep, I slowly descend... Finally at the bottom. I look up and decide not to look up; just focus on the steps. So I climb up the first set (at the speed of probably 10 on the stair master). I wheezed myself to the top and realize I ascended too fast and my heart feels like its beating out of my chest. I descend again for round 2 anyway.\n\nMy second round felt like regret. Nothing but pure regret. I was hurting so bad. HCM whizzes past me at probably the car speed of 7 mph. Ascending the stairs mind you.  \n\nAs I catch my breath halfway up again, I look up and see Hard core woman (HCW) descending the stairs -- with baby in hand! Strapped on like a 10 lb weight, both baby and HCW start to ascend up the stairs... pass me up and look at me with pity as she continues onward with ease. I get it, I fail. \n\nI slowly descend to the bottom and decide after 2 painful rounds for a noob, I feel pretty accomplished. I wait to take the 45 on Lyon and Union and see HCM pass me by running to no end down Lyon. What are you ON, man?", "author": "Maureen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "I got there early morning on Labor Day-unfortunately the views were not very good as the fog was still burning off. There were about 15 people total in the area but the stairs are long enough for people to pass if necessary.  As others have mentioned the lower steps are rather treacherous.  There was morning dew and I could envision myself taking a header on the way down.  Thankfully not, however!  I agree that they are much steeper and narrower than the top sections.  I was actually getting a bit dizzy trying to make sure I hit each one.  Great workout, I only got 3 sets done and my calves are feeling it today.  Going back again.", "author": "Teri X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "Whether you are walking this or running this, you have the heart of a champion. The incline on these steps as well as the hills in the surrounding neighborhood is what I love. Your thighs and tones buttocks will hate you afterwards but after the pain is gone you'll feel fabulous! I always come here to clear my mind or train for an upcoming race.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "Totally worth it.  Was a bit scared by the reviews, but still decided to go and check it out.  The stairs were not too bad, and the best part is there's a side entrance to the Presidio at the top of the steps!!!  Such a nice neighborhood to walk around!!!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "Beautiful spot to add a little spice to your run.  Really cool view at the top.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-08", "description": "I know the cure for a bunch of crullers from All Star - and that is the Lyon (I Am The Pleasure and I Am The Pain) Street Steps.  1200 steps later and I feel, well...terrible, but in a good way. \n\nThis is a very special place in SF. Karma need a little nudge? Come here. Beautiful scenery, incredible landscaping, happy people and a great work out. Or, don't work out and just hang out at the top or in the middle.\n\nThis is a total 5 star place. \n\nI know I rate a lot of 5s - I don't like to go to places that suck.", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "Love these steps!\n\nI have a very much love-hate relationship with them, but in the end, I really love them.\n\nStart off with a warm up going up Lyon street from Lombard, then it's up these gorgeous steps, pausing to do 10 push-ups at every block.  Repeat on way down.  3 sets of stairs and about 30 minutes later, you've done 120 push-ups and went up and back down 864 steps (288 stairs, each direction).\n\nGreat workout that I recommend to everybody.  I'm going again tomorrow!\n\nOh yeah, this also just happens to be the absolute best butt workout in the city so you know they will be lots of cuties running here. :)", "author": "Pavel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-16", "description": "Workout boredom making you want to throw in the towel?\n\nStop counting minutes and start counting stairs !!\n\nStair running is an intense, high impact cardiovascular workout guaranteed to work you into shape. Just 30 minutes on the stairs should be plenty to get you sweating. And in San Francisco you have the opportunity to stair climb through the best possible scenery, allowing for an amazing mental and physical workout. The Lyon Street Steps are the perfect place to start  - the unintimidating stair series will help you become a serious stepper in no time! Here's to getting your rear into gear!\n\nA few things to keep in mind before you start sweating......\n\n**Make sure to WARM UP with some light jogging, quadricep/calf stretches, and a few flights of stairs at an easy pace.  \n\n**Bring water - stay hydrated before, during, and after your workout.\n\n**Always wear good running shoes - stair running can be really hard on your joints and you'll want to keep your knees/ankles/hips happy.\n\n**Make sure to watch your foot/knee alignment as you step, placing the full foot on the step and keeping the knees behind toes. \n\n**End your workout with a solid cooldown that includes walking, hamstring, quadriceps, and calf stretches. \n\nTake a step in a new direction and rediscover the fun in fitness with some scenic San Francisco stair workouts! Enjoy!", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "If anything is going to get me through the end of a 4.5 year relationship, it's these stairs. Seriously, nothing clears my mind like listening to a little Black Eyed Peas or Ratatat and charging up these babies with my fellow sado masochists. \n\nIf anything is going to make me projectile vomit at the top of the 15th flight of stairs, it's going to be that couple swapping spit like it's the 8th grade winter formal. Seriously, take it somewhere else, can't you see I am trying to mend my broken heart by beating my ass, thighs, and calves into submission? I'd rather not be forced to watch you playing tonsil hockey at the end of each set. \n\nNew rule: gorgeous view reserved for those here to exercise only. And no, your tongue doesn't count.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "When you are in the mood for a butt burning, vertigo inducing workout, the Lyon St. Steps are where you need to head! I try to incorporate the steps into a workout at least twice a week. A few laps up and down the section just South of Vallejo will make even the fittest people break a good sweat. When you need a breather, the view of the Bay from the top of the steps on Broadway is spectacular.\nI also think that the steps are the easiest walking route to/from the Marina if you live in Pac. Hts./Laurel Hts. It is much easier to walk the stairs than steep sidewalks!", "author": "Bobby J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "Does it get any better than the huff/puff from Marina green all the way up to Green St., that slight incline never subsides and you feel yourself deflate at the site of the \"Lyon St. stairs\"....\nI had no idea these even existed, I was in so much awe over the beautiful homes I was running passed on Green and Broadway that I almost missed the stairs completely. \nI ran, well almost ran, up them once and felt like my legs were going to fall off. There are four sections so when you complete each one you have to coax yourself to finish the next. \nI will be back to those stairs soon and my new goal will be to make it to the top without a walk break!\nOh, and might I add that once you finish each section  you can see different sections of the Bay, and at the top- well, I'll let you decide what kind of view that is... :)", "author": "Janell D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-07", "description": "While training for a marathon, you are often told you have to \"earn it.\" The same goes for the Lyon Street Steps.\n\nEven if you rock the eliptical, dominate the treadmill, or kill it in spin class.... Lyon Street Steps WILL own you.Moving your own body weight without assistance up these steep steps will make you regret every cocktail you had over the weekend and vow to give up baked goods.  You will wonder to yourself why nobody else is panting as hard as you and wonder if it's healthy for your heart to beat that fast. Luckily, in just a few visits your cardiovascular capacity, and tush, will undergo a major transformation.", "author": "Rachael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Great view and a ton of steps--great for a grusome workout!  It was a pretty cold day today but the work-out will make you sweat.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "292 of the best damn breakup-therapy steps ever. Period.\n\nOK. I originally wrote that a long time ago. And it's still true. They work. But these stairs continue to deliver long after your heart has mended. Don't let your ex own these steps! Reclaim them for yourself get your booty climbing. And descending. Repeat...", "author": "kai k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "We took the day off. It was my birthday after all. What better way to spend it than running around the city like tourists, but only picking out the really cool spots to visit. The sun was out, and the sky was a beautiful blue. And for the first time in the lifetime that I've lived in San Francisco, I scaled the Lyon Street Steps. First, down. Then, up. What spectacular views, leaving me breathless. \n\nOh wait, no. \n\nThat would be me climbing up all these stairs. Correction: Huffing and puffing up all these stairs. It's no wonder that so many include the Lyon Street Steps as part of their workout routine.\n\nYour muscles ache. Your breath is drawn. You appreciate this city, this life, and this staircase that they thankfully built handrails for.", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "The Lyon steps are a awesome workout!!!\nCan't beat the view, the beautiful homes, the well manicured gardens and the the sweat!!!\nmake sure you take a bottle of water. have a sip or two and just keep on going!!!", "author": "karla m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "I used to walk these stairs on the regular.  i was skinnier then.  that was cool.  the only way to get my less fat ass up and down these stairs is by listening to hard core rap music because not only do i really, really want to be black but also, lil' kim makes me seriously want to MURDER these stairs.  i'd have my ipod on, huffing and puffing my way up the STAIRS OF DEATH, listening to lil' kim yell at big poppa about him still being married when she's all fucking him and she'll always love him and shit.  LOVE IT.  i hope to one day be in such a violent yet truly caring relationship of insanity...i might be in one right now with my mom but i think that's a little different.  \n\nwhen i felt especially sassy, i would sing along to my hard core rap music much to the chagrin of the chicks from the marina who were listening to matchbox 50 and bouncing quarters off of their lulu lemon asses.  I would barely be able to breathe, grandmas in wheelchairs passing me, head down, concentrating on just getting up the next step, singing out:\n\nAll I wanna do is get my pussy sucked \nCount a million bucks in the back of an armor truck\nWhile I get you fucked up off the T.O.N.Y.\nThe BX, the chron-chron\nAnd the list goes on and on\n\nI seriously fucking love lil' kim because NOBODY does hyper sexual scorned woman like that bitch...she should do an album with Loretta Lynn, those bitches could commiserate and be all super dirty sexy together and it would RULE.\n\nFinally, bring tourists here for the amazing view.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-24", "description": "There are so many paths in life, it's sometimes difficult finding the proper one.\n\nSome paths are easier than others, meandering on slight inclines that comfortably rest at happy elevations. Life is gentle and quiet, and you're left relatively undisturbed in the mix. But then there are those much steeper, hidden roads requiring inspiration or guidance from a muse, where hard work and perseverance ultimately rewards itself through glorious views. And eventually you reach that point in your life when you finally feel in control, standing at the top with an absence of fear, where strange surprises only add spice to the already well-paved path... where the sun shines brighter and colors pop and the horizon is beautiful...\n\nNo one's going to take me alive.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-09", "description": "Really love these stairs! You get a great view of the city and a killer workout!\n\nIf you're like me and people are blowing by you-- don't be discouraged, go at your own pace. Start at the very bottom... the stairs are a little more steep and work your way up to the top. When you get there you'll get a view of the Bay as you catch your breath. Then, go down and do it all over again. What's better than an awesome view while working out? \n\nForget about paying for your gym membership... this is the best part about it, it's free! :)", "author": "Kimberly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-02", "description": "Great place to chow down on a jumbo bacon, egg, and cheese breakfast burrito in a hungover stupor while watching blond-highlighted, iPod armband-wearing Marinaites bound up the 288 concrete stairs in their tightass yoga pants and drool over the greasy contents of your tinfoil wrap each of the eight times they run by.\n\nIf you do manage to make it to Broadway, be sure to check out the 12-foot anatomically disproportionate robot sculpture stationed outside one of the mansions east of The Steps.  Gotta love 90's art!", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "Look at all my 5 star fellows... It is the endorphins, I tell ya!\n\nI think about quitting my gym membership because of these stairs! It is one of my favorite SF discoveries. When I make it to the top for my 5th set. I look out across the bay and think how lucky I am before I DIE from exhaustion.\n\nCome here if you want a solid work out. Great for cardio and strengthening the gluts. While running the stairs, make sure you pick up the rear, for your ass will be the focal point of your followers. Although it does get your butt up to the top quicker when you feel the eyes piercing your buttocks.\n\nIt's a great experience. I will continue to run here till I have no legs.", "author": "Dee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "The trick to doing these stairs as a workout is to slide down on the railings on the top half on the way down (it's too steep on the bottom half). I mean, if you're not having fun, what's the point? Plus, it shocks and surprises the pac-heights / marina stepford wives / wives-to-be, the dogs get all excited, and the tourists' kids start to pull away from the their parents to try it themselves.\nAlthough I'm sure I have a blackish stripe going diagonally across the ass of my pants.\n\nFive to ten roundtrips is an acceptable aerobic workout for the day. Anything less and you're a candy ass.\nCurbside, liverpool lils, and pres a vi are waiting a short distance from the bottom for your post-workout patronage. (presidio social club as well on Saturdays)", "author": "Bob R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-17", "description": "My story of \"The Steps\" . . . .\nA few years back I officiated a wedding right on the steps  - Yes, Presbyterian pastors can be Yelpers too! ;-)  You can't really get a permit to do such things so we all just invaded the steps around the flowers and had the wedding.  Limo pulls up, the wedding party in full dress bounds out, the guests had already arrived and a find young minister in a very sheik black robe conducted the ceremony complete with gawking joggers.   What were the cops going to do?  There were about 30 of us, clearly a classy dressed up wedding party and, come on, it was a wedding. \nQuite the site and quite the memory!", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-12", "description": "Soo....people run up these stairs? Too MANY stairs, people. I don't even like walking up the two flights of stairs to my flat. And you get some sort of joy by the calf muscle burnage? I will stick to cycling for that.\n\nSuit yourselves, though.\n\nMaybe throw the Rocky theme song on the iPod and be like Rosie F?  When you get to the top in your gray jumpsuit, you can pump your fists at the sky and pretend like you're king/queen of the world...\n\nMy general dislike of running aside, this is an amazing spot to visit.\n\nI imagine that I could sit on the steps and soul search here, maybe write in the journal for awhile. Or I could be taken here by a lovely woman...we could stare off towards the Palace of Fine Arts & the San Francisco bay, lights flickering  & the sound of the foghorn blowing in the distance. \n\n(i only dislike running because my ankles are so jacked from skateboarding when i was younger)", "author": "matt m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-30", "description": "Foggy-headed and more than a little confused when the phone rang, I barely had enough time to check the time before answering her call.  9:45am.  With a slight sense of alarm I forced a cheery, sleep-heavy \"Hello!\".  She apologized for being late and that they'd be there as soon as possible.  Where was I, she asked?  Mortified, I told her I didn't think we were still on for our Lyon Street Steps run because of the email confusion.  It was still on, she confirmed cheerily!  After hanging up I jumped out of bed, pulled on some athletic gear and was searching for a clean pair of socks when I got her second call; They were downstairs, should they park and come up or wait for me?  30 seconds and I'd be down, I told her.\n\nIt was brrrrr-worthy outside, a chilling breeze sweeping over Nob Hill, with a few Lycra-clad cardio champs braving the endless flights of steps.  Going down the steps was easy.  Climbing back up was another story.  Halfway up the fourth flight of stairs I was winded!  We ran it three times before our other friend cheerily ran us through a couple more drills.  At the top of the steps we took in the beautiful view of the Palace of Fine Arts.\n\nA great way to start off the morning, and a superb butt-shaping workout for sure!", "author": "Janet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "I love running the Lyon Street Steps! They are always a challenge, no matter how fit you are. Extra props for those who do the bottom half - it is much harder.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "all the workout stuff aside...\n\none can walk through here feeling as though you're on the property of some of san franciscos most pricey estates. you can expect (as im sure you can imagine from reading the other reviews) a ton of joggers/step climbers during the day and even a few at night and then the high-school kids on weekend/friday nights hanging out drinking and smoking pot. some adults even.\n\nbut what we all mostly come here for is the views. a stunning look at everything from the lush presidio to the golden gate bridge to alcatraz. its all there. now to be honest if you're just a tourist visiting the city i wouldn't go out of my way to go check this place out. There's too many other better things to see if you're just in town for a short stay. but if you have a plethora of spare time this is a great spot to check out.\n\nand runners/step climbers... believe me. this place WILL kick your ass.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "The scene: Friday night, October 28, 1999. \n\nThe characters: Uni High Preps, Urban Art Fucks, Branson Jocks, and the occasional SDI.\n\nThe plot: Fourties in hand, braving the cold, wanting to be 21. Taking the last drag of a cigarette. Running from HMI.\n\nThe outcome: Still love Mickeys.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "This is the best outdoor workout in the city.  If you have 30 minutes, you will get a great cardio workout and be inspired by the views.\n\nThis is actually two sets of stairs.  The bottom set (starts at Green St) is far steeper with only one landing break.  There are 124 steps (62 in each section) on the bottom set (give or take a few - hard to keep track when my heart is racing).\n\nThe second set goes up to Billionaire Row (I believe the top is Broadway).  The second set is not nearly as steep and has landings every 20 or so steps.  \n\nDescending the top set is a piece of cake - really really fast with great views.  Now the lower set is a different story.  The first descent is easy, but after a few trips, the legs are a bit wobbly and shakey. The lower set is both steeper and the steps are narrower.\n\nI can usually do 5 full round-trips in about 25 minutes which is about all I can muster.", "author": "Madison W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-09", "description": "I do not need a personal trainer - I just need a commute that includes the Lyon Street stairs...2 or 3 times a day.\n\nThese lovely and grueling steps were the second stop on my evil training plan when I was training myself and several poor souls for the Avon Walk.  After walking my little ducklings through Fort Mason and the Marina, I turned to these stairs as a way to build stamina for the 39 mile/2 day walk.  Huffing, puffing, and hating my guts (even I hated my guts), we pulled up to the top of the grand staircase before heading, mercifully, back downhill on Broadway.\n\nFunny thing - I never noticed the beauty or really even the view until long after those crazy training days.  The steps, built in 1916, were placed because the grade was too steep for a road.  From the bottom, hidden in a cul-de-sac next to a deeply forested section of the Presidio, to the top with it's peerless views of the bay and the Marina, these stairs should be known as much for their landscaped beauty (who is the gardener?!?) as for their ability to give us Beyonce's booty.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "Almost 300 steps, surrounded by spectacular homes and the lush green of the Presidio. My #1 spot to sweat when I'm in the city!", "author": "Trip C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-18", "description": "I was proudly telling my friends and colleagues that I began 2007 here at the bottom of Lyon Street steps.  Then just now it hit me that I didn't have to limit my reach and could brag to a much wider audience if I yelped about it.   So....  yep...that's right.... I included Lyon Street steps on my New Year's day run! \n\nI do not usually run these steps as Coit/Filbert Street steps are included in my weekly Wednesday am run.. but have to say that Lyon street stairs definitely can hold a match.  \n\nIn comparing the two I would say that the beautiful views at top are equivalent although the Coit tower view is more panoramic.  Coit steps are not as steep so you glutes don't get ass much of a work-out (yes that corny pun was totally intentional).", "author": "Kerrie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-20", "description": "A free outdoor StairMaster with a beautiful view - brilliant\r\n\r\nThough be careful on the lower flight of the stairs, they are much more shallow then the upper level and as your calves and quads start to scream at you, a mis-step may cause one to tumble, thankfully there is a handrail.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "Gorgeous view. I always forget how awesome the marina is in terms of the view from the hill. Normally I just think bleach blondes and stripped shirts.\n\nI think I am going to have to start running these steps. Part of the \"get fit or dry trying in 2009\" plan, similar to the foiled plans of 2008. But I didn't know about these stairs then. That will be my excuse. That and I spent my time getting laid by someone who doesn't want to date me this year.\n\nChange in 09!", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-13", "description": "For the quintessential Pacific Heights experience, and one of the best photo ops in the city, situate yourself at the top of these steps located between the Presidio and some magnificent mansions for a panoramic view of the Bay, the Marina, and the Palace of Fine Arts. Then descend them to marvel at the homes and the impeccably manicured gardens that border them. Just remember it's a long, steep climb back to the car you left parked at the top.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-29", "description": "A must stop bi-weekly circuit for everyone to enjoy and the exact reason why I never-ever go to the gym.  \r\n\r\nWith these views and those endorphin's, you won't feel the bitter-sweet sting of the jog for the whole way home.", "author": "Yelper A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-19", "description": "Ok, did you say a BUTT workout??? If that's what you;re looking for, DO IT!! \n\nWhen you reached the TOP, that's your prize! I beautiful view!!", "author": "Judi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "I wanted to puke, my head was spinning, and I swear they almost killed me.  Can't wait to run them again.", "author": "Amie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "Sunday mornings this is where you will find me workin off all that fun I had over the weekend. Running steps is the best because you can't stop halfway, you gotta get up or down...ie: too bad lazy ass. The Lyon steps border between being a semi-social place to check out fit young-ish people and an insane workout that will get you sweating hard.\n\nIpod necessary.\n\nOnly problem is they can sometimes get crowded (especially when people bring dogs).\n\nScenic. Tough. Satisfying. Booyakasha!", "author": "Alison D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-19", "description": "StairMasters are for wimps...the real thing is so much better!  This is one of my favorite places to work out.  The pretty views distract from the pain!  If you're here in the wee hours of the morning like I am, wear bug spray.  The mosquitos are vicious and will bite right through your clothes.\n\n9/07 update: I've noticed that there's usually a security guard here in the evenings, patrolling in front of what I think is Di Fi's house.  Works for me -- this must be one of the safest places to work out outside in the evenings, especially now that the days are getting shorter!", "author": "DD B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "A gem in SF - a hidden place to take visitors when you have done enough trips to Crooked Street.  Weekend workout groups tend to clog the top of the stairs but oh well - it adds to the atmosphere...", "author": "Ash A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "An absolutely stunning San Francisco landmark, yet like so many of our stairways, totally ignored by the tourists.  I guess if you can't drive on it, it's not interesting.  Last time I was here a car full of people pulled up right at the top of the steps and asked me how to get to Lombard St (\"you know, the curvy part\"), totally oblivious of the even better attraction right below them.  Impressed by my knowledge of local geography, they then wanted to know where The Sweetest Thing was filmed.  Sorry folks, I deleted that movie from my memory.  Don't you want to know where Jimmy Stewart and Kim Novak went?\n\nAnyhoo, the steps have it all: views of the bay, the Palace of Fine Arts, lavish Pacific Heights mansions (including Dianne Feinstein's house), beautifully sculpted gardens, a somewhat under-utilized adjacency to the Presidio, and of course 50 copies of the same 27-year-old woman in extremely fashionable (and tight) sports outfits running up and down while listening to God knows what on their ipods.  \n\nIt's also the perfect spot for a Saturday afternoon prelude-to-a-night-out rendezvous with your friends--one of those SF places where the infinite possibilities of a weekend in the city really become palpable, and you feel ready to go anywhere and do anything.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-03", "description": "Jane Fonda would love it here!! \r\nIt's the best staircase in the city, no doubt. \r\nI only wish there was better lighting at night (especially during winter) F'ing daylight savings.\r\n\r\nSometimes there's lines of people running up & down the Lyon St stairs with a timer at the top. very serious! it's the place to go for a focused quad/calf workout!...And if you wear a neon sweat-band and spandex, you'll burn more calories!!! \r\n'Get-In-Shape Girl!'", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-21", "description": "huff, huff.. I can't breathe! \nCome on ..you're doing a good job.. \n\nThat was my conversation this morning while I ran up the stairs with Bay Area Boot camp.\n\nI'm a San Francisco native and I don't recall ever visiting this area. I'm glad I finally did! I can't comment on the view too much because it was still dark out - 6am class. but I can definitely recommend this place if you're looking for a killer work out. \n\nUnfortunately we only visit this location once with my 4-week class but I promise to rotate this into my workout from now on. The stairs nearly killed me but when it was all over it truly was worth it.  \n\nBuns of steel!!", "author": "Monica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-12", "description": "I climbed the Lyon St steps after reading some of your reviews here. I moved to SF about a month ago, and I am having a great time exploring the city on weekends. I live in Sunset, so I am always venturing out in search of the sunshine, and I found this area to be bright and lovely. The gorgeous homes with their beautiful flowers surrounding the entries and colorful gardens made this outing worth it for me, even before I climbed the steps and the vista unfolded before me. \n\nI will definitely be going back to Lyon St for the climb and the view. Both were awesome.\n\nFilbert St steps are also great fun. Maybe there is a posting about them on here somewhere--I am also new to Yelp, so I'm still finding my way around. The steps at Filbert st are not the wide, concrete type of steps like Lyon St has, they are narrow, winding, and crazy. I have done them twice, both times on vacations--the first year, I started at the bottom and did the big climb, the second encounter I took the bus to the top and walked down. :)  One of these times, someone was trying to move out of their apt carrying a big mattress down all those (single file) steps. Here there are also many flowers and nice homes. It's a very different experience than Lyon st.", "author": "Java G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-02", "description": "If you're feeling especially ambitious/psychotic, as a few guys and gals I knew were this morning, you could engage in The Physical Challenge.\n\nWhat? 10am, Sunday. Chug 1 beer, run up the steps. Repeat 4-5 times. Any throwing up=1 more round of steps. \n\nNot enough for you? Try The Ultimate Physical Challenge. Start off in Aquatic Park, no wetsuits allowed. Chug a beer, jump in, do a lap to the buoy. Chug a beer. Run along the Marina Green to Safeway. Chug a beer. Run to the Palace of Fine Arts (beer), run to Lyon Steps and do intervals of beer and steps.\n\nThough I was a referee, and not a participant, I found this challenge difficult to watch but very memorable to say the least. \n\nOnly in San Francisco.\n\nBring a positive attitude.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-28", "description": "In lyon street area, steps run you!\n\n...or at least it seems that way. What better way to work up a sweat on a grueling climb than exquisitely manicured gardens.\n\nJust watch out for those wedding picture parties. Kevin and Stacy- my appologies for the hairy shirtless running guy in the background of that last pic on that very special day in June- you know the one with angel island in it? I'll photoshop it for free, promise!", "author": "Tim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-10", "description": "Urban Running at its Best!! This is my new favorite spot to run to. Run up/down the steps, past the palace of fine arts and to Chrissy Field then to the the bridge -- on a clear day there is not a better urban run than this.\n\nLast time I ran here there was a protest going on.  cool!!", "author": "Megan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "A breath-taking view of the bay on a beautiful day!!!\n\n=)", "author": "DAVID N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-13", "description": "I've been here only once in the daytime, but wow I was impressed. The view is amazing, the houses all over this neighborhood are stunning, and the flowers surrounding the steps are beautiful. \n\nThese steps would be a lovely date spot!! I definitely want my future man to take me here. Yum!", "author": "Bets Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "Stick a fork in my I'm done....These stairs kicked my butt. Usually I'm just staring down the steps laughing at all the people huffing and puffing as they are coming up. So when my friend asked me if I wanted to run up the stairs instead of going to the gym I thought suuuurrreee, why not? Half way up when I was holding back the reflex to vomit I realized that maybe these stair were a little harder then I had imagined. Needless to say, it was a great workout and the next day I cried every time I had to get out of bed for a drink of water.", "author": "Michele H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "There's nothing better than ripping my calves and quads with all those killer views..who needs an iPod when you get the views..An avid rower who's wicked rowing coaches makes us do those stairs on Saturdays...I guess i'll be ready to go Brazilian pretty soon", "author": "Victoria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-27", "description": "I used to take first dates here before the evening starts. It's a pre qualifier, if you will. The catch is they have execute this run up these stairs in their same little black skirt and heals they showed up in at my door. If the time allotted for the two iterations is met, she is good to go. Second test: No more than 30 minutes get showered, \"vixened\" up, out the door, and then off to dinner we go. I know it is San Francisco, but doors to be opened by the man...no exceptions. Chivalry is not dead, nor cheesy on my watch, little lady.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-01", "description": "I want to climb them more often!  ..not many steps people will say that about! Could someone be nice enough to give me one of the $10M homes near here? please ;)", "author": "P H I L H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "This can be a great warm up, final push and/or complete work out!\nDont cheat go ALL the way down (even the steep part) and then all the way back up..dont even stop for the spectacular view half way up..unless you need to catch your breath..\nAnyway-I come here to work out (when im sick of the gym) and sometimes bring my dogs to the top just to sit and take it all in..makes me proud to call san francisco home", "author": "CadoBaby P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "San Francisco's version of the Santa Monica stairs.  Great workout and amazing views (if you're not too tired/sore to enjoy them afterwards).", "author": "Sean H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "I somehow ended up here on a Saturday morning at 10am with a hangover, wearing a ball gown, and smiling for the camera. Don't ask me how, but, trust me, it happened.\nIt's so beautiful up there... truly a serene, fresh and invigorating environment for your morning run.\n\nBut forget that, it's \"see and be seen\" in your tight running shorts with your cute, tight, butt trailing in your wake. Try flirting with the rich locals; please tell me how it goes?", "author": "Tina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-26", "description": "Wonderful workout if you like stairclimbing. What is there, about 400 steps here? Not sure.  Great neighborhood!", "author": "Darrell R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-15", "description": "Love the well manicured gardens here!  Always healthy and green.  I read in the Chron that Sen. Feinstein's gardeners \"accidentally\" tore down the gardens.  Poo.. they are in the works of replacing it.  One of the few hidden gems in SF.  The Lyon Street Steps have one of the most breath taking views of the bay, the Palace of Fine Arts, and Sausilito.  Only the most grandest SF elites manage to score a mansion alongside the steps.  They in itself are a marvel to look at.  This is a great place to show off SF to visitors.  Of course, it's great to work out with or just sit on a cement bench and reflect.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-15", "description": "Just got my ass kicked here recently... and it was great!\n\nRan all the way up and took in a gorgeous view of the bay & then took off through the convenient Presidio trail that's just off the top of the stairs.\n\nWhat a good workout! My body took quite the beating, but it was just what it needed. I'll be back next week!", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-17", "description": "I cant believe I have not written a review of one of absolute favorite spots in the city until now!\nGreat place to get your butt in shape and meditate on how lucky you are to be doing so in such a setting.  \nOn a sunny day, this is the place that makes you proud to call San Francisco home.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "Spectacular! What grandeur. This neighborhood is beautiful. Well worth the hike up the steps. Look down on the Palace of Fine Arts. It is a great workout. I will make this a regular destination when I come to the city.", "author": "Jeromy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-16", "description": "I'm embarrassed to admit that not only am I a Bay Area native, but I've been a bonafide resident of Pac Heights for over 2 years... and I've ONLY just discovered Lyon Street Steps. \n\nWhere have I been?! Gorgeous. Gorgeous. Gorgeous. Especially at 6:30am when the sun is rising over the city. \n\nOf course, it was gorgeous all the way until the 8th or 10th or so time I went from bottom to top and started to feel dizzy, my thighs started to quiver, and I was gasping for air... \n\nBut I survived and can't wait to go back as part of my regular workout program.", "author": "lily l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-02", "description": "Great workout, killer view (or was it great view & killer workout??)\n\nEven just walking these babies will tire you out (and running them will make your legs wobbly). But its worth it for the incredible view of the bay and gorgeous houses all around. Definitely one of my favorite scenic spots in the city.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-22", "description": "Used to live in the area and came here occasionally for exercise but wasn't super into doing the lap thing. Why? Because I'm really not that into running DOWN stairs. At least to me, it's kind of a waste of time and it hurts my legs. And I don't like being that close to other people power huffing it. The stairs are a bit narrow. And maybe I just always had the luck of being there when jocky douches were around. Lastly, I've been when strange drug? deals were going down nearby. I don't even know what to say about that. But that is DEFINITELY not my steez. \n\nThat said, it is a nice place to pass through. And if you enjoying running laps on stairs.", "author": "JJ W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "I walked down these steps many times when I used to work down at the Presidio. I arrived sweaty but having a sense that I somehow achieved something beyond getting to work. \n\nEven the bitchy looking gals running in their expensive \"See Jane Run\" outfits seemed endearing...as they gave me dirty looks because I was on *their* way. \n\nYes, the views are amazing - as someone previously said, this may be the most \"picaresque\" area of town! I think she means \"picturesque\", unless there is something I don't know going on inside those mansions.\n\nNext time I walk down those steps I'll picture socialites in boas, garters and strap-ons dancing to Lady Marmalade.", "author": "Raul A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-28", "description": "This is a fantastic place to get a fantastic workout! I took one of my personal training clients here a few Fridays ago and now she wants to have a session there once a week! If you pace yourself,  you can have a very rewarding workout. If you don't pace yourself, you could end up puking for fainting halfway up!\nThe workout: \nRun up the steepest part (2 flights), 10 seconds break in the middle. At the top: push-ups, sit-ups, vertical jumps, frogs, quick alternating lunges, squatting side shuffle, sun salutations. All of this x 4!\nIt was hard, but she had fun!\nI definitely recommend this place for a heart-pumping workout!", "author": "Keely G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "The Lyons Street Steps definitely OWNED me! It was simply stunning and treacherous all at once. Great exercis to include in your workout regimen.", "author": "Hazel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-12", "description": "Still aching from last Friday.  These steps are killer.  And yes it is beautiful and yes the butt looks better.\nBut watch out for the yellow jackets.  Those sons of bitches are in effect, as are the mosquitos.  You have been warned.", "author": "Pamela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-15", "description": "Lyon Street Steps show you whos boss. If you're not in the Marina and want some steep steps try the ones up to Twin Peaks off of Corbet in the Castr. They are nice and steep and its a little like running though a tunnel in parts. Cute houses up there too.\n\nI would also have given 5 stars if there was adequate night time lighting.", "author": "A W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-21", "description": "Pretty. Free. Kicked my ass. The ass the got kicked is now firmer.\nSee how long I can keep coming here. Hopefully at least 5 times a week.", "author": "Kokoro I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "There are \"spots\" throughout SF, which remain absent on most maps, but the most \"San Franciscans\" know to check out. Lyon street steps is one of those places. \n\nAs a teenager, this was the place to go to grab a drink, sit, and enjoy the gorgeous view. Now older, I'd suggest these steps as a place to read, or just take a stroll. \n\nIt's right next to JFK park, so you can combine the two for a great day of outdoor fun.\n\nSFCritic", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-25", "description": "The cheapest gym in town, this is the SF equivalent of LA's Santa Monica Steps.\n\nA pleasing mix of the over and under aerobicized, everyone's friendly and parking is easy, but I liked the old Garden setup a lot better than the new one.\n\nMy personal record?  10 times!", "author": "Victoria B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "I'm not sure how anyone can not give a free, beautiful, secret garden five stars! It's such a little treasure hiding right in the middle of the city. And so clean and well cared for. Kudos to the wonderful neighborhood that keeps this garden great!\n\nAnd to the reviewer who gave this little park one star, because the police called her out on her public drinking: I'm giving you one star for being ridiculously lame. Go drink your forty and make-out somewhere else.", "author": "Elina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "First time up and down these steps... I like going up better then down. I keep feeling like I'm going to trip and hurdle my way down to the bottom of the stairs with head concussion and everything. The scenery was great, and decorations were amazing. A lot of people were there climbing up/down the stairs and there were little set ups of workout stations. I would definitely do it again. Felt like a safe place to go, as a woman working out alone.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "Want to know what a heart attack feels like? Run up these bad boys 4 times. I was done the first time around but I kept going and my heart was pounding hard. BUT I loved ever minute of it! Your body hates you after this but the reward of knowing you did it and finished what you set out to do out weighs all the pain and suffering. Good workout. Be brave. Have fun.", "author": "Mel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "you didn't intimidate me one bit, lyon street steps.  \ni overheard your scoffing and snickering.\n'...hah.  w/her burger-burrito-hot dog eating tendencies??  she'll never get a workout out of me.'\n...\n\nfour rounds of climbing later, i haughtily smiled and flexed my butt cheeks in your face.", "author": "Ting A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-03", "description": "Wear mosquito repellent and be prepared to not walk normally for 2 days if you are a newbie! When I say not being able to walk normally, I mean, strangers on the street thought I was recovering from an accident, I had to walk up stairs and down SIDEWAYS for 2 days.\n\nSo pretty though, and you can wave hello to Diane Feinstein, or at least the exterior of her manse on your ups and downs.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-16", "description": "I get off the 45 thinking I'll just walk a few blocks to the 43.\n\nA few minutes later I find myself surrounded by sick mansions with amazing roof gardens and a 1000 steps awaiting my accent.\n\nIf I had a few million to throw around I'd totally get a house here.  But for now I'll stick with renting a place in a neighborhood where burn-outs shit on the sidewalk, ask for money and try to sell you weed.\n\n--\n\nOh yeah, and it's not possible to walk from the 45 to the 43 in less than 20 minutes.", "author": "L J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-04", "description": "Huff and puff. The views at the top and the ridiculously amazing houses make a good carrot at the end of the stick. I always bring out of towners here too just to enjoy the area and they are invariably awed.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-06", "description": "I was running hills one day (when do I not run hills in SF?) and came across lots of series of stairs.  Perfect, I thought, to add to my workout.  It kicked me in the butt!  There are plenty of stairs to get a super workout.  \n\nJust be careful when they are wet and slippery.  Going down steep hills can be challenging.", "author": "Julie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-02", "description": "I hate these steps, and I love these steps.  It is a true love/hate relationship.  I look forward to running them all day long, then hate them when I'm there, then love them when I'm finished.  Bring water with you if you're going to run them multiple times.\n\nAmazing workout!", "author": "Christina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-31", "description": "I feel a bit dreamy whenever I come here. \n\nI have only came here to bring people from out-of-town, and normally during sunset. I like to park on the ground to slowly climb up, and then start glancing back to unveil the views, and re-discovering a new set of stairs ahead.\n\nAs soon as we climb a few steps, I start dissolving myself into my own world of imagination, as the views progress, and the sun sets. \n\nI dream of becoming a philosopher, trying to draw analogies from the views and the experience.\nI dream of having one of the mansions someday, and sitting at the corner room overlooking the city and the bay beyond.\n\n.....and many many other dreams..............", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "Two hits to get the head straight.  Start from the bottom, where the steps are narrow.  One at a time from here, bust it up to the mid level, stall across, then two at a time up to Broadway, turn around, gassed, mind blowing view, then take it down fast, step slalom, quick turnaround, now nine more times.\n\nTen years later, when the kids were young and needed the drive for nap time, park at mid-level and let 'em sleep, check on them on the way up and down  - 50 minutes is plenty, early live DMB, Under the Table and Dreaming.\n\nA few years after that, they are strung along the steps giggling and spinning like pinwheels on the landings, no running now, they need to be watched  -  the view is heart-stopping.\n\nTwenty four years later.  Knees can't take  the slalom down any more, but up is still good.  The view never ceases to stun, its a perfect location to break up the commute with an 800 calorie gut buster.  This never gets old and has to be one of the best places in the world.  Check it out, it lasts a looonnnggg time.", "author": "David T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "I used to live near here and never appreciated it till I moved.\nThe view is great, just be sure to bring some water :)\n\nI rode my bike down these stairs once, amazingly I'm still intact.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "Its a Love/Hate Relationship.  \n\nAmazing view at the top....enough to make you forget how much you hate them while running up.\n\nThe Love prevails as I continue to incorporate the stairs into my training schedule.  How can it not when you see my toned legs and behind.", "author": "Beth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-13", "description": "Best stair workout in the city. For a good warmup, run flat along the Marina or around the Palace of Fine Arts... then, make your way up to the stairs and get ready for some serious pain. Right when you think you're near the top - here come another set of stairs!\nMinus one star because I have to trek to the Marina to get there (I very much dislike having to drive to a workout).", "author": "Anika K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "I hate these steps...I love these steps...They kill me. \nWhat a great workout...I can't say I ran up the entire way real fast by any means but I felt it all the way. I was there with a small group of Boot Campers and there was a much, much larger group of Bay Area Boot Campers there as well. I haven't gone there on my own but today might be the day....", "author": "Mellie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "Ahhh, the Lyon Steps. These are built for all fitness levels to the leisure tourist. With amazing views, fresh air and variation in stair layout, they have the right mix of everything you need to keep from feeling bored and mundane. These stairs have seen me through some times in my life. Put the earphones in and get to climbing. I promise you will feel better about whatever is going on in your life. Big Smiles!!!", "author": "Adrian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-29", "description": "Oh no.  am I really writing a review about how I \"used to\" be in good enough shape to race up the Lyon steps?  I swore I'd never get here!\n\nRunners take note - this is the spot.  Whether you're brave enough to take a few laps up and down the stairs or you just want to incorporate it into an incredible Presidio and/or marina run, this is a great and gorgeous little kick in the ass that can't help but make you think, \"It doesn't get better than this.\"", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-08", "description": "It was a sunday morning. \nWe have 3 weeks till our half marathon.  Lets finish w/ the Lyons steps we say to each other.  I thought the hills were bad, but these steps kicked my ass.  Lets \"jog\" it we say to each other.  I thought it would never end.  When would this stop???  Finally got to the top after feeling like we're going to pass out.  But it was worth the run! The endorphins made the view look soo much nicer!  Beautiful view at the top on a clear and sunny day!", "author": "Amelia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-29", "description": "when we were high school kids, my sunday school friend LH would drive me here with much excitement to show me her \"dream house.\"  it turned out to be the house at the top of the lyon street steps.  we would sit in the dark in her car and wonder what those fancy people were doing behind the glowing curtains.  on our way home we would contemplate complex schemes to take over the world and earn the millions to purchase our dream real estate.\n\nflash forward 10+ years later, and these steps are actually in my neighborhood.  sometimes i accidentally (or do i?) take a detour from the marina and end up back where i started, to the romantic dreams of making it big as an immigrant kid in the US.  \n\nbut i'm not a kid anymore.  and i now live a few blocks away.  i must be getting warmer....\n\nan amazing place to sit and dream.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-10", "description": "as a part of my latest \"get fit quick\" scheme, i've incorporated the lyon street steps into my weekly routine.\n\nwhenever i commit to getting my ass in shape (...literally) i make sure to frequent Dailey Method, and now will absolutely add the lyon street steps\n\nbring your ipod if you run them alone, or do what i did the first time and bring a friend you want to catch up with. went just before dusk so it wasn't crowded at all. absolutely gorgeous view of the marina from the top, and tons of \"one day i'll live in a pac heights mansion\" houses to drool over", "author": "Brianna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "I decided to run the stair cases at 10pm tonight! Never doing that again.. I was halfway up the first set of stairs when I saw a dark figure sitting on the bottom step. I was pretty frightened. It was a homeless man. I quickly said hi and bolted up the stairs never to look back. Scared the living daylights out of me. At least I hit my target heart rate.  :( \n\nAnywho... I finished my workout on the second bigger set of stairs where there was a security guard present. :) \n\nMy quads will be hurting tomorrow. :(", "author": "Simon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "The Lyon Street Steps are absolutely worth a try for everyone enjoying some exercise. Why spend 90 dollar a month on a gym when you can exhaust yourself running up and down these steps, and even better; enjoy the view after all your effort? Make sure to pick a good time (late afternoon for me) to avoid too much people on the stairs.\n\nI usually start at the beginning of Lyon Street down at the Palace of Fine Arts, a 2000 feet run up a steep hill... and just when you're already getting tired, the Lyon Street Steps show up. The first set of steps are very steep and narrow, so make sure to pick your moment since is difficult to pass people on your way up. After you crossed the terrace another set of steps show up, which are a little wider and less steep. Enjoy the view (especially before dawn when the lights are getting on) and go down to re-climb the steps... over and over.", "author": "Frank d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "A-MAZING! Just started running these steps and I love them (not so much when I'm actually on them :) Can't believe I live in Pac Heights and it took me 3 months to discover them, shame on me! Great workout, amazing view, and people seem to be totally respectful of other folks working out, no matter what their speed. Goodtimes", "author": "Jen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "My favorite place to climb stairs. I am fortunate enough to live about 6 blocks away, and even though I'm not a fan of the marina workout crowd, I do love adding these steps in when I go over the hill on a run to the bridge. If I'm looking for a quick workout, I do a few rounds up the steps and call it a day. But most of the time I add a couple of rounds in at the end of my long runs when my legs are like jello and the burn really kicks in. I avoid this place when it's sunny. The crowds can be obnoxious, so I usually come here at dusk or with a light in the evening. Less crowds and less tourists snapping pictures of you when you make it to the top and look like death.", "author": "Courtney s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "i recently added this to my daily regimen.  its walkable from my house and although i'm severely asthmatic and steps are my nemesis, i will overcome this in time.  or have a heart attack - death is chasing me these days as you may or may not recognize:(\n\nalso, if i bring you here to make out, it means that i really really like you.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-12", "description": "I think everyone else has said it all, but truly, there is nothing like completing a tough workout on these stairs on a gorgeous SF day.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "Man, I'm ready for 470 calories of thirst quenching Jamba Juice after sweating these stairs.  I'm not Lyon.", "author": "Teddy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "amazing workout. These steps will make you feel good about yourself once you hike and and down them. I like to end a long presidio perimeter walk with the steps.  Lots of people come here for a workout as well as those who just want to take a look at the stairs. \nThis is a good place to bring guests to show them massive amounts of steps and hills.  Have them hike up it for a good time.", "author": "Valerie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-03", "description": "[disclamer: so this is TECHNICALLY my 100th SF review, except i cheated because i realized it AFTER i wrote my review .. the one after this one is what i had for lunch today, and it's extremely worth it, if you work in the FiDi, IMHO).\n\n***\n\nI LOVE/HATE this place with a passion...\n\nOk, being the health nut I'm trying to be, I've pretty much explored SF (walking, that is), and the farthest I walked from Chestnut/Fillmore was all the way to Howard/Embarcadero where the Cupid's Arrow is at, or wait, was the Golden Gate farther? No clue. \n\nNow, that was NOTHING compared to the steps of Lyon. \n\nSheesh! \n\nTalk about a true, heart pumping workout... \n\nFO SHEEEEEEEEEEZ, my fwends... \n\nthere are a total of 269 steps going ONE way. LoL... yes, i've counted ... LOL, i kno i have nothing better else to do, and honestly, it took prolly 3 attempts to finally get that #, only because everytime i was out of breath, i'd be too caught up catching my breath OR gettin distracted w/my music on my ipod, and honestly, it helped me make it through without stopping ... \n\nMan, there is NO NEED FOR A GYM MEMBERSHIP... \n\nI swear! \n\nThis place is beautiful, tough, and FREE... \n\nit is what it is. \n\nI have to say my fave part is strolling through the Presidio Trail and cutting through Lombard towards Chestnut to go home, just make a quick right from the top of the stairs. Idk if I can make it here daily, my legs are KILLING me...  i'm impressed that i did make an attempt to come here couple times a  week though ... \n\nmy next challenge? \n\nprolly to wake up at the break of dawn and work it..", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-05", "description": "Located right by the pedestrian gate leading to/from the Presidio, stop to catch the breathtaking view from the top, middle, or base of the Lyon Street Steps.  For those not in top shape like myself, it can be intimidating to see these fit creatures moving swiftly up and down the steps with ease.  Just one set of stairs sets my quads on fire.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-24", "description": "Second best way to get your morning workout - but watch out for the early morn snails on the steps, please. They didn't do nuttin' to you....poor little guys.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-22", "description": "What a beautiful view.  Probably one of my favorite places to come and reflect over why I ever moved to San Francisco.  The the view at these  steps is akin to heaven (but can be hell when you have to walk up them).", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "Best place to run your butt off (literally) while looking at gorgeous bizillion dollar mansions on the way up, and views of the bay on the way back down. Just watch it on the way down - some are a bit narrow, some are a bit steep. Use that handrail!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "This is probably a great place to break up with somebody. It's so lush and offers an amazing view. Take the hike up the steps, have a sit, break it to them gently and marvel at the world that is laid before you. Nothing seems sad when you are here.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-22", "description": "Love running up and down these. Bonus: Because there is a security guard protecting Diane Feinstein's house every night, the stairs are super safe to run during any time of the day!", "author": "Lizzie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-14", "description": "I tried the stairs for the first time yesterday. I heard that they were tough but the view made it worth it. Lyon Street Steps on the way up are the stairs to HELL but when you get to the top and turn around they become the stairs from HEAVEN. What an amazing VIEW! It's almost like each time you get to the top God gives you a little treat for working so hard . . . .the amazing blue water from the bay, gorgeous homes in Cow Hollow, WOW!", "author": "Heather A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-11", "description": "Great place to take the folks from out of town, especially in spring when all the flowers are in bloom.  No need to run up and down the stairs -- just take your time and enjoy.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-05", "description": "i was in a REEEEEALY foul mood at the end of the day a few weeks ago.  a steer-clear-of-this-bitch kind of mood.  my options for dealing with this state of affairs were: working out (most healthy/productive); breaking something (not really my style); drinking heavily (definitely my style, but not really in my best interest).  \n\ni took the high road, literally, and hit the lyon street stairs.  four or five times up and down these calf-burners, with the view of the entire bay threatening to distract me and send me tumbling down (which would NOT have improved my mood), and i was back to my normal bright and sunny disposition.  thank you lyon street stairs!", "author": "Kirsten F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "Awesome and extremely intense stairs for running.  Great work out.  Plus beautiful surroundings.  Highly recommended.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-12", "description": "I started doing these this month during my run, but this week, it started raining so I quit.  It's a great hidden place to do some cardio/circuit training and there are usually others going up and down the steps so you have some company in the pain. It can get crowded, and you're too busy trying to huff and puff up the steps to really enjoy the view.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-24", "description": "One of the most incredible views of the city...I ran the stairs a couple times after taking a long break from running.  I hobbled around for about 4 days after that.  It's so much better than a stairmaster though because when you make it to the top, you get the great view of the Marina and you feel like Rocky.", "author": "Rosie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-11", "description": "Just take a bus/car/taxi to the top. Then marvel at the view, take a few pictures, and hop on another bus/car/taxi to take you back down. That's my lazy-ass, no-need-to-get-your-heart-rate-up way of seeing one of the most amazing views in SF. Fo sheeez.", "author": "Ali L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-17", "description": "My new favorite workout destination from my house!  I love the views and the feeling is so great when you finally make it to the top!  It's so much easier going down.  Then you gotta decide, should I go up again?  Great workout!", "author": "Britt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-14", "description": "Luv to run up and down these things...its MUCH easier if you skip steps...AND, don't look down!!!", "author": "Peter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "nice view from the top.  it's also pretty close to the exploratorium and the palace of the fine arts so take a few extra minutes to visit the steps.   walk in the opposite direction from the palace on lyon street until you reach green street.  there's usually no tourists, just a few stairclimbers, but watch your step!", "author": "Immer E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-13", "description": "I use to live near here and ran 1/4 of the way.  My house was 1 block away.  I wish my great grandparents were rich I owned one of these houses.  Back in the 1940s you could buy one of the babies for a cool $900,000.  But they were just a bunch of fatties and ate their money away.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-23", "description": "This is my favorite part of San Francisco! It has the best homes and views anywhere. What's so nice about this is you can get an excellent workout in a first class location for free. I have seen newlyweds step out of their limo to get photographs of themselves at this location. This is part of what makes San Francisco so special.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "on a sunny day,\n\nthat rare aurora Borealis of San Francisco, this place sparks magic to ones eye.\n\nbut its a beautiful place.", "author": "Derek Alistair J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "OK, I agree, the steps are beautiful blah blah blah.  But nobody tells you how extremely hard they are to run.  I have only been able to max out at 3 times up and down the steps, and when I was done I had to pass out for an hour.  Also, nobody tells you how dangerous they are.  There is so much to look at (beautiful views, cute yuppies, fancy houses, etc.) that you can easily slip and hurt yourself, especially on the bottom steps. However, if you concentrate on just running the steps this is a great outdoor workout. And when you are all done and passed out on the sidewalk you will have beautiful things to look at.", "author": "Jake A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-23", "description": "Screw you, Stairmaster! I can work 10 times harder by going to Lyon St., plus take in some awesome views of SF. I am officially addicted. And also a little too cocky, as I began my first experience at these steps by sprinting up the lower, steeper set....not a good idea. I'll be feeling that for a while!", "author": "Beth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-14", "description": "After running up these steps (best to come after running at Crissy field, it's killer,... run from Crissy by the bay, then uphill to the stairs, then the stairs! awesome) everything is starry.  Five stars, ten, 20, they keep spinning too.  Fireworks!", "author": "Today Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-07", "description": "What a beautiful destination for a grueling workout.  If you have that big race or just want to burn a few extra calories route your jog through this glorious set of stairs that bridges Cow Hollow to Pac Heights.   Great people watching and the fresh air of the Presidio.  One of SF's simple treasures for sure.", "author": "Todd J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "For the health conscious in SF . . . The Lyon Street steps are a must.", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-11", "description": "I feel like collapsing....yet I still gave these 288 steps 5 stars.  How curious!  I think it has to do with the fact that I ran up and down both sets (sometimes both at once) 5 or 6 times this morning (I lost all conciousness   of anything around me around the 4th time up) during boot camp, and when I'm in my bikini on vacation at the end of the month, I'm going to thank these steps over and over again!    I'll take the sweeping views, the beautiful garden between lower and upper steps, and overall feeling that in one visit I'm significantly in better shape than I was before over going to the gym ANY DAY!  This wasn't my first trip, it certainly won't be my last!", "author": "Kate C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-19", "description": "i'm a native of SF.  I've lived my entire life here, until i was 18.  I'm in my early 30s now, and have only now been introduced to  the Lyon st. steps! Thanks, Jacey!! i didn't think it would be that hard of a workout, but when i got home, i noticed my legs were feeling wobbly.  hehe.", "author": "joseph k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-22", "description": "A must see in San Francisco. The stairs climb up to the Pacific Heights mansions on the east edge of the Presideo. If you've got the energy, put on your running shoes and hoof it up and down the stairs for a good workout. You'll be rewarded at the top by a great view of the bay and the Palace of Fine Arts.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-22", "description": "Word of advice to all.   If you are going to make a bet with someone... make the stakes good old fashion \"money\" and not running these steps 5 times.  Great workout but damn hard.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-15", "description": "You do have to pay attention, but that's what makes it such an experience. You're not just in pain, you're looking out over some of the most gorgeous views around, you're jealous of the people who live in that mansion, you're proud of yourself for getting up the steps, you're breathing this fresh Presidio air... And the awesome thing is that if you're just starting you can run right into the Presidio and go to Crissy Field... but if you're wrapping up you can walk right over to Union street and get a smoothie and relax... Its one of those little spots that feels like a great discovery.", "author": "ruth k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "I was in awe of this chick who was powering up the 2 inclines at the steeper-lower half of the stairs. She's my hero.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-07", "description": "One of the most beautiful spots to workout outside in SF.  The stairs are mesmerizingly challenging, but at least you're outside taking in the fresh air vs sweating away in the smelly gym.", "author": "Heather C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-20", "description": "Great for both brisk walk up and down the stairs or also for intense workout. Wondeful flight of steps with great views, not sure if the owners of those houses nearby do mind the number of people that come here to use the stairs, oh well....kinda the same situation with Lombard - crooked st...I wonder if anybody lives in those houses...they look too model-like/too perfect! :)", "author": "Yan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-22", "description": "My lungs were burning and my thighs were shaking but damn -- exercise has never been so scenic!", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-20", "description": "Just when I think my run is getting a little too flat for San Francisco...sha-BAM! I hit the steps and let it rip!", "author": "Diane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-16", "description": "This is a great workout - buns of steel baby. It's also gorgeous, scenic and in a high class neighborhood. love the little gardens. My question: who lives in those houses on the stairs - especially the one with the guard?", "author": "melissa h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-08", "description": "I am beginning to wonder how many times I've climbed up you.  Mostly I love you once I am at the top.  But ever since Diane F move in and she re-did her ront yard, the steps are even more beautiful to go up.  The pretty landscape helps with distracting me from my huffing and puffing.", "author": "e w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "used to live close by.  great workout site, gets crouwed on the weekend and walkers get in the way", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "LOVE THEM!!!! i've been going to the steps since i was in middle school.  my favorite is taking people to them and racing them up the stairs after they're tired from walking all the way down.  \nA beautiful view of the exploratorium and I have never seen more than 4 or 5 people walking up or down them. I've also never seen tourists around, which makes me appreciate San Francisco's secrets even more. \n(i was once told that robin williams home is next door to them, i wonder if its true)", "author": "Jennie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-21", "description": "After all of this yelping, I needed a few trips up the steps to burn off those extra calories. For extra amusement, come here with your out of shape friends, and watch them huff and puff their way up.", "author": "Dana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-08", "description": "This definitely beats stairs-masters.  I like to take out-of-towners here for the nice scenary.", "author": "Bessie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "What an awsome find.  I came here with some friends about a year ago and fell in love.  It is a perfect place to enjoy a picturesque view of the bay and/or a great work out surrounded by multi-million dollar homes.  I certainly plan to make full use of the cities best free stair climber when the days grow longer.  This is also a great place for a picnic or other things a little more naughty than nice.", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-21", "description": "awesome!!! the steps are towards the end part of an hour long run!!! great cardio-kick-a** climb with a beautiful view of the bay & the palace of fine arts!!!  prior to the steps is the gradual climb up the hill, so by the time i reach the bottom of the stairs, i'm somewhat light-headed.  \n\nhave yet to go straight up the steps without taking breaks. its my challenge to make it to the top without a break everytime............one day.......... \n\nmae sums it up pretty well how i'm feeling when i reach the top of the steps, completely out of breath:   \"everything is starry.  Five stars, ten, 20, they keep spinning too.  Fireworks!\"", "author": "Cindi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "The Lyon Street Steps are located two blocks away from my apartment and I go up and down them everyday!  What motivates me to go is the fantastic view from the top of the steps.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "Great views, a good place to take out of town visitors to catch that sense of what the city of San Francisco is about. You can also walk straight to Presidio from there.", "author": "Julia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "I use to hang out here and drink in high school, if your in high school, this USE to be a great place to hang out and drink. Haha, \"I don't know what your talking about officer that cold 40 oz. was here when I got here-- what, yeah go ahead and dump it out in the bush\" haha. Dianne Feinstein lives at the foot of them now, and last week I was walking down them at like one AM and there was SFPD reading a news paper out side her house. I guess that all the 'kids' will be doing their drinking over at alta plaza.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "an old friend used to live/work a block up from here.  we would often charge the steps for intense stair climbing, or while strolling and chatting.  there are always people going up and down the stairs as part of their workout regimen.  the views from the steps are breath taking.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-29", "description": "great place to come and get your butt worked and enjoy the view. i'm feeling the pain but i kinda like it so i'll be back. =)", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-17", "description": "These steps are pure insanity! I can't enjoy the view around me because I'm trying to focus on living. Just kidding when I make it to the top and I'm struggling to catch my breath I have a couple seconds to enjoy the beautiful view. Add this to your gym routine and you wont regret it. Some ppl who do these steps are hardcore, but usually when I go there is usually a good mix of ppl who run these steps.", "author": "Jennie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-24", "description": "my, oh my... a fine workout no matter your fitness level.  a tip for the uninitiated -- make the effort to plant your whole foot on each step.  you'll generally get a better workout through your whole leg, and you might even be able to walk the next day.", "author": "Nat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-11", "description": "these steps make for a great workout, and it's easy to get motivated to get ot the top when the view is so beautiful.  truly amazing.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-28", "description": "Perfect makeout spot if you have a large enough trust fund to bribe the cops into pretending that they \"never saw that 40oz\" that you were holding.", "author": "Bethany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-18", "description": "oh good... my legs still exist today.", "author": "Coco E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "The Lyon Street Steps are a staple in San Francisco, and we as San Franciscans trying to get our butts in shape are oh-so-lucky to have them. Sure, they kick your ass- they really do- even walking. But-- the view is priceless (so even if you have to stop and catch your breath half way ... or more often.... the view will be worth it), you can customize your workout, and seeing the majority of people there looking hot and fit even when they're well into middle age is an inspiration in itself to stay motivated. Also to be noted is that even on a foggy day the area is beautiful, just bundle up and you'll warm up as you get going..", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-30", "description": "Either I'm really out of shape or these stairs are just really hard. Nonetheless, I really enjoy coming here. The view is awesome, the workout is great, and the people who run these stairs always get out of the way if you're going faster than them. Everytime I come here, I'm reminded of how lucky I am to live in such a beautiful city.", "author": "Roger R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-12", "description": "A-ok is right.  I went here today and I don't know what the giant deal is about these steps.  Also, where the f is all that topiary shown in the picture?  It is pretty, but I was expecting some kind of magical secret garden- instead it's kind of busy, with runners bypassing the walkers every couple of feet.  Also, how does one run up these stairs without dying?  I would like to know.  There's not really anything to do after reaching the top, besides going back down and then leaving to do something more fun.  Maybe it'd be more fun if I were drunk- but probably a rich white person would see me from the widow's peak in his ginormous mansion palace, whilst drinking tea and eating crumpets and call the cops.   It's an all right spot to stumble upon, but I would not recommend it as a destination, unless your destination choice is yup-ville and you are inclined to walk up a million steps by some mansions.", "author": "Liza W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Great workout (did only 4 sets on Saturday and still can't feel my calves on Monday) with a killer view.  I counted 291 steps (way off from what others have posted) but that might be attributable to the lack of oxygen in my brain at the time.  I recommend going early in the AM on weekends before it gets too crowded.  The lower part of the stairs gets narrow and there are some bruisers (aka - fatties) walking up the steps and they are tough to get around.  I am not sure if it is the norm, but there was also a healthy dog-turd on one of the steps last Saturday.  Minus one star.  Would have been minus two if I would have stepped in it.  Three if I was barefoot.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-03", "description": "Beautiful, beautiful, beautiful, there is no other word to describe these steps!  The view is amazing, the surroundings are chique and green at the same time, and there's lots of peoplewatching to be done.  I really admire people using these steps in their workout, but I don't think I'm there yet, I just walk them...", "author": "Marijke D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-22", "description": "i've been coming here since the good old days of drinking 40's, running from the cops and kegs at the palace.  i now appreciate it for its beauty and nostalgic san francisco feeling; and it still attracts the occasional hoodlum.", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "My calves are screaming with pain after yesterday's stair climb.  It was brutal, humbling, and in a strange way....good.", "author": "B J."}
