{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "My secret hangout: good coffee, wifi and a beautiful view!", "author": "Mike T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "The coffee is okay but the lady at the counter has the worst attitude ever. \nThe staff has no idea what the dish is and the lady has no patient to explain the dish. And of course I can read the sign, I just want to know what it is! Even thought I already ordered what I want she still gave me this whatever look. It's just awful.", "author": "Fairy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "Such a rude and unprofessional customer service. I was there couple days ago with my friend. My friend bought a sandwich and we shared that together and then opened our laptops to work. The woman who was working there came to me after a while and asked me if I don't wanna buy anything from them in a very rude and unpleasant way. I told her we are together and my friend bought something and we shared. Then she said your friend did and why you don't buy.  I explained for her again that we are together and we just needed one sandwich to share cause I'm not that much hungry . And I told her that's so weird. Suddenly she started to yell at me \"what's so weird?!!!! Go out if you don't want buy anything\". Her behavior was very very rude and bothered us and all people who were at the cafe at that time. \nI think it's better for her to retrain and think about her behavior to not loose the business!", "author": "Noushin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Good environment. Good service. They make food very fast. No need to Waite. Toilet is clean. Orange juice is fresh. Another customers are usually come often. No strange people.", "author": "Pei-Lun H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Coffee was decent and they were quick for my to go cold brew. There wasn't a line and they were polite. If anything, nothing significant about the experience to call out.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Here is great place for take a break  relax yourself or with friends and family  get a cup of coffee & tea or other drinks; sandwich and the baked food, barista are very nice, coffee and foods are very good", "author": "Yun Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Good coffee, they play great music and it has a nice ambiance! A good place to take a little break.", "author": "Daan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "Such a convenient place to come and get a sandwich or coffee since I live right down the street. The sandwiches are delicious and the coffee isn't bad either.  3 stars because It is definitely pricier than other coffee stops and since it is a \"neighborhood\" joint, I've noticed they can sometimes act 'cliquey' to people who aren't every day regulars which sucks.", "author": "Luke E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-13", "description": "Simply rude. I was waiting for a student because he wanted to meet there and grab something to eat. Girl comes up to me and tells me that if she can help me with something. I told her what I said earlier and she said, \"this is for customers only\". Kicks me out. \n\nCULERA. CULERO. CULEROS.", "author": "Benjamin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Love their bagel and cream cheese. The price is worth paying because the food is great.", "author": "Leticia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "NASTY SERVICE \n\nSeriously perplexed why this pace has 3.5 stars. I don't think I've ever encountered being sworn at in an eat-in, even if its of the lowest quality. I came in with my 5 year old son and because the women at the counter didn't understand what a ciabatta roll is (which is on their menu) she became irritated and annoyed. I then decided to not order and leave. On my way out with my son, she lashed out with verbal abuse at me and told me to get the FUCK OUT!!!! I was so completely shocked by her verbal attack, especially in front of my 5 year old son and other customers including young children.  Has anybody had a similar experience??? Is this the typical service you get here? I looked around the place before I ordered and you can tell the place is unhygienic and the portions were tiny. Not sure why the place still exist as a business. So glad I didn't order here. Save your dignity and money and head down the road to a proper sandwich place Turners Kitchen just 1 minute away, who know what they are doing. What a nasty ignorant uncontrollable angry women.", "author": "Kimberleu H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "Came here to take a break before we headed home, but the service and the Vietnamese cold coffee was alright--nothing to special. It is a nice place to study though.", "author": "Nishi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "If you're the type of person who freaks out over your coffee taking longer than 30 seconds to be prepared or your barista not having the demeanor of a kindergarten teacher, you might be better off elsewhere. This spot is a family owned neighbor gem of over a decade with genuine hard working employees. The location is beautiful, plenty of space to work, and consistently delicious food & drinks. I'll proudly pick them over the bougie new spots up the street any day!", "author": "Tina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "Downloaded Yelp just for this review. I used to think this place was fine but after repeatedly bad customer service stopped coming in. I do laundry next door and was in desperate need of a drink. Not only did the person behind the counter mess up my drink -- not making it iced, but then she wanted to charge me 50 cents more for a to go cup of ice when I already got charged for the original to go cup. I would rather be thirsty than support this business.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-03", "description": "Meh, wannabe hipster cafe. Mismatched tables and furniture in a community style layout where people can sit and go on their laptops. The lady at the cashier was a little stuck up and barely cracked a smile. I ordered 2 medium cold brews for $7 but they were pretty watered down. If you held it up, you could see it was pretty light so not sure if they just added water to it. Kind of disappointed...barely any flavor too.", "author": "Marissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Sweet people work here, it's a neighborhood coffee shop with regulars and great foot traffic from the park.  Plenty of outlets to work, reliable wifi, 4 outdoor tables for nice days, and great sandwiches!\n\nPLUS, they sell beer and wine for when you want to reward yourself when it's time to put away your laptop :)", "author": "Ben G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-28", "description": "Terrible customer service. They started our drink before we finished our order, we changed our order and got 10 eye rolls our way. The cashier was impatient and rude and kept saying \"we already made it\" with an attitude when she hadn't even charged us. My mom has an accent and the cashier kept looking at her as if she didn't want to deal with her when the lady barely speaks english herself.", "author": "Carla B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "I've been in many cafe's in San Francisco but have never come across such rudeness and bad customer service. Despite their watered down coffee I came back again thinking that perhaps the counter people had a bad day and that things would be different this time, but unfortunately that's just their personality and how they do business.", "author": "Anil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "I haven't had alot done at this location since it was my first time dropping by but the service was super nice, ease of ordering and paying so I would come back if i'm in town again.\n\nThe coffee tasted nice and the place is awesome for friends to get together before heading out.\n\nthe place had huge open space and comfy couches with patio tables outside.  Pet friendly and free wifi.\n\nawesome!", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "This is a neighborhood, family run coffee shop that's great for a good cup of joe and a decent place to sit. No frills and their breakfast bagel sandwich is perfection.", "author": "Samia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "The chai latter served in a giant mug is what did it for me. Also great prices and comfortable atmosphere.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "My husband and I were on vacation in San Francisco and bumped into this place while exploring and checking out the mission District. I ordered a Matcha green tea that was amazing. My husband also really enjoyed his vanilla chai latte. Very low key easy vibe. No frills but good for a hot drink or mid day snack!!", "author": "Aliyah B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "Some of the baristas are really nice and very attentive but the owner has an attitude problem, has poor customer service skills.", "author": "Karl H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-22", "description": "This coffee shop is conveniently located near my summer school site, and as a teacher, I need my morning cup of coffee. Every day I come in, the staff are incredibly rude... same 2 people day in day out, and I figured the first time maybe it was just an off day... but we are on three weeks now! I guess customer service isn't important- but the food is lousy, over priced, as is the coffee! I can't wait until summer school is over so I never have to walk in here again. I don't even want to continue to give them business, but they are in luck because I need coffee. Very dissatisfied customer.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "Service here is really poor. The baristas are really rude, and on a few occasions they've deliberately charged more than the actual cost of the drink. No one wears gloves when they're preparing food, which is pretty gross.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "Terrible service.  I was charged twice for the same order. Then the counter person tried to fix it, but I was then charged an additional $.  When I came home to check my bank account. There were three charges and no refund.  I'll have to call the bank now to get two of these charges removed.  They really need to hire someone who can run a cash register correctly.", "author": "Katharine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Everytime I come here which is seldomly I get a coffee and or a snack. It's usually pretty packed with people on their laptops or reading books. People working there have always been nice. I once ordered a bagel sandwich as well which was very inexpensive and delicious.  The coffee tasted good, I got a slice of banana bread the other day which was tasty. Cute coffee shop that I hope sticks around considering the neighborhood has been changing so rapidly.", "author": "Francesca D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-28", "description": "Upon looking at the place from outside we decided to give this place a try. We were visiting San Fran and wanted to explore different parks and coffee shops. The place looked very cute and trendy on the outside so we decided to stop by. Parking is a little difficult but that is expected in a city such as San Fransisco. We ordered two lattes, exactly the same with one non fat milk and he other with almond milk. Both had the same flavor, hazelnut. Each drink was made without flavor and we sent them back. The owner was very rude and told us she hadn't charged us for flavor. Her mistake. So we explained how we both ordered the same drink but with different types of milk and she argued with us. Then she poured another latte with nonfat milk and told us it was almond. My friend is a vegan and milk really makes her sick. So I asked for her to make the next with almond milk and both women were super angry and told us we were wrong and didn't order it like that. \n\nTo top it off, the coffee was average. Nothing really special and the service was not good. Definitely wouldn't recommend to people traveling but maybe as a spot for locals to work and do homework.", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "I ordered the club sandwich, turkey sandwich, hot chocolate, soy chai latte, and a couple cookies. My grandma and I enjoyed our meal and we are impressed by how fresh the ingredients are in the sandwiches! Good job! The drinks and cookies were also delicious. Thank you!", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "Totally average coffee and drinks, but a pleasant place to hang out thanks to free wifi and a corner storefront that offers a nice view of the surrounding neighborhood.\n\nIndeed, the key advantage here is the prime location in between the Castro and the Mission, just steps away from Dolores Park. The main drawback: it's almost always crowded here, with people camping out over their laptops all day long. With the crowds, this place can really heat up on a warm day, or whenever the sun's shining through.\n\nNot a bad choice for some grab-and-go if you live in the immediate area though.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Nice place to work, great location, yummy sandwiches, plenty of outlets and wifi.", "author": "J P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "I love this neighborhood cafe. Good coffee, wonderful freshly squeezed OJ, beer and wine. Smoothies. All good. Nice, efficient, and friendly service in a clean and welcoming atmosphere.\nThe baked goods are yummy, but the sandwiches, especially the BLT, wins the blue ribbon. Absolutely delicious. Crispy bacon, crunchy lettuce, and delicious tomatoes. Perfect amount of mayo.\nThank you Maxfields!!!!!", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Attractive open plan with plenty of space for quiet workers and social butterflies. Guess what? They actually had DECAF Vietnamese Iced Coffee...no one ever has that! I mean, do you really think the whole Vietnamese diaspora seeks to be caffeinated? \n\nI digress. \n\nWifi was good, breakfast bagel was good too. Easier parking than much of the Mission district.", "author": "Gina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "I come here quite often since I live just around the corner.\n\nThe main thing that keeps me coming back is their bagels and the fact that they have real fresh-squeezed orange juice, made to order on the spot.\n\nEspecially their veggie bagel is a favorite of mine. But the lox bagel is really good as well.\n\nIt is also very quiet so a nice place to chill in the morning or spend some time online.", "author": "Jonas S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-05", "description": "Ooh no! First sign of failure was the scent of burned coffee in the air. The second which happened rather quickly was when I ordered a Cappuccino. When everyone else in The City is charging $4.50, their rates are excellent at $2.85. Unfortunately there is a $5.00 minimum for cards *sigh*. I wasn't hungry so I chose not to order any unnecessary extras. No coffee for you Lady J!\n\nIn a last ditch effort I asked for water. I was directed to a cabinet which had stacked plastic cups that were not fully dry, sitting on a dusty shelf. I could see the dust!!!\n\nThis review started with 2 stars. After my tutor arrived the cashier came over to inform us that if we wanted to stay, we needed to order something. 1 star deleted.\n\nI think I will be having my French lessons elsewhere thank you very much.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-21", "description": "There is a glumness in the service to be experienced at Maxfield's, and one can only surmise there have been a lot of caffeine-fueled battles over the availability of free WiFi which have left the servers shell-shocked and unable to break a smile to neophyte visitors like myself. That's too bad because I like the space here, a casual hipster/thrift-shop gallery vibe with plenty of tables for long-term laptoppers in need of self-absorption (see photos). Of course that's probably part of the problem since the owners probably need to use a well-greased spatula to get some of them to get out of their chairs, and considering their five o'clock shadows, I don't believe personal hygiene is a priority for them. And I'm just talking about the women.\n\nProximity to Dolores Park, the Castro and the Mission make this an attractive spot for a caffeine pick-me-up, and prices appear to be in the standardized Starbucks range, for example, $1.95 for a large coffee. It was nothing that would keep Phil up at night, but it did keep me upright for the short walk to the park. Perhaps to their chagrin, they also serve food here beyond the predictable selection of pastries - quiches, piroshkis, four sandwiches, a slice of spanikopita and a soup de jour. All appear reasonably priced in case you want to hold a marathon blogging session. I've been reading about a singing barista, but there was nary a peep from the staff when I was there, just the hyped-up keyboard tapping you would expect in a designated house of caffeine.\n\nCOFFEE - 3 stars...standard cup of joe with standard pricing\nAMBIANCE - 4 stars...a potentially cool space, but the populace hardly moves\nSERVICE - 2 stars...pretty surly...should I take it personally?\nTOTAL - 3 stars...a convenient coffee stop on the way to Dolores Park and not much more", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Down to Earth cafe. Breath of fresh air and throwback to the 90's Mission. Chill here before exploring the spectacular Dolores Park.", "author": "Elise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-25", "description": "Not the warmest staff. But the place is spacious enough to bring your laptop to and get some work done. Plus, it's conveniently located near Dolores Park. On a nice day, outside tables proved to be perfect for people (and dog) watching.", "author": "Yad L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "I like this coffee shop because it has a timeless feel, much less sterile than some of the other new cafes nearby. The coffee has been good (although I do not \"know my coffee\"). The baristas are cool and nice. This is a pretty good place to work.", "author": "Noah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "Plethora of coffee and food, free WiFi, and delightful music? Totally fell in love with Maxfield 's at first sight. It's easy to order food and drinks at the counter (though I haven't tried the food yet) but I just got a Thai tea since I already had too much caffeine in one day. This place has a homey feeling to it, from the service and vibe, to the decor and high ceilings. \n\nFew housekeeping items... credit card minimum is $5 and remember to ask for the WiFi password when you pay. Not much else to add. Solid place to grab some coffee and get some work done in a peaceful environment.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "Prices listed on menu are different than what is charged by the restaurant. They got mad that I asked for a bag to put my sandwich in and tried to charge 10 cents for a tiny bag. I don't mind the SF bag charge for grocery bags but they were just trying to be rude and cause undue hassle. Also the sandwich I had the turkey club was not very good very low cost ingredients and the turkey seemed off.", "author": "Meghan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "Not a bad cafe to get some work done. Wifi is on the slower side (3.26d/1.65u), and there are few outlets, but there's a lot of seating. Actually pretty crowded on a Sunday afternoon, but plenty of seat options closer to 5pm. $3.25 for a decent sweet chai, nothing special, and sweeter than I would go fore.", "author": "Linus W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "Laptop camper here. Maxfield's has a great location close to Dolores Park and laid back vibe. You can hang out inside or outside. It's a decent, fairly typical coffeehouse. \n\nI do love their art - the Hanna Barbera cartoon character paintings they had for sale.\nThere are plenty of eats to be had, including sandwiches, bagels, pastries, vegan cookies, quiche, empanadas, quiche and burritos. Beer and wine are available.\n\n* Veggie bagel: Like that it had plenty of fresh veggies.\n* Coffee: Not bad, not great. The latte wasn't rich but it wasn't bitter either. There was no foam art.\n\nTo access the free wi-fi ask for the password at the counter. There are ample power outlets and it's a pretty quiet place where you're likely to find a laptop camper.\n\nI like the high ceilings. The interior has an independent coffeehouse look with mismatched furniture.\n\nCash only. ATM on site. \n\nYou know you love me. X0 X0, laptop camper.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-30", "description": "Worst latte I've had. Tastes like water and served in a water glass. Really uniquely bad in taste. Also a 6 minimum on cards.\n\nThere are too many other good shops nearby if you're looking for decent coffee.\n\nOtherwise it has a lot of space and working Internet.", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "I'm changing my review based on new interactions! I had had a really upsetting experience connecting to the internet, but it seems like they changed the way you connect, and everything is fine now. It may have been a bad day and everyone seems nice now. Plus they are very clean, really really clean and the music is amazing; its like Gen X Easy Listening:\n\nSmooth Operator-Sade\nPower of Goodbye- madonna\nTime after time - cyndi lauper\nWould I lie to you - eurythmics\nEnd of Innocence - Enigma(?)\nI wanna fall in love - Chris isaac\nThompson Twins (something)\nSting - if i ever lose my faith in you\nWith or without you - U2\nOne way or another - Blondie", "author": "Carrie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "Ridiculous to have a $5 minimum if you have square! If someone wants to order one coffee just let them, it will cost you business. Don't really like the coffee either.", "author": "Vincent V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-03", "description": "I used to patronize this spot as a courtesy to the neighborhood; decent coffee, sandwiches, drinks, pastries, and the like in the hopes of it not one day turning into a Baby Gap. I don't have a baby but Baby Gap doesn't sound so bad any more.  \n\nI may not know the owners by name, but the two women who are always there I'm sure have enough facial recognition skill to realize that I live in the neighborhood and at one point would go in about once a week.  \n\nSome months back I was doing my laundry next door and decided to go in and relax for 20 minutes while my clothes were drying.  I do not freeload at coffee shops, most especially, the ones which are local family businesses.  I was about to eat dinner and thought it prudent to buy a water and banana, and spend the remainder of time trekking through Email City....\n\nNot even 10 minutes after finishing my banana did one of the proprietors shoot me some epic stink eye, waltzes over and says: \"Are you waiting for someone here? If not, in order to stay, you have to buy more stuff\".  \n\nMy shock was matched by the expressions of people around me.  I was embarrassed for myself, and the gamut of looks on the other customers' faces was everything from sympathy to anger.  I quickly left and haven't looked back since.  \n\nAs a small business owner it isn't necessary to learn your regulars names, or even what they usually order.  What is necessary though is having the decency to treat everyone that enters with an ounce of respect and realize no matter how little or great of quantities of product they decide to buy on a given day, If you do right by them you gain a customer for life.  Sadly I won't be one of them.", "author": "Ovidio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "Coffee is nothing special but cheap for a breakfast bagel if your passing by. Sandwiches are tasty too. Usually filled with people on their laptops and open all hours, just don't expect a great cup of coffee.", "author": "Allie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "wifi password: maxcoffee\n\ngreat food, simple cafe, great place to do work, fresh squeezed OJ is a plus", "author": "Emehleigh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "Just awful. \n\nIt's hard to believe, with so many good cafes in the neighborhood, that Maxfield's can survive with its mediocre products, inflated prices, and the owners' contempt for customers. \n\nThey can continue to impress others with their supercilious demeanor and gloomy atmosphere, I won't be back.\n\nI'll be happy to bring my business to the much more alive Dolores Cafe, or friendly Morning Dew, both within a minute or two walking.", "author": "Jonah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "The cashier was aggressive and rude about telling me to leave just because I did not make a purchase from their establishment. All I was doing was waiting for my laundry to finish next door and thought I could do some studying while I waited.\n\nJust a heads up, don't bring anything that isn't from their store or they will kick you out without even being courteous about it.", "author": "Reymark R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Had the privilege of being able to work off-site today and I stumbled upon Maxfield's in an effort to find free wifi. What you will find here is a nice neighborhood cafe with the usual coffee products, sodas, sandwiches, muffins/cookies and beer. What was truly nice about this establishment was the reliable wifi and the abundance of power outlets! I found the place to be relatively quiet on a Wednesday morning which helped my productivity. Outdoor seating is available as well. \n\nIn terms of the food, I enjoyed their avacado sandwich.  At $6.75 I thought it was fairly priced especially with regards to their portion size generosity. Note that their credit card minimum is $5, which is fair.\n\nRegarding overall ambience, it isn't the most modern of designs, but it gets the job done. The inside does get a little warm, especially on a nice sunny day during the middle of SF Indian Summer. \n\nIn general, I would recommend this place as a great spot to hang out for a little bit, enjoy some beverage, and maybe get some work done if you're focused enough to do so.", "author": "Kavi D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "This place is a good spot to kick it, WiFi, study nice area but I simply ordered hot latte with caramel and the batista \"Steve\" took my order did not smile, was very inpatient and when I got my coffee it was iced, did not have caramel so I think I will take my business elsewhere. Need better batista and smile a little.", "author": "Roniel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-27", "description": "Great location, plenty of room inside, but the service is horrible. Baristas will treat you as if they're forced to serve you.\nThe food, drinks, and snacks options are decent, but like many other people said, the staff is extremely rude. Just a suggestion to the owner and rest of the staff... It wouldnt kill you to treat your customers nicely with respect and with a smile :-) try it out... Im sure it'll help your business and you'll get better tips!", "author": "Miguel A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "Worst service for a simple cafe spot.  Too bad since it's such a good location.  Walk over to church st and market st to Church street cafe for better coffee, food, ambiance, and most importantly CUSTOMER SERVICE.  Maxfields if u wanna keep a good cafe in a good location hire better baristas to run your spot.", "author": "Kalia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-20", "description": "Location location location\nGreat place to sit outside and people watch.\nCoffee is not bad, but their sandwich are great.\nFresh oj is also yummy.", "author": "Tsu C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Great neighborhood coffee shop and very reasonable prices. I ordered an iced Americano and it's good but a pretty weak, I'm sure you could ask for a smaller cup or less water if you like your Americanos stronger! Only $2.45, which is a steal compared to most coffee shops in the Mission. The breakfast sandwiches also look legit, I'll have to try one next time.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-21", "description": "They have a wide selection of drinks and snacks, but the items I've bought have been hit or miss...\n\nSoy Latte:  Hit\nChai Latte:  Miss\nCream Cheese Muffin:  Miss", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Little gem in the mission great for studying or catching up with friends. The wifi always works, the drinks are affordable and the sandwiches clean and tasty! There are lots of tables and there are windows with great light so you don't feel like you are indoors. Remember to bring cash for purchases under $5! Only bummer is they could beef up their cappuccino making skills.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "I'm a regular at Maxfields and I really like coming here for the following reasons.\n\nLots of drink options: They have your standard coffee drinks, a wide selection of bag teas, bottled drinks, fresh oj, beer wine and blended drinks for people who are into that sort of thing.\n\nSolid food:  The have good breakfast sandwiches, standard lunch sandwiches, bagels, wraps,  fruit, and pastries. Some people have complained about cookies being stale.  They don't make their cookies, they get them from local bakers so I don't quite understand that complaint. All the cookies and pastries are wrapped in plastic or covered so I think Maxfield's is doing their best to preserve their freshness\n\nLots of natural light: The front of the cafe is almost all windows so natural lighting fills the space until late afternoon/evening when the overhead lights fill in. The natural light is great when I'm reading books and is nice since I'm on my laptop most of the time i'm there. \n\nLots of seating: they have a good variety of seating, small, medium and large tables and a few couches that can meet the needs of individuals and big groups. \n\nLots of power outlets: Like I mentioned I work on my laptop and it is very rare when I can't plug in if I need to.  Power is accessible from almost every seat in the cafe save a couple. \n\nFree-ish wi-fi: The wi-fi is free for customers and reliable. Once in a blue moon the internet will slow down, usually when the cafe is full of computer users, or just hasn't worked but the staff have quickly remedied the problem when it's brought to their attention. The wi-fi seems to be an issue with some reviewers  so i'm going to reiterate what I said before, the wi-fi is free for customers. This means if your buddy shows up and whips out his macbook the staff is going to ask him to buy something.  This is a reasonable request.\n\nSolid service: Morning, afternoon or evening the service is quick and accurate.  The only time my order gets delayed is when a few people before me have ordered espresso drinks or there are a bunch of sandwich orders before mine.  And when they aren't busy they will even bring your food to you if they know where you are sitting.  \n\nThe comments about the baristas being rude or that they hate their life are way off the mark.  Sure some of the ladies that work here can be curt but its a cultural thing.  They are not trying to be rude but they are also not going to coddle you, hold your hand while you order and become your BFF the first time you walk in the door.  If you want that kind of place this isn't it.  If you come here regularly and you want to chat and get to know them your're going to have to initiate things the first few times.  \n\nUltimately, Maxfields is an unpretentious neighborhood cafe that has everything I need during a days work and the more I come the more I've come to enjoy the people who work here and the the regulars who help give it its particular character.", "author": "Eric Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "Maxfield's is a cozy coffee shop in a popular area and around the corner from Dolores Park. Its a great place to pick up some cold drinks and sandwiches. Inside you'll see some cool decor paintings paying homage to old school Cartoon Network-style drawings, and they offer Wifi for customers as well.\n\nI usually opt for a caramel macchiato (a perfect balance of sweetness and coffee) or Vietnamese iced coffee, but their drink options extend beyond coffee. The staff who work behind the counter are always friendly and efficient, and they recognize regulars who live in the area.\n\nIts a great change from the same old copy-and-paste chain coffee shops - you won't be disappointed.", "author": "Felix C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Best BLT ever. Fresh, clean and the staff is laid back and nice. Easy parking and wifi too.", "author": "Dominique R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Not over the top or exceptionally unique but still sweet and charming. In the nook of the Mission without being flooded by overzealous weekend energy. The perfect place to park my seat and settle into some tea while catching up on homework and people-watching.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Great coffee and fresh orange juice.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-19", "description": "Very disappointing.\n\nI tried two items at this spot:\n\nPeanut Butter Chocolate Chip Cookie - not good at all: dry, somewhat flavorless and no real taste of chocolate.  Usually when I buy something, I'll still finish it, but it really wasn't worth the calories.\n\nThai Iced Tea - another disappointment...it had the basic flavor one would expect, but it definitely wasn't sweet enough...it really tasted like tea with some cream.\n\nThis place is pretty big and with the tall ceilings, it makes it seem even bigger.  When you first walk in here, you feel like you're stepping back in time to 1991, when most coffee houses looked like this...it just doesn't work for what's current in San Francisco.  There is some outdoor seating, which is nice on a sunny and warm day.  If you're coming here for to relax and read, I'd say stick to the bottled beverages since the two items I tried were not very good at all.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-14", "description": "Very rude owner. Went there 3 times in 3 days and every time I needed to use the restroom, some idiot behind the counter would ask me: \"are you a customer?\" with a suspicious look on their face. Great way to treat people. \n\nToday, I told them that I was no longer a customer.", "author": "El P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-01", "description": "As several other reviews have mentioned, the service leaves something to be desired and the food and coffee isn't good enough to make up for the poor service. \n\nI'm a semi-regular here simply because I live so close, but I'm never treated like one and there's no sense of community here like there is at the many other coffee shops in Mission Dolores. After a negative experience with the owner and barista, I've finally decided that I'm going to be avoiding Maxfield's for good.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "Airy big space with lots of windows for sunlit studying. I think of it as Mercury Cafe and Church Street Cafe's love child. \n\nDecent coffee, though the asian ladies working the counter seem ready to assert their surly selves. \n\nPlenty of seating, lots of outlets, free wifi. DONE.\n\nBathroom graffiti is also kind of awesome. Highlights are \"East Bay people are the best...for me to poop on\" and \"I am a Cathedral.\"", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "cute, busy, local!  Had a coffee date here (and hell didn't even freeze over) here and the place was buzzing on a Sunday afternoon. I wish I was buzzing since my date was helluva boring. Meanwhile, had a cookie, a little dry, best to sick with the coffee drinks because hell It's a coffee house.  No second cup of coffee and no second date :-/", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "After touring SF Mission Delores, this is good stop to just to grab a cup of coffee within walking distance. No need to move car since off street parking is tight in this neighborhood. Drinks are okay and prices lower than name brand coffee house (starbucks, peets).", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-05", "description": "Agree with the other reviewers on here in terms of poor service with belligerent baristas. \n\nPositives: never crowded, plenty of outlets, relatively quiet.\n\nNegative: Came here on first day and couldn't eat my snack and had to take it outside. Second time, was asked to put my Odwalla juice bottle away. Third time, she came with a scary smile and said \"Here's my policy, you have to order something immediately when you come in, you can't wait to order it\" even though I told her I was going to buy a sandwich after I settled down. \n\nScary scary owners, will probably never come back.", "author": "Susie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Great local spot to get coffee. They have very standard lunch and breakfast sandwiches as well. They also have beer (on tap) and wine, which is awesome. They open slightly earlier than other coffee shops in the area which I greatly appreciate. There is also outdoor seating. Sometimes we do laundry at the laundry mat next door and grab a glass of wine/beer in between washing and drying. This spot definitely has a consistent group of regulars but is never so busy that you cannot find a spot.", "author": "Juliet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "I go here pretty much weekly. It's a great place, casual atmosphere, decent food. Good coffee.", "author": "Asad R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "I live very close and come here probably once or twice a week. They are inexpensive, great location, free wifi and have great food (especially the veggie bagel). I've always had neutral experiences with the baristas. Not friendly but not rude. After reading the reviews I will agree that the woman that owns the place (at least I believe she owns it) can be kind of abrasive. I've seen her be short with people and she's been short with me on occasions. Especially about the 5 dollar credit card limit. I understand that lots of places in the mission only take cash or have a limit, but when you're a coffee shop it really seems like a poor business decision to not accommodate the people who just want their morning coffee. I've learned to bring cash with me or order something to eat with my beverage. Otherwise I think this place is great. The patio is always pleasant and the big glass windows make it a nice location to sit down and do some work. Plus it's never overly crowded like the other cafés directly next to Dolores Park.", "author": "Shmev R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-25", "description": "God forbid that you take a moment to settle in before ordering else the nazi lady in the front will approach you at your table and force you to order something. I'm actually a regular here, but she still doesn't recognize me or treat me like one. So yeah.. if you're looking a place where you'll be appreciated as a customer, don't come here.", "author": "Henry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "I started visiting Maxfield's in April of last year and it quickly became a staple of my San Francisco visits. I love to find a spot, buy a few coffees and a croissant sandwich and soak in the environment. The place is always sunny and full of light. There are local artists featured on the walls in an ever-changing gallery. There is a waling tour group that comes through every day around 12:30, so there's amazing people-watching fodder on a regular basis. And the barista plays an eclectic mix of sing-alongable music that seems to really drive home the carefree and joyful vibe this city is famous for. \n\nThe fare is standard for San Francisco coffee shops, but I truly love the distinct character of this space. Whenever I have 'office' work to do, it always happens here.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-16", "description": "Maxfield's House of Caffeine is a convenient place to grab a cup of coffee and a cookie (I am addicted to the Healthy Nut Cookies) and hang out a bit. Sadly, the service leaves a lot to be desired. Typically, there is only one barista working behind the counter, and she tends to move very slowly regardless of the number of people waiting in line. Of course, this place isn't the place to be if you're in a hurry...it's a place to hangout...surf the net, read a book, or chat with friends. Nonetheless, I am a bit old school and believe in fast and FRIENDLY service. Although the baristas have never been rude to me, they have never gone out of their way to be friendly either. \n\nAs other reviewers have indicated, you certainly will not be wowed by the coffee. But, Maxfield's is a good place to stop for a cup of joe on your way to Dolores Park.... I like to sit outside and people-watch.", "author": "Jerome I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "This a very nice place to either sit down and do work (read: quite and free wifi for paying customers). There seemed to be plenty of seating available, so it wasn't hard to find a spot. I wasn't overly impressed with their Iced Mocha, but the fresh squeezed orange juice was absolutely delicious. Once I tried that, I forgot all about the coffee. I haven't had a chance to try their sandwiches, but the cookies were delicious.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "Following a walk through the old Mission Dolores church, I needed a bit of a pick me up for the afternoon. While aimlessly walking around and searching for a Starbucks, I happened upon a sign that said, \"House of Caffeine.\" Much like a (self-proclaimed) trendy teen to an A&F store, I gleefully hopped in to get a cup of joe.\n\nAmbiance was like a hipster coffee shop where I would expect beatnik drums and poetry at night. The coffee was a cup of sludge - the brew so strong that even a spoonful of sugar didn't even pierce the taste of the brew. Don't take it as a complaint - it was exactly what the doctor didn't order, which for those who know me for more than five minutes can attest, is exactly what I will go for. \n\nNot a very accessible place unless you're from the neighborhood, which I'm sure the folks sponging the internet prefer, otherwise it would get a higher rating.", "author": "Jake K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "This place has everything...tea, coffee, beer, food, and more importantly, *vegan* baked goods. Also it happens to be near that huge patch of green where herds of people congregate everyday. That being said, it's usually pretty busy and you might not get a seat if you're with a few people. But grab a coffee or tea and some food to go anyway, because you know you want to hang out at Dolores until the fog starts coming through.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-27", "description": "All the women here are equipped with the worst attitudes and facial expressions. I swear that one of them have a permanent scowl on. It sucks because it's such a cool coffee shop to chill and do homework at. I know several people who have had terrible experiences with these ladies and swore to have never come back.\n\nYou could be the sweetest customer coming up to order something and they still wouldn't return a smile. They look like they hate their lives and they hate you.The menu is very limited, sandwiches are okay but nothing for vegans/vegetarians/gluten-free eaters. There's no healthy alternatives and the only thing that's pretty decent is the Odwalla and teas (very limited still). \n\nI'd skip this place and go down to Church Cafe.. wayy nicer people and a good place to study.", "author": "Leelee E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-31", "description": "Before describing how good the coffee is here I must say that I have been astonished by how rude the owner is. This place has the potential to be one of the top coffee shops in San Francisco but that could start only as the clients are treated in a different way. Once that happens, things will be different. As I said before, this place has the potential; great coffee, great food, great location, but still service has not been able to match the positive things.", "author": "Stacie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-13", "description": "The two older women who work there have a lot to learn about customer service and diplomacy. In the hour I was there, I witness them go up to customers who just got there less than 15 minutes to ask them to order something - both customers were getting settled and was getting ready to go order. I understand they want to make sure people don't come just to use their wifi but there's a way to say these things without being rude. I don't want to give my money to a place like this. Yuck.", "author": "None o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "pros: outlets, daylight, long hours, lots of food & bev options including beer, spacious w/plenty of seating.\n\ncons: a little noisy, you might hate the music (if you hate Enya, which I don't), 1/2 of the ownership team seems a little surly. place gets overrun with kids for a couple of hours on school days. the kids are mostly cool but they can be a little loud and a little distracting. but mostly I'm happy to see kids sharing spaces with adults--it's good for everyone.\n\nseems pretty dog-friendly. please bus your own table - there is a tray for pete's sake, and these women aren't your mothers. \n\nfurther,\nI haven't had any problem with unfriendly service. these women work day in & out so I am not horrified when they treat me as another anonymous customer. yes, it knocks off a star, but it doesn't make for a BAD experience. for what it's worth, taking a moment to say \"how are you?\" might get them on your side. it also helps to be a regular customer.", "author": "Ariel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "A place to go when Dolores Park Cafe and Mission Beach and Tartine and every other pricier place in the hood is overstuffed with strollers seeking refueling after a  session on the new Bellagio-sponsored play experience in what was formerly known as Dolores Park.\n\nMeaning it's unpretentious, there's always seats, it feels big and chill, and the BLTs are good.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-15", "description": "No matter what pastries are served or how cute this place is...and it is....the woman I met today behind the counter HATES HER LIFE. \nThis was my first and last visit to Maxfield's. \nNo eye contact whatsoever. Did not even ask what I wanted. Just walked up to me after tidying and pretending I was invisible for a bit and stared at me. \n\nSadly, this place has a great atmosphere and is being run by Debbie Downer. \nMy coffee was great.", "author": "Melody M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-24", "description": "It is a great stop to read and write or just to meet a friend. Lovely big windows that allow so much brightness in. Good selection of drinks and a decent food selection of snacks.\n\nI have to agree with previous posters I do find the superiority complex exuded by the main owner/worker very jarring. It put me in a bad mood, I don't like that anyone thinks they can behave to someone like that. It's just not on.\n\nThe other lady was very pleasant and even brought my coffee to me as the other guy decided not to call out that it was ready and it was left there for several minutes. He basically picks and chooses who he will be nice to, no consistency and I am too old in the tooth to play those peer pressure games of trying to be friends with the cool kid.\n\nAnyhow I would return again as it is a great spot. Coffee is good. Wifi is fast. Right beside a laundromat, Dolores park and near public transport.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Coffee: not my favorite \"cup-o'-coffee\"\nService: pleasant enough\n\nAs I sit here writing this review on my Mac, there are 11 others in the cafe, also typing away on their Macs. Talk about being part of the mainstream here. It must be the free wi-fi and the relaxing atmosphere. It's a sweet little corner cafe, light and bright.", "author": "Heidi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-31", "description": "The people working here are rude as hell. I've worked around the corner for years and I really do love their apple cider, but these two ladies who run the joint have completely ruined any chance of me stepping foot in here again. Last week my boyfriend and I went in to grab a drink and get a bit of work done. I went up and ordered, got my drink, and sat back down. Then I realized I needed the wifi password so I went back up to ask for it and the lady said, \"Is that man with you going to order anything? I can't give you the password if he's just sitting there.\" WOW. He was still getting settled and hadn't had time to get up to order yet.... Talk about not caring about your community. I've had a few other rude encounters with them before, but this is the most recent. Ugh. I want to like Maxfield's so much but they make it difficult.", "author": "Gabby T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "convenient location, menu isn't too pricey, decent food/drink, and relatively spacey inside.\ncool mix of characters: people catching up with friends, and also people catching up with work (laptops, books, etc). \nlocals and tourists alike mingle in the peaceful ambiance here, where classics play on the radio for a lowkey vibe. I'm writing this review as I creep on customers head-bobbing along to Hotel California & Lennon's Imagine.\nyes, the staff isn't the friendliest, but there are lots of outlets and free wifi for studying. \n\nwarning: cash only, but they do have an ATM", "author": "Tuwie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-26", "description": "Chai latte tastes super weird, bagel sandwich fell apart when I tried to eat it and the lady yelled at me when she got my order wrong. Too bad, this place looked promising.", "author": "Maddie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-21", "description": "When working at home has devolved into a loop of refreshing facebook every 10 minutes and doing unnecessary housecleaning or snacking, Maxfield's is a great place to go to get sh*t done.  Free wi-fi, plenty of plugs, decent tea selection, and lots of other people quietly working, providing the perfect level of judgement to keep me focused on finishing my work and off of shopping sites. \n\nCash only. The music is spot on for working, although the tables are a little close, so it's pretty hard not to overhear your neighbor.  Bring headphones if you don't want to get all up in their business.", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "Good coffee, great atmosphere. I mostly spend my time at cafes working from a laptop, and Maxfield's is the place I go to most in the Mission.\n\nThe WiFi is reliable, it's easy to find outlets, and the coffee is pretty decent. Is only a couple blocks away from Dolores Park (and Bi Rite Ice Cream!) or the 16th & Mission BART station. It's open decently late (9pm as of 1/7/2013) and the staff is friendly.\n\nEDIT: Whoa, what's with the negative comments about the staff and service? They've always seemed pleasant enough to me.", "author": "Al S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "I had a two day training thing I had to go to for work and I was still a little sick from the cold I was battling all week and needed much more coffee to make my morning manageable, found this place a block from the training site. Ordered an almond milk latte, the espresso is a bit thin, and my almond milk was a bit over steamed......but at least they were NICE unlike a score of other places in the Mission where being a barista gives people the \"right\" to give you a huge serving of attitude with your coffee, so bravo to you guys for being normal.", "author": "Bertamus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "I stopped in for a quick iced coffee after an afternoon at Dolores. The lady behind the counter was very pleasant. The coffee was tasty and did the job. I hung out on a couch for a few minutes before we left to catch a train.  \n\nA nice coffee shop full of talkative people. I really like the huge walls and vaulted ceiling. Very comfortable.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-04", "description": "Getting a job in order to relocate to San Francisco is the easy part. The tough part... finding housing. My weekend of sublet hunting, while looking for a temp place, finishing up my old job, and trying to pack and move, brought me here on a recommendation from someone whose place I'd just viewed.\n\nI owe them a lot of gratitude for them letting me sit here for hours, obnoxiously on my phone and laptop, taking up valuable space as I scoured craigslist and made phone calls in the search for my perfect place. Did I mention free wifi and outlets!? All I had to do was buy one measly, inexpensive large chai and the staff, who were friendly when I ordered, didn't bother me at all.\n\nCash only, but since the beverages are inexpensive this wasn't a bit deal. I ended up not taking that sublet but think fondly on that visit due to the introduction to an internet freak's coffee house dream.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-28", "description": "Maxfield's is place of standard fare with a name that boasts of great promise. It's nothing fancy, just straight up food and beverages at low to decent prices. The space is a little grungy from being worn in and the service is terse. I like that it's quick and easy, but there is nothng that stands out and it's certainly not a place I look forward to going. Just a place you happen to stop in for its convienence. The coffee's alright. There's a good amount of seating indoor and outdoor. The biggest plus is the free wifi.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "I'm sitting here now facing the wall where there's a small sign that says: \"if you are going to use our free wireless network access for an extended period of time, please remember to continue making purchases....\"\n\nI think that's totally fair. I use to spend hours at places like these, surfing the net...I buy stuff, but others just take up space. Bravo.\n\nI'm here for one reason alone. I found parking at the Mission Dolores area. It must be a miracle.\n\nThe park across the street, the Mission behind us, it is no wonder it's been difficult for non-city people like me to ever hang out here. It's crowded, some seats along the walls, some small love seats, tables in a room with high ceiling. It's definitely a reason  why people would like to to sip their coffee, drink their tea and eat their food, while surfing the net.\n\nIt's a cool neighborhood cafe.", "author": "Reyz A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-21", "description": "Lady behind the counter was rude, cheap, and inhospitable when I asked about wifi service immediately after I paid for a drink. I had not even received my drink yet. I live in the neighborhood, and have been several times before, but I will never go back again.", "author": "C. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "I like this place. Decent coffee. Friendly staff. Power outlets. Good internet speeds.\n\nhttp://www.speedtest.net/result/2767047287.png\n(If Image doesn't last - 12mbps download, 2 mbps upload)", "author": "Jason H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-05", "description": "Everything was alright with this place. It doesn't really stand out in my eyes. Coffee is a bit weak. I actually got sleepy while sipping my coffee. Outdoor seating is comfy, especially under the tree, although you'll get tree stuff falling on you all the time. Still much better than the indoor seating because it gets really hot inside, and KL said it smells like BBQ chicken. And it's full of apple snobs. I think KL and I are the only ones with dell laptops there. I didn't get a friendly vibe from the baristas. So, minus a star there.\n\nOverall, the free wifi + outdoor seating + dogs= 3 stars.", "author": "Ari C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "If you order a medium latte to drink inside Maxfield's, the size of the mug they give you is no different than that of their large. As one of the baristas told me, the size is a secret discount for the regulars who come in here all the time. Their chai tea is a perfect blend of sweet and spicy unlike other cafes in San Francisco where the chai is too much of either flavor.\n\nMaxfield's is located in one of the best neighborhoods of San Francisco. The area is peaceful but the cafe is a perfect midpoint to where you have to get going. Valencia Street, Dolores Park and Church Street Muni are all a couple of blocks away. I also want to stress the word 'quiet.' It is extremely nice to sit outside and have the trees on Dolores Street be my focal point instead of the hoards of passersby on other streets.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-15", "description": "My plan was to come to Maxfield's on a particular day of the week, every week, to get serious writing done.  The plan did not work.  I did it twice--two weeks in a row, actually--but I haven't been back since.  That's a bummer.  The plan for the other particular day of the week is working out a little bit better, and I think that's because the other location* is a place nearer and dearer to my heart, although that's not technically true because my heart (and my entire body) reside only about a mile from Maxfield's while the other location is way out by Ocean Beach.  It just goes to show that the best laid--I know, I know; it doesn't help one's creativity to needlessly and carelessly quote quoted quotes.\n\nThe food is all right.  The people who work here could be friendlier, but then so could the clientele.  This seems to be a hotbed for people looking for jobs.  The last time I was here, I eavesdropped on three separate job-interview conversations.  One guy had already been offered a job, and he seemed to be holding out for more money.  After that conversation ended, I listened to him explain to his brother that he had been looking for a job for three months and that he was terrified that the place would balk at his hard bargain.  I have all kinds of opinions about that, both positive and negative, but I was impressed by the guy's confident wheeling and dealing; there wasn't a smidgen of doubt in the guy's voice.\n\nI'm going to try again, but don't count on it working out.\n\n*It's not that I'm paranoid, but consider my slight mysteriousness an impotent rebellion against the constant need to broadcast where one is and what one is doing at all times.  Honestly, most people don't care.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-26", "description": "The staff are a total turn-off, and the coffee quality is terrible. They go so far as to give you one napkin at a time from behind the counter. I only used to go there because it was one of the only internet cafes in the area open later.\n\nCheap about everything and a great example of how not to run and staff such a business.", "author": "G F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "This is my neighborhood internet cafe of choice. However, if I want amazing coffee, then I head down to Ritual or Four Barrel on Valencia St.\n\nOverall Maxfield's is a nice low-key coffee shop/cafe with ample seating options and plug outlets available. It's a great space to hunker down, set up shop, and get stuff done. \n\nDownsides: cash only and sometimes the barista sings loudly to annoying music (sorry).", "author": "becca j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "Great location near the park and far enough away from any nearby busy corridors. I've had both good sandwiches and bad pastries here, so I can't say the food options are reliable but the space is large and comfortable and it doesn't ever seem too busy or crowded. Some of the chairs aren't very comfortable but maybe it's on purpose to discourage camping out too long for free wifi...", "author": "Alex A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-08", "description": "Great place to study when you're not being harassed by the baristas. One of the ladies that worked there approached our table asking one of our friends if she was going to order anything because if not she was going to charge her $1 for every 10 minutes. This is even after 5 of us already purchased drinks. So 5 minutes later the same lady approaches the one of our friends and straight up tells her she has to leave, not knowing that she had a cup of tea in her hand. My friend showed her the cup and she said 'sorry' and left us alone. Quite possibly the rudest encounter ive had in this otherwise friendly city. The positives were that they had ample plugs for laptops and a variety of drinks to choose from (even had Thai iced tea). But the service tanked this place to the tune of 1 star.", "author": "Fernan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "FOOD:\n1.) choc croissant - mmm... \n\n\nSERVICE:\nbustley sunday morning. Free wifi! yay! \n\n\nATMOSPHERE:\nCute, I like it. Fits the Mission. Few out door tables. Number of ppl working on their laptops, doing their own thing, readin the paper. Some dogs chillen outside while their owners sip on coffee n enjoy what precedes a lazy Sunday. 1106", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-22", "description": "Good coffee, beer, wine, muffins, bagels with various spreads, sandwhiches, etc.  Bigger than average cafe, with large windows in the front for reading the paper but still plenty of spots to sit without sunlight hitting your laptop.  Bonus for good location - close to dolores park and the mission, but not to hard to find street parking if you got one of them cars.\n\n3/5 coffee\n4/5 atmosphere\n4/5 food\n4/5 service\n3/5 value\n\nFree wireless - http://www.yelp.com/list_details?userid=mkQ-J4uMULsJvc9V8gMENw&list_id=xJ_tC-4_YAdDCurRxaQBNw", "author": "chad n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-16", "description": "I really wanted to like this place given it's a block away from my apartment.  Unfortunately, it's run by a bunch of sociopaths. \n\nYou will read similar stories in other reviews.  We entered with our year old son one early morning.  As we waited for our order, he approached one of the PCs there and played with the mouse.  The barista - who btw didn't sing (see other reviews) - started screaming repeatedly: \"Sir! Get your kid off of the computer!\".  I was standing right behind my son, and it was clear I'm watching him and won't let him damage anything.  Moreover, the mouse in question was a 2 button, non-optical one, so it's worth maybe $3.  I have never been screamed at like that.  Even a polite request would have been weird given the situation, so such screams were completely uncalled for.  We took our stuff to go and left.\n\nThe place is just not hospitable. There are signs everywhere warning customers repeated purchases are expected if one is to use the \"free\" wifi (as if it's such a unique offering).  They don't have a baby high chair and tables were left dirty long after customers left.  And it's cash only, which I find annoying.\n\nSo aside from service, the food: 2 mediocre cappuccinos and airplane like cold, gummy bagels.  Pretty miserable, if pretty cheap.\n\nIf these guys are banking on a Soup Nazi like attitude, the least they could do is offer quality products.  I know many of you don't have kids and won't care about our experience with the baby, but really, both service and food are bad.\n\nBottom line is that in a neighborhood with so many other choices, there's zero reason to go to Maxfields.", "author": "J.G S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "This has pretty much everything you want out of a coffee shop: ample seating, interesting (but not disruptive) clientele, copious caffeine options, and free WiFi.  The food options are good, but not mind-blowing (I'm kind of a foodie snob. I own it.), so while it was definitely a great and convenient option, I didn't have an oh-my-god taste bud experience.  that said, I didn't have the entire menu, so that judgment is somewhat skewed.", "author": "Amber G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-03", "description": "Shut up, shut up, shut UP ALREADY!!!\n\nI can't believe there are so many reviews from people complaining they couldn't use the WiFi without purchasing something (HELLO, you are taking up a seat that a paying customer could occupy) and only a couple of mentions of the INCREDIBLY ANNOYING Barista who not only sings along to the music (I don't have a trouble with the pop he plays), but at the top of his lungs. Brace yourself when Madonna comes on, and bring your earplugs. \n\nMy husband and I come here because of the reliable WiFi, the airy atmosphere, and the decent food. It's nice to have the flexibility to come in the morning for a breakfast bagel, in the afternoon for a sandwich, or in the early evening for a beer. The food is always fine, and cheaper than in a place like Cafe XO. \n\nBut seriously, the Barista and his incessant singing ruin it for me. If he would just STFU I'd give Maxfield's five stars. How can the owners not realize his \"perfomances\" are off-putting to customers?", "author": "Carole M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "Other yelpers are right on about the service. The guy working the counter, perhaps the son of the owner, isn't the most personable in the world. Barely audible. Thank you isn't part of his vocabulary. I felt lucky to get an explanation as to why I was charged $0.50 extra for my sandwich. What's that? Because I wanted tomatoes on my sandwich? Not cool on so many levels.\n\nA solid two star yelp took a detour when I got my sandwich. Wow. Turkey with cranberry and apple slices packed on wheat bread. This was an excellent sandwich, and even with the tomato surcharge, felt like a deal for six bucks. \n\nAmericano on the way out was solid as well.\n\nTwo stars for the not so friendly guy taking my money. Four stars for the awesome sandwich made by the not so friendly guy's mom (I think). Let's go with three stars for the yelp win.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-15", "description": "Ever since SF has upped it's coffee game it's hard to go back to coffee shops like these that were popular when Pearl Jam was. This place brings back 1993 in a hard way with grafitti in the bathroom and on various chairs and tables.\n\nIf you are a techie though, you suck it up and hang out here because for some reason some of the best hackers in the world cannot tell the difference between good and bad coffee.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-05", "description": "Not your friendly neighborhood coffee place. This morning the only guy that was working there was scary mean. He was an angry man. I walked in carrying my preschool age son who couldn't make it home in time to go \"number 1\" and I asked kindly if he could use the bathroom. He was obviously not happy and when I turned the corner, he yelled at me in an angry man's voice to get the key.  In Europe (and I am American) they understand that we are human beings and have to use the bathrooms but here it seems if you are out in public we would rather you pee on the street or in your pants. Look I hate to clean bathrooms too but then get another job if you hate working with humans. I would have purchased something even though I didn't need anything because that is what city business expect to use their bathrooms but I didn't have my wallet. Ran out! So...really mean angry man, he is a toddler, we are clean, and NOW I will never be a customer in the future.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Great place to grab something to eat and a coffee. The place is spacious with great seating and free wifi. The shop now accepts credit cards.", "author": "Ana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "Free WiFi....check\nAmple outlets to plug in laptops to access said WiFi...check\nReasonably priced coffee... check\nGreat bagel/egg/cheese breakfast sandwich...check\n\nI mean really, what more is there to want from a coffee shop? The atmosphere is open and airy and the location is a few steps away from Dolores Park. 2 thumps up (and 4 stars) for Maxfields!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "A lot of cafes around this area cover up their plugs on purpose, Maxfield doesn't. There's a lit of seating, plenty of plugs, and decent food. Great place to get some work done on the laptop.\n\nAfter you're done, head out to Dolores park 2 blocks away.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "The place has style and a healthy sense of irony. The coffee's forgettable except that it doesn't hold back on the establishment's eponymous ingredient. I like most of the music they play. Added bonuses include a fun staff, friendly (well-caffeinated) customers, and some of the best men's room graffiti I've ever seen. Sometimes I wish this one dude who's on at night didn't sing his absolute loudest, but then I suppose that's my fault for reading in his workplace.\n\nIf someone follows this up with confirmation that the women's room graffiti meets the high standard of the men's room, I'll up this review to five stars.\n\n*In my patriarchal daze I neglected to note that the one restroom is unisex, and therefore all comers may view the fine graffiti. Also, the aforementioned singer wrote back and was a good sport about it. Ergo, five stars. Sweet.", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "My go-to spot in my hood for a quick breakfast.  Their breakfast croissants are absolutely amazing, though I've yet to put my finger on exactly what makes it so good compared to other places.  In any case, it never disappoints.  The fresh squeezed orange juice, though expensive, is also great. \n\nI'm no coffee expert so I can't add much of value in this department but it does the trick for me.  \n\nThe decor it nothing special but it feels comfy and cozy to me. \n\nIn response to people complaining about the sign requesting patrons to make purchases if their going to use the \"wi-fi\", I can't see how this isn't a fair.  I consider this an unwritten rule anywhere I go and use wifi.  I guess some people feel entitled to getting things for free...", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-12", "description": "I've lived near Dolores park and found that I usually end up at Maxfield's on my work from home day or if I need to get some breakfast (My favorite -- breakfast bagel with sausage and cheddar).  \n\nFree wifi, ample electric plugs, cash only, and reasonably quiet.  \n\nThe service is ok -- despite going a couple times a week for 4-5 months, and seeing the same three baristas, I don't really feel connected.  \n\nFor me, I guess location wins (I've gone to morning due, cafe petra, and cafe du soliel and almost always end up just going to Maxfield's instead).", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "Maxfield is about 100 yards from my apartment, and it's kind of great. They've been making me breakfast bagels several days a week for years now and their bagels are definitely among the best in the area. It's also a great place to hang out and work on your laptop or read the paper on Saturday morning.  I can't really speak for the coffee, but they have excellent fresh-squeezed orange juice. \n\nAlso: Stephen the singing barista and his excellent music selections. Just yes.", "author": "Alice N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "This is more like a 3.5-3.8 star place, but I'm in a happy mood so I'm just giving it a full 4 stars.\n\nI am currently obsessed with Maxfields' sandwiches. No idea why. I think it's the bacon they use. The BLT and club are what I usually get and I'm always full and happy afterwards (for lunch). Prices are good and the service is quick and nice. I like how there's ample seating. We usually come here to chill while we wait for our laundry next door.\n\nBasically, when I feel like a simple, well-priced sandwich, I come to Maxfields.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-22", "description": "I used to like Maxfield's for its spacious interior, outdoor seating, reliable wi-fi, and slew of outlets, ready to be plugged away by workaholics on their laptops. Aside from being a great place to work, there are couches and outdoor seating perfect for a chat or board game with a friend. It's proximity to Dolores Park and Bi-Rite Creamery makes it a great place to spend a day working, then playing.\n\nHowever, I had an experience that will never send me there again.\n\nYesterday, a friend and I went their to work on our laptops. Immediately, he bought an iced coffee while I proceeded to work. Soon after we arrived, a woman who I presume is the owner approached me and asserted that if I were to use her wi-fi, I should purchase a drink.\n\nI agree. Normally, I always buy a drink and some snacks whenever I'm at a cafe and I have plenty of times before at Maxfield's. But I had a big breakfast and a cup of water so I wasn't in the mood at that time to get anything. And I also did not appreciate the fact that she applying a lot of pressure for me to do so.\n\nA few minutes later, she called for my attention again. \"Excuse me, are you going to get a drink? Because if you're not I'm going to have to charge you for every minute you use the wi-fi.\"\n\nLet's discuss this. I think its the ethical thing to purchase something if you were to use their space and Internet. However, I don't think it's a good business practice to regulate your whole store, going from person to person to make sure they purchase something.\n\nDoes that create an inviting space? Will it make the customers want to come back again, even if they do purchase something at that time? Probably not.\n\nThis is what I told her and I left. As people increasing use cafes as a space to study and work away from home as I do, it's important and courteous to support the business who offer their space and wireless. I do and I probably would've in that situation if she approached in a less demanding and brash fashion.\n\nI understand her frustration and her point of view, but if she continues that approach I feel like it won't be an enjoyable space for either the cafe's owner or its patrons.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-30", "description": "Maxfield's is my corner coffee shop.  It's not bad, but it's also not great.  I too would give 2.5 starts, but I'm rounding down to match those who rounded up.  \n\nHere's the scoop...\n\nCOFFEE: It's ain't Blue Bottle, It ain't Ritual, but it's also not that swill they serve at the office.\n\nSCENE: Lots of folks on laptops.  Very few folks talking to each other.  Lots of tourists coming over from Mission Dolores.  I really miss Reverie in Cole Valley, where strangers were always starting conversations with each other, creating a real sense of community.\n\nDECOR: Light and airy, with the requisite rotating local art on the walls.  A variety of seating options: inside, outside, and uncomfortable couches.\n\nSERVICE: I've gone to Maxfield's weekly and ordered a non-fat cappuccino eac time.  They've never once said \"can I get you the regular?\"  That being said, the service isn't \"bad,\" it's just not \"great.\"\n\nFOOD: The breakfast bagels are tasty.  Haven't tried anything else.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "OK, I reviewed this place before and took off two stars for the singing barista who sang much too loudly and melodramatically, plus has a terrible need to always play music by Garbage/Shirley Manson.  \n\nThe otherwise hard working and efficient fellow has toned down the theatrics to an acceptable level, so I am adding a star as encouragement. \n\nMax Fields is much more inviting and can have its cake an eat it, too -- a singing barista that is no longer repellent.  Just, uh, play less Shirley Manson/Garbage, please.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "Movie in the park.  Beetlejuice.  Needed munchies.  Accidentally happened upon Maxfield's.\n\nSomehow, at that moment, the one thing missing from my life was a PB & J sandwich.  The nice woman at the counter fixed me up a mean PB & J (although by the way she looked at me and asked me three times what I wanted - it might have been the first time she had heard of such a thing).    BFF, Annalise ordered some kind of veggie wrap thing that looked Ah-may-zing.\n\nMy conclusion:  If you're going to see a movie in the park and want a quick bite, this place is all you could want and more.", "author": "Mariko H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "Got hot apple cider with a cinnamon stick :) needed a little extra spice, (which they had on hand,) but great :) very autumny. My boyfriend got a blended mocha. Best one he's ever had. A bit pricey and the older woman seemed a little tense, but worth the trip. Lots of baked goods. Very cute atmosphere as well.", "author": "Stefanie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-03", "description": "Positives: Beautiful location, generally very nice staff. \n\nNegatives: Gets extremely crowded on the weekends with the kind of people who sit at tables for hours with their computers while ordering nothing.  And while we're on the subject, let's talk about the coffee, since that's (implicitly) part of their name.  In brief, it sucks. It tastes like hot water. You don't have to be a \"coffee snob\" (as one other reviewer put it) to notice that the \"coffee\" here has no coffee flavor whatsoever.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-13", "description": "I enjoy this place because I can get an easy iced mocha w/ soy, or whatever that tastes reasonably decent. I like that I can rely on the wi-fi being up and moving swiftly, as I'm always with laptop in tow.\n\nSomeone said the music could be loud... I agree, and not to be mean, because I really like the guys that work there -- but one guy LOVES to belt out the tunes... LOUDLY. So, if you're bothered by someone laying their own vocals on top of a blaring CD track, I wouldn't go there during the early part of the day. Also, if you hate country music, you may be turned off by the lady's music selection. But if you're like me and can go with the flow (thanks to a great pair of headphones), then this place is A-OK.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-26", "description": "Some of the people behind the counter are psychopaths. I kept going back to give them a chance, though, because I want local places to succeed. But I can't handle the rudeness anymore. And thankfully, I have better options on Valencia now, like Borderlands and The Blue Fig.\n\nOther than the customer-hating service, they do have reliable wifi, mediocre cafe food and drinks (nothing special), sunny room with large windows, a few tables and chairs on the sidewalk. But I recommend you skip this place and go to The Blue Fig. They've got just as many sunny tables and good coffee, AND they are so nice to their customers.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "This is one of my favorite cafe's in San Francisco. It's near Dolores Park, but far enough away that it's not always packed. The staff is friendly and the prices are cheap. The coffee is strong, and it's comfy to sit and work for a bit of time.", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-11", "description": "Maxfield's, no complaints on the quality of food. You are about a block away and walking to you is easy but the things I don't like are that\n\na) The floor is never cleaned\nb) The signs everywhere asking people to keep on buying to use the internet. \n\nI don't use the internet here, but I expect to be able to stay for awhile after I finish my food without having to feel guilty about using the web. That's just me though.", "author": "Alexia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-09", "description": "Meh...   Order a soy latte and it's on the same level as Starbucks in terms of quality.  It's got nuttin' on Blue Bottle Coffee!  Coffee is very WEAK!!!  DH thinks it's b/c of the coffee bean they're using and NOT b/c of the preparation.  The ONLY reason my husband and I went is b/c of the clever store name.  We will NOT be coming back here again!  Next time we're in the area, we'll aim for either 1) Samovar or (if we REALLY want coffee...) STARBUCKS!!!  At least we'll get rewards for it!  :(", "author": "Joanna R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-30", "description": "There is nothing worse than walking into a coffee shop in the A.M. to have your cup of coffee and you ask the clerk, \"How are you doing today?\" and he replies, \"Ugh I just wanna go home.\" Not very positive vibes in the morning. I don't know about any of you but I am really sensitive to people's energies.", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "I first came here last Tuesday, following a 3 hour stunt at the DMV, and a 1 hour muni bus trip with a transfer, during rush hour.  The agoraphobic in me needed a sanctuary to seek some peace and quiet, and most of all, a healthy dose of personal space.  Getting off one stop ahead of my destination, I walked past by Maxfield's -- merely a block from my house, I've seen this place multiple times but never went in, and since there were only 3 people in there, I snuck in and ordered a house coffee and a hummus sandwhich, grabbed a table and started to read my media analysis report.\n\na sense of calm soon came over. the coffee house has a high ceiling and plenty of sunshine (unlike cafe petra down the street which to me resembles a speakeasy that serves coffee, a different type of vibe, and to be sure, not necessary bad.) the Sunlight addict in me is satiated, much like a plant in a greenhouse.\n\nThe coffee was strong and resilient. the hummus sandwich satisfying. I stayed for a bit and made sure to come back. as I was leaving, the coffee dude thanked me for visiting. He's not my boyfriend, but i felt like i just got a hug. \n\nToday, I came back to this coffee house, somewhat broken and curled at the edge, and again, my coffee house (yes, i have a feeling that this will be my house from this point on) takes me in for a much needed retreat into urban anonymity.  My iced soy latte was made quickly, and I found a table next to a lanky & cute boy who is no-doubt also searching for his own oasis of privacy. We're stealing glances at each other right now, or at least i'm flattering myself and thinking he is, while I am. :) \n\nThank you Maxfield's for your deliberately small tables that allows the socially awkward laptop addicted dorks like me to escape the constant pressure to engage proactively with fellow life-escapees.  and thanks for the not so serious coffee, the just slightly ugly clientele, and artworks that doesn't pretend to be more than what it is -- why that mickey mouse shaped skull and bones pretty much matches how i feel on the inside today. \n\nYou Not-cool-enough-for-Coffee-Bar Customer,\nMe", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "Maxfield's boasts super strong coffee on a sign in the window, but let me just tell you, it's more like rocket fuel.  If you're a big coffee drinker, you may not notice the caffeine, but I don't drink coffee very often and after one small cup of this stuff I'm bouncing off the walls.  I can't decide if this is a good thing or bad thing about Maxfield's, but I guess since they warn you I can't hold it against them.\n\nI was VERY pleasantly surprised to see a Veggie Bagel on the menu that includes all of my favorite ingredients for a breakfast bagel - cc, cucumber, tomato, sprouts, red onion.  The bagels are so so, and they don't overload on the cc, which is nice.  They keep the focus on the veggies.  They'll serve it open-faced if you dine in, which makes for a cleaner eating experience and obviously twice the veggies... it's pretty amazing, I must say.\n\nThe only thing that I don't like about Maxfield's is the lack of napkins... they'll give you one with your food, but no other napkins to be found - !?\n\nI appreciate Maxfield's very much and am lucky to live within a few blocks of this coffee/veggie bagel deliciousness.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-31", "description": "A stone's throw from Dolores Park, FREE INTERNETS...cookies & milk for $2.50.\n\nThe barista dude wasn't too friendly, though. Matter of fact...I'm not sure he said one word to me or anybody else who has come to order since.\n\nAt least I can review the place while I'm sitting inside of it.\nYea, that merits 3 stars.", "author": "matt m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-21", "description": "After a solid day of home improvements on Saturday, I received a call from some friends who were heading to Dolores Park for the afternoon. I'd been wanting to do that since I moved here, ya know, just hang in the park and people and doggie watch, but just hadn't found the time yet, so Sunday afternoon sounded swell.\n\nI then left my pad and started heading down Dolores and spotted this place. Hmmm, I hadn't been craving any caffeine-like substances, but hmmm, this place looks kinda cool, oh, okay, why not, what's a little caffeine. I then headed in and it was packed. Groups chatting over coffee, people reading, people actively typing away on their laptops and one guy clearly in an IM chat and laughing, but trying not to. It was a cute scene for a Sunday afternoon.\n\nI then walked up to the counter and ordered my iced tea. Now I can't say that the woman was all that friendly, but she was by no means rude, just sort of indifferent which was kind of a bummer, since nothing pairs better with a caffeine drink then a little smile. As for the iced tea, it hit the spot and made for a refreshing addition to my Dolores Park Sunday. Not sure that I would rush back here again, but if I ever find myself heading to the park via Dolores, I might give them another go in the hopes that their face muscles are looking up that day :)", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-22", "description": "Chill place for Coffee and whatever\n\nJust came here for the first time today.  The totally rainy day made Maxfield's House of Caffeine seem extra inviting.  My friends chose this place to get together for an art collaboration.  The seating is very conducive to getting a few friends together for a quick coffee, or arriving solo to type away on our Macbook (or non Mac :-)  Upon arrival, you will probably find everybody glancing down to their sketches, laptops, or other creative things.  It seems like the coffee served is expressly for fueling your creative mind. \n\nThe coffee is was just good.  Served in a tall mug to-stay, or paper cup to go, it hit the spot.  I didn't try any of the espresso drinks, but my friends have said that they are also good.\n\nIf I lived in the area, this place might be a regular of mine.  \n\nSolid 3-Stars!\n\nAlso, Art approves.", "author": "Shea G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "This is a 5star place for sitting down and working on your laptop.  There is plenty of seating, a good wifi connection, great sandwiches, decent coffee, outlets, and best of all, an all glass front that lets you view beautiful Dolores Street  while you site and plug away.  I'm no coffee snob, so that doesnt really factor into the rating.  They pour it from a premade batch that in one of those insulated dispensers, so its nothing fancy, but they have beer and great freshly made sandwiches and its a great location and vibe.\n\nAlso, its in the mission, so cash only", "author": "Mathias G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-25", "description": "Vietnamese Ice Coffee in the Mission Dolores area?????!!?!?!!?\n\nFree Wi-Fi!??!?!?!!?\n\nThis place is the t*ts.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "Decent, albeit slightly dirty place. However the free wifi, location and large space makes this place a decent place to frequent.", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "After a long afternoon spent jumping around the inside of a bouncy castle at a friend's birthday party in Delores Park, I was in need of a pick-me-up (seriously, how do little kids do this stuff for hours on end? it's tiring!) The sun had gone down & that cool evening wind was whipping through the park.\n\nOn the way to the car, we dropped into Maxfield's to warm our hands & hearts. The barista had just put the Arcade Fire on, so we ordered hot beverages, sat down & recharged. By the time the album was over with, we were on our way.\n\nI'm of the opinion that Delores St is THE best street in SF, hands down. Maxfield's is clean, quiet & warm. The right kind of low key. The kind of low key that befits such an amazing street. I'd love to call Maxfield's my local coffee shop one day (I should be so lucky).\n\nAs an aside, there's amazing graffiiti on the bathroom walls.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-05", "description": "The sun is shifting.  \n\nWe were comfortable in the shade right next to the place, but now the heat is unbearable, for me and the comp.  Luckily they have another table across the sidewalk...right next to the street...but under a tree - it affords another, probably, half an hour?  It's too hot to go inside, so when the sun hits again, I think it'll be time to move on.\n\nIced coffee was fine, and as I said, seating was cool.  Scenery is okay, but not enough people to really people-watch...Ritual was much much better for that.", "author": "Kerrie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "\"House of Caffeine,\" reads their sign.\nNow this is MY kind of place.  Gimme my CAFFEINE!\n \nNice and cozy interior - - and really cool outdoor space.  Parking is not that difficult, or at least, it wasn't for me today.\nCoffee is OK --  their baked goods are pretty decent, though we only tried two things.\n \nGreat place for a first date, or just to hang out w/ one or 2 people for a warm afternoon in San Francisco.  \nService is also friendly.  \n \nI noticed a laundromat next door - - drop your laundry in and come next door to drink some coffee?\n \nAlso - they have beer on tap - - Fat Tire, amongst 3 or 4 others.\n \nThat said - - coffee quality is not as good as, say, Blue Bottle or even S-bucks, Peet's..... but it's still pretty decent, with good prices - and better atmosphere than other coffee joints.\n \nThey also seem to make interesting sandwiches, which I'll try on my next visit.", "author": "Grace K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "If you have to get stuck writing your master's thesis on one of the most beautiful, sunshine-filled, gorgeous days we will have this summer and possibly EVA (not bitter), at least you can do it at an outside table at Maxfield's while watching oodles of happy people with their cute as pie pooches make their way to lovely dolores park to eat, drink, and soak up some rays with their friends (still not bitter).\n\nFree wi-fi, good people watching, decent coffee, tons of outlets to plug into, and a good selection of comfy couch seating and outside tables.  Imagine the stars I would give this place if I wasn't bitter.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "It's all about the flashbacks.\n\nI've only been here twice -- the first time was some months ago when I was unemployed, and the second is today when I am (un)fortunately (not un)employed.  \n\nFor months, whenever I biked by I felt bogged down by the weight of the $2 debt I owed the super friendly coffee slinger -- he paid for my PBR when my debit card refused to work at their inside ATM (it's a cash only establishment).  \n\nToday I came clean, blurting out my unsolicited confession.  He refused to accept my repayment, at least directly, instead proposing that I purchase some of his buttons.  A barter of some sorts, a good deal overall and further evidence of his awesomeness. \n\nMy bedraggled body likes the feel of this corner seat with the cusion, but mostly the music lifts my spirits and makes me laugh: old STP that I \"reviewed\" for the school paper in eighth grade; \"What is Love?\", which always floods my senses with warm memories of the gay '90s.  Nothing I would necessarily listen to or admit I listen to, but nostalgia is powerfully convincing.\n\nDamn this recession ... bring back the love.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-25", "description": "A conveniently located alternative when the ever-popular Dolores Park Cafe (a.k.a. the dyke cafe) is too crowded to tolerate.  Very pleasant outdoor seating and lots of people watching opportunities.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "3 and a half stars?  Really?  I actually like this cafe, nevermind that Ritual Roasters is closer to me and has, admittedly, better coffee.  Here's why:  If I ever spend a significant time at a cafe or a coffee shop, it's to bring up my laptop and do a little bit of work while I nosh on something and have a sip of a latte.  \n\nAnd I like the atmosphere - an earlier reviewer was making fun of the guys playing D&D - and yes, they were there when I was there as well, yelling VERY LOUDLY THAT YOU CAN'T TAP MANA WITH THAT CARD (Magic: The Gathering, anyone?)  But I actually LIKE that in a cafe.  No pretentiousness, just a variety of crazy-ass San Francisco folk all congregated in one place.  When I'm at RR, I feel weird for being chubby and not having a heroin addiction.  It does the job for me, and I'm totally okay with that.", "author": "Ernie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-30", "description": "Not Great, Not Bad, Just there.\n\nI was in town Sunday and just needed a place to sit down and do some serious reading for school. I was in the area because the #2 reason for coming to the city from Santa Cruz is for the amazing burritos of my childhood. \n\nSo we were heading to Doloras Park to read and drink some beer, but the fog was starting to roll on in, so we changed our minds mid stride nd headed in to Maxfields. I'd been there once previously a few years ago and had some soup, but that was really all I had remembered. The fact that I hadn't gone back again, despite being in the area so often probably meant that I did not like it much.  But we went in anyway, I had some tea and played table hot potatoes until finding something comfortable. (The tables are really just too low for the chairs, my back was dying) \n\nEventually I ended up in a comfy chair at the from of the place and was able to get my readings done while the BF used their free wi-fi,and had next to no feelings about the coffee quality.\n\nThe guy that works there is pretty obnoxious. OK, so he does have pretty decent taste in music (although, what what the deal with aqua? I hadn't heard barbie girl since grade school) But he was on the phone often, and with such a loud voice it was hard to concentrate on anything else at all.\n\nOverall, it's definitely not a destination place, but if you are standing across the street and want a nice indoor place, Maxfields isn't that bad.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-01", "description": "The staff is awesome, they remember your usual order. Coffee is sooo delicious. It's just a block from Dolores Park, and yet you don't feel nuts and cramped like in the Dolores Park Cafe. Food is so-so, pastries are average, and the espresso drinks are hit or miss depending on who's working, but I love their brewed coffee, and the atmosphere is *perfect* for working on papers, writing, emailing, or other business. Bright light, quiet.\n\nOh, AND they have a functioning changing table, and a bathroom big enough to get a mom and a stroller and a baby into. A big plus.", "author": "Cate F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-03", "description": "Used to meet a friend here to study Chem.\nIt's very \"neighborhoody\" in that EVERYONE that lives within 10 blocks seems to hang out here.\n\nThey allow dogs to come in, which is pretty cool, but parking is a nightmare in this area.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-25", "description": "One of the best things about Maxfield's is their location.  It has a beautiful tree in the front and has plenty of indoor seating and a few tables outside.  They also have free wi-fi.  \n\nI had a soy chai latte which was actually really good.  I hate it when places make it super sweet and syrupy.  This one was had a little spiciness to it that was just awesome goodness in my mouth.  I was definitely pleased with it.  It looked like other people were eating sandwiches here, but I knew I had to save my appetite for Ike's which is a few blocks from here.", "author": "MissJennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "really nice to sit outside this place and read a book. Its a shame they dont take credit card though.\n\nthey do nice vegan breads made out of assorted veganish stuff. Nice.", "author": "mike o."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "It's a nice big space on a quiet block which I like but the service is terrible.  There is a  guy behind the counter who   always seems to be radiating some kind of disgruntled vibe and the lady behind the counter, possibly the owner, with the reddish brown hair who has no clue about customer service.  I went in today and asked for a half caf coffee with soy.  She filled it halfway with regular and put a splash of decaf in before saying\"We ran out of decaf, you want me to fill it with regular?\"  Actually no.  That's why I asked for  a half decaf because I don't want a whole cup of caffeinated coffee at that time in the afternoon.  So I said \"No\"  she then said very rudely  and looking pissed, \" You don't want it?\" since it was barely a little over half full, I said \"how about a discount?\"  She snapped \"I don't give discounts!\" and turned her back and walked away clearly stewing. The cashier  guy gave me my money back.  \"some customer service\" I said.  The guy looked me up and down and shrugged.  So you thought I should pay full price for a cup of coffee barely over half full because you ran out of decaff and are to lazy and disgruntled to make more? Kiss my ass.  I went to Muddy Waters on Valencia instead where the staff is super nice and always give everyone a smile.", "author": "S. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-10", "description": "It's sticky to the touch. And all I tried was coffee because everything else seemed to be the standard cafe fare. And I'm not even into that whole coffee & cafe scene.\n\nWhat I like about this place is that:\na) the Batista complimented one of my tattoos\nb) the space is pretty cool. and by pretty cool I mean not over stylized like many cafes are with the funky 90's chairs and \"friends\"-esque painted walls in some shade of god-awful red or purple. \nand\nc) it's called Maxfield's House of Caffeine. Awesome.", "author": "Penelope C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "i LOVE this place. \nWhen I moved to this neighborhood a few months ago I searched around for a coffee shop within walking distance to my home. A few places popped up but I chose Maxfield's because I liked the mixed reviews. It seems people either love it or hate it here. After coming here for over 3 months I am ready to write a review. \nMaxfieds is amazing. I come here in the morning to get an iced latte, soy lately. I come here before I go to the park to get iced tea with friends. I come here to meet friends and dates. I come here a lot. Why you might ask? simple, they are nice. Maxfields staff is what makes this place so special. Why others seem to complain about the staff members here who sing I love it. Individuality and loving life is what all people should be about. If you are singing at work i think you have those two qualities down and I like that. Plus hearing a rendition of Madonna's vogue at 8am never gets tiresome. All of the employees here are super friendly and my order always comes out fast... and correct. Two biggies some places fail on. \nAll in all I am grateful to have such a unique, clean, friendly and speedy coffee place near my home. \nMaxfield's, you are the best, don't ever let anyone tell you otherwise.", "author": "Wes P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "The food ain't that great but there really wasn't much more to not like about the place. It's literally 2 blocks away from Dolores Park so its quiet enough to get stuff done but active enough to people watch. The space is huge with full height windows so there's a ton of light helping with the \"I hate that I have to be inside to do stuff but thank god I can see what's happening out there\". \n\nI had their chicken sandwich which was basically a microwaved chicken breast on a chiabatta roll with some toppings. Mmm, chewy. They offer a full coffee selection (don't know anything about that) but they also have a selection of moderately priced beers and an assortment of canned/bottle drinks. Hot day = miller lite!\n\nTopping it off, the place has free wifi and outlets available (granted, they're all clustered in a corner which could be difficult). There are a ton of seats/tables so space wasn't an issue.  \n\nIn the end, the place is great to do what you need to do.", "author": "Jonny Bobby G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-02", "description": "Fantastic place.  Great location, great side walk, great coffee, reasonably priced snacks/lunches, free wifi, and they serve beer.  So far, a five star rating.  Why do I give them only three?\n\nOne minor reason is the TV feeding headlines and ads.  Yeesh.  TV-B-GONE!\n\nBut the major reason is a particular hipster jerk that operate a few of the shifts.  I'll spare you the details of what I just observed.  Suffice it to say this guy's unnecessary passive-aggressive bullshit cost the cafe customers.  If I owned this joint I'd fire that guy.  If he owns any part of the place, he's a fool.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-25", "description": "Not a bad place to go grab a quick coffee before beading over to Dolores Park for some chatting.  The nice thing about this place would be how they have soy milk on the side so you can add a bit to your coffee/tea free of charge and the fact that they have brown sugar.  :)  Downside, the cafe is cash only.", "author": "Anna V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-06", "description": "Free WiFi                   Check\nOk coffee                   Check\nEnough space          Check\nFriendlyish staff        Check\nPeople Watching      Kinda\n\nIt's somewhere between 2.5 and 3.5 so hey, 3 made perfect sense.\n\nTimes visited: 3\nTime spent there: 5-10 mins (I'm a grab-n-go coffee drinker)", "author": "Rich S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-31", "description": "Fuck this place. \n\nI met a client there recently, well more than an hour before they were supposed to close. I asked for a cup of regular decaf coffee (which isn't unreasonable considering it was a little before 8 p.m. on a Thursday night), but I was told, \"Oh, sorry, we don't have any ready, and I don't want to brew a whole pot.\"\n\nFirst, tough shit. I could see if you were about to lock up. But damn, in the next hour or so, how unlikely is it somebody else might want a cup of decaf? \n\nSecond, even if you poured the whole pot out, so what? How much money did you really lose?\n\nThird, points one and two are not my problem. You're a COFFEE shop. Coffee shops sell COFFEE, including decaf. At what point in your schedule should I be sensitive to your concepts of supply and demand?\n\nThen, my client goes to sip his coffee and spits it right out! Seems the milk was completely spoiled. \n\nReal nice, Maxfield's.\n\nOn top of that, when we sat outside, it reeked of sewer system. No, this isn't Maxfield's fault since the smell came from outside the building, but it did serve as an appropriate metaphor for the experience.", "author": "Derek R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "To me, this place is the platonic ideal of the coffee shop. I go there pretty much every weekend. Tasty breakfast bagels (my regular is the bacon and cheddar on sesame). Not too crowded. But I can't lie, the thing that first sold me on Maxfield's is the hand painted signage out front, and the big floor-to-ceiling windows on one side where light streams in and rakes across the tables. Plus, it's a block from Dolores Park.\n\nThe only way it could be better is if it had more board games. Scrabble, perhaps?", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "The most affordable coffee shop near Dolores park, with accessible outlets! Its truly an anomaly. They even have comfortable couches, which seem to be eschewed in most other coffee shops in town. The selection is not huge, but it has everything that matters. The sandwiches are affordable and yummy, and the service friendly. Its not the most visually appealing, but the windows let in a lot of light.", "author": "Carrisa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-12", "description": "This is going to be one of those reviews that is really more like a diary entry that you all get to read, because, well, I really need to keep a diary or write in a journal or WRITE THAT DAMN NOVEL, but instead I am a working hack who only has like two minutes to spew out a review before returning to the grind.  So here goes. \n\nLast night I had some time to kill before meeting a friend of mine at Samovar Tea Lounge (the Sanchez location), so I decided to go *read* at a cafe.  As I pondered my location for said reading I decided that as a single woman I should go to a cafe that has STRAIGHT men for a change.  I love the Castro, but WTF, CAN SOMEBODY PLEASE STARE AT MY BREASTS?!  (sorry) \n\nSo I decided that I would go to Maxfield's.  I've never been to Maxfield's before and it was not too far from Samovar and it was close enough to the Mission Dolores area that I thought HEY perhaps there will be some hipster, writer/photographer with tight pants and a IPhone here that I can make eyes at over my book, The Historian, which is really not very good and which I only bought because it's about vampires and I LOOOOOVE me some good vampire lore (holla Ann Rice!). \n\nSo I cruise into this joint and the first thing that goes wrong is that don't have any decaf. I know, I know, what a pussy you are thinking, and frankly, I think that too.  Every day that I fill my coffee cup up with decaf Major Dickenson's Roast I think, what a pussy you are Claire, why can't you just suck it up and drink the leaded shit?  Then, I have a dark chocolate cookie and have a panic attack, so really we're all better off.  Anyway, \"out of decaf\" leads me to some shitty ass tea, which you really can't fault them for cause it comes in a bag, etc etc. \n\nSo I secure a spot in the corner and turn my attention to all of the guys in the room.  Ahem.  OK so have you ever seen something that you thought was not REAL, in the sense that it's like a scene in a movie. LIke that old lady in There's Something about Mary who is all brown with the crazy sagging tits and you are like, nooo that's a caricature, it's not real?  Well, I saw that shit here.  There were DEF no hot hipsters with iphones and scowls, there was a central table of out of this world dudes playing Dungeons and Dragons. \n\nOhhhh Hell to the Motherf*&king yes there were!  And I could only stare and stare some more as they \"cast spells\" and quibbled amoungst themselves, completely unconcerned that others in the cafe might NOT care about the white or green spell card, or whatever it was they were saying in heated voices. I'm not EVEN going to describe what they looked like because, well, I don't want anyone to think I'm just a nerd haterater, cause I love me some nerds, but these guys really transcended the word NERD. \n\nSo, um, I'll get back to you on the coffee, and needless to say I didn't strike it rich with the hot hipster, and, uh, this is the place to go if you wanna get in on some Hot D and D.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-16", "description": "I went here because it closed later than other coffee shops in the area. They have free wi-fi and a lot of electrical outlets. Also not a lot of people so it's quiet and easy to work. The prices are very reasonable. \n\nCons: First off, it smelled really bad inside. I dunno if it was a customer or it came from outside, but it smelled like feces. Also, the iced soy chai latter I ordered was pretty bad, not the worst I ever had, but definitely no where near anything I would order again. The paintings on the walls are terrrrrrrible, incredibly bad amateur art. The rest of the decor was fine and enjoyable. Nice furniture. Lastly the music the barista put on was God awful! Top 40 radio bull crap from four years ago. Just unbearable, I had to use head phones with my own music.\n\nI might come back again, but it won't be my favorite hang out.", "author": "Maciej M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-23", "description": "I really really want to like this place more than I do.  It just doesn't work for me, but maybe it works for someone else....\n\nFood? Good selection of sandwiches, desserts and they even have piroshkis, which I secretly crave.\n\nWiFi? Definitely free with purchase.  And they even have a reasonably accessible power supply for laptops\n\nGood place to work?  I want to say yes, but the ambiance just doesn't work for me.  The music can be distracting and I just don't feel comfy in the chairs and tables.\n\nVerdict? I'll head over if I'm in the 'hood, but I think Morning Due or Dolores Park Cafe would be my preference.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "Yum Maxfield!\nI feel so cozy there, you usually see a few people with kicked off shoes.\nSteven is so funny, one of the best coffee personalities I have yet to meet in this beautiful city.\nOne block from Dolores Park.\nFree Wireless (usually on, but has had the occasional problem).\nThe Avacado Sandwich ROX!\nAnd they have a few brew on tap, and CIDAR! most smaller places don't have Cidar.\n\nGood Stuff.", "author": "Kellie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "Originally lured in by the beautiful huge tree out front (which never ceases to make me happy) Maxfield's has become my favorite office/coffee house.  The wi-fi is solid and clean.  There are power outlets convenient to most tables and the atmosphere is really nice without being distracting.  Tea is cheap ($1.50 for Numi) and they have a wide variety of fresh organic snacks.  The \"granola oat jacks\" are AMAZING.  Service is super friendly, particularly as a regular.  I'm always cozy and productive here.\n\nYes, I know the coffee is mediocre.  So is the overwhelming majority of coffee around.  If I want coffee I go to Philz or Ritual.  If I want to pay $7 for some amazing tea I go to Samovar.  I come here to work about 2-5 days a week and for that purpose the place is perfect. $5 a day for work space including internet and a snack ain't bad and if I'm having a rough day I can always have a beer instead of tea.  It's a comfortable friendly and consistent place for me to get work done, thus 5 stars for the purpose.", "author": "Rich R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "+punky D&D kids take over corner seats. \n+cushions, free and accessible water\n+bohemia\n-coffee not that great.\n+pastries aight", "author": "Will T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "Nice spot for a cuppa near Dolores Park. More relaxing than the DP Cafe.\n\nThings to enjoy at Maxfields: espresso machine coffee, the light airy cosy atmosphere, pavement tables, free wifi, friendly service (haven't met the grumpy guy mentioned by someone below - I tend to go at the weekend)\n\nThings not to enjoy at Maxfields: the drip coffee (see above)", "author": "Richard B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-08", "description": "Quality coffee house.  Friendly staff.  Good place to work while you sip on cafe au lait.  You'll need to buy something every couple of hours though if you want to work there all afternoon.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-14", "description": "Great coffee shop. Scrumptious sandwiches, free wi-fi and wine and beer for a sunny Sunday afternoon. \n\nOne thing that sets this place apart from all the other coffee shops is the graffiti in the bathroom. From the politically charged to the sexually explicate, it provides entertainment for a good 10 mins while you take care of business. The notes are frequently updated to keep up with the changing times but i think \"Jo.G on baker st has STDs\" will reign supreme for years to come.  \nPure Classic.", "author": "Tak H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "Perfectly likable cafe, and it's just a few doors away from my apartment, which is a huge plus.  Free wireless, warm inside, and art on the walls.  My only complaint is that it's only open until 9:30, which is usually when I've just finished dinner and am ready to go.\n\nIf you're driving (though I'm not sure this is a destination worth crossing the city for), you can usually find parking after 4:30 in front of Mission Dolores, and sometimes in front of the high school on 18th.  Tuesday nights are usually the best because street-cleaning on Dolores is Wednesday morning, so a lot of people have moved their cars.  Weekends you can park in the turn areas between the medians without fear of a ticket.", "author": "Gina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "This is a great study spot. I love the free reliable wi fi.... decent sized tables... chill vibe.... and breakfast bagel. (If you order the breakfast bagel, have them melt the cheese.) The negatives... the people who work here are not friendly at all. I came in to grab a bite before work one day and the guy working the register flipped off a guy who was asking for a bag (as the guy was walking away). Not a nice way to start off your morning.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-15", "description": "Pleasant music.\nBright, airy, but a lot of flies for some reason.\nCoffee was just ok.", "author": "Peter O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-01", "description": "I used to love this place and go here a lot to work, and then one day, I just stopped. Not sure why. The turkey club is really, really good. I miss it. \n\nBut, I think the drawbacks are twofold, if you want to go someplace to get work done:\n\na) the music is totally unpredictable depending on who is behind the counter, and can sometimes be very loud and annoying.\n\nb) the staff sometimes have a negative energy and don't seem to get along with each other that well, which can be distracting to someone (like me) who is sensitive to that kind of thing.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-20", "description": "PLUSES:  *BEER!!!!!!!!!!*; Great Coffee; Good soups & great hummus; varied food selection; Fun ambiance; upbeat music; friendly barristas; lots of regulars\n\nMINUSES: Not enough outlets; wireless drops too frequently; can be fairly hot; sometimes fruit-flies launch a full-on attack\n\n~~~~~~~~~~~~~~~~\nOK. I *LOVE* this cafe.  Great coffee (go for a hot soy latte), every Odwalla juice on the planet and BEER.  \n\nI'm a big fan of the soup -- always tasty, with nice soft buttered rolls. \n\nThe hummus is a good choice, as well.  \n\nAnd oh did I mention BEER???  On tap, and in bottles.  Rock!\n\nBut, the REAL reason to come here (aside from the wifi, outdoor seating, great coffee and the 5-year-old regular) is the afternoon/evening barrista.  \n\nI'm telling you, the music is teh bomb.  Fun, upbeat '90s stuff is on the current playlist.  Plus he's super-friendly and willing to jump around to New Order if you force the subject.  It makes working late a lot more pleasant.\n\nSadly, the wireless invariably drops at least once, if not more frequently, every time I'm there.  This is a royal pain in the ass if someone's trying to get work done. :/  \n\nIt seems hot when you first walk in, but it doesn't take long for the body to adjust and it's actually pretty comfortable, but it does seem hot at first.\n\nI also suggest they change the soup offerings more often & deal with the fruit-fly problem:\n\n1. pour bleach down all their drains\n2. cover the bananas\n3. leave out little dishes of vinegar mixed with dish soap to lure them to a watery grave", "author": "Dina G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-24", "description": "I came here with a friend to study for final exams. The owner and her assistant hovered over my friend and I while we prepared our study materials explaining on more than one occasion that we should buy something, pay her $1 USD an hour or leave. After I explained to both the owner and her assistant that we were aware of the policy and were planning on purchasing something immediately the owner began yelling about how her cafe is not a public park. She then continued on to exclaim that she is (in my own words) a greedy business owner. I've never felt so uncomfortable in a San Francisco cafe. OMG ftp.", "author": "Mohamad B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-15", "description": "I sat down with my friend (who bought a chai latte) and they kept reminding me that I have to purchase something to use WIFI. A lot of hustin for a cafe. It was Friday when there are a lot of seats open! Not cool.", "author": "Charles D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-05", "description": "Beer on tap.  \nOK coffee.  \nMint tea.  \nLaundry next door.  \nFree Internet.  \nOutside seating under palm trees.  \n\nA multi-hour mid-90s 3rd wave playlist?  AMAZING.  Here are some highlights:\n\nReel Big Fish: \"Sell Out\"\nMustard Plug: \"\"Thigh High Nylons\"\nBuck-o-Nine: \"Pass The Dutchie\" (Cover)\nLess Than Jake: \"Sugar In Your Gas Tank\"\nPietasters: \"Maggie Mae\"\n\nWow.", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I ended up here because I didn't feel like going a church nearby with a friend for a Sunday service.   I needed more than a sermon to warm up my spirit on a rainy day.   I needed my third cup of coffee for the day. \n\nGood coffee.  Free wireless.  Spacious and clean.  There are also some vegan baked goods to choose from.  The two old couches by the window seemed ragged yet inviting.   The background music is super mellow - Norah Jones and others alike.   Unpretentious.  Simply cozy.\n\nWill definitely go back if I am in the neighborhood again, or maybe next Sunday morning...", "author": "Shirley F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-09", "description": "I used to be a semi regular here until my most recent experience. After reading some reviews I see that this is a bit of a pattern here.\nSo I brought my thermos in today to get filled as I usually do and I asked for a 16 ounce coffee which is the size of my thermos. \nI specifically asked for a 16 ounce coffee because I have been charged for the largest size coffee they have before because the thermos does look fairly large, however 16 ounces is stamped right on the side.\nAnyway, the women who I think must be the owner took the thermos and returned it literally half full. I told her that I had asked for a 16 ounce coffee and the thermos says 16 ounce capacity on the side and why had she given me a half a cup of coffee.\nShe grumbled something about it looking larger.\nYes this is petty but really are you going to treat customers like this over 8 ounces of mediocre coffee. She then actually filled a 16 ounce coffee cup and poured it into my thermos just to make sure I was not cheating her out of an ounce to two of coffee, Wow.\nWon't be back.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-29", "description": "The windows are possibly the best thing going. It makes for an expansiveness and even indoors on a rain day, feels \"campy.\" Creates a linger vibe when the Sunday Times is in hand or a great book has some chapters yet. But i can't say in this area where Samovar is a close stab for tea, or Philz aint far for strong joe, or Luna Park or Foreign Cinema is serving brunch, I find much behind the counter to bring me back. Someone did say the music is a little loud, and I shall agree. Its a subtle trumpet that will make brainwaves go delta, not one wailing for urgent attention @ the eardrum.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-25", "description": "Seriously, this place knows how to make a cup of coffee, and the refills are c-h-e-a-p!\n\nBy far my favorite place to get a cup of coffee in the mission.  The ambiance, a la \"big open warehouse with paintings\" is great.  The seating is comfortable and plentiful.  And, best of all, the coffee here is really good.  Plus, they have bagels with lox- all the time!  \n\nAnd, no kidding, I've had attentive, polite and fast service every time I've gone there.\n\nThe only drawback that I've had with this place is that they make said bagels with lox like a sandwich, instead of just arranging it all on a plate so that you can fix it how you want it.  And for some reason, they add sprouts.  But that's small potatoes.", "author": "Hannah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-23", "description": "I love the open feel of this cafe, and it has a bohemian charm that is lacking from the Philz outpost on 18th Street.  Of course nothing beats the Philz Turkish, but Maxfield's provides a relaxed, comfortable atmosphere for working on your laptop (free wifi), chatting with a friend or reading a book.  It's doesn't feel as scene-y as Ritual.  Coming from New York, the bagels are pretty disappointing.  Too bready, and when I ordered the mine toasted it came back luke warm.  The cream cheese was slathered on inelegantly.  I haven't tried any of the other food, though the quiche looked delicious.  All in all a great place to hang out, but Philz, Ritual and Blue Bottle are still tops if you're all about the java.", "author": "Earl D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "Good location, really nice place to relax in the weekend, they have some comfy chairs. They also have power sockets unlike Dolores Park Cafe so if your plan was to work, it is really conducive. Coffee ok, hot chocolate - great.\nNice health cookies, great atmosphere, free WiFi, parking is not too bad nearby..... definitely recommend", "author": "Belinda w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "I come here for the wireless, I have no idea about the singing barista but ever since I have been coming here everyone has been really nice. The location is perfect, nice seating outside, although the food is just ok everytime I order food I always regret it. Overall a good place to get some work done...", "author": "Jeanne R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-26", "description": "this place definitely has some things going for it -- location, size (fairly spacious, plenty of tables), sidewalk seating, overall vibe. \n\nwhat it does not have going for it -- at least, not when i visited this afternoon -- was friendly service. i walked up, and the guy behind the counter just looked at me silently. no nod, no \"hello,\" no \"how can i help you,\" not even a twinge of a smile. just a blank, unfriendly stare.\n\nthanks, dude -- way to make a good impression on your customers.", "author": "Elle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-24", "description": "I lived accross the street from this spot for about 10 years.  When it first opened I was nervous that it was destined to become just another boutique-ish yuppie hangout like the Dolores Park Cafe.  My cynical self was pleasantly surprised when it became a super-laid-back neighborhood spot.\r\n\r\nNow that I've moved away, I miss Maxfield's more than I thought I would.  Although the food is generic and the coffee is so-so (although still better than the coffee here in Boston ... Dunkin Donuts as good coffee? What are people THINKING?), what I miss is the location, the people watching, and the convenience.  The cafe itself is bright and airy with plenty of tree-shaded outdoor seating, and most of the clientele consists of folks who acually live around that intersection, unlike the obnoxious throngs of tourists and marina residents that pack the DP Cafe a block away.  People bring their dogs and their kids here, play chess, and do their laundry next door at the star wash.  On weekends they have live Jazz and Bluegrass bands.  Throughout grad school I used to come here in the afternoon on warm days and have a beer while I studied.  Good times.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-04", "description": "BORING.\n\nit's a coffee shop. \n\nthree stars because the seats aren't comfy, the walls had mediocre art, everything i touched was sticky, the coffee's regular, the staff are your everyday hipsters, and the crowd is a jungle of cafe lizards, some immobilized by their laptops, others immobilized by their cell phone.  yawn.\n\nall in all, not that tragic or inspiring of a pit stop.  the place definitely induces apathy.  \n\napathy sounds like, \"BLAH.\"", "author": "Carolyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "One of the best days of my life happened at Maxfields, and for that, I will forever hold it in a special place in my mind.\n\nIn addition, I have spent many a sunny day sipping coffee, chomping on bagels and working under the shady tree outside. And many a not-so-wonderful day inside as well. \n\nI like Maxfield's coffee too. A lot of coffee does a number on my stomach - make it feel like it's burning from the inside out - but not Maxfields. I hear this may be related to acid levels. I have no idea. All I know is that Maxfield's coffee does not do this to me.\n\nFinally, Maxfield's has beer on tap for relatively cheap and sometimes has jazz in the evenings. It's an all around good, unpretentious place.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-26", "description": "I GOT MY LAPTOP TAKEN FROM ME RIGHT FROM MY LAP AT THIS CAFE. For that I'm giving this establishment and my experience a Big Fat 0.  Now, when this happened to me, I chased the inbred shitfucker outside the cafe and one of the employees who caught on ran out right behind me.  He and a random pedestrian grabbed the inbred shitfucker, struggled with him and I got my laptop back. Of course, after it fell to ground and cracked my LCD monitor.  But I got it back.  The kid got away in a convertible waiting outside with 3 other inbred muthafuckas in it.\n\nAnd before I could even let the incident sink in, the owner and a patron inside  were on the phone calling the police.  For this and for my hero employee and pedestrian, I give a BIG FAT 5.  Which averages to 3.\n\nWatch yo shit everyone!  Invest in those cable locks!", "author": "I love t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-23", "description": "Pros:\n1. They serve wine and beer, including a few on tap.  \n2. Free wireless internet.\n3. The ambience... there are four outdoor sidewalk tables in a beautiful part of the neighborhood, and the interior is comfortable with lots of wooden tables and a few couches near the huge windows.\n4. Service is friendly.\n5. They're located exactly next door to the laundromat that I use.\n\nCons:\n1. The wine selection is limited to \"red\" or \"white\", causing me to wonder if I've accidentally wandered outside SF city limits.\n2. The baked items I've purchased have ended up left on top of the garbage recepticle outside.\n3. The coffee is drinkable but pales in comparison to some of the terrific coffee you can get elsewhere in the neighborhood (Ritual is the prime example).\n4. Service is pretty slow for a coffee house.\n5. They stopped selling sangria a while back.  Boooo!", "author": "DemonPixie .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-05", "description": "Located on Dolores and 17th, and there is adequate parking in the surrounding area. \n\nI work a fair bit from coffee shops so my main concerns are having a decent  wireless connection and enough space to sit and work. Both of these requirements are taken care off. There are plenty of tables both outside and inside and the internet connection is good enough for me. There are also a lot of electricical connection points for those who need to connect to a power source for their laptops which is great for me.\n\nI'm not exactly a coffee conassieur but the coffee could be better. However they do have a decent selection of drinks, sandwiches and snacks\n\nPros:\n1. Good enough WiFi connection\n2. Adequate seating\n3. Plenty of seating available\n4. Enough power outlets\n\nCons:\n1. No credit cards\n2. Food isn't great", "author": "Krishnan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-28", "description": "Once again I must reiterate my want to have 1/2 star ratings...I would rate this place at 2 1/2...So I rounded up.\n\nI'm in this neighborhood just about every morning...the few times I've stepped into Maxfield's I've left feeling not-so-great.\n\nI think the main reason for this is staffing - and this is two fold:\n-There is usually only one person working in the morning...so between taking orders and making food & coffee, the wait tends to be a little much.\n-The other part of this is that the staff haven't been particularly stellar in the attitude department. I usually walk in there with a happy face on and feeling pretty peppy, but the response is a rushed, \"take your order and get you out of my face\" kind of thing.\n\nThe coffee is so-so...slightly weak, a bit bitter. \n\nThe ambience isn't all that friendly here...I like to get my coffee and leave. \n\nFood - I've only had the breakfast croissant which was very yummy.\n\nPrices - Hefty. $3+ for a double is a lot IMO. \n\nI'm not completely done with Maxfield's...I'd like to go back a time or two in the hope that they have some redeeming qualities I've yet to see.\n\n...to be continued?", "author": "Sonia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-08", "description": "I am in LOVE with the the singing barista!!!  What a bunch of haters on here, hating on someone who obviously is enjoying life and tries to bring a little fun into your lives!!  You keep it up babe!!", "author": "Melanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "The location is nice, the coffee is good, never had any problems with the people there, but the best thing about this place is they are pooch friendly. My poodle mix can relax at my feet in the cafe, while I drink coffee and check the internet.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "Nice place that is very convenient to Dolores Park and the hipster chaos that lies within -- at least for us this Sunday. My iced tea was more than serviceable. The atmosphere was chill and led to several epiphanies. Adam was happy too. We'll be back.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-04-21", "description": "I refuse to go to this place so I will never know how cool it might be or how amazing the coffee is. Back when they were first opening they went to my buddy Joel's coffee shop, on the same block and asked him for help because they were going to open a corner market. He helped them and told them all about his business. Well, we all know that Maxfield's House of Caffeine was never intended to sell pampers and Campbell's soup. Slim shady owners. So I'm boycotting their ass and you should too.", "author": "Phil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "hot pastrami had huge thick cuts of pastrami......yes yes and yes", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "Always packed with a gaggle of coffee lovers who appear to be studying for their exams. Or maybe just blogging about themselves. Whatever they're doing, there's a friendly university-esque atmosphere to Maxfield's, topped off by the computers offering Web access. I love its proximity to Dolores Park. Delicious pastries and above-average biscotti.  Will also whip up a good sandwich.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-10", "description": "nice to have a place that has good selection of caffeine as well as some alcohol, not to mention some eats. wish the wifi was a bit more stable.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-17", "description": "I would say that Maxfields is just your general non-descript coffee shop in the Mission.  There is nothing about it that stands out in particular, except that it is only one block from Dolores Park, and therefore quite convenient.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-18", "description": "maxfields didnt disappoint me today! it was my first time to chillax there.. since i want to discover more than the dolores cafe, which is a block away from maxfields AND MY FAVE PARK IN THE WORLD! :D yay.. anyways, i had a thai iced tea (taste like any other thai iced tea that i had before.. lol), a veggie frittata (kinda rubbery?), an iced hot chocolate (YAY!), and a vegan oatmeal choco chip cookie! \n\npretty much stayed there and did my school stuffs from 11 up to 4:30ish; hence, the orders that i did! :) \n\nthe cafe is very spacious, and there are tables to sit on, BUT......\ni just have to complain about the outlet for laptops.. they're clustered into one place, which is the whole wooden bench on the wall. the outlets need to disperse! :P ................. wifi is great, and i laave the neighborhood as usual! homey and quaint! gotta go here when sun is up! hopefully when i get back there, i meet a guy there! teeheeeeee.. :3\n\nPS: the guy that works there is SOOO CUTE, but this one time he didnt give me my change, it doesnt bother me.. he's just nice to look at.. and OH! he complements you in an uncanny way! LOL", "author": "Marc K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "When Dolores Park sun starts to give me a few too many freckles, Maxfield's becomes the office. Free wi-fi, deliciously spicy soy chai lattes, the best vegan cookies ever and they never kicked me out for falling asleep on the couch. All this in addition to friendly service and the possibility of a BLT make Maxfield's top notch.", "author": "Tory S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-03", "description": "Free wifi access with no passwords to mess with and copious power outlets: Awesome!\n\nFood and drink selection: Middle of the road\n\nBarista dude singing loudly (and poorly) along with half the songs: TERRIBLE.\n\nThere's a reason I don't sing in public.  This guy needs to discover that reason.\n\nMade me have a strong desire to finish up what I was doing and GTFO.", "author": "Sam E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "Maxfields has awesome food but the the staff members are on the shakey side.Some of the staff members are nice but some are the opposite of nice.The brownies at Maxfields are probably the richest brownies in SF and they taste good dipped in their delicious hot chocolate.I hear that the coffee there is pretty good.Maxfields also has fantabulous rice crispy treats and there is free Wi-Fi connection.Maxfields is also pretty pricey.", "author": "Nikki Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "I'm sitting at Maxfield's as I'm writing this. Jangling cacophony that seems appropriate as the ambiance for a caffeine fix. Dogs, laptops, affable chatter, aroma of bagels, slightly grungy floor, chalked blackboards colorfully suggesting an array of drinks and pastries...and lunch. This is the perfect set for describing the typical SF/Mission coffee house. Everything you expect to find and the expected satisfaction are all here. Good (tho not great) coffee is here. Friendly gals behind the counter. A mixture of music...classic R&B and 60s blues as I write this...is the wallpaper behind fifty conversations. A clutch of tables out front watching the church parking empty out. All is fine.", "author": "Gary C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-23", "description": "The bagel I got here today was terrible and there was a fly inside the display case. The woman behind the counter was pleasant, however the music was a little too loud. I can't say I'd recommend going here.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-10", "description": "This is on my regular cafe circuit, but I only go there when I care more about free wi-fi, ample table space and power outlets, and less about the quality of food.  I like the sometimes nerdy hipster crowd.  Also, the place is full of light and has a few sidewalk tables for nice days.", "author": "Katherine W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-30", "description": "Hmmm...it's a little hot and sweltering in here.  Lots of flies.  It's kinda tropical, with the rattan furniture.  I think I'm in the Philippines.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-28", "description": "just another face in the crowd. maxfield serves average coffee that's indistinguishable from other coffee houses. however, when dolores park cafe gets a little too crazy, maxfield is a decent alternative. this cafe should really deserve 2.5 stars, but i'll round it up to 3 stars cuz it's not as fancy or trendy as ritual and dolores park cafe. i like that.\n\nbonus. if you're at dolores park and you need to go pee and dolores park cafe has a line out the door, walk over one block to maxfield. there should be minimal wait for the bathroom. and yes, you have to buy something.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-08", "description": "With everybody having orgasms over Ritual, lest we forget the real king of coffee shops in the Mission: Maxfield's. Nice out-of-the-way location, but just a block away from Dolores Park, there's solid coffee and food, plus beer! The crowd is pretty much the standard fare as every other coffee shop in the environs: Mac laptops, horn-rimmed glasses, girls with short hair, whatever. But the space is airy, feels homey, and is overall unpretentious. Only downside: who knew that a tuna/turkey/ham sandwich included only one and not all of those meats?", "author": "Kai H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "Great spot, worked here many a day, only problem is that it gets a too crowded.  i guess that's just a city-wide problem, too many laptops in any coffee shop...", "author": "Max H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I have no idea why but this place manages to hold my title for best chai latte in the city. Also, they have phenomenal little breads next to the counter (strawberry, zucchini, pumpkin, etc).  Yup, this place is tasty.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "I've recently been reintroduced to the world of \"having to study\" and Maxfield's quickly became my favorite spot to do so. Good coffee, the music isn't too loud and the ambiance is cozy. The wifi seems pretty fast too.", "author": "Blake R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-07", "description": "I come here with my laptop mostly because it's only a block away and I need a change of scenery from the inside of my office every now and then.  The coffee is okay.  Some days the wi-fi works great, and other days it drops out every 20 minutes or so.  Convenience trumps quality.", "author": "Howard K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-14", "description": "I have to admit, I am sitting at Maxfields right now waiting for a client and I have to say, it is a really pleasant experience.  There is tons of natural light infiltrating the place,  cool people meeting, talking and typing away on their laptops, unique art on the wall, and overall it has a pretty cool vibe. I don't think I would go out of my way to return, but if I am in the neighborhood, I would definitely stop in again.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "very friendly staff. the guy who made our drinks was great, he was singing along to music and was quite pleasant. the mocha was good for a mocha...i am not a huge coffee drinker so it  was ok, i wish it was more chocalatey but maybe I should just get hot chocolate. I got an italian soda after, it was good. lots of flavor. my friend's chai latte was good. i felt at ease. the furniture was an ok comfort. i enjoyed the 90's alternative music..and classics like \"closing time\". it was nostalgic. i was inspired to com ehere and do work on my laptop. i would go back. close to dolores park which is good too and it is good when dolores park cafe is already closed.", "author": "Steph W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "the wifi-nomad, here again!  my last few posts are local cafes with...you guessed it...FREE WIFI b/c that has become my quest as of late...\n\nso i don't think i've ever eaten anything here, i just get coffee or tea, but i like the vibe, i always get a table close to a power outlet, and always see a cute boy or 2 - a nice distraction when i'm working hard on the laptop.  and it's a place i feel like i can go to the john and leave all my shit out and not come back to an empty table.  AND i don't smell like fried food when i step out of this joint (read The Grind review).  just just a block from Dolores Park too...", "author": "Suzanne A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-31", "description": "Nice, open, inviting place.  I love their sun-dried tomatoes cream cheese - but their bagels were bad enough to not enjoy it.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-13", "description": "If you need a place to take your laptop during the day this works quite well. Free wifi, much quieter than that place on the corner of Dolores Park, and with more electric outlets too. Food not quite as good perhaps, but they do have a few beers on tap in case that early morning coffee wasn't exactly what you were looking for. Staff seem pretty friendly.", "author": "Stuart J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-17", "description": "I'm sorry to report that after many visits here, in my opinion it sn't that great. Dull atmosphere, super dull and slow barrista's, nothing special coffee or espresso and (god, is she really the owner? because she doesn't seem to have it together enough for this kind of business.) And after reading Phil M's review all I can say is that this is a good spot to go pee when the line is too long at Dolores Pk Cafe. (like during the dyke march.) My hope for this place is that some other person buys it and makes it better. I don't think D. Pk Cafe will suffer much from the competition.  They're doing well.", "author": "Roanna Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "Wi-Fi's a bit shifty, rice crispy treats are meh but the tea is excellent and the atmosphere is cozy.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-18", "description": "There is so much competition especially in this area so you have to be, more than good , and for me the coffee is the single most important factor.  I've been in this place four times since I moved back here, 2 for 4, \nI got a better than good Americano.  For the record, a standard americano is 2 shots with some hot water.  The barista should ask the customer how much water he or she wants.  Otherwise why wouldn't we just order a coffee?  Twice my drink was served in a porcelain mug and I was asked how much water I wanted so the drink was tasty, good, heavy body, just enough water, just short of an eight ounce cup, some crema on top, not intentional but appreciated.  Twice I was charged for a double americano and was served some brown water in a huge, maybe 20 ounce clear glass, the kind you would use for iced tea or drinking water.\nYucky.  I had noticed that both times the house mugs, nice size for me were there waiting to be filled.  The ladies there are really nice and fast, the guy was kind of dismissive, lots of tables and you can even sit outside and diddle on the net or watch the parade of hipsters go by, so for service and atmosphere it's definitely a 5.  I heard that a stellar coffee concession will be going into Dolores Park, not down for it but maybe I can get  an americano that's consisitently good.", "author": "Teri K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-03", "description": "I love the atmosphere here.  The staff is friendly without being overly solicitous and they do a good job with espresso drinks.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "This is my favorite coffee house in San Francisco because it is a REAL coffee house. People drink coffee and just hang out in a big open space at Maxfields. The Indian wraps and club sandwich aren't too bad either. But hearing Dolly Parton on the cd player is what sold me.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-07", "description": "The coffee shop itself is cozy but the wait staff is very \"you-should-kiss-my-feet-for-serving-you-nevermind-the-fact-that-its-my-JOB\".  I love it when the counter staff assumes I'm going to tip them 50 cents on a $1.50 cup of tea and therefore drops my change in to the tip jar before even handing it to me.  To be fair he saw how surprised I was that he assumed and tried to make it up but really, it's just silly to assume.  In the end I'm not that hard up that I NEED the 50 cents but hey man!  That's laundry quarters!!!", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-28", "description": "You won't get dirty looks for lugging your Dell around, but you will surely crave a mac after chillin' here. I didn't have any food or coffee here, but a hot cocoa instead and it wasn't bad at all. The service was similar to other coffee houses and my barista was Mandonna's go-go dancer, cool.", "author": "Charm N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "I really dig this cafe. I'm one of those laptop nomads who lives in the area and Maxfields is one of my regular places to eat and work. \n\nThe pluses:\n* Mellow, mellow vibe (I love mellow, kick-back, casual cafes). I'm not there for a \"scene\" or anything in-your-face.\n* The cafe interior is airy with high-ceilings (unlike some of the more cramped cafes in the area). There are large windows fronting Dolores St. and so the cafe gets a good amount of natural light. In fact, on sunny days, you might want to avoid the couches adjacent the windows as you'll get a ton of laptop glare.\n* The staff is nice\n* They have a lot of vegan options (if you're into that). The vegan cookies and breads (banana, pumpkin, etc) are very tasty -- and I'm not even vegan.\n* Outlets are pretty easy to get to if you know where to sit\n* I've never had a problem getting a seat here\n* Nice mix of patrons: You get all sorts here. Startup people, kids, D&D dudes...the whole lot. Nice change from some of the more homogeneous spots where it's row after row of laptop peoples.\n\nMinuses:\n* Coffee is decent, not great (this is Jumpin' Java Cafe level coffee -- don't expect your Blue Bottle experience here)\n* Sometimes you'll get a singing barista. Doesn't bug me so much, but there's one dude in the afternoon that likes to sing along to his ipod playlists.\n\nPublic Service Announement: If you're a nomadic startup guy, like me, who frequents cafes. Please do your part to SUPPORT the cafe. Buy stuff, tip 'em, make room for other patrons if you have room at your table and the place is full. I say this partly out of guilt, since I vowed since Canvas died to be a better cafe citizen in the future (r.i.p. Canvas Cafe -- we used and abused you to death)", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-25", "description": "A few friends and I went down to Maxfield's for something a bit different than the cafes in the Castro.  It's a good environment, good location, great place to people watch from inside or outside, and the coffee is pretty good.  I recommend the Breakfast Bagel!", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "This place is pretty cool, with lots of outlets for computer folks, and I'd rate their sandwiches at the high end, in terms of coffee shop food.   But, jeez, learn how to toast a bagel.", "author": "Ted M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "Has there been a change of ownership?  I didn't see any singing baristas or rude staff behind the counter on my first time visit today--as reported by earlier yelpers.  Nice high ceiling, airy large interior, soft and hard seating, plenty of space, good array of vegan cookies, fine soy latte and quick service.,", "author": "Bob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "Good solid local coffee joint.  Yummy food...best breakfast bagel ever. Nice assortment of goodies, even vegan options.  Coffee is great, order \"for here\" and you actually get to drink out of a mug, go figure. Plus wine and beer, loving it.  You can pop in and out when you're out and about, or leisurely drink while reading or surfing the Net.  2 computers or WiFi provided. And always some rocking beats in the background.", "author": "Caitlin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-19", "description": "I regularly walk an extra block or so to get coffee and read at Maxfield's.  The corner location, big front windows, high ceiling, and pretty good snack assortment put it a good step above the average corner coffee spot.  Let's be honest, coffee shops in this city are a dime a dozen, and compete many of them seem to become extreme environments.  To me, Maxfield's is a great balance - funky employees, good vibe, nice mix of other customers, and pleasant space.", "author": "philip k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-02", "description": "Ahhh, another cozy coffee shop near Dolores Park.  The coffee's decent and the treats are pretty damn good.  And a great wifi connection!", "author": "Elaine U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "i'm goin to give this place five stars.  why, you may ask?  because i can chill out here with a beverage and actually get reading done.  just a good neighborhood coffee shop without the boy watching or pretentiousness you may find at the nearest starbucks.  i like the service and the baristas who sing with the music.  ive had the coffee cake, vege burrito, turkey sandwhich, bagel and cream cheese.  food is eehhh...  i don't go for the food.. just the atmosphere and study environment. \n\nthey need new couches.", "author": "Ann M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-11", "description": "A friendly, serviceably coffee shop good for internet surfing, quiet conversations, and especially avoiding the crowds at Dolores Park Cafe.", "author": "Leslie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-12", "description": "Great place to study.  Love the bagel egg and cheese with a cup of iced coffee.  Very good light.", "author": "Liz E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-25", "description": "Nothing particularly special here - bake goods, coffee, tea, and service are acceptable.  \n\nIt is a great spot to study I have to say.  Free wireless and plenty of room.  Doesn't seem to ever get too crowded, even on a Sunday.", "author": "Minny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "This is a great cafe. Great location (a block from dolores park), coffee is ok, nice light, plenty of free wifi and electricity, a good place to work, blah blah blah.\n\nHowever...\n\nIt's OK for a cafe to play crap 90's rock. Sometimes. But.  It is completely UNNECESSARY (in my opinion) for baristas to sing along! I come to this cafe a lot since I moved to the neighborhood, and so far I've witnessed two different baristas serenading an unwilling audience.\n\nI'm really surprised other reviewers haven't mentioned this bizarre feature.  Stop singing boys! (Pretty please?)", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-06", "description": "There are a lot of people who come here with their laptops but it's not one of those \"shut the f--- up I'm doing something really important\" places.  I think people should go to the library, a church, or home if they want peace quiet in a public place.  Maxfield's is totally unpretentious, spacious, has great coffee, and yummy sandwiches.  Good place to chill for a long time.  ...and you're allowed to have a conversation.", "author": "regina k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "Well.  I have officially arrived on the yelp scene.  So here it goes.  This retro-70's coffee house is my favorite coffee house in the dolores park neighborhood.  While the quality of the mocha's vary quite a bit (why did you leave John), the atmosphere is relaxing.  You can find me outside on a sunny day.  I love the feel of the warm sunshine on my skin as the coffee warms me from the inside out.  I have had several in-depth conversations here with the dolores park locals.  Overall, a great place to read the paper, work on your computer, study, or just about anything else you want to do at a coffee shop.  ;)", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "simple, straight-forward coffee shop with no frills.  I like that people actually talk in this cafe, it's not a zombie-land of computer addicts.  a good place to while away hours chatting, studying, reading, or computer-ing.  I spent years here studying for a series of exams - in the evenings, when there wasn't so much singing going on, but I wore earplugs so i could focus.  nice location.", "author": "Northanger A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-25", "description": "I live in the neighborhood and tire of 'the herd' on 18th St. that swarms to Dolores Park Cafe, Bi Rite Creamery, and the 40 minute line at Tartine.  Maxfield's is the real neighborhood cafe and I walk the extra block to hang here.  Strong coffee, funky cool, mellow vibe and music.  Not a sleek cafe.  Big plus is that it's nice and toasty on cold rainy days.  Wireless is flawless and a great student/artist crowd that's totally mellow along with the great neighborhood kids who just come in after school.  Love this place, but you gotta love funky.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-25", "description": "A fine coffeeshop if you live in the neighborhood.  However, not too special.  Coffee is fine, food is fine, and atmosphere is fine.  I go here if I need quarters or if I need to get out of the house and read the onion.  Meh.", "author": "Mira B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-15", "description": "I loved coming here with my dog after a walk through Dolores Park. I tried to work here on my laptop a few times - but for me the idea is better than reality as I work 10x faster at my desk. I don't remember anything special about the coffee - it was hot and tasted like coffee. They have an A-OK selection of cookies and things. I just like it here every now and again - it's low key, near the park and they have free wireless which I won't really use anymore.", "author": "Jack K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-30", "description": "Moved to this very fun neighborhood six months ago and discovered this great place.  The owner and team get an A for customer service.\nSitting outside is fun as you watch all the colorful people in our hood.", "author": "Demetri A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-10", "description": "I stumbled upon Maxfield's on my way to the Dyke March in Dolores Park.  Tired and thirsty, Maxfield's was an oasis.  Loved the latte and the banana bread.  Nice, homey interior.  Much better than any Starbuck's.  Only drawback: only one bathroom that can accommodate a single person.  The line was long.", "author": "Bob B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-30", "description": "one star for the fact that if i ever WANT to be ignored and then talked down to by the staff at a coffee house i know the perfect little place to get my dose of attitude--yummy!\nand one star for the fact that in retrospect it was almost entertaining how farcical the staff really was.....\n\nso, i walk into maxfield's. i go to the fridge and take out a vitamin water (back off!--i LOVE vitamin water). i bring my bottle of flavored sugar liquid to the counter and stand there with my bottle and a $20 in the air in front of me while 2 employees SIT on the sandwich counter (note to self: never order food here. it will be prepared on the same surface as the employees put their asses) for 10 minutes watching this:\n\nskateboard guy: hmm...should i get green or black tea?\nbabyshirt/nail polish/bad hair dye guy: what do you like better (flirt flirt flirt)\nskateboard guy: (totally ignoring the flirt) wweeeellllll....how much caffeine is in them?\nbabyshirt/nail polish/bad hair dye guy: (insert diatribe about caffeine levels that skateboard guy makes a point of rudely ignoring)\nskateboard guy: i don't know....\nbabyshirt/nail polish/bad hair dye guy: what do you drink at home? do you brew your own tea at home?\nskateboard guy: green tea i guess...hmmm\nbabyshirt/nail polish/bad hair dye guy: ok then, would you like that or would you like to try something new? (eyebrows flicker up and down)\nskateboard guy: (ignoring eyebrows) i'll take the green tea....wait, no....\nbabyshirt/nail polish/bad hair dye guy: well...\nskateboard guy: (looking over at boobs popping out girl's boobs) what should i get?\nboobs popping out girl: what do you like best? i like...\nskateboard guy: (interrupting boobs popping out girl) i'll take the green tea.\nbabyshirt/nail polish/bad hair dye guy: ok, (leans over counter--seriously) coming right up!\nboobs popping out girl: totally good call.\nskateboard guy: yeah....\nbabyshirt/nail polish/bad hair dye guy rings up skateboard guy's lame ass safe cup of tea and WALKS AWAY FROM THE COUNTER!\nme: (still standing like an idiot with my bottle--half drunk--and my $20) drops jaw!!!\nnew counter person chick who was sitting on the counter behind babyshirt/nail polish/bad hair dye guy this whole time comes up to the register. looks at me....\nnew counter person chick: you want to buy THAT?\n1. i already drank half\n2. why would i do that if i didn't want it in the first place never mind the fact that i voluntarily took it out of the fridge myself.\nand 3...the most important!!!!......IF YOU ARE SO FUCKING SNOTTY ABOUT SELLING VITAMIN WATER THEN DON'T FUCKING SELL VITAMIN WATER!!!\n\ni will probably never go back unless i need to break another $20.....", "author": "Bad Ass Chic K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-23", "description": "super into the aesthetics of this place. the way all the tables are positioned feels nice. or maybe it's the plants, plants are good to be around too. i sat here for like an hour and a half or something. the sun dried tomato cream cheese tasted weird but i don't like cream cheese that much anyways.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-14", "description": "i love it when cozy cafes have coffee AND beer AND free wi-fi. this combination makes me jump for joy! and Maxfield's is one such place. so here i am taking a break from helping the sweetie with grading mid-term exams on an overcast saturday. maxfield's is full of bustle: folks on computers, folks reading various media, folks drinking coffee, tea, beer, what have you, folks just having a snack. yup. pretty chill spot. the menu includes the usual cafe fare - bagels and pastries and such.", "author": "ray e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-07", "description": "i like the feel of this place, and they also happen to have marsha's marvelous wraps, which i just love!", "author": "Jill k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-11-21", "description": "the coffee here tastes burnt. and the employees in the morning are generally unpleasant.  i wish i liked it, it's RIGHT across from my house, but i just feel like they have no personality there, other than the photos on the wall, which i like quite well.", "author": "lauren a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-20", "description": "Buggy, dusty seats, and overall feels grimy. Coffee is oh so so-so. The wifi is mighty flaky too. A pity, because the location is great. The best way to make the best of this place is to sit outside.", "author": "Shwin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-22", "description": "seriously, this place might get another star if it weren't for the AWFUL music. i just listened to a song twang on about tractors. seriously, WTF. country? like, real twangy backwoods country? in mission dolores? one important thing i have learned about art and writing that would seem to be applicable here would be to consider your audience. looking around at my fellow cafe goers, i see rows and rows of mac books, young, creative, well- educated, white collar office types, and not a single pair of wranglers or a raised-suspension truck anywhere in sight. now, some may tolerate or even enjoy a country song here and there, for ironic or nostalgic purposes, but this is really too much. maxfields, i implore you: change the music!! if you are thinking about coming by, bring your headphones, even when they aren't playing country, thier musical selection is pretty stale. at least it has been since i have been here...", "author": "meagan m."}
