{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I have been going to this place since for 25 years now no bull, and the place has never changed. This is a great place if you like good simple Chinese's dishes for the low.\nThis is a place for the person that doesn't need catering as he service is not the best. Don't expect a warm \"good afternoon, can I start you off with a drink?\" Attitude because I'm my 25 years of going here it has never happened. \n\nThings to order:\n1. I always order a wonton mein bowl(I believe it's about $2-3) it comes quick and hot with freshly made wontons and noodles with a little cabbage, so good! \n\n2.Minced beef over rice($5-6) is so simple but satisfying. It's just ground beef with peas smothered in a gravy sauce over rice. \n\n3. Fried noodles over beef (geen mein) and ask for gravy (sup-chaw). This has to be the best dish and is a favorite when I come.\n\n4. All the chow fund are really good, I'm a gravy person so I always ordered them with gravy. \n\n\nI give this place a 5 because it reminds me of Hong Kong with the good prices, simple authentic dishes and the service is real, not that overly caked on let me squeeze you for tip money type attitude.*****", "author": "Ted L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Hahahahaha...the reviews were spot on . Service is very spotty .  Waitress is very nice to regulars. Yes, the chef has a foul mouth. Don't come for the service or ambiance , but definitely come for the food. This is Chinese mama homing cooking at its best. Every bite reminds me of a festive family gathering. Did I mention that it was super cheap($2.00-7.95). \n\nI'm a big fan of the following : \n\nSweet & Sour pork: tender pork Lightly dusted with flour and fried to perfection. It doesn't taste like your typical fried fritter.  The sauce don't not have too much food coloring. \n\nStuffed eggplant was so yummy. \n\nChicken / string beans, broccoli, bottle melon cooked in light soy, ginger and garlic . Tender and fresh. \n\nStuffed fried tofu : nicely crisp on the outside and soft in the middle. The black bean sauce makes this a wonderful savory dish. \n\nWet eggs with shrimp on hor fun(thick noodles). Wholly £*€* that's good stuff. \n\nScramble eggs with chives was fluffy with the right amount of seasoning.\n\nDefinitely Chinese food at its best.", "author": "Joe L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Food is great. Not gonna lie. Had to grab forks and knives on my own. I said they ran out and she grabbed a box and threw it on the table... and didn't make another move. Let's just say I like food more than service.", "author": "Janan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "The food is great and cheap! Take out is all I would do as service is not great because they have so many to go orders. The girl that works there that everyone talks shit about is always polite to me. But she can be grumpy which is understandable as she works there seven days a week from ten am to ten pm. That's not fair", "author": "Mike D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "According to my mother, this place has been here for decades. And it looks like it too because the interior reminds me of a restaurant scene from old western movies with the fan lights in the ceiling and the peeling posters. However, this restaurant is a hidden gem with all their unique dishes written in Chinese and taped on the walls. I couldn't read what they said but the dishes the mother ordered were delicious. We got salt and pepper fish and meat balls, onion and squid stirfry, and eggplant and beef and it was a very satisfying meal. Plus, every dish was about $5-7. What a deal!", "author": "Kristine P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-28", "description": "The dining room has plenty of seats, but not many people would sit down for dinner at this restaurant. The tables, seats, utensils looked so old and dirty, they would make one feels like playing Russian roulette. They might have passed​ the health department inspection by just a hair. \n\nHowever, the kitchen rarely had time to rest. They cooked up bags and trays of food continuously (I guess \"what you don't see won't kill you\", or one time used take out containers save them). Now, I think they are more focused on their takeouts and catering business. \n\nThey have lot of dishes on their menu; very inexpensive. Out of 5 dishes we ordered, 4 were quite tasty. The one that we like the most was the taro fried rice; only restaurant I know which makes this dish. The ingredients complemented each well and the taste of frying over high heat wok really came through The one we didn't like was the tofu in tomato sauce - tasteless &  soggy; next time will stick with salt and pepper tofu. \n\nWould have given them a 3 or 4 if my rating is only on takeouts.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-21", "description": "I've never dined in here so I can't say much about in house service. When I order take out the young lady that answers the phone is borderline annoyed to can't stand being there? She must be someone's daughter and maybe not getting paid enough?\nOn another note this is a true hole in the wall. I doubt they ever clean or have a daily cleaning chart to work off of. The food is pretty good and prepared quick when calling and ordering on the phone. \nI've posted some photos of our favorite go to dishes.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "I've been coming here off and on for the last few years because of the convenience and price.  While the food is nothing to write home about, it is passible in a pinch. Over the years, the service, which was pretty nonexistent has only gotten worse. The young woman/girl who answers the phone and helps with takeout orders is the most apathetic, low energy person I have ever encountered in a customer facing role.  This is not just a she's having a bad day thing, it is literally every time I've ever interacted with her.\n\nToday, I've placed my last order. I ordered a wonton soup and dry fried flat noodles with vegetables, which I repeated twice. This young woman/girl is always in such a rush to get off the phone and she ended up taking my order incorrectly.  When I arrived to pick up my order and questioned the total, she had charged me for beef dry fried flat noodles. When I told her I had ordered vegetables and not beef, she proceeds to turn around and in my view, pick out the beef from the container, rather than request a new order from the cook. I'm sorry...really?! Where is this ok? When I requested a new order, she said they were low on chow fun noodles. \n\nNeedless to say, I left without my chow fun. As a side note, this is the second or third time that I have caught her overcharging me. The price is no longer worth it for the food quality and total lack of customer service. Also, their major downgrade by the health department no longer makes this a viable option for me. There are plenty of other options in any direction.", "author": "M Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Affordable. Efficient. These are basically the two words that describe Menkee.\nI've been eating their food since I was little, and I can truly say that it's a hidden gem of the Sunset district. Forget all that Chinese fusion food in the Mission or the high end Chinese restaurants in the Financial District. This is the real deal.\n\n-Rice and noodle plates are priced minimum around $5-$6, which is such a good deal nowadays. The food portions aren't generously abundant, but at the same time they don't skimp on the shrimp or eggs. \n\n-If you do get the chance to dine in at this restaurant, do it! The decor of the restaurant may be considered outdated/old (some chairs have small holes), but what really matters is the food. The atmosphere of the restaurant is quiet, and I feel like you can sit here hours on end chit chatting away with your friend. I usually see an elderly person relaxingly eating while reading the World Journal newspaper or a couple eating nonchalantly. \n\nWhenever I'm craving authentic Chinese food, and I don't want to make a hole in my wallet, I make sure to order from Menkee's. Although I've been eating their food for years, I always make sure to try something new on their menu each time. I'd definitely recommend ordering:\n\n-Beef scrambled eggs over flat noodles\n-Shrimp eggs chow fun \n-Tomato Beef Hong Kong Style Chow Mein", "author": "Erica K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "I have been here. Food is decent, but the lady on the phone is beyond rude. Can't justify paying money to be yelled at for no reason. Have dignity and don't spend another dollar here!\n\nBye", "author": "D L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Come fore the tasty food and the great price. A few out of the ordinary items. Dam this place ass fucking cheap!\n\nAlways rate places for the food. I hate people that rate places because of the service as if your some sort of special mother fucker. Let's face it if you want to be treated special go to an expensive place and pay $100 for two courses or go out with a prostitute. A prostitute will treat you special like a king although your just a stupid nobody that smells funny.", "author": "Sky I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "I come here for their scrambled egg beef/prawn chow fun. \"Just Won Ton\" on Vicente uses oyster sauce, not gravy and claims they use more egg. I dont think so. More or less egg, the chow fun here is the best I've had since it's also so cheap!\n\nYes the bathroom stinks, parking may be hard at night, it's cash only and the waitress doesn't smile but for good food for a good price, I don't care. I come here for take out and I always get the chow fun. Never fails to disappoint.\n\nIf you don't like this place or their service, then go to other restaurants on the street, there's a gazillion of chinese restaurants on Noriega.", "author": "Inez J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-29", "description": "This woman is the rudest server I have ever encountered in my life of going to any customer service related eateries. She is impatient, give no fucks about the customer and it shows. She hung up on me 3times, and failed to get my order of 2 items wrong. I ordered 20 minutes before my lunch and I still had to wait.... Food is okay for the price,at best.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "This is a go-to place for my family. We always leave satisfied and it's super affordable! If you're looking for great atmosphere and nice customer service, this isn't your place.\n\nHowever, the quality and affordability surpasses the negatives. I definitely recommend the salt and pepper squid for it has a perfect amount of breading and seasoning. I also recommend the shrimp fried rice and sweet and sour pork. It's delicious! \n\nGo here if you want great Chinese food without having to fork out a lot of cash!", "author": "Nina I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "I had to squeeze in a quick lunch here and I ordered the wrong dish. something  basic and  not too complicated but truly poorly executed today.\nscrambled egg and beef over rice.\nthe beef was rubbery and the egg mixture was poorly put together with more corn starch and water than egg. flavorless with poor ingredients. \nnot only that the table service person was completely indifferent, not friendly, barely spoke, and the table I sat down at had a disgusting sticky grease glaze on it.  The first time I yelp reviewed this place was back in 2006.\nit is now 2015 and the mirrors in the dining area STILL have not been cleaned.\nyuck.\navoid.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Yes we all agree the girl is as grumpy as someone who just worked 20 years straight without a break.  However, I have to give this place credit, for $6 including tax, I got chow fun with scrambled egg sauce and prawns how can that be beaten.  I ordered take out since I work nearby and jumbo charges 9 bucks + tax for the same dish, if you go and sit down jumbo is a better looking place, this place is a hole in the wall but definitely worth a try.  Most of their entres average $5 and they're delicious . \n\nDon't expect great service, also make sure you bring cash since that's all they take.\n\nWon ton soup is dirt cheap under 4 bucks, and their chow funs are great.\n\nCan't beat the price!!!", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-12", "description": "Let's start with the bad first. SERVICE SUCKS..... every order that is served comes with a smack of her teeth.  If you add a to go order, she will mumble \" your annoying \" in Chinese.  Finally. When I ask for a Togo box.  She drop it on the table and it slip off and hit the floor.  She didn't even look back to see what fell or bother to get another one.  If you do plan to stop and try this place out.  And the host is an Asian girl around 5\"4 with glasses. Just walk out...\n\nThe good thing about this place is the price and flavor.  Like the prices never change even back in 1995.", "author": "Shanny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "The woman who works here is incredibly rude and it's not hidden secret. This place is under-par and most people who speak highly of this place are probably just happy about the price. Seriously, no point in getting pissed before you eat.", "author": "Jeffrey Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-26", "description": "Man today the cook/maybe its the owner cussing non stop in Cantonese at the younger guy cook.  At least talk softly and not so loud since the other cook is right next to him.  So unprofessional to let customers hear him.  Major mental disorder.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-29", "description": "Rip off!   Ordered 5lbs of chow mein last weekend.  The tray of noodles felt light when I picked it up.  Went home and put the noodles on my digital kitchen scale.  The scale read 4.25lbs (weighed twice) including the aluminum tray. The one star is for ok tasting noodles.", "author": "R K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "Extremely affordable dishes with a very satisfactory portion served.\n\nI ordered the Kung Pao Chicken with rice and it came out in a little just over 5 minutes. I ordered 10 minutes before they closed so I was the only one they were serving it to. Obviously, I got it to go and just ate it at home. I wish the dish had a little more meat. I could see that they tried to proportion more vegetables than the chicken.\n\nI was not disappointed and most likely would come here again!", "author": "Aj C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "Decent Chinese restaurant on Noriega St. in the Sunset district of San Francisco. I come here occasionally with my family for a quick lunch or takeout to bring home.\n\nThe eggplant chow fun is my favorite dish: the juicy and flavorful eggplant pieces go well with the smooth, chewy flat noodles. Their fried rice dishes are also pretty decent. I've tried other dishes such as their pan fried noodles, porridges, and wonton, but felt they were all pretty mediocre. Especially the porridge we ordered once was very bland and the portion was pretty small.\n\nPrice is affordable, on average $6 to $8 per item. Service is mediocre as the usual waitress is not very attentive, but at least the food comes out decently fast.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "A huge shout-out for this neighborhood gem!! This is your typical, local hole-in-the-wall, cheap Chinese joint - so please don't expect 5-star quality customer service, white table cloths, or spanking new china.  And please don't downgrade the stars because those things don't meet your expectations.  This is NOT the place for those things!  This is the place for consistently delicious food for an excellent price!  Where else can you actually get a meal for less than $5-6 nowadays??!  Portions are great, taste is great, and the prices are great. I can't think of a better place to go if I need a quick lunch or dinner and don't want to put a dent in my wallet.  \n\nFor those of you are never dined in Hong Kong canteens or dai-pai-dongs before, you might be turned off by the conditions of this restaurant ('cuz it's very similar). If that's the case, just order to-go.  But do give this place a try and you won't be disappointed.", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "Not even want to give one star. Bad service and bad food. Burn and sour. Only the wonton soup price is cheap but no taste at all and it's dirty.  A small oyster burn bread cost $7? Only with not even one piece of oyster ?  It's  not even good for one person. Not recommended.   For the whole night only one table here(us), no customer come in. I think this is the reason.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "I've drive pass this little place dozens of time and always wanted to try finally get my chance on friday.. feeling lazy and as always on a friday and the old lady and I decided to go out and eat so I choose to try this place out. yes is a little outdate with all the tables and chair and the glass is a little foggy but that is the whole point of this restaurant. it reminds me of Hong Kong the dai pai dong.... the services is'nt really great. I personally say her service is about a 1 1/2 star but that beats alot of those so call 5 star restaurant services.. because u dont expect service to be too good here and for the 5 star restaurant u expect they will lick your ass and shine your shoe which it will never happen all they will do is just laugh at your silly ass and say sucker for eating here !!!!!\n\norder the most simple dishes that 5 and 4 star restaurant can not make. \n\n1 deep fry tofu with catfish pot.. very  home feel.. ( u must try this )\n2. stir fry A choy with bean curd..   little blend but I never like  A choy anyway\n3. chiu chow oyster pancake ( really must try )\n4.chiu chow pan fry egg with silver fish. ( is ok )\n\nis really too bad that she did not hear my side order of wonton cause I really wanted to try their wonton. I guess I will have to go next time when I try their noodles and rice plates. \npan fry egg with silver fish is only ok because the egg is pan fry too ( old fire )and it cause the silver fish to dry out a little. other than that al the dish has alot of WOK AIR. Have been searching for the WOK AIR dishes for many many years tooo bad they only open till 9 pm they should just skip the lunch time and open dine till mid night I bet u if they do that ABC, Jumbo, will be out of business. just make sure don't go here when u feeling very very hungry because when they cook u ca smell the aroma of the dishes in the open air and that will make u even more hungry and mad with the services.This is what Chinese FOOD and eating Chinese food is all about.. WOK AIR!!!!!!!!!!!!!!!!!!!!!!!!!\n\nThis is truly a real solid 3 star with their chefs cooking skill they should raise their price up a little more because  really think is worth more than what they r selling at now..", "author": "Tommy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "Yo this place was pretty empty when I came in here I usually don't eat no were else for wonton soup but my boy just insisted that we try this place. Man the lady was so rude to my boy and she didn't even serve us no tea. She gave my mans a cold as look. I don't like the way the treated us. We are Definitely not coming back. Fuck that \n#PAYPABOY", "author": "Donald A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "Decent food at an affordable price considering how it's in the Bay Area. \n\nBut terrible...I mean TERRIBLE service. The waitress (Asian woman with glasses) is already walking away before I finish my sentence. If you were planning to order a second item, chances are you won't get it since she's given your order to the cooks. \n\nTip: order everything in one long sentence without taking a breath...\n\n\"You get what you paid for\" is the saying that comes to mind. I only come back, because the food is good at the price it's listed at.\n\nThe choice is yours! Yelp-ya later!", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Their Yee Foo Won Ton soup is the greatest..! A dozen deep fried won tons in a thick chicken egg-drop soup with bits of BBQ pork topped off with some cilantro...a wonderful meal for under $9.00 - if you're really hungry get a small  bowl of steamed rice ($1.00) and you're all set. I also order their Som See Chow Mai Fun (three shredded meat silver thread noodles) and ask for curry to be added to it - they happily accommodate my request... If you want a bowl of simple won ton soup - just that, their house soup broth with won tons, no garnish - it's $3.95 but TO GO only...Cash only...Street parking - without meters..!", "author": "George B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Expect the worst. Prepare for the best. The restaurant is ugly, the service is absolutely terrible (terrible is an understatement). The goal of being here is to get food in front of you. Just tough it out.", "author": "Kong S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "I've been going here for yearrrrrrrs! This is probably one of my favorite Chinese places to get authentic, affordable and delicious Chinese food. \n\nIt's practically a hole in the wall restaurant... not much of grand service, no extravagant decor, no fancy utensils or plates, etc. In fact, this restaurant's atmosphere might deter many people from eating in (I never mind because the food is always yummy); which is probably why I always see a line of catering and takeout orders being prepared instead. \n\nI don't think I tried anything here that I don't like. However, I do think it helps if you or the person ordering knows Chinese - you can practically ask and custom create any variation of a dish that you like (which protein? over rice/noodles? what kind of noodles? do you want it wet? in soup? pan fried? etc etc...) I don't think we have ever looked in the menu.. we just order what we like! If we see another table having something that looks bomb as hellllll, we just ask for that dish too. \n\nSome dishes worth trying - beef chow fun (Seriously the best I've ever had here!! You can really taste that char flavor. We always get it dry, but wet is just as good too!), tomato beef over fried noodles, Singapore mai fun, eggplant chicken over rice, fried stuffed tofu (appetizer), wet egg & chicken over rice (I promise it tastes better than it sounds! It sounds better in Chinese... hahaha... and if you're under the weather or just seemingly love these dishes, their won ton soup and porridge is yummy too! I believe they're under $2..?!?!? Something ridiculous like that.\n\nAnyway, I feel like this restaurant is a little underrated and under-loved here on yelp. Take your fancy pants off and give this place a try! Cash only.", "author": "Kris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-27", "description": "MengKee is not the prettiest place I've ever dined at but is definitely one of the tastiest!\n\nBeen wanting to try this place like, forever. From the outside I thought it would be a Hong Kong style won ton house. From the inside it's a solid family run Chinese eatery. You'll find a respectable assortment of soups and various noodle and Cantonese style dishes, all of which will not break your bank account .\n\nYou walk in, seat yourself, and try not to be put off by the decor, or rather lack of.  Cloudy mirrors, faded hand written menus grace the wall and 1970's type of Return of The Dragon generic restaurant tables and chairs comprise the dining area. \n\nSo, we ordered beef stew won ton, combination wor  won ton, tofu beef over rice, black bean tripe over rice, and curry vegetables. The beef stew was super duper tender and the won tons were perfectly shaped, cooked al dente, and were damn tasty. The stand out dish was their curry vegetables, comprised of fresh broccoli, bok  choy, carrots, green peppers, and snow peas! It was awesomely tasty and spicy, nom! All the dishes were only in the $5, $6, and $7 range, score!!!\n\nSo when I'm in the hood,  I would definitely come here again, for the food, but probably not for a romantic dinner!", "author": "Richard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "I have been eating at Menkee's since my high school days (in 1998).\n\nThis is KILLER (Excellent) Cantonese Food!!!\n\nI am ADDICTED to two of their (fried rice) dishes: shrimp fried rice and salted fish and chicken fried rice!!!\n\n*To the ones who BASH this place but STILL give it four or five stars: SHUT IT!!!", "author": "Jade C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-23", "description": "The restaurant is one of your cheap hole in the wall joints. Greasy Chinese food decent 3 stars I would probably say. The girl who works here... (my brother thinks shes a slave) the chubby one with glasses is SUPER rude however. I don't know what's wrong with her but she has absolutely no skills in customer service. I ask her to let me order some salt and pepper chicken wings a tray and she said they didn't have it. I asked her what she recommended and she said \"I DONT KNOW THINK IT OVER,\" and hangs up on me. LOL angry mean woman makes me never want to eat here again. Hell I might not even pick up the tray I just ordered.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "This joint is a cash only establishment with great food and quick service. I recommend calling in your order and picking up unless you want to wait inside which can get a little hot from all the magic happening in the kitchen. I highly recommend their wanton soup.", "author": "Gladys M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "Bad experience ever.   We tried different food here.   Couple of them are sour !!! I heard another table saying the same things.  Wonton is sour.   And it's dirty!!! Soooooo dirty !!! Worse thing is we saw the server bad attitude and throw money to the customer.   Throwing all the coins to the bowl! How ridiculous.   Will not come back again.   Health department should come over to check with this store.", "author": "Derek K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "Came here 2 yrs ago and food was ok.  Today we come back the all the food is so bad.   The fried bread is burn and the porridge is sour(overnight).   The wonton soup is cheap but the wonton is sour too.   The fried noodles and the rice noodle is all bad.     The server here throw the money when we told her the money she counted is not correct.    We don't recommend anyone come back here again.  When we came here , there is no customer, no wonder.", "author": "Xueying D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "Worst customer experince ever, especially that asian waitress. If you not a people person don't freaking work at a resturant. Get a different job, work behind a computer or work in a factory where you don't have to deal with customers. Maybe her dad owns this restaurant. Otherwise, she would be fired with that attitude.", "author": "Stanley L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "The food here is not bad and the prices are very reasonable. There are plenty of items on the menu to satisfy any palate. The service could be better though. The waitress acts like she does not want to be there or has better things to do. Aside from that you should give this place a try.", "author": "Marty M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-20", "description": "Came here because my bf said the place doesn't look like much, but the food is gooood and cheap. And was he right...it didn't really look like much. haha. In fact, it still didn't look like a restaurant when we walked in and the lovely waitress stared at us for a while.. and then continued working. Hmm...okay, we'll sit ourselves. Thanks!\n\nHave to admit the food wasn't bad. My bf got the tomato and beef over mien and I got yeung chow fried rice. There weren't a lot of people when we went so didn't take long (~5-10 min). Not the best I've had..but pretty good. Especially because of the cheap price. Makes it so much more attractive! :P This restaurant seems like the perfect place for take out if you want some decent, cheap Chinese food.", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-22", "description": "I worked in a Chinese restaurant in high school- and it was hard yes keeping boners flat in baggy saggy denim and not dripping phlegm in customers' orders who were assholes to my family. It wasn't an fancy place, but it was home for 4 years and my Uncles were kind to keep my oily faced ass there for as long as they owned it. \n\nI needed to preface my review of Menkee, because I love and hate it for the same reasons. Simple neighborhood spot, convenient and (relatively) dirt cheap. You looking for clean tables, smiles and Zagat ratings- getcha butt on out of there. Food is cheap and tasty, Salt & Pepper Fish Fillet and some sorta chow fun for me ala carte. Consistent always. \n\nSo, if this isn't the first review you've read on MenKee, there's the issue of a specific staff person: and it's not the friendly older lady who only speaks Chinese or the younger skinnier dude who doesn't smile, but you don't need him to. \n\nI worked in a Chinese restaurant, and I'm Chinatown kid, so I don't expect, or even want excessive courtesy or attention from the wait staff. I've eaten at Michelin starred establishments and cringe the whole way through, hating the staff refilling my cup every half minute and ducking under my armpit to shovel crumbs off the fine linen. I don't care about service. I should also mention that I work in mental health, and have among others, worked with former violent and sexual offenders. So what I'm saying is, I have a pretty damned high tolerance. \n\nAnd yet, when I see her, this tiny frumpy little girl, her round, metal frame goggles clamped over an incurable scowl, and somehow, something hateful boils in me. I could understand that perhaps she hates her job, hates her customers, hates her family even (it could only be family who keeps her on) and I empathize, with her, really I do. I've been there, been her, grinned through work and spent the nights after seething about it. I empathize really, but that doesn't mean getting treated like butt-smear on a shoe gets my appetite revved.  \n\nI hated but faked it through my restaurant service for my family, not the patrons. I pray for the sake of the business she can find it in herself to come to the same conclusion.  Come and go quickly for the cheap eats: under no conditions stay for the service.", "author": "Boxer Rebel L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "Horrible services!!! My husband and I went there for dinner, we were waiting to be seated. The waitress saw us but completely ignored us for few minutes. When she finally looked at us I told her tables for two please, she said \"Why don't you guys just sit yourselves? Why did you stand here so long? \" We didn't want her ruin our day so we didn't argue with her but just left. Never come back again!!!", "author": "Fiona R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "CASH ONLY!  Gotten much better after 2012.\n\n\nThis is one of my favorite places to eat in San Francisco.  It is hands down the best bang for your buck anywhere.  I paid $5.50 for a plate of fried rice back in the late 80s.  The food is authentic HK restaurant food - great wok skill and decent quality of meat.  I'm sold!  \n\nThe service is ok.  It is family run, and the kids are pretty good at taking orders.  The mom seems to be always mad at something.  I guess if I had to wake up at 6am everyday to prepare the food for the day, I would be pretty pissed too.  Anyway, the service is ok, not that bad and compared to other Chinese restaurants, it is average.\n\nI know the appearance of this place is appalling, but keep in mind that the kitchen is open.  Thus the oil will be bound to travel onto the tables.  From my experience with restaurants: having an open kitchen will always be cleaner than one hidden in the back.  You will be surprised to see how dirty the kitchen is on some very fancy decorated restaurants.  I've been eating here on and off a few years, and I've never gotten sick from eating here.  God bless the health inspectors of SF.  They really do their jobs well.\n\n\nSo in short:\n\nIf your focus is on taste and $$$, then this is a restaurant you should try.  Great for broke college students.\n\nIf you're more into decor and service.  You will probably hate this place.  Or at least take it to go.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Service: I can care less. I'm ordering to go. It's cheaper too. The lady in front is either mute or has trouble speaking. She does this to everyone. Speak clearly and she'll get your order.\n\nFood: the food is great. When I want Chinese food that isn't from my parents, I'll come here. My go to is the  scrabbled egg/beef over flat noodle. I've been coming here for years and it hasn't changed. The price and head chef are the same. Oh, and it's still a home in the wall.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "A hole in the wall with food that tastes good and fills you up for a reasonable price.  House fried rice, Mongolian beef, eggplant, and chiu chow chicken are all delightful. \n\nAs for the people who complain re the woman who is the front person (to go orders, hostess) jeez...  she's okay.  Here is an idea: don't take it personally, try to be the change you want to see. \n\nTry smiling at her and being friendly a few times, and see if she will warm to you. \nMake it an experiment. \nPeace.", "author": "joy d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "Greasy, authentic, delicious. The staff only speaks Cantonese (my coworker always has to order for me), so you know Menkee is the real deal. Every dish is like the best version of itself, from the beef veggies over rice to the pork porridge.\n\nMy personal fave are the eggplant noodles. Moist pieces of eggplant drenched in flavorful thick sauce, accompanying wide flat noodles cooked to perfection. Too good.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-23", "description": "The price for the portion of food you receive was great, so long as you don't mind the food not tasting good. I got the chiuchow style spice vegetable snack and the fried flat noodle with vegetables. The chiuchow vegetables were all the same weird yellow-green color and tasted like they were supposed to be pickled, but didn't quite make it that far. The noodle/vegetable dish only had bean sprouts and an occasional green onion. The noodles were bland enough to require a good bit of salt. Also, the hostess/cashier seemed to resent me. She dropped the change in my hand as if she didn't want her hand to touch mine and answered my questions with an irritated tone and without looking at me. Two stars because the food was prepared on time and the portion was decent for the price. No further stars because both the food and the service left a bitter taste in my mouth.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "This has always been a great takeout place as their portions are huge at a very reasonable price. Taste aside, it's a pretty good deal. We recently just ordered some takeouts (as I don't think I can withstand having my meals inside that restaurant). However, either the to-go box got bigger or they just got stingy with their portions. Eh, very much so, the latter. The togo box was only half filled (or half empty, whatever), but  the portions shrunk tremendously. Then again, the portion size didn't really matter any more because the food was just meh...it was bad that we couldn't even finish it...not that we were full, just because it was bland. Sorry, Menkee, I think our relationship ends today...", "author": "Em T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-16", "description": "Great food. Chiu Chow style. I like the pan fried oyster cake. Also, they have special on the menu is good and the price is very affordable. The reason I minus two stars : The restroom is always super dirty, the toilet tub is rusty, not sure how often they clean it . ( YeS !! Again, restroom does matter!! ) I suggest not to go to the restroom. The waitress never smiles, she is not rude or anything. However, she works like a robot. I never see she has any facial expression, I feel a little odd . When we were ordering, seems like she did not want you to order more dishes. I guess she's probably the daughter of the owner?? Anyways, I still like the food a lot.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "This is an hole in the wall restaurant. Horrible ventilation. Very affordable food. Bad services. You can hear the chefs are arguing in the kitchen. Therefore, I only recommend you to pick up and eat at home. Deep fried silver fish is the dish you must order.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "This place is pretty legit ever since the days of high school. I decided to drop by again the other day and the wonton noodle order still only came out to $2!! I mean if you're looking for a cheap meal that's WAY HEALTHIER than ramen, definitely give this place a shot! \n\nThe wontons are usually pretty good and they usually get my order ready in a couple minutes which is what I've been used to since the days of high school. I used to order  from this place on my walks back from school and they've been really consistent. I haven't ordered anything else from here since the wonton noodle soup is always such an economic option. The wontons are good and the shrimp is fresh. The noodles with cabbage are also cooked well.\n\nThis place probably gets criticized for shorting people a wonton or two but seriously, it's two freaking dollars people! \n\nIt also gets extra stars for being so close to home!", "author": "Ced C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Nostalgia.  I grew up eating here and never wrote a review. Every time I come back it brings memories.  Love the deep fried pig bowel. If you get over the fact that it is pig bowel it tastes delicious. Love their Hong Kong style noodles. These people work hard on their quick service Chinese food. Way better than panda (barf). Pretty grimy in here but food is on point.", "author": "Yumi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Five stars for price and food quality. If you're here to complain about the food, look at how much you're paying. If you're here to complain about the service, look at how much you're paying. \n\nScrambled egg with beef or shrimp is my favorite here, over chow fun! It's seriously the best in the city, and it's been my favorite since high school.\n\nThe people who keep complaining should really stop it and appreciate that SF still has a place like this around.", "author": "Eleventy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-29", "description": "Won't recommend this place. It's dirty. The stuff is rude and unprofessional: they have troubles communicate in English.", "author": "Alexander B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "This little joint deserves a review. I only put a couple up. But when I have something to impart to my neighbors about a place, trust that it is because it needs to be brought up.\nTry the Mongolian beef. Just so good. The food here is delicious, fresh, and generous! Very good dollar value. You cannot beat their portions for what they charge.\nI sense they have a standard by which they cook back there too which is more than I have sensed elsewhere Asian food-wise. You almost always get a glob of fat or an unwanted bone chip or gristle at those other places-not here. Not yet.\nThe gal who waits/order-takes/works the phone etc.-she is all about tending to business, not kissing ass, get over it. She won't pamper you, and fine by me. You're there for the food.\nGo there and try it out. One of our nice little Asian secrets here in the Sunset:)", "author": "frank h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "I've been ordering takeout from this place for years.  It has an open kitchen that one can peek in to observe the chef preparing your orders.  Very comforting indeed, not to mention that the chef was very skillful with his wok.  I always order the dried fried beef flat noodles, their stuffed 3 treasures (stuffed green peppers, eggplants, and tofu) and sometimes, the deep-fried sweet rice roll for takeout. Yummy!!!\n\nBesides the usual Cantonese dishes, they specialize on the Chiu Chow style foods, such as their jooks (rice porridge) are made after the rice are cooked.  They have a different texture and taste than the smooth Cantonese style.  There have many other Chiu Chow style dishes with exotic ingredients.  Their salted stream chicken is also very tasty.  \n\nWhere else can you find dried-fried-beef-with-flat-noodle for 5 bucks?  Not even in China Town!  \n\nAll in all, great value and great tasting authentic Chinese food from a clean kitchen prepared by a skillful chef!  What else can you ask for?  And yes, the service was decent when I ate there...\n\nAnd yes, they only take cash!  I usually call ahead for to-go order and they are ready to pick up when I get there.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-02", "description": "I ordered a Tomato Beef Chow Ho Fun (flat rice noodles). They ran out of those noodles but didn't tell me and replaced it with spaghetti noodles instead. That style of noodles doesn't work with the sauce from tomato beef at all! It doesn't stick and tasted more like noodles mixed with watery ketchup. \n\nIf they had told me they were out of the noodles requested I would have been happy to order it with rice instead.\n\nNo communication = ruined dinner", "author": "A. Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-22", "description": "don't buy the 5LB tomato beef. I got 5LBS of sauce and onions with 10 pieces of beef. they rip you off and don't do anything about it. this was $15", "author": "Tiffani L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Family & I have been coming here forever..since they've opened which is 20 years. Chef has great wok skills & consistent EVERY TIME. There have been some mishaps as in getting the wrong order but I blame the mom who takes the phone orders (she usually is the kitchen helper but sometimes she has to answer the phones & she probably heard it wrong).\n\nthe BEST spice salted calamari EVER! Same goes for spice salted little fishes to go w/your chiu chow jook (which is really watery rice rather than a porridge).\n\nour staples: salty fish pan fried minced meat 'cake' (haam yu jeen yook baeng), beef chow fun (extra bean sprouts), any of their stir fried greens (depends what restaurant has on hand & either w/plain garlic or fermented soy bean cubes \"fu yue\" or salty shrimp paste \"haam ha\"), asparagus beef/shrimp/chicken (seasonal), any of their fried rices, scrambled eggs w/prawns flat rice noodle (it has a more 'wet/gravy' base), eggs w/corn fried fish filet (over rice or by itself), FRIED wontons w/sweet & sour dipping sauce. They also have good eggplant dishes (i like 'em all). \n\nthey have an $18 dinner special w/the following (no substitutions & it's on the green menu but only in chinese): spice salted shrimp (w/the shells & head on), half a salted steamed chicken w/ginger & scallions, garlic mustard greens, pan fried 3 treasures (fried tofu, eggplant, green peppers very minimally stuffed w/fish paste)..those 4 items for $18, perfect for 3 ppl to eat.\n\nwhen crabs/lobsters are in season, we usually buy 1 or 2 live at a asian market..take it over to Menkee, pay couple bucks (for labor & their ingredients) to have it spice salted fried or stir fried w/ginger & green onion... droool......I always tip them well (like $10-15 extra) when I pick up the cooked crab b/c they're doing all the work for you.\n\nNote: VERY HOLE IN THE WALL so if you don't like grimey tables & floors, get it to go! (though their calamari or anything fried is best eaten there piping hot! I've done those for takeout, it's so different..unless u have a toaster oven to reheat it...still not quite the same). \n\nAnd don't mind the young girl waitress, it's a family business & she's stuck w/her life working there b/c she has to help her family 365 days/year (this place NEVER closes, not even for chinese new year or major holidays) so can you blame her? This entire family never gets a day off (unless Chef is sick which I've NEVER seen).\n\nCASH ONLY", "author": "Yolanda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-21", "description": "I've been getting food here on my work days when I'm nearby. Indeed, the food was cheaper than most but smaller portion. So, it isnt really a bargain after all. As for the lady who is always grumpy, It does sound like she hates her job. I observed her, it's not a fun job at all. Looks like she's the only one that answers the phone and takes order. All she does was walking back and forth in the hallway, getting the orders. No one talks to her. Kinda sad. No wonder she's not happy. Please, give her a break and enjoy your meal!  :)", "author": "The Black Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "My favorite take-out Chinese comfort food place in SF! You definitely get the best bangs for your bucks. It's far from your ideal place in terms of layout and service, very typical of a hole in the wall which I don't mind. \n\nThe food is great, not the best but for the prices they offer, who's to complain? Most rice dishes are between $5-6 and you get a great portion per order. \n\nRecommendations/tips:\n-Get takeout (call ahead of time if you know what you're getting)\n-Deep fried salt and pepper fish fillet (jiu yim yuu peen)\n-Salty fish and chicken fried rice (haam yu gai lap chow faan)\n-CASH ONLY", "author": "Henry P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "I never eat here, only take out. Bomb scrambled eggs with beef and gravy over rice or flat noodles. Their chow mein is good and their eggplant dish is also good. Cheap and affordable. Only thing is they don't understand English that well so when calling in speak slow and clearly and repeat!!", "author": "Colette P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-02", "description": "The waitress is unfriendly and impatient. She doesn't even look up when customers need help. Perhaps, they need a new waitress.", "author": "William T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "This place has the best priced salt and pepper squid and quality, second to Yuet Lee. Salt and pepper prawns ain't bad either. But this is for the price conscious foodie. They have all the basic soups, stews, over rice dishes, and noddles of above average quality. Their vegetable dishes are exceptional. You can't really complain about the ambiance because the price, and consistency. The owner is the cook and this guy knows how to do it right. He even puts other restaurants to shame with his sweet and sour pork. This place does a lot of catering and large orders. The wait staff, except for David, who is now an engineer, have lack luster personalities. So if we're tight in the pocket and have an inkling for provincial Chinese cooking, this is our go-to place in the outer sunset. By the way, they don't serve beer.", "author": "Sammy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "It's not fancy. It's not friendly. It's not even particularly clean.\n\nBut it's damn cheap and the portions are decent. Plus the service is fast. That's a good combo!", "author": "Johnny D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-23", "description": "I've lived around the corner from Menkee Wonton for about 4 months, and just tried it today for lunch (take out). At first glance it looks kind of run down. Felt like I was deep in Chinatown and not in the sunset district. Ordered pork fried rice, chow mein and Mongolian beef all of which were good. I'd go back just because they are so close to where I live but there are other places nearby that I like better.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Sure, this place has horrible service. Sure it also is dirty where grease shines brightly on the tables under their lights. Sure there's dust covering all the wooden fixtures where the plants are stationed.  But you know what? Never judge a book by its cover.  The food is amazing here.  It reminds me of the good old days in China when I go eat out at the da pai dang.  Keep up the quality and maintain the same bargain price.  Thanks for serving the neighborhood of sunset.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "My feeling on this place is mixed. They make some good food and you can watch the chefs at work. Makes me wanna learn how to make some of this stuff. The food varies for me. Some dishes I eat here a good and some are bad. \n\nSome dishes I order her like beef broccoli and tomato beef aren't that good but some of the noodle dishes they are keep me coming back.", "author": "T C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-31", "description": "This place brings back great memories, and has been here FOREVER. It's fast, cheap and greasy chinese food. Hits the spot! They always run out of their beef chow fun, it's a hit. Huge plate for less than $6.\n\nDo beware that the service is slow. There's this apathetic young teen working there, and well if she continues at the speed she goes, she's going to run her parents out of business. Which will be quite sad.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "1977 famous movie quote from Princess Leia: \"Help me Obi Wan Kanobi you're my only hope\"\n\nLike Leia, I was hoping Obi Wan MenKee could be the Chiu Chow cuisine savior it claims to be. Literally this is the only Chiu Chow Cantonese place I know of, Vietnamese Chinese people running Chiu Chow esque noodle shops aside (which is a completely different approach). \n\nInstead I got Obi Half, or maybe Obi Zero. Not Coke Zero.\n\nWhere do I begin? Chiu Chow cuisine in Hong Kong has basically 3 styles and approaches. The first is when Chiu Chow/Teochew used to be heavily influenced by Min cuisine (Fujian), thus oyster noodles, pork intestine soups and dishes, and mee sua/noodles, thus some of that influence rubbed off on the cuisine. This is why you see oyster pancakes/oyster omlettes (pan fried) in Taiwanese street food, and also in Chiu Chow restaurants all over Hong Kong (and also you can find it in Fujian too). A good oyster pancake is a sign of having steady access to insanely fresh local seafood (or an oyster farm). But this is San Francisco....we have to forgive this shortcoming.\n\nThe other \"soul\" of Chiu Chow cuisine is what is deemed \"lo shui\" or a complex soy sauce based marinade that contains a lot of proprietary ingredients, spices, and herbs. Bird, meat, fowl, tofu, and fowl innards/wings/feet/tongue....it goes in that marinade, then gets cooked, and served as appetizers or entrees, really top notch stuff. For fowl, goose is the leader, but duck can be common. The marinade is like a family sauce, never discarded and always added to it. The longer the history of a restaurant, the better the sauce. It's the same principle for the anago (sea eel) sushi nikiri brush sauce at the very traditional restaurants (e.g. Sushi Bun by Tsukiji Fish Market Uogashi, 120 year old 5th generation owner, using the original sauce simmered down from eel bones, and a separate brush sauce for abalone and clams, the sauce is continuously cooking and added to, you know dat chit is going to be awesome). \n\n\"Da Lang\" is basically Chiu Chow slang for eating a combination of Chiu Chow snack food (to be consumed with liquor or beer), sometimes room temperature to cold food (including cold crabs and yes...cold fish like mullet head or \"big eye chicken\" which is a small red fish with a large eye, like kinmedai). But on the same menu you can also order stuff like marinated cubed pork blood jelly, peanut with pig tail, pepper pork stomach pickled veg soup, and goose intestines is some of the best stuff in the world.\n\nSo let's just say that 3 stars is overtly generous for MenKee that claims to offer Chiu Chow style \"Da Lang\". If you set your expectations to negative, it might be ok. But let's just say that their offerings do not reflect Chiu Chow cuisine in Hong Kong and it will not remind you of anything, not even close.\n\nThe selections are mostly relegated to stir fry or deep fry. Thus there is nothing that involves cold dishes or cold seafood from a menu glance. There is definitely nothing that is lo shui marinated, except quite possible a \"Chiu Chow Duck\" dish...and even that was sold out last night, and I wasn't feeling $8.50 for a plate of soy sauce marinated duck tongues. So the lack of lo shui marinade eats (and perhaps the low turnover of items from this menu), is a major red flag.\n\nWith that said, alarm bells were going off. Dirty floors, which while may be fine in Hong Kong, seemed out of place in SF. The food is overall affordable (wouldn't say cheap) and if you are looking to fill your stomach without expectations, is perfectly fine.\n\nChiu Chow style chicken with Jinchiew sauce - I really don't know how else to describe this dish, but photos tell a story. What it should really look like:\n\nhttp://media1.ak.yelpcdn.com/photo/xi55wdsIjbFYkxUuys_j9Q/l\n\nBut instead I got black pepper sauce chicken with celery and bell pepper stir fry.\n\nIf they labeled it black pepper sauce chicken in Chinese I would have been fine with it. But sorry, this is not Chinjiew sauce chicken....\n\nChiu Chow Congee - this is excellent in Hong Kong. It does not taste like congee that you and I know it...textural heaven and something about the way the rice and the liquid in the congee interact. But here it is a slop job. $hit.... undercooked congee/overcooked rice drowning in water. I could have made this bad job at home myself. The only saving grace was that they provided a portion of \"hahm suan choy\" (salted pickled veg), very salty...but made it more palatable. Though I have no idea if they made it themselves (doubtful), so likely store bought with who knows what chemicals inside.\n\nOyster pancake - dubbed Chiu Chow style. This was the best dish of the night, and a saving grace. But overall still average. Let's forget for a moment that getting fresh baby oysters is a challenge in this part of town, so the freshness of the oysters is of course in doubt...but it was at least tasty. Putting more oysters in would have been nice.\n\nCheap eat for the area. 2.70 stars", "author": "Ken K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-13", "description": "I'm all for eating sketch food and testing the boundaries of my digestive system, but man, this place took me DOWN. \n\nI had the wonton noodle soup with shrimp dumplings despite the fact that my server seemed as irked by my presence as I was irked by her general attitude. Yes, it was cheap, but I have definitely have had better and was a bit suspect over the dumpling quality...felt a bit mushier and lukewarm than I would have liked. I only made it through 1 1/2 out of 4 dumplings before I decided to just leave cash on the table and make a quick exit. \n\nI practically lived in the bathroom that night, and it was all sorts of bad considering that I had a 12 hour flight to catch in the morning. So, I guess if you do the math for this place, you've got $3.50 for a bowl of noodles + major attitude + food poisoning = so not worth your trouble.", "author": "Clarissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "As best of a bang for your buck as it can get! Hidden gem in sunset with a 70s-80s interior decor and typical Chinese customer service, but for the price, quality of food, portion size you can't go wrong! \n\nMost if not all dishes cost less than $6. Most actually go below $5 with huge portions! They serve traditional Chiu Chow Chinese food which is hard to find in the bay area. They have one of the best salt and pepper calamari that I've had in the bay area. Don't expect top notch service here, but expect inexpensive and top quality food! You can take out or dine in. \n\nThe food is authentic! Be careful though CASH ONLY!", "author": "Wilson P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-18", "description": "Okay I've been coming a lot and the waitress that they have is really slow. She doesn't look up when customers are trying to get her attention for either an order, bill, or asking for extra condiment. Seriously come on. You've been doing this for a while that I've noticed and you would think you would have improved but apparently not. Based on that, service is not that great and the place is mediocre (i.e. Tables are still sticky after being wiped down). But their food is good and their prices are reasonable. Only complaint I have is their service needs GREAT IMPROVEMENT", "author": "Maile W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "This was a solid 3.5 star eating experience, the main pluses being that it was fast and cheap.  \n\nI ordered beef noodle soup / wonton, and my lunch companion ordered the wonton soup with BBQ pork.  \n\nOur bowls came out quickly and piping hot, with simple but tasty broth with a good amount of stuff -- a nice lunch for $4.75 each, with tax and tip.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-12", "description": "This place has poor and slow service. I was with 3 people and we were the only people in the place but it took 25 min for our food to come. They only had one cook and a bunch of togo orders that they made before my order. What the heck? That's not very considerate.\n\nI've been here a few times and here are thing things that have always been the same:\n\n- inexpensive food\n- meats and tofu tasted spoiled (not fresh)\n- restrooms are smelly and dirty\n- service is slow and not friendly\n- tables and floor are sticky\n\nThe people who work here look like they are trying their best but that's just not good enough. The kids who take the orders did not look happy.\n\nI only return when I'm in the area and want cheap Chinese food.", "author": "Stormtrooper N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "I love Ming Kee because their food is authentic. I can count on having a good Chinese meal here. I can also count on it being a little dirty, but hey, if you've ever been to HK, this is nothing so be quiet and eat your food!\n\nThe two dishes I HAVE to get here are: 1) Wonton noodle soup. I know it sounds simple but they make it SO delicious. It's one of those dishes you can eat without ever putting your chopsticks down. I don't know if its the noodles (do they make it themselves?) or the soup base, but the combination of all the flavors is just amazing. You can add whatever meat you want in there. I normally like duck. SO YUMMY! 2) Fried tofu. OMG. I love this dish. Super crispy on the outside, warm and soft in the inside. It's perfect every time, every piece. The black sauce they use over it compliments the dish so well.\n\nWhat I also love about Chinese food - it's cheap! Good food for a good price. Can't go wrong here.", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-30", "description": "Menkee looks like an hole in the wall. all the walls have menu items written in chinese on them.  service is so so by a teenager, probably a family member.\n\nreview won ton only:\nsampling: won ton noodle soup (2.95)\n-noodles chewy, seem not totally coooked yet\n-5-6ish large won tons, tender bland filling of pork and shrimp \n-msg broth.\n\nleftovers:\n-not sure if this place is chiu chow or not\n-menu items looked typically cantonese.\n-food value, 4 stars.\n-menu price (3.50), on wall take out price (2.95)\n-bulk orders (5# + special pricing) to go.\n\nchinese lessons       mandarin\nwon ton noodles        yun tun mian", "author": "Victor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-06", "description": "Hubby loves this place for the cheap price and good quality of beef shank with stir fry noodle in old times.  \n\nWe came to revisit last weekend.  Their chiuchow style dinner set has good value and is actually available all day long. For $19.95, it comes with plain porridge, spiced salted silver fish, onion stir fry chicken, pickled turnip with egg and deep fried tofu.  The silver fish and the pickled turnip with egg are good, the chicken is a disappointment as it seems like Panda Express stirfry.  \n\nThe restaurant has been around for quite some time, but the maintenance isn't up to date, so everything is pretty old and dirty.  We also ordered some chiuchow style food to go, the satay beef stir fry noodle, taro sausage fried rice and garlic eggplant.  They are so so, not impressive.", "author": "LeeLee C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "If a can give 0 star I will. Walk in the waitress ignored us. When I get her attention and ask for a table for 3 she just walk past me n pretend she didn't hear us. I saw a couple came in n same thing. They went  n sit down so we did the same. The waitress saw us sit down n still didn't service us after 10min. She just Keep packing her to go order n there ppl asking for tea n menu n she ignore everyone in the restaurant. After 15 min in there we decide to get up n leave.", "author": "Sa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "Great cheap food.  Beyond horrible service but it's actually kind of hilarious.  The waitress, who's family of the cook, is sooooo bad and she doesn't f ' ing care.  As long as you don't either, it's a cheap, tasty meal.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "cheap, but good food. We ordered their 19.99 set dinner and couple more dishes. Everything taste good! But the service was mehh. its good for a causal family dinner!", "author": "Suki W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "I believe this is the cheapest place that serves Cantonese food in the Sunset District.  It is the most affordable place to get Cantonese food.  Most of their customers ordered take outs.  Dine in experience was hilarious and bad.  We were screamed at by the wait staff (owner's daughter) while waiting to be seated.  It didn't bothered me much since I cared more about the food than service.  Also, I was well prepared after reading reviews on here.  My date and I dined in and left in 20 minutes.  The kitchen worked fast and food was on the point.  I will order take out next time.  AVOID using their restroom unless you really have to go.", "author": "Steve T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-21", "description": "No one wants to be the third pick. Although things seemed to work out for Michael Jordan when he was the third pick of the 1985 NBA draft. But of course there were several dozens of players picked after Michael Jordan. In this case, being the third pick also means being in last place. \n\nThere's basically three Wonton Noodle joints on Noriega, and this one is my least favorite.The Wontons aren't very tasty and the broth wasn't very savory. This is also the cheapest of the three, so maybe you're getting what you pay for.\n\nBut there is one thing here that I had that was very good and I don't know where else to get it. It's a ChiuChow style Egg Roll. It's basically Chinese sticky rice with Chinese Sausage wrapped in an egg roll wrapper and fried. Yeah, it's as good as it sounds.\n\nThis place is cheap but there's other options close by that are better. But do come here for the ChiuChow Egg Rolls!", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-20", "description": "My family has been going there for years b/c the food is pretty delicious. After many take-out trips and happy dinners, we became very loyal to them...until now.\n\nRecently, they changed management and the service couldn't be more disgusting. Don't waste your gas to get there and waste your efforts in finding parking just to eat here--unless you don't mind being ignored, getting sassy replies, eye-rolling, lack of respect or apology for customers and purely horrible service---then please proceed at your own will.\n\nNo food is worth the high blood pressure. Especially Menkee!!... Epic fail and big thumbs down for them. So long for our patronage with them. We'll take it elsewhere.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "The food is OK but they have terriable customer service. The waitress there will ignore you whenever you ask for something. I will order to go only", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "If you don't give a balls about service and just want quick good food, this is for you. The cook can be cranky from time to time creating an uncomfortable atmosphere for the customers while he wails his potty mouth on his family helpers but bring a pair of ear buds and taste the food and it's like symphony ! Don't forget to order those deep fried little fishes in the appetizer section!", "author": "Jimmy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-31", "description": "Now I normally don't like it when people complain about service at Chinese restaurants, especially the hole in the wall types.  They're generally not being rude, they're brusque cuz they're tired and in a rush.  But they'll help or do what you ask.  It's just their tone that isn't super polite and sweet.  The young chubby girl is a total bitch here though.  I went to ask if they had beef dried noodles in a party tray.  She said no.  Brusquely, but no big deal.  So I ask what is on the party tray menu.  As rude and as much attitude as you can get, she yelled at me that it's all in the menu waving in some general direction towards the door.  I wander over and find the party tray menu.  It WAS on the fricking menu!  Bitch doesn't even know her own menu that only has a handful of items on it.  Screw this place.  It's not that great anyways.  Food is only a 2 star anyways except the salty fish fried rice which may be a 3.  Apparently Hing Lun does party trays too.  They taste better anyways. Just buy from Hing Lun or the myriad other Chinese restaurants and avoid this place.", "author": "Richard N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "When I was in high school many many years back Menkee was the place to go for chinese food. Little did I know that this place was much more than just ying yang fried rice and seafood combo panfried noodles. \n\nThis place serves tasty chiu chow style cuisine! Now me being the best ABC there is, I wont be able to tell you the names of these dishes, and I really dont want to play the game of having to describe the contents of the dish and having you guess what it is. When I find out the names I will definitely update this review.\n\nLets just say for the price and the quality/quantity of the food I was very impressed. \n\nOne more thing, please note that you are going to end up smelling like food when you come out of this place. Even if you sit by the window the smell will just cling on to you...just like eating at a korean restaurant.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "Need some fast food?\n\nNo problem. This place will do the most best darn wonton and chow mein hong kong style with the least amount of resources on your pocket book.\n\nThe quality of food is excellent and the service is good.\n\nAll transactions have to be made in cash though. If you're still on the control grid, this place must suck to you. But who needs the card when you could buy a whole bunch of food for pocket change anyways.\n\nI avoid hanging out to eat and go with the take out. With that you all get 10% off each order to go.\n\nBesides nothing beats going home to eat 2 orders of noodles with a hot bowl of wonton. Yeah!", "author": "Jacen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "$3.25 for a wonton noodle soup. It does the job. Beware tables are sticky and angry asian woman is working at the kitchen counter. If you need a quick bite while doing your laundry next door, come in here. Don't expect the teenager waitress to crack a smile while taking your order. Cleanliness of place is questionable but you pay for what you get.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-08", "description": "They are dirt cheap dirty hole in the wall home style chinese food. \nIf you order to go, you get a certain percentage off your take-out item too.\nI sometimes stop by here when I miss my grandpa's cooking. I tend to go with their noodle dishes and cubed pork blood.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "I really used to love this place. Perhaps it was one specific childhood/teenage memory that always led me back to this place. I always remembered the won ton noodles being amazing. It's been a at least a year or two since I've been back, so it crossed my mind the past couple days.\n\nYesterday I had a won ton noodles craving, and headed over to Ming Tai Wun-Tun Noodle. Today, I ended up here and had won ton noodles for the second day in a row. Unfortunately, I must say that I did not let my childhood memories cloud my judgement today.\n\nThe won ton noodles were a complete steal! They were about $3 a bowl, which is pretty much unheard of. There is an extremely extensive menu, and I saw the majority of other people eating plates (noodle plates/rice plates etc), so perhaps there are better dishes than just won ton noodles. \n\nThe won tons were just alright, nothing special at all. The shrimp didn't seem to be as fresh, and not nearly as much or as big as Ming Tai. The noodles were a hit, just like I remembered. They had that bouncy, chewy texture to it, which is an absolute necessity for won ton noodles. The soup was good as well, and I like that they put a few pieces of lettuce in there as well.\n\nNow the restaurant itself is sticky icky, and I barely wanted to touch anything. This place is definitely run down, and they get a ton of to go orders, so don't expect to get very attentive customer service. \n\nOverall, this spot has AWESOME PRICES, and great won ton NOODLES. But I don't think it'll be the first place that comes to mind anymore when craving won ton noodle soup.\n\n3.5 stars", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-24", "description": "The best and worst that comes with a divey, hole-in-the-wall Chinese noodle house.\n\nI realyl did feel like I was back in my grandparents village when I went it, with both the need to wipe EVERYTHING down as well as anticipation for some downhome cooking.\n\nBoth were pretty true.\n\nSo, I might go back just because the wonton that I got was pretty good (Not huge portions) and it is convenient to another place that I frequent. This is not quite a \"try at your own risk\" kind of place, but be prepared to feel like it when you first come in.", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "This was probably the dirtiest restaurant I have ever eaten in. Anyways. The wonton soup was ok. Kind of salty and the broth wasn't very \"clean\". The pieces of pork weren't all that good. Not sure I would go back there again.", "author": "Ddc C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Been coming here for years already and the food is good. We come here for cheap Chinese dishes. The service sucks, but good food though.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "Just finished a $5 bowl of egg noodles with beef and wontons. Called for takeout, was there ten minutes later and it was ready. Cannot complain at that price and it's good. Good amount of beef and wontons that I wasn't wanting more. Some cabbage. Soup was more on the light side, in flavor, but added sriracha at home and it was perfect.\n\nI can see that the service may be lacking - but it's a Chinese restaurant - the girl there seemed to be an bored/unenthused daughter that has to work there....\n\nI'll try it again.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "Folks, it's all about expectation. When I walk into Gary Danko and someone gives me sass, I get upset. Ok, I've never gotten sass at Gary Danko, I guess a better example would be Koi Palace. But you get the point... at an expensive place, you expect quality food with nice surrounding ambiance plus friendly service and for all that you get a good size bill. \n\nAt Menkee, you can expect good authentic Chinese food but that's it. The restaurant and the furnitures look pretty old. I only do take-out here so I've never had the displeasure of visiting their bathroom but I can imagine how it is. The waitress is a young girl who doesn't smile or say very much.  Don't expect a \"Hi\" or \"Bye\" or \"Thank you\". Although she did thank me the last time I was there, it's better to not expect it. She just kind of walks up to you with her note pad, you tell her what you want, she writes it down and then she walks away. BUT she seems (as I've said, she's a lady of few words) to have good command of the English language, which is uncommon in this type of restaurant, my orders have never been messed up. \n\nI usually get the minced beef in ho fun soup or the beef with scambled egg over rice. Dinner under $5. Where else can you get this?", "author": "Connie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-04", "description": "This place is always busy with take-out orders.  The food is cheap and decent.  You can get alot of food without paying an arm and a leg...most dishes are around $5.  I like coming here because its conveniently located near my house.  So far, I've only tried their noodles dishes and jook.  \n\nToday, I ordered the Menkee House Fried Chow Mein( http://static.px.yelp.com/bphoto/wWYrq2bGjhHkYUA0Kbbb1w/l ).  I opened my togo container to find that it had a variety of seafood and meat.  Seafood and meat for $4.50???....can't beat that!  I just wish it had some veggies in it besides green onions.  \n\nCheap and convenient....I'll be back for more!", "author": "Patra I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "my familys favorite dish here is beef and scrambled eggs over rice. very tasty dish. i dont know what kind of rice they use but it gets hard the very next day if you have leftovers. the kitchen is visible from the front entrance and dining area and if you dine in, be prepared to breathe in all the fumes from their cooking. they have commercial hood vents but it doesnt seem to work that well. i personally dont like to eat there so i dont have to smell the cooking. when i order take out i wait outside because i cannot stand the smell of cooking inside with large chinese woks. btw, this is not a fancy place by any means. its cheap and the food is good.", "author": "Ray S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-19", "description": "10% off to go orders\n\n\"Sang chow\" beef fried rice. My sisters like getting some kind of jook. The food is just alright. The fried rice has a soy sauce color but doesn't have that much flavor outside of the beef.\n\nThe jook is alright but it just tastes like some MSG to me.", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-29", "description": "I use to come here a lot because they pretty much would accept any request you have if they have the items...also they had a 10% off for to-go orders before.  \n\nRecently went back and had their chui chow style porridge with the little anchovy look-a-like fish (bak fan yu).  Those items is always a pleasure to order here...but then again...not many other places have this.  I always get their deep fried intestines..another great treat as not much places serve this in the city (that I know of anyways besides Lee Ho Fook on Clement).  \n\nThis place is cheap, fast and worth the price.  3.5 stars!!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-13", "description": "I swear this place has been here forever!\n\nI remember Menkee for being a staple at many b-day parties at home. My parents would order party trays of fried chicken, chow mein, fried rice, etc...\n\nThis place is cheap. And the food is good enough for the price. I would equate this as a higher Chinese food version of Chuck E Cheese. Kids will enjoy it. Adults will enjoy as well... with a beer or three.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Really like this place for takeout.  Eating in is really a hole in the wall experience.  Food is really good and fresh.  Oh, and very reasonable.  Check it out!", "author": "Dkac C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "Their prices are pretty inexpensive and the quality is pretty good too. Easy to order and to pickup.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-12", "description": "blah.. Went there last night.. March 11, the Wonton tasted so funky.. it had a metal taste to it.. my wife, brother in law, and I will never go there again.\n\nBother in law said.. \"I would recommend the Wonton noodle to people i don't like \"  haha..\n\nIt's really dirty.. bathrooms are disgusting.. when i was a kid.. we rated the restaurants with the best foods had the nastiest bathrooms.\n\nthis was not the case with MenKee Wonton.  It had a horrible Wonton and a horrific bathroom.\n\nWe also ordered Chick with Salted Fish Fried Rice.  That was pretty good.. not the best.. but good.\n\nthat's the only reason why I give it 2 stars.. BEWARE OF THE BATHROOMS!\n\nwaitress is family daughter.. not too fun to order from.  overall experience.. horrific.\n\nagain.. BEWARE OF THE BATHROOMS!!", "author": "patrick p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "Came here pre- workout wit my workout buddy last Thursday, We were hungry and didn't know what to eat. We wanted something cheap but filling. The place itself looks like a laundry mat when you enter and when you are seated it reminds me of a typical Chinese restaurant in HK or China even tho I haven't been to either. I have seen a lot of Chinese movies. lols\n\nMy buddy ordered the Tomato Beef over panfried noodle and I wanted Wonton Mein with bok choy but they only had wonton soup so i asked the waiter if they could throw together a wonton mein for me. He said is was fine, awesome love it wen a restaurant doesn't mind if you add stuff and the awesome part was that he didn't even charge me more.\n\nMy Wonton mein came first and it was a bit small but i didn't want to eat too much before working out. After finishing it i was not full and figured next time i would get something a little more filling. Thank god for Builder bars otherwise i would have ran out of energy at the gym. Overall it was good I got about 4 wonton, a decent amount of noodles and about 3 enormous Boy Choy. It was all good but i jest wished that they would have cut the bok choy into smaller pieces.\n\nOur bill was about 9 bucks btw us, Cheap but good eats!!\n\nAnother thing i wanted to mention was that they have Chiu Chow dishes.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "I don't know why this place gets such low ratings. I've been getting takeout from here for ages! The 10% off for takeout only is definitely a plus. You can call in and usually pick up the order within 15-20mins (they don't deliver). I've actually eaten inside a couple times. It's pretty dirty inside and your clothes will stink due to the fact that they have an open kitchen, but I do find that you get a little more food when dining in. \n\n\nIF YOU WANT CHEAP, GOOD FOOD, THEN GO HERE.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "Always my go-to spot when I'm feeling broke and craving for Chinese food. Service and atmosphere may be lacking but the prices make up for it. Also, my favorite is their scrambled beef chow fun and the satay beef! Sooo good!!!", "author": "Giana F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-06", "description": "I used to come to this place to eat with my grandma ALL the time!!! Since about 2 years ago, they've changed owners, cooks and waiters/waitresses and it hasn't been the same since! \n\n~Pro~\n-cheap\n-can find parking\n~Con~\n- horrible table service *towards my grandma no less!*\n- food was too oily\n- tables & chairs were sticky!\n\nOverall, was once a great to go place to eat, not anymore!", "author": "Selina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "The service here is not excellent, but their food is absolutely tasty. Must try the beef ho fun,, it's so good! Also the fried seafood noodle is also really tasty. It's not a very nice environment to sit in, but the food is worth going there.", "author": "Yashan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "i love family owned local venues like these. food is delicious! growing up in san francisco chinatown, i have become accustomed to a \"peng, liang, jiang\" mentality: basically a quality equilibrium in price, appearance, and taste, and i have to say menkee definitely is \"peng, liang, jiang.\" \n\nthe chefs prepare the food the way it's supposed to. for example, the fried food is fried to a golden brown color and crispy texture...not to greasy and right amount of flavor!\n\nwonton soup is very refreshing and comforting. you don't get the msg feeling afterwards. \n\nin southern chinese food culture, \"wok hei\" is very important. menkee's woks are definitely hot! the dishes remain steamy even when we're halfway through with it!", "author": "Alan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "After eating here regularly now, I seem to like it more and more. Yes, some people may say its too saltly or the place looks really dirty, but give them a chance. What is there to lose but 5 bucks?", "author": "kim w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "Years ago, someone I knew who also had a business on Noriega Street told me Menkee made the best hot and sour soup (since that's my favorite since childhood).  She was pretty much correct (with some competition among other restaurants, of course).  Most of the other food dishes are average to good.  I usually order something from the chow mein menu in addition to the soup.  Service can vary depending on who's working as the server during the particular day.  I came by a couple of Sundays ago where the lady (probably the owner's wife) was so disorganized and challenged that many gave up and left (including me).\n\nThis is supposed to be a Chiu Chow restaurant.  I am disappointed they don't serve Chiu Chow style duck like the VHNoodle Restaurant at the Pacific East Mall in Richmond, which is also Chiu Chow noodle style.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "Food is super cheap but I prefer to take out rather than eat here. Very barebones type of place. I decided to write a review because I do have to tell Fish Porridge lovers in the city that this place surprisedly has awesome fish porridge and for a good price!! I am not so big into the other dishes but the garlic broccoli and spicy eggplant deserves some mention too.", "author": "Gillian Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-31", "description": "You want some wonton fast. This is the place to go. Order it to-go and you get 10% off your bill. \n\nI'm pretty sure everything else on the menu is good and decent. I've only had a few dishes here, chow fun (beef, or tomato beef), and wonton noodle soup. \n\nIf you come here to eat don't expect table cloths and the wait staff to be friendly and smiling. It's a place to get good, cheap Chinese food and relax. No need to always be fancy.", "author": "Leanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "Woohoo!  Cheap and authentic Chinese food to go.\nCome on, where else are you going to get a satisfying made to order meal for under $5.\nMy favorites:\nSingapore Rice Noodles\nMinced Beef Over Rice\nSalted Fish with Chicken Fried Rice\nTomato Chicken Chow Mein\nCurry Chicken Crispy Noodles\nThousand Year Egg w/ Pork Porridge\nDried or Wet Fried Beef Chow Fun\nBBQ Pork Wonton Noodles w/ Vegetable", "author": "Food N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-23", "description": "Didn't realize that this place was a won ton house till now. I had been coming here since back in the early 90's. The only bad part, is the food quality has not been keeping up..", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "Don't be fooled by this \"dirty kitchen\". Ok yea, it really exudes that vibe, but who cares?! The food is cheap and delicious.\n\nFirst off, back when I was in college, they had $1.95 for either Wonton Soup, Wonton with Noodle Soup or Chicken Rice Porridge. My friends and I always said \"let's eat at 2 dollar soup!\" Real talk, that beats your normal Ramen Diet for any college folk. The wontons aren't skimpy either - minced meat with a shrimp tail inside. For Wonton soup, you get about 8-10, which you get 4-5 with the noodle soup. \n\nI guess with the economy changes, so when we went last night it was $2.95. No big deal.. \n\nAlong with that, we ordered Beef Fried Rice, Chinese Broc w/ Oyster Sauce and  Tomato Beef Chow Mein. I've had many other dishes there and enjoyed it... especially for the price. \n\n4 soups, 3 dishes = $30\n\nI'll take dirty kitchen any day.", "author": "Alyson C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "I love their jook (rice porridge) It has the most flavor. I usually get the preserved duck egg with pork for $3.50.\n\nNow they have these deals where if you sit in and eat, you can get won-ton noodle soup or just won ton soup or chicken porridge for $1.95! \n\nIt may seem a little dingy, but the service is good and the food is excellant.", "author": "Janelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "My BF orders take out from here during his lunch and usually brings me home the left overs. I know, i'm like his garbage disposal, though it should be the other way around haha... it's all out of love I tell you.\n\n$5.00 for an entire box of chowmein or mongolian beef over rice or whatever the heck you decide to order...are you kidding me?? The food here is definitely worth the price- you seriously cannot beat that!", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-12", "description": "Spicy salted squid.\n\nMmmmmmmm.\n\nSPICY SALTED SQUID.\n\nMMMMMMMMMMMMMM!\n\nWhen I go home, this dish is near the top of my \"must have\" list. I just plain love it -- from the garlicky green peppery \"junk\" that lingers on my rice long after the squid has disappeared into my piehole to the firm yet tender squid that is steaming hot as it arrives at my table.\n\nThe atmosphere at this restaurant is really just non-existent. The click-clacking of the little electronic good luck figurine of an old man fanning himself is borderline annoying. No matter, though, because you're really just there to chow down on inexpensive homestyle Cantonese-style cooking.\n\nThis restaurant earns itself an extra star for its amazingly affordable take out trays of chow mein, chow fun, etc. At $2 per pound (with a minimum of 5 pounds), the price means you do NOT need to trek down to Chinatown to load up for any parties.", "author": "Audrey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "I would of given Menkee 5-stars if they didnt paint their kitchen windows! I used to look forward to watching the chefs cook my order with their huge woks and long spoons. it made me feel like i was in the kitchen.\n\nbut as all good things come to an end, they finally got fed up with people staring at them and decided to paint the windows an orange redish color?\n\nmy favorite dish is the \"egg and prawns over chowfun noodles\"... so good.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-14", "description": "This place is pretty dirty and jank but I tell you they have some good grub.  You must must must get the salt and pepper fried fishies...they are sooo addicting.  Also the sauteed liver with green onions and ginger are good too.  Just make sure its not over cooked or it will be dry.  The next dish I recommend is for a brave eater...the fried larger intestine.  It is soo crunchy and good but it is a bit gamey so fair warning.  I suggest to also get the pork blood congee to cleanse some of the other oily dishes.  Most of the good dishes are listed in Chinese unfortunately but I still love this place even though its a dirty hole-in-the-wall.", "author": "Jody C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "Worst customer service...ever.  The waitress never acknowledged my friends and I when we walked into the restaurant so we sat ourselves (most of the restaurant was empty).  We waited for about 20 minutes but she never came by to take our order.  After realizing that the waitress could care less about her customers (and we were really hungry), I walked directly to her and informed her that we were ready to order.  She hardly glanced at me as I spoke.  We waited another 15 minutes before we walked out.  As I was on my way out, I turned back and said, \"You are a terrible waitress!\" and without looking at me, she responded, \"Yeah, ok...ok.\"  Wow.  Needless to say, I will not return.  I was extremely disgusted with the bathroom/restaurant and service.  The silver lining of this experience? The waitress' terrible service or lack thereof probably saved my friends and I from getting food poisoning.", "author": "My N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "This place have the Best chinese FOOD in SUNSET. Honestly This place might not look good on the outside, but the Inside is the suprise!! Price = Good, Food = Good. what more can you ask for? remember this is not a 5 star resturant. but it is family owned. So when i eat their food i always think about food i be eating at home. brings back the family taste!", "author": "Johnson C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "Never ate in and never will. I do have SOME standards.\n\nHowever, under $5.00 for a take out?? Now that's for reals. This is SF, people, where most valets cost more than that.\n\nTherefore, for the price... any time, my friend, any time.", "author": "Stanley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-01", "description": "This place specializes in chiu-chow style cooking. We usually order some small dishes such as the salt-n-pepper, small, white fish and the stuffed combo (egglplant, tofu, bell pepper) and have that with plain porridge. I personally, prefer the regular, Cantonese style porridge. The chiu-chow style porridge is just cooked rice served in hot water.\n\nOverall, the prices are rock bottom for tasty chinese food so try to overlook the whole-in-the-wall decor.", "author": "Cuisine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "When i'm lazy i usually come here for my take out orders, fuken fried rice is good one of the menu items i order all the time..The place is usually empty the the take out orders are stacked up high, the $$ for the value is great... and the portion size is good for me,but since i come pretty often they usually hook me up", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-24", "description": "Cheap eats. Great food. I really like their mongolian beef over rice. Takeout and 10% off. Reason for only three stars? DIRTY. DIRTY. DIRTY.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-08", "description": "the restaurant doesnt look that clean but i love the fact i can sit and watch the cooks prepare my take out in front of me. i wouldnt eat here but take out is good especially since they have 10% off ALL take outs.\n\ni agree with everyone's review -- their wonton is really good.", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-30", "description": "Simple, affordable and tasty neighborhood Chinese restaurant. Their congee (rice porridge) and their chow fun are both very good and compares favorably to other Chinese restaurants.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-23", "description": "Really good value place!  Very comfortable down home spot to grab a meal.  Not the cleanest dining room in the world but you could always do take out cause they have had that 10% off on take out orders pretty much since they first opened.  \n\nMany things on their menu appeal to me.  If I lived closer to here, I would certainly be here much more often...", "author": "Mark W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-23", "description": "So in my quest to try all the won-ton joints in my neighborhood, I tried Menkee Wonton.  The menu has some unique items, but most I couldn't try because they contained meat.  So what did I end up ordering?  The plain congee.  It was good, and only $1.75 for a huge bowl.  I just wish that I didn't have to ask for green onions, and I wish that they had Chinese donuts on their menu.  If I do ever want Menkee's congee again, I'll order for pick up.", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-30", "description": "For the past month or so, I have been here at least 3 times, after i found this place on yelp.  I was craving Wontons and had no clue where they made good wontons...took my chances and came here.\n\nAt first when we arrived i thought it was weird that i had never noticed it.  Decided eh WTF....lets try it.\n\nThis place is called Wonton for a reason ppl....other than the wontons, none of their other dishes really appealed to me.  The beef stew wonton would have been tastier if there weren't so much fat in the BEEF!  if i could at least have some beef.  Eh no complaints...its cheap...what can i say.  I really like their Wontons, it taste sort of like home made wontons that mom or dad would make....i just didn't like the fact that they lacked variety in noodles...it was either wonton noodles or the ho fun.....bleh i favor neither ....\n\nDefinitely worth every penny for Wontons....Oh, the BF ordered the fried rice one time and it was really nothing special at all....again...i must stress, this is probably a hot spot for WOntons only.!", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-13", "description": "Speaking purely from a noodle/chow fun take out perspective.....the portions have gotten smaller and smaller.  Flavor is fine.  Food was not greasy.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-27", "description": "when im sick i come here and buy jook. its cheap. but i used to get food here. the chicken curry which wasnt very good but it was cheap. i used to think i would get more chicken if i said no onions but nope, theyll just add in more bell peppers. haha.\nits pretty dirty in here but its cheap, so thats what you get.", "author": "just k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-19", "description": "When you go to one of these places, you don't really expect superb customer service.. but this place is a joke. We had to buy frozen dumplings to cook at home. When we walked in, we were greeted by an angry Chinese woman with bright red injured blood-crusted nose (cringed at the sight. What the heck was that??). She realized we didn't speak Chinese, and pulled her middle-school-aged daughter from the back to translate. I guess this daughter is at the peak of her rebellious stage, because she was yelling at her mom about how she didn't want to help and rolling her eyes as she came out. \n\nSo we tell this also angry girl what we want (frozen, UNCOOKED dumplings), and she just yelled something to her mom in Chinese without making any eye contact with us. The next moment, we see the kitchen guy throw 6 orders worth of dumplings in the pot!! I tried to tell them \"No no no..!\" but by then the lazy little girl with the devilish attitude has walked away. When we try to tell the woman, she waved her hand at our faces as though she was annoyed that we were trying to talk to her when she didn't understand English. Outraged, I tried to walk out of the restaurant. Then the guy from the kitchen came out ask us what the problem was. He barely spoke English too, but was kind enough to listen, and gave us what we wanted. No hassle. He was actually happy to hear that he didn't need to cook anything.\n\nAfterwards we tried to pay, and the angry woman with the bloody red nose snatched our bills and threw down the change on the sticky, oil-slicked table. \n\nThe dumplings were pretty good but the woman that works there probably brainstorms every night on how rude she can be to the customers. I don't ever want want to go back there to see her or her disturbed daughter.", "author": "Laura O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-10", "description": "This was the first place I dined at after moving into the Sunset, and it's the essence of \"nothing to write home about.\"\n\nThe food's cheap, portion sizes are respectable, and there is flavor, but those are about all the nice things I can say. \n\nThe quality of the food is questionable at best and the last three times I ordered take-out, my order was botched by communication disconnects. Haven't eaten there in months and don't plan on changing that anytime soon.", "author": "Ash A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-03", "description": "Dirt cheap and good.  Especially for noodle dishes.  Not a place to linger and sit - get it to go!", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "Menkee is very inexpensive.  The food is tasty and the salt content is low. \n\nI usually order take out food and soup to go.  The daily soup reminds me of my childhood.  Heart-warming broth.  The daily soup is made fresh with meat, vegetables, and dried bok choy.    Yummy.  I grew up on soup.   \n\n\nMy list of favorites:\n\nMixed Vegetables w/ Beef or Chicken Over Rice\nMinced Beef Over Rice\nBBQ Pork Wonton Noodles w/ vegetables\nDried Beef Chow Fun\nTomato Chicken Chow Mein\nSingapore Rice Noodles\n\nI recommend Menkee for an inexpensive lunch and/or dinner.", "author": "Ann O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-28", "description": "Walked into Menkee Wonton to place a take out order earlier today. Waited for about 15 minutes and was just ignored by a very disturbed and aloof teenage waitress. When she walked by I asked her if I could place an order. She ignored me and nearly knocked me over. Not needing that type of attitude I decided to leave. Very odd way of running a business.", "author": "G N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-07", "description": "I don't even want to give them a star but it's required by Yelp. I know this is not the place to go for superb service but I didn't expect to get kicked out asking for hot sauce. The pathetic waitress kicked me out when I asked for hot sauce to compliment my fried rice. She simply said, \"no, leave\"! I was floored by her attitude and statement, I just left. Really, what do you say to that? I'm a business owner and I just don't understand how can one treat a customer that way. Well, I won't be giving them my business again even though they are in my neighborhood.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "No frills mediocre hole-in-the-wall chinese food. Relatively cheap. Alright. Can't say more until I try it out a few more times.", "author": "Dijon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-18", "description": "I would go here quite often a couple of years ago.\nOf the sunset \"wonton\" spots I patronize, this one is number 3 on my list in this order...\nJust Wonton\nWonton House\nMenkee\nI usually order either chow fun or Singapore chow mein here.\nHere's a cool, funny, or useful story I have for this place....\nSo, one day I'm chillin at one of my boys' houses watchin a game, and we decide to get takeout from Menkee.\nWe order whatever we ordered, but my boy also orders the \"deep fried pig bowels\".  Basically pig intestines deep fried, sliced, and served with a sweet/sour sauce.  Now, I've eaten intestines before.  Beef intestines, pig intestines,,, \nEntrails are yummy.... usually.  \nI'm used to intestines being sliced lengthwise, scrubbed, scrubbed, scrubbed, scrubbed, then scrubbed some more before cooking. \nThese were sliced cross-wise.  Hmmmm..  \nThe aroma of dookie is sometimes present...WHAT?  Yup, its INTESTINES, remember?\nSo here's the good part.  I eat one... okay.  On the second one....I feel this round thing pop out of the piece of intestine...\nHMMMM...\nRather than bite into it....I spit it out....\nhere's the kicker...\nwhat is it?????\nA ROUND, HALF DIGESTED, KIBBLE OF PIG FEED!!!!!\nUUUUUGGGGHHH!\nNeedless to say, although I still eat from here.... My frequency has dropped by about 95%.\nLike I said.... cool, funny, or useful...\nThere's no vote option for \"omfing disgusting\", \"holy good gawd\", or a quick link to SF Dept. of Health yet....", "author": "Barry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "ok i changed my mind.  instead of 3.5, i think it deserves a 4.\n\nthe curry beef chow fun is everything that you dream of when you think \"curry beef chow fun\".  the chiu chow dinner menu A is quite good and VERY reasonably priced.  \n\nfrankly everything here is reasonably priced.  and quick.  good \"home cooking\" for ABC's", "author": "Jason J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "I'm being generous with the 4 stars, really its a hole in the wall.  But guess what?  They also serve you food for less than $5.99 a box and tasty, that the head chef cooks readily on the spot.  You can watch him cook your food after you order and the food has never failed to satisfy my hunger like Mongolian Beef rice, Dry Fried Beef Noodles, and Fried Fish with corn.  I would much rather eat here than at a fast food joint or panda express, its much healthier and authentic.  Oh and for $3.00 you can even get wonton noodles.  Can't beat that.  I come here not expecting a fancy meal, but homey unpretentious cooking.", "author": "Peachie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-27", "description": "I really want to love this place since it has that special hole in the wall appeal, cheap prices and some more unusual dishes.  Chiu Chow style is similar to Cantonese.  I've eaten here several times (because they serve congee) and I've never had anything that made me think this is really good...or really bad.  It's on the bland side.  I don't mind non-spicy, light dishes.  If they are fresh and light, I actually really like them - but this place doesn't come across as having fresh and light dishes.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "I was craving wonton.  I drove past a couple places in the sunset with no luck in parking.  I always drove past Menkee Wonton but never went.  Now there was parking, so it's fate.  Walked in at 11:30 on a Sunday, it was empty.  Ordered togo, and it took 5 minutes.  $2.88, out the door.  You get what you pay for.  Only about 4 wonton, but alot of noodles.  It was filling, cheap, but I might need to go find more wonton now.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "Cheap wonton mein for $3.10 if you do take out! 6-8 giant won ton balls and lots of noodles. Good for a snack or a cold night and a movie at home.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "My favorite \"hole in the wall\" chinese food place!!! \"Wok Hay\" is incredible. I go there 2-3 times a month. 10% on Take-Out!!! Not the cleanest looking place, but the food it spot on! Fried Silver Fish is great, Deep Fried Tofu is closest to old Chinatown!", "author": "Terry O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-21", "description": "This is a great place for take out because the prices are on the inexpensive side  which I appreciate. Plus it close to where I live another plus. Just for those reason I give it 4 stars. The food here is not bad and service decent. My order came pretty quick(tomatoe beef chow mein, crispy noodles style)  and I have to say it would of cost more at other places. The portions are on the generous side too. Have to come here more often.", "author": "Leon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-14", "description": "I've always been curious about Menkee Wonton, with it's \"10% off to go order\" banner and it's stack of cardboard boxes in the entryway, it had some hole in the wall potential. After walking up and down  Noriega in the drizzle I decided that a bowl of wontons was needed. \r\nThe small dining room is surprisingly tidier and more pleasant than the entrance lets on. I went for the take out option and the order taker lady was pretty friendly. Duck wonton soup to go, $4.83 including tax and the discount, was a decent 3 star bowl. It was difficult to opt for Menkee when my favorite wontons were down the street, but I had to satisfy the curiosity. Lightly flavored broth slightly enhanced with msg, held a flotilla of small, brussel sprout sized wontons. The skins were the appropriate thinness without any doughy bits. The ground pork and chopped shrimp filling was serviceable, but nothing to write home about. A sprinkling of chopped scallions and some cabbage added balance. \r\nMenkee's strength is their low prices and varied menu. Run, don't walk, down there to get on the special of dried pig skin and pig blood with chives for $3.25/lb. Seriously though, I'll probably drop in from time to time to grab a rice plate ($4-5) or something new (to me) off their Chiuchow style special snack menu. This one's on the 2.5-3 star border.", "author": "Candice L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-08", "description": "Though I've frequented Menkee often through the years, living a block away, I think their mediocre food and what they think of as  \"customer service\" has finally taken its toll.  On a recent visit, having placed a phone order for a chow mein dish, was given a rice plate.  On returning and pointing out the error - on the menu -  was then given a soup dish.  They'd basically swapped the ingredients from the original order and attempted to pass it off as my intended order.  The waitress was firm in trying to convince me fried noodles are served in a broth....well, I didn't create a scene, but there are far too many such restaurants on Noriega.   It's inexpensive, but little more.", "author": "Craig G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-29", "description": "The place isn't all that clean and it looks like they've just moved in - but it has always looked that way. The food is pretty good, the wonton soup is digestible and I find myself being very fond of the Oyster cake and the cuisine's seriously better than the place looks.", "author": "Roger W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-01", "description": "Cheap good grub! Best sweet and sour pork I've had. They make it crunchy not soggie like other places. Usually eat here when I'm doing my laundry.", "author": "Spooky B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-13", "description": "Used to come here with Lily L for the cheap won ton in high school. Just went again for won ton recently and I remember it being more satisfying.  I guess you pay for what you get. Cheap chinese food, especially if you get it to go (10% off). Another plus is that takeout is cooked really quickly, almost right after I finished paying for my order, it was done and ready for me to take home. Which was good cause I was starving.", "author": "Tiff L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-25", "description": "This place went down hill ever since the new owners took over maybe 1.5 or 2 years ago.  This used to be one of my favorite places to go to growing up.  Food used to be cheap, fast, and good.\n\nNow, the food portion is so small that I don't get full with an order of chow fun or chow mein where before I can barely finish it for lunch.  Everything else shrank drastically as well.  The only good thing is the price is still the same (very cheap).  The quality and the freshness of the food is below average.  The new owner IS the chef.  The food does not taste nearly as good as it used to be either.  His daughter and his son are the waiter and waitresses.  The wife helps in the kitchen but does not cook at all.  There is only one chef which leads to my next complaint.  During peak hours, it takes FOREVER to get your food.  I suspect the son leaves the phone off the hook on purpose during peak times so they can catch up with orders.  There were several times I tried to call and would get busy signals for an hour.  One time they were telling me it's an hour wait to get my order as they are all queued up.  What a joke!  I can also hear the husband and the wife yell at the helper sometimes, which is rude and unprofessional in front of customers.  I stopped going to this place altogether.  I miss the old owner.", "author": "Jon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-27", "description": "Ok, so dining in is not such a great idea.. there's bugs flying around and it just looks run down.. so, to make your dinner more appetizing, you order out and eat it at home.. \nmy boyfriend loves this place for the obscure stuff they have, like pigs blood and other 'tasty' (ew) stuff.. i tend to stay away from those things.. but one thing, I really like is there spicy salted silver fish.. they're these silver fish breaded in some kind of breading and salted, with garlic and a little kick of pepper. it kind of gets taking used to.. eating the whole fish, eyes and all.. but once you don't think about the eyeballs you're crunching in your mouth, it's the best thing they have here. you sprinkle some over rice and dinner is totally served! yum yum.", "author": "Mari K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-04", "description": "your typical asian restaurant, you can't beat the price and good food which get your full... looks kinda ghetto but doesn't judge the outside... only ate here once and i love it!", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-08", "description": "This place is pretty DIRT CHEAP, but it's definitely not dirty -- it's just not well decorated like other fancy looking places. If you're the type that's looking for a romantic/fancy atmostphere, this is the wrong place to be. If you're looking for a good and cheap dinner, this is it!", "author": "Faye H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-05", "description": "you're pretty much going here because it's dirt cheap, decent, and fast.  good place to order rice plates to go.  whatever standard rice plate you want, they can make, even if it's off menu.  this place isn't winning any cleanliness awards.", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "the runny eggs over rice with chicken is really good! and so are the won tons. really cheap, around 4-5 dollars!", "author": "christy w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-09", "description": "i am usually satisfied w/ what i order here. i think their salty fish fried rice (it sounds nasty, but its really good) always has a lot of flavor and their fried stuffed tofu is a must! their wonton and noodle soups and their tomato beef chow mein is also pretty good. just your typical hole in the wall chinese restaurant that serves some good chinese food. my friend and i just stuffed our faces w/ 3 dishes for $16 - cheap enough to go get dessert right after!", "author": "Douglas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-09", "description": "Inexpensive, quick, and great portions!  I always order take out from this place and they always have it ready within 5 minutes. What more can I ask for!", "author": "Jason S."}
