{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Disclaimer: this is the restaurant were I met my wife so it's a special one for me :)\n\nI like their sushi's. Last time I had double hamachi and Hawaii. \n\n They also have a good service.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "Being experienced with excellent sushi, this sushi restaurant did not have good sushi.\nI had three rolls and all three were lack luster.\nMy waitress was nice but all business. \nThe prices were ok, but definitely not worth it.\nThe ambience was nice.", "author": "Letter W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "Huge disappointment with the quality of their sushi. I was here with a buddy and we ordered:\n\nEdamame: Didn't taste fresh. \nGyoza: Just OK but best part of a very disappointing meal.\n\nCrab special roll: This roll was disgusting. The crab was bland and it just tasted like a fried piece of mush in between some cucumber and rice. This roll tasted like something you would get out of a buffet that had some sushi on it.\n\nVolcano Roll: Actually, this roll was worse than the crab roll. A typical volcano roll has spicy tuna on top (hence the volcano in the name) of a shrimp tempura roll. The roll served was a California roll with a glob of spicy mayo that was baked. I literally peeled off the quarter inch mayo layer to eat a few pieces and just couldn't anymore.\n\nMy buddy had a simple tuna avocado and salmon avocado and I should've just kept it simple. I felt nauseous afterwards as well. I hate giving bad reviews but sometimes, they're warranted. As is the case here.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-18", "description": "I've been here several times because it's the closest sushi place to my work, but I'd probably be a happier person if I walked an extra 3 blocks and went somewhere that had better food. Overall this place is too expensive for what they serve. And sometimes it takes an absurdly long time to get your food. I waited 40 min for two rolls the other day and ended up having to take most of it to go because I needed to head back to work. Service is also lackluster. They're friendly enough but move very slowly. I also feel like they don't follow their own hours because I've tried to come by several times when I work late and they're never open when they say they should be. I've had several coworkers say the same thing.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "My 22 year old son recommended this place because he had been here once before for the happy hour. I was a little concerned because it is right outside the gates of Chinatown near Union Square, so screamed \"tourist trap\" to me. After grabbing an OpenTable reservation, we were promptly seated, and I was pleasantly surprised at the quality of the sushi.\n\nI ordered the 12 piece chef's selection, which included three cuts of tuna and uni (sea urchin), and a delightful sardine. My son ordered a couple of rolls and crab nigiri, and one of the staff (not our waiter) came over later to offer him king crab instead, which he got and was very happy with. (They also offered me live uni, which I declined!)\n\nAlthough there were 4 people working the floor and our waiter was just busting his ass the whole time we were there, the service was a bit slow and disjointed. There was confusion about dessert and I did get a bit antsy waiting for our check. The restaurant fits 45 people max, and there were about 40 people eating while we were there, but it seemed more of an organizational issue than a too few staff issue.", "author": "David Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "This restaurant was great! Good service, and I enjoyed the rolls. \n\nWe went on the 4th of July, so it was not too crowded. They sat us immediately and were very present throughout the whole meal - it wasn't hard at all to get their attention and they checked on us frequently. We started with miso soup, which is usually my favorite part of a sushi meal. However, the soup was a bit too fishy for my taste. My boyfriend and I then shared 3 rolls: the Dragon, the Volcano, and the Spicy Salmon/cucumber. The Dragon was amazing! It was cooked very well. The Volcano was a bit of a mess. It's hard to separate the rolls since it comes in one clump. It tastes great, but it's hard to eat. I wouldn't recommend it on a first date. And lastly, the Spicy Salmon/Cucumber roll was great - my traditional favorite.\n\nOverall, I enjoyed this place, but I probably would choose a different sushi place if given the option.", "author": "Remy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-22", "description": "TL;DR Overpriced sushi in FiDi\n\nMikaku is conveniently located in FiDi/DT, but not the place for quality sushi. I shared two rolls and a chicken teriyaki with my bf, and the total ended up at $60, averaging out to $20 a dish. All of the dishes were average, nothing spectacular. For the quality and quantity, the price was definitely not worth it. However, this is Fidi, hence the price. I really wanted sushi, but this was not the best option. There are better options elsewhere.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "Had a To-go order to be picked up. Came back with the wrong order and very expensive udon. $24 for a nebanyaki udon!\nWhy does the receipt say Oakland, Ca. ?? When the location is in San Francisco?", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "Was relatively empty during lunch hour which is not a good sign. Got the 9 piece ngiri. The salmon was good but the others tasted a little fishy. They had fresh wasabe which was cool. Did not the find the food was worth the $$ and the employees looked bored.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Very quaint restaurant. Service was great and fish was very fresh. Fantastic beer selection, not just the typical Japanese beers.", "author": "Joseph G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "This restaurant was great! Good service, and I enjoyed the rolls.\n\nRolled through one night after a few drinks with coworkers and enjoyed the experience. They sat us immediately and were very engaged throughout the whole meal - it wasn't hard at all to get their attention and they checked on us frequently. \n\nTried again several times since and the service and quality have been consistent.", "author": "Marc M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-23", "description": "I mean it's a good spot for sashimi, sushi, sake and nigiri, don't get me wrong, but (yes, there is a but) it was just plain solid.\n\nGot the rolls and everything freshly served.  \n\nDrinks are a bit over priced here when one can get beer and wine in this vicinity a bit on happy hour prices.  \n\nDim place.  Aye okay!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Simple lunch: ordered the bento box (tonkatsu and spicy roll) came with miso soup and salad. The rice which came with the bento box was lukewarm (must be a thing here in SanFran). For a quick lunch it was decently priced. We still felt rushed/hurried by the waitress even though there weren't many people present (probably two other couples and one single top).", "author": "Brittanie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "Huge disappointment.  My kids and I were in town looking for some authentic Japanese food close to our hotel.  We found this place on OpenTable and booked a big table since we were meeting friends from the city.\n\nWe started with edamame.  Hard to screw up but easy to make good.  Nothing but steamed pods in a dish for $4.  We had 2 of those.\n\nHad some sushi rolls pre-entree, and the presentation was like something you'd get from Safeway at lunch.  Not impressive at all.  Main dishes were a step up, the noodles and the terayaki were good, not anything to go back for.\n\nService was awful.  Our waiter disappeared halfway through dinner (to his credit he took some great pictures of our table when we asked for shots), but we ended with a waitress who seemed pissed off that she had to cover him.  She should have been happy as they included gratuity. FYI-- I would have left 20% but since you tagged us at 18%, you lose.\n\nI would not recommend this place.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "I have to write this review to say how blown away I was with my entire dining experience at Mikaku!  \n\nCame here with coworkers.  Just a quick walk up Grant from Market.  Very promptly seated.  The menu has all of the typical items that I look for at a Japanese restaurant:  chicken karaage, agedashi tofu, sushi, tempura, udon, soba, beef, chicken, Salmon teriyaki, donburi, and obento!  \n\nI tried the nabeyaki but instead of udon I wanted soba.  Coworker had the beef teriyaki donburi.  \n\nEach meal came with green salad and miso soup.  What struck me was wow the salad dressing was heavenly!  It wasn't your run of the mill watered down soy dressing.  It was full of flavor and actually had body to it.\n\nTasha the owner came by several times to say hi and check in on us!  Pleasantly surprised to find that she opened the restaurant due to her own allergies and because of that they don't use MSG and offer a full gluten menu with 12 separate cutting boards in the kitchen!\n\nBack to the food... Ok I have not had broth this heavenly in a very long time.  Probably not since living in Japan.  My nabeyaki came with tempura that was light & flakey and a big healing bowl of my soba.  Little pools of delectable unctuous goodness.\n\nDo yourself a favor and give Mikaku a try.  Definitely making this hidden gem a regular eating establishment!", "author": "Alicia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "Having spent an afternoon at Union Square, we dropped in for an early dinner. The waitress seated us and took our order promptly. I noticed there was only one sushi chef behind the counter, but there were only a few other tables occupied so it seemed fine. \n\nWe ordered some sushi rolls which should be pretty simple. After 10 minutes, our first item, a volcano sushi roll, was brought to us. The presentation was awful. It looked like a small clump of rice with a thick sauce on top, served in a wrinkled tin foil. It looked less appetizing than reheated leftovers.\n\nIt took another 10 minutes for the rest of our rolls to be served. These other rolls were no better. The rolls were small, and the rice was rolled so poorly that you could see the nori from the outside of the rolls where it should have been rolled with rice.\n\nThe ginger served with the rolls were fine, and the restaurant was clean. It's not the waitress's fault. She didn't apologize for the food taking so long or the presentation, but she did refill our water. For that, they get 2 stars.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "We came here after the Giants and Nationals baseball game.  The restaurant is small, seats about maybe 25-30 people.  \n\nMy girlfriend got us a table for 3.  There was one waiter and it took him about 15 minutes to see what we wanted. \n\nA few minutes later, he asks us to move tables because someone had called in a reservation for 10.  I didn't understand, we should've have had to move just because a reservation was called in. \n\nHe didn't show any type of appreciation. Anyways, we moved and then he came and took our order.", "author": "Aprilyn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "We were walking around Union Square and my son really wanted some sushi for lunch. Tired and hungry we found Mikaku downtown really close to the Chinatown entrance. \n\nAs you walk in, I was surprised this place was so tiny. Not too big. With a fair amount of tables and a sushi bar. Anyways, we were told to find a table and our server with be right with us. \n\nI was so happy that they had a lunch special menu. Looking at it I couldn't help but order the bento box. You can order one or two items. I went for the Tonkatsu and tempura. It came with a salad, rice and miso soup. Not a bad deal. Tonkatsu was pretty good. Nice and crispy on the outside and really good tempura. Even got two shrimp tempura. Nicely cooked and good. Not a bad lunch special. \n\nMy wife got the tempura Soba. She really like the soup on a cold day. She like the Soba noodles and the tempura. No leftovers for her. She liked it a lot. \n\nMy son got his usual. Rainbow roll and my daughter got her dragon roll. They both liked it and thought that the fish was very fresh. No complaints here. Got a bite of the dragon roll and it was really good. \n\nSo the service was good but not too friendly. Wasn't a lot of ambiance. Nothing stood out to me. Everyone eating here was really quiet. Just minding their own business and enjoying the food. \n\nSo the lunch specials were pretty good. Sushi fresh and good service. If your looking for a nice and quiet lunch then this is the place. Enjoy.", "author": "Doug T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "Slow food service, 19 bucks for piece of chicken, dirty house... You can buy the same cake in the Chinese super market with $10 for 12 frozen pieces....  Two people spending about $50 got two small dishes.", "author": "Tino W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-07", "description": "Really overpriced for what it is. Didn't love the flavor either. A tiny side soup and a single roll order cost me $30 after tip.", "author": "Jackson W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-28", "description": "Worst rolls ever  falling apart, very little fish, and just poorly done in general. When mentioned, they still charged me for it. Not good.", "author": "Julia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-26", "description": "Worst service in the world. Very disappointing. We were pretty confident that our waiter/bus boy was stoned out of his mind. \n\n1. The place was not crowded and it took the waiter over 15mins to even come to our table and get an order for beverages. We had to ask several times for water as well which wasn't delivered until much later. \n2. He didn't bring us plates or utensils upon delivering two appetizers. Asked but never received. I finally got up and went into the kitchen myself to grab them. \n3. Next, he did not ever bring us our rolls. We waited for nearly an hour. We soon found out that he forgot to put in our order. We even saw him write it down when we ordered. \n4. Saw a lot of little fruit flies or gnats flying all over our drinks and appetizers. This is highly concerning from a health and cleanliness perspective. \n\nWe will never go here again. Save your money and time and go to a better sushi spot. We can't say anything about the rolls because we ended up just walking out and finding a much better sushi spot --- where service and quality seem to matter more.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "My favorite sushi place in SF. Great roll, fantastic sashimi! Chef's choice sashimi is a must dish.\n\nNo photos cause I don't have that time.", "author": "Deng H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "This is the LOUDEST restaurant I've EVER stepped into! It wasn't even because the 49ers game was on - there was barely anyone watching! Every sound just bounced off the walls! It made it very hard to converse with my friend from across the tiny 2-person table. I could barely hear our waiters.\n\nIt was also weird because I'm sure the waiter brought around a large glass bottle of water and two small cups. But after finishing my cup, I realized that the bottle had disappeared and I had to wait for one of the busy waiters to notice my tiny empty cup and refill it.\n\nI ordered the $14 Volcano roll. I didn't expect it to be so tiny. It's the size of 8 mini maki rolls. It wasn't bad but it wasn't spectacular either. I chose it because it was scallops, spicy mayo, and unagi sauce on the top.\n\nIt just didn't stand out. And I'd probably forget about this experience if I didn't write a review. So it's super average in my book.", "author": "Athena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "This place is a bit pricey but I believe that is due to the high quality of fish being served here. We have only had the sushi, so I don't know about the rest of the menu. We eat a lot of sushi, and this is by far one of the best places we've found when it comes to getting fresh, flavorful sushi.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Incredible food & friendly service! We felt right at home after meeting owner Natasha, she shared tips and places to see for our family of 3 traveling aussies, from where to see the Chinese New Year parade, to kid's activities and recommended accupunturist.\nIf we come back to this part of town this is definitely a stop.", "author": "Rob W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "What a wonderful sushi restaurant...we found a gem right outside our hotel. Great service, so personal and sushi/sashimi was wonderful. Definitely will come back!!", "author": "Anne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Food deserves 4-5 stars, service 3 at best. We had to consistently wave down our server to place our drink order, and then our food order, and then for water refills. It wasn't like the place was super busy not did it appear under-staffed. \n\nThat being said, the food was quite enjoyable. We ordered edamame, a couple of sushi rolls, and one of their udon plates to split for dinner. The edamame was a little under-cooked but that is the only complaint I have about their food. \n\nIf you are able to get there for happy hour (5-7 I believe), they have excellent drink and food specials.", "author": "Mindi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Food was absolutely amazing but poor girl was all by herself for lunch rush but still did a pretty darn good job. Beer selection and sake selection was really good.", "author": "Travis D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "Open tables, no reservation needed, place is cozy and right in front of the Chinatown gate. The place was maybe 3/4 full when we came in on a Sunday night around 7.\n\nThe wait for our food was a little long but understandable because there were only like two chefs and one waitress who was super nice. \n\nWe got the dragon roll, Godzilla roll, rainbow roll, and spicy salmon roll plus the coconut green tea. Would highly recommend the tea! Comes in a kettle to share.\n\nThe food was pretty solid, a little pricy for what it was (like $17 for the rainbow roll), but that's San Francisco for you! \n\nWould come here again though.", "author": "Jed Mariz N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "This is a cute little place near Chinatown. They sometimes bring you free mochi ice cream, and that's nice. The sushi is pretty tasty and the price isn't terrible.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "We went here for lunch and it was nice and quiet, always appreciated. :) we enjoyed some hot saki which was pretty good and priced ok, a bit high but not super high for big city prices. \n\nThe waiter was attentive but not super friendly. He didn't look very excited to be there, but hey, not everyone wants to be at work all of the time. He was good enough and we didn't wait long for service. \n\nWe enjoyed our bento boxes even though the sushi rolls themselves were on the small side. I ordered the spicy tuna which wasn't spicy at all and I'm not huge into spice. But it lacked quite a bit. The salad was fresh but there was a noticeable absence of dressing quantity which bummed me out because I love love love that dressing! If I were smart, I would've asked for more but thought against it. I had the tofu teriyaki which was flavorful and had a large tofu portion. \n\nThe highlight was the green tea ice cream!!! It was probably some of the best green tea ice cream I've ever had. They sprinkled just he tiniest bit of powdered sugar and even though it wasn't much, added the most delightful extra layer of yummy! If the portions were as good as that green tea ice cream, I could give a fourth star. I know bento boxes aren't meant to be super huge but the sushi rolls and serious lack of dressing bummed me out because they are my favorite parts of the dish! \n\nIt wasn't amazing but it wasn't horrible. It was ok priced.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "1 star is to many for this place. We had a reservation and no one even acknowledged up for 10 minutes then we finally got seated and then 25 minutes went by before the manger lady with big hair came up to us and said sorry it's really busy which was funny because they only have like 8 tables in the whole place and like 3 waiters and it wasn't even full. So we ordered another 20 minutes go by and then our food came. It was not good I had gyzos to share and chicken teriyaki and my daughter had a tornado roll which she said was good but not for 16 after we ate I didn't feel good at all. We left and I barely made it back to our hotel before I was violently sick  that place was terrible don't waste your money or time there are so many other great places in the city and this was not it besides do yuh want to be sick from bad food ??", "author": "Shaunna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-17", "description": "My friends and I came here for a last minute birthday dinner and we WISHED we had reserved a table at a different restaurant! Fortunately, we were seated quickly for a Saturday night in the big city but from what we ordered, we were not impressed :(. I ordered a Rainbow Roll (shrimp tempura topped with tuna, hamachi, salmon, and shrimp), and I must say, I have had this roll at other sushi restaurants with greater quality! Especially for the price of $17. There was minimal rice on the roll which made it look like the restaurant was being skimpy (that's a first) and the quality of the fish provided a less than appealing taste. Nevertheless, it did fill my tummy until I was able to get back to the car to finish off my hot Cheetos. Unfortunately, my friends were also not satisfied with either of their roles and went Yelping for a different food venue to fill their tummies. The service, however, was great hence the two stars. The servers made sure to refill our waters every so often and always came by to check up on how we were doing! I won't be giving this place another try, but hopefully your experience will be better!", "author": "Harjina S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-28", "description": "We kind of just ended up here with low expectations and they still didn't meet it, lol. Salmon sashimi pieces were thin and sad. We also chose 4 different types of rolls and none are worth mentioning. The sushi didn't taste very fresh and the rice wasn't packed tight enough, leaving to fall somewhat apart\n\nService was good but they put us at a tiny table. We barely fit everything in the table and I had to sit on the edge. That was pretty annoying.", "author": "Phi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-19", "description": "Food: So, my 3-star rating is for the ambiance and service mostly. Perhaps their other dishes are yummy, but the sushi was really unimpressive. We came during happy hour which offers some discounted drinks and simple sushi rolls for about $5. We had a spicy salmon roll and a Chef's Special roll. The quality of the sushi looked like someone new was in the kitchen. The sushi rice was spotty and falling off. The taste of the spicy salmon roll was good though. The Chef's roll is what really disappointed. There was really no description of what was on it by the waitress but it appeared to be shrimp tempura, some veggies, and then imitation crab that was soaked in some kind of red sauce. It wasn't pretty and the flavor was lacking. What's more is that the roll is one of their most expensive ($18) and it really didn't seem like it was worth that.\n\nAmbiance: This place isn't huge, but it's relatively spacious and can accommodate a decent number of smaller parties (2-4). It's clean and has a large sushi bar.\n\nService: The service here was great. They give you really tiny glasses for water but the waitresses were constantly coming around to refill them. The food came out quickly and they checked on us a few times.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "Food was great! Service?... that's why only 3 stars... we were missing one item and when we asked for it, i could hear them from my table arguing that they had already sent it out... to whom?? The girl had a shitty attitude", "author": "Elsy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Best sushi ever!!  We have never had anyone give us such great sake advice & let our taste buds confirm her recommendations.  Loved our waitress!!!!  Additionally, fresh bluefin today... 70 lbs and it in house... AMAZING.   Both of the specialty rolls we ordered were also outstanding.  We felt like the only customers in the restaurant, and we weren't!!  Highly recommend!  Must visit in San Francisco!!", "author": "Amy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Great staff! Great Location! \n\nWe ordered Philly, Rock n' roll classic rolls, Spider and Volcano Rolls, Pork Gyoza and Sapporo Beer and it costs about $61. Enjoyed the food.", "author": "Kath S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-02", "description": "My friends and I came here after the new year because every otherJapanese and/or ramen house in union square was closed and this happen to be the only one open. Ordered the Agedashi tofu as an appetizer, which was prepared just right. For my main course, I ordered the chiraishi. I was a bit disappointed... The rice was a little hard and the assorted sashimi was ok... It seemed like it wasn't fresh, which is a bummer because I would expect fresh fish at any restaurant that serves sushi, not to mention, this place is located in San Francisco. In addition, for $29, I would be expected more sashimi, but this wasn't the case. \n\nThey were also out of ALL their specialty fish... When does this ever happen?? We came here right when they opened lol. This was January 2. \n\nStaff were friendly, but would not come here again.", "author": "Kristel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Oh man!  The staff here is just so kind.  They actually had recommended foods, but also recommended a nice sake for us to try.  Great food, nice atmosphere - definitely come here again to get some tasty sushi", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-07", "description": "2.5 stars. Came here for lunch the other day and the food was nothing to write home about. My friend and I both ordered the tempura udon and it was decent, but really, any Japanese restaurant that botches the art of boiling/prepping udon should be ashamed of themselves. This review seems a bit harsh but overall the food was mediocre. If I didn't work near FiDi, I would not come here to eat. Just for kicks, we also ordered uni. My friend said it wasn't the best, but also not the worst. My uni, however, was fishy..I really tasted the gonads. Lord help me!!! I doubt I'll be back for sushi, I had other coworkers tell me that their sushi was sub par, but I don't think I want to experience it firsthand, pass!", "author": "Denise L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Great location.  We were at the hotel next door.  I ordered the shrimp tempura noodle soup.  The soup was fresh but it only came with 2 pieces of shrimp for a $15 bowl.  I guess since it's in San Francisco financial district area but still!  The soup base was good.  The salad dressing and salad was amazing!  It was my favorite part of the meal.  Service was good.  Very timely with filling up my water.  I may try sushi next time...  I would probably give this place a 3.5 stars if possible.", "author": "Shazia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "DISREGARD ALL REVIEWS LESS THAN 4 STARS! I am a San Francico native, and am familiar with my fair share of restaurants.  Mikaku is by far one of my most desired Japanese cuisines. Dim lighting, and chocolate/ Crimson red decor is a perfect ambiance for a Sunday dinner. Modern/ fresh design, with the perfect blend  of traditional Japanese flare. A restaurant with the right vibe is hard to come by these days and I find this partical place very fullfilling. \n Now, the food. In short, it's to die for.  This is the only Japanese restaurant I know  (other than Benihanas) that asked how you would like your beef cooked. The owner Tasha spent time sharing her beautiful story of how she came to own a restaurant due to  of a slew of allergies.  This is why she hand picks top quality restaurant ingredients and it shows. Plate presentation is perfection and with that, Mikaku is the ONLY place I can find quality Vietnamese Jasmine tea served in a cast iron tea pot. \nService is constantly attending to our needs, and even take the time to pour your coca cola for you. From begining to end, this place is  top of line. \nAs, a 5 star Hair Salon Manager, I can appreciate the best of the best! Hats off to Mikaku.", "author": "Camie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Tasteless Alaskan roll. Even rice had no taste. Go elsewhere. Waitresses were nice. But food left much to be desired, especially for such a basic roll.", "author": "Dal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Bumped into this place walking around the financial district. I didn't think much of it at first but when the food arrived.... I thought I definitely wasn't gonna eat the whole salad but the dressing was amazingly good and evenly spread (and that's just the salad), good miso soup (it's the same everywhere In my experience), really good teriyaki chicken (soft and easy to eat), good salad and rice. The chef was really nice and even let me taste some uni and it was reaaaally good and fresh. The guy next to me at the bar was delighted to and made several comments about it. HIGHLY RECCOMENDED! This combo went for $16 and the draft $4.50", "author": "Andre N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Came in here on a Wednesday evening and we were treated very well by everyone who works here. Reasonable prices, good service, and simple yet fulfilling menu items.  So awesome we came back again 2 nights later. A must if you are in need of some hot sake to pump you up after shopping all day in Union Square.", "author": "Rach B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Food was good and the service was great! The staff gave good recommendations. I would say the place itself is a bit run down but the value for food and drinks is great. I would go again and definitely recommend to friends visiting.", "author": "Sidney G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "I came here with my bf and my friend. The wait time was not that long, and the price was a bit on the expensive side, dishes were small, wasabi was not spicy. In short- I didn't think the food or service was that great. I thought the service was slow, and they could have done better. I got the bento box with 2 things- CA rolls and teriyaki, there wasn't that much chicken in the dish, and the sushi roll wasn't that great in terms of taste. Salad dressing was also not that great as well. Though I enjoyed the hot green tea.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-12", "description": "This was the only restaurant we didn't have to wait in line for. So we were hungry and decided to eat here last night 2-12-2017.  Bf had rainbow roll $17.00 Very disappointed. Sushi was not fresh, imitation sushi, tempora inside was hard and stale.  We asked the waitor if we can switch for something else. He denied our request.  Service was okay.  Im so happy we didn't order more sushi rolls. Edamame was good.  Salmon teriyaki was okay. Thou felt salmon was not really fresh more like frozen salmon from freezer.  \n\nOverall reccommend do not waste your money here. We will not go back.  We saw other customers leaving not happy with their food also.  Very disappointed how they screwed us over with their cheap imitation sushi and salmon.", "author": "Kellie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "This is such a tourist trap.\n\nI felt like a trapped fly here since I was desperate for Japanese.\n\nI paid for my desperation with the high prices, small portions, and bland fish here.\n\nI should have picked up a sandwich around the corner instead.\n\nSlow service added to my pain point here, and my co-worker and I were literally running late from eating here that we had to jog back to the office in in our suits.\n\nAnd the fact that this place wasn't busy left us scratching our heads.\nBelow average sushi at sky high prices.\n\nSkip this place; locals and tourists alike.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Perfect place for a sushi date! Came in around 9 and was greeted by the host and immediately sat. The ambiance is nice, but not too over the top. We started off with the house sake (serves 1-3) for $16- what a great deal for a quality sake!\n\nWe ordered the Lion King roll which isn't on the menu, but our waitress knew exactly what we were looking for. I also ordered the chicken teriyaki that was juicy and full of flavor. \n\nOverall, I'd highly recommend Mikaku for a night out after exploring downtown and it's also a great place to stop by the shops in Union Square or Chinatown. Thanks for a great experience!", "author": "Jony V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "I just called for pick up, the guy said he has no time for pick up, and hang up my phone. He is so rude for neighborhoods. Never order from them anymore.", "author": "Di J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-23", "description": "Poorly made rolls. Ingredients are sloppily sliced and the fish isn't anywhere close to fresh. Not as good as it use to be.", "author": "A B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "We were lucky enough to show up during happy hour and were pleased by their large selection.  They had appetizers, several rolls, beer, sake and wines available at a discounted price (averaged $5-$6).  My hubby and I shared several rolls and a large noodle soup.  Our (young) kids shared the chicken teriyaki, which was delicious.  Everything was excellent and tasted fresh!   Even the green tea ice cream we shared for dessert was delicious!  Service was also fast and courteous. We ordered tons of food and had no leftovers - enough said, right?", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-11", "description": "Service was extremely slow. Waiter looked like he was annoyed when we asked questions. Sushi was mediocre at best. Don't plan on coming back.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-02", "description": "This place should be shutdown due to some of the worse service I have ever seen. Server/bus boy was unable to execute even the most basic tasks of bringing water, bringing the order utensils. Several ppl waited at the door, never to be greeted or seated, leaving frustrated. I will not return.", "author": "Lionel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "Good quality ingredients, reasonable prices and a nice calm atmosphere in the midst of the Union Square hustle & bustle.  They have a nice varietal selection for bento lunches that you can mix and match. Served with a green salad and miso soup of course.   The teriyaki salmon was cooked just right, being tender and moist. They have sushi and sashimi as well. This place has been here for a long time. It's a great place to either get some rest after shopping in the area or if you work nearby and want some decent Japanese food.  The portions are not the biggest but the quality makes up for it. The service was alright.", "author": "Lucy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "Not the best sushi that's for sure. Portions are small and overpriced. I ordered a Diet Coke and they failed to tell me it was $2.50 for a tiny 8 oz bottle. No refills. Tempura roll came with 5 small prices. Most places have bigger pieces and about 6 of them. The California roll was the quality of Safeway sushi with imitation crab and tiny pieces. Definitely not worth it. There are way too many better places. Oh and the tempura was sooooo oily.", "author": "Erica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "I've been here since I was a kid...even before their numerous remodels and changes of ownership! It is definitely one of the pricier restaurants, but you pay for ambiance and quality here. \n\nBetween two people, we spent close to $80. Definitely pricy, but at least we were satisfied after that meal. We came during busy dinner hours on a Friday night, and were greeted and seated promptly. Our server was attentive...and quite easy on the eyes as well! He was always around to refill our waters and ask if we needed anything. I recommend the Sake (salmon) sashimi, Godzilla Roll, and the beef teriyaki dinner plate. The Volcano Roll was just alright; nothing special. \n\nSake (salmon) sashimi: super fresh and melts in your mouth! Somewhat pricy, but well-worth the cost!\n\nGodzilla Roll: loved this roll since we love soft shell crab and shrimp tempura! It has a nice crunch and is flavorful. Also, the portion is plentiful; perfect for sharing. \n\nBeef teriyaki: comes with a side of rice, which is perfect with the sauce. Beef is not completely cooked through, so if you're a fan of that, definitely order this! This is also quite large and good for sharing.\n\nThe portions aren't plentiful for the price. You can definitely find better deals elsewhere. However, if you want to indulge every once in awhile, come try this place! It is right by the Chinatown gates, so you can walk off that food baby afterwards!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "The food is ok. Not bad, but not the greatest. \nThe good thing is that they stay open late and there are not many restaurants around...\nThe music is good. The ambient is good too.\nI didn't try the sushi, so my rate is base on the chicken teriyaki I ate and the shrimp tempura. They were ok.\n\nI may try the sushi next time.", "author": "Alberto W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Recommendation: Wow! This place was great. Good atmosphere, attentive service, and beautiful, tasty food! Good for a fancier sushi place if you don't want to go to a more utilitarian sushi restaurant. \n\nTip: They take reservations, so call ahead if you know around what time you want to eat! \n\nTip: You have to try the Volcano roll. Absolutely delicious warm roll, cooked to perfection! \n\nAtmosphere: The atmosphere was definitely more on the classy side compared to most of the sushi places I've been to so far. The chopsticks were a reusable dark wood, the tables were candlelit, and there were high ceilings and tasteful decorations. The back wall was a screen for a little projector that was a little hard to see, so I'm not entirely sure if that's an always-on feature or not. The music was also a little out of place, with mostly Top 40 hits being played. \n\nService: The service was great! The manager came over to check on us a couple times and the waitress was nice and pleasant. Our water glasses were always being filled and the empty plates were removed on a pretty regular basis as we finished off the rolls. \n\nFood: The food was the best part about the meal. We got 3 rolls to share: the Volcano Roll, the Swamp Roll, and the Lemon Sake Roll. The Volcano roll was definitely the best, with delicious topping and a well-made California roll. The second-best was the Lemon Sake Roll, which had super-thinly sliced lemons on top and a very distinct flavor, even though the Lemon and Volcano rolls shared the California Roll base. Finally, we had the Swamp Roll, which was a Tuna and Onion roll topped with a bunch of seaweed fibers. It was hard to eat and the seaweed was a little overpowering, but it was still a pretty decent roll. I don't think I'd recommend it though.\n\nRecommendation: All in all, I thought it was a great experience at Mikaku. I left feeling full and content with the food, service, and atmosphere. While I was there I definitely  thought this would be a place to take people to impress them, as everything was pretty exquisite.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Delicious fresh sushi, plus the fresh wasabi is a must! Best pork gyoza I've ever had! Great selection of sake. No frills restaurant, easy to miss passing by. But do yourself a favor and stop by when in SF!", "author": "Kaitlyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "This review is for the only dish I ever order.\n\nSansai Soba Noodle Soup with Mountain Veggies for $13.  Though it's on the dinner menu, you can have it for lunch.\n\nSupposedly, they make the Soba noodles on site.  I really like the flavor of the broth.  I wish it came with a few more vegetables.\n\nIt's a simple and hearty soup.  Great on a cold day.\n\nThey use a really tasty orange colored dressing on the side salad of greens that comes with the soup.", "author": "Roy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Really great sushi bar I stumbled upon over the weekend. I sat at the sushi bar and was greeted by friendly and professional staff. \nThey have a great selection of hot and cold sake, and someone to help you if you're not familiar with them. The one I tried had heavy floral notes and was delicious (coincidentally their best seller so ask for that because I've forgotten the name!).\n\nI had a house salad and gyoza to start and the cherry blossom roll. The roll itself is beautiful and shaped like, well, you guessed it! I have always thought of sushi chefs as artists and these two were nothing short. Extremely meticulous and patient, cutting the smallest blemishes off of the fish and ensuring perfect size and shape to every roll and plate. Needless to say, it was very entertaining to watch! And if you're not into watching that, they do have a T.V. and big windows for people watching.\n\nThe menu is impressive and the ambiance is casual and inviting. Definitely worth a stop by!\n\nThey actually forgot to put my gyoza order in so it came after I had finished the sushi, but was almost like dessert! It was cooked just perfectly and kept me from totally pigging out on more sushi - which is not hard to do!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "Short story: \n\nSushi: good quality, came out quickly and was fresh (added bonus for house made soy sauce and no msg!)\nStaff: attentive and friendly\nAmbience: small place, but had a cool and modern vibe, that's good for small parties \nOverall: great experience and great food!\n\nLong story:\n\nSo I took my brother and my dad here (visiting from LA), thinking this will be an overpriced sushi joint near union square. But I thought whyyyyy not! My brother has a palate that is so refined for sushi now, he seriously needs to be a food critic, so I was a little nervous about the reviews of this place. \n\nThey were wrong. Yelpers are so sensitive!\n\nMy dad got the sansai udon noodle soup, and my brother and I ordered the double albacore maki roll, dragon roll and giant roll to share. Since I had a nasty cold, I got a miso soup.\n\nThe waiter was really attentive and helpful in choosing good rolls and made sure our water was filled all the time. Cause lesbihonest, empty water cups would lose a star.\n\nThe sushi was good! Fresh, not too salty or fishy, and the perfect amount of flavors. My favorite was the double albacore maki, it had a great garlic zing and almost melted in my mouth. It's not THE BEST sushi in the city, but it's still good for the price. \n\nWe got to talking with the owner, Tasha, who literally is a saint, and she was telling us how she opened the restaurant with very specific food considerations (no msg; no additives; allergen free etc) because of all the food restrictions she has. \n\nShe was a blast to talk to, and overall, we had a lovely time. I will definitely be bringing my friends back here again :)", "author": "Angie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-29", "description": "Eh.\n\nOverly oily tempura. WAY too much coating on everything. \n\nCalamari that made me question if there was actually squid in there or just oily rings of batter. Blech!\n\nEmpty place when we arrived, only two other patrons when we left, but they refused to let us have a roomy table, wedged in at the back at a tight table for two. \n\nOverpriced wine (10$ a glass for house at happy hour!?!)\n\nLack luster service.\n\nDon't waste your time or money!!", "author": "LA O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "A girl at the Miel Salon 2 doors down recommended happy hour here so I headed over after getting my haircut by David (who is awesome, by the way). \n\nI got a lion king. And while I waited for what seemed to be hours, it was worth it. The fish, rice & avocado were all fresh and totally yummy. \n\nLooking around at the plates that people were ordering made me drool. \n\nI'd rather eat here than in China Town any day!!", "author": "AnneMarie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Loved the bento box combo. I got the teriyaki tofu and the spicy tuna. Good portions for the price. Will definitely come back again.", "author": "Neha T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-03", "description": "Food portion is tiny, taste is mediocre and over priced, service is very slow and not attentive at all,the only pros is it's located in central FiDi, however there are many other better choice nearby.", "author": "Crystal Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "When we found out that we needed reservations to dine at Akiko's Restaurant, we decided to stop in Mikaku instead. Our server told us that all the fish that serve here are fresh. \n\n- Cherry Blossom Roll ($15): salmon and cucumber with tuna tobiko and avocado on top\n- Double Hamachi Roll ($15) - yellowtail and green onion roll with yellowtail & tobiko on top. \n- Lion King: a standard roll in any sushi restaurant, but this was the best one out of the three! \n\nThe Cherry Blossom and Double Hamachi were both just okay. There was nothing special about them, and the rolls were super TINY! Pretty sure I would need to eat two and a half rolls by myself to be decently full... \n\nThey do have $5 sake bombs, so that's pretty cool. I'd probably come back to drink and hang out with my friends. I'll skip the sushi though!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-03", "description": "Let me get this out of the way: the sushi was good, 4 star good. The owner has the seafood shipped from Japan twice a week, and it shows. \n\nNow let's get to why only 3 stars. While the waitstaff was friendly and concerned, I was not impressed with the food wait. My two business lunch companions went for bento boxes, I went for the 9 piece nigiri sushi platter, thinking that the Chef selection would expedite a business lunch. Wrong. The bento boxes arrived and I had to wait a good 15 minutes for my sushi platter. It was awkward... \n\nThe server apologized a few times and assured me my platter was almost ready, and comped me a bowl of edemame, which was a nice thought so I could munch on something while my guests ate their bentos.\n\nThe weird thing is that when we arrived at noon the place was not busy, and it got filled while we were ordering and waiting, so I saw bigger sushi platters delivered to tables that sat after us before I was served. Not a fatal flaw, I'll be back to give it another shot, but 'till then it's a 3 star.", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Great service and and cozy feel. Enjoyed a hot pot of saki with my sashimi. Very attentive and hard working wait staff.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Very fresh fish and the waitress was friendly. We enjoyed the house sake and the Lion King roll.", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Really fresh sashimi. \nThe sushi chefs are friendly and knowledgable. I really liked my sashimi and it was one of the best and freshest I've had. The presentation is really cool and it comes with a bowl of rice and I added miso soup to go with.. I don't know if that's proper way to eat sashimi but that's what usually get with my sashimi so I don't care.", "author": "Isabelle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "Service was late and unorganized. The servers don't commmunicate well with the hot kitchen or with the sushi chefs. Was seated quickly but not attended until about 10 minutes later. Ordered edemame, shrip tempura, a volcano roll, and the \"MK\" roll. Took them about 30 minutes to get the shrimp tempura out, a bowl of rice with 7 shrimps. The shrimps were room temperature and soggy, the rice was pasty. After the person that ordered the shrimp finished. Our rolls still had not come out! I asked for the check and to cancel the rolls. The server and sushi chef got into some sort of argument about miscommunication. I guess he never got our order. \n\nAll this happened with a moderate amount of customers in the restaurant. Their were empty tables. Overall a horrible experience.", "author": "Manuel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "They have great lunch specials during the week days. The bento box is a definite must for the value.   You get so much food for what you pay. The sushi is very fresh and each morsel is just as good as the last. I usually eat here on my lunch and I love the quality of the food. I'm a big fan of Japanese food, having tried a lot of places I am quite the critic. I usually get their bento box with chicken teriyaki and a spicy salmon roll. I also enjoy their negi hamachi roll. Their nigiri and sashimi specials are really good if you're a genuine sushi lover. Plus the chefs creation roll is a must try. The rich combination of flavors is incredible and it's always fun to see what the sushi chef will come up with. They do get quite busy during lunch hour but I've always been able to get a seat. Overall,  this place and Akiko's are the best options In the area for Japanese food.", "author": "Beth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "When I read the reviews of some of the people who gave less than stellar reviews, it makes me sad. I have been eating here for over a decade, and I have only seen the place improve. It went from an ok sushi spot near my work, to one worth going back to my work neighborhood to eat dinner at. \nThey fly fresh fish in from Tokyo a few times a week, and have special rolls on them menu all the time. Their prices are ridiculously low for what you get. \nI worked in a top sushi restaurant on the east coast, so I have seen what happens behind the bar, and they do everything right here... \n\nBut for real, I'd be just as happy to have all of the nay Sayers stick to the hip slick and cool spots with the fancy rolls. I like sashimi, so for me, it's about the quality of the fish.", "author": "Jeannette F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "Was tempted to give a 2 but the food was at least mediocre to decent.\n\nFOOD - Decidedly underwhelming, no joke. \nI've had quite a lot of sushi, from a variety of places but I would say this definitely ranks down there in SF...boring tasting. We ordered 2 special rolls that sounded interesting but we were left disappointed. No idea how you use all the same ingredients that another restaurant uses but lose the taste???\n\n*Important to note - the rolls were drastically overpriced at $14/each. This would be fine if \n1. They were larger portions \n2. They had any real taste to them\n\nSERVICE - Not great. \nNice enough waiters but we were left for long periods of time with no service. Meanwhile a table of 8 business people next to us was being personally attended to by the owner, offered \"real wasabi\" as a special gift, and got their food much quicker. Preferential treatment is a poor business practice in my opinion even if a group is spending more money.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Great service. Great sake. Great sushi. What more can you ask for? (At the gates of china town)", "author": "Dominick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "I'm here about 2/3 times a week for lunch. I work in union square so it's easy for me. If you are by yourself I recommend siting at the bar. The food is great and consistent. The spicy plum wine is an amazing combination with the sushi. This place can get very busy, very fast. It's made for both locals and tourists.", "author": "Olive R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Great find close to Union Square and China town. Service was great and food was just right. Happy hour menu was awesome. And I heard the tuna belly sushi was the best!", "author": "Toni T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-05", "description": "I didn't realize I had been to Mikaku years ago with my girlfriends, but i remembered I enjoyed it! Came for a second time with my friend while on our work trip. It was down the street from our hotel. Sushi and sashimi was what I expected it to be. Service was good, fish was fresh, and the ambiance was good. My only bad comment is that the tables are so close together I can basically chime in on the next tables convo (not that I really would :P). It's a very affordable restaurant and worth the try. On the weekend if you can, make a reservation on open table to prevent a wait. ENJOY!", "author": "Darlene Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-15", "description": "The place was open on a Saturday afternoon.  My cousin felt like sushi so we went in.  I wasn't impressed with any of the offerings so I let her choose.  She chose an MK roll to split.  I also ordered green tea.  The roll also came with the house salad and we were pleasantly surprised by the presence of avocados.  \n\nThe food was ok but service was slow since they only had one sushi chef working behind the counter.  The place wasn't full of people but it wasn't completely empty either.  The roll came out and it was meh.  Sort of fishy was my thought.  I know, it's fish but fresh fish doesn't taste fishy.  It really ruined my appetite.  Luckily we we made our way to the wine bar across the street and washed it all away with a lovely glass of wine.", "author": "Trina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-28", "description": "Unfunny Comedy of Errors!  The three of us came back here because we had a good experience about a year ago, but what a disappointment!  Two of us ordered the Sashimi Specials, and one of us ordered the Chirashi.  The menu states that all these dinners come with miso soup and salad.  We also ordered three orders of Uni sushi and several other dishes.  They brought two miso soups and salads, saying the other was coming.  Nothing came.  When asked about the third soup and salad, the waitress said, \" You get the soup and salad only with the Sashimi, not Chirashi.\"  I got the menu and pointed out that all the dishes were supposed to come with soup and salad.  Then the waiter said, \"But you ordered only one Sashimi and one Chirashi!.\" Finally, she admitted she made a mistake.  She need not have- the miso soup was room temperature and undrinkable!  She finally heated them up.  Then came two orders of Uni, though we ordered three!  Another mistake.  Then came the two orders of \"Sashimi\" and the Chirashi.  However, the \"Sashimi\" was actually assorted Sushi (the small amount of rice of each piece was covered by a rather large piece of fish)! The waiter in a Japanese restaurant surely knows the difference between Sushi and Sashimi?  I had to call her again, and she took them back, saying she had \"pressed the wrong button.\"  Now the food itself- in a word \"Meh.\"  Last time we visited, the sashimi/chirashi was very fresh.  This time, OK but not particularly fresh, and the Sashimi was cut into large chunks that did not enhance the delicate flavor.  The restaurant became full and noisy.  The service was as described.  Will be crazy to come back!", "author": "Hoyle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "It was slow on a Wednesday night. My bestie and I decided to come here because all the other sushi  joints were unfortunately closed.\n\nThe service is ok when it's no busy.\nBut maybe that's because you'll get food poisoning here!!\n\nI was sketch about their label of \"fresh japanese fish from japan!\" And it looked like a plate of fish I've seen in the states!\n\nI paid $38+ $5 tip, for food poisoning.\nThanks!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "They do offer a very high quality fish! Sashimi and sushi taste fresh!\n\nFair lunch price bento ($11 to choose 2 items comes with soup and salad!)\n\nSashimi and nigiri are recommended!", "author": "Nina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-04", "description": "I visited this restaurant few times, and my conclusion are: it's a nice place with fine sushi.. \nThe service is good pretty quick..\nLast time I was there I ordered the vegetable soup with noddles and it was ok.. But the salad that come with it on lunch time is not tasty at all:(\nIf you need quick lunch you can find something nice here but if you some gusts from other places look for something better!", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Akiko's a block away was booked solid in the evenings for a few days straight, so I decided to get my sushi fix here instead. It has a pretty casual atmosphere and the wait staff is very polite and professional. They are quick to bring out your order, quick to refill your tea, and quick to clear out empty dishes. I wanted an MK vegetable roll, but they were out of some of the ingredients, so instead I ordered vegetable tempura and a couple of avocado rolls. The food was good, but the rolls were a bit small. Prices are a touch higher than some of my favorite sushi places, but not too bad considering the location. Overall, pretty good experience, and I really appreciate that they stay open so late.", "author": "Maria E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-13", "description": "This is one of two sushi restaurants within 3 minutes walking distance of each other.  After being turned away at the other one for not having a reservation, we were immediately seated here.\n\"Suzuki?\"\n\"We don't have it today.\"\n\"Hirame?\"\n\"We don't have it today.\"\n\"Saba?\"\n\"We don't have it today.\"\n\"Inari?\"\n\"We don't do inari.\"\nSo, that brings us to the maki. \nNot much to say about the maki.\nNext time we'll make reservations at the other one.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Mikaku was phenomenal! I called ahead before I made a reservation to ask if they had GF soy sauce because my friend has Celiac disease. When we got there we discovered that  not only do they have a fantastic happy hour with rolls and sake, but a whole gluten free menu. They reserved the best table by a window for us and the service was excellent. The staff was friendly, the chefs were fast and the price was more than reasonable for the quality and freshness. I highly recommend the overflowing sake, but it sneaks up on you quick!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "This divey hole in the wall makes a delicious sushi roll. Stumbled upon it after the sushi place down the street was book with reservations. Walked in and got a decent table here. Would recommend.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "You know, when it comes to local restaurants, San Franciscans have it pretty good. Let's be honest, in a competitive market... scratch that... uber-competitive market like San Francisco, the law of the jungle applies to every single eatery. If you don't bring something special to the table, you go toes-up in about three months. And when it comes to the Bay Area's favorite foods, which anecdotally but undeniably seem to be burritos... burgers... and sushi... take the difficulty level up a notch from \"Hurt Me Plenty\", past \"Ultra-Violence\", and straight to \"Nightmare\". It's gonna be a street fight for that prime location.\n\nSo when my friend suggested sushi, I was 100% on-board, and I pretty much knew that the food would have to be good. And we were in the Union Square area so I knew that the venue would probably be cute. Sure, tourists say that they like the \"real\" San Francisco but then they end up at the bar at the W (not hating, one of my favorites) and not in the Mission in a dive bar.\n\nTherefore, since the quality of the food was virtually a guarantee (and it was good), and the aesthetics of the venue were a safe bet (very cute), the only remaining factor is customer service. Here's where Mikaku earned that fifth star.\n\nThe matriarch of the restaurant chatted away with my friend, with whom she had become acquainted previously, about the topic of sake. We were all indecisive about our choice, at which point she threw together an impromptu sake tasting, allowing us a sip of her three favorites, until we chose the perfect compliment to the meal. Shortly thereafter we met Sabrina, who was to be our server for the evening. It was clear that she was having a rough day, however it was equally clear that she was in no way going to let it impact her ability to be on top of her game with us. We chatted with her, confirming that it was a tough day with some rude customers being unnecessarily mean to her, and yet she was STILL one of those most pleasant and friendly waitresses I've experienced in the city. Growing up in a restaurant, I get how hard the work is... so ten gold stars for rallying and doing a spectacular job in the face of jerky diners. Probably from the South Bay. Ugh.\n\nSo if you're looking for a cute little venue with a nice design, super-friendly servers, and a nice selection of fresh sushis and delicious sakes, and you should be, then this is your new place.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "My wife and I had dinner here on Saturday the 12th, it was an excellent experience, great food and reasonably priced. We had Udon and a chef's Sashimi plate. Service was satisfactory. The dining room is small but otherwise, fine.", "author": "Jose S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "Happened upon this sushi spot because Akiko was full. Was so pleasantly surprised by the fresh fish. Not fancy, and they played slow jams. So comical to me! But sushi chef was very warm and not intrusive. \n\nWe had the:\n\nSalmon\nSaba\nUni two ways\nToro was to die for!\nHamachi\nTuna \nTako\nUnagi hand roll\n\nHad a couple more cuts of fish that were amaze balls! I was too busy grubbing to remember the names.\n\nSolid 4 stars for me!", "author": "Sonya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "I love this place!! I was so excited when I discovered their great happy hour deals from 5-7 Sunday-Thursday (3$ beers and 5$ rolls? Yes please!). The staff is always super friendly, the food is fresh and quick and the prices are great for sushi in SF. I'm so glad I found this restaurant...definitely a hidden gem in the union square/FiDi area. Check them out!", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "こんにちわ Yelp のみなさん!\n\nWalked into this little sushi joint on a trip to the city on a Friday night.\nLimited sushi bar seating with many specials and \"fresh from Japan\" signs all over.\nThey proudly offer a small selection of fish flown from the Tsukiji Fish Market in Japan.\n\nFood Review:\n-Sake Sashimi: Hearty slices of fresh salmon with just enough fatty content. Had fresher in Hawaii for a bit less, but still tasty nonetheless; comes with Miso Soup, Salad and Rice\n-Katsu Don: Thinly sliced white onion and egg stirred into a sweet broth poured over a generous slab of pork katsu and white rice. Traditional Japanese style where another egg is cracked over the katsu and rice before serving. A bit too raw in my opinion\n-MK Roll: Soft shell crab on the inside, Unagi on the outside. So yum and worth it for $14\n-Goma Ae: Gently boiled spinach with sweet soy sauce and bonito flakes, great portion for $4\n-Deep Fried Soft Shell Crab: Whole crab deep fried to delish perfection, not something we'd order at home. But something different we had to try it.\n-1/2 Dozen Kumamoto Oysters: Fresh  oysters topped with masago, green onion and ponzu sauce. Be warned, they are baby oysters! Not the palm sized ones you'll find at the Wharf\n\nService Review:\nWith an all Japanese wait and sushi bar staff, being a native Japanese speaker expedites service a lot.\nWe ordered a few minutes after another table adjacent to us and still received appetizers before them.\nI'm not saying they are racist! Just pointing out that its often easier for Japanese speaking to get their urgency across.\n\nOverall great food, great service at a moderate price.\n\nTIP: If youre a fan of wasabi, try their Fresh Wasabi for $5, sure to make your eyes water and awaken your tastebuds", "author": "Celina Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Been here a few times and it's never crowded. Most of the other spots I've been to can be hard to find a table past 6:30. Kinda weird but whatever.\n\nThe atmosphere is chill got this whole black and red vibe going on and I liked that. The service is good I've been waited on by a different person each time I've been there and each time they've been attentive and helpful.\n\nI've had most of the rolls here and they're all really good. But most recently I got the bento box and it was also quite good. I really liked the sashimi and tempura. The real kicker for me about this is they have this chill sake called 'perfect snow' or something along those lines that has a higher alcohol content than other traditional sakes. That shit is my favorite. I think ultimately you can find better rolls in the area, but the deviation isn't too extreme.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-06", "description": "Food is nice. The price is typical SF prices which means its slightly pricey for what you get, especially if u intend to fill up on sushi/sashimi. \n\nOrdered the Oyako Shioyaki and Chicken Donburi. Both were pretty good. I'd happily come back here for lunch or dinner.  We came here on a Saturday  afternoon at around 3-4pm and by the time we left, the restaurant was half full which I thought was pretty good being such a awkward time.", "author": "Evelyn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "Yelp says it best: A-Ok!\n\nI was frantically looking for a sit down sushi place that was open past 2pm during the week (for a late lunch). After walking by at least five other sushi places (three of which closed at 2 and two of which were \"order and go\" type places), I finally stumbled upon Mikaku Restaurant, which was open all day!!\n\nI was seated right away and ordered a few minutes after I sat down. I ordered the Philadelphia Roll and the Spicy Tuna Roll. Each were $7, which I thought was a decent price for what I got. My food came out about five minutes later. My rolls were just \"meh\" and I promptly forgot about my food once I left. They were fresh, but small and didn't leave me craving more. I've had better sushi elsewhere. \n\nService here was horrid. My server came by to take my order and give me my bill. That was it. No \"how's everything doing?\" or even a \"thank you\" when I left. Very cold service and very awkward. I probably would rate them higher if the service was better!\n\nWould I come here again? Only if I want sushi after 2pm for lunch. Before 2pm, I'd go elsewhere!!\n\nCheers!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-01", "description": "After sit down, we Waited 40 minutes for two entry and four noodles. And they add 20% tips for that without ask. Just doesn't worth it", "author": "Jing C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-19", "description": "Surprisingly fresh sashimi coupled with attentive service earns this place a solid 3. \n\nSkip the Tako sunomono -- the octopus pieces were rubbery and sauce too sweet.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Came here to celebrate with a friend/ coworker for her last day. The atmosphere is nice. The menu looks great. I ordered the crunch California and the lion king roll. The crunch cali was delicious, but the lion king was kinda lacking, not my fav for the day. I forgot to ask what my coworkers thought of their dishes. I'd give this place a 3.5 for what I had, if I was able to try the other dishes Id give a better thorough review and maybe a more precise star rating. Service was decent, only odd thing was being charged 20% gratuity for our group.. I thought maybe Max was 18% so don't know what's up with that.", "author": "Rehana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "Really underrated place. My boyfriend and I were originally going to go to a Latin American restaurant until they told us it was a 1.5 hour wait at 8pm. We were walking back to our hotel when we found this place. We walked in and really liked the atmosphere of the place. Dim lighting, nice decor and a decent noise level. We decided to give it a try. The restaurant was packed, so we decided to sit at the bar.\n\nWe split 5 rolls amongst us two. We got shrimp tempura, spicy salmon, crunchy California roll, California roll and an avocado roll. We were surprised by how much food we got. Generally, when I order sushi, it's 6 pieces in a roll. We got 8 pieces each on two of our rolls and the crunch California was 10 pieces. The sushi was also delicious. Quantity was there and so was quality. The crunchy California roll must have been the best roll I've had in my life. Something about it being fried makes it so much better than the original.\n\nThe only complaint I have is the service. When we sat down, we immediately got waters. After we decided what we wanted, it took us 10 minutes to flag someone down to take our order. It seemed like there was only one person really working there. There were a few parties who were finished at the same time. This one guy rushed to their tables to clean up the space and seat the waiting guests near the door. Everyone else was chilling in the back, laughing and enjoying themselves. I feel bad for that waiter. He's the only good one. So just fyi, you'll need to ask if you want something, because unless you get the awesome waiter, everyone else will be slacking.\n\nOverall, great place. Loved the atmosphere and the food. Think I'll be coming back next time I'm in SF area, despite the poor service.", "author": "May C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "Why 4 stars?  It was definitely the most intense sushi roll I've tried.\n\n   ---   ---   ---\n\nThanks again to the Yelp app for A) Finding this place and B) Telling me what to eat.  Without it, I would have never known about the hidden item not included on the menu.  Apparently the Chef's Special #2 was pretty popular among the Yelp community, and I was feeling adventurous.  I had a hard time understanding what all was included in the roll, but I was prepared to take it on.\n\nWhat I got was an elaborate creation.  My description will be very unscientific, as I am no Sushi master.  I do know good sushi when I taste it, but I have no idea how to describe the particular ingredients.  The picture that I took is probably the best way to grasp what this roll consisted of,\n\nIt contained shrimp, lobster and some other kind of fish.  The entire plate was doused with three sauces and those delicious shaving/sprinkle things.  I wish I knew what they were, but I'm going to stick with shaving/sprinkle things for now.  I know there was some kind of spicy mayo on the plate, but again, I'm not sure what the others were.  Tempura sauce?  Is there such a thing?\n\nNow that you've gotten my awesome explanation, I know you're definitely going to order it.  \n\nBut seriously, it is one of the best rolls I've ever had.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "This place is awesome! I have been to about 5 sushi places within my 4 day stay here and this was my favorite. Went at lunch but had great sushi, prices, and drinks. Right by Chinatown and union square so great location.\n\nTry it out!", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "I can overlook bad service if the food was good. Unfortunately in the case of this restaurant both the food was bad and the service was worse. The fish tasted old and as a sushi aficionado I can say it is the worse sushi I've ever had! No one in my party finished our rolls.... And trust me when I say we can eat, especially Sushi. I can't believe Vegas, a desert (where I'm from) has waaaaay better sushi. The worst part is that it was the last dinner of our trip up to this point the food in Frisco had been amazing. You live and you learn.", "author": "K R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "First real Japanese restaurant experience and was very impressed. Normally when we have something Japanese it's something like sushi train tonight we went more traditional visiting this restaurant right next door to our hotel. The customer service here was amazing and the food..... O.M.G. Just as good. Thank you for the experience, just another reason to come back to San Francisco in the future. Great way to finish our last night here.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Great spot to get sushi for this area at night. It isn't cheap though. Quick and friendly service. But it's hella expensive, we spent $82 for dinner for two and we ordered generously but not that much. But it's San Francisco, cheap and quality sushi isn't the easiest to come by. Sushi was good but not life changing and for that price I expected a bit better", "author": "Jessica Lilly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "All in all, a great place to grab some sushi that is great quality. It's a bit pricey, even for the lesser stuff but if you're hungry get some! Also their soy sauce is house made, and it's the best I've had.", "author": "Antonio M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "I grabbed lunch here yesterday and it was quite tasty.   Now I totally went overboard while ordering, but it was totally worth it.  I got the 11-piece Sashimi Dinner which comes with rice, soup and salad.  I also ordered 1 Unagi Nigiri and a Philly Roll.   For beverage, I went with a large Orion beer since I'd never had that before.\n\nThe sashimi selection was very tasty and I enjoyed the fresh fish.   The unagi, while not the best I've ever had, was nevertheless quite good.   I was only able to eat a few pieces of Philly Roll before I decided to stop eating as I was utterly and completely stuffed.\n\nService was good, if no frills.   All in all, though, fresh fish which is most important.   Mikaku gets a solid 4 stars.", "author": "David O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Amazing food! Fabulous service! Would def come back next time we are in town! Rolls and sushi were great, staff was friendly and helpful. Love the atmosphere and sushi chefs!", "author": "Alyse H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Mikaku is amazing! We were craving sushi after a long day walking around SF and we stopped in for dinner. Full disclosure, first we went to Akiko's around the block but were told there was a 90 minute wait without a reservation. We walked to Mikaku and were seated immediately. The overflowing sake was fun and ends up having about an extra shot to drink out of the lucky box. I had the Kuri Kuro dark chestnut ale and now my life won't be complete until I find somewhere locally that I can buy more. The rolls were all delicious, the tempura shrimp they use strikes a perfect balance of sweet shrimp meat and light, springy tempura, and I need to know their secret on how to tell when an avocado is perfectly ripe. The prices were fair for what we are used too, not the cheapest rolls around, but the quality is very much worth it!", "author": "Pierce R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-10", "description": "Honestly the food is totally fine at Mikaku, but not great by any means. \n\nFor lunch: the bento box special is pretty good. $12 gets you a 2 item bento with soup, salad and rice.\n\nFor dinner, the roll selection is extensive. However, rolls are overpriced. Rolls that should be $10-$12 are $15-$17. Also, be warned that the sashimi plate is a rip-off. It is 10 pieces for $25 and the pieces are tiny.\n\nThe fish was okay - not super fresh, though. I also had two pieces that were hard to chew. The two requirements for sashimi really are freshness and being cut well.\n\nStill, I'd give 3 stars. If you're desperate for OK sushi near union square, this place is decent.", "author": "Julia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "Udon is hard to get wrong but this was comfortably the worst udon I've ever had. It smelled like bad chicken so I avoided the chicken, but the broth and noodles also tasted off. I only managed one bite and I always finish my food. It was also just broth, noodles, chicken and a couple of carrots: no spring onions, mushrooms, bok choy, tofu, spices, etc., as though no effort was made to make this a really nice dish. Pork gyoza and side salad were palatable but nothing to write home about. I won't be going back.", "author": "George B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-05", "description": "Hello San Fran, Nikki is here!\n\nThis place is across the street from the hotel I am calling home for the week. I was exhausted and starving when I arrived so I figured this would be the easiest spot to grab some to-go grub.\n\nMy order:\n-Miso soup. Small in size... but makes sense for $2\n-Gyoza. These were tiny little bites. They were okay.\n-China Gate Roll. This is one of their baked rolls. Tuna inside... salmon and spicy mayo on top. I devoured the whole thing. Pretty tasty. Spicy mayo makes everything delicious.\n\nThrew in a soda and my total was about $24. Looking at their menu, it seemed a little pricey for rolls. However, I don't really have a frame of reference for sushi here.\n\nDecent little meal for my first night here. I'll sleep well tonight with a tummy full of sushi.", "author": "Nikki W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "Flew into town for work in the evening and was looking for a place to eat within walking distance of my hotel in Union Square. I was pleasantly surprised by the sushi (and shocked to see subpar reviews on Yelp). I ordered a spicy tuna roll, the Alaska roll (salmon & avocado), and hot coconut green tea. I highly recommend the coconut green tea, and both rolls tasted fresh. No complaints and the prices were reasonable -- especially for the location. I sat at the sushi bar and service was both friendly and quick. The restaurant was not busy or loud while I was there, granted it was 7:45pm on a Monday. I suggest giving this place a try if you are in the area and need a sushi fix!", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-29", "description": "Went for the Happy Hour and it was ok. Service ok. Ambiance ok. Prices ok. So that's all I have to say, it was just ok", "author": "Melanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Hey folks, if you want cheap sushi, please don't go looking anywhere near Union Square, because it won't happen. That said, Mikaku provides some pretty reasonable prices for some *VERY* fresh fish.\n\nTheir side walls and kitchen area display unusual (at least to the average American palate) catches of the day, new combination rolls, and sushi you won't just find in any old place. I started with always-first-for-a-new-place tekka maki (not sure it was even on the menu, but no one seemed to care) -- fresh, firm, well-cut tuna in an art form that master sushi chefs take decades to perfect -- these guys did a pretty good job on that exacting standard.\n\nThat test complete, I sampled some or my partner's salmon teriyaki (not overcooked, moist, and not over-sweet either), and then dove into the house Dragon Roll (crisp, well-portioned, good seasoning), followed up by a very clean miso soup. I was pleased with both the speed and attentiveness of the service during what was probably a 3/4 full night.\n\nAtmosphere-wise, it feels slightly classy, but relaxed. It's modern, but not so much so that it freaked me out, and I'm the guy who once famously exclaimed at MOMA \"How the eff is someone getting paid money to paint a red canvas?!?\"\n\nDid i mention the Soju? Right, the entire reason I wanted to write this review. Some of the happiest memories I have are of the Japanese company I used to work for going out together as an office, and in the spirit of camaraderie, get *blasted* on Korean Soju, our bosses and EOs included. I associate Soju with happy memories, but the thing is, it's tastier and less debilitating than Vodka (also often made from potatoes), but it's also cleaner and *more* debilitating than Sake.\n\nGo try some of their many interesting Soju offerings -- it's really a nice touch to an already-good restaurant.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-05", "description": "Meh. Not worth my $22. I know I shouldn't expect much especially with the ratings. However, I was craving sushi and it's the closest place to me in the FiDi. I wanted the lion king roll but they didn't have any. The lady I suggested the volcano roll which is similar but with scallops. I'm very particular with raw seafood. I asked her if the scallops would be cooked. She said yes because they are baked. So, I gave her the benefit of the doubt. I get back to work and start chewing down because it's 4:30pm and just now having lunch. Took my first bite of the sushi. Great. It's not fully cooked. I mean I know scallops shouldn't be over cooked but then again it shouldn't be under cooked. I wiped off all the scallops. The sushi was falling apart! Cmon. $14 for this sushi. You should be using sticky rice for this or roll it better so that it sticks and not fall sort as soon as I pick it up.  I just looked at the receipt and wondered why I spent $22 for lunch. $14?! For the quality? I feel ripped off. Also, the crab meet I think was the crab stick and not shredded. It literally looked like pre lacked sushi from Safeway. I paid $14 to eat California roll with sauce. \nThe appetizer veggie tempura....I have no words. They looked so pathetic. It's like the veggies shrunk in size. I've gone to cheap Japanese places over by where I live and it's good and better quality/size. Of course, it's in the FiDi so that's why you charged that much? Never again   I'll keep my sushi craving to myself until I get to place with more options.", "author": "Sheena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Best chicken teriyaki I've ever had because it was made the particular way I like it, which is not blackened (carcinogenic).  It was super tender and melt in the mouth.  Sushi was super fresh.  Prices are so reasonable.  I met the owner Tasha at her other shop \"Common Sage\" on Polk and she is very particular about super healthy, non-gmo ingredients, high quality meats, etc.  She has so many allergies and is sensitive to many foods so that how she became so particular, just like me!  Can't wait to go back!", "author": "Deborah C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-23", "description": "This is a reply to the business owner's response.\n\nI am not exactly sure why it matters whether or not we visit SF often.  Would we be comped service?", "author": "Steph L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Went here with a big group. I had called and made a reservation and they were great at accommodating us. I ordered a bento box with teriyaki chicken and tuna sashimi. They almost forgot to replace the tempura veggies with steamed but they caught it right before handing me the plate and rectified the mixup. The owner has severe allergies so she really knew how important it was for me to avoid cross contamination.\n\nEverything was yummy. Service was a bit spotty at times but overall I was really satisfied and it was definitely celiac safe!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "We were visiting San Fran for work and decided to check out a couple different sushi spots on the same night and compare. This was the second stop on our sushi hunt and needless to say, there was no comparison.I only wanted to try their Uni, Kenpachi and Ami Ebi nigiri so this review is only based on those 3 items. \n\nKenpachi - The fish wasn't bad. The texture was pretty good, it had a slight 'crunchy' texture you expect from amber jack but the taste of the fish itself was lacking when compared to one of higher quality.\n\nUni - The amount of Uni that came on the nigiri was a nice helping. Looked like a mish mash tho and not carefully/skillfully laid out. When I ate it however, it was still partially frozen because I could feel the ice crystals. Since it was frozen, couldn't taste any creaminess of the uni. Disappointment. \n\nAmi Ebi - So sitting at the bar has its perks. You get to see the sushi chefs in action putting together your sushi masterpiece before devouring it. However, it also has its downside. We saw the Ami Ebi being prepared by the chef until he took a second look at it, consulted with his assistant and threw it out. The shrimp must not have been up to par and it was not something he felt should be served. Bravo Chef for making sure that you were serving something of high quality, I appreciated that. The waiter came by and them said that they were out of the Ami Ebi and I was ok with that. What happened next surprised me. The owner came over to the chef to ask why the shrimp was not being served. He explained himself and that must not have sat well with the owner since the profits on the shrimp must be high. Next thing I know, I saw them pulling out a box of frozen.. FROZEN, shrimp. Granted, I dont know how other restaurants do it, but when I am sitting at the sushi bar, the last thing I want to see is frozen shrimp being thawed out under some water, cut up and served raw to me. The waiter comes back telling me he made a mistake that they did have The shrimp and that it was being prepared for me... Face palm.... \n\nTheir other food might be good, but I certainly wont be back for this.", "author": "An L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Excellent food, friendly service, great location. Great for business lunch or with messy kids.", "author": "Xenia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "First, the hours on Yelp are wrong -- they were open on a Sunday evening for dinner. \n\nSecond, Mikaku is within walking distance of Union Square and very near the Chinatown Gate -- it's near many hotels and across the street from the Triton Hotel.  For those hotel guests in need of a quick meal, this would be an easy choice. \n\nThird, service was good and the restaurant clean.   \n\nFourth, prices were reasonable for the area  - less then $30 for kappa maki, Swampy Roll (8 pieces of white albacore tuna + seaweed salad on top), and a small house hot sake.  \n\nFifth, quality - while the Swampy Roll was good, the rice in the kappa maki was stale and there was too little cucumber in each roll.\n\nAll in all, an average go-to option for those in the area.", "author": "Kimya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Great food, great service be back for sure!  Highly recommended on the miso soup and the steamed tempura vegetarian roll \n\nWill be back (-:", "author": "Keren N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Came here with a friend during their happy hour on Sat.  And not bad!  The rolls were kinda small, but in all fairness it was 8 pieces.  All of what we ordered were off the happy hour menu.  The hamachi and salmon nigiri were pretty good.  So I would say a 3.5 stars.", "author": "M. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "No complaints here. My food always has flavor, portions are great, nothing wrong so far. Staff is really nice and they always ask if there is anything that they can help you with. They always make sure to go above and beyond for us when we come. It can get pretty busy so be prepared to wait and don't complain about it. The sushi is good fish is fresh and shipped fresh daily from what I've heard. The owner is really nice and attentive and if you need anything just let her know and she will accommodate to your needs. They are also very kid friendly and they have always gave our daughter small portions of food for her since she is a baby . The place isn't that big though so space is limited. Price is average for the area it is union square which is generally overpriced", "author": "Yung W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-14", "description": "My meal was pretty good, just wasn't anything I couldn't get at another standard sushi joint, and I wanted something special while I was in SF. That's OK though. I felt a little bad for the waitress as there was only one waitress and the place was completely full, she was really running (tough to get water refills, no soy sauce at tables, etc). They should consider at least getting a busboy or something. The chef came around to our table and checked in and made some friendly comments, and that was appreciated. I tried about 8 different rolls. I had the Volcano Roll on the advice here and I would agree, that's probably the one to get even though I'm not super into scallops. It was tasty, and I really liked my ahi poke salad. Nothing else was particularly great. Definitely do NOT get the sweet potato roll: worst of its kind I've ever had. Very glutinous and flavorless, bad texture.", "author": "Alison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Quality Japanese food @ a conveniently located place in SF! I came here with the fam for my mom's birthday last night~ we were in the City to listen to the symphony & go shopping @ Union Square. Good times!! The service was very good. I was very impressed with that-- I am from the South Bay so I understand prices up in the City are about $3-$5 more. Makes sense, given the great location. Also, they had a TV so we were following the Warriors game while I was slurping my udon noodles & eating yummy sushi! Special thanks to the bro for treating us all~ basically, I was really happy w/ this place and I would be back! Note-- I randomly remembered that I had been here before for happy hour a couple years back when I was up in SF w/ my friends... so note to self-- if I ever get a job up there or am visiting some friends on a weekday (or at a meeting in SF)-- come here for happy hour! (sushi & sake.. delish!)", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "This place is one of my favorite Sushi restaurants I go to for sushi in San Francisco I always Get The volcano roll and The Godzilla Roll one of my Favorite sushis.", "author": "Mychael H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-19", "description": "I came here with a group celebrating a friend's birthday.  This place is not made for big groups.  There were about 11 of us and it caused all manner of confusion and disarray.  Mikaku isn't a big place, so that one might be on us.  \n\nThe food was alright. I ordered the una ju which came with the requisite salad and miso soup.  I always wonder why Japanese restaurants serve a salad with their entrees; it is rarely any more than a footnote to the rest of the meal and this was no exception.  The una ju, while being one of the more expensive dishes on the menu, really was very bare-bones and basic.  Eel on rice, done.  What is more, it is a fairly small portion so after I finished my meal, I was still feeling a bit hungry.\n\nThe real issue we had was with the service.  All the dishes came out a few at a time.  This had the unfortunate consequence of having some of us completely finished with our meals while others were still waiting on their first rolls.  As you can imagine, this left some in our party rather hangry for the nearly two hours we spent there.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "A+ Happy Hour (Mon-Sat 5-7pm) review\n\n$2.50 appetizers (gyoza/edamame/chicken wings)\n$3.50 hand rolls\n$4.50 - $7 special rolls\n$2.50 - $5.50 veggie rolls\n+Drink specials\n\nGet the Crunch Giant! It's a big roll to share, and so yumyums. This has recently been my go-to for local sushi. It's not the greatest, but it's good.", "author": "Felicia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Amazing fresh fish and impeccable service!  We came here for our anniversary for sashimi and are very finicky about our fish.  They completely satisfied and exceeded all expectations!!", "author": "Aimee F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "This is a good place to come during Happy Hour hours, if you're looking for a chill place to hang out and talk. Cheap drinks and apps in a quiet-ish atmosphere. Convenient location. I particularly liked the lychee and apple sake cocktails ;)", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-04", "description": "When we decided to come to Mikaku we had just been craving some good sushi and a nice ambience to have a few drinks.\nEverything started off pretty well. The place looks clean at a first glance, and the hostess was polite enough to allow us to sit at the counter area since all the tables were taken. \n\nHowever when you sit and really start to look at the place you'll notice that someone hasn't dusted in what seems like years. The light fixtures are simply heavy with dust and I do not wish to even know how much of it has ended up in food and drinks. \n\nAnd as polite as they were to allow us to move to a table when one cleared, we simply could not overlook that in one of our sushi orders we found two hairs INSIDE of the sushi. It was on the same platter, pieces on opposite ends of the platter, and they did not handle the situation with any ounce of grace.\nOne waitress promised they'd take it off of the bill and another waiter promised they'd bring us one free of charge but when it came time to comp us the free platter the waiter played dumb and swore he never said that. \nBoth, of course, continued to try and keep us from speaking of the incident since the tables around us were listening in and glancing over to see what was wrong. \n\nAll in all, clean at first glance but truly very dirty in both establishment and quality of food preparation. Our morning afterward can attest to that.\nWe've told all of our friends never to go and now I am telling you all: \nFind somewhere else and save yourselves.", "author": "Jimenna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-07", "description": "The food was decent (you can get better in San Francisco) but my real issue with this place was the sub-par service.  As a former server myself, I can let some things slide when a restaurant is packed, but there were at least 4 other tables open in this small venue so there is no excuse...\n\n- Waited a very long time before the female server came to our table to take the order; no apology for the wait and didn't even introduce herself.\n\n- We ordered 4 sushi rolls but only received 3; I have no idea what happened here as they never explained.\n\n- We had to ask for water (wasn't just given like it should be) and they never refilled our glasses, or even stopped by to check on us to see if the food was good.\n\n- A male server delivered our check and cashed us out, and no, the female server was not on break.\n\nUnless this places puts a sign out saying that they've hired competent wait staff, I won't be returning.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "POOR SERVICE. We wait too long for our food so the dishes got cold. I could see the dishes at the kitchen window but no one give it to us. They charged more than we ate. The food was ok but does not worth the price.", "author": "Xiaoyue W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-12", "description": "We wanted sushi before leaving San Fran and come across this place which was nearby, we had less than an hour to eat and head back to our hotel. Ordered some rolls, but unfort i've had amazing sushi and this was bland. Didn't fill us up. \n\nPaid and left. Nice place, cute and clean. Bathrooms upstairs are nice too. Empty place and our rolls still took a really long time. Oh well.", "author": "Harlow H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-16", "description": "I like this place! It's super close to Union Square. It's pretty pricey and the sushi chefs weren't very friendly, but the food was good! Our server was nice too! I'd go back, but there are so many other places to go in the city.", "author": "Aja N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "This place is right by the Gates to chinatown in a very touristy area, but is a little gem of fresh and interesting sushi.\nThere is a whole board of fish from Japan, and chef John is an engaging and knowledgeable master behind the sushi bar. There is absolutely NO MSG used in any of the dishes or sauces. I would recommend the 'golden eye' a sweet little ball of spicy tuna, quail yolk, & ponzu on a  Shiso leaf, meant to be eaten in one savory bite......yum. Ask John to be creative and he will not disappoint you!", "author": "Selena M H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-19", "description": "So disappointed... We joined 2 friends here tonight for a late dinner. They had been there for an hour half or so (mind you we visit every time we are in the city and regularly send friends and business partners here). Tonight was the first time I have ever been so disappointed in staff and service (love the head sushi chef who I assumed from other visits and interactions was the owner) but now not sure ... Like I said we arrived 1 1/2 to 2 hours after our friends (they had been ordering the whole time there and ordered more when we got there... Since they had ordered stuff before us we asked to split check ... Was told this was not a problem (mind u no where in store or on the menu does it say you can not slip checks (so it was two parties one consisted of two adults and ours consisted two adults and one teenage). We ordered some drink, one roll and some teriyaki beef. No other communication with staff to see if we needed any drinks or other food. After 30 minutes we just decided to ask for out checks. Well low and behold they decided to add almost an $11 tip (20%) on my party of 3 check that was $68 and add an almost $18 tip to the other check of $90 \n\nWhen I asked the head chef he said sorry I am not sure what that is. As a head chef/owner you should focus on food as well as know everything else going on... When asked waiter he said you are a party of 5. Had to explain no because you allowed seperate checks that is seperate groups ... You can not claim 1 group and no where does it state no split checks and party of 5 plus will  be automatically charge tip of or choice... Then to argue with a customer about charging what ever you felt us Wong and disrespectful... \n\nHope you can get it together and get back to the place we loved 3 months ago and please train your staff on proper ways of talking to customers and know what they are taking about before they answer for you .., tonight your staff double dipped on tips and because a customer asked a question got disrespectful and rude about it\n\nIt was a busy Friday night but that does not excuse constantly walking past a middle table and not checking on them.", "author": "Misty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Girlfriend and I came here when Hops & Hominy told us we had to wait an hour. Totally worth it! Their sweet potato tempura + avocado \"Caterpillar roll\" was really yummy, as was the Yellowtail Hamachi.\n\nAlso, green tea cheesecake. Just do it.\n\nFelt kinda homelike, we were really into it.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-29", "description": "When I came in and looked at the menu, I realized this place is pricier than I was lead to believe based on reading other Yelp reviews. However, when I got my order I thought it was justified. Sashimi combo was overall pretty fresh, as well as the hamachi and green onion roll which I ordered.\n\nI came here just past 7pm on a Thirsday night and found that I just missed their Happy Hour, which ends at 7pm. I gotta come earlier next time and check it out (although by quick glance at that menu board there not sure if there's much good items of interest, but good deal for drinks). The restaurant was pretty busy also despite it being a midweek night.\n\nOne reason I can't give it a higher rating because the waitress that greeted me didn't do it with any congeniality. Neither did the male staff that took my order. The older lady there ( maybe the owner) was friendlier at least.\n\nOverall decent experience. At least nothing that warrants the infamous and narrow-minded Yelper Nobu K.'s criticism (and deleted review) back in 2010 which (from what I read) led to the owner's daughter being very upset (and likely justifiably so given the crap that Nobu often writes). At least that's my opinion (a word he doesn't seem to understand either).", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "I had the cherry blossom and california roll and both were excellent. Very fresh and the sushi chef was very nice", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "I was looking for a place to find some sushi to eat whilst downtown, so we hit up yelp and decided to check this place out.\n\nFIRST of all, the menu online did NOT match the menu in the restaurant -- 80% of the pricing and some dishes.\n\nWhen we did get our food, it was given at small portions and it didn't taste like it was an amazing omg melt in my mouth kind of thing either. \n\nAnd the rice that was given to my boyfriend tasted like it was 3 days old ... Dry and hard.  Wait....what? Haha.\n\nDefinitely not coming back because of the unreasonable pricing and old food.", "author": "Mel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-14", "description": "Just had the lunch special bento box.  The miso soup was cold and the tempura was cold and greasy.  It was also overpriced.", "author": "Tom N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "This was my first experience here, visiting for the week from San Diego. I am quite the connoisseur of sashimi and let me tell you, these folks got it right! I had the fresh caught yagara (cornet fish) and it was exquisite. The cherry blossom roll was what my waiter recommended and I thoroughly enjoyed that as well. Though, I have to give my highest rating to the sake selection. For a mere $22 a bottle, I got the Dassai which may be quite possibly the best sake I've ever had. Granted I haven't had a ton of sake, but I was very satisfied with what my server suggested. I would definitely recommend this place to anyone visiting from out of town that would love to try some local caught sushi in a beautiful setting in Union square. \n\nPs: don't forget to check the wall of specials for the really good stuff!", "author": "Jules R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "This place is alright. Prices are what you would normally see from a sushi restaurant in the city and the quality is mediocre, nothing special. \n\nI came here after a spontaneous trip to the city with my friends. We wanted to eat at akiko's but they don't take walk-ins for parties larger than 4 so the hostess told us Mikaku was the closest sushi restaurant. We made it just in time for happy hour which is a plus.\n\nFrom the happy hour menu, my girlfriend and I got the lion king roll, the shrimp tempura roll and the spicy salmon roll. Again, it was decent but nothing worth bragging about. We also got their house sake which was actually discussing.\n\nI also ordered 2pcs of the sake toro ($8) and 2pcs of the blue fin tuna toro ($12). It was good but could be better. \n\nThey could really work on their quality but it's decent enough for the happy hour prices. I'm not sure I would come back.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "My fiance and I stopped here on our way back to the BART after the disappointing Ramen Festival. For being a walk in at about 4PM, there was plenty of space and we were seated quickly. Our server was attentive, but not overbearing. \n\nWe ordered pork gyoza and four sushi rolls. Everything was fantastic. The tuna in the spicy tuna roll was so fresh (though it could have been spicier for us), the sweet potato roll was to die for, and the gyoza was so good, we put in an order for two more!! We also had a sake flight (which was pretty good considering we're not huge sake fans) and a few glasses of plum wine, which was very good as well. \n\nNot only did we get all of this amazing food and alcohol (we were STUFFED), but it only cost us $70. We consider it a miracle to go out for lunch or dinner, especially in this area, for less than $100. We will definitely be back!", "author": "Jordyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "Had lunch hear and the portions were a nice size. Customer service was really good, everyone is very nice and friendly. I got the shrimp tempura with udon and my boyfriend got a bento box. We both both very satisfied with our meal.", "author": "Jenna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "I've been here twice. The first time a gal pal and I stopped in for their happy hour. Even though they were near closing their lunch hour, the woman there let us in and gave us sake recommendations, really friendly. Great Happy Hour deals.\n\nThe second time it was dinner on a Friday night at 7:30. We waited 2 minutes before we were seated. At the time, it was full so it did get pretty loud. Our bill was $95 with tip. We had a three rolls between $16-$18 each and a wine bottle sized flavored sake called Hana Lychee, very tasty! It was $24. You can drop a pretty penny if you're getting their more elaborate rolls, but the basics are match the cost of many places in the city. Not the best sushi in SF, but up there and the service is great!", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "Not the first time here but this time I got to write a review. \nSuper friendly staffs and very fast with their service. That's  a huge plus when it comes to hospitality type of business. \nJapanese cuisine has always been one of my favorite but this place rock my boat. The sashimi are always fresh. The happy hour menu offers varieties of Chef's choice and they are delicious. :) \nIf you're planning to dine here after a long day from work or being in the city for any reasons, this place is a must to stop by.  \nGreat atmosphere with ambient environment. It's definitely a place to strip off your stress and end the night with.", "author": "Derrick D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-13", "description": "This restaurant is one of the few places open in the area on Sunday evenings. \n\nThe sushi is pretty good but the service is a bit on the slower side. My friends and I enjoyed our sushi. The meal wasn't anything remarkable for me but I would return here if I was craving sushi and was in the area.\n\nTheir special menu looks good so I would def give those rolls a try!", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "I like this spot- and it's right next to my apartment. The sushi chef is nice and so are the other employees. I wouldn't say it's \"to-die-for\" but it does the trick! \n\nI usually get a lemon sake roll or tuna poke. \n\nPrices are pretty good too, especially for Union Square!", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "Not a bad sushi spot when you've got a craving and every other place nearby has a 45 minute wait. \n\nSurprisingly even on a saturday night there were tables available, tough SXSW driving people out of the city may have played a role. \n\nThe price is totally reasonable, the bill came to about $100 for 4 people, even though we were starving and ordered 8 rolls. \n\nMy two favorite rolls were the Godzilla (shrimp tempura, tuna, tempura soft shell crab) and the Volcano (baked California roll with spicy scallop).", "author": "Brad M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Let me preface this review by saying that I did not dine here;  a friend and I simply drank a bottle of sake here.  \n\nIt was fall and the wind was biting when we finally saw this quaint little restaurant nestled amidst the throngs of luxury brand boutiques on Grant Ave. The staff was extremely accommodating and friendly, despite our indecisiveness in seating arrangement.  When we finally settled by the window, we had a lovely time chatting in our subdued surroundings while watching the hustle and bustle of people outside the popular avenue.  Two of the staff helped us select a bottle of sake, carefully and thoroughly explaining the different nuances in each bottle they recommended.  The place was small and extremely cosy;  wonderful place for a date.", "author": "Sofia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Mikaku has improved significantly over the years. My favorite new thing they've introduced is the overflowing sake. It's innovative and fun! I've never seen this at any other sushi restaurant in SF. It's a great value too! Also their fish is imported fresh from one of the well known fish markets in Japan. The food is delicious and well presented. The ambiance is really cool too. Last time I went there was a cool Japanese film playing with puppets dancing. Definitely worth checking out if you're in the area!", "author": "Kristine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-06", "description": "After walking aimlessly around Kearny street area during lunch hour, I ended up going to Mikaku. \n\nThis place catches a lot tourist since its across the street from the main entrance into the exotic San Francisco Chinatown.  This place has been around for quite a while, I know because when I started working in SF 7 years ago, this was one of the first place I went to with co-workers.\n\nThe menu is pretty traditional and I ended up ordering the 2 item Bento box.  I picked the teriyaki salmon and tempura.  The box came with soup, salad, rice and a slice of orange.  My Chanel wallet didn't really mind spending $10.50 for lunch. The salmon was okay, it didn't taste bad, but it also didn't scream deliciousness to my taste buds either. The tempura's batter was more on the heavy side, I prefer it to be lighter and crispier.  Overall, the meal was fine...okay.  Perhaps I will venture back in another 7 years...", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-21", "description": "Sushi roll was not satisfying and rolls were definitely small.  The best roll we had was Godzilla, but the tempura was not fully fried.  \nPrices were decent,  but the tip was ridiculous at 18%.  That is insane for a sushi place that did not even give good service.  The spicy mayo tasted horrible. also no complimentary soup. the sushi had no taste I don't suggest this for someone who wants a delicious sushi.", "author": "Tarundeep G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Great sushi, great service. Good prices. We are from LA and would come back here again.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-25", "description": "I called Mikaku to make an order so I could eat there.  The person asked me if this was for take out. I said no I'd like to eat it there, because it takes me ten minutes to walk there. And my lunch time is only a half hour. The guy said just come in its not busy.  I persisted to try and let him take the order for eat in.  He said no I can't do that.  He said take out orders only. So I gave up.  What's the difference of ordering take out you ask,... TIME. Exactly.  Don't get me wrong, food is great. I've been there enough to be the duke. It's just this makes no sense at all. Needless to say I pass up several Sushi restaurants to get to Mikaku.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "I am losing my trust on Yelpers. I've been ignoring this place for months now just because of the reviews on Yelp. Finally tonight I decided to dine here and I really do not understand those who wrote terrible stuff about their sushi. I think it is reasonably priced and the quality is pretty good. Yes the server do try to push you the specials but to be honest I have no regrets that listened to her and ordered one of their specials, it was just delicious! I did try Akiko couple times as well and I think Akiko is over rated and Mikaku is under rated! One of the reviewers mentioned that s/he has been coming here for years and over one bad experience s/he writes a bad review? Again, I think I will depend less on Yelp reviews going forward :(", "author": "Damla A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "I decided to stop in for lunch while shopping. I ordered the California Rolls, Chicken Teriyaki and miso soup from the lunch special. The freshest and best tasting Japanese food that I ever had!", "author": "Jeremiah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-02", "description": "i think the sushi were very mediocre. Ended up here when Akiko was closed next door. Ordered a California roll and a 49 roll. 49Rolls are usually topped with salmon and lemon. This time it was just rice rolled avacado topped with spicy tuna that werent even fresh. I have no idea where this came from. California rolls were big fat balls of rice, absolutely horrible. Not sure if the sushi chef just didn't care or a it was a bad night, but would not be going back again. \n\nI hate it when sushi restraunts screw up on a california roll, its like a white girl burning a piece of chicken breast.....", "author": "Guang H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "Food quality is worse than the sushi serve at the $9.99 lunch buffet that serve sushi. Yellow avocado, overcooked noodle, overnight hard rice and slow service.\n\nHorrible experience. Came here with a friend's family for lunch. We were the only table plus another girl on the corner by herself. It took so long for our food to come. The corner table gal also had to complaint for slowness of the service. We ordered two rolls, two noodles, a sashimi plate and sake. We had to remind the waiter THREE times before he give us the sake. The avocado on my roll was freaking yellow! And the rice was hard like overnight fried rice. With barely any service and constant reminding the waiter what was missing, he still had the balls to bring out a bill with 20% gratuity charge!      Wtf? To be fair, when the waiter returned my friend's credit car, he said he admit it was bad service and took off the 20% for us. \n\nAnyway, I'd not recommend anyone to come here or at least during lunch time. It was a Saturday lunch. So no reason for them to have all these leftover- turned yellow - avocado and rice to serve people from Friday night.", "author": "Howard C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-10", "description": "We got a Nabeyaki Udon and they skimped on what they put into the dishes given the price. The Udon dish was $17, and it was a half pot of Udon, 2 little pieces of chicken, some onion and shredded carrot, with few random small pieces of tempura on the side.\n\nAtmospheric was nice but really disappointing food.", "author": "Claire W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "Mediocre sushi. Fish wasn't cut properly. They ran out of house sake and draft Kirin on a Saturday night. Given then nearby sushi options, I would go elsewhere.", "author": "Jaclyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "Gluten free menu and very celiac friendly staff!!! The fish is very fresh and tasty as well! Definently be coming back!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Great experience here. First time in San Francisco and my boyfriend and I came in for just a beer after exploring Chinatown. \n\nWe ended up ordering the yakitori and fried pot stickers and both were excellent. The restaurant makes their own soy sauce and it definitely makes this sushi restaurant stand apart. Service was great, location is great, and prices are fairly cheap. Spent $30 on four beers and two appetizers. Would definitely come here again.", "author": "Katia O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "We sat at the bar and was neglected by the waiters. Service was bad. Everything was way over priced for quantity and quality of rolls. I even got a nagiri of the \"fresh fish from Japan\" which tasted like seawater and wasn't deboned. Left disappointed and hungry after a $70 bill (with a 3 shot flight of sake) for 2. Not recommended.", "author": "Nick O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-03", "description": "Came across this place while looking for sushi in the city. They were busy and under staffed, only one waiter for about 5-8 tables. So it took her a while to acknowledge that we were there! We ordered Dragon and Volcano Sushi rolls, edemame and chicken udon soup. It took a little while for the food to come and the volcano sushi roll was not riled properly because you could not even pick it up without it falling all over the table, we only ate 2 out of 6 pieces :( the volcano sushi roll was good! The chicken udon soup was not worth the price because the noodles were still hard and not well cooked and hard to eat, and the edemame was just barely boiled and not even salted! Over all I would give it 2.5 because it was too pricy for mediocre food. Spent over $65 for pretty much just one sushi roll because the rest was left on the table!! Also few hours later I had a pretty bad visit to the bathroom:(", "author": "sahar m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "It's really nice to find a sushi place open until 11pm, so that is a plus. I stopped in here by myself around 10 to eat at the sushi bar. The servers were very nice but the food took a while because there was just one sushi chef and I guess he had a lot of orders. I wasn't in a huge rush but I was very hungry. I didn't ask for anything but the waitress offered me a salad because of the wait, which was much appreciated!  The sushi was great, ask the food was good. I would definitely come back here!", "author": "Adrian O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "The people here care about how you like it. There is no way to explain how good the food is and how nice the people are. We don't know very much about California and have not been here very long and they were telling us places we should go next that would be fun for the family. The food is fresh and well cooked. The restaurant is clean and pretty. They visit with you and try to get to know you. Our waitress Natasha really cared. It was my favorite restaurant of the trip. Olivia - 10 years old", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Still here, but excellent service and great food so far.  Super super nice staff.  Very friendly and very helpful.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Excellent quality. You will get just right balance between the fish and rice. Tempura so light and fresh.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-19", "description": "I have been coming to this restaurant for several years, but my last experience a week ago was rather negative. This place used to be a nice place to dine at, but now its noisy, and the people working there are a bit pushy. When I tried to order some sushi the waitress and hostess would essentially not listen to me, or let me finish my sentence. They just keep pushing their specials, as if they wanted to get rid of some fish that they didn't want to be stuck with. When we finally did order it took them over 30 minutes until our sushi arrived, and it tasted dry, like it was sitting on the counter for awhile. I will not return here, at least for awhile.", "author": "D W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "Their food is fine but pricy for what they are serving. It's just a normal Japanese restaurant serving normal Japanese food. If I spend $19 on a chef special role I would expect something more than a few pieces of fish assembled together with egg and cucumber.", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-08", "description": "I'm from Dallas and was visiting San Francisco for fun. In particular, I was looking forward to the seafood and especially the sushi since there is the perception that seafood is better if you're in a city on the water. \n\nI was wrong. This place is questionable at best and I'm not exactly sure how this quality of sushi is acceptable to the locals. But hey - if you're not a real connoisseur of sushi, you probably wouldn't notice. The only redeemable part of this place is their lunch specials on Japanese beer. \n\nAdditionally, if you're a San Franciscan that is upset with this review and thinks that this place serves good sushi, I invite you to come to Dallas and to try Sushi Sake. Give me a shout and we'll make a night out of it.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Great food and wonderful service! After walking thru Chinatown, we were ready for some food and this place is just outside of Dagon Gate.", "author": "Lavinia A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "I stopped by here for dinner while I was out and about in San Francisco. The first thing I noticed with this place was they had slow service. When my wife and I walked in there was no hostess and a waitress told us to sit next to the table she was taking an order from. After that it took awhile for her to help us, she must have seen me looking around when we were ready because she popped out and said she would be right with us. They service was slow all night, they did have one table that was around 10 people, but other then that hardly anybody in the place besides us.\n\nSo when we did get our food we had the agedashi tofu as a starter, this was fantastic and I highly recommend getting it. After having that I thought maybe this place was underrated in Yelp and we would be in for some good sushi, but as it turns out it was not to be. \n\nWe had about four different rolls, and on all of them they were pretty small and the fish did not seem fresh at all. The rolls that they have to as well are not as creative as I have seen in other places. We decided to try a hand roll to see if that was any better and more of just the same, not very fresh fish. \n\nOverall I would say the place is not horrible, and it might actually be worth the value if the price was lower, but for the prices they charge I would expect better. I probably would not come back to this place.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "Mikaku is a useful place to know for your no-frill-basic Japanese food at reasonable prices.  With so many 'fake' Japanese restaurants in the city, this one is 'real'.  This is NOT a place where you want to take your date, parents, or out-of-town guests.  When you open your fridge and realize that you have no food --- head to Mikaku.  \n\nTIP 1:  The regular printed menu includes the usual basics with nothing interesting.  For dinner, I highly recommend ordering only the items on the white board on the wall that reads 'Dinner Time ONLY', and stay away from the stuff on their regular menu.  On 9/2/2006, they had items like Kampachi Sashimi from Japan ($9.85), Buta-kakuni ($4.95), Grilled miso marinated chicken ($6.25), Simmered Pumpkin with Ankake sauce ($5.50), etc.  I really liked their Aji-nanbanzuke (Marinated Spanish Mackerel with ginger) ($5.75).  \n\nTIP 2:  Try their home made Buckwheat Noodle ($8.50).  Japanese community raves about Mikaku's homemade soba (served only during dinner), which ends with soba-yu (unless they forget).     \n\nTIP 3:  I've never tried their nigiri, but I don't expect impressive nigiri sushi in these kinds of restaurants.   Chirashi-sushi during lunch is a pretty good deal. \n\nTIP 4: Street parking near the restaurant is tough, but during dinner hours, your best shot is Pine Street near Grant.  If you are not super cheap like me when it comes to parking, there is a Sutter Street garage nearby, which isn't too pricy.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-02", "description": "This was a spur of the moment restaurant for my boyfriend and I. We had nowhere else to go and ended up here after 30 minutes of walking around trying to find a place to eat, and ended up ordering our food to go so we could eat it at the hotel.\n\nWe ordered a Spider roll, Rainbow Roll, Nuclear roll, and the Double Hamachi roll. The spider roll was just okay (I've had better), the rainbow roll was good, because the fish was fresh, the nuclear roll was okay as well (too much tempura crumbs which overpowered the actual sushi), and as spicy as the double hamachi roll was I actually enjoyed it. Their rolls are pretty small too. Normally, when we eat four rolls of sushi, my boyfriend and I are insanely full, but after eating what we ordered, we were left still feeling hungry.\n\nJust like most restaurants in San Francisco it was tiny, but it was crackin =)\nThe atmosphere was good and the employees were friendly and helpful. Also, our wait was actually quite fast so that's a plus. Unfortunately, I don't think I would come back here anytime soon just because their prices were out of control for sushi rolls that are just mediocre. We ended up spending $56 on the four rolls we ordered. Not cool.", "author": "Jorgess M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Excellent sushi!  Wandered out of Chinatown and found this gem. Wonderful sushi, edamame, and pickled veggies.", "author": "Carolyn O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "Our first choice for sushi was all booked up on Saturday night. Fortunately, Mikaku was just right around the corner.\nI'm not sure how good the original place was, but Mikaku was excellent!\nThe service was super fast and friendly. The nigiri was totally fresh and flavorful. Yum! I was starving and didn't really feel like reading the menu, so I just asked them to bring me their most spicy roll. Sorry I can't remember the name, but it was fantastic! It had fresh jalapeno and spicy tuna. There was also tempura shrimp, which isn't usually my favorite, but here it was delicious.\nNext time we're in SF, Mikaku will be our FIRST CHOICE for sushi!", "author": "Charles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-01", "description": "Best vegan sushi in San Francisco and the nicest staff. I highly reccomend the Veggie Tempura and the Catepillar Roll. I could eat here every day.\n\nI've eaten at this restaurant and ordered it to go. The quality and freshness are consistantly top notch!", "author": "Scott C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "One of the best meals I've had in a long time. Talk to the chef and order off the special menu for an amazing experience. Try the chef special #2 if you can, one of the best rolls I have ever had, and definitely the most/best fish.\nI will go back again. Amazing and fun place.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-01", "description": "I had dinner here with a group of coworkers after a conference, and we all thought something was a little off when everything smelled fishy. (I've been to plenty of sushi and seafood restaurants, so it was beyond just that; it was almost like the water smelled fishy, too). The food wasn't all that appetizing. My coworkers weren't really fans of the roll they got; it was the first time I saw them not finish the sushi on their plates. I got the cooked yellowtail collar at the end of the night that was highly recommended by the waitress, and wasn't impressed by that either. I think the only thing I liked was the poke.\n\nThe reason this is 1 star instead of 2 or 3 though is that I then spent most of the night sick in the bathroom. So did one of my coworkers. Three days later I still don't even want to look at fish. And I've never had this reaction to sushi before.", "author": "Natalia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-25", "description": "Overpriced for what you get. $6 for two pieces of skinny nigiri $12 for tiny maki rolls, no thanks. Service is good though. I'll stick to Warakabune instead. Not coming back!", "author": "Griselda Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "Great variety of fresh fish - be sure to check out the Special Fish from \"Tokyo Tsukiji Fish Market\" selections on the board. Excellent!", "author": "Lindy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-30", "description": "Walked into a very empty restaurant at 4:45 PM on a Friday. Was extremely hungry and craving sashimi. I googled the closest sushi bar and found this one. Didn't understand why it was so empty but now I get it. Sat down at a table by the window. My back was hurting so I sat in a cushioned seat by the window. The waiter or hostess or whomever came over to me and said that this table was reserved and tried to put me at a super small wooden table in the center of the restaurant behind a pole. I explained to them that no one was there and asked if I could sit in this table and he said no sorry. \"Reserved\". I asked if the whole restaurant was reserved because no one was there and it looked like no one was coming there. Then I was thinking \"wow, these guys must be so so busy that there's no room for me.\" So I just left and went around the corner to a great Asian restaurant on Sutter. Super yummy and service was impeccable. So on the way to Niemans I cruise by the sushi restaurant and it IS STILL EMPTY!!!! I can't believe that they would be so rude when they were so empty. Maybe I have body odor. I'm pretty cute so can't be that. I'm your window dressing, dude. I wanted to walk by there like Julia Roberts in pretty woman on Rodeo drive after she went shopping. And say... \"Big Mistake!!!!\"", "author": "Marie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Very tasty! An excellent happy hour (5-7 Mon-Sat, 10-12pm Fri/Sta) includes $2 beer/saki, $3.50 handrolls, and $3-6 select rolls and apps. The well-stuffed spicy tuna handrolls were a standout, consisting of real tuna with no spicy mayo cheats; they're a bit spicier than some places but really good. I apprecaited that the music was limitied to a good background volume. Staff were attentive and friendly, offering opinions if asked, and politely double-checked when I ordered a couple items that tend to be love/hate, such as the Ume Shiso (pickled plum).\n\nThey also have lunch combos ranging from $7-12 and Sapporo draft for $2. I certainly plan to come back to try them!", "author": "Bill B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "The food over all was great. The service was very slow, my family and I were the only ones in the restaurant and our food was delivered almost an hour later.", "author": "Carla C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-04", "description": "I cannot. You know those prepackaged sushi rolls that you find at the supermarket? That's the quality you get here. \n\nWent here for lunch during the week because Akiko's was too full and this was the closest Japanese restaurant that seemed okay based on reviews. \n\nWent in during the lunch rush (12:30pm) and the place was half empty. That should've been a good enough indication to run. We got seated right away and got menus. At first glance, prices seemed pretty comparable to other places. Ordered a lunch set and a speciality roll (Volcano - California roll w/baked scallops). Because of the prices, I was expecting decent quality, but that is definitely not what I got.\n\nFirst off, the Volcano roll was $16. It came with a tiny California roll with imitation crab and a few pieces of scallops. Quality overall tasted like prepackaged sushi because of how dry and somewhat hard the ingredients were. However, it was warm because they threw it in the oven. Boyfriend got the lunch set with Bluefin toro nigiri. Same poor quality. Cali roll with imitation crab and below average sashimi. He mentioned that the bluefin tasted \"funny,\" but couldn't quit put his finger on it. He did not say this with positive connotations. \n\nBill came out to $50 for some of the worst quality sushi I've ever had. Don't mean to be a sushi snob, but the people giving this place 5 star ratings probably don't know what good sashimi is suppose to taste like. I felt like we were paying restaurant prices for Safeway sushi. At least if I'm buying sushi from Safeway I know I'm getting what I pay for. Mikaku's portions were also so small that I was still hungry but didn't want to order anything else because I knew it would be bad. After we left and we actually got a burrito to split before I headed back to work. Really. \n\nThere's so many great places for sushi in the city. This is not one of them. I don't even know how this place has more than two stars.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-04", "description": "This place was absolutely terrible. The fish wasn't fresh, it was overpriced and the service was awful. I don't write a lot of reviews, so congratulations mikaku, you broke me out of my writers slump for this review.", "author": "Milton Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "3.5 stars. We were looking for Akiko but could not find it. Maybe it was all the green beer we just had. \n\nAnyway this is right on the entrance to Chinatown so we were not expecting much. But we actually liked everything we ordered! The appetizer popcorn chicken I think haha were very good. Calamari was one of the better we've had. A friend had teriyaki beef, she liked it. Another had 2rolls of sushi, he liked them. I had soba, which I liked. Service was a little slow but overall not bad.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "enjoyed!\nthe evening we were there, there was luckily a fresh delivery from Tsukiji fish market.\nalso, rainbow roll was tasty.\nservice excellent and respectful.\nalso like the chalk board wall menu", "author": "Ken I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-25", "description": "The first time I came here, I didn't actually try the food. What happened was a group of my friends decided to all meet here during happy hour (4-7pm) to try it. We sat down, perused the menu, ordered some drinks and waited for our friends. \n\nThe waitress decides to tell us after bringing over our drinks that they were closing in an hour to serve a private party.\n\nWe were certainly annoyed. 1) we had friends coming to meet us and they certainly wouldn't be able to eat within that time frame, 2) we were planning to sit and relax for a while, thanks for telling us AFTER we ordered?\n\nWe explained our situation and asked if there was any way we could stay longer. They said no, so we left our drinks untouched and left. The chef/owner and waitress looked at us in annoyance -- but was it really our fault they neglected to tell us such a crucial detail? There was also no signs to be seen.\n\nI came back at a later time, recalling their drinks were decently priced and with a different group of people. I am embarrassed to say I made a very poor decision. The restaurant was empty (a tell-tale sign), and the drinks' prices increased. You could literally see the \"50% off beer\" scratched off on the menu. They couldn't even bother printing new ones! So we asked them what the price was -- 20% off. Oooh great, $.80 cents off a pint of beer...\n\nBut we had walked a ways to get here, and we settled with a pitcher of beer, garlic fries ($2.50 for a small bowl -- don't get it, just hit up Trader Joe's and bake your own. It barely tastes like garlic), and some rolls. Surprise, surprise...the waitress forgets my order.\n\n\"Hi, excuse me?\" I ask, \"Is my shrimp tempura roll coming?\"Z\n\nShe eyes me hostilly. \"Did you ORDER it?\"\n\n\"...Yes.\" No lady, I'm just trolling you. OF COURSE I ordered it. \"Could you check on it? If it's not made yet, then it's fine.\"\n\n\"Sure.\" I watch her as she goes behind to cashier and...just stands there. She doesn't even check on it for me?! She just stares at me, and we have a bit of a staring contest.\n\nMy friends said their rolls were decent/pretty good, but was on the pricey side even for happy hour. With bad service, expensive happy hour, I certainly will NOT be coming back. We really shouldn't even have tipped them.", "author": "Mina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "This was our least favourite meal in San Francisco.  We went here on our last evening because it was close to our hotel and we both love sushi and Japanese food.  Some of the reviews below indicated that we would like the fresh fish - this was not our experience. The hot food was the best of the meal for us.\n\nOur drinks were nice (my Mom got a sake tasting flight and I got some happy hour cocktail). The setting was nice and the waiter was friendly and enthusiastic.   We were seated immediately (restaurant was nearly empty) and the food came out quickly.\n\nWe ordered the real crab California roll, the Tuna belly nigiri (I think market price was $12 for 2 pc), the shiro maguro (albacore) nigiri and real wasabi.  We love wasabi, my Mom grows wasabi, and we have eaten real wasabi numerous times.  This wasabi was so weak and bland we couldn't believe it - there was zero pungency (and I'm not looking for the horseradish pungency of fake wasabi, but real wasabi has a flavour and this tasted like wallpaper paste or something).  \n\nUnfortunately, blandness was really the theme for the sushi - the crab had no mild sweetness like Dungeness usually has (it wasn't off, for which I am grateful!), the tuna belly was really meh, and the shiro maguro was awful - they sear it!  So instead of a nice piece of cold albacore, we got some gross pieces with cooked edges.  Blah.  We waved the waiter down and asked if they always serve it seared.  Apparently they do - it would be nice if they noted that on the menu.    \n\nWe both prefer a very plain sushi experience, so the flavours of fresh ingredients shine through (California roll is as exotic as we get, as we both love crab and avocado), and we don't enjoy fusion-y rolls with sauces and embellishments.  For plain raw fish, I do not recommend this restaurant.  We get better raw fish sushi at our grocery stores at home.\n\nWe decided to move on to their hot food, and this is where my stars are coming from.  We had the chicken karaage, and it was very tasty, with a nicely strong ginger flavour.  We also had the combo tempura, and that was quite good too (my mom liked it more than I did - I found it a little soggy) - the selection of vegetables was good.  I wish I had gone with my initial instinct to get Ten Don.  \n\nWith all of the restaurants in SF, I know we won't be back to this one, as it's just not our kind of food.  If you are going for a meal of hot food, or if you like cooked sushi, you may enjoy it.", "author": "Ali K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-03", "description": "This place is around the corner from my work and I started coming here for lunch after my other sushi place took sashimi out of their bento box. \n\nReasonably's priced lunch, plenty of food for your dollar.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-11", "description": "After walking around downtown SF and showing my friends around, they wanted to eat sushi for lunch. We decided to come here since it seemed like the only decent restaurant serving Japanese food. \n\nOne thing that bothered me was when we arrived, it was 1 pm and they said they STOPPED serving from the lunch menu. I was confused, were they trying to jip us? It seemed way too early for them to stop serving lunch. Whatever we just ordered from the main menu. I got the Cherry Blossom Roll which was basically the typical raw tuna with avocado and other raw fish. I mean it was pretty fresh, but the roll itself was extremely dinky. It was almost like they cut one roll in half to make it seem like there was \"more\" to the dish. \n\nMy friends' sushi dishes looked decent. I feel like I have definitely had better sushi for the price they were serving it to us. They had a sake bomb sampler which I thought was cool. You get about 5 samples of different sakes and the boys definitely downed that! I guess the sampler makes the experience here much more entertaining than eating the food here. \n\nNot sure if I would come back here again.", "author": "Katrina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Love this place.\n\nJin is a great guy who makes very good sushi. The rest of the staff are always good too :). I go here frequently with my friends and we always have a great time.\n\nIts located conveniently down town and isn't super expensive. The sushi is always good quality and the ambiance is great! We love to saki bomb and dine here, always a lot of fun.", "author": "Glenn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "I haven't been to Mikaku in years. Over 10 years. They specialized back then as the best tonkatsu in the city. I had it today and it is still amazing. I also decided to try sushi and a hot saki on this cold day. They actually had choices and it was just delightful. A word of caution, small size Saki seems like it's never ending. Lol. Food, atmosphere and service  awesome. This place used to have a line out the door. My guess is a product of all businesses moving from Kearney  to SOMA. Thank you for this relaxing lunch. I so needed it", "author": "Serena W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-07", "description": "Wow. After reading so many of the controversial Yelp reviews on this place, I had no idea what to expect. But my experience was pleasant. \n\nWas it the best sushi I've ever had? No it wasn't. But I was served promptly and was treated well throughout my meal here.\n\nMikaku has a good energy with uptempo, party music. Totally fun, if that's what you're looking for. I can imagine that at night, their late night happy hour must make for a lively atmosphere. \n\nAfter paying my bill, the sushi chef handed me a cute, long stemmed, watermelon lollipop which I thought was a fun and playful touch to my dining experience.", "author": "Tara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "I come here often for sushi and have never been disappointed ... the sushi is always yummy and I feel the prices are reasonable as well.  There was only one time that i was uncomfortable which had nothing to do with the restaurant ... it was the couple sitting next to us and the guy was making his girlfriend cry.  The tables are so close together it was really awkward.  Every time I come here there is never a wait and the service is always great.  Mikaku will always be in my regular rotation for sushi.", "author": "Halley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "I stopped by here to pick up some rolls before my airport shuttle. I ordered the dragon roll: shrimp tempura, cucumber, and eel on top; volcano roll: baked scallop on california roll, both rolls were yummy and fresh, I liked how they just put the stick of crab inside without shredding it mixing it with all that mayo, I also like how they don't drench the roll in eel sauce although a little would have helped; each roll had the perfect amount of rice; the seaweed salad portion was tiny :( overall I was satisfied", "author": "Kathy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Lovely place.. There is not alot of sushi places in the areas. Im vegetarian and they have a variety of veggie options in the menu.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-21", "description": "I had the cucumber roll with no rice..the shrimp, crab, and spicy tuna was eh..I had better seriously..my friend had the house salad..it was pretty big...the volcano roll was small..seriously the price of just 3 things is like 35 bucks..gah..sorry too expensive for this kind of quality...better luck next time..", "author": "Minerva L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "Okay service with okay food. Came with four friends. We were seated promptly. However, the chef burned mine and my friends food and we waited over 40 minutes for our food. Overall, the food was just okay. I have had better at other restaurants that weren't as pricy.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "It's a shame for such a culinary destination like SF, and such a amazing location like union square to serve such disappointing sushi. It was Safeway quality sushi! You can and should do a lot better. Please!!!!", "author": "Faezeh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "Revisited this spot last weekend during a very busy 7 p.m. dinner seating. There was nearly standing room only but luckily got in at the bar. Took a very long time for basic water and beer service and the sushi bar was out of items, including quail eggs (WTF?) They had a great selection for happy hour and everything tasted fresh and delightful. I would have liked some edamame and miso soup with my full priced meals, but only one in our group got that. Maybe we were supposed to share? I think service suffered because it was so busy, but the food was still amazing, so that made up for it. I hope when I come again I'll get that VIP service I loved the first time.", "author": "Kara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-28", "description": "This place was a lot of fun but the sushi was a little disappointing! $3 Saki bombs during happy hour and an unexpected music selection including several Alicia Keys jams made it great! Also, the pho smelled amazing!", "author": "Jess T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-01", "description": "Don't get me wrong: the sushi here is not awful. That said, it is the kind of sushi you can get at a QFC or Safeway, not a Japanese restaurant in the heart of SF. Here's my experience:\n- the waitress got my order wrong by two items (out of five). WTF?\n- the sushi that I got tasted average. Really nothing to write home about, folks.\nNow, depending on what you compare it with, you may think the sushi is ok, but I ensure you that regardless of what you compare it to, there's better places than this. So if you want some quality sushi, that's not the place for it. However, if you are looking for grocery-store grade, welcome.", "author": "Maria N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-13", "description": "Came here to get a to-go order for lunch.  Ordered a Sushi combo.  The sushi was pretty good, pretty sizable cuts of fish, and reasonably priced.  \n\nHowever, I was shorted a piece of sushi, so I'm cutting two stars off.  My combo was advertised as having 5 pieces of nigiri, but what I found when I got back to my office was 4 pieces.  Check your orders, people!", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Zeon was amazing! THE best server, hands down! Handsome, great smile and so personable! My beautiful friend of eight years, visiting me from Miami and I, had a beautiful time, destined to arrive here on this sushi mission! And, oh, hello?! The food was divine! No photos because we scarfed it all down, like that! Walking missions, on empty stomachs, to find an open sushi restaurant, aren't always easy here in the city, so we soon realized! But darn it, it was so worth it!", "author": "Laura K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-05", "description": "Not clean.\nMediocre service.\nYellowtail was pretty good, but not to warrant the expensive price.  13 pieces of sashimi for $50 = $3.85 per piece!\nThe best part of SF is that it truly is a diner's paradise - hundreds of choices within a seven mile radius!  Don't settle for mediocre food in SF.", "author": "SoCal S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-18", "description": "3 1/2 stars over all if I could, but maybe 5 for the Hamachi Kama! \n\nAgain another good solid sushi place, but not much special about it, although the Hamachi Kama was great! Nice large collar with homemade ponzu sauce and grated radish so delicious!\n\nAverage prices and service.", "author": "Jill P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-12", "description": "I tried different sushi restaurant in sf, this one is the worst. The raw fish is not fresh. And tempura is tasteless", "author": "May H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "found this place on a rainy day since all the other restaurants are full....... Very under rated, nice environment and nice food.", "author": "Wendy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Best sushi in San Francisco! Try Chefs Roll - outstanding! Service is great and the atmosphere feels like you are sitting at home. A-must-try!", "author": "Fred H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-27", "description": "My sister and I stopped by here after an afternoon of shopping. Our first impression was great I give it a five stars for atmosphere, very fun and cozy! The service however was not so great. We waited fifteen minutes for a glass of water and they took another fifteen minutes to bring our cocktails. As far as sushi, it was fresh however if you are looking for a variety they need more on the menu when it comes to specialty rolls. It is a bit pricey but overall I would revisit.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "The sushi was alright. Nothing too impressive. The portions are in the smaller size for the price but the staff is great! \n\nThe music is also a bit like a club's so that's cool I guess.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "This is my favorite stop for sushi without breaking the bank. I usually hit their happy hour 5-7pm for some great sushi and saki.", "author": "Sid B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Delicious! The Godzilla roll is so good. The atmosphere went I went, which was right at the end of lunch time, was very mellow and quiet. It was relaxing and the ambiance was peaceful. I liked that a lot. That's all I can really say. Oh, and the service was good. :)", "author": "Karen N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-08", "description": "This place was really disapointing! I came here on my lunch this week, craving some yummy sushi, and decided after enjoying a roll that I'm NEVER coming back!! Eeek! I ordered the Godzilla roll, which was a shrimp tempura roll with some other kind of raw fish and avocado. They (he/she) left the tough shrimp skin on the shrimp, so every single miserable bite of my roll had the tough shrimp skin texture in it. I was very annoyed and sadly paid way too much for that one roll--20 bucks! I think the place is in business simply because the location is very tourisy. Lousy sushi!!! Go somewhere else! You are warned.", "author": "Mariel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-30", "description": "This is the WORST sushi restaurant We have EVER been to!! I couldn't believe they use IMITATION CRAB in their rolls???!! The MISO soup was tasteless and disgusting. I told the manager have you tasted this soup?? She smiled at me and said..\"no\" .. I asked her to taste it. She went to the cook and told her to taste it. The cook went outside took a bowl of miso and went back to her kitchen.. I imagine SHE MUST HAVE SPAT IT OUT!!  The manager came back and I said \"well\"? And she said, yea she's fixing it. I said ok.i expected to get replacement soups. But nothing ever came. When the bill came I said ..\"i am not being charged for the miso soups right? She said \"no\" i looked at my bill and there they were 5 miso soups. I called her back, she said \"oh, i hadn't noticed that she had put them on the bill.\" I said , look your the manager. You need to do more than just run credit cards. You need to taste your food to make sure that the food IS EDIBLE before serving it. There is no air conditioning and it was 88' and humid(it was hotter in the restaurant than outside), the beer is lukewarm,  the rolls are lukewarm and the miso soup is tasteless?? She just smiled and said \"sorry\" as she took my card and rans my $163 bill, minus miso soups. \nBOTTOM LINE.. \nDONT GO HERE IF YOU LOVE SUSHI!!!", "author": "Betsy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "The sushi was fantastic! I ordered the California roll, shrimp tempura roll, and fresh albacore. The prices were not that high for the location in the city. I don't see why this restuarant has 3 1/2 stars because it deserves much higher. Nice piece of crab on the California roll, the avocado set it off it was spectacular. We only had a small amount of food as an appetizer but It made me pretty much full sharing that order between three people. Definitely try to stop here!", "author": "Shane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "Damn good sushi, damn good service. That's all I need to say. I'm stuffed, gonna roll myself down the hill back to my hotel.", "author": "Peter A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-13", "description": "Good but not great, I got 2 rolls... Cherry explosion or something like that, was best .", "author": "Alex A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-31", "description": "happy hour from 5-7pm!\n\nThis place is okay overall....but I definitely had better. I ordered one of my favorite rolls, the LION KING and it was alright. Salmon was not too dry, mayo was good...but something was missing....The lion king here was not the same as THE best lion king roll I had at Sushi House in Alameda. \n\nI also ordered the spicy tuna roll but was not satisfied with it. Maybe it wasn't spicy enough..but it was definitely lacking. \n\nWill I be back? I'm not too sure. It wouldn't be my top choice but I would come back for happy hour IF I'm ever in the area....", "author": "Eileen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Some of the best sushi I've had in the time I've been in the states. Would recommend the spicy tuna, lots of flavor and is actually spicy compared to the spicy salmon. Affordable prices and they have Kirin ichiban draft which is always good! Would eat here again!", "author": "Nemanja A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-29", "description": "The service here, as a whole, was pretty iffy: really sub-par greeting, the waitress couldn't have acted less interested, etc. At the time, we were one of only 2 other parties, and we were barely checked on throughout the meal. \n\nOur donburi bowls were huge, but it would have been nice to have a few more pieces of meat.", "author": "Anthony P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "This was a very nice place! Their food was good and the chef altered the menu according to what I wanted. Cheap beer in happy hour.", "author": "Ashwini B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "We stopped in for happy hour and enjoyed the spicy tuna roll. The staff and service were great. All of the food was very good quality. Great place to eat!", "author": "Shane J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "My cousin and I went here for our first meal in San Francisco. It was down the street from our hotel and I'd previously seen great reviews. The sushi was excellent. The tuna was unbelievable- so fresh and beautifully fresh. We had one of the special rolls that was oven baked, something I've not yet had and it was great. I would definitely recommend this place, the service was great, the staff very friendly and attentive.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "Japanese comfort food.  That's what this quaint little restaurant offers on the specials menu (dinner only).  The crispy taro cake tastes like Japan... and it's hard to find tasty dishes like this anywhere else in the city.  The crispy duck is perfectly fatty, and the rock salt to dip in is a nice touch.\n\nIf you must go during lunch, the 3 roll special is a great deal (get the saba-gari).  The curry with rice is also quite tasty.  \n\nOnly complaint is the bathroom... no bueno when you feel dirtier exiting than entering (read: where's the soap?!)  :(", "author": "s m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "If I could give six stars, I would. The food was really good. The menu vegetarian-friendly and I loved the house sesame dressing on the salad. The service was great, too!", "author": "G C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "This place is really fantastic. I know my sushi and it's great here. The wait staff are so sweet and accommodating. 5 stars all the way!!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-30", "description": "So a friend from Austin, TX was in SF for business, and I thought it would be fun to come to the city to show him around (as best I could with my central valley sensibilities) and he said he'd buy lunch.  SCORE!\n\nAfter a quick back and forth of \"what do you want to eat for lunch?\"  \"I dunno, what do -you- want?\", we settled on Japanese and both pulled out our phones to search for somewhere to eat that was 1) open at a bit after noon on a Saturday, 2) within walking distance from the parking garage where we had just stashed my car, and 3) wouldn't make wallets cry out in pain.  (Turns out 3 was just me, since he didn't tell me he was on an expense account, but it's the thought that counts, right?)  Yelp popped Mikaku up on my phone as a few blocks away and off we went.\n\nI don't eat nearly enough Japanese food to know the intricate details of what things should or should not taste or look like, so I can't wax poetic on how my maguro sashimi was super authentic or horribly caucasianised.  I can, however, say that it was some amazing fish, cut perfectly to that almost-melt away on your tongue texture. They weren't little floppy pieces either; with my order of six and a bowl of rice I was quite comfortable for the rest of the afternoon.  My friend got a box of some sort (I was too busy people watching out the window to hear what he ordered) and he seemed pleased with it - I know he couldn't finish the whole thing and was talking about still being full several hours later when we got a noseful walking past The Stinking Rose.)\n\nThe service was decent.  We weren't ignored by the waitress, who had hot green tea in front of us before we were even fully settled into our seats.  The sushi chef was convivial, laughing with several different people who came in.\n\nI don't find myself in SF enough to say  how Mikaku relates to other restaurants in the area, but I'd come back again.  A grand time was had by all.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-22", "description": "Good: Quality food. Friend and I both had the bento lunch special with an a la carte order of sushi. Not the best SF has to offer, but certainly no the worst. Portions were just right - enough to get us full, but not too much that we couldn't finish.\n\nBad: Service was slow, and the place was half-empty when we got there. Took longer than it should have to take our order, bring our water, and pick up the check. Also, the server DID NOT check in to see how we were doing or to refill our water glasses. Thinking back on it, the tip I left was more generous than it should've been.\n\nOther: Prices are decent for SF standards. Lunch for two, with tip, was less than $40.", "author": "Joe A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "I like this place a lot. Mind you, I only eat vegetarian stuff but this place is great for it. Go for happy hour - cheap great sushi!", "author": "Jane W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "Small whole in the wall sushi place. The waitress was friendly and helped describe the sushi selections.. They have cheap happy hour specials including $2 draft beers (can't beat that in the middle of the city)! The sushi was good and was on the cheap :)", "author": "Daisy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-03", "description": "Pros:  good hot dishes and happy hour menu\nCons:  service\n\nI eat here about 4 times a year.  Their hot dishes were always good and the service was acceptable.  I went in for happy hour today the food was as great as always but the service was just a train wreck. The male server had very negative attitude and the service was pretty slow.  Sad...", "author": "E C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Has dinero foros one at The bar. Food was good and fresh. Service was prompt and friendly. Confused my order a bit, got two salmon Nigiris instead of one salmon and one mackerel.   But it was all very enjoyable", "author": "Jesus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "This was great sushi. So fresh! Went for lunch on a Saturday. Attentive staff and super fast service.  Will be back for sure!", "author": "Torry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "I would eat here again. And I would order the same thing. Got the lunch special with two items. Beef teriyaki and three pieces of tuna sashimi. Fish was fresh and taste. I loved it. The teriyaki was good too. Full of flavor and the beef was not fatty. It was $11.50 for the meal. Took about 10 minutes. Place was somewhat busy for 1pm on a Friday.\n\nLooks liked they have a good HH on booze and light apps, only handrolls were on HH menu.", "author": "sierra s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "I came here for dinner on a weekday. This little restaurant is pretty cute and conveniently located near downtown SF. The food was pretty decent. The chicken karaage was slightly disappointing but the spicy chicken wings made up for it. I got the nabeyaki udon (chicken, tempura and egg i think). It was okay. If half stars were allowed, I'd give this place 3.5 stars, but +0.5 for the super nice waitress!", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "This is my second time at Mikaku. My grandma took me here the first time with a friend of mine. The first time was excellent; I had the chicken teriyaki/gyoza combination. This time I had the combination with chicken teriyaki/tempura. The chicken is pretty good (no fat, bite-size) and the teriyaki sauce is not the typical thick sauce you may find at say Kitaro. The gyoza is a hit as my grandma ordered it this time around. They give 5 pieces with sauce. I like that it's not fried to a burnt brown but just right. The tempura was not that great, however. The vegetables were alright but could it be any thinner?! I've had better and bigger shrimp too. The rice I got was very sticky for the most part this time. \n\nCustomer service was stellar the first time but today, we weren't served often at all. It's strange how different the second time was. Tea was never refilled and when they asked, we already paid the check. No one ever checked up on our table. Minus 1 star for that. If it helps, I really like the green tea! Although the little tea cups should be bigger since I kept refilling my cup like no tomorrow.\n\nI really liked the music that was playing the first time I came around. I couldn't figure out what station it was on XMSirius. It was some techno station that made me instantly fall in love with seeing how Energy 92.7 is no longer. Today, was some strange genre that was not exactly country or alternative. Boo, but I'll still come back for another meal.", "author": "Dominic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "This place is awesome. Our server was attentive and the sushi was delicious. Everyone was very friendly and knowledgable. Sushi was fresh and amazing! A must to visit in San Fran.", "author": "Nicki P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-12", "description": "I came here after work one day with a friend and was greeted warmly by the staff.  When we were seated, we noticed how dimly lit the space was.  It was so romantic.  It was a really nice space to catch up with a girlfriend, but at the same time, it would make a nice first date.  \n\nThe food was okay.  The quality was good, but not as great as I had hoped.  I did appreciate the soft-shelled crab, because it tasted fresh and was sweet, but overall, I've had better sushi.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-27", "description": "Don't eat here if your intentions are to order salmon teriyaki. They probably are the most ridiculously shady place ever. The size of the piece isn't even comparable to any other place. It's not a whole filet. It's not even a part of a filet. It's a small, thin SLICE of a filet from the meatiest part. So you're essentially getting a bite's worth.\n\nPS. I vowed not to come back but I did, not by choice! Someone took me here to lunch and I figured I'd try the salmon again to see if it was JUST as tiny and it WAS! I also pretended I never ate here before to the person, but I was honestly grumbling under my breath when we arrived! :[", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "AH-mazing one-of-a-kind chef specials! Great service!", "author": "Sheryl A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-25", "description": "It's all about Happy Hour - lasts until 7pm.\nPrices are reasonable and rolls are easy to share. For 3 girls, we spent around $30 including drinks. \n\nNot the best sushi in the world, but Mikaku is great for relaxing after work in a more quiet restaurant to actually hear the people you're with.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "Extremely good and fresh sushi! Super tasty in a great friendly environment! \n\nHighly recommended ! Great place to go! :)", "author": "Mauro P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "We will be back for more.  The double hamachi roll was amazing even though we aren't \"roll\" people.  We loved the sashimi and the sake nigiri, the selections were awesome and the fish very fresh.", "author": "Erika S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Tried this place out for dinner on a Saturday night. Lots of people there but the two of us were able to get seated right away. We ordered a pitcher of Saporo, my boyfriend got a Bento box, and I got the China Gate Roll and a miso soup. It wasn't the most flavorful miso soup I've ever had but it was good nonetheless. When my roll arrived, it was smaller than I expected so I immediately ordered some gyoza. Well, the gyoza took about 30 minutes to come and seemed like it could have taken shorter. The waiter apologized and said a lot of orders went in at once so I guess it is understandable. The food was all really fantastic though.", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "there are very rare exceptions that I would give a place 5 stars...and Mikaku is one.\n\nEven though we were one of the last customers in the door before they were closing, the owner and the staff were very nice to take us in and wait on us as though we were there during the busy times.  The food was prompt and delicious! \n\nAlso, double plus to the owner for coming over to our table and conversing with us during our meal and having some sake with us!  I always appreciate when the owner can take some time to come out and mingle with the customers (even if its for a shot of sake).\n\nThe friends I brought with me were visiting from Hawaii and from their reaction, the staff and owner did a wonderful job in making their short visit to the restaurant a memorable one!  I will definitely find the time to come back when I find myself hungry and in the city once again!", "author": "Aimee Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "Seems like the place is Korean owned. Came here for a quick bite to eat late night. I got the house salad and agedashi tofu, both were good but this was only the 2nd time I've gotten tofu at a restaurant so I don't have much to compare to.. And didnt get any rolls or sashimi so i wouldnt know about their quality of fish. But the chef that night was amazing though - he gave my friend and I a soju shot each, some kind of spring roll, and a fried banana dessert. Id come here again just for the service", "author": "Airee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-02", "description": "If you're looking for traditional style sushi, look somewhere else. No uni, amaebi, hotatei, ankimo, chutoro, otoro, belly of any sort, anything served alive, natto, or kama. Yeah, Mikaku is just another American roll factory.", "author": "Grayson K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-22", "description": "We went right after a show at the Curran, around 4pm, and were their only customers.  Somehow we picked the only table without napkins and chopsticks, and even after ordering drinks and edamame (warm and salted, pretty good, $3) we had to get up to get some off a neighboring table.  I am normally not annoyed at that, but since we were the only ones there, that bugged me.\n\nThis place is quite pricey, but what do you expect?  It's the city, and it's right by Chinatown.  \n\nWe ordered a spider roll and a rock n roll roll.  Both were excellent.  Fresh, warm, delicious, yum yum yum.\n\nI ordered some hot tea and was served the most perfect green tea I have ever tasted in my entire life.  The waitress showed me that it's brewed in a true tea pot, with...ok, I don't know what with, I'm just a white girl, but there was a little filtered bowl inside the pot filled with more than just tea leaves.  I need to learn how to make tea like that.  I could drink it all day, every day.\n\nI also ordered a glass of Riesling and it was sweet and fruity, just how I like it.  My husband thoroughly enjoyed his beer as well (I forget what he specifically ordered.\n\nOverall, good place to stop for some very high quality sushi and some not so high quality service.", "author": "Rachael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "This little restaurant is a gem! The cherry blossum sushi was so tasty, I'd have to say the best I have ever tasted. Great service. Reasonably priced. It's safe to say that I cannot find a fault with Mikaku.", "author": "Kirsty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "Come on Yelpers!! This place and the service ain't that bad at all. I went there with some friends on sunday night. Our server was friendly the service was good. He gave us a table by the window that overlooked grant street. We ordered a few rolls to try like the Grant ( which the server suggested), spicy scallop and spicy tuna rolls- they were overwhelmed with sauces but overall good. The guys had the bento boxes it was good value for around $18. The bento boxes came with a lot of food including the main entree, some tempura, a california roll, salad and a miso soup. I had Nabeyaki Udon it turned out to be a very nice dish with a good stock, some vegetable and shrimp tempura on the side, it was more than fulfilling for me. Everyone enjoyed their food and our highly efficient service, even in the midst of a busy night.", "author": "Lola J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Solid sushi restaurant. Fresh tuna was delicious (from the specials menu)! Goyza was good and the baked scallop was also good. Double shrimp was decent. Short review but read my adjectives. I would go again and order everything the same except the shrimp because I thought it was flavorless.", "author": "Steven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "Great sushi...nice place. Sit at the bar so you can watch them make your sushi rolls.", "author": "Cristina P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-14", "description": "I must have caught them on an off-day.  I found the sushi portions to be small, the cut of the maguro to include a little bit of that stringy toughness, and the rice to be a bit dry.  The decor is no-frills, and the restrooms so-so.  However the service was friendly and prompt.  I may try this another time before I really make up my mind.\n\nTimes visited: 1", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "Wanted to try out new ownership for awhile. I was not disappointed. Several things changed for better or for worse:\n\n* Decor of the place changed drastically. New owners gave the restaurant a face lift, literally. Ceilings have been raised, new light fixtures, new paint, new furniture, new art work. New Mikaku does not look anything like old Mikaku. This appeals to many patrons.\n\n* Prices have gone up. Understandably. Have to recoup capital expenditures.\n\n* Portions decreased. See point above.\n\n* Surprisingly, food tastes as good as with previous owners. And that's why I will come back. \n\nVery convinient location on the same block with Sutter-Stockton garage. Walk here or come by car and pay $3 for 2 hours in the garage. Usually, $3 will buy you about 25 minutes if parking at the meter on the street.", "author": "Tatyana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "What a FIND!  Notably a best kept secret located smack in front of china town's green gates (what's that thing called anyway?).\n\nSushi as this o schooler likes it, white aromatic rice, fatty/toro- grade fish perfectly balanced with some garnish but not over-the-top fancy.  Just clean, delicious and reasonably priced.  The steamed egg and chicken over rice is aaaaaahhhh.....  a comfort food lover's dream.  Gotta go back to try their soup.\n\nHappy Hour, woo hoo.\n\nTop 40 plays in the background, friendly smiling service, open LATE, safer street for group of gals to hang out late.", "author": "Surai J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-18", "description": "There sure are slim pickings for lunch selections Downtown. I like Mikaku for sashimi and they are reasonably priced. The lack of stars is due to incredibly slow service (every single time!) and the rest of their food. \n\nTheir lunch combo is okay but please do not get the Chicken Donburi. It was a bunch of fatty, scary-looking chicken with rice.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "A night out in San Fran could begin with a pregame here, especially if you're rolling out with a lot of people. Prices are reasonable, food is decent, and the place is not at all crowded after 8 PM. Mikaku's owner (Jin?) was really hospitable - some of the guys we went with were regulars - and brought us complimentary garlic fries, soju shots, and cheesecake for the birthday girl. We did sake bombs and generally acted obnoxious. I think the girls next to us hated us. :) Basically, you can get halfway to wasted here before even hitting a single bar. \n\nThe food was nothing spectacular. I personally wouldn't take someone here on a date because I didn't find anything to be particularly special, but the prices are very good ($5 - $10 per appetizer, $10 - $15 per roll). I shared a tonkotsu appetizer with the birthday girl that was alright. She also ordered two baked rolls that I liked and would recommend. I think one of them was called the china doll?", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "We went there with a group of 6 for work lunch. We had a reservation and were seated right away. It was pretty empty when we got there a little before noon but it was pretty much full when we left an hour later. The food was good and fast, the waitress was very nice and attentive. We had the tempura and dumpling appetizers and I had the roll combo for lunch. It was three types of rolls, salad and miso soup. I am by no means an expert on sushi but I liked everything", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "Really nice owner who waits on me personally.\n\nI love when the sushi chef yells out 'NEW CUSTOMER!\"...", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-09", "description": "OK, my last review got removed.\nSo, I'll make it short this time.\nOwner Changed! Everything Changed!\n100% Chinese now!\nIt is under new management.\n\nPlease see the date of Toro E's review. 1/05/2007.\n3 years ago! And using the same photos he took.\nThat's BS!\nBad Sushi here!\n\nI DO NOT RECOMMEND THE PLACE, PERIOD!", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "If you're working late then you want something tasty that won't bloat you to the max. For me, that's always sushi and I'll usually get delivery to the office. Today, however, I decided to roam about and give takeout a try.\n\nFrom Mikaku I got some basic sushi:\n- Maguro nigiri\n- Tekka maki\n- Salmon skin hand roll\n\nThe chef made it quickly, the fish was fresh and price was reasonable. I can't complain, and I was actually pretty happy. I'll probably come back again, thanks Mikaku!", "author": "Ayumi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "Im not a yelper, but when I go to a place enough (such as this one) I have to jump on and give a review.  All I have to say is....super fresh, great deal, great service.  The sign outside said \"wild caught japanese hamachi\", my favorite, so I had to jump it.  After 8 pieces of amazing hamachi and 2 super fresh scallop hands rolls, this place is now 3 for 3 on my lunch visits.  I cant wait to visit for dinner, as this is my top 3 places in the bay area to eat sushi.  See you soon!", "author": "chris p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-09", "description": "After posting my review, I received a message (as others have, apparently) from the owner's daughter, \"colette p.\"  This was her message: \n\"ay b*tch dont be talking sh*t about my moms restaurant. ima f*ck your a** up if u come back and f*ck up ur son. u better be cool. who the f*ck are u to talk sh*t? do u waitress? do u know how hard it is to do so? b*tch you playing. dont step into my familys restaurant again before i f*ck both you up.\"\n\nInteresting approach to a business.  And in response to your question, colette, Yes, I do know how hard it is to waitress.  I did it for 4 years to help put myself through college.  And trust me - I won't bother stepping into your family's restaurant again.", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-19", "description": "My boyfriend and I came here for some sushi and it was pretty good. More points for prompt service and no waiting! The China Gate Roll is good (and spicy!)", "author": "Jacie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "Great service.  However, I've had better sushi.  In addition, this place does not have misago (what kind of sushi restaurant doesn't have misago?).  If you're looking for a place to go for a quick happy hour bite, this is your place.  If you're looking for a great-tasting full sushi meal, it's probably not your best bet.", "author": "Virginia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-09", "description": "There is a tiny cockroach in the sake, after I told the waiter, he is like. \"Oh, that is just a fly.\" WTF?! Does it make it ok to have a fly in the sake as long as it's not a cockroach?!", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-11", "description": "The absolute worst place I have eaten, and when I say the worse I am not talking about just sushi restaurants, literally the worst restaurant I have ever eaten in my life! \n\nI went there today (and yes you nasty waitress I hope you remember me from lunch!!!!) and I understand it's busy, got it, but why would you give me and my friend our hot sake and then take another freakin 10 minutes to big the beer? And I kept asking her where our drinks were, she would smile say yes, and still not bring them over!!! \n\nNo big deal there's no way I'd bother to take the time to yelp if this was the biggest deal.... the problem was how horrific my lunch was. I ordered the chef's choice sushi, and i almost started to laugh when they brought it to me. Ten dollars for 4 pieces off sushi and a shrimp... OK I still wouldn't have bothered to take my time to yelp... It looked like a four year old took out his play scissors and made a brave attempt to cut the fish. The fish was jagged and see through, one piece was kinda cut in half... \n\nI got the waitress and asked for the menu so i could order something else because it was so bad, she smiled blankly brought the menu didn't ask what the problem was and I would have ordered something else if it hadn't taken ten more minutes to come back to me!!! \n\nThen the same deal at the end couldn't get the change back from the bill, no one asked me about my meal even though half the sushi was on my plate (OK so there were only 4 pieces to start with) ugh... The place blows...", "author": "patti k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "This is one place I will not forget.  The freshness is key and they nailed it that day.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-20", "description": "Came in an off hour, so restaurant was empty. It's conveniently located near Union Square. Sushi is OK. Not great, not bad. Fish is fresh, so cant complaint. Cucumber ring roll was interesting and very spice, just the way I like it. \n\nBut... The music was kinda weird, for a sushi place at least. Enya like songs, which accompanied by my beer on a rainy Sunday evening, were nearly putting me to sleep! Until of course I would take a bite a spicy piece of sushi!! Repeat: sushi very spicy!! \n\nIf you are nearby, you can try. But not sure if it's worth driving just to come here.", "author": "Michel A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-16", "description": "Literally the worst Japanese food I've ever had. Fish isn't fresh, actually slightly bitter. Sushi rice is so rare.", "author": "Kris Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "Very good sushi and great service, but the portions were not worth the price. Other than that it was a meal well enjoyed when I was having an outing with my roomie.", "author": "Joji V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "These guys are great! Really good sushi and Japanese beers that are ice cold! Friendly smiles and great staff make for a nice and refreshing environment for a nice lunch.", "author": "Nathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-22", "description": "I love Sushi and constantly try out new places. This place was great.\nIn terms of the Fish itself. It was perfect. Every single piece of Nigiri, Sashimi, and the roll was perfect except for one. The salmon was an 8.5 out of 10. The rest were 10s. The Edemame was served warm with salt. Perfect. The Korean Nigori Sake was bad, but that's not their fault. The waitress should know better to shake the Sake, open it, and pour it. She didn't do any of that, but the Sushi Chef saw this, came by and did it for us. The decor and environment was very nice, and clean. The Price was totally reasonable. If I could give this place four and half stars, deducting for some minor service issues, I would but since it's really about the fish, it was great.", "author": "Gilbert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "My friends and I stumbled accross this Sushi place as we were looking for another one. We decided we were too hungry to keep looking for the other place so we decided to try this one. We were so glad we did. We had the best dining experience. \n\nWe had a great waitress that was very knowledgable about Sake and she helped us pick out some really great Sake. \n\nThe food was really great. I has some fantastic Sushi rolls that I can't remember the name of now, sorry. I remember one had baked Salmon on it, yum, that one was so good. \n\nThe music playing was a compilation of hits from the 90's. We had the best time trying to remember the artist name and just reminiscing about the music. It was seriously the best playlist ever!\n\nI can't wait to go back!", "author": "Stephanie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "I came here for lunch with my grandmother and my sister and we all  LOVED it.\n\nWe ordered soft shell crab, hamachi sashimi, uni sushi, rainbow roll, and the nuclear cruncy roll and were impressed by the quality of all the fish. Everything was really fresh and the presentation was wonderful.\n\nThe staff here were very nice and very attentive. My sister took awhile to decide what to order but they were very patient with us. And they came back every once in a while to make sure we were enjoying our food and if we needed anything else.\n\nI though that this place being in downtown would be difficult to get parking, but there was a parking garage right around the corner, and the pricing was not bad.\n\nI definitely recommend this restaurant, the have really good quality sashimi and sushi.", "author": "Alicia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Happy hour rolls!   Sure, the selection isn't fabulous, but I have simple tastes - tuna roll, salmon avocado roll.  The fish is fresh.  I wouldn't pay non-happy hour prices, but it's a great dinner stop on the way home.", "author": "Sona P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-15", "description": "Delicious!! I had the china wall roll and it was amazing! Happy hour beer for $2. Our waiter didn't seem to like his job much but other than that it was a great experience. I would eat here again and recommend it to others.", "author": "Chantill S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-27", "description": "Lots of different rolls with unique flavors. Felt a bit ripped off with the edamame, it was only half a bowl. I thought they trying to prank me.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-01", "description": "Been here for lunch after a work out on a weekend...not bad. Cute little interior. Ok service and good sushi rolls. \nIt is in U.Sq.. right next to Lulu Lemon, ha! bonus!=)..makes the food taste better...j/k/.\nThey were playing some good R&B tunes, a little old school-ish but yea hit the spot!\nI dont have anything else to say about this place. I dont think i will go back, it was ok but nothing different or special.", "author": "C A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "This is becoming a standard post-happy hour drunken sushi place (as if there were any other kinds). The prices are a little high, but nothing absurd -- and hot house sake remains a good deal. I usually go with some sort of sashimi and haven't been disappointed.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Great food and friendly staff! Sit at the bar and the sushi chef might treat you to some free sake or fish! He's awesome and hilarious. I would definitely come here again.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-05", "description": "DIRTY and RUDE STAFF ... I just left this restaurant five minutes ago without having my dinner. The waiter gave me a menu as I sat at the table. There were rice pieces sticking in menu!! How GROSS is that !! I did not make a big deal and grabed another menu from the table next to me. \n\nThen, I ordered a house salad with my food and there was HAIR in it. I told the waiter, he took the plate and without saying anything brought me a new one. He did not ask me whether I wanted another salad or anything else. He brought another salad and I told him that I don't want another one any more. Then he SMASHED the salad plates and left my table without saying anything!! Seriously ?!? \n\nWORST SERVICE EVER!! No surprise they have only three tables full on a Friday night.", "author": "Gonca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "I really like this sushi place. I have been here several times for lunch when\nI am working at the SF Chamber of Commerce. This is a great location right down from China town which is nice to walk down the streets after you eat. I ordered the salmon sashimi which was fresh but wasn't enough so I ordered a philly roll also. The staff was polite and helpful. I will be back\nnext week when I get back from So-cal.There is a place in Anaheim called Tokyo Love that reminded me of this place. Good Sushi.", "author": "Tommy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "Visiting SF for the first time, found this great sushi place down the block from out hotel. Great service, great happy hour, great atmosphere. Will definitely come back when I'm here again :)", "author": "Tay J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "This has got to be the sexiest Japanese restaurant in the city. The first time I came here, they played non-stop nineties R&B sex music (seriously, for two straight hours at least). My friend and I were dining after happy hour and so we had a good buzz going and were cracking up the whole time singing along to all the songs we remembered from the nineties. It was actually a very fun dining experience. The second time I came here, they played more contemporary pop music so the amusement wore off but the food was just as good if not better than the first time. Love it here.\n\nHighly recommended: Nabeyaki udon and sake baby!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-30", "description": "My husband and I sit at the sushi bar and the chef let us know that he was too tired to do much so we should probably order teriyaki chicken or something else from the kitchen. Lame.", "author": "Nori S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-02", "description": "pretty good sushi and udon. You should come at happy hours 5-7pm, great menu", "author": "Suabot J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "I would write more, but I am enjoying the warm food coma.\n\nThe normal menu is good, but if you get things labeled special #2, etc, that are not on the menu they are spectacular!\n\nAnd the price for that much fish, of that quality, in that incredible a roll, best deal on sushi I've had in at least a year.", "author": "Boris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "Had a great meal last night with a few friends.  There are a lot of great sushi restaurants in the city, but Mikaku is one of the standouts.  Small plates were very well done.  We had agedashi tofu, goma ae, oshinko, and chicken karaage.  Prob the best karaage I've had in the city.  \n\nNext we had hamachi kama.  One of my favorites and a good yardstick for quality of a restaurant.  It was the biggest I've seen and cooked perfectly. mmmm....\n\nNigiri was very fresh.  some standouts included escolar, toro, uni, and the sabe.  Prices for the fish are pretty standard for high quality pieces.  Prices for beer are better than most and sake pretty standard.  Mikaku has a very good sake selection and the owner was able to teach us a few things about sake and recommended some killer selections.\n\nService was very good from server to owner to sushi chef.  Didn't sit at the sushi bar but would like to next time as the chef was super nice and entertaining as well.    Will definitely go back for another round.", "author": "Christopher Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-02", "description": "I know it's happy hour and things are a bit cheaper... but it really doesn't mean you can get away with serving up crumbling fish scraps. The spicy tuna roll was barely edible. Would not recommend it unless it's happy hour and you are absolutely starving", "author": "Danni W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-25", "description": "For the price it was just okay.  They were kind of going for a minimalist thing, which is pretty cool, but the whole place has rather tepid vibes somewhere between business person and asian buffet.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "Last Fall my husband discovered this place. By the time we went to check it out, it was closed for renos. Kinda wished that I had gone before the renos and had written a bad review so someone could call me a \"b*tch a*s sucka muthaf*cka\", for some reason I find it highly amusing...\n\nAnyhoos, I walk by this resto everyday on my way home. The new $5.50 lunch menu ads caught my eye so I finally stopped by. My lunch was a-Ok, nothing to write home about and certainly nothing that would cause one to be cussed out (damn!). The unagidon was alright. The spicy tuna was alright. The waiter offered me tea or water while I waited for my to go order - which I thought was cool. I waited about 10 mins for my order. It was nicely packed. All the other customers looked content - I don't think they'll get cussed out either (damn!).\n\nI'd go back for lunch.", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "While spending the weekend in SF, we decided to check out Mikaku for dinner on a Sat night. We made an 8pm reservation and were sat right away. Our server was great, offering suggestions on his favorite rolls since we were undecided on what to order. I wish I could remember the names of them, but all 4 that we ordered were delicious and fresh. We were very impressed how fast they came out. Our only minor disappointment was the edamame- somewhat dry and not salted... But the sushi rolls more than made up for it. Great food, nice atmosphere and friendly service. We would definitely go back again.", "author": "Stefanie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "Good Enough Sushi. Probably ate here more than any sushi place in the city. Not because it's the best, but because it stays open later and is reasonably tasty. Rolls are not too fancy. Stay away from salmon. Veggie rolls are good, like the caterpillar. They lack a good bento box option, but you can go elsewhere for that. Easy to get a seat at any time. Reasonable price. Only real gripe is not being treated like royalty even though I've been there more than enough times to be crowned king of any social network check-in. Where's my free appetizer??? :)", "author": "Steve T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Sushi and service were excellent. They offer unique options plus excellent expected options, and they do not skimp on the quality of their fish. Also, reservations were not a necessity, which was an added bonus in SF on a Friday evening.", "author": "Becca M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-11", "description": "Wow. Happened to stand by the bar while waiting for a table and saw the guy drop a piece of fish on the floor and pick it up and put it right back in the cooler! Never thought it could get this bad :-) They got defensive when I confronted. Thankfully I hadn't ordered. Super Health hazard.", "author": "Karthick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "Great happy hours. Delicious crunchy California roll. Best priced sushi around and tastes pretty good!", "author": "Finn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-04", "description": "I happen to stop by here a few weeksd ago on my first Saturday in the City. First of all the service and the music were great. The happy hour is amazing, half off all drinks!!! \n\nThe food was great and the waitress had grat recommendations. I recommend if you are looking for great food, great service and amazing happy hour this is the place to be.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-14", "description": "The sushi fish is not fresh, and the rice is hardened... and it's pretty expensive. The waitress never refilled my water glass. Not worth it at all", "author": "Shawn G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-22", "description": "present - goodbye old mikaku?...hello happy hour?...poor service?...poor food?....flabbergasted...\n\n4/22/07 - mikaku..situated center block isn't shy to boast attention...flappin' curtained \"mikaku\" awnin'..free standing signs displaying mikaku's offerings to patrons..... reminisce of small alleyway restaurants in asia....for it's a small-scale aged establishment..friendly..family like atmosphere....equally homemade feel to the delectable plates focusin' on flavor and pairing...balanced taste 'n' textures..\n\ncrispy..lightly battered asian pumpkin paired with sea salt...salt brings out the true sweetness...intensifying...enrich the true pumpkin taste....grilled duck with even textures of fat and poultry...warm..moist and meaty balance with simple salt to highlight the duck.....vinegary cold snapper fish....coldness lessens any \"fishy\" taste while keeping the delicate fish to al dente...enjoyable....warm simmered octopus with daikon..mixes the soft sweet gentle texture of the braised daikon with the chewy tougher texture of the octopus....harmony...each offerings delectable and different...keeping the palate entertained...\n\nwhiteboard menu appears to be the wise choice....sampling each item...great meal....from crispy fried battered oysters and crispy yet chewy yam cakes to thinly sliced sashimi platter and homemade soba noodles....beyond with sesame spinach to braised fatty pork with horseradish/mustard....mikaku didn't disappoint......drinkin' the night away with over 3 liters of sake....turned the dinner into a social conversin' evening with some honorable company...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "Seems to be a staple on my way back to the East Bay. Decent food,sake bombers, and friendly staff. Too many tourists perhaps but it is Union Square I suppose.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-28", "description": "Lunch: Mikaku's $13.50 deluxe chirashi is unbeatable in taste for the price.  Chirashi is sashimi on top of sushi rice (chef makes it on sour-side! yipee! please, there is no such thing as sweet sushi rice): red snapper, squid, maguro, hamachi, maguro, tamago (homemade), salmon and saba.  Mikaku sprinkles shredded cucumber on top of rice, underneath sashimi, which adds a fresh flavor.  This is my lunch time staple.  Oh!  By the way, if you are the first 10 customers (i.e., get there before 11:45am) you get California rolls.  Chirashi always accompanied with little starter dish and miso soup. \n\nDinner: Mikaku makes handpulled soba noodles.  It's good.  When you go here for dinner, just order off the dinner only white board menu by the sushi bar.  You can only get it at dinner time.  They won't budge about serving it at lunch.  Its actually a great jedi mind trick because whenever I have dinner at Mikaku and eat the stuff on the white board, I feel super lucky.  Loved the fried konnyaku, kabocha and duck.  \n\nBY THE WAY, though Mikaku is listed under \"Nob Hill,\" its just one block West and one block North from the Crocker Galleria.  Totally accessible to all FiDi workers.\n\nOwner/Chef Ito-san is cool.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "ok, before i stumbled across this place i ate all over union square as i am a sashimi fan.  I ate at Tsunami, Akiko's Sakana and Wayo, but I found their fish good, but pricy.  I am not a snob or a penny pincher, but if I can find a place with real good sushi, at a good price I am all for it.  \nThere is no REAL need to find a place with cool lighting, or a fancy decor.  As one person once told me, \"sushi is fish and you can't get fresher than fresh so pick a place with a good price and good fish.\"", "author": "Jai D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-03", "description": "I've gone in here before for a typical \"sushi day\"...\n\nToday, I made the GRAVE mistake or ordering what I would consider as my \"usual Japanese lunch\"...\n\nI ordered prawn tempura, rice, and gyoza...cost me $24.  It's double what I normally pay at my preferred spot!  I'm ok spending paying more for quality, but unfortunately...the prawns (if you can call it that) are so tiny, you'd think that they used the same shrimp that restaurants use for their shrimp cocktail.  The Gyoza...ergh.  For half the price, go to Niji at Crocker Galleria instead!", "author": "Morez G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-11", "description": "If you're craving sushi in Union Square, Mikaku is a nice place to come across. During the weekdays, it's a busy lunch crowd. Service is efficient and the staff are friendly. You can be in and out pretty quickly, or linger.\n\nThe bento options are pretty solid and for the quality of fish, I'd say a pretty good deal. Or try one of their combos like I did yesterday - spicy tuna roll and tempura - for about $10. \n\nI wasn't wowed by Mikaku but hope to go back for a full-out sushi session. For a quick lunch or perhaps if you're visiting SF and our staying nearby, Mikaku is a good bet in the area.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-06", "description": "Pretty busy place on a Thursday evening. But warm ambiance and homey service. They serve sake and let you choose from a basket of different styles and shapes of sake cups-- a bit unusual.\n\nAssorted sashimi was pretty good-- soft, light and not the too shiny slimy kind-- I like. Wakame soba was simple. Warm house sake was a bit stronger than what I normally have, almost made me feel tipsy-- or I was just drinking on an empty stomach at 9pm.\n\nThis is a good local joint without the unnecessary glamour and gives you a comfy and fuzzy feeling with B+ food. And the price was pretty inexpensive too.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-25", "description": "I made the mistake of taking the in-laws here after a bout of post-Thanksgiving Christmas shopping. The place appears to be run by one waitress (for about 45 patrons), and one sushi chef. Let's just say the whole process took more than a few hours. It took about 20 minutes just to get a sushi menu. Then another 15 minutes to get water. The wait goes on...\nOf course, I expected after all of the wait (and it's not budget-priced), to be impressed with the quality of the sushi. Sadly, this was not the case. I have never seen such skimpy portions of flaccid refrigerated stale sushi in my life. Even Safeway does it better. Save yourself the money, and go to Safeway. \nThis is the classic case of a place staying in business because of touristy foot traffic (right next to the gates of Chinatown), where it would have ceased to exist long ago if it were anywhere else.", "author": "Stephen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-08", "description": "Service was untimely and unprofessional. Sushi subpar. Quality of fish also inferior (not rancid, just didn't have the sushi grade flavor). Most rolls were uncreative; we ordered the few creative ones on the menu and were severely disappointed with the execution. (i.e. tuna special started w/ a rather flavorless tuna & heavy fish texture and finished w/ a thick wad of cream cheese. Spicy scallop had huge mounds of scallop pieces drowned in about 4oz of a \"spicy\" mayo w/ no kick, just an aftertaste reminiscent of an expired dried spice cabinet.)\n\nWill not return and would not recommend. (The only two sushi restaurants I tried in San Fran on my recent trip bombed.  We did find a great one in Sausalito called Sushi Ran.)", "author": "Rebekah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-09", "description": "I have had many good meals here but tonight the service was awful. Dirty plates piled up, could not get a server. Place only half full. Fish is fresh and well prepared. Would like to give more stars but service is an important part of the experience.", "author": "Mitch M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "Very authentic reasonably priced Japanese food. Ordered the lunch Chirashi for $11 bucks and really filled me up. The big perk about this place is that they advertise no MSG which is rare for any Asian restaurant.\n\nDon't come here to order rolls or expecting that there will be any selection of rolls what-so-ever! Come here only if you want to eat nigiri or sashimi. My preggo sis ordered a bento box b/c she's preggo and from what I saw had a nice variety of small dishes. The noodle salad was a nice unique touch. \n\nCompared to the busy city atmosphere the inside was a different more relaxing family-owned atmosphere. Come here if you want a  real portion of nigiri rice (shari), not the fat-boy portion they give you at buffets to make you fuller faster.", "author": "becky s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-10", "description": "Japanese sake/sushi bar\nBetween Union Square and Chinatown\nNice setting, not fancy.\nMiso soup was hot and good.\nLunches were bento boxes with one or two entrees (plus salad, pickled ginger, and white rice). Teriyaki chicken had a lighter, but tasty sauce (less ajinimoto). Tempura was good. Sashimi was very good. \nSuper green tea ice cream\nNice selection of sakes. Have a happy hour.\nService needs a little work e.g., the timing of serving all the dishes at the proper times\nClean bathroom", "author": "Rosquete B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "Craving sushi and some sake bombs, myself and 4 girlfriends stumbled upon this joint late Saturday night. \n\nPosted outside was happy hour 10-midnight. Perfect! Upon entrance, the place was rocking some ke$ha and we were greeted by friendly waitstaff excited for some patrons. \n\n$2 sake bombs! Our waitress and the entire staff joined in our excitement, chanting with us as chopsticks and beer spewed in all directions. Within seconds, several waitresses rushed to clean up the mess and provide the next round. \n\nThe sushi itself was very good and with reasonable prices. We ordered a slew of rolls- honorable mention goes to the sweet potato roll. Sweet potato tempura rolled in ricey goodness dipped in eel sauce = delish.\n\nNatasha the owner was the reason we would come back. She brought us a bottle of sake on the house and even joined in our fun, schooling all of us in chugging down the beer. \n\nNot sure what all these other reviews are about but my girls and I had a fantastic experience!", "author": "Jesse L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-12", "description": "Though not fancy to look at, Mikaku's generic sushi bar decor belies the unusual attention to detail apparent in the food.\r\n\r\nAt Mikaku everyday  menu items are elevated by the quality of the ingredients, and the well balanced seasoning.\r\n\r\nI go at lunch for the thoughfully prepared Chirashi, and the bento is always a delicious option.\r\n\r\n- Sushi Geek Notes _\r\n\r\nTraditionally, the 4 markers to judge a sushi bar by are rice, tamago, mackerel and the way the eel is sauced.\r\n\r\nMikaku has very good rice, well seasoned, and correct in temperature and Tamago  that is neither too sweet nor too firm. The eel and house cured mackerel are both very good.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-04", "description": "Otherwise forgettable, is Yelp-worthy (at least by moi) soley as a decent stand-by considering the dearth of reasonable sit-down lunch options in FiDi.\n\nWhen you want more than a sandwich or takeout but don't want to shell out $25-$30 for lunch (what am I, made of money?) - Mikaku will do. Nothing spectacular, just your standard teriyaki-donburi-tempura & sushi offerings executed fairly well...like I said, pickings are slim in the area, so I'll probably be back. \n\nIt's all relative...", "author": "Kathy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-04", "description": "Placed an order to go for vegetarian rolls and ended up with all fish rolls. The guy taking the order was pretty much out of it. They don't seem like the most focused bunch of guys there. I would check your order before you leave.", "author": "Patty Boy X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-28", "description": "I got takeout for lunch here this past week.\n\nSushi quality was pretty atrocious. Nigiris were stale and flaking apart and the rolls were done poorly. To top it off, they dont give you the soup part of the lunch combo to go because they \"dont have to-go soup containers\". Really? Even though I paid for it? What gives?!\n\nIf you're in the mood for sushi, skip this place and go to Akiko's Sushi around the corner.", "author": "Didi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "This is a vegetarian review.  I have no idea what the \"real\" sushi is like.\n\nFantastic selection of vegetarian sushi, and everything tasted fresh and delicious!  It was also one of the cheapest lunches I've had in the financial district.  And it wasn't too crowded, yay!", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-26", "description": "Not spectacular sushi, but speedy, friendly service.  Prices are super-reasonable, and the tea has this unique, smoky flavor to it.  They even threw in complimentary California rolls for being there early.  \n\nWe went here because Akiko's (on Bush) was closed.  *sigh*", "author": "Evan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-09", "description": "I haven't had the sushi, so this review is not based on that. It was a cold day when my friend and I were shopping. She mentioned that we should go to this place since it was reasonably priced and the food was decent. We had an avocado roll, which was generic, followed by an appetizer of the tempura, and two bowls of udon. Firstly, the tempura was absolutely terrible, but then again, I only ate the shrimp part. The batter was absolutely disgusting, but not as bad as the shrimp which was chewy and flavorless. The soup was steaming but it lacked everything else.\n\nWhat was most disappointing was the lack of service. There were at four or five tables. One or two waitresses. And it took forever for the food, the refill of water, making sure the meal was okay.\n\nI'd rather go to Sushi Rika down the street. At least, they give you a ton of stuff in your soup and makes you feel satisfied. \n\nThe only plus point is this: the prices are very reasonable for Japanese food. The soup was at least $2.00 less. Too bad it's just mediocre and boring!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-02", "description": "My roommate and I were just kicking around on Halloween day. Both of us wanted some decent sushi but didn' t want to walk all the way back to Sakana which is usually our default sushi place around union square. Walking by Mikaku, we had memory of the previous Japanese restaurant which was only a so-so place and we were contemplating whether we should go in. After looking around and the menu for a while (it's kinda quiet inside), we decided to take the risk and give it a try.\n\nIt turns out to be a good surprise. The atmosphere is fun and warm. Everyone were dressing up for Halloween, even the chef.  The Japanese lady, Natasha, gave us 2 bottles of free sake after we talked about how hard it is to find good fresh uni. At the end, she convinced me to order some uni and we ordered 2 orders! She also gave us some ikura to try but I am really not a big fan of it so couldn't up sell us with this one :D\n\nNow we have another place to have some fresh decent sushi around downtown.", "author": "Hinling Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-29", "description": "Everything was okay. Ate here for lunch 4/29/11.  It was only my co-worker and I, we got seated right away.  Water was put on the table promptly.  Ordered the 2 item lunch bento, the Tonkasu and Teriyaki Beef.  The Tonkasu was good but small 5 piece portion.  The Teriyaki Beef was good!  The portion size on the beef was better.  I wasn't really full after the meal.  The meal cost $10.50 or so.  Co-worker also had the 2 item lunch bento he got Teriyaki Chicken and California rolls.  The chicken and the rice was dry.  He wasn't satisfied at all with the food.  Not somewhere I would come back to again.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-30", "description": "Went here on a cold SF night for some Udon noodles and it hit the spot. The serving was so large that I had plenty for lunch the next day. Can't complain about the service since we had a nice server. For being in such a touristy area, Mikaku is a surprisingly good place. I would come back here to try the sushi.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-15", "description": "I am feeling under the weather, so a hot bowl of Udon soup sounded in order. Silly me, I didn't look up a good place before lunch. So I stumbled on this place... \n\nI wanted to get an avo-kappa maki and miso soup but they said it would be 20 minutes, so I went with the original idea of udon soup. Fine. It comes with veggie tempura, normally a good thing. \n\nI drink my green tea and eat the cold noodles with mayo (blech) whatching the single sushi chef work. The fish didn't look delicious or particularly well stored. Everything had a old world sanitation feel to it. He was still fun to watch. And everyone around me seemed to be enjoying their sushi. \n\nMy soup came. It smelled like sheep poop. I'm serious! Somehow the blend of fish broth and buckwheat = sheep poop. I grew up around them... I'm not making it up. Luckily once I sprinkled on a generous portion of nanami togarashi, my nose got stuffed and I couldn't really smell anymore. The flavor was good, the noodles a bit over done. \n\nUnfortunately the tempura was only warm and soggy, so I didn't really eat much of it. They didn't provide any dipping sauce, so I just dipped it in the soup, which made my soup kinda greasy. I ate all the broth but had to forgo most of the noodles. \n\nNot a good experience. I'd give them another shot based on other reviews. I'll keep you updated. \n\nPS this was my horoscope today: Don't be so impulsive today, for your quick response is not likely to be your best. Remember, your intuition might be a bit off, so instead of trusting your feelings, keep coming back to the facts. Take enough time to think about the consequences of your actions before you do anything that could land you in trouble.", "author": "Elsa E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-13", "description": "bottom line: slow service, tasty and light food.\n\nwe came here to grab a quick bite late at night and didn't really feel like sushi, so we opted for the chicken donburi.  the chicken and sauce were surprisingly tasty, yet not too heavy.  the order also came with miso soup and salad, a nice bonus.  obviously can't speak for the sushi, but would be open to ordering donburi again.  restaurant is a bit packed and service was fairly slow.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-10", "description": "This was one of those places where I scratched my head... What to write? 2 dishes shined, 3 dishes were just OK, and one dish was so bad that between the three of us we were trying to pawn it off on each other. We couldn't even tell what it was-- the waitress had forgotten one of the orders, so we were confused over what came out versus what we were still waiting on.\n\nReally good:\n- fried, salted pumpkin\n- braised soy sauce pork\n\nOK:\n- noodles\n- including the house-made soba... a little harder and less chewy-toothy-smooth than I would have liked.  (Maybe house-made yesterday??)\n\nBad:\n- yam cake sashimi. Maybe I don't know enough about Japanese cuisine beyond noodles and sushi to get it, but this had a weird texture (think jellyfish without the fishiness) and was generally flavorless. What's the point?\n\nA bit pricey considering the quality of the food. Within that proximity, I way prefer Sanraku just a couple blocks away...", "author": "Amy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-12", "description": "1 star for great happy hour prices, 1 star for yummy goyza. Not the freshest rolls in town, but if your in need of a quick sushi fix just beware of the imitation crab.", "author": "Mallory M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "I held off on writing a review on this place for a couple of reasons: 1. The food has not always been good here; 2. But it is the one place I can down some sake and walk home after...  I find myself in a strange position...  Do I write a bad review on a place I will continue to show my face at...  or do I write a good review when I only like the food there half of the times...?  \n\nLast night, after an outstanding meal at the sushi bar (I normally take a table), I think Mikaku has redeemed itself...  I am now writing a review on this place with much understanding and appreciation.\n\nMy relationship with this place started out of convenience.  Based on the sashimi that came with my lunch/dinner bento, I had been very reluctant to order any real sushi items.  However, many of their Japanese dishes, such as tofu in hot broth, homemade soba, salt duck, and other Japanese \"diner\" food have always been very good.  The special board will tell you: Clams in Sake, Creamy Daikon Soup... etc.  So I basically avoid sushi there.  \n\nThen last night I had this urgent need for some sushi.  I came here, and it was packed with Japanese businessmen.  I sat at the sushi bar and ordered what I could: Black Cod, White Tuna, Yellowtail and Amaebi.  I had my fingers crossed, hoping that by paying more the quality of the fish would be (much needed) better than the bento quality.  \n\nI was NOT disappointed.  In addition to the tasty fish, I noticed how well trained the chef was.  Very skilled, precise--- an old school chef who went through the whole tutelage beginning with rice washing  long before he was allowed to touch the fish.  I almost felt sad that as good as he was, he had to make those silly spicy tuna and California rolls. \n\nAfter a very satisfying meal, he asked me how the food was.  I said, \"Delicious,\" then added, \"you are a very good sushi chef.\"  Instead of a humble nod, he smiled proudly, as if giving me props for recognizing it.  I also suggested that I'd wish to see more seafood items, such as aji and scallops.  He shook his head and explained that he did do that in the past, but no one ordered it.  I turned my head and saw the Japanese businessmen who busied themselves away with the food...  Some of food items I had never seen before.  And I recalled that this place was constantly hit by the traffic of Japanese travelers...  At that moment I decided to make good rapport with this nice sushi chef.  I want what those Japanese men are eating.  With that said, Mikaku shall see me back very soon.", "author": "Jiajia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-03", "description": "For lunch, I ordered the Mikaku Special and was pleased with the generous portion of food, given the modest price.\n\nSaid food, however, was not very good.  From the overly salty miso soup to the chewy tempura, I wished my dining companion and I hadn't opted for Japanese.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-09", "description": "In response to the comment below, I was also part of the group of girls looking for some sushi on Saturday night.  \n\nHighlight of the night was the $2 sake bombs.  I think we had close to 6 each!  Food was great and the service was very prompt.  Definitely will be going back here again!!\n\nOh, and kudos to the sweet potato tempura roll!", "author": "Charlene B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "Amazing sashimi; fresh fish, large portions, reasonable prices, friendly chefs & servers. I have been here twice now, late. Love it!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-11", "description": "If you wanna talking about authentic Japanese restaurant, Mikaku is the place.  They have a lot of authentic dishes and the restaurant itself look authentic, too.\n\nI've been there several times.  I love chirashi.  They give you lots of fish, and they are all fresh.  And the sushi rice is just right.  Not too sour, not too sweet and not cold like they just took out from the refrigerator.  I can't stand sour sushi rice; the vinegar smell hit my nose.  And if the sushi rice is too cold, make me wanna go to the bathroom.  So, it's important that the quality of sushi rice for me.\n\nAnd you should check out the white board \"dinner time only\".  One of my favorites is homemade buckwheat noodle.  Very smooth, not like soba noodle from super markets.  And dip-in sauce is just amazing!!  Not too salty, not too sweet.  And they give you \"soba-yu\" afterwards which you suppose to pour in the dip-in sauce and drink it!  Wild, ha?  But it was good.\n\nThis place is not fancy or hip, but if you wanna have a real Japanese meal, you should go Mikaku.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-16", "description": "Quick service during lunch rush hour is always a plus. i was surprised - had the spicy tuna roll and tempura roll. spicy tuna was spicy but fresh - and it came with 12 pieces.\n\nmiso was a teeny bit odd though... really salty. i'd go back for sure :)", "author": "laura f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-25", "description": "Very ordinary restaurant with mediocre food and sub-par waitresses. Maybe my friends and I were just exhausted from a long day, but none of us thought this place stood out.\n\nI had the nagiri deluxe, so 12 different nagiris. Somewhat pricy for the quantity, and the fish didn't taste 100% fresh, but that isn't to say it wasn't decent. Also had the sake.\n\nWould I return? Probably not - there're plenty of alternatives in the city.\n\nTime: dinner\nFood: nagiri deluxe\nCost: $20/person after tax and tip", "author": "Jack W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "Me and my friend used to go here like i say 2x a week when it was under the older management. Things have shifted and definitely looks better now but i miss the food that was served before. So idk if im going to come back any time soon. Probably not anymore.", "author": "Nikka L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "I love how authentic this place is from the perspective of lots of Japanese folks eating there even though it's right in a weird spot kinda Union Square/Chinatown-ish and all.\n\nThe specials board is written in Japanese and Engrish although at lunch they didn't apply.  The udon I had was nice and tasty with a good stock and I went ahead and got a few pieces of nigiri too.  Not amazing, but then I didn't expect that here.  The fish was pretty good and decently priced, but I think this place specializes more in the traditional dishes.\n\nAnyhow, a nice spot for a quick lunch - I will have to check it out at dinner as well!", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "Wow....this place easily has the best sushi I have ever had....period!!\nI've been to a lot of sushi places and tried all kinds of sushis.  Yet another fusion style sushi place I love. I have been here a couple times. each time bringing different sets of friends. one set had a first time sushi eater who enjoyed their sushi. The other friend also agreed it was some of the best sushi they have ever had,\nThe second time I went I brought my friends from Hawaii (born and raised) and they were blown away. They could not believe the sushi was so good....and they are from Hawaii!! I was surprised to hear them say that considering Hawaii easily has the freshest fish and ingredients available in the US.\nEach time I have gone every roll was presented exceptionally well. I love it!!\nOh...they also serve you hot tea before the meal.\nFor desert we had mochi ice cream. we had all three flavors, strawberry, chocolate, and green tea. all were awesome.\nLike many other sushi places it is some what small. Very nice inside though with lots of wood furnishings.\nThey also have a happy hour that looks quite enticing :D\n\n#1 sushi restaurant!\n\nSaikoh!!\nsugoi!!", "author": "RAy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "The service was totally fast, efficient and friendly. And i know they use high grade fish as i can telll.  pricing was reasonable for being in dt are and food was just totally awesome! for its price, it deserve 5", "author": "chris l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-03", "description": "Food is OK, decor is nonexistant, tables are glued to one another. But it was a fun experience no big deal just lunch..until the check arrived...I am a foreigner and I went there with a friend of mine who shares the same language... We discovered speechless that they had written the tip on our check!!!!! as opposed to our neighbor who was American and who filled out the amount herself the way it should be (remember the tables are very close to one another it was not hard to eyeball her check). This is flat out DISCRIMINATION to assume I am an ignorant tourist because I don't speak English!!! when I have been living here for 9 years...\nI confronted the waitress who played dumb and was unapologetic. I will never go back there", "author": "Carpe D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-13", "description": "I went to this restaurant couple weeks ago, and had a very bad experience there as some of you might read it... today I have received a dirty message from colette p., I can see some of the previous reviewers did too... here is the message, \"ay bit*h dont be tlakign sh*t about my moms restaurant. better not step into her place again before i fu*k you up. she works hard to run the da*n place and if u dont own a da*n restaurant dont be even talkign sh*t if you dont even know wassup about how u run a da*n place. if i see you, you done with. bit*h a*s c*nt.\" Please expect to receive this kind of message if you had a bad experience in this restaurant and gave them a \"bad\" review.", "author": "Bee T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-07", "description": "slow service.\n\nthe gyoza from happy hour is probably the oiliest thing i've tasted in quite a while.\n\nthe quality of sashimi is very poor. and it is not cheap.\n\nreally dont have much good to say.", "author": "Danielle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-19", "description": "Best sushi I've ever had. Our server didnt have the best grasp on the English language, but she was very pleasant. Awesome place!", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "Lots of food at a great price. The sashimi is fresh, and the beef teriyaki is korean-style bbq beef. This is a pretty good deal for lunch in the fidi.", "author": "Celia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "This wonderful little restaurant is right outside Chinatown and a true gem. If you are adventurous I highly recommend getting the \"chef's special roll\" we got 2 of them and both were amazingly delicious. (I posted pictures) The roll sizes are decently large, and the fish was fresh and tasty. If you are a salmon fiend like I am, there is a salmon lovers roll that is fantastic. Sit at the sushi bar if you can the chef's really nice.", "author": "flitter k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-22", "description": "My friend and I went here for lunch and it was all right.  We both ordered the nabeyaki with soba and it was tasty.  I thought the service was nice and the food came out quite quickly.  There's a good crowd for lunch, but the place isn't worth waiting for a table...there's too many lunch options in the area.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "Delicious sushi! Great rolls! Shashimi was so fresh! Great service. The giant roll was amazing!", "author": "Courtenay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-27", "description": "Love it!!!! Love it !!!! Came with our kids and had a great meal. Bento boxes were the right choice for the kids.", "author": "kami A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-28", "description": "We came across this restaurant randomly and decided to check it out. It was pretty empty for a Saturday night at 7pm, so service very quick. We had a few appetizers, such as the tonkatsu and beef/chicken teriyaki, which were both pretty good. Bf got some sushi and we were both surprised at how thick the cuts of fish were. I would love to come back here for their lunch menu the next time I'm in town.", "author": "Marilyn V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-10", "description": "I felt a little rushed for some reason. I can't quite place it. I only had veggie rolls, but they were creative and yummy. It's a small place, but everyone seemed happy. (customers seemed happy, so of the wait staff, not so much.)", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-15", "description": "The food was phenomenal.  However, I was very disappointed when I got the bill to find I was charged for the refills (it did not state the refills cost money on the menu).  So $4, for 2 cans of soda?  I can bring a whole 6 pack of soda in to sip on while I enjoy my meal for that price.", "author": "Skyler R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-17", "description": "I've had better sushi in my life but this was decent . The fish was fresh, the rice was a good consistency. No frills menu. Great prices! Get the combo lunch, it's a great deal!\n\nI'd definitely go back if I were in the area but I wouldn't make a special trip for it.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-13", "description": "Just tried this place for the first time, right outside Chinatown. I had the Philadelphia, Florida, and Spicy Tuna rolls. All were really good and fresh. And I love the noodle salad thing that came with the lunch special!\n\nGreat place for fresh, inexpensive sushi.", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-20", "description": "had 4 things. house sake, gyoza,  spicy chicken and spicy tuna roll. everything was awesome.", "author": "krishan y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-26", "description": "The server was very nice and pleasant. The draft beer was only $1.75 until 3pm. So far so good. But the food.... was less than acceptable. The potion of Chirashi was about a half of typical Japanese portion. The sashimi was the lowest quality I have ever seen in California. \nWhat happened to the Mikaku I used to know more than 10 years ago. I miss them.", "author": "Tadashi E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-07", "description": "Visited this past weekend. The food was good, but the service was horrible. First time I didn't leave a tip (it was that bad!)", "author": "Nica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "Great sushi, and friendly staff.  The Chet's choice is a must have!", "author": "Will M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-10", "description": "I miss the old Mikaku!  \n\nI really want to love this place but I just don't think it's possible.  Today I went for lunch and ordered a bento set with tonkatsu and gyoza.  My tonkatsu was burned so badly it was black!  My miso tasted like tepid water.  The service was mediocre and the food definitely isn't worth a trip back.  I guess I should have just gone to Murracci's for curry instead.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "All I can say is HAPPY HOUR!\n\nMy friend and I were killing some time walking to Chinatown and she saw the happy hour sign, yes...we went in because of that. 50% off all beers...pretty good. Needless to say, we got 2 pitchers of Sapporo for $12...YEEEE HAWWW!\n\nWe also ordered:\n - Edamame: Normal\n - Seaweed salad: Pretty good, wasn't cut with cheap seaweed so that was good\n - Dragon roll: Good size, good flavor, really pretty good.\n\nFriendly and quick service. Good happy hour prices. I'll have to go back to input more on the food but from what I had, it was not bad.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-09", "description": "Quickly becoming my favorite sushi joint in the neighborhood. The sushi quality is excellent and the owner girl is hilarious! Try the premium sake sampler, great way to learn about Sake's and the different tastes.", "author": "Travis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-20", "description": "This place is YUM!  My husband was craving sushi so we decided to check out this spot.  I was really impressed with the amount of veggie rolls they offered - another reason I love San Francisco!  We had the seaweed salad and steamed spinach to start - both of which were very good and just the right amount of appetizer.  I ordered the veggie dragon roll with eggplant, avocado, and sweet potato - three of my favorite things!  It was delicious.  My husband ordered another one of their specialty rolls - dont' remember the name but it had salmon in it and he said it was very good.  The prices were decent, the rolls were 10 and 11 dollars each.  I will definitely visit this place again next time I am in the area.", "author": "Beenish K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "New ownership has dramatically improved the quality and service at Mikaku! Can't speak to the rolls but the sashimi has been consistent and fresh (even on the dreaded sushi on Sunday visit). Pricing is very reasonable and has a great neighborhoody feel despite being in the middle of Union Square.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "I know I don't go out nearly enough to be a good Yelper but I am glad I have this place to write about. This place was recommended to me by one of the very few people I trust in taste, and like always I got what he promised. \n\nI desired authentic Japanese food. Not sushi, which plagues San Francisco and sushi is good in itself but what I was specifically looking for was more into the depths of Japanese cuisine.\n\nThat being said, this is where I am going to say a few things about Japanese restaurants in the United States. At least 95% of them are catered for the American consumer. Proof? California rolls. So as I read all these negative reviews about this place, it makes me sad and at the same time wonder about the overall palate of the Americans. Not just in food, but the overall dining experience, including service and treatment.\n\nWhat Americans don't realize is how Japanese restaurants are actually run in Japan, where the wait staff actually wait for your call (in many places, with a push of a button). Americans are obsessed with chugging down insane amounts of water, which is why they expect their waters to be constantly refilled, whereas in Japan your glass of water will probably last you the entire meal. In Japan they do not come to you every five minutes to ask whether the food is good, because really that is more annoying than polite. They will not bother you period unless you call them, and if you call them, it is to order more food or beer/sake, not a refill of water when your glass is still half full. But Americans expect it, and when they do not get it they regard it as bad service. Whereas in Japan, it is perfectly good service. So to give a bad review because of this is very miscredited, and it is hard not to get exasperated and yell out \"shut up you spoiled brats\".\n\nAbout the sushi, again it is catered to Americans. You want cheap sushi, you got it. You order California rolls with your maguro nigiri and you expect the maguro to be of high quality. Sorry, that's just not going to happen anywhere. Do any of you know why the California roll was invented in the first place? I'm sure most of you would be offended. To order California rolls at a sushi restaurant is an insult to the tradition. To order a rock roll, a volcano roll, a spider roll, you're just digging your own grave. The California roll order is the deal breaker in automatically knowing whether the customer is serious about eating good Japanese food. To give a restaurant a bad review based on their California rolls is just silly.\n\nFor this place, the sushi counter is just there to satisfy the American expectation, that a Japanese restaurant is not a Japanese restaurant unless they serve sushi, i.e. California rolls.\n\nI knew not to come here for sushi, when I walked in I did not expect sushi, yet I still sat at the counter, because that is where the head chef was. When the waitress asked if I will be having any sushi, I told her no thanks. \n\nI glanced at the menu, but I didn't really read the details. I knew that the things I wanted were not on the menu, and all I needed to do was talk with the head chef a little. This is my scheme for all good Japanese restaurants, to introduce myself to the head chef and let him know my knowledge of Japanese food and let him decide what I would like. I told him I wanted food from the kitchen, what he thought was good.\n\nThey all get a bit confused and awkward at first, since I am clearly an American Asian and I speak English. But usually they break down pretty quick as I ask for more and more food, and by the end mutual respect is formed. \n\nThis is how to treat Japanese restaurants in America. It does you absolutely no good to bark at the chef about maGURro and haMAHchi niGIRri because you might as well be wearing a shirt with \"baka gaijin\" written all over it. The customer is not the king there, the head chef is. You show him respect, he will give you respect. If you can't pronounce it right, just say it in frickin English. \n\nMost of what I got is written on the white board, which is what you need to pay attention to because that's the place that lists the true Japanese dishes they serve. Lightly fried pumpkin with a bit of salt on the side, pan fried light duck meat, chawan mushi (steamed egg with soup), and homemade (hand cut!!) soba noodles. Does anybody know just how hard it is to make soba yourself? And the chef admitted to me it took him a long time to get it right.\n\nThe chawan mushi is one of the best I have had in San Francisco, the pumpkin is something you don't see often here, the duck is nice and fatty as it should be, and the soba is a great eye-opening experience after so many places that serve them right out of the package.\n\nAfter I ate I sat and chatted with him for a long time, talking of food and of the nabe (hotpot) dish I will be back for next week (you must reserve this dish in advance in order for him to prepare it). He charges far less than what the food is worth, believe me.", "author": "Daria J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-20", "description": "It's closing soon, but before it does I want to take a moment to speak fondly of it. Okay here goes: a reliable choice for dinner when no particular inspiration struck us; a business needs a certain comfort with itself to be a go-to choice, and Mikaku managed that well.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "A local recommended mikaku for lunch and I have been here every day since for my four day conference. Great food and reasonably priced. Sit at the sushi bar if you can. Great service!  Yoshi was the sushi chef who treated me best.", "author": "Tom O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-23", "description": "I was here several months ago and remembered the food to be better, but today's fish was just bits and pieces.  I came after the lunch hour, so they might have run out of the best pieces of tuna and yellow tail, but I felt let down.  I do like that they offer a complimentary roll, but I won't be back any time soon as it appears that consistency it is not at Mikaku.", "author": "Bo T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-05", "description": "We stopped here before a friend's birthday. \n\nI ordered a Mikaku Special and my girlfriend ordered the 3 sushi roll deal. \nThe food was just okay - nothing special. Tthe portions were really small, especially the teriyaki chicken. The tempura was cooked very well. The cost was on par with other Japanese restaurants but the quality of the food just wasn't there. Their ingredients didn't taste very fresh and the restaurant seats were dirty.\n\nThe service was average.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-29", "description": "as far as i've found to date, the best sushi in the fidi.  \n\nfriendly japanese owner and staff.\n\nfirmly made nigiri, with fresh fish and small rice, the way it's supposed to be.\n\nsimple rolls are tight so you're not left with a rice swamp in your shoyu dish.\n\nreasonably priced.\n\nno comparison to ghetto chinese sushi boats.", "author": "Reina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-23", "description": "FOOD POISONING!!!!  I was sick for two days after eating there.  I have never felt so miserable in my life.  I ate lunch there one day and I had a sneaking suspicion that something was a little off when eating but finished my meal.  That night I almost went to the hospital I was so sick.  I was curled up on the bathroom floor until 5 in the morning when i stopped vomiting.  The entire next day I was also sick (shaking, chills, upset stomach, unmentionable other symptoms).  \n\nEat here at your own risk!", "author": "Jaden V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-08", "description": "Their food is great, but service is horrible. I just had my second bad experience with calling in for takeout. They screw up the orders regularly and then don't offer any kind of compensation for waiting for a long time to get the food that is a wrong order anyway?! Seriously - bad customer service. AND, found a hair in my soup that took 30 minutes to get. Ridiculous.", "author": "AMIE L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "I would give them 5 stars, as they're one of the few really great sushi spots in the FiDi, but they got rid of the noodle salad after the revamp! So sad.", "author": "Sasha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "Honestly, I have come to suspect that no one in America knows what the hell they are talking about when it comes to sushi and Japanese food.   It's so much easier to be detached or pass judgment--no one wants to be vulnerable and enthusiastic.  Well I'm enthusiastic about Mikaku. This place is as good as you could expect in the homeland for the price with delicious and generous servings that only go California in their vegetarian variety.  The location and decor are pleasant enough as well.  I take my Japanese family here and they are always happy to indulge in cheap, tasty, and authentic Japanese food.", "author": "Eartha K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "I really liked this place. Low key and great sushi (they get the rice right - critical!). Tempura and other stuff good too.", "author": "Donna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-18", "description": "i think this must be the first restaurant i went to because i read a yelp review.  what a sheep ive become.  =[\n\nwe came here on a wednesday night before a movie.  there was a table of two japanese men here.  and before we left another japanese couple.  maybe on a date?  so pretty quiet or slow night.  not sure what its like at lunch.  our waitress spoke fluent english and japanese so that was neat.\n\nwe ordered the handmade soba.  which u can only get cold by the way.  i wanted mine hot but the hot ones are not hand made. the simmered cod fish in miso broth.  nori/seaweed chazuke (rice in soup).  salmon onigiri (rice ball).  oshitashi (spinach).  my bf ordered sushi but i didnt have any of it.\n\nthe soba was good.  they give you the water the noodles were boiled in at the end which is supposed to be good for you.  but im not a big fan.  cod was good considering it was simmered and i thought it would fall apart.  bf said the hamachi was hard. rice dishes were good.\n\nthey have other things that look interesting too like duck and the kabocha/pumpkin.  maybe ill come back.  i dont know why i feel like it was epxnsive for what i got.  $60 for two people considering it was mostly rice.  or is that how expensive japanese food nowadays?  hmm", "author": "claudia y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "Came here armed with a coupon and ordered plenty of sushi.  I actually expected it to still look like its former self (it's under new management), but I like the new look a lot better.  It looks very classy.  I used to come here for lunch sometimes, but the food definitely was poorer quality than it is now.  This time, the sushi was absolutely delicious.\n\nI love rolls and the healthy portion I ordered really hit the spot.  The waitresses were really attentive and nice, as a bonus.", "author": "Sylvi Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-01", "description": "i must say, i really wanted to love this place.\n\nit's 3 blocks from my office. im dying to find a good japanese restaurant near by.\n\nthe service is friendly. i got a free california roll for being an \"early bird\"\n\nto start, the avocado in my free california roll was not ripe. crunchy. ever had crunchy avocado? 'nuff said.\n\nmy spicy tuna roll was not horrible, but the rice was dry and somehow it was very salty. the tempura was undercooked and really greasy. the oil smelled of fast food. the cold noodles were tasty, but nothing special. my teriyaki chicken was just aight, at least it was cooked. the dressing on the salad was a bit too mayo-ey. there were a couple of small flies checking out my food the whole time\n\nbut the tea was nice. i love a good green tea.\n\ni went here on the suggestion of a coworker and i think i should go kick him now.\n\nfor $15 (after tip) i left hungry and feeling a bit ill.", "author": "Tala D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "Found this place after a busy day in Union Square, and while it's nothing uber-special, I would definitely come back. Although the service was a little jagged around the edges (at one point we had two waiters at our table, contradicting each other about an unlisted drink price, then both walked away without taking our order), the rolls were tasty and the prices were reasonable (especially for the happy hour menu, which they have even on Saturdays, 5-7pm). The fish was fresh, good flavorings particularly on the spicy rolls, and the presentation was very nice. My biggest complaint is that their California Roll uses imitation crab, which is a bummer since so too do all the special rolls that are built on top of this (probably 2/3 of the special rolls menu?) which is limiting if, like me, you're not a fan of that fake crab stuff :(", "author": "Hilary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-19", "description": "Really fresh sashimi.  Even my 12-year-old son, who usually won't eat fish, loved the hamachi.  He practically inhaled his spider roll - I didn't even get to try it.  Their spicy tuna is pretty spicy, which was a nice balance to the milder selections.\nNice decor.  Great location on Grant, around the corner from the Sutter Street elevator exit of Stockton/Sutter garage.  Will definitely go back.", "author": "Ever B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "This is one of our sushi lunch go-to places with the co-workers. I like the nigiri and roll lunch special. It's good price and the fish is fresh and tasty. Also you get tea with your meal which I always enjoy.", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-01", "description": "Don't waste your money or time.  Service was atrocious.  Food was mediocre.  It's a big city.  We failed to do our research before visiting and this was our just desserts.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-21", "description": "This little sushi spot doesn't hit the spot. Its edible but I wouldn't recommend anyone going out of their way to check it out.  I wish I had been able to try this place before management changed.  I had Combo A and was disappointed.  Its too loud in there and the service set up is a mess.  I wish it had been better.  Should I be expecting a nasty email now?", "author": "Allison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-18", "description": "the perfect FiDi traditional Japanese lunch (right in front of chinatown gate).  Very reasonably priced chirashi for $11 with good rice, maguro, albacore, salmon, mackerel, and snapper.  unfortunately, at lunch, you can't order the whiteboard izakaya dinner items -- these look very good and interesting, including housemade soba, pumpkin, eggplant, skatewing, oyster, etc.\nthe katsu-don also was nicely done with the egg\n\nsorry to hear that it's changed now as of 10/09", "author": "Rob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-06", "description": "I have a sore throat and my friend is home sick with bronchitis. What makes us both happy? The buckwheat soba noodles in warm broth. Not really expensive but not cheap, kind of what you would expect for the area. It was a little unorganized trying to place an order to go, but it was ready quickly and it smelled so good it was hard to wait to eat until I got my sick friends' place!", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-11", "description": "I went here yesterday for lunch and was shocked to see how much this place has changed! It is much \"fancier\" with clubby music playing in the background and a sign out front advertising \"MK Sushi & Sake Happy Hour\". No more Itou-san and his wife, they went back to Japan! Very sad. I sat at the counter and ordered \"Sushi Combo Lunch A\" which was maguro, ebi, hirame, unagi, kappa maki with miso soup and salad. Unfortunately the only thing that was half way decent was the kappa (cucumber) roll. All the sushi tasted very old and rubbery. The unagi was cold and hard. The hirame definitely tasted like it was way past its prime. The rice was not good either (again, cold) and there was hardly any wasabi in btwn rice and fish. The miso soup tasted like bleach (probably didn't rinse the bowl well when it was washed) and the iceberg lettuce salad was literally 5 pieces of brown, wilted, stalky pieces (dressing was good though). The service was very friendly, but so slow and forgetful. Many customers were getting impatient and irritated since everyone was in a hurry on their lunch break. The boss (at least who I think was the boss, behind the sushi counter) was trying his best to make sushi, chat with customers and manage the incompetent staff so he gets 4 stars. But unfortunately the food was so bad I'm not sure if I'll be back. I thought maybe it was just opening kinks they needed to work out, but I heard they've been open for 3 months now. They should be on top of their game at this point. Guess I'll be going to Doujima-an when I'm downtown. I do wish the new owners lots of luck though. They were very nice people.", "author": "lani P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "Although decent in taste, the presentation was dreadful. Sushi should have clean cuts and colorful. We ordered four rolls and an appetizer. Service was given if requested. The price was on par for the quality. The spicy tuna was the best tasting out of the entire meal.", "author": "kelly y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "Pleasantly surprised by this authentic, cozy Japanese restaurant - in Union Square, of all places! I was expecting a super tourist trap and was delighted to be proven wrong. The sashimi was very fresh and the udon (I chose the one with scrambled eggs - it comes with chicken as well) was really good...the soup was SO tasty. We also tried the spider roll, which was crammed with just-fried crab. Mikaku is reasonably priced - again, especially for a Union Square restaurant - and I will definitely come here again when I'm craving fresh sashimi.", "author": "Adrienne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-01", "description": "this place was okay.  I should've ordered the udon.  the chirashi didn't look that fresh.", "author": "con c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-12", "description": "I didn't know it was possible to screw up Miso soup but this place managed it.The second to worst sushi I ever had in my life.  Should have gotten my cue from the empty restaurant. Never again.", "author": "roy l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "Located right across from Rouge & Blanc Wine Bar, this place is my new fav sushi restaurant in the city. I was told that ownership changed hands a couple weeks ago, and that the decor is a lot more modern now. I *really* really like this place. Fresh sashimi, and the rolls were put together with a ton of care. Plentiful portions of udon/soba noodles in eclectic dishware. Service is great. The owner personally waited on us, as well as a cute young (very polite) guy from Belarus, (who even came over to ask if I was cold, (because he wanted to offer a shawl to use while I dined)). OOOHHHH Sooooo cute!! Intimate, but casual setting, unpretentious, cozy and comfortable. Prices are reasonable for the quantity given. While we dined, they were playing a mixed CD with jams from the 90's. My friend and I couldn't help but smile at every song that came on. Can you say artists like: Jodeci, PM Dawn, de la Soul? Old school jams that brought back SO many memories! Can't wait to go back!", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "My first experience at Mikaku was absolutely fabulous!  The seaweed salad, and sashimi sampler were super fresh and delicious.  The wait staff was completely attentive and friendly.  Natasha  (owner) is a total sweetheart and really takes a lot of pride in the service and food, but doesn't neglect the importance of a fun, lively atmosphere.  I can't wait to go back again for lunch carry out later this week!", "author": "Heather H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "Just happened to walk by the place and decided to go have dinner with my gf. She had the Naguri 12 piece deluxe and she loved it.  We also had the soft shell crab and dumplings for appetizer. I had the beef tonduri ( I think).  Though the servings were small they were good. Service was excellent.  The female owner (we think she's the owner) was very attentive and helpful. The waiter wasn't a lot of help though as he wasn't sure what was on the menu and had to ask the cook each time.She had us try (for free) the house baked mussels with their special sauce and it was GREAT.  Never had that before. Wouldn't mind going back there next time we are in SF again.", "author": "Mar S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-17", "description": "I'm not sure if anything else could have gone wrong during my lunch at Mikaku. After my sister and I first placed our order of lunch box specials, we were told we apparently ordered wrong and should have followed some mysterious instructions and chosen items from different columns (not stated on the menu). Our soup did not arrive until right before our meal. The food was ok, but when we were done eating it took about ten minutes for the waitress to come clear our plate, and she took our water which we were still drinking! I gave her my credit card to pay the bill and when she returned for me to sign, my credit card wasn't in there. We tried to get their attention but were ignored, and my sister finally found my card on the floor by the kitchen. I do not recommend, and would not go back.", "author": "Jillian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "Mikaku is a gem of a sushi restaurant in the city. The fish is always phenomenal and fresh, and the service is excellent. Everyone should stop in and try this sushi! I've started going weekly because it's such a positive dining experience. I brought m boyfriend in and he agreed it is by FAR some of the best sushi in the city!!  Go to Mikaku TODAY!!! :)", "author": "Lady L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-26", "description": "I would give this place a 4 star or even 5  for the good food, decent price, and ample menu option if it wasn't for the lack of customer service.  The two waitresses are so inattentive.  Your water or tea is not refilled unless you ask, but they will hand you your bill even if you have not asked for it and will also remove your dish without asking if you are done.  These are my two biggest pet peeves when eating out!", "author": "Jake G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-05", "description": "i thinks its under new management now cuz they dont have the free order of california rolls for the first 10 customers!", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "Simply one of the few restaurants downtown that offers such great personal service! No where else do they cook sushi like Mikaku's where anything on the menu makes any bad mood melt away. Just planning on coming here makes me excited. All the waiters/waitresses are very personable and informative about the menu and definitely know what's best. Natasha really made our night this weekend by simply being awesome and showing us a great time. I have worked in the downtown area now for almost three years and have never appreciated anyone's business more. Whether it's a quick lunch trip or a late night sushi expo, this is the place to go for all sushi cravings.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-18", "description": "came here for dinner last night, and i just got nabeyaki udon b/c it was cold out.  i want to try the handpulled soba that everyone raves about next time.  my friends got it, and it looked good.  i was told to only order off the white board, b/c that's where all the specials are.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-01", "description": "this is one of my favorite japanese restaurants in the city!  it's really more of a traditional, homemade type of authentic japanese food.  i have been here around four times and never ordered the sushi.  instead, i ordered food on the menu and on the board.  it's definitely not a fancy restaurant, but good for good old fashioned japanese home cooking.", "author": "Pelina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "Ok...you've got $10, feel like Japanese food, and it's 11:15am, and if you happen to be one with a hearty appetite, well, then... run to Mikaku. Like the other reviews, this is not fancy fare, but it's no Todai either.  The 11:15am part you ask?  Well, if you're one of the first 10 customers that order $7 or more, then you get a free order of california roll.  (Note: if you order the $6.95 udon, you don't qualify.. literally, it's $7... order a diet coke or something!).  My lunch buddies and I go here every so often... the soba (you can't do soba bad!) is fulfilling on a warm day, and the nabeyaki udon keeps you in good spirits on the chilly SF days.  The sushi you ask... well, I won't take my chances so I can't give fair judgement on that... the portions look decent but... let me know how it tastes when you order it.  The waitstaff... well, they've gotten to know me and my timely 11:28 arrival... so they are kind.  All in all, I know you can do a lot worse.", "author": "Dale K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "i absolutely love this place.  we had a big meeting here and we've tried just about all the sashimi dishes they had on the menu. and they have the freshest sashimi!!i would definitely go back for their uni and ama-ebi... oh so delicious!  their tasteful presentation and the friendly service have made this trendy place one of my favorite sushi-stops in the city!", "author": "lis k."}
