{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "This is a gem.\n\nClassic, friendly and authentic Mexican food at this little diner. \n\nGreat flavor.\nHuge portions.\nWonderful service.\nGood diner coffee.\n\n*If you just got hired at Google and moved to The Mission last week you'll hate this old place. They don't speak hipster so simply stay away. I recommend The Little Chihuahua. I wrote a comprehensive review of the Lower Height location in 2010. Check it out.\n\nWe came in on a Sunday morning around 9:00 AM and there was a booth in the window waiting for us. How nice is that? We both ordered water and coffee while we looked at our choices.\n\n# Chilaquiles: This is a simple classic with tortilla chips, eggs, and salsa. I always ask for my egg over easy, however, the classic is scrambled. Everything in this was just how it should be. Difinately give it a try.\n\nOur server checked in often and our coffee and water were always full.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Love this diner. Super close to 24 St/Mission and has lots of character. Most people eating there are Latinx. \n\nFood is no-frills Mexican comfort food and incredibly affordable for the area. Where else can you get brunch for less than $10?\n\nI got the Chilaquiles and loved them. The refried beans had a nice richness and depth to them. I like the sour green Chile sauce that complemented it. I ordered it spicy and it was actually quite hot! An excellent brunch dish for a hangover.\n\nService was great. Our waiter checked in on us frequently and had a good sense of humor.", "author": "Gabriel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "This place was everything you could want out of a diner experience - fast service, huge portions, great taste, and local flavor. It's also just down the street from the 24th Street BART station, making it in an ideal neighborhood to walk around and explore on any given day after your meal here.\n\nWe walked in on a Sunday a little after noon for brunch. The place was bustling but we were able to immediately get a seat in the back. The demographic was pretty mixed with young people, families, and seniors. The waiters seemed to know a lot of the regulars and were having super lively conversations with everyone inside. Overall a super neighborhood-seeming spot that made you feel welcome the moment you walked in.\n\nThe food itself was also a huge hit. We go the chilaquiles with refried beans and rice and the Mission Omelette with sourdough toast and hash browns. The chilquiles were topped with delicious queso blanco and the sides were a great filling side. The Mission Omelette was absolutely stuffed with ground beef, mushrooms, onions and bacon, making it almost overwhelmingly filling. Overall the portions were incredibly large and overwhelming in the best way.\n\nThe price also can't be beat! For a two dish brunch including tip and tax to come out to just over $20 in San Francisco is quite amazing. We'll definitely be coming back weekend after weekend.", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "It was packed during the brunch hour on a Sunday, but we were still able to get seats on the \"bar\"! And if not, the wait would have only been around 10 minutes to sit in a booth. The waitress and waiters were super kind even though they were busy. The chilaquiles are my favorite thing here and I've been ordering them since I was younger! The green sauce is delicious and makes everything on the plate even better. Love coming here when I'm in the mission!", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "OM Goodness! Our friend from San Francisco brought us here for breakfast! The huevos rancheros were amazing! Tops anything I've had in San Antonio! The refried beans were goo. The Spanish rice was good. The ranchero sauce was delicious. And they melt cheese on top of the egos. They also put the eggs on a oil slightly fried corn tortillas. The waiters are nice so handsome!", "author": "Teofila R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Why are you reading this? Eat here! Best diner-style breakfast in the Mission *by far*.\n\nIt's a wonderful blend of Mexican & traditional diner flavors. The bacon is crispy and tasty, omelette a packed, and the green salsa spicy and tangy. Plus everything is cheap! (for SF anyhow)\n\nI recommend the #27 omelette with green salsa and crumbled Queso Blanco. But why are you still listening to me? Eat!", "author": "Gregory W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Top Notch!\nThey put out what is truly one of the best omelettes I've had. \n\nOne of the best breakfast values in SF - 3 egg omelette with hash browns, toast or tortillas, coffee, tax and 20% + tip for less than $15!\n\nThey feature traditional breakfast and lunch offerings (with a focus on Mexican flavoring).\n\nI have been helped by Carlos, the server. In the middle of the breakfast rush (all seats filled) He remains warm and friendly, while being professional and staying focused on anything you may need.\n\nClean, well staffed, nice menu variety (for the size of the restaurant), personable service with quality food in generous portions at greasy spoon pricing - what more could you want!\n\nFYI...\n\nI read reviews complaining some felt put-off by the primarily Spanish speaking staff - really not justified.\n\nUnderstand that most of the clientele at Breakfast chose to speak Spanish, so you too will be greeted such - but just let them know your Spanish is not strong (or absent) and they'll respect that. Or, you could take it upon your self to brush up on some Spanish - it is a beautiful language", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "We love Mission's Kitchen! The tiramisu is to live for! The other neighborhood spot, for sure. Had to flip a coin for dinner tonight to decide which spot to hit. We will go tomorrow. Everything cooked right in front of you if you have a bar seat. The Pancakes are amazing. Can't wait to try the Chile quiles next.", "author": "Ericca C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "I've been eating here for almost 5 years... not a regular, but I've been here...\nI went from a server who know i tipped well so she keep the change on a 27 bill and we gave her a 40... that's cool...\nBut tonight seen ur \"chef\" slamming a bunch of cilantro, before chopped it and make the new batch of ur pico de Gallo, against the inside of ur trash can was to much...", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "The place is comfortable and the food is good.  Some time a mariachi sing and well I do not like mariachi music so I feel unhappy but other people like that and I respect that. and that does not change my opinion about this place. \n\nSometimes music is too loud so you cannot talk with your peer. \n\nGo and try the food.", "author": "Eduardo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Very clean, extremely nice staff and great food. Their Bacon & Avocado Cheeseburger is very delicious and their onion rings are pretty good. Definitely would come again, such an underrated place!", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Good cheap mexican diner with everything you'd want for breakfast.", "author": "Calum Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Had this today and Loved it! Food was delicious and the servers were fun & seemed like they enjoyed being there. I'm much more likely to support a restaurant that seems as if the folks who work there are happy (and the food was good AND cheap!) Our server danced the whole time we were there & helped make a stressful morning feel less stressful.", "author": "Brad C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "Sure, there are plenty of taquerias in the Mission but what about true greasy spoons that serve breakfast plates in the evening? I think they're severely underrepresented in the 'hood. Jim's is still around, but that formica-laden Sambo's-wannabe closes at 3PM (review: http://bit.ly/1NhE5O7). What good does that do me if I really want Joe's Special after work? That craving comes every so often, and instead of making it at home like any normal person would do since it's ridiculously simple to make, I go out to an appropriately working class diner, and it looked like Mission's Kitchen fit the bill (photo: http://bit.ly/1PectYy). It looked like the kind of spot that attracts hungover hipsters although 10PM seems early for that target clientele.\n\nIt was almost empty when I entered except for a slight Asian woman in the next booth who looked like she ordered half the menu. Speaking of which, it looked like a Denny's knock-off with a Mexican twist with dishes identified in English and descriptions in Spanish. It took me a while to figure out that the $9.95 Mission Scramble was their take on Joe's Special with scrambled eggs mixed with ground beef, onions, bell peppers and cheese. It was more on the greasy side and just a tad overcooked, but it did come with a crispy flat of hash browns which to be truthful was probably what I was really craving (photo: http://bit.ly/1hcHDVM). The Mexican twist came with the choice of tortillas instead of toast for those who want to turn the dish into a burrito.\n\nI must have been in the mood to replicate the deal at the Soma Inn Cafe where you can get their Joe's Special with pancakes. So of course, I went for a $5.25 Short Stack which came dusted in a hefty amount of powdered sugar (photo: http://bit.ly/1Mt8Al2). They had maple syrup, but I was intrigued enough by the condensed milk that I poured some on. Didn't care for it as it made the hotcakes far too sweet to enjoy as a side starch. The waitress came by periodically to see how I was doing, though I noticed when a couple of their regular customers came in, their attention wavered. But I guess that's a key part of the greasy spoon experience as you have to be a regular to get the \"Hiya, hon, whatcha' havin'?\"-level service.\n\nFOOD - 3 stars...true diner fare in the Mission with a Mexican twist, but it falls short\nAMBIANCE - 2.5 stars...yep, it's a diner alright\nSERVICE - 2.5 stars...reasonable, not quite indifferent\nTOTAL - 3 stars...if you crave Joe's Special with tortillas, here ya go", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "This is a cozy diner/breakfast spot. The portions are big. The food is hearty. This is a spot for comfort food.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "My forever local breakfast spot, HANDS DOWN!  Been coming here for years. Food is consistently delicious, big ass portions that fills your whole being lol. Menu has good variety of everything, down to the unlimited fresh REAL coffee. Service is equally GREAT (esp Carlos the loud, handsome hilarious Mexican server lol :)  Yes, damn good in every way and highly-recommended ;)", "author": "Carmel D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-06", "description": "I was. Having my breakfast  and  saw many food handler  cross contimination health issues , Beggining from cook .one he  tooked a raw meat and touchin tortillas  Without washing his hand.. the other cook setting plates handling  chesse  and cutting and touching plates been served. And there were the diswasher. Passing by  touching his hair. Between the contertop grill. Where alot food was cooking . I belive  manage food isnt easy.   there is  law for some reason  in kitchen world . Please. Please .. follow simple steps  wash the hands every time is necessary..", "author": "Alfredo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "My kind of Diner: Great food (the pancakes, waffles, bacon & eggs were all delicious), good vibes and wonderful friendly service. Oh, and not expensive!", "author": "Adelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "I love this place. The same friendly faces still work here. Everyone is incredibly patients with my wild child and the servings are bigger than my large head. The food is always delicious. It is heavy but it is damn good. One of my favorite breakfast spots hands down.", "author": "Wenn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Found this place while searching for an American diner.\n\nOrdered coffee $2.50 and chilaquiles $8.75.\nFood was delicious and so was the coffee.\n\nThe bill for 2 was about $24.\n\nWill come back to try other items on menu.", "author": "JC M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-02", "description": "This place has great portions of food for the price!!!! The reason for 3 stars. I have noticed... If you don't speak Spanish...some of the servers will avoid you. They will take your order.... Then give you your food... And you will never see them again. Every time I'm in there, I have to walk up for a refill for a drink. On top of that...they double or triple charge you for your refills. Bullshit", "author": "Mr. Potato G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "One of my favorites places to eat at the Mission district. I really like the omelettes there and the staff  is very friendly. The food taste is good and the prices are pretty good. I really recommend this place if you are around here.", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Mmm...the breakfast nachos are \"CRACKING\" as my boyfriend would say. CHAILAQUILES is what I think they are called. BOMB.COM. \n\nCame here for a quick bite before we started our day. The service is super friendly and the food is great. I not an expert on Mexican food but this definitely tasted authentic. \n\nIf you're in the Mission and looking for some grub, I would highly recommend this spot.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-26", "description": "Great food but today was really horrible service I almost walked out but had already waited 20 min to have a table cleared, then waited 10 min for a drink order and then the drink order was incomplete so waited another 3 minutes to have her come over once we finally got the order in the food took only 9 minutes which clearly proves I just got a bad waitress today.  Hoping they see the review because I would not want one bad waitress to ruin it for everyone.", "author": "Tracy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Came here on a sunday with a friend. It was a little crowded so we had to wait a bit to be seated. I ordered the azteca scramble and it was super tasty. My friend thought the pancakes were so-so.", "author": "Alexandra L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "Great food. ! I called 4 times and the person who picked up told me he didn't know the item in the menu, Central American special ? \nJust say it's too musy to take a phone order.", "author": "Edgardo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-13", "description": "I have been in quite a few times and have had a great experience at breakfast. Went in for dinner the other day, such a mistake. Sat down and we ordered our drinks and food. The server went to the register and took about 15 minutes to get the Corona that we ordered while we were wondering the Coke was. She comes back 5 minutes later saying there's no more coke. I said ok fine I don't need anything to drink. Then she brings the food after it's been sitting at the counter for a few. The food was fine, nothing spectacular. Then we go to pay and the server says \"oh, you didn't like the food\" since there was half a burger left. That's an odd question to ask since she had ruined our experience and I was just not in the mood.\n\nIn conclusion, that woman should be fired and I don't think we will be going back for dinner.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Delicious Mexican breakfast with impeccable service. I got the huevos rancheros and will be stopping back anytime I'm around mission. Friendly and attentive staff made me feel at home.", "author": "Rob D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "4.5 Stars, but that's only because nothing is \"perfect\"\nMission's Kitchen is a genuine \"dine local\" kinda place with the oldskool badass Mission feel.  The breakfast food is fantastic and I devour Mexican frittatas here on a regular basis.  Great coffee in a nice mug refilled constantly, large glass syrup containers at every table for your pancakes AND condensed milk ready to pour at every table!\n\n+10 for amazing disability access with working automatic door in front AND for the bathroom.  This is new, and the place was awesome even before they installed these.\n\nThe lady that waits on you in the afternoons here is super sweet and they hook it up with the homefries and bread too!  You just can't beat this place for the price, amount of food, and service.\n\nI only take half a star off because 1) music can be kinda loud sometimes because the kitchen plays their jams and it isn't separated well and 2) the ingredients are great but not AMAZING like what you would get at a fancy super health food store.  You kinda get what you are paying for there, and I am OK with that!", "author": "Thomas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-27", "description": "Tried this place for the first time, ordered the \"Central American Special\", it was lacking in 2 key areas, the casamiento (beans and rice) was dry and chewey, the \"crema\" was just plain ol' sour cream (not the central american kind, with a very distinct taste and yellowish hue). Other than that the platanos, eggs and fried cheese were good.\n\nI'm definitely gonna try it again, but this time I'll order something else, I'm very picky with my \"Central American\" breakfasts, sadly if you want an authentic one you're gonna have to look elsewhere.", "author": "Cybernetik V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "Came here for lunch, ordered \"Mexican frittata with chorizo\" to go. The food took a while to prep, but it was lunch prime time and the place was pretty busy. The staff is really nice and friendly. The music is a bit loud. I was not impressed with my frittata, but it was okay and, as it adds diversity to my lunch options, I'll probably be back.", "author": "Maria V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Accessible table right up front, straight across from the door!  Makes it easy to get to the excellent breakfast, good service, and low prices.\n\nIt's a coffee shop - remember those?  Breakfast served all day? Two eggs any style, hash browns or home fries, bacon, coffee, and fresh-squeezed orange juice?  If you remember, this is what you have been missing.  If you don't remember, go here to get the coffee shop experience.\n\nThe breakfasts are good enough to dawdle over.  Crispy hash browns or home fries with onions and peppers.  Eggs with chorizo and Nopales cactus.  Good coffee!  The service is always friendly.  The prices are excellent; plan on spending under $15.  \n\nJust roll in and have a great time!", "author": "SF Disability Awareness N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "WOW..... not sure about other plates BUT....OMG....\nthe \"CHILAQUILES\" are the best!!!!!!!!!!!!!!!\n\nI seldom order this anywhere because is one of those plates difficult to make, but when I saw someone having them I changed my order from my usual Huevos Rancheros to CHILAQUILES.....\n\nThe BEST Chilaquiles I have tried in San Francisco!!!!\n\nAnother big plus is that if you order coffee they keep serving you at no extra cost.....YUM", "author": "Amb V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Steak and eggs was very good. Staff are super friendly. Great service. That is all. I don't want to type more but it's making me.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Great neighborhood breakfast joint. Cheap, friendly and good quality food. I'm full so to tired to keep typing. Adios", "author": "B M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "Love this diner! Delicious food, generous portions, AMAZING service, reasonable prices--what's not to love?!? It's not \"hip\" and since it's a part of pre-gentrified Mission, I hope it manages to stick around. \n\nGotta try the chilaquiles, maduros, breakfast burrito, and omelette! Carlos is a wonderful host and the ambiance on the morning I went was ladies selling flowers and a mariachi band. Will be back!", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "It's probably not the best idea to sit in front of the kitchen when you're hungover and starving for a meal, but that's what I tend to do EVERY SINGLE TIME I'm here. And I'm typically only ever here on Sunday morn--erm, afternoons after a night of moderate Saturday night partying (at least moderate in comparison to my 20s; I'm old).\n\nThere's never a line and we're always waited on almost immediately. A swirl of Spanish words are yelled above me as I'm served some tap water and a cup of burned coffee. It's OK, though, I don't come here expecting a cup of Rwandan coffee from Verve accompanied by lemon-curd blueberry pancakes. I just want something warm to sip on while I wait (in agony, remember the kitchen directly in front of me?) for my scrambled eggs, bacon, and a side of pancakes. \n\nOnce I've managed to scarf-down everything, the kitchen becomes a TV show I'm happy to watch. Bacon rows flipped at once, pancake batter dripped onto the hot stove, bread being toasted to create massive sandwiches. Which reminds me, those babies look incredible, and I keep telling myself: \"next time get a sandwich, next time get a sandwich,\" and each time I'm here, all I want's what I always get.\n\nThanks for not judging me (or silentlly doing so) and for being there, Mission's Kitchen.", "author": "Adena B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-10", "description": "I have passed by this place several times before on Tuesdays before I go to Dance Mission to take hip hop dance classes. Last Tuesday after work I came here to eat for dinner. As you go inside the decor reminds of you diners in the 1970s and 1980s. I didn't want to have a heavy meal. I ordered two items: Queso Fresco and Mission Omelet. The first item is fried cheese similar to fried mozzarella sticks. It was sort of salty maybe because the cheese itself was salty. The second item omelet consisted of chorizo, mushrooms, and ground beef. What I liked about this omelet was it wasn't heavy as other omelets I've had in the past. Nothing spectacular about my meal but overall I had a fulfilling dinner.", "author": "Gerald R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "The lemon salmon was delicious and felt home-made. I was glad to have given this place a shot. Definitely I will comeback soon.", "author": "Sa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Great for breakfast. Not like the hipster places in mission, there is not a huge line. It's pretty laid back diner style and service is fast.", "author": "Sal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "My friend had mention to me this place for breakfast/lunch. She once brought me Chilaquiles for breakfast to work and they were soo good. I had to go and get some more. I have there chilaquiles and also there club sandwich. Friendly staff, good food and cheap :) \nYou can call in your order before going to have it ready to eat when arriving", "author": "Silvia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "I'm in love with this place - the food is solid, the portions are huge, the ingredients are fresh and they cook to order. Best of all, it always has a friendly vibe and the staff are THE BEST. So welcoming and friendly, efficient and attentive. \nPerfect for a weekend breakfast, a greasy brunch after a few too many, or whenever a craving for 4pm pancakes/chilaquiles strikes!", "author": "Tennille D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Red Cafe was full so we walked down Mission and found this place. It is the best Mission breakfast around. We ordered chilaquiles (excellent); huevos rancheros (amazing) and the Central American plate with gallo pinto and plátanos - so good! We will be regulars here now. Very nice service too!", "author": "Arienne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Fantastico! \n\nIt's all good. Their breakfasts are pretty lunchy too. \n\nNote to self:  \"Chilaquiles and steak. Mild! Not Spicy.\"\n\nLove this place. Huge breakfast. \n\nTastiest in all the Mish.\n\nextra text here so it pads out into an actual review ....\nextra text here so it pads out into an actual review ....\nextra text here so it pads out into an actual review ....\nextra text here so it pads out into an actual review ....\nextra text here so it pads out into an actual review ....\nextra text here so it pads out into an actual review ....\nextra text here so it pads out into an actual review ....\nextra text here so it pads out into an actual review ....", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Only come here on weekends and the atmosphere is great - busy, but rarely a long wait - a throwback to what the mission must have been like 20 years ago.  Everyone is Hispanic.  Mariachi band going off at 9am.  Waiters yelling out orders in Spanish.  No hipsters.  Go!", "author": "Rob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "The first thing you need to know is you are in the center of the Mission District and the vast majority of the stores are not corporate yet.    I read the prior reviews and understand that you need the mind set that you are having a meal in the heart of what is left of the Mission.  We both had the Mission scramble and it was all that you could ask for.  A very meaty center with home potatoes and corn tortillas.  This is one of the most authentic morning meals I have had in the Mission in many months. Prices are very fair for the quality of food.  This is a down home place with solid product. Those who bad mouth this place want a three star meal at less than one star prices.  This is authentic Mexican food for all its advantages and faults.  Diet plate it is not  but comfort food it is.", "author": "michael b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "Coffee and Huevos con Chorizo, $10.80 after tax.  Good serving size, and pure deliciousness.  It came with rice and beans, and a tortilla (I chose flour).  The coffee was alright, but the chorizo was pretty good.  Not very greasy like I'm used to, but great quality. \n\nBeing a 6'7\" giant that I am, I normally have to find a local farm to eat some of their livestock in order to feel full. Not here though, I left feeling fat and happy, ready for the days adventure.  \n\nThe service was great and they kicked on some jams at 9:30 a.m.  I guess before that everyone is waking up and doesn't want to hear music.  9:30 hits, bam Michael Jackson in your face, start your day mo'fo!\n\nI will be eating here again.", "author": "Tarun B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Mission Kitchen has great food. And, the staff is so friendly and on top of everything...especially Luis and Carols. They are the best!! I highly recommend this restaurant.", "author": "Dorothy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-03", "description": "I've gone here several times. The servers are really kind & friendly. However the food really lacked potential. All the Mexican kind of dishes were great. The American food though really was just horrible. I asked for a sirloin steak well done & I was given a almost raw steak. Just horrible.", "author": "Cesar G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-22", "description": "3 stars for the good food. If it werent for that they would get 0 stars. My son and i waited like 15 mins for them to give us a menu while another table got theirs right away after seating down and they walked by us so many times and not even a, \"have you guys been helped?\". Nothing. They were too busy chit chatting with each other. Until 15 mins after when they noticed we were just seating there. Didnt even apologize. And im being generous with 3 stars here.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "Pass by here and just have to stop the food is so good me and the wife will be coming here again real soon....don't sleep on this place", "author": "Icanonlybe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Since this is in my neighborhood I've been here plenty of times. It may be a hole in the wall type of diner but it has Central American/Mexican fusion meals that are perfect for a hearty breakfast, lunch, or dinner. The portions are are pretty big so I highly recommend this place if you are STARVING. The service is a family feel environment and they make sure you are well fed and your thirst is quenched ! Being of Central American decent, I get that authentic comfort food and my hunger is MORE than satisfied !", "author": "Angelique G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "We sat across each other in the same booth every time.\n\nThe servers recognized us each visit; \"More coffee?\" They'd ask.\n\nHe went for the mole chicken a lot. I chose different breakfast entrees every time. Huge portions for a reasonable price in the city (under $10 for most!)\n\nHighly recommended: French toast served with sliced fruit on top. Lovely bit of vitamins on decadence.\n\nWe could sit here for an hour or two, talking about immigration politics, our friends' lives, or checking our iPhones for updates.\n\nGreasy spoon diner, but it had a lot of charm for us.\n\nI will always treasure the moments spent at Mission's Kitchen.", "author": "Helene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Best chilaquiles ( fry corn tortillas with green salsa or red tomato salsa ) with over easy eggs good coffe and u can add carne asada", "author": "Paco T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "I love Mission's Kitchen. They're not overpriced, they have a nice array of breakfast foods to choose from, and the service is great. Everyone's really friendly and the food is served relatively quickly for a busy place.\n\nTheir spin on traditional egg dishes is really fun too. Their Mexican frittata is great, though watch out for the jalapenos if you're not one for surprise heat in your morning meal. Most (if not all) breakfast dishes come with a meat or potato side and a bread (either a tortilla or sliced bread, in most cases). The hash browns are my particular favorite.\n\nIt's an unassuming, not-too-big-not-too-small kind of place. I'm definitely a fan.", "author": "Jiordan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Great food, lovely people, big servings, and bargain prices. Their steak chilaquiles are amazing, and so are the Denver omelettes packed with ham, and the chorizo frittatas covered in cheese. They have good strong coffee and generous stacks of pancakes if you have a sweet tooth too.", "author": "Nik Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "This place is really good. I got the salmon BLT with onion rings and was more than satisfied. Waitstaff is really nice and food arrived quickly. Seriously recommend this place!!!!", "author": "LS J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Absolutely hands down good food and for a reasonable price. Me and my boyfriend always eat here and the bill ends up being cheap", "author": "Emily A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-16", "description": "Went here b/c Pollo Campero had a line around the block. The waiter was so nice. Very homestyle food. Big portions. My salmon was tasty.  Sat at the counter like the old days.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "Restroom door is heavily defaced with graffiti.  Graffiti needs to be cleaned off the door.", "author": "Victoria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Great staff, good food. I usually do breakfast at least 2 times a month here. Food can get greasy though depending what you order. But overall the service is quick, the cooks hustle. I do miss the 2 guys that used to cook Sunday mornings, but the new cooks are ok. Oh and the 2 beautiful and very friendly waitress's that \"USED\" to serve there. So guys no need to be running there now, them 2 women are gone!!!  lol", "author": "Eric N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-01", "description": "We attempted to eat here today and a very nice waitress took our order and drinks and did mention that it would take a little while for the food. After about 30 mins and our sons saying they were hungry about 15 times we decided to see what was going on. Meanwhile the two ladies that came in after us had their food and somehow ours was still two tickets away from being cooked. We decided to go elsewhere since most places can serve up an omelette in about 15. We will not be going back which is too bad because the food is good. We got our drinks for free at least.", "author": "Maria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "I am a regular.  I love my amigo Chefs that always prep me a wonderful meal.  It is an old school diner.  I ordered many dishes from their burgers, breakfast burritos, Latin dishes -- they never failed me.  Every dish I ever had gave me a #mouthGASM \n\nI def would recommend this place to anyone who loves to eat at diner type places & would enjoy a meal for a good price.", "author": "Jennifer E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "#Boom.  Great greasy spoon. Want St Francis quality without the handlebar mustache or the goat cheese scramble? Come on over, spend 1/3 less and leave happy.\n\nI'd be here daily if my health wouldn't suffer as much as it surely would.\n\nDo it.", "author": "Ian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "Am I the kind of girl that will swoon and fall in love with the first diner that brings me a pitcher of sweetened condensed milk?  Yes I am.  They brought us an entire pitcher of sweetened condensed milk.  OMG.  I did not know you could put it in a pitcher.  Yes, I think I am in love.  \n\nThis place is super cool, you walk in and you are greeted by a painting of a chihuahua (Chico! Chico! Chico!) and a warm hearty welcome.  The staff are all super nice and the food comes promptly.\n\nWe had juevos rancheros and french toast - you get a pitcher or syrup and a pitcher of condensed milk for your french toast (and for pancakes too).  The food was good and plentiful, filling up the giant plates it is served on.  The prices are reasonable and the atmosphere is relaxed, no wonder they attract a diverse crowd.  \n\nLove it!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "First of all parking is hard to fine.\nMission's Kitchen is a great place to eat breakfast and lunch. The pancakes, burgers, and omelettes are well made, has Mexican breakfast as well. Not to pricey, service is good and friendly. When the place gets packed watch out because the waiter might forget about you. Overall food is fantastic", "author": "Monserrat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-08", "description": "I've been here twice now... And the food and the portion sizes are great.  The price is also easy to manage,  imo you pay about the same price for a combo meal at McDonald's that you would here.  But the service,  frustrating.  I usually base my service on my water... If it's empty and I gotta ask....  You've been ignoring me....  I had to ask here and didn't get it refilled until After I was done eating.  Not sure I'll come back again,  even with the delicious food they have.  If you go.... Expect tasty food but slow, unattenetive service.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "I've walked by this place a thousand times and never took note of it. Well, I should have. \n\nThe prices are great. The service is great and extremely friendly. And I loved the chilequiles! I became a fan of that dish while vacationing in Puerto Vallarta and I was overjoyed to find a local restaurant that faithfully prepares it. \n\nIt's a diner, so it don't expect fancy decor.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "I'm giving these guys 4 stars because they're everything a breakfast place should be. This is not because the food is going to blow you away.  That said, I got a bomb waffle with fruit, eggs, and bacon, and it was all greco.  \n\nI always feel comfortable here, and I think that's the most important thing in a breakfast place.  The waitstaff are just on top of their shit!\n\nNo line, plenty of seating, great prices, and prompt service.  Please go.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "The enchildas were the best! OMG! Make sure you get them spicy! The place is a bit outdated but the food makes up for it. Really funny waiter I wish I remembered his name. I went 2 days in a row for those enchildas. They were just too good!", "author": "Betty R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Good diners are a rarity in the Bay, but Mission's Kitchen is the real deal. It doesn't have a huge menu, but their breakfast options are quite plentiful, not to mention yummy -- there's a definite focus on Mexican cuisine here, which suits me just fine.\n\nI ordered the chilaquiles with the spicy salsa and MAN they weren't kidding about the spice! It was so good, though, that I just had to keep eating, despite the fact that my tongue was practically crying.\n\nService is very adorable and friendly, portions are plentiful, it's cheap, and, most shocking and awesome of all, the place was not overrun with hipsters despite its location. Dy-no-mite!", "author": "Vandana M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "love this place but they lost there touch and the service/waiters sucks now of days.....\n\nWith My Friends Enjoying Good Food....\n\nBack Again\n\nCheeseBurger Time....\n\nGood Place To Have Breakfast With Friends/Family....\n\nGood Food....", "author": "Tee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "The servers here are so friendly and have great attitudes. The food is always really good, with really generous portions.  I've tried so many things and loved them all. The Mexican omelet is like a burrito inside egg instead of tortilla- the beans are really good. The frittata is always super bomb. Sweet things like waffles, pancakes and french toast are great- they come with mounds of fruit on top and either syrup or yummy Lechera. I have no complaints about this place at all.  Oh and somebody said they use RC cola- I beg to differ, it's Coca-Cola. Come here for cheap in price, good in quality food, a fun atmosphere, wonderful service.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-22", "description": "The food was alright. Nothing to drool over. The waiter had some complications and didn't really help until the end of the meal. Wish the service could've been a little better. Though I wouldn't let this discourage me but I don't think I'll be coming any time soon", "author": "Oscar C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "Understanding that this is a very casual diner, how is it possible to hate on this place? You've got comfortable seating, a very friendly staff, great food portions and extremely reasonable prices. A breakfast here will run you approx. $10 and you will be well-fed.\n\nIt's also kind of cool how the indigenous Mexican population seamlessly eats side-by-side with the dot com crowd. \n\nYou'll definitely want to get to know Mario (among the rest of the wait staff); he's awesome.\n\nThis is not a place where you would expect farm-fresh or organic fare. But if you're looking for a fun, casual, inviting atmosphere with generous portions at reasonable prices, then look no further than Mission's Kitchen.\n\nAnd you can trust me on this one; I'm an Elite. ;)", "author": "Sebastian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-26", "description": "I had some time to kill early on a Tuesday morning while I got my oil changed at B&W. I was hungry so I decided to take a walk and find some breakfast.\n\nI was originally going to go to Boogaloos but then happened upon Misson's Kitchen which looked clean and inexpensive so I figured I'd give it a try\n\n I sat down at the counter and ordered a frittata along with hash browns, toast and coffee. I really like that the food is all cooked right behind the counter - being able to watch it be prepared makes for a better dining experience . The service was friendly and the food was decent for the price.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "This place has one of the best breakfast plates I've ever had.  The Central American special is to die for, fried plantains and a rice/ bean mixture that is unparalleled.  But the best part is the block of fried cheese, yeah a block of fried cheese! Unreal good.", "author": "Denver R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "I love this place so much, it took me a long time to write a review, partly because I am selfish and I don't want to have to wait in line once people hear the buzz about it, visit and realize how amazing the staff, food and prices are! And partly because I didn't want to rush and write a half-ass review, Mission's Kitchen deserves better! \n\nAnyhow, the story goes like this: I used to be a Red Cafe fan, but my friend Curt always said \"Mission's Kitchen is better\" and I totally shut him down (yes, I can be a fascist) and thought he was cray-cray, however, one day he finally dragged me to Mission's Kitchen and since that day, I haven't been back to Red Cafe! Why? Because there is no reason to! I can have an AMAZING Latin breakfast for $2 less! \n\nI was irritated that Curt failed to mention that:\n\n1) They have cute waitresses!\n2) They have a jukebox!!! (I LOVE jukeboxes)\n3) It is freaking cheap! \n4) The portions are massive\n5) It's ran by Latinos, frequented by Latinos and they play Spanish old school music\n6) They have an entire Latino breakfast menu (huevos divorciados, chilaquiles, huevos rancheros, Mexican frittata, Central American breakfast)\n7) They close at 10pm, which is a fucking rarity in this side of the Mission\n\nIt's been a few months and the honeymoon stage is still going strong. By now, Cristina, Lourdes, Miguel and the rest of the gang are part of my food family. \n\nNow to be completely fair, if I could change something about this place would be their drink selection, I wish they had fresh squeezed oj or at least Martinelli's apple juice because I dislike fountain drinks, but really, once I see my delicious huevos divorciados or beautiful chilaquiles (for $6.95!!!) I no longer care about my beverage, because by then I feel sorrounded by family, eating at home.", "author": "Anabelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "so this place is legit, my friend took me to this place and it was supper authentic hood breakfast. the price was great, the food was very homemade and fresh.\n\nif your around this place please go and support this local business", "author": "Noel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "From the outside it is nothing special but once you enter you are greeted by the warm and friendly staff. We sat at the counter for breakfast around 8am and there were only a few other patrons around. The server recommended I order the chilaquiles for breakfast and I am so glad I did. They are delish but fair warning: it is a heavy dish so definitely wear your stretchy pants and maybe take a spin class beforehand to offset some of the guilt :)", "author": "Meg H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "The food is very good for breakfast, however the staff is very poor in terms of attention to detail.   Order steak and eggs and they serve pork chop and eggs instead :-!  What is wrong with you people", "author": "Rey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-12", "description": "Great lunkfast spot.  Half Mexican restaurant, half greasy spoon diner.  \n\nBest Chilaquiles in town!", "author": "Tod G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-12", "description": "I have been going to Mission Kitchen since they opened ,  my family have been  loyal customers here ,  and havent had a problem until this past wekend .\nWent to have breakfest with my husband on a sunday morning , and of course we decided to go eat at Mission Kitchen , we talked about goinng to other places , but my husband loves their Plato Central Americano so much that we ended up at  Mission Kitchen . We get there and we are greated as usual , and a table was cleaned for us in less then 3 Min , waiter takes our order and brings us Coffee and Hot chocolate , couple min later our food is ready and placed on the table . As we our eating close to finish my husband noticed a hair in his rice , so as anyone else would do , my husband lets the waiter know and shows it to him , the hair strand was thick and black , who knows if there was more in the rice . So as regular people we didnt make a scene and we didnt make a big issue about it , so the waiter says \" we will make you another plate \" , so we where ok with that , we waited less then 5-10 min and he arrives with the second plate , then he proceds and ask my hysband if he would like toast  , and he said yes , white pls .... as we seen the menue many times and since we order the samething everytime we go there , we know preatty much the price and what our order comes with , my husband couldnt finish his plate , and i was preatty muh done with my plate we where just about ready to pay and be on our way , well as we are waiting pateintly , husband ask for coffee , and for some odd reason the waiter is tottaly ignoring us and from this point , it just looks like we where not cared for anymore , he ask another waitress that was at the cash register doing nothing for coffee and all she does is calls the next waiter to serve us , and he never came as well , so my husband and i decide to get up and pay to and be on our way , well it took them 5 minutes to notice that we where leaving and the waiter quickly gets the bill ready , AS AM REVIEWING THE BILL I NOTICE AN EXTRA CHARGE , i tell him that , that was not on our order , then he gets a lil red and says to me that he charged 2.95 for extra toast , then i said well the bill doesnt say \"toast\" and when did we order extra toast ? , he told me that since he had to make another plate , he had to charge for extra toast , but keep in  mind there was a hair in the plate , and the plate comes with toast , so i left it alone and piad the bill, well my husband wasnt to happy , and goes back in and lets him know that the plato centro americano comes with toast and why would he charge extra ? ,  well he says , since we didnt charge for the second plate , he charged for the extra toast !!!!! What !!!!! you still have the nerve to say \" we didnt charge for the second plate \" when there was a hair in the food , you have to be kinding me , i think if he would of never try to charge for extra toast i would of left ok , but after finding a hair and being ignored after the fact , yeah i think anyone would also be upset", "author": "L P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "Greasy Spoon Diner + Latin Flavor = Mission's Kitchen.\nCountless times I've plopped my hungover ass at the counter, been greeted with a cup of coffee, and indulged in chilaquiles mole poblano.  The servers are friendly, the service is FAST, there's a ton of American and Latin breakfast items, and you can eat and drink and barely break double digits on your bill.  Viva Mission's Kitchen!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-11", "description": "A lady that works there, be careful because she over charges. It's a good place to eat and ummm the prices are reasonable. Just watch out for your bill!", "author": "C G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-14", "description": "Great Food\nGreat Prices\nGreat Service\n\nI really like the breakfast items, especially the chilaquiles.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-20", "description": "A solid diner. I've had breakfast here twice, and both times the food was ready in under 5 min. It was nothing out of the ordinary, but it was hot and fresh, and they kept my coffee mug full. The coffee was also above average. The wait staff are attentive and friendly and polite.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-17", "description": "big breakfast for little dollars. they keep your coffee full even after your plate has been bussed.\n\nget the sausage, trust me.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-21", "description": "Mission's Kitchen is a little joint I stop in at for breakfast. Early opening (open at 7 AM) joints are kind of hard to come by. Closer to the 24th St. BART station than La Taza, and a little cheaper, too. The food is good and comes out pretty quickly. My Chilaquiles were awesome. Clean place.\n\nService was friendly enough, though there's never anyone in there very early. One gripe: This place is not as busy as La Taza, it lacks the \"bustle\" of a diner, and the damn credit card machine never seems to be working whenever I go in there ... grrr ...", "author": "Wes T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-15", "description": "The lines are too long & it's hard to find parking but the chilaquiles of mole poblano are delicious. The woman waitress Lolis or Lolita has no respect, she likes to caress mens face & play with their hair if she knows them & doesn't matter if their couple is sitting their.", "author": "Nancy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "This place is a great spot to have brunch with friends/family. The service is excellent. They're friendly and chipper, of course a bit slow when it's busy. The owner[manager?] is really friendly, he even gave us some quarters to put in the jukebox one time. The food is good as well. I really like the tiramisu that they serve. The omelets and scrambled eggs are on point. Might I suggest the home fries? Those are so yummy!", "author": "Precious Athena P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-27", "description": "The staff here seems friendly enough, and the food is cheap. Apparently it's cheap for a reason. \n\nStopped in here this afternoon for a quick bite. Ordered grilled cheese (asked for cheddar) and a milkshake. I got what I think may have been a velveeta sandwich (disgusting) and what they call a \"milkshake\" is actually cocoa powder, milk, and ice thrown in a blender. ick! Perhaps I ordered the wrong thing, but I'm not sure I can bear the possibility of a meal that bad again, so I doubt I'll try it again in the near future.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "I'm willing to try out all the best breakfast places in the Mission. This place already had me coming back twice.\n\nPrices and portions are beyond reasonable. Service is attentive as expected. Cozy diner feel with wooden seats. Cleanliness could be an improvement, but with the price I'm not trippin.\n\nRecommendations by friends come a long way.", "author": "Cerina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "Mission's kitchen is truly a delight... I recommend this spot with the utmost of enthusiasm. I first tried it about 3 months ago and have been going back about once a week ever since. I've brought at least 10 friends to try it, and the verdict is unanimous: Mission's Kitchen is friggin' amazing.\n\nService is great. The staff are friendly, accommodating and engaging. Definitely service with a smile.  Greasy spoon/hole in the wall/diner atmosphere... but nonetheless inviting.  \n\nThe price is right... less than $7 for a meal that, for all intents and purposes, could sufficiently feed two people. \n\nThe food is wonderful. The chilaquiles are phenomenal. One of my friends said they were even better than his own mother's recipe. Both the spicy and the mild sauces are delicious. Another breakfast treat are the \"divorced\" eggs... although the title is a little off, the flavor is spot on. The mole is sensational. Breakfast burrito is awesome... haven't explored the lunch menu yet... mostly because I'm already hypnotized by the chilaquiles. \n\nYou don't wanna miss out on this place, it's a gem!!", "author": "Keely P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-18", "description": "Huevos Rancheros for $5.50?  Check!  I thought they were a little tomato-heavy, but certainly filling (with good rice & beans), and quite a deal for the price.\n\nMission's Kitchen is a classic cheap diner, and is everything you'd expect of a classic cheap diner.  A mix of counter seating and booths (it's actually fairly large), and lots of bright orange paint.  Is the food great?  No.  But it's dirt cheap, there's a lot of it, and it's filling!  2 bucks will get you oatmeal.  They've got a big collection of box cereal.  They've got box wine.  They've got GREAT bacon (really, considering how ordinary everything else was, the bacon was quite outstanding - pretty thick cut, cooked to just about crispy, with a nice peppery crust on the edge.  Nice!).\nIt's clearly a local favorite with a lot of regulars - about half the people at the counter spent their time chatting with the staff like they'd been best friends for years.\n\nGood, friendly vibe, long hours, breakfast all day... just what you'd want in your neighborhood diner!", "author": "Don H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "Love the waiters, the booths, the prices...usually the food but i ordered chilaquiles with mole and the mole was really bland...but still 5 stars!  They could use a busser during the busy times...", "author": "Kooky B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-21", "description": "This was seriously awful.  I am a huge fan of mexican diners, obsessed with Red Cafe, and figured I'd branch out and try another spot.....\n\nThe reviews couldn't be more wrong.  My central american breakfast cost $11, had inedible bacon (how is that possible!!!!), the gallo pinto was so dry and overcooked it tasted like sawdust, and the cheese was a rubbery rock of fried nastiness.  They even got the plantains wrong - deep fried, so missing all of the essential delicious gooey goodness.  They even got the soda wrong - its not cool to try and pass of RC cola as diet coke - you can clearly taste the difference.\n\nI will not be going back, and I recommend that you don't waste your money as well.  I am sorry write such a negative review because they are nice...but the food was disgusting, and in the mission there are so many more delicious options.", "author": "J Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-24", "description": "When I am destroyed and hungover I crave a simple dinner sammie and a cup of soup with unsweetened ice tea.  I do not know why but it always works miracles.\n\nThey make their own chicken noodle soup so it isn't a consistent flavor and in my opinion that is a good thing (booo the Sysco-fication of food).  It isn't that it is sometimes good or sometimes bad but rather sometimes it has more carrots or sometimes it has more bay flavors.   \n\nThere is nothing fancy or great about the food but it does remind me of diner food outside of Philly or in Jersey.", "author": "MJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "This place is tip top. To me it is one of San Francisco's top spots. Portions are good, large and excellent quality. Bilingual staff and the food is prepared right in front of you.", "author": "Julian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "We love Mission's Kitchen.\n\n1) Open at 7:00 am - you got a toddler, you know what I mean\n2) super nice people\n3) decent food at good prices\n4) kids menu - under $4 if I remember right for LOTS of food\n\nTry the Huevos Rancheros. Not a go wait in line place, it's a want to go out to breakfast, not wait, get some hot food for a decent price type place.", "author": "Megan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "Great local diner with a great staff. The portions are big and the prices are very affordable. I love coming here and ordering the mole chilaquiles, they are delicious.", "author": "Marianna E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "Well this review is long overdue and am sorry for my tardiness.  I truly and highly recommend this spot cause the service and food is superb.  I especially love Carlos and Mario would always provide good service and always check on you even if they are packed.  \n\nThe food is reasonable, delicious and always fast.  I recommend the Huevos rancheros and las chilaquiles.  I sometimes opt for the breakfast special which consist of T-Bone special with enchiladas and arroz y beans.\n\nkudos to La Mission kitchen", "author": "Isis L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-25", "description": "What can I say about you Mish Kitch?  Who else can I turn to when I'd rather eat a giant, grease laden, $3.00 breakfast burrito, and sleep standing up rather than actually work?  Gracias Tio!\n\nI have officially downgraded Mission's Kitchen.  Denada.   Because of the steel wool that I found nestled in my burrito about half an hour ago I shant return.  It only makes me wonder how much steel wool will be caught in my colon for the rest of my life.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "For those weekend mornings when I find myself (either happily or unhappily) alone but still enjoy the thought of someone else making my breakfast, I always opt for joints with counter seating, and Mission's Kitchen makes the grade.\n\nI don't know what this place was before, and I don't really care. It does, however, have the feel of a new kid in school - shy and  a little unsure of itself but at the same time overly eager to please.\n\nMy breakfast was basic, but big and tasty enough to bring me back. On my second visit I ordered something in the south-of-the-border vein, and it was even better.\n\nMy third trip was a nooner - for lunch. A basic cheeseburger. No complaints, but my real reason for going back was to confirm the name in order to write this review (yesterday, I tried searching Yelp for \"Mission Kitchen\" and without the apostrophe s... nada).\n\nI had to explain their own menu to them, which was a funny little adventure: \"It says here that I get a choice of fries, soup, salad or mashed potatoes with my lunch, so...uh...\" But I habla no Spanish, so the response was a blank stare. Another waiter came over and the two of them consulted for a few minutes. Then, with everyone on the same page, I chose the soup.\n\nIt was fine, but I'll stick with their breakfast from now on.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-11", "description": "Friendly service, convenient location, hardly any wait, but tasteless food.\n\nSeriously.  Even their bacon is tasteless.", "author": "Justina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-18", "description": "This place looked promising and my friend was too lazy to walk the extra block or two to Red's Cafe.  Big fat sucky mistake.\n\nThe service was extremely s-l-o-w.  The servers were pretty nice but somewhat inattentive.  Was it because we sat in the nook in back?  Unsure!  I ordered the chorizo and eggs and my friend had the huevos rancheros.  25 minutes later we got some lukewarm food that tasted sort of meh.  You know, meh.  Okay, not wonderful - not even \"ok.\"  If it had been the temperature food is supposed to be served at, maybe it'd be \"ok.\"  Because we were hungry and pretty thankful we finally got something plunked down in front of us, I think we just shut up and ate it.  But I ate mine somewhat angrily.\n\nWould I go back here?  Heck no buddy.  It is cheap so if you're broke and don't care about that which you ingest, give it a go.  You'll understand what I mean.  Next time I think I'll force my friend to walk the extra little bit.", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-26", "description": "I went there one time, 10:29pm on a Wednesday night. Sign says closes at 11pm.   Sign on door says open. We walk in and they say they are closed. \"Your sign says 11pm?\", we reply.  \"closed!\", is the answer we got.  \n\nenough said...", "author": "Elliott J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-15", "description": "Diners, I love you. But you've got to come correct. Little Mission's Kitchen occupies the same space of the long-running John's Diner, a place known for a really sweet hostess who treated you like family and served up eh-OK food. Flipping the script, the food is now really great and the service, though totally friendly, sadly for crap. But with it being an unrepentent diner, and not say another damn celphone store, that's still right around the corner from my house, I want to love M's K more than I actually do.\r\n\r\nMexican and American breakfasts at around $5-6, standard diner luncheS and dinners are $6-10. Huge plates. Delicious home fries. On the minus side, me and buddy-pal watched as our toast cooled visibly in the toaster, an additional waffle never materialized at all. Yet still my Chilaquiles were pretty good (if a little damn too spicy, which I don't often say about anything) and buddy-pal's Huevos Rancheros looked great. \r\n\r\nAs inept as the CS was, I'll be back, if only in the hopes that Mission's Kitchen (Mission Diner anyone?) eventually overlaps their quality of service with their inexpensive traditional fare.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-28", "description": "Great food that leaves you in a coma for the rest of the day. The staff is friendly as they banter back and forth with each other. Not the cleanest, but they fix a mean ass breakfast - worth 5 stars if you like the extra protein of ants in your meal.\n\nChilaquiles are delicious, wanted to add a star, but couldn't bring myself to do it. I just can't abide by the service and Gut Bomb Quality food -- but I love it. It won't lose stars because of it's awesome and \"my office only\" delivery policy. SWEET!\n\n\n/////////\n\nUPDATE: It loses a star for the steel wool my co-worker just found in his burrito. yeah, no shit. Sad thing is, I'll be eating there tomorrow, so what's that say about me?", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "I loved the open kitchen.  When things picked up, watching those two cooks was like watching wizardry...\n\nA three-egg Spanish Omelette with hash browns and toast for $6.95 was wizardry for my wallet...\n\nThis place is brought to you by the folks behind the El Farolito empire.  The prices are great there, too...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-13", "description": "I've tried to love you Mission's Kitchen...I really have!! You're so close to work and your menu sounds so good! You're inexpensive and fast...what more do I really need in a restaurant??\n\nI actually need a restaurant that serves less hair in their food, that doesn't put me into a grease-induced coma for the rest of the afternoon and has less ants walking around the restaurant!  Once all of those issues are addressed, the Mish Kitch might be the place for me!", "author": "Craig E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "Though I only went with the bacon and eggs on my recent trip, it was cooked right and my fellow dinner's chile quiles was amazing (pardon spelling error). \n\nFor the price, it's a  great meal. Simple, cooked right, in a great little diner. Late breakfast and a walk down to 26th and Capp for La Copa Loca has become my new routine when visiting the Mission.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "I discovered this place on New Year's when I couldn't find any other place that was open by my house. I remember ordering the salmon scramble and the french toast with fruit that first time, and I've \"been a fan\" ever since.\n\nWhen I took Kota Bear here for the first time, she ordered the pancakes and they fixed them so that they were shaped like Mickey Mouse's head. I didn't even notice until she pointed it out. Now whenever I watch Kota on the weekends, we have breakfast here almost every Sunday and it's become our spot. I think she's hooked on the Pops cereal :-)  \n\nThis past Sunday we ordered chicken nuggets, Pops, and a breakfast burrito and it all came out to about $13. It's a good deal for all the food you get, but stick to their breakfast. I've come for dinner and it's not as crackin as their breakfast. Decent, but not as good as their breakfast menu.", "author": "EJ S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "The chilaquile sauce is actually spicy. It's a nice place to eat. The gallo pinto is good.", "author": "B A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "good, clean , really friendly service, great for mexican and american breakfast at very affordable price.  great hash browns-crispy, not soggy.", "author": "Anibel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "I like Mission Kitchen.  I give it 3 stars for quality of Food, Service and Atmosphere - an extra star for price.\n\nThe food is pretty standard diner fare for San Francisco, but offers several nice hispanic twists.  I am a big fan of the Chilaquiles (fried tortilla chips with eggs, green salsa, and peppers).\n\nThe service is mostly attentive and very friendly.  I love that when leaving the whole restaurant - line cooks, manager, and all say goodbye.\n\nThe atmosphere is standard diner booths/counter.  Clean, a little snug in places, bright and not too loud.\n\nOverall, I think it is a 3.5 star spot.  The low menu prices are a big draw for a filling breakfast in a respectable neighborhood restaurant.", "author": "Jeffrey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "its a decent place i like the sandwiches and the chilaquiles i would always go with a friend and we used to have a really good time i would recommend this for breakfast/brunch and lunch", "author": "Cari O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-13", "description": "I've only  experienced this place during the mid to late hours of the morn, and although a good compatriot of mine, had some steel wool in his burrito, it didnt stop my other good buddy Mr. Temby from taking a good taste of that wool himself. Whats in question is the contents of that burrito, NOT repeat NOT the taste and quality. My friends, the quality of this break fast burrito is glorious. its everything you need for a good belly ful of morning jumpstart AND THEN SOME. I cant knock it for the price nor the contents, its a hand in hand thing. i recommend this spot if you are looking for a good place to have a cup o joe, and good bfast delight.\n\nThe reason its 2 stars shy of perfection, for obvious reasons, im a tough critic and the crew that runs this place are a bunch of clowns, no the haha kind but the kind that you have to repeat your order 3 times and show on the menu. Point and Click.\n\n*they ask a small corkage fee for Colt 45's with partys 2 or more*", "author": "Joe J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "Friendly service, good food and affordable prices, deducted 1 star for it being slightly untidy.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-28", "description": "I love the chilaquiles!!!!!!!! Friendly staff, great place  to start the day, but dissapointed about the oj, I'll stick to coffee ... But everything else great", "author": "Karen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "Very friendly & attentive service & just a half-block from 24th Mission BART.  Now that Herbs Fine Foods up the hill on 24th St is closed this is my fave greasy spoon cafe.\nFood isn't great, but certainly not objectionable, and the price can't be beat.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "Solid. Not fancy, but always good. I haven't had a bad brunch there yet, and i live around the corner. The Central American breakfast is my fav. And love the sweetened condensed milk with my pancakes. The prices are reasonable, and the service is tops.", "author": "jenny s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-09", "description": "Ideal location, filling greasy american breakfasts, cheap and best of all, in addition to the traditional syrup option they have leche nestle! (carnation condensed milk) to pour on your pancakes. Super delicious and friendly service. \n\nhttp://www.sailusfood.com/wp-content/uploads/carrot_milk_pouring.JPG", "author": "pati m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-04", "description": "In my book, if the service is great and the food is cheap AND good, then they deserve 5 stars. The huevos rancheros and chilaquiles hit the spot. I'm definitely coming back!!", "author": "Patty G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "Top ten Diners in SF as far as I am concerned. It's clean, the service is great, they have satisfying cheap food and it has a great diner feel feel. This is one of my favorite spots for a good breakfast with coffee for under $10, with tip!", "author": "H. Joseph E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "Your food comes fast, the service is friendly, and it's great prices for the large quantity of food you get.  I LOVE the centro-american breakfast, it's awesome.  3 plantains, eggs, rice & beans, toast, fried cheese, and bacon for $8.  Totally delicious.", "author": "C B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "The food's actually two-stars worth (chorizo and eggs), but the low prices, having breakfast available anytime, and great service earn it the third.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-30", "description": "I was craving pancakes, went here and got the Pancake Special for $6.95, which includes 2 pancakes, 2 eggs, and 2 bacon or sausage. Not bad at all. I think it's a decent and convenient choice as there's not really any conventional breakfast places in the area. Totally satisfied my craving.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-11", "description": "Such wonderful service - always with a smile and accommodating.  Very clean.  Food is great.  I like the huevos rancheros a lot and my friend ordered the sausage - the sausage looked great.  Very reasonably priced and a huge plateful.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-10", "description": "Not bad.  The only thing that's pretty awesome about this place is the price.  The food portions are HUGE and the prices are so so so cheap.  However, don't get the Mexican Frittata.  The eggs were super dry and the entire thing was pretty flavorless.  However, I'll always go back because I'm a student and the food is cheap.", "author": "Meh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "just went to brunch here on a saturday afternoon.  the staff was super friendly and attentive, smiles all around.  had the chicken mole enchilada plate which was great.  some of the best mole in the city i thought, a little spice and very complex flavors.  kind of like an old school diner menu with a latin american twist.  would definitely recommend this spot for a chill place to fill up.  the plates were double size and completely full.", "author": "Kato S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-22", "description": "great food @ even greater prices on your table in front of you by the time you are done talking shit about the pork store's chorizo plate!  the staff may not be that attentive to your needs once you do have your food, but at least the \"main dude\" can subdue you with his big ass deer eyes and make you drink your coffee/water like your waiting for the love of your life to come back home... yeah his eyes are that intense!!!!  bottom line...\n\n1.  great food\n2.  great prices\n3.  good service\n4  close to (my) home", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-28", "description": "Overall, good for breakfast. Nicely priced and pretty tasty food.", "author": "ronzilla x."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-02", "description": "I am very dissapointed by this place; I like a good diner but this is not it.  The eggs I had were completed unseasoned and the accompanying potatoes dry and flavorless.  The french dip sandwhich was served with a dipping sauce that was salty and tasted of soy sauce.  The french fries were limp and mealy.  Service was friendly but confused.   Maybe the mexican food is better but with some many great tacquerias around, I don't see any point in trying it.\n\nSFD", "author": "Peter H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-19", "description": "New Years morning this was the only place open that didn't have a line down the street.  The place was packed but we actually got a seat right in front at the window.  The service was excellent and super friendly despite the obvious morning rush.  Coffee cups were always filled and the food came pretty quick considering.  Portions were huge but flavors, well, they weren't really present.  We had to dump a lot of hot sauce, salt and pepper to get things tasting better.  My fritata wasn't cooked all the way through either .  You can't beat the prices either but in the end I can't say I'll come back for such bland food.  If you're looking for a quick, cheap and easy breakfast place this will work but you'd be better off waiting at the St. Francis.", "author": "Troy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-05", "description": "Great service, great, cheap, yummy, big breakfast/lunch. I always get the cheese, mushroom omelet.  As most omelets are skimpy on the cheese this one is always ooozzing with fat. I LOVE IT!", "author": "Mel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-10", "description": "At breakfast, way too much of our two plates came from either a can or a freezer. Nice staff, but a definite no-repeater.", "author": "J P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "This is THE PLACE for huevos rancheros! I came here on Sunday because all the other breakfast places in the Mission were absolutely packed. I didn't think it would be awesome, but I was totally wrong. The three of us devoured our eggs and pounded coffee (Saturday night was pretty eventful) and spent about $10 each. A success in my mind!", "author": "Adrienne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-19", "description": "check out the lady waitress! and they have good burgers too. if you need a place to warm up in the mornings its good too and they have a big menu with good and very affordable food. nothing to complain about! maybe show more skin lady waitress?", "author": "Jim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "Hallelujah! This place has the best value I've found in the Bay Area so far. You can choose among various mountains of delicious \"American\" and Mexican-Central American food for under $6--under $6! I had the huevos rancheros and they were great; my friend's chilaquiles were equally good. Service was quick, friendly, and bilingual. I declare this my ideal choice for a Sunday morning hangover cure.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "its a good ass breakfast place definetly better than toast , , great omelettes and great service , so greasy soo good", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "I love this place! I love that I can get a good hamburger, pancakes or Latin food all in one place for a cheap price.  I have been lucky enough to not have found steel cotton or hair in my food. I have eaten here about 10 times and plan on going back.  The only reason why I did not give it 5 stars is because I always feel super greasy and smells like food after eating here.  The staff is very friendly and the Chilaquiles are awesome. I prefer mine with the sauce on the side so my chips don't get soggy.", "author": "Caroline G."}
