{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "I recently started online dating again and needed to find a casual, no pressure bar spot to meet my Bumble Date. My date wanted to meet in the Mission District, and Mosto immediately came to mind! It's in walking distance to BART and two Muni bus lines, so travel was very easy.\n\nMosto has a great selection of affordable drinks, including local beer, wine, and cocktails. Although I've had their amazing cocktails, including the very delicious Paloma (with mezcal), that particular night I got a pint of the Henhouse pale ale and then a pinto of Modelo Especial. I also love the food and had to get the al pastor tacos--a Mosto must and never disappoints.\n\nWith dark walls and candlelight, the space feels intimate. The music and bustle of people (many friend groups and other people on dates) liven the bar. This place is hip without being pretentious, and I often come here by myself just to eat tacos and drink beer. Happy Hour is everyday from 5-7PM. You'll thank me later.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "May not be the best place for large parties since it's small but everything else about this place is on point. \n\nBartenders are really knowledgeable about their selection, so don't be afraid to ask for a recommendation if you don't know what to get.", "author": "Juan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "This place is a total joke. Chipotle is better. To begin with, they serve tomato sauce with basil and try to pass it off as salsa. Taco bell has spicier sauce packets and possibly spicier ketchup packets. I asked if they had anything any spicier. They brought a tray with 4 metal cups one with chipotle chiles and a habañero sauce. Again, no spice. Thinking it was just me my German husband tried it with the same reaction! It could have at least have been flavorful but again, no dice. I ask again for a spicier salsa and I was handed a bottle of Tapatio. I was happy to finally be able to add some flavor to the flavorless \"carne asada\" I was given on a street taco size tortilla for $5. The carnitas were bland and lackluster. Even the quacamolé & chips were disappointing. How do you screw up those two? The only advantage was the guacamolé was fresh. Congratulations, you got smashed avocados with salt and lime correct, Mr Head Chef. I would assume your last job was working for Chipotle except they know how to make salsa.\n\nThe drinks are expensive and again low on flavor. Instead of calling the restaurant a Spanish word like \"Mosto\" which means \"must\" they should change the name to \"No lo hagas\" which roughly translates to \"Don't do it\" to warn those of us who have had good Mexican food in the Mission to just avoid this over-priced, underflavored lie of a restaurant. \n\nAvoid at all costs, unless you like spending a grip of money on food you could have ruined at home on your own. Do yourself a favor and go a restaurant that looks like a dump and could possibly have roaches in the Mission. They will know how to make flavorful food that will satisfy you. Yeah, Mosto, I would rather risk a food born illness than waste my money at your restaurant again. The Mexican people who work there should be embarassed at serving such mediocre food. \n\nAt least do a better job of cultural appropriation, Mosto owners. I think I can get better Mexican food in Germany.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Team of 12 starving runners show up , hangry as hell, thirsty for good food and a variety a flavor and drinking needs. Started off with complimentary chips and amazingly flavored, citrusy, lightly spiced, perfectly seasoned salsa. Then, they satisfied all of us with meats, vegetarian options, fish, happy hour options, and my personal favorite: amazing happy hour sangria- not sweet and with real fruit in it. They also made a killing at our table with their margaritas and beers. Fantastic tacos for sure and I think we had all their available options!", "author": "Mirtila L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "When I walked in to this place and saw the menu, I felt nostalgic for the awesome cocktail and restaurant scene in D.F. You can tell whoever owns this establishment was inspired by that. You still have some hipster decor you see in SF bars with some touches of Mexico here and there.\n\nI love mezcal and love my Latinx culture and appreciate this place for having so many options. I was really vibing with this place until I noticed other guests freaking out that there was no vodka. In fact, it was a little disheartening. It almost feels like the Mission is still not ready for a place like this and there's misunderstanding with tequila and mezcal. Lol. Regardless, just want to say I appreciate the owner's nod to DF culture and want to come back to try the pulque cocktail", "author": "Lupita D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Great service, friendly and helpful staff. Interesting food and drink creations - for the food be willing to try something new!  Cricket anyone...?\n\nThe tequila or mezcal flights are a great deal.  Both salsas have a kick!", "author": "Stacey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Still got its charm. Management has changed, menu has changed and quality and flavor have only gotten better, prices a litter higher as well. \n\nBeen coming for 4 years now and it used to have my all-time favorite cheeseburger.. menu changed, burger just got better! HOW?!?!\n\n4/5 Crab tostada-  fresh chilled crab meat, crunchy tostada and nice colorful veggie on top, it was really good but let's call it what it is, it's a bite\n\n5/5 Burger, trust and get it, they have now added ham to it and it elevated the flavor\n\n5/5 ceviche is dime a dozen in this area but you killed it with the sauce, its acidic, spicy, savory, sweet, and some tequila? I couldn't get enough\n\nOne burger, a mini tostada, and a ceviche with tips clocked in at ~$55", "author": "Morgan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "We tried to order a couple of shots with our cocktails and the bartenders were really rude to us and promised we could have it and later denied us. They knew what they were doing and it was really hurtful. That was our first drink and they didnt serve us after promising by saying we were drunk. It was pretty bad and i'd never visit a place like this ever again. I hope you'll dont too.\nThe bartenders are the worst.", "author": "Aaditya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "To be fair, I'm not a big fan of mezcal or tequila, but even so I think this is an awesome spot to hang out in.\n\nLittle on the small side, but there are some tables in the back where you can seat a decent size group of people.  Music was not recognizable, but all of my friends and I were a fan of the music choices and pretty much Shazam'ed the whole night away.  Seems like you can order things from the Tacolicious menu (right next door) but we only looked at the drinks.  \n\nCan I first just say that the mezcal menu is HUGE (think 6+ pages)?  It's a shame that you only get the mezcal menu upon request, because I think this is the highlight of this bar.  The servers are huge fans of mezcal and will walk you through this menu and answer any questions you have for the curious mind on mescal (from how it is made to different styles to stupid questions on difference between mezcal and tequila).  \n\nWe were aided by Christian Arizmendi, who was very knowledgeable on mescal and gave us 3 different ones to try (one smoky, one fruity, and one more herbal and vegetable tasting).  He sat down at the table with us with the three bottles and explained the differences between the mezcals he brought.  He even served us one for free, a mezcal de pechuga, which included goat meat drippings.  \n\nAnother cute thing here is that the ceiling is lined with glass jars and you can leave messages (almost like a time capsule) in them upon request (no charge).  My three friends and I did this when we went last time.\n\nMy advice when you come here: order mezcal; not tequila or any familiar cocktail you usually order, but MEZCAL.  Come in with an open mind and pick the waiter's brain a bit and explore the world of mezcal.  Even if you don't like the drink, like me, you at least will walk away impressed by how knowledgeable the staff is on mezcal.", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "The bar is great, the food/prices are perfect has the nice comforting vibe... however I'm giving this a sub-par review, because of the customer service.\n\nThe waiter was trying to impress my friend (female) and completely messed up our order 3 times. A total of 5 of us attended that evening, and it was quite recognizable that he was not going to remember our order as he repeated our order 3 times and still didn't get the order correct. When the items finally came out, we were still missing items. The waiter should have just written the items down, instead of trying to impress everyone on his so called \"memory skills.\"\n\nFinally (the one that really pissed me off), I gave my card to the waiter as he wanted a card to start a tab... but my friend ended up picking up the tab for the table. He ended up charging my card and my friends card. \n\nI am out of town, so I tried calling the restaurant during opening hours to resolve the matter and it keeps redirecting me to some automated voicemail saying the restaurant is closed and to leave a voicemail. I still have not heard anything.\n\n\nUpdate:\nManagement has contacted me through Yelp, and they have been nothing but helpful.", "author": "Justin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Came here for Happy Hour on a Sunday and I was impressed! I had a michelada and a torta that were both on the Happy Hour menu and both were so good. The torta was so fire that I honestly want to go back and get another one. The michelada was also perfect and refreshing. I am knocking off one star, because the service was lacking a bit and needs improvement.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "One star for bartender eyeliner on fleek.  Tostadas kinda too creamy and so salty it covered up whatever naughtiness was left on them from the bathroom.   The cocktails, although vigorously shaken, tasted either too sweet (for an old fashion) or just gross for tequila based drinks.  Second star for closing us out quickly so we could get a decent drink.", "author": "Arthur I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Cocktails are delicious! Tacos, guacamole and the salsas are good.  Place gets packed!\n\nParking is tough if you are driving in otherwise take a car service. Preferably Lyft lol\n\nHappy Hour 5pm-6pm. Small menu.", "author": "Joel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Came here after dinner for dranks. We ordered the 'Mucho Gusto' and a margarita. $12 and $11 respectively. They also provided us with complimentary salsa and chips which I thought tasted pretty good, not that spicy but still, pretty good. The service for this spot was great but I did come at an off-time and also, it's a bar. I appreciated that they gave us a heads-up they have to take away (alcoholic) cups after 12:00AM so we knew we had a timeline to finish our drinks and we weren't getting our drinks snatched away suddenly. Overall, got a chill buzz and thought it was a nice spot for a conversation over drinks.", "author": "Jan Kirby Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Came here for happy hour a couple weeks ago. It's a rather weak happy hour menu. \n\nThe margaritas were middling. They weren't the best but also weren't the worst. \n\nThe self-defined \"home of the pastrami taco\" sounded gross. After trying it, it may have been the best item I had on the menu. \n\nThe tamales were really good. And the tacos al pastor were also pretty good. \n\nI guess there's a reason they're the home of the pastrami taco. Get it if you come here!", "author": "Nick D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "This place was pretty good overall.\n\nI liked the atmosphere, our server, and my spicy margarita. I LOVED the two house sauces. We ordered three things but the taco al pastor is the only one I'd definitely get again. \n\nI tried the crickets just to expand my horizons...boring and not good. The ceviche was tasty but TINY for the cost. I think I had three small bites sharing with a friend. :(", "author": "Tanya W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "I really had high expectation to this place. There are probably 10+ taco places in this block.  I expected this place to stand out among others.  \nThe atmosphere and service is good.  It has a cute cozy outdoor seating area with heaters. \nThe reason I give this place one star is the food and drink  I can't say I'm an expert in tacos but these tacos are not delicious and pricy.  If they are great tacos, I wouldn't mind paying a little more.   I thought tacos are so hard to screw up because they are so simple to make and to me this place did screw it up.   Then it's their sangria.   Yet it's another simple thing to make and their sangria tastes like cherry cough syrup.  What more do I need to try?    After I ate here, I went few doors down to get a couple carne asada tacos......", "author": "W C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "The review is based on the mezcal flight, which was pretty good. The food is so-so and a bit limited. Might be better to eat dinner elsewhere and come here for after-dinner drinks. Don't get confused with the store immediately next door, Tacolicious, which shares the same entrance but has an extra glass door to enter.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "The have a big selection of Mezcals and tequilas, the mix drinks are pretty good\nThe tacos: well they are a single tortilla taco, good amount of meet in them, I've tried the pastrami taco and the al pastor, pastrami a bit salty, but nicely cooked, the al pastor was pretty good.", "author": "Ulises R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Delicious happy hour margs and food at an amazing price. Everything was fresh and flavor forward. Kindof hilarious that people use this as a spot to wait for their tacolicious table, because tacolicious is very bland by comparison.", "author": "R D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "We came here looking for a bar with AC during the heat wave. The AC was great and the margaritas were delicious!", "author": "Kaitlyn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "Drinks were okay here and food was tiny! On top of that, service was below average and it wasn't even busy. I can appreciate nice places to eat and drink but when it's actually worth the cost. Given that there are so many amazing places in the mission, I wouldn't recommend this place at all. I ordered the squash bottom quesadilla just to get a little food with my drink and I essentially paid $5 for the tiniest food I've ever seen.", "author": "Mallika G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "+ You can order off the tacolicious menu \n+ There's typically seating here so unlike at tacolicious (which can have a 1-2 hour wait), you can sit down pretty quickly\n+ Good tequila cocktails", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-05", "description": "Shitty service. Only go here if you want to wait an hour for a 4 inch wide quesadilla. Only two servers for both the bar and table tops. Get a new manager or something because your obviously only in business because of tacolicious being your sister restaurant.", "author": "Carly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Good cocktails, good tacos and good vibes. Their pastrami tacos is better (and bigger) than the al pastor! Also try their cricket tacos!", "author": "Reiko P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Stefanie C. and I went out for a drink and catch up session. We found this place which seemed pretty popular and new (less than 200 reviews at the time of writing). We came early - probably around opening and there were plenty of open seats. \n\nI ended up getting this delicious watermelon drink - really refreshing and delicious. I'm a super fan of it - that and tequila. The place is well known for its tequila drinks as well. \n\nWe ended up sharing a pastrami taco since we both couldn't resist the delicious smell of food. It was delicious - definitely something to get if you're in the area, great new spot in the Mission. \n\nProtip: get a drink and a taco!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "4.5 stars. I was meeting up with Nina Y. for cocktails and a catch up session. Mosto sounded like a relatively new and hip place to visit so we tried it out. I didn't realize it was somehow associated with Tacolicious next door. We were here on an early Sunday evening, and the place was completely empty, so we seated ourselves at the bar.\n\nI was in the mood for a spicy cocktail, so the bartender recommended the Esposas. I didn't read the menu carefully enough to see that it's basically orange juice with chile powder. Spicy screwdriver, if you will. I'm not the biggest fan of orange juice in my cocktails, so that was a fail on my part, but the drink was still very tasty.\n\nAlso, I could not resist the smell of food at Mosto. Even though I was about to go to dinner elsewhere, I read about their pastrami taco and told Nina that we were going to split one. OMG SO GOOD. Definitely going on my list of foods that one must try in San Francisco. What a genius idea!! Would highly recommend Mosto if you're looking for a new spot to hit up in the Mission.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-14", "description": "We ordered four​ different tacos. They were just OK, nothing exceptional. We had Sangria, Michelada and margarita. Margarita​ is their speciality​ according​ to the waitress. However​, I did not find it to be special or different​ from any other Mexican restaurants. Sangria was ok, but both, Limon and Papito have better sangrias. Michelada is just not something I would ever order in any place. My friend had to return it and got the Pomegranate​ margarita instead; It was not great either. The​ service was good; The waiters were nice. Will we go back or recommend this place? Probably​ not. I think that Papito in Hayes Valley is much better.", "author": "Sophie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "This is a pretty cool, albeit small, tequila and mezcal bar with a nice range of drinks and a limited food menu. The Cha (mezcal el silencio, pamplemousse rose liqueur, lime, blueberries, sage) was perfectly refreshing and everything I needed in the 100 degree heat; I was less impressed with my date's Daquerita, but it was still a good cocktail. I love a small bite menu and their Botanas menu contains a nice variety of items, but the two items we tried were pretty sloppily put together; my Taco el Califa (nopales taco) was a bit bland/unseasoned (it definitely needed help from the house sauces) and while my date didn't have any complaints about his Chicharron Quesadilla, it basically looked like somebody folded a baby tortilla into a sno-cone-style cup and dumped a tiny bit of pork and cheese into it. The service was good and I'd love to give their food another shot to see if it's normally better; even if it's not, I will definitely be back for many more Chas.\n\nI also noticed that yelp and google incorrectly listed the website for Mosto as t-licious' website, but was able to find their actual website (mostobar.com) via their Facebook page.", "author": "Aly P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "I'm by far no tequila expert but this bar will turn me into one. Good thing I don't live in the Mission, otherwise I'll take me a week and I'd tell you everything about that devilish liquor in one single Yelp review.\n\nMosto is a small bar (literally) next door to Tacolicious. They managed to squeeze a bar, a kitchen corner, a couple of tables and seats, and about 1000 glasses that hang from the ceiling into one single space. It's dark in there, almost mystic, definitely intimate. Bartenders are friendly and drinks are strong. What else do you need.\n\nDon't go there if you're hungry - while the tacos are super small and expensive ($3), the best value you'll get is probably the CHEESEBURGER ($6) which has a nice twist to it. \n\nLiked the burger, not the tacos. And hail to the drinks.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "It's a Tuesday night. Not busy by any standards. Our server forgot our order and did not order our meals until we asked about them half an hour later.", "author": "Jet C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "We bought a $21 per person deal ($54 with tax and tip) from Sosh.  The deal includes 3 tequila cocktails tasting and a taco.  We ate before we got there since we were just getting one taco and can't really drink on an empty stomach. We went in, told the bartender that we were with Sosh and were instantly seated at one of the bar tables against the wall.  The decor was interesting and it wasn't too loud in there.  We were promptly given the menus and a few minutes later, were given our first drink.\n\nI thought the first two cocktails were good, but not very inspired. They almost tasted alike. I could not really discern the St. Germain from the second cocktail. My husband and I did not like the third cocktail (Tomato Salad) at all. We've both had good mezcal before (from Acme Bar in Berkeley), but have only had it neat.  The mix just did not work for us.  We ended up not finishing it. \n\nAs for food, it was a little ridiculous.  The al pastor taco was miniscule, maybe 3 inches in diameter. Might as well charge more and make it a bit bigger.  My husband had the pastrami taco which was more expensive but it was bigger.  He liked it as he is a big pastrami fan.\n\nService was fine, though it would have been nicer to have had the drinks explained by the bartender/server.  I really liked not having to deal with the bill.  We've done this before using Open Table and found it to be convenient. \n\nAll in all, we won't be back to this place.  The cocktails were not out of the ordinary except for the Tomato Salad which we did not like, and would definitely not be back for the food.  There are so many good taquerias in the area that I can't think of any reason to spend $2.50 for such a small taco.", "author": "Hazel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "We had outdoor seating for 2. It was in an alleyway type area and had a great vibe with heating. The food was mediocre and the margarita was edible. Prices are also good.", "author": "Ragip U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "F*ckin love this place. It's owned by tacolicious which I HATE, it's the most inauthentic hipster abomination I've ever come across. However, its saving grace is this little tequila bar with, albeit overpriced bottles and cocktails, but delicious bar food. I mostly refer to tiny cactus and cheese tacos they serve. \n\nBiting into one the first time was like traveling back in time to my childhood, when my parents would grill nopales and carne asada for dinner. Brought tears to my eyes. Tacos are served with three different, very delicious, very cute tiny bottles of homemade salsa. I usually end up ordering 10-15 tacos and couple margaritas. Only thing stopping me from ordering more is shame of appearing too gluttonous in front of very nice servers or my dates. That said, I do bring a lot of dates here :) The space is cozy, the staff is chill, good music always playing, and the tacos...oh, the tacos...", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I love this place! Great, interesting tacos-- spit roasted pork, pineapple, vegetarian tacos, huitlacoche, ceviche... delicious small bites. They also have a great list of tequila and mezcal based cocktails and a wide selection of tequila. Their bartenders are very knowledgeable about their tequila and can tell you all about it. Cute decor, the ceiling is lined with mason jars. I often bring people here who are visiting from out of town.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "I love Mosto.\n\nFrom the Tacolicious team, adjacent & connected to the Valencia street Tacolicious.\n\nTequila selection to impress even the most ardent tequila person.  The staff really know their stuff.\n\nIt's a great space.  Tiny, cool, casual & elegant; there's elegance in simplicity.  \n\nI've been to Mosto at least 20 times.  Every time I'm there the tunes are just rockin.  You'll be using that Shazam app.\n\nService rocks.  Both at the bar, & at the tables.  \n\nThey do just a portion of their Tacolicious menu; but no matter.  It's ALL deeffinlicious.\nSerious.\n\nAl pastor tacos?  $1.50.  They rock, but so does everything.\n\nPastrami tacos?  Perfect pastrami fix.  These tacos were way better than the pastrami sandwich I had from Wise Sons.  \nSerious.\n\nThe hot dog?  Fantastic.\n\nI can't be out w friends in the mission & not at least stop by here.  I'm pretty sure that means success for any restaurant or bar...\n\nIn case the constant flow of customers was not enough of an indication.    \n\n5 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "The service was good, but as it got busier the quality of the drinks declined.\n\nWe also ordered the churro and I didn't like it at all. So sad because I generally love churros.\n\nThe chocolate dip tasted like liquified cacao powder. I wish it was sweeter. We didn't eat that. The churro itself was mediocre. I guess because there was chocolate sauce they didn't really sweeten the churro. It tasted like a slightly burned cake donut. \n\n4 stars because our waiter was great.", "author": "Ghia E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Checked out Mosto last night with an old friend and was in for a good time. Mosto is a teeny little tequlia bar that is squeezed in right next door to Tacolicious (which I need to try) and is a great place for late night drinks. The place is small, dark and intimate and pretty loud, but I loved the vibe and the music. \n\nI had the little devil and a margarita- both delish- not too sweet or too strong. I wouldn't bring someone here for a first date or come when you're really hungry, but this is a great place to have some great drinks and enjoy the night.", "author": "Melissah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "A fancy bar on the mission, really nice decor, but service might be slow on a Sat night. I had the unfortunate exp of havinga very drunk bartender. I am sure he would have been a fun guy on the ither side of counter, but not when he was mixing drinks. \n\nIt took a while to get his attention, another long while for him to take the credit card and process the situation. After 10 mins with the card, he comes back asking whether to charge me for the drink that the dude beside me had.\n\nThen it was a pain explaining to this really drunk bartender that I was not paying for him. Not a very good exp when you try to go for a drink on Sat night.", "author": "Sourav C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "The mezcal drink had cardamon which was not my favorite. The service is painfully slow. The bartender was too busy trying to chat up some chicks at the bar and could care less about taking drink orders. Super crowded on a Friday night and a narrow bar.  We ended up getting a table and the waiter took our drink orders and then forgot them.  Painful.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-10", "description": "Very disappointed with follow through of service.\nMy friend and I went to the bar while awaiting our table at Tacolicious. We each ordered one $12.50 drink. The check came and Wayne accidentally charged both of our credit cards $60.27 (quite the tip!). He reassured us that he cancelled both of the charges and that we should see a credit on our cards. My friend promptly received her credit but mine never showed. Three days later, I spoke with Hannah, who also reassured me that the charge would be credited and tends to take about 5 days. 5 days came and went and the charge was still on my card. Over the course of 2 weeks, I have left several voicemails but none were returned. The card still exists on my credit card. I understand that everyone makes mistakes but the mistake here was lack of follow through. Great drinks but one of their drinks is definitely not worth $60!!! BUYER BEWARE!!!!!", "author": "Erika N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Epic Torta!\nAfter a weary day of walking ten miles and being treated as a tourist (ok, I AM a tourist, but still), I stopped in Mosto for reprieve from my general lack of mental compass. So, glad I did. It happened to be happy hour and it happened to be the best GD torta I've ever had. Three thumbs up for the amazing service, the rad drinks (try the Kai Breeze) and just what a weary traveler needed to replace the pep in her step.", "author": "annie p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Love the vibe. The music is really upbeat. The lights are low and the cocktails are fantastic. Exactly how I like my bars. Had a hard time choosing bw the flights and the cocktails. Too many choices isn't a bad thing.", "author": "Emerson B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "The spin-off side bar of Tacolicious.  Same building, just separated by a wall and a convenient door.  Tacolicious always intrigued me.  Gentrified tacos dead smack in the middle of the Mish.  It works, what can I say, people friggin' love it.  Me?  I have mixed feelings for it.  The plus is the atmo.  Peeps love to party and have a good time here.  Can't really do that at a legit divey taqueria down the street.\n\nMosto is 90% bar.  A small makeshift taco station services the bar, with maybe a half dozen offerings.  Great when indulging in their massive tequila selection, which is also featured in all of their signature cocktails.\n\nCocktails pretty legit but pricey.  $12 fiddy starts.  Margaritas use good tequilas but also use agave syrup and lime instead of a sweet/sour mix.  It is softer but lacks that acidic punch most associate with margaritas.  I can't stand commercial sweet/sour mixes, so this was fine for me, but not as good as Fiesta Del Mar's version where they use their \"own\" mix, using key limes.\n\nLa Paloma is usually a blanco mixed with Squirt and is conducive to the hot towns in Jalisco.  Here they up it with St. Germaine and grapefruit instead.  I also took sips off a chile infused cocktail and that got my brow to raise, in a good way.  Bartenders pretty good here.\n\nMunch-wise the tacos are not bad.  At $2.50 for tiny two biters, the value can be questioned, especially in a taqueria rich neighborhood.  But in their defense, they are good.  Tortillas just barely warmed through.  You don't get the full choice of meats here, maybe only 2-3.  But what you give up in choices, you'll get fresh off the griddle freshness.  Pastor just ok, just get the one down the street for under 2 bucks.  What is hella buck here, are their Nopales con Queso tacos.  Strips of cactus on top of griddled Oaxacan cheese.  OMG good, trust.\n\nTamales are skipable due to the masa being overly wet/mushy.  It taste fine, especially the poblano con queso, but the masa is strange.  Their Hamburgesa however is the thing to get if a little hungrier.  It's a basic griddled burger but with Oaxacan cheese and pickled onions.  And for 8 bucks, you'll be hard pressed to find a better one out here in SF, at that price point.\n\nAll in all, not a bad spot to haphazardly stumble upon.  Clean, stylish, quaint yet solid.  I mucho recommendo.", "author": "D.wight L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Excellent bartender! We had several super delicious margarita's while we waited for a table next door.", "author": "Shu Jin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "I love this place, service is great, ambiance is perfect. It's small but cozy, perfect for a drink and a tapa before dinner. Our drinks were on point, tonight we had tacos al pastor and the meat was really dry. Hopefully next time is better", "author": "Ana O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-05", "description": "Super pricey in my opinion but I will say that the drinks were imaginative and pretty damn good.  The tapas was so so.  The mini tacos were not especially flavorful considering the price.  We would have stayed for another drink or tow but realized we didn't need to go broke our fist night in town.  This was a decent place and if you are in the neighborhood with money to burn, by all means check it out, but don't go out of your way to come here.", "author": "Patti M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Tasty Mexican just like a local taco stand on a beach in Mexico.  Try a taco with a shaved roasted pinnacle slice on top!  Busy bar-like ambiance with trendy crowd and loud music.  Good drinks too.", "author": "M S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "This place used to be awesome when it first opened. Bartenders tonight were terrible. If you don't want to make people drinks, don't be a bartender.\n\nBoth stars for tacos and the guy who makes them.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Drinks are awesome. Ted, the bartender introduced me and my friend to Mezcal and I'm in love ever since lol. He makes good mixed drinks. I only took sips from my friend since I was busy with my tequila and mezcal flights :)\nA great hangout spot with great drinks and excellent service. \nOur server was also awesome (sorry, I didn't get your name). He was very patient with us and helpful.", "author": "Pam Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "My girl and I were in town for Valentine's Day and we're trying to find the areas where we could go bar hopping and we came across mosto's. It was a super chill vibe. There are 2 sides to the bar go to the left side where they have the guy making the al pastor tacos. My girl got the Micheladas and she's super picky and said they were good so they must be. I got a couple mixed drinks and all the bartenders were super cool. We had to come back the next day and this is definitely gonna be our spot when we are in town.", "author": "Jesus R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "Decided to come here on a Saturday night after finding out that tacolicious had a 1 hour and half wait.. We were VERY hungry and wanted tequila & tacos right away. \n\nWe walked in and found that the space was very small but not extremely crowded, huge plus for me. You walk in and on the right you will see tacos being made, right in front of you. Reminded me of a taco stand inside a bar, an obviously fancy version. We scouted out a table and we were able to seat ourselves after 10 minutes. The decor is interesting and very cool, there were hundreds of mason jars hanging from the ceiling and they were filled very random items.. (Including a photo of an Asian girl & a packet of Advil)\n\nThe margaritas were delicious but a little pricey ($12) and the tacos were not flavorful but luckily, you are not paying a ridiculous amount. We had the cactus taco($1.50), pork ($1.50), chorizo ($3). Personally, I didn't find any of the tacos to be delicious but they were decent. \n\nThe service was great, would I come back? Of course, because of the service & decor", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Ted and Harrison rock the bar on the weekends serving up some fine cocktails. Yes it's true, cheap mexican food and even the tacos are crafty. \n\nMy friend had a cocktail which had absinthe. I jokingly asked for a cocktail with beet juice, and we were given one which tasted like it. \n\nTed and Harrison are attentive, skilled, professional and totally approachable. \n\nIt's a cozy bar. It is connected to a restaurant next door.", "author": "Leilani M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Second time visiting this restaurant and I always have a good experience here! Waitresses are friendly and quick, food is delicious (5 Stars). They are also part of Tacolicious program that gives back to schools in SFUSD so every time you go there mention a school. Drinks are pretty good too. What I like most about this place is the relaxing ambient and decoration. Will deff go back soon. Brisket tacos are so Yummy, and their salsa is the best!", "author": "River D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "Mosto, soooo delicious!\n\nEl Pastor tacos are super cheap, only $1.50! They throw some pineapple in them which add a really nice sweet touch.\n\nPastrami taco was more expensive, but pretty fucking MIND BLOWING not going to lie. \n\nWash them all down with margaritas or mojitos and you're solid. \n\nOnly thing that threw my friends and I off was when they gave us sauce for our tacos (yknow typical green sauce and hot sauce) they gave it to us in super small squeeze bottles. I can understand their logic to some extent, it's a small restaurant and they don't want to lug around huge bottles. However, we ordered 20 tacos and needed more sauce than just a to-go hand sanitizer bottle worth :/ \n\nOverall, great little place with a nice ambience as well.", "author": "Mars S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-23", "description": "Low rating because of the the food. We tried five items off the limited food menu (warranted it is a bar, not restaurant), was pretty disappointing. Generally, a majority of the items were flavorless...which I didn't even think could happen with Mexican food. Lack of flavor coupled with the price made it underwhelming. Maybe an off night?\n\nI still give two stars because for a bar, this place has a nice selection of beer and cocktails with a friendly staff.", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-16", "description": "Over priced and the service is cold. Super hipster spot.  Came here with my grandma,  we spent $55 for 1 salad, 1 soup and 4 tacos. Probably not bad prices for your average techie..enjoy.", "author": "Terese V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "So far I've been to this place twice and I like the embiance a lot.  \n\nThe have beers on tap and also have wine on tap I guess. \n\nIt's probably right now our go to bar in the area.   \n\nThey also serve tacos which looked really good but didn't really try.   Maybe the next time we come over.  \n\nThe wait staff was friendly and we never had issues getting a seat yet.   It has been fun.    Good times made here.", "author": "Homer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Awesome! This place is unbelievably good, Harrison is an artist and a savant, the drinks are sensational, innovative, mind-blowing, and surprisingly affordable.", "author": "Mike P. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "I recently traveled to San Francisco for a work trip and some of my colleagues took me to Mosto for some mezcal after dinner. What can I say? AMAZING selection of mezcal and tequila. There were brands I've never heard of before and I drink tequila very frequently. Definitely impressed with the knowledge of the bartender and even more impressed with the wall of options. \n\nWe didn't eat any food here, but if their kitchen is even half as good as their drinks then it's probably great!\n\nThe main reason why this review isn't 5-star was that I felt like a goldfish stuck in an aquarium with nowhere to go because it was so crowded! I know why it was crowded, but just wish it wasn't so loud so I could have a nice conversation with my colleagues.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "Tequila and I are NOT friends.\n\nI don't trust him.\n\nI think he gets a kick out of embarrassing me in public.\n\nFriends just do NOT do that.\n\nThe first time tequila and I met, I belligerently chanted out loud (over and over again) how my friend was going to get some nookie nookie that morning...in front of the girl he just met....in front of table of 10+ people at 3 AM.\n\nThe second time at a Vegas Bachelorette party, my friend, the bride-to-be found me on the floor with two Palazzo security guards hovering over me snickering. Apparently, I was trying to get into our hotel room, gave up because I couldn't open the door so I ended up sprawled on the floor like a hobo. I think being on the right floor would have helped. FAIL. My friends now write \"Please Return to Palazzo Room #\" on my arm.\" No joke.\n\nThese days I avoid tequila like a plague. That was until hump day arrived. Looking for a post happy hour spot, Mosto was the closest place within walking distance to where we were according to my Yelp app. All I have to say is Yelp made me do it...again.\n\nWhile sipping on my strong El Mosto ($9) margarita cocktail http://www.yelp.com/biz_photos/WMf6bHwvBftlZF-vUb6Cyw?select=9watN7YGQvcJu4XV6RT61A, we couldn't help but notice a couple next to us giggling, making out, groping and fondling each other like high schoolers in a backseat of a Chevy at the drive-thru movies. Go, Go, Get it, Get it! \n\nTequila may not be my friend but it was definitely someone's BFF that night. *wink wink*\n\nOTHER NOTES:\n*Friendly, knowledgeable, and attentive staff\n*Long and very narrow space (seating for ~25 people) attached to Tacolicious\n*Over 300 kinds of tequila, mezcal (agave), and sotol (desert spoon plant)\n*Cocktails ($9) are made with house made syrups and sodas\n*Tacos ($1.50) and tamale ($3) are available for noshing\n*CC's accepted with no minimum\n*Parking blows", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-30", "description": "How many tequila shots do you need to feel tipsy? TWO! \n\nHow many shots of tequila do you need to get the party started? FIVE! \n\nHow many shots of tequila do you need to feel invincible?? A WHOLE BOTTLE!  ;D\n\nI usually prefer my tequila in a margarita or plain in a shot glass with lime.  But Mosto is a place where you should do BOTH, not either.  Or you could just spend the extra $$ for a tequila flight -- 270+ tequila choices line up the wall and yes, you will have a hard time choosing so ask your bartender for recs.  We had the Fortaleza reposado and this is clearly top-quality tequila, it is spicy and rich, none of this Patron stuff.  Down that and follow it up with the housemade \"sangrita\" chaser or the escabeche \"pickle-back\" and you'll be saying: \"ay carumba! una mas por favor....\"\n\nAfter you get the booze taken cared of, place an order for the $1.50 Al Pastor tacos. El senor will expertly carve the meat pieces off the rotating grill. He tops it off with grilled pineapple, radish and salsa. I realized that getting 4 isn't enough because they are so, so good! (but so, so TINY!)\n\nFriday nights are packed! You'll be elbowing your way to the bar and fighting for the few coveted seats. But the drinks and bites are worth it. If you end up standing with your margarita in hand, look up at the ceiling and count the seemingly endless rows of mason jars that adorn it. There are 3000+ of 'em.\n\nMy number could be off.  You know, tequila shots and all.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "$1.50 tacos, and remarkably good service considering the crowd\nThe above is my tip, and it covers the review too!\n\nThe service (and food!) were so good, in fact, that that by itself gives this place four stars. It was super-loud, cramped, crowded and not terribly comfortable (hence the four stars) but the drinks, food, and top-notch bartenders made up for that in spades!", "author": "Noah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-04", "description": "Awful service.  The waiter got our order wrong and then we waited half an hour after we asked for our check to bring for him it to our table.  The food is mediocre at best and is really overpriced.  So disappointing.  Do not go there.", "author": "Ghazal S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-04", "description": "Drinks were great! Atmosphere was great! Service was horrible. Waiter took our order and said \"I should write this down\" he didn't and gave us a whole new order. Minus two stars. \n\nInteresting mystery game though as my partner doesn't  eat pork :( we asked for the check and 20 mins later we had to remind him. Again. Minus 2 stars. Geeze I really, really wanted to LOVE this place because I LOVE Tacolicious.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Love this place. The menu is inventive, the vibe is fun, the decor is cool & the drinks are AMAZING. Please try the Tomato Salad (drink)...it's such a party in your mouth! I just really enjoy the eat snacks/tapas with your delicious drinks concept and this place NAILS IT.", "author": "Zhenya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-12", "description": "Bartenders were wasted, spilling food and dropping garnishes. Also rude - food is good though.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "Went here while my boyfriend and I were walking around the Mission, we were on a mission to find every delicious bar and restaurant on our last night in SF. \n\nThis place was fantastic!!!! Upon entering, it's a smaller space with a bar full of tequila and seemed a little intimidating. but the bartender and server were incredibly friendly. We ordered the paloma and two orders of the adobada tacos. The tacos were so good we had to get two orders. The meat so really well seasoned on a warm tortilla and the pineapple added the perfect sweetness. My mouth is watering just thinking about them. \n\nThe space also has an awesome ceiling installation. thousands of jars are screwed into the ceiling, some empty and some filled. We asked the bartender what it was for and were informed that people can fill a jar with whatever they feel like. he suggested 100$ bills. lol  We didn't have any of those lying around but decided to memorialize our trip with a picture of us and a coffee card with the dates of our trip.\n\nHIGHLY recommend checking this place out.", "author": "Stina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "If I were to have my last sip of tequila, it would be at Mosto (if I couldn't be on the beach in Cabo, of course). \n\nMosto has every tequila imaginable and some of the best tequila cocktails I've ever had. \n\nBonus points - you can get little bites at the bar or next door at Tacolicious. \n\nEXTRA bonus points - you can booze-up on some delicious nectar of the Gods and then mosey on over to some of the best bars in SF. Win win situ.\n\nSo, if by my glowing review this isn't already apparent, please don't come to God's castle expecting Hornitos or José. Branch out and try something new. This place will turn you into a tequila lover (if you aren't one already).", "author": "Amanda U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "When I told my friend I had never had mezcal, they immediately brought me to Mosto to hang out with Teddy (the friendliest bartender this side of the bay) and get schooled, while snacking on the most bomb hamburger I have had in a minute. Highly, highly recommend checking out this tiny hidden gem.", "author": "Kristin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "This place makes the most amazing hamburgers with oaxaca cheese and pickled onions!! The burger is a good deal too and it's the reason why I keep coming back. I like their street tacos too. We see the same cook working the grill every time and he really has it down to an art. The setting's a little small and loud, but it's a fun place to hang out and have a drink and one of the best burgers in SF!! (special thanks to Brendan at Cervecería de Mateveza for telling us about this place)", "author": "Matt J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "They serve tacos here with meat cooked on a spit right in front of you. YES I SAID SPIT. Wait, Ching-Yun I thought you were reviewing a bar...why is there a spit? \n\nExactly. Why? Because they can. And they wanted to. Why not?!\n\nBest. Idea. Ever. to whoever created the concept for this bar. I love it.\n\nI was visiting SF that weekend to celebrate Yelp's 10th Anniversary and I ended up at Mosto b/c the wait at Tacolicious was too long. Maaaaaan. The tacos were priced right and were made well too. Fresh, cheap & pretty flavorful and yes, this is coming from a girl living in Mexico, I mean, San Diego, home of pretty good Mexican food.\n\nI did not drink here, so I can't review that, but yes to a \"TACO BAR!\" hehe. Awesome.", "author": "Ching-Yun L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "We originally wanted to go to tacolicious but the wait was long, so we came here for drinks. we ended up getting their burger, tacos, omg. \nSO good.\ndrinks were SO awesome and chiq and also food, mind blowing. i am going back here.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "It's only been seven weeks since I posted my review of Mosto in the Mission area of San Francisco. Seven short weeks, but in that short amount of time so much has changed that I felt obligated to write a new review to keep my readers and eaters up-to-date.\n\nSeven weeks ago I gave this glorious restaurant a 5 paw review. I don't do that very often as to me 5 paws are saved for the best of the best. Mosto was the best of the best, but something happened and they have fallen hard.\n\nPicture it, 5:20 p.m. on a Monday night. Not a busy time, or day of the week. I patted my furry feet into Mosto and took one of the high top tables. There were perhaps eight other people in the restaurant/bar. In other words, it was not crowded.\n\nMy order was simple, a margarita, a cactus taco, an al pastor taco, and a pastrami taco, nothing crazy or difficult. About fifteen minutes later I'm informed that another tables order was put on my bill and so they needed to sit down with me to determine what I had ordered and what on the bill wasn't mine. There were even a couple of tacos that no one seemed to have ordered on my bill. So after a round of discussions, I received the food that I had ordered.\n\nI have to say that the pastrami taco was still as I remembered it. Nothing on my plate even resembled the wonderful food I had just a few short weeks ago. The cheese on the cactus taco was over cooked, brown, and crunchy. When I bit into the al pastor taco, my immediate thought was that the pork had been sitting out in the sun. It was completely dried out, and no flavor. We won't even go into the details of what they did to the pastrami taco.\nThis was without a doubt one of the worst restaurant experiences I've had in a while, not only was the service completely out of whack, but the food was total crap. Not what I expected on my return visit to Mosto. \n\nAlas, that will be my last trip to Mosto. I won't even give them a second chance at redemption. \n\nMy rating...2 Paws\n\nWith love from my dog bowl to yours....Happy eating.\nShatasdogbowl.", "author": "DJ S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "I'm a huge fan of Mosto and have been a regular here for the past 2 years preferring it to it's rambunctious and flamboyant brother Tacolicious. \n\nRecently I've been a bit disappointed due to the inconsistency of the quality of food. Not only have the tacos al pastor had a huge price increase from $1.50 to $2.50 (Díos mío!), they give you way less: 1 tortilla instead of 2 and a lot less meat. The taste has changed from the most authentic tacos al pastor in SF (a year ago) to typical SF fare (not Mexican). Sad cuz this was my haven for these tacos. I hope Mosto changes their recipe back. (Missing a star due to these changes)\n\nHuge fan of their Califa tacos (nopales and cheese) and their Gringa (sausage and cheese on a flour tortilla). They also have some killer cocktails if you like tequila/mescal based ones!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Cute! 4 stars for just Mosto, 5 stars for the Sosh Concierge experience.  I got a cocktail tasting and taco deal through Sosh here (and then ordered more tacos) so I got a pretty well rounded taste of the menu.\n\nYes: Al Pastor tacos. They are a little small and could be eaten in 2-3 bites, but the Chorizo thing was a bit bigger and quesadilla like and was also pretty good.  The house margs are tasty, and the tomato salad drink is definitely interesting, albeit good. \n\nNo: The grapefruit cocktail is just ok, refreshing but a bit bland.\n\nI would suggest going the Sosh route and getting a reservation- it was really cool how they just booked a table for you, and you can walk by everyone waiting.  This place is really small and narrow, so it feels intimate and fun!", "author": "Reyana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "woooo I LOVEE TEQUILA BARS!! I got a flight of tequila shots and it's totally work it.. I was feeling good!  Also love how the bartenders pronounce all the tequila names.  I know stupid, but it makes me feel like they really know their stuff!!  Coming back for those tacos I was staring at all night though!", "author": "Dorothy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Tacolicious counterpart right next door...perfect for me since tacolicious is always packed...this place is less that...but way good in so many ways!  \n\nTaco El Pastor to start with a La Paloma to wash it down.  \n\nGringo De Chorizo...a bit more on the salty plus side of hats what rocks your boat.\n\nTaco El Califa...for the vegetarian who wants a little cactus in them...not bad with their hot sauce on em...but on the bland side without the sauce...still good!!\n\nTamal De Rajas Y Queso...another veggie one and it's a thumbs up with some cheesy \n\nMs. Reyes' Tamale...good shitz...\n\nPastrami Taco...o heaven goodness!!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-12", "description": "We found this place on sosh concierge, thought it would b fun to try a new spot..we were handed menus fairly quickly and once we mentioned we had prepaid with sosh..our drinks came out the bartender was on point with the timing...then the food was good but the chips with the burger was terrible. How can a burger that great have chips next to it that bad..they we over seasoned and not crispy. Drinks were good so was the food but not sure if it's worth returning...please fix the chips!!", "author": "Dee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "Cocktails and tacos were both very good. I got the nopales taco, which is cactus. I liked it a lot, but don't get it if you don't like slimy vegetables (like okra) because that is the texture. I do wish their music was less boom/thump especially because it was still pretty early in the evening (before 7). Hard to have a conversation.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "The wife found this place through Sosh. We visited Mosto last night in the early evening for cocktails and a couple of small bites. We ate dinner beforehand to be well fortified ahead of the drinking and because we knew the deal included only one taco bite per person. We were really there for the cocktail tasting. The first one was a Margarita, which was on the traditional side and not too strong but okay. The second was a Tequila that I liked and was my favorite of the three. The final cocktail was my least favorite, called Tomato Salad which included Mezcal. It was distinctive and very smoky and strong. I tried to like it and finish it but just could not. \n\nI really enjoyed the ambiance at this bar, since it was not overly crowded or noisy. I enjoyed the music and the vibe. The space is small and narrow but cozy. The glasses compose the low ceiling creating a cool space overhead. \n\nThe taco I had was the Pastrami and was excellent and normal size, but the taco my wife had was extremely tiny only about one or two bites, but was fine. It was $2.50 so not too expensive, but not a great value either. We would go back for a drink again but not for the tacos.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-08", "description": "The bartender from the adjacent Tacolicious makes my favorite michelada on the west coast. He was kind enough to whip one up while on the Mosto side of business and it was so good that I don't remember if I had any food to accompany it. Great place to grab a drink and quick bite with a small party.", "author": "Joseph V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Great ambience! Randomly stopped here because it looked cool and it was awesome! Delicious drinks (we got the La Tapatia and Green Hornet) and a nopales taco and an al pastor taco. Everything was great and the service was excellent!", "author": "Haley P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "Why I Mosto-ly Liked Mosto:\n\n1)  Plan B if you are not interested in waiting 45 min. for tacos at Tacolicious next door.\n\n2)  Plan A if you want margaritas and tequila.\n\n3)  Awesome, unbelievably attentive server. \n\n4)  Groovy ambience with loud music, wall votive candles, and a quirky mason jars ceiling.\n\n5)  Fabulous Mocktails\n\nBecause we had to work / fly the next day, we tried the Mia (a luscious OJ and lime concoction) and a Mexican Coke based drink ($5 each).\n\n(Yes it's official, we're old!) \n\n6)  Cheap Eats \n\nThe nopales taco and pork tacos were budget friendly ($1.50 each) but a bit bland and cold.  The tamale with chicken, green beans, and potatoes was ok flavorwise but very mushy in texture ($3).  (Next time would probably hit up El Toro instead.)\n\n7)  M.W.A. (Menus With Attitude)\n\nIt warned us that \"Getting drunk will not get you laid\" and grouped the non tequila hard liquor options under \"Haters.\"\n\nHaters gonna hate!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "This place is a bit small and dark, but it has great drinks and more Tequilla than you can shake a stick at. I went with my friends and we all had top notch drinks and a great time. After a drink or two I decided to get some food and grabbed a Pastrami Taco. Yes, I know... It sounds good and it was, though I could have done without the mountains of salt.\n\nI liked this place so much I tried to take my date there, but there is no parking within a mile of this place after work. So remember if you want to go here, take the train!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "This place is connected to tacolicious but I love the tacos from mosto better. The al pastor tacos are the one! So yummy I crave them all the time. \n\nJust a bit pricey $$$", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Ridiculous amount of tequila and knowledgable staff.\n\nThe pastrami taco is to die for.....!", "author": "Davinder M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "For Tequila and Mezcal afficionados.  Please sip your Tequila please!\n\nKnowledgeable bar tenders guided me to some great Blanco, Reposado, and Anejo pours.  I was astounded by the number of shots purchased by patrons that the bartenders take and remain functioning throughout the night.  I enjoy myself a good sipping tequila and this place delivers.", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "I was very impressed with the cocktails / small bites here!\n\nHonestly - was not expecting much. Tacolicious next door was WAY too loud so my friend and I opted for Mosto which is right next door.\n\nI got a tequila/pineapple/lime-y cocktail ( it's not as girly as it sounds...trust me ) Wow! it was sooo good. The perfect balance of all components and they don't jip you on the alcohol either.\n\nWe ordered tacos, tamales, a raw fish diesh and all 3 delivered. Very very yummy. Definitely more refined than Tacolicious ( and I'm a fan of Tacolicious! ).\n\nWill definitely be back - drinks here were awesome! The wait staff was friendly and even though she was the only one on the floor, she handled everything with ease :)", "author": "Selina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "Darn fine margarita!  Godawful loud music!\n\nAfter placing our names on the waitlist for Tacolicious, we moseyed next door to Mosto for drinkys to tide us over until our names were called\n\nPlenty of open tables & barstools but we chose a table that happened to be near 1 of the speakers.  Had to yell into each other's ears just to be heard.....boo\n\nWaitress was nice as could be & knew we were just waiting for a table so we were short-timers\n\n2 Margaritas please!\n\nBefore the drinkys had been made, our table was ready & the super-nice waitress said she'd be happy to bring them over to us - awesome!\n\nThose drinks were salty & tart & all kinds of good!  BF said he could feel the tequila after about 1/2 of his drink.....I'll have what he's having!\n\nBrowsing their menu as we were deciding on our libation, looked like they had some notable munchies & would definitely be worth a visit on their own.....getting the tacos to go from next door, of course!", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-08", "description": "Came here last night for dinner and drinks. Bartender was super rude. We didn't get service and we waited for 10 minutes. Then when we left, the couch we were sitting on broke! If someone had gotten hurt, that could have been very bad. I know my last review said I would be back again, but I won't. Too many places to try in SF with much better service and no stuck up bartenders.", "author": "Ashlyn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Calming ambience and extremely manageable option while waiting for a table to open up next door at Tacolicious. Of particular note are the buck fifty tacos el pastor cut from a blazing spit by the entrance. As tradition calls, this place serves with some pineapple. Best bet is to get a couple of these and some four dollar Modelo cervezas. But don't spoil your appetite as the other menu items are tempting. Then again, why not just stay here and call it a night?", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "I absolutely love this place. Yes, it's a little too hipster for my taste but that's true about most places in the Mission. The drinks are great! I highly recommend the tequila flight. I love tequila and mezcal and what I loved about the tequila flight is that comes with different chasers. One of the chasers was really spicy and it was a perfect compliment to the tequila. \n\nBut perhaps the greatest part about this bar is that it's right next to Tacolicious, which makes bomb tacos. You can order tacos from next door without ever having to get up from your seat! \n\nOrder some tacos while sipping on your tequila and you'll have an unforgettable night. This place is also pretty quiet so it makes for a good date night. :)", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Fun place to be on a Friday night! It's quite intimate and small (thus hard to snag a table or bar seats), but worth the margaritas and many tequila drinks! The tacos are also cheap ($1.50) and they're also conveniently located right next to Tacolicious! Bartenders were also good at their skill and attentive with our needs.\n\nThe only drawback is that it does get quite loud sometime, but hey, what bar isn't on a Friday night in the Mission?", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "Amazing tequila selection, awesome bartenders, delicious vegetarian tacos and plantains.  Who would have thought that St. Germain would blend so beautifully with tequila?  The bartenders at Mosto figured it out and it's amazing...if those are your two fav liquors.  \n\nThe ceiling in the bar is made up of jars filled with mementos and if you are really nice to the waitress, she might let you put something in one.", "author": "Audra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "A family friend and I decided to meet for dinner in the Mission, quite honestly, this time last year. (Overdue! Overdue! Overdue. Thank god this isn't a library book- or I'd have some severe fees racked up.) While we had our hearts set on Tacolicious, Mosto next door was an amazing alternative. (Ok come on- they're practically the same restaurant.) \n\nIt's really dark...and loud, but was great for catching up over good drinks and small bites. I was stoked that the bartender was familiar with the Marina menu (NOT BECAUSE ITS THE MARINA...stop judging you!) but because the Tickle Me Telmo is one of my favorite margaritas- and not featured in the Mission location. \n\nTotally a go to in a pinch...when Tacolicious is cray-cray...which is typically is.", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "This place is such a hoppin' bar!  I love the taco-making window, where you can watch each taco being made.  We had some amazing tacos with great salsas--pineapple, grilled cheese, pork--so many choices!  The prices are amazing.  It's just what you need if you're looking for a quick bite while you're roaming the mission OR if you're looking for a spot to stop, chill and have some drinks!\n\nAlso, the scene is AMAZING!  The bottles in the ceiling are genius and inspiring for all of those San Francisco artists!  The music keeps ya going too.  \n\nI love this spot!", "author": "Jensyn H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-15", "description": "Finally came by to try this hot spot located in former New College.  The place was dark and has that new, modern steelo.  Seeing the grill when I walked in was cool but you only walk by for a second.  The menu seemed limited and pricey.  \nNow one of my pet peeves is wait staff who doesn't write orders down.  You know why.  You know...they always mess something up.  I even jokingly asked the guy if he was going to write it down and he arrogantly replied, \"I got it.\"  Sure.\nFirst dish came, double order.  Only one dish was ordered.  They just left it rather than take it back.  The waiter didn't even come back to acknowledge his mistake.  Whatever.\nThe fish tacos I had were bland and unexciting.  The chicharrones had some nasty flavor on them and the service was subpar.  The bill was way high for the food not be filling or tasty.\nBig time let down.  Might not be around for long since they have taco competition right next door.\nParking is tough on nearby streets", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "While Tacolicious can be crowded, loud, and hectic, Mosto is its quiet, chill, smaller counterpart right next door. The menu is very small, but they have $1.50 Al Pastor tacos with pineapples that are super good. You can see the meat slow cooking in the window. Unlike Tacolicious' huge portion sizes, though, these are normal-sized, and I ate like 4 of them.\n\nGood place to chill with a friend, have a drink, and eat some good tacos without having to wait too long.", "author": "Cynthia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "get a guava mescal mixed cocktail and pastrami taco! Its a bar atmosphere with a fun crowd. A go-to spot.", "author": "Roberto D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "$9 a shot. We aren't in Kansas anymore. But techate is 3.50... so maybe we are? Good for a date, because its a classy establishment. I liked the sexy candle-lit interior. But then again I don't really know how sexy 3.50 techate can get. \n\nThe whole thing smelled like tacos.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "I have gone to Mosto about four times. The last time I went was Tuesday of last week. I was gobsmacked by how I was treated. I am Hispanic, born and raised in the city, professional, etc. I totally felt a racial difference with the waitress. She took 10 mins to ask us what we wanted to drink, the table next to us had gotten there 7 mins later and right away she asked them how they were, what they would like blah blah blah. 10 mins later she comes to our table with an attitude. The food is great but the waitresses need to be nice to everyone! There was an african american girl there too and she told her to her face that she was rude and inconsiderate and left the place. Please hire nicer people, less picky with who they have to serve.", "author": "Judith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-26", "description": "Love tequila? This is the place for you. There are hundreds of selections here and the menu is dizzying. Can't decide? try one of the cocktails featuring said tequila, or a few that don't and some non  alcoholics. The El Mosto classic margarita on the rocks and the Ferro's Little Devil with ginger beer are blackout good. Not since the Cadillac Bar and Grill before the Metreon took over have I had such a good one. They also do the blended styles a la Baja which are also tasty. You can have the eats over next door at Tacolicious and then continue the drinking here or you can just come here for drinks in their low lit swanky bar and back lounge area. So many tequilas, so little time", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "great place for a happy hour and quick bite to eat. the tacos are absolutely delicious! the drinks are strong and the tequila selection is awesome! service was also friendly! definitely will be back.", "author": "Nia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "One of the many new breed of upscale bars and restos coming to the Mission.  Hey guys, the same thing is or has already happened to Bedford Brooklyn, just sayin.\n\nStill having an El Mosto will definitely put you in a good mood.  The second one will do even better!  Delicious tequilla cocktails, to warmup our pre burn.  Sweet!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Zane was an amazing host. He remembered the authentic drink he made for me a few months back and it was special. Glad I invited my friends from Sj to join me. Props!", "author": "Pat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "3.5. It may come as a shock to most but I can't (and don't) eat/drink all the time. Well, let me rephrase: I can't (and don't) eat fatty food/drink booze all the time. There. Fixed. In my youth of board shorts, obliques and laughing in the face of age (not to mention running and a decent gym ethic), I ate and drank with reckless abandon and dared the universe to stop me.\n\nThen I hit a certain age. Father Time, Mother Nature ain't got nothin' on you when it comes to being a [redacted]. For this reason, we thank the mocktail menu at Mosto. Yes, it's not as sexy as tossing back some craft cocktail and making cross-eyed googlies at the fine young thing in the painted-on jeans but after a while, a man gets tired of living that way. And as sung in 'The Lion King', the circle of life demands a return to that which was awesome as a child: grenadine. Yep, the stuff that Shirley Temples are made of are back and they're still delicious. I ordered the Moss Mocktail. It's a potent combo of Mexican Coke, lime and grenadine. Sounds simple. Tastes delicious. If the thought of one more ounce of poison floating through your liver makes you queasy, settle in for an expertly made craft mocktail, cool environment/vibe and decent playlist. Oh, and service. Attentive service that feels authentic is another reason to stop in... but first and foremost, get a mocktail. And call your mother. You never call.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-03", "description": "for a place that tries to corner the latino side in the mission ---- it's a miss.\n\nthe prices are high, the waitresses are not helpful, the food is half ass, the cocktails are ok--- over priced.", "author": "Princess P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "My friend's father challenged him to a tequila vs. mezcal identification, so Mosto was the perfect place to go taste-testing.  They have a full menu of both, and while I don't know the first thing about either (I tend to select an alcoholic beverage based on a) color and b) price by the glass), it's a really fun place.\n\nIt's a small and narrow place, so if you can, go earlier in the evening--or on a weekday--to ensure a seat or space at the bar.  We showed up at about 6pm and had a table to ourselves for tasting and card-playing.  Waitress was super-friendly and indulged our experimentation.  As a bonus, you can get decent-sized mexican food for only $1.50 per portion!  Fun place to stop for drinks before or after dinner.\n\nP.S.  Tequila won over mezcal, hands down.", "author": "Joëlle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "This is a true hidden Gem. It'd dark and hip. The food is simple street tacos and nibbles. The cocktails were a little complex in my opinion. I had a pink sweet margarita which I can't even remember the name of. It was tiny:( My husband had one that was so spicy he could barely finish it. They were also expensive. But be assured I will return. The pork tacos with pineapple were amazing. I would probably get a simple drink next time or even a beer!", "author": "Melody M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "The space is a little tight, so if you don't mind being in small spaces with strangers, the drinks were not too shabby, and the Al Pastor tacos at $1.50 were delicious and kept the hunger at bay until a late dinner, especially after a few cocktails!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Great bar. Great music. Ted the bartender is the best! It is small and crowded but fun. I got a whiskey shot for having a good personality. Nuff said!! Don't argue with amN that recognizes genius!", "author": "Marium M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "My man Ted made the experience, he is a legit mixologist.  I consider myself well traveled, and I had arguably the best margarita ever with the Cimmarron tequila!   I just moved to town and I will be a regular!", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "T-Lish on the right side had some killer guacamole.  The salsa was sweet and smokey and on the house and came with some thick, crunchy, restaurant style tortilla chips.  I think they were house made because they were warm.  My boyfriend described the michilada as one of the better ones that he's ever had.  My coconut water-pineapple cocktail was ok.\n\nThe mural of the cityscape on the outside patio was cool.", "author": "Elise G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-28", "description": "I don't even know what to say. Came here on a whim. Overpriced. Overrated. I wasn't white enough for this place. I make better tacos and service mediocre.", "author": "Guadalupe P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "Thank goodness for those pork tacos that cured my hanger at only $1.50 each. Seeing the cook slice the meat from the rotating meat stick thing (as often seem with shawarma) added at least 10 tasty points. \n\nWe took the corner booth next to the tv to watch the Cal vs. Stanfurd game and enjoyed excellent service. Our waitress was not only attentive, but also patient. Very, very patient.\n\nEven though I'm not the biggest fan of Mexican food, I'd definitely be open to trying out the restaurant side of Mosto. From what I saw on the way to the (clean) restrooms, the other side looked classy and quaint. Especially the outdoor area with the mosaic/mural-y decor.", "author": "Olivia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Very cool bar. Amazing tequila drinks. It was weird though, my date and I tried to pay for the drinks and the bartender ignored us. Maybe he was too busy. But it was strange. We ended up at a table and asked the waitress for the check which apparently was available. Weird experience,  great drinks, quaint bar. I would drink there on payday.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "The drinks are perfectly crafted with all fresh ingredients. It's a little pricey but well worth it! Try the house margaritas -- they're super refreshing!! \n\nDefinitely one of my favorite bars in the area, as it is perfectly located in the heart of the Mission. Great spot to start your night off and jump to a nearby restaurant for some grinds.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-05", "description": "I've never been treated so rudely or disrespectfully in my life. The red-head bartender with the pony tail working on the evening of 5/5/16 was an absolute a-hole. He asked for my ID and when I went to pull it out, he told me to \"lighten up, lighten the f*** up\". From the time I ordered my drink to finishing my drink (30 min or so) we saw him take four shots. He was obviously inebriated while working and was completely vile. This experience was absolutely awful and I will never come back here.", "author": "Annie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "Nice place to grab a cocktail or two with some tacos on the side.", "author": "Sheila T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "Tequila. Have I ever had a problem with you? No. \nWill I now? Possibly, thanks to the addition of Mosto to the Mission. \n\nUnfortunately, I apparently arrived on the later end of the night (their liquor license currently ends at 12 but they're trying for an extension) but with enough time to order the classic Mosto margarita and a few tacos.\n\nThey don't currently offer flights of tequila (a shame with the selection they have), but the waitress was willing to put one together for us. We just ran out of time. \n\nSat next to the owner who was keeping a good eye on everything but who definitely doesn't look like the owner of other Mission bars... for instance the new Dear Mom.\n\nIt's a little ironic, this whole Tacolicious / Mosto thing in the middle of the Mission. Why wouldn't I just go get tacos from a Mexican down the street? Definitely contributing to the Marina-fication of the Mission. Will be interesting to see how this \"chain\" does.", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "Went on a Sunday night.  The place was packed.  The cool Sunday evening vibe has been ruined.", "author": "Needles K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "tacolicious! yummy trio tacos... \nwe had the pork ribs and steak tacos.. so mouth watering and the salsa hit the spot. 4 tacos for $14", "author": "Linda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "I can't comment on price range, because I just assume that every meal I have in San Francisco is going to be 2x as much as Portland. My math on that may be a little skewed. \n\nBut you know what? Plug this into your spreadsheet:\n\n       |- - - - A  - - - - | - - - B - - - | - - C - - |\n- 1 -| - - FOOD - - | - - Yes! - - | - - 1 - - |\n- 2 -| - - DRINK -  | - - Yes! - - | - - 1 - - |\n- 3 -| - -SPACE- - | - - Yes! - - | - - 1 - - |\n- 4 -|  -SERVICE  | - - Yes! - - | - - 1 - - |\n\nColumn C logic:\n=IF($B:$B=\"Yes!\",1,0)\n\nIF Statement Formula:\n=IF((SUM(C1:C4)[less than]4),\"Meh.\",\"WOOHOO!\")\n\nResult: \"WOOHOO!\"\n\nNotes:\n(1) House-made chips and salsa and flavorful fancy cuisine.\n(2) Unusual, memorable, and dare I say savory? cocktails.\n(3) Comfortable, clean and quaint environment.\n(4) Fast, friendly service, even when you're in a rush and need to catch a plane.\n\n---\nIf you prefer a simpler equation:\n MOSTO = GRANDIOSO.", "author": "Katrina W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-16", "description": "Drinks were v good. BUT the tacos were not. Al Pastor taco was v dry and had no spice. Nopales taco was v bland. Pastrami taco wss good.", "author": "Ananya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Mosto is a chill spot for a tequila cocktail and some small bites.\n\nI am a fan of the pineapple on the 1.50 taco al pastor, but I'd like either a more tender pork or more pineapples. The tamale was light with fresh ingredients (ended up ordering another round) and the pastrami taco was surprisingly tasty - not too heavy at all. \n\nSuper friendly service.", "author": "Vina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "I love this place drinks are yummy and  the food is amazing better than tacolicious and the ambiance is  good depending on the night. Only problem is too small and no bathrooms ! Other than that I highly recommend it !", "author": "Jeannette K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "Top notch. Get the pastrami taco. The people and crowd who are here make this one of my favorite spots. I ledft a guitar pick in a jar in the ceiling.Great people,great food and tequila. $40 and my friend and I got loaded", "author": "Gabriel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "Indulge in a Mezcal flight here! There are separate bar, dining and outdoor seating areas. The dining area is intimate yet spacious. The salsa and chips are extremely good so you might forget to leave room for the meal but please do - the bites are tasty. \n\nThe biggest obstacle you'll encounter here on your journey to happiness is the crowd. It gets thick and heavy and very loud so if you're planning a more intimate evening get savvy about when you're arriving or keep the group small.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "We showed up late on a Saturday night after they'd stopped serving alcohol but the food was outstanding!\n\nTry the taco sampler. So many delicious choices.\n\nBonus: One of the servers looks really similar to Aubrey Plaza! Conversation starter.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-06", "description": "I'll admit, I was entertained for the first 5 minutes inside Mosto.  Ambiance, check.  Clever lighting scheme, sure.  Tall tables so people can sit/stand, yup. \n\nThings got disappointing fast when we tried to get drinks from the bar.  I'm fine waiting to order, but am less fine with the bartender rolling his eyes and then having an extensive conversation with the two people who were eating at the bar next to me.  He took no action on making the cocktails or pouring the beer.  Just stood there chatting.  I stood there watching and, incidentally, learning more about those people than I wanted to know.  Thinking that I had committed some social faux pas, my fellow drinker ordered the next round from the bar on the other side.  Same thing.  Order got taken and then the bartender seemed to get distracting in the middle of the transaction.  \n\nMaybe service was just slow?  Apparently not once you get your drink!  My friend put her drink, 90% full, on the bar that runs along the front window.  She turned her back (but did not step away) to finish telling a story. In less than a minute, an employee nabbed the drink off the bar and was speed walking away with it.  This could have been an honest mistake, but the employee then proceeded to upbraid my friend about not putting her drink down unless she was done with it.  Really?  Maybe this would be okay if we were wasted, but it was our first drink of the evening. \n\nPaying that much for a cocktail, you shouldn't have to fight the staff in order to get it or finish it.  Thanks, Mosto, for making it so easy for me to never come back here again.", "author": "Laureli K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "Yes, yes, yes!!!\n\nGreat spot!!!  All kinds of different tequilas if you like it... delicious tapas, delicious drinks, awesome atmosphere! \nBeen there twice, and I'm sure ill keep going. \n\nTapas are super good, I tried 3 and liked all of them.\nMy drinks were very well done too, and the service is pretty good, so really nothing to complain. \nOh, if you wanna go on a date, might be a good spot for it, since is charming and a little dark. \n\nThumbs up up up to Mosto! :)", "author": "Paula C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Great place for a taco snack and drink while you're waiting an hour for a table at Tacolicious. Try the pastrami taco but don't watch the cook at the little window make it or you'll feel guilty for consuming all that delish fat.", "author": "Nicole O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Came to this bar with my friends since Tacolicious next door had an hour wait, and I'm glad we did!  Love the tequila selection and the page long mezcals!  \n\nHad a mezcal flight for $20, the bartender chooses 3 for you.  The Al Pastor tacos were good.  Definitely coming back to try more tequilas and other items on the menu!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-09", "description": "Pre Tacolicious, this is here everyone goes. Probably because you write your name down at tacolicious and then tell you there's an hour wait.", "author": "Dimple B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "Had some dinner down the street and wandered in for some tequila on a chilly Wednesday.  Nice spot, with a dark long bar on the left and an open woody seating area to eat on the right.\n\nAsked the bartender to make us things based on our likes and he came up strong.  Had a great mezcal drink which was sweet and smoky.  \n\nAt $12 a drink it ain't cheap, but it's SF so what you gonna do?\n\nCrowd was kinda date nightish with not many singles.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Happened to come by accident. Heard of the bar by word of mouth earlier. Pleasantly surprised. Very light and airy. Serves my favorite Tequila. The \"Real\" Patron Siete Leguas. For those Tequila Aficionados. Siete Leguas was the Tequila in the Patron bottle until recently. Now it's just a blend of other Tequilas. Mixed drinks were done nicely I think the bartenders name was Jacob. Real nice guy. Anyway. ambiance is low key, but energetic at the same time. The food plates are good. Had the Posole, Ceviche, Camarones al Diablo and the Chilaquiles. All great for feeding the hunger pain. Everyone was very helpful and friendly. If I'm in the area, I will drop in again.", "author": "J G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "Mosto rocks!!! Best selection of tequila and margaritas to match in SF. Awesome music, great scene, great bartenders. Love this place!!!! \n\nI'm not rating the food as we just drank and hung out, but everything I saw looked pretty amazing!", "author": "Braden B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-24", "description": "Excellent drinks, you have a different menu and you can get the same stuff they sell next door at tacolicious. The owners are excellent, and the staff is fantastic. I will be back for sure.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "Came to Mosto on NYE..food was delish..service was awesome and margaritas were a hit!  I am definitely a fan of Mosto and will be back.\n\nEl Pastor tacos with the pineapple got me..best I've had in SF.", "author": "Erica R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Bright sun in the Mission. Strolling south on Valencia. Obviously in the mood for Latin fare--I call it love, others call it a disease. \n\nMy partner and I happen upon Mosto--instantaneous curb appeal: gaping plate glass windows and simple, inviting gray-green earthen facade. Friendly greeting by the hostess, immediately seated at a two-top in the sun. Ambiance perfect so far--expansive mural with scrawled messages opposite us, wooden floorboards, lights strung above. So far, excellent. \n\nCute female hipster servers all about, but none come to our table right away...or within our first 5 minutes of being seated. Minus a few points. Finally, a busboy brings us water, chips and salsa. The chips house-made chips are salty, crunch and fresh. The salsa amazes us--light brown-orange, not your everyday pico- or tomatillo-style offerings.  Slight tang and spice complement the chips well. Points regained.\n\nWhen our server finally arrives we decide on a pitcher of red sangria--a drink we both adore--for $26, which is standard for trendy Hispanic places. Another 5 minutes or so elapses before it arrives, served in a 1 liter carafe. Most of the volume is ice, which is disappointing. The disappointment deepens when the sangria tastes like watered-down kool aid, with barely any alcohol burn or spice notes. Big minus here. $3 Tecate cans are not bad, but I would like to see 21st Amendment cans for $3 or $4--something that is probably not fiscally appropriate in the Mission. Oh well!\n\nWe decide on the tilapia and shrimp ceviche. For $13, the portion is smallish. I think the chef was going for something audacious and interesting, but failed: the dish has nectarines, which is nice, but they are muted by the lime. In fact, the prevailing flavor is not of the seafood nor the nuances of the fruit and vegetable combination, but of the lime juice. The dearth of flavor is definitely not worth the money.\n\nThe decor and vibe of this place is decidedly rad if you enjoy the upscale, hip Mexican scene, which both of us certainly do; however, our experience with the food, albeit small, is a major turn off. Would I return? Probably, if only to hang at the bar or outside with some beer.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "This place is a party and you are invited!\n\nEven if the food were bad, which it is not, just watching the employees is a show.\n\nThey either over-staff everyone, or everyone works off the clock to keep on chilling. I saw a waiter give someone a kiss, the guys in the kitchen would not stop laughing, the host was jumping all over the place, everyone had smiles on their face...well, I just felt so welcome. I love it when the kitchen kids look so radiant.\n\nWho cares what you should order, pick randomly, everything is good. Not super expensive either. Not that there is something overly particular about chips, but I really like their chips.\n\nAnyway, keep the great vibe.", "author": "Alexia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-12", "description": "Great mezcal selection. Lousy tacos.", "author": "Mattie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-28", "description": "I write a lot of 5 star reviews and I really hate to write a 1 star review, but on occasion it's warranted. I suggested the server just put our appetizers in because our dinner order would be a lengthy one. She gave me a condescending look and said she would be fine without writing anything down. Well what do you know, she forgot 2 things on our order as well as an entire round of drinks later in the evening. Then didn't feel sorry apparently after I let her know. Will not be back :(", "author": "Kyle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "After college, I thought I'd never be able to smell tequila again, let alone sip it. Turns out I just needed to find some of the good stuff. Thanks to Mosto for showing me the way... olé!\n\nThe tequila menu here will make your head spin with excitement. After reading all of the colorful and complex flavor notes listed, I want to try them all. At around $10 a swig though, I'll have to take my time. The flights are fun, but of all the tequilas I've tried here so far, my favorite is the Espolón blanco. To my surprise, it's not very expensive in stores (~$20), so I am excited to stock the ol' wet bar with it. Get ready: one tequila, two tequila, three tequila, floor!\n\nThe itty bitty, street-style tacos are much different than the ones served on the Tacolicious restaurant side, but just as t-lish. Though I would happily eat one million of both the bistec and cactus (with burnt cheese!), I usually settle for just a few. Each one is intended to be a bar snack, not a meal - but they will save your life as you're wasting away waiting for a table next door.\n\nAs seems to be the case for most Mission bars these days though, this place is shoulder-to-shoulder CROWDED on the weekends (primarily popped-collared and/or sloppily drunk in stilettos types), so don't even try on a Friday or Saturday night.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "The service was great, but the food was awful. The two stars are for the great waitress.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "AMAZING. Enough said. Best place for tacos and drinks. You'll get your money's worth.\n\nI had two of the fried local rock cod cabbage, with tangy crema which was divine! Not too much fried and it was so light. It was so good it literally melted in my mouth, no joke. I also had two of the guajillo braised beef short rib which was really juicy and moist. All of the tacos were delicious, but I will say they are filling. Remember that they come with two tortillas and you can make four tacos out of two.\n\nI don't like tequilla, but I had the best drink there called flor de Jamaica. It was delicious and EFFECTIVE. Even their guacamole is delicious, but its a little over priced.  \n\nService is great, and people are friendly. The way wait can take a while, particulalry at night, so I would suggest eating there in the afternoon.\n\nOVERALL great place and one of my favorites!", "author": "Mara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "Hip and trendy scene... we sat in the bar section and munched on their tacos.  Was a good experience... just a bit too crowded for comfort.  Probably not a great idea to come here if you hate tequila.", "author": "MJ A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "Composed tacos and inspired pitchers of margaritas!\n\nI've been there a few times in the past year, and I will continue to patronize these guys. I've sampled all the tacos, the guacamole, and a smattering of the offer drinks, and it doesn't seem like you can go wrong with any of the choice. This is why it's popular, but I've lucked out and been able to get seated midday on a weekend as I walked in the door. The bartenders and staff are willing to engage and the availability of outdoor seating is a huge attraction! \n\nPluses: food, drinks, prices, location, space, staff\nDowns: popularity, and the noise level (sometimes)", "author": "Basil B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I've never been to this place and was a little nervous because of the huge tequila list, but the second we got in this guy named Carlos sat us and was friendly as hell and made us feel like regulars.  I was completely confused by the list and didn't know where to start and we asked for some help, not only was he patient with us, but he picked out the best tequila for us and brought some red drink to sip on after shots. He was hospitable and respective and quite frankly hot, (but don't let my husband know). I was not disappointed and will be coming back in the hopes that Carlos will serve our group exquisite tequila.", "author": "Captain Muffin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Great great cocktails. Luv the idea of separate menus for the bar area to restaurant area which pretty much doubled my options for food n drinks to try. The ambiance is pretty phenomenal as well. Totally chill SF peeps all the way. Went to dinner without reservations but it worked out well cuz of the bar area. Ate a little and drank a little... just enough to make it to dinner and have a blast a little. Guess I had a good time :)", "author": "Sue T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "This is a sexy place with a great floor plan. The left is the bar/lounge area and the right is the sit down restaurant. The bar patrons don't hover over the diners and dinner service doesn't interfere with the liquid dieters. \n\nA great tequila menu with some excellent bottles and an even more solid selection of main wall tequilas which goes beyond the sub-par Patron. Friendly bar staff and helpful wait staff made the crowded bar area comfortable. \n\nNice work guys....I will be back to try the food and enjoy more amazing tequilas. \n\nCocktail of choice: La Paloma", "author": "Jay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "Sublime tequila and mezcal bar with great service and an impressive selection of libations. Well informed and hyper friendly bar tenders make sure that your drinking needs are taken care of. Like a Las Vegas casino, or unlike one, it's always dark inside, making you think that it's a perfect time to sip on a good tequila. Even if it's only 3 PM on a Wednesday!", "author": "Ashwin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Cute place. Good drinks, al pastor tacos were really good, small but good. Parking was killer but then again it always is in the city. Tab was about $45 for 3 drinks and 4 tacos. Not Bad.", "author": "Betty R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "Big big fan. Dark and loud. needs more bar snacks. Yum", "author": "Alyssa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "Probably the best gringo tacos I've ever had. Met up with Randy, Char, Elisa, and A.Lau while coincidentally running into Cat and Jor and their families.\n\n7 dollars for a tequila shot and a tecate? Done deal, especially for a tough day of work  (all of us were having)\n\nWe ordered the 10 tacos special for 31 bucks. 3.10 a taco is pretty pricey for the Mission, but this is more of a fusion place. All tacos come with 3 sauces... spicy (habanero), medium (tamarind i think), and mild (green sauce). All sauces were good, and had different profiles so mix and match.\n\nShort Ribs - these were cooked medium, and were super tender but you'd pretty much gobble up all the meat before even finishing the taco. The only thing that was bad about these were that they were under seasoned.\n\nCarnitas - Surprisingly tender... closer to pulled pork though than carnitas. Not overly salty or crunchy, which was a bit disappointing, but the pulled pork flavor was great.\n\nBeer/Tequila Chicken - amazingly flavorful. Almost like a mole taste to the beer/tequila chicken, but it had this nice sweetness from the beer and tequila. The chicken was ultra tender, and not overly salty.\n\nFish - this gives Nick's a run for its money. While this may be smaller, it is slightly cheaper than Nick's. It has a better batter flavor as well, though Nick's bests Mosto's with the guac and crispy tortilla. \n\nLengua - not one of the specials... but still amazing. Ultra tender cubes of beef tongue (don't worry, they shave off the taste buds), marinated so that it was slightly sweet but more salty. This was amazingly tender, as in yakitori japanese restaurant tender. You cannot get tongue cooked any better than Japanese style or Mosto style. My only gripe was the price tag (5 bucks). However, this is THE BEST lengua taco I've ever had... hands down... sadly its a weekly item only.\n\nChoco Taco - pretty much a fancy choco taco... with the waffle being crispy and flavored similar to a Swedish pancake (vanilla flavored). The ice cream was deliciously creamy and dense (vanilla flavored as well) and the chocolate was dark chocolate. Almost tasted like a fancy Drumstick.\n\nOverall an awesome place, with good deals. I would dock it 1 point for bringing tacos to the Mission but this place is different than your standard tacqueria. As many others have said, it does have a sexy atmosphere, and I would definitely recommend this place.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-28", "description": "Really bad drinks, that's all.\n\nGreat atmosphere, nice location, OK bar food, but bad drinks. (And pretty terrible service, too, if I'm honest). \n\nMy friends and I went here and sampled 6 different tequila drinks, and not one of them was good. One was way too sweet, one was really just stupidly spicy, one was way too acidic, etc. The three of us couldn't make it through a single one of their drinks, so we ended up ordering the plain-old-margarita as a control/last resort, and it too sucked and just tasted like sours mix, not lime. \n\nI'm being a tad vindictive with the stars here, but frankly if the place identifies itself as a tequila bar and makes such godawful tequila drinks, it deserves it.", "author": "Sasha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "The happy hour tacos and tequila selection are both top notch. \n\nLove this place and can't wait to return for dinner.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "Huge fan of mosto! The passion shot with chili infused tequila and passion fruit juice starts off fruity and finishes with a great kick of heat. Granted I have only been to drink, however I can't wait to go back for food. \n\nSexy establishment... Incredibly well designed.\n\nLuv!", "author": "SF U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "Finally got to try this place - yummy food and a cozy environment. neat lights and modern decor that has a homey edge to it.\n\nGot a cocktail that had a few things in it and it was very tasty - sorry but i can't remember the name and it's not because i had too much to drink!\n\nwe got the nopales taco - very small but full of flavor. Also the tuna plate which is only 4 small small pieces for $6 so be aware that's it's not a very inexpensive place but the quality is worth it.\n\nthe smells from the food next door are very very tempting so I look forward to trying that.\n\none suggestion - chips and salsa would be a nice addition to the bar menu!", "author": "ari s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "This place is amazing. Pioneering tequila and tacos in the mission (ignore their marina location!). The staff know their sheisse and the food is top notch. \n\nNew mission hotspot no doubt.", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "I'll definitely come back for the food. The wall menu showed excellent deals, as laid out below, and they offer it until midnight when the liquor license also expires.\n\nYou'll find a fantastic list of tequilas, and yet most of the people there were drinking beer or mixed drinks. I'm looking at you, guys, learn how to drink your liquor, and drink it  neat....\n\nThe music went from loud to comically loud. I couldn't help but laugh, and the bass was nearly breaking up. Thought it was still at least 30min before last call.\n\nLove the setup of the place: stools and small tables, with a high booth on one side and standing option on the other. Great feel for a small space. \n\nMejor tarde que nincun...better late than never. That would describe our server who was really enjoying spending time with another server and occasionally forgot about us. Regardless she wasn't just kind, but enthusiastic about sharing her love of tequila and letting my friend, who'd sworn it off since college, find one that was palatable.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "quality drinks, knowledgeable staff, and vast selection. Let your bartender guide you through the extensive tequila list, complete with detailed flavor notes. The choices are every bit as nuanced as a wine list would be. And order food while you are here, the kitchen is top notch.", "author": "Mark N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Man, if I lived in the area this would totally be one of my regular spots. The ambiance of this place is great, really love the layout and the overall vibe from the decor to the lighting to the service.\n\nI was in San Jose with a co-worker on business and on our last night we decided to drive over to SF and grab some drinks. Luckily I found this place on Yelp and I'm so glad we checked it out. The tacos I had were really great and the Long Island I ordered was perfect. \n\nThis is going to be one of the first places I stop at when I'm back in the SF area, for sure!", "author": "Ara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "I love a late night lounge...I love bottles all over the ceiling...I love a menu with happy hour prices all day....Mosto is the know-it-all of tequila, I have yet to see a more expansive selection of tequila. I recommend the flight to get you started, four or five nice pours gives you a little taste of everything. \n\nThe cactus taco here is a little gem...At a buck fifty its a tasty little snack that will soften the tequila buzz that's about to hit ya hard. Hot sauce is an obsession of mine, and Mosto hooks it up with two very well made sauces to garnish your small bites.", "author": "Jocelyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "We've been here more than once, with greater frequency, and love the cozy space with delicious drinks, food and waitress! Hard to say which taco or tamale is the best... You'll just have to sample one of each. That's the fun of it! Take the leftovers home - even better the next day! Powerful cocktail list that is updated often.  Very unpretentious, unlike its cousin next door (Tacolicious).", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "Wonderful addition to the hood. Great margs. Great limited bites menu! Great service.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "One of the coolest spots in the Mission.  They have an exceptional selection of Mezcal and Tequila.  It wouldn't be right to go and not order the al pastor tacos.  Make sure you do that!  The staff is super chill and can help you get the right drink.  Oh and look up at the ceiling, it's fun, trust me.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "I'm confused if Mosto and T-Lish are the same place, i think they are just t-lish is the restaurant side. Regardless, I can't stop eating their chips and amazing salsa. The tacos are my favorite and I have never tried anything else there, mostly because I LOVE THE BISTEC TACO. I think i've tried all of them now and their each delicious. \n\nIf you like a full bar (i do), gourmet mexican cuisine (i do) and a lively environment you'll love it here. \n\nmy boyfriend LOVES their flights of tequila, if that's you're drink you'll love their selection.", "author": "Caitlin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Best bloody mary I have had in ages... Their house mix is so savory and spicy and yummy and like nothing I have ever tasted before... plus! pickled carrots and jalapeños as the garnish. I am in love.\n\nAs for food, I only had one short rib taco, but it arrived with a huge basket of lovely tortillas, a bowl of savory, medium spice salsa, and a trio of specific salsas for the taco ranging from a mild. green to a thin, gorgeous spicy-hot habanero.\n\nI will go back again for brunch sometime soon and I look forward to sitting outside in their little side patio.", "author": "Brandi V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Limited seating but what they lack in chairs they make up in tasty cocktails. I enjoy the vibe. Good energy, happy servers and interesting decor. Just stopped in while waiting for my table at Tacolicious and want to return now to try the food. Stay-tuned for that report.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "Good drinks, they aren't stingy on the alcohol. I also ordered the pork skins and ate them with lime and hot sauce as recommended by the server. They were cool, and kind of melt in your mouth (which I didn't really like). \n\nI was disappointed that I couldn't order chips and guacamole, you can only order that at their sister restaurant in the next room.", "author": "T S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-08", "description": "first thing to do when you enter is look up... their ceiling is covered w mason jars!!! i think its a cool thing! \n\nwent there on a sunday night and of course they were pack. they have ten million tequilas and they are all displayed on the front bar. its def a place for tequila lovers!", "author": "Cathy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-08", "description": "Mosto/Tacolicious, I love your tiles! Yes, because of those nice old Spanish tiles you have in the main dining room, oh.. and the Paul Madonna's ink drawing of Delores Park, you got bump up from 4 to 5 stars.\n\nFood: the appetizer are very generous in size, tacos are very large, two will be enough to fill me up, I don't think I can ever eat more than 3 in one sitting. The grilled squid Veracruz are so soft and juicy; the chicken enchilada are pretty good as well. The chip and salsa that they provided are good, the chips are thin which you can just nibble on all night long. \n\nDrinks: Oh.. they have tequila. In fact, the tequila list is bigger than the food menu. I still think Tres Agave has a more comprehensive tequila list, still with just about 100 type of tequila on their list, they gave me another excuse to come down to Mission. Their margaritas are very good, not too sour, definitely recommended. $10 per cocktails and $30 for a small pitch of the same cocktails, as you can see, drinks are not cheap here, and it is where they will make their profit.\n\nDecor: modest, comfortable. The only thing I didn't like is those metal stools. They have a few different spaces. As you come into the main dinning room through the courtyard space, you will see a small bar counter with a much larger open kitchen, high bench sitting along the glass window that open to the courtyard. There is a banquet room pass the bathrooms, and another parallel space to the main room that have a much better bar setup. I like the variety that it provides, also it just means the wait time is less. (I hope)\n\nService: Overall good. Food came really fast, and our drinks took a little while.\n\nJust a couple of suggestions, if tequila will the be the premier alcohol, then maybe the wait staffs should be better trained about them. I asked for sangrita to come with my Herradura reposado, and our waitress didn't know what the heck I am talking about. Also the few tables next to the hostess has the most awkward set up, those short metal stools look so uncomfortable. They could easily do a couple of large communal table with bench seating.\n\nBy no mean, this is not a place that their food or drinks will blow your mind away, but they do have a winning combination of being well priced and exactly what I have in mind for a night out in the Mission.\n\nGreat new addition to the Mission casual fine dining scene.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "I was skeptical about this \"Mexican\" bar venue in my hood, but it was way better than expectations.  Great service, cool design, and fantastic tacos / bar bites.\n\nCocktails were good, great tequila selection.\n\nA new neighborhood favorite!  Small space, lots of people, but worth a bit of a fight to the bad for the drinks", "author": "Java Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "Many things to LOVE about Mosto\n\n-Taco, Beer and Tequila shot combo for $10\n-Great decor with a cool alley patio\n-Normally I like carnita or beef tacos but at Mosto the fried fish taco and chicken taco....Bravo.\n-Great staff\n\nIt gets packed pretty quickly so get there early!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "Went there with a group of friends as a belated birthday celebration for myself and instantly became a fan of Mosto.  Ordered the tickle me telmo (so good) and tacos (classic carnitas, beer and a shot chicken and forgot the last one) and both were very good.  Would come back again.  \nThey don't do birthday celebrations but you can order a dessert and they will bring it with a candle to your table :)", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-08", "description": "Honestly, other than the adorable babies sitting adjacent my partner and I (who were diversified enough to be in a Gap commercial) my experience here was subpar. We chose to sit outside which on some aesthetic level was interesting with its softly etched mural of San Francisco including bits of inspiring and fragmented prose, long narrow channel flooded with cheap-looking, yet fun modern orange seats tucked under some industrial string lights. Let me belabor the point, that was the best part. \n\nIt took us a while to get greeted. The sangria was a glorified watered down icee with only enough alcohol to laugh at one of my partner's jokes (not okay). We split the ceviche which was just okay. It was bland with no complexity, the bits of nectarine added nothing-- it was overpowered by a wash of  lime juice. The chips and salsa were surprisingly the best part. The chips were perfectly salted and fresh with a golden hue that reminds me of the dried grass on Mt. Tamalpias. The salsa was fresh, tangy and had no chance in hell of staying full.\n\nThe food was overpriced for the quality and the service was slow. They did have a pretty nice tequila list-- expensive but good. So my suggestion would be come get a nice shot of tequila and eat some free chips and salsa.", "author": "Brienne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Love this place.  Tacolicious minus the attitude.  The pastrami taco is out of this world, and their standard margarita is the best I've had in the city.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "This place is perfect if you're looking for a nice tequila fix. Their margaritas are bomb, especially if you like it spicy. They literally have every tequila you could come up with, its quite impressive. Their staff is super friendly and the environment is comfortable.They show the football games, which is a plus if you're into sports. It gets a little tight if they're busy but its great if you're feeling flirty. Their ceiling is my favorite accent, they have jars of random articles found at their bar, these also serve as great conversation starters if you're struggling with a line. Cheers!", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "Great for cocktails. Good recipes and good bartenders. However for $10 I expect them to be stiff and these were like koolaid (albeit dill lemon koolaid).", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "so, the drink you gotta get here is the michelada.  apparently, they serve it here similarly to how it's dished up in tijuana -- beer, lime juice, and hot sauce.  you end up with something that's halfway crossed between a bloody mary and a bud light lime.  \n\ndisgusting, i thought, the first time i had it.\n\ndisgusting!!! i thought, the SECOND time i had it.\n\nthe third time i ordered it, i thought, WHY DO I KEEP ORDERING THESE?!!  but then i finished mine and drank everyone's as well.  i suppose this may be a drink that you grow to like.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-08", "description": "Not impressed with the tacos, tortillas could have been a lot softer, presentation was great but the flavor and hardness of the tacos were extremely disappointing.  I will not be returning to this location.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-26", "description": "Not only does Mosto have a wide variety of tequila, but the tacos al pastor and Ms. Reyes tamales are amazing.", "author": "Stephen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "Came here for beers last Friday. only 4 beers on tap and everything else is Tequila. But they  had modelo so it was okay. They offer some snacks in Mosto as it is next to Tacolicious  but not as extensive of a menu. This place is super crowded pretty much all the time but we got a few stools at the bar. My only negative is they don't offer chips and salsa at the bar!! boo! their tacos are good but chips are always a great snack when you are at the bar. Otherwise great new addition to the mission.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-28", "description": "We only had margaritas, which were quite good.  The music was obnoxiously loud for a Wednesday night at 7.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Oh man, this was simply a fortuitous stumble upon experience on New Year's Eve that had my man and I back for more this evening. On NYE I was pleased to find it mellow and not so packed around 11:30pm, we grabbed the four window seats and went on a taco-ordering frenzy. Between the four of us I think we devoured close to 20 of their $1.50 pastor tacos. Tonight (Monday) it was the same vibe at 5pm, got a small table and went loco on 12 tacos. The pastor is really nicely seasoned and served with fresh pineapple..mmm. Their two house salsas are devine, an orange salsa (made with oranges?) is thick, citrus-y and mild and the green jalepeno salsa is killer, vinegar-y and with a bit of a kick. I had the nopale taco as well which said it came with queso, but not enough to comment. It was also very good, slow cooked, nice texture. \n\nMy boyfriend ordered their Agave flight which is a 2oz of tequila, mezcal and sotol each, bartender's selection. ya know. again, we were here for the tacos. \n\nI've had the Mosto house margarita (on the rocks) and the Paloma which is a grapefruit based tequila coctail. Both good, fine...$9, maybe. \n\nThe ambiance is really chill, dim lighting wasn't so good for eating, but it makes everyone look good. I wouldn't try to roll through with a group larger than 4 to this place...if you get there early enough you can snag the 2 large top tables in the back of the bar, otherwise its tiny bar tables with a very narrow bench. Either way, don't get confused, you're here for that Pastor!\n\nside: On NYE we did pop over to Tacolicious which I guess is an independent-ish venue (expanded menu, tacos are $3.95, taquitos for $9 etc), if I were just going out for drinks and a snack or a first time date I'd stick to Mosto.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "A perfect bar to start an evening or grab small bites and a drink. The margaritas are delicious and strong. The tacos are tiny but pack a lot of flavor, especially the pastor and chorizo. Lots of grilled queso fresco on the tacos, which makes you wonder why all food in life isn't topped with it. The menu changes a lot, but the specials, which vary from chicharones to ceviche, never fail to impress either. I only wish they offered happy hour.", "author": "Emma R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "I am a big tequila fan, and any place that can offer me new drinks at a reasonable per-cocktail price is going to get a bonus star from me. I did like their food, too--just make sure you take THEIR menu and not the menu from next door. They have separate registers and menus.\n\nThe place seems like a winner if you come at the right time of night, before it gets packed. Once the crowd fills the place up, you really feel the crunch as elbow room becomes a precious commodity. And I'm certainly not one to get in the way of people having a good time with liquor, but you will find it very difficult to eat anything if there or do a tasting if drunk people are bumping into your table or stool as they try to squeeze into the bar.\n\nThere is a TV on the back wall, but I wouldn't recommend this place for a baseball game on a Friday night. The high noise levels and tunnel-design of the bar will make following the action a bit difficult.\n\nNice bar though, I will be going back to do my tequila snob thing.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Amazing Hamburgers, and tacos! What a gem! Seriously would rate this on my top five best hamburgers in the U.S. , and Ive traveled quite a bit. Great for a group. I would make reservations ahead of time for a large group.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-11", "description": "They wont let me eat salsa and chips in the bar food section of the restaraunt. What kind of fake mexican facade do you think you are? Salsa and chips. Will that ruin everything? Will your restaraunt be burdened by the extra work? Are you fucking kidding me?", "author": "Ben J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-24", "description": "Terrible! The waitress was snotty and kept glaring at us because we sat down on our own. (There were no signs and no one at the front).  Then our server was no where to be found. (I think it took 20 minutes before we saw her again to get the check). to top it all off, manager informed us that he couldnt take anything off our bill because it would set a bad precedent. I wont be setting the precedent of giving this place my business again. Terrible.", "author": "Brenton M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-04", "description": "I was led to mosto under the impression that they served sangria. apparently, its the restaurant next door (same owner) that has sangria as this is strictly a tequila bar. i actually hate tequila, but i could down a margarita. so my friend and I ended up staying and having a pretty good time. i also LOVE that they serve small bites.. i had a taco which was so delish! nice little spot in the mission, i'd definitely return!", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-09", "description": "Love tequila. Love a tequila bar... but the staff here need some serious schooling. Our waitress sat 4 obnoxiously drunk fellas at our table who commenced to pound on it, yelling at the TV, the walls and each other. The wife and I opted for a quieter corner to finish our drinks. We paid the waitress on first sighting and she ran off with a significant chunk of change and disappeared. I eventually gave up the hunt, cut my losses and joined our friends for dinner across the street.\n\nThis proved to be a miserable place for a pre-dinner cocktail. It's more the kind of place to get your party on, Cabo style. With enough tequila, this place would be just fantastic!", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "Tequila selection is great, but the margaritas and other mixed drinks were lack luster. Mixture was pretty off to the point that the sweet and sour or agave was over used. Go there for the tequila and carnitas. Leave if you want a mixed drink. Great music selection though.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "Delicious margaritas and tacos! A great place to start the night.", "author": "Moe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "We stopped in here while waiting for a table at Tacolicious, and they made our two hour wait FLY BY!  It was my sister's bachelorette party and they treated us great!  Our bartended Ryan was by far the nicest and most friendly we had encountered this weekend, and he made her feel very special. He was also great at helping us choose the drinks that each one of us would like. Not to mention the street tacos were to die for!  If i lived in SF I would visit this place very often, but it is definitely a go to spot everytime I visit now!", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "Had some friends fly in from Hawaii recently and we were in San Francisco looking for a place to have some margaritas. I actually found this place last minute on Yelp and decided to check it out. Id give their margaritas 5 stars! The drinks were a little expensive but definitely worth it. I really enjoyed the atmosphere as well. The entire ceiling was made out of jars which you can unscrew and put things in for fun. Our waitress jumped up on a table to get one down for us and she was really cool. I had a blast in here and really do wanna go back there sometime to try their grapefruit drink!", "author": "Grace H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "We and the besties came here on New Years Eve because we refuse to pay a $10 cover change for Casanova. This place is best described as a New York hipster style bar and restaurant. They make their own \"chicharron\", there tasty with chile lime salt packaged with in house label but they are really no what I consider \"chicharron\" because there is no crisp fat on the underside :(. But the al pastor tacos were on point! And the drinks were nice and strong. Definitely will be back to this place, to really check out the menu and entrees!", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "$1.50 mini-tacos, $3 tamales, $3 beers, super casual staff who're having fun (and doing shots!), and loungey cozy relaxed atmosphere.  And serving food til midnight?  Sweet.  I like it better than Tacolicious.  More civilized and cheaper...", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "This review is long over due, as I've been frequenting Mosto for quite awhile now.  The drinks are good - little expensive though, by hey its Valencia so you can't complain too much. The burger is frickin amazing, not your typical so definitely give it a try.  Tacos are delicious as well, but the real standout here is the service; the cocktailer that is always working absolutely kills it no matter how packed it is!", "author": "N T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "The place was jumping!! really busy but worth the wait . Great Tequila selection and the  Margaritas were very tasty!!. The service was really good. we had the taco platter and tried all of them. some were really good and some were a little bland . I will come back for sure. and try some of the other items on the menu.", "author": "james m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "LOVE LOVE LOVE this place!!!  \nGreat music, great drinks and great tacos.  It's one of those rare places I feel relaxed and can hang out, not minding the wait, listen to good music while waiting and checking out good looking people. The only thing is you do have to wait, a lot, but it feels faster.", "author": "Ellie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-29", "description": "crowded hipster bar... meh \ncame here for a friend's bday otherwise i wouldn't want to be here too crowded and the drinks are ok", "author": "Christine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "The place is small but the drinks are STRONG! Get a margarita and the fresh appetizers, they are delish! Be patient, it will be crowded, but that means it is worth it.", "author": "Alicia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "PROS - \nTEQUILAS!!  \nService was personable and attentive\nTacos\n\nCONS - \nThe next day.....", "author": "Monica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-18", "description": "This place was alright. People raved about this place, but it was nothing to really rave about. Customer service was not that great. We ran out of salsa and chips and we had to ask for refills. The set up of the good was nice. The look was better than the taste. Salsa was good though, but wouldn't come here again for over priced tacos.", "author": "Linda V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Refreshing michelada's, extensive tequila selection, friendly bartenders, and some of the tastiest $1.50 tacos! Seriously tasty tacos!", "author": "Griselda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-13", "description": "Cocktails and food might be good. But don't attempt to come here for beer or wine. Wine is awful not sure if open for long or just bad and beer selection is kinda poor. :)", "author": "James O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "Tiny spot attached to Tacolicious with tasty tequila cocktails (la paloma gets a thumbs up from me) and a fun glass jar ceiling. If I didn't have plans to feast on some tasty roast pork later on that evening, I would have been all over the roasted meat twirling on a spit near the bar. Food smelled delish!", "author": "Karena Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "Delicious cocktails, friendly bartender and yummy food. We popped in around 9:45pm on New Year's day. It's got a cool vibe. Warm dim lighting with canning jars lining the ceiling. We sat at the bar and admired the numerous bottles of tequila. The tequila list is a pretty neat read, with witty descriptors such \"burly\" / \"mo-fo\". I'll stay away from the \"burly mo-fo\" type of tequilas...need something more tame such as \"pink bubblegum\". I ordered the La Paloma cocktail (made with Jarritos Toronja) $9 and an Al Pastor Taco $1.50 topped with a slice of pineapple. The food order arrived with miniature squeeze bottles of creamy chipotle and green sauces. I don't remember which cocktail my friend ordered but it was tasty like a margarita on the rocks $9, and he liked his tamale $3 enough to order a second one. I just needed a snack, and the little taco really hit the spot.The drinks and food came out quickly. The service was great. You look at the bartender like you need him, and he comes right over to assist you. Of course it helped that it wasn't busy. ;) The bartender was terrific with refilling our water glasses, too.", "author": "Liv K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "I love love love this place..beautiful,fun,and delicious! Friendly,knowledgable service staff. Tacos al Pastor,the La Paloma,so many great tequilas on hand,and you can totally geek out on Mezcal. LOVE", "author": "Shelley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-20", "description": "tacos were just okay. Nothing amazing. The beef was too salty. Waitress provided good service. Was really really loud. Salsa was fresh. Wished the chips were warm and crispy.", "author": "Ju T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "The Tequilas were great - the hubby and I had a great time. The bartender knows his tequila stuff we think because he sure knew a lot - I don't. The blanco tequila was my favorite in the tequila flight. The food was OK - the menu seemed small and and could do with a few more choices. The service was good without being in your face.", "author": "Saloni H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "Jaime the bartender was so helpful in concocting the perfect drink! You're one superb mixologist! Thank you for defining what the standard should be! A+++!", "author": "Mei F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-17", "description": "Great little bar next to Tacolicious in the Mission.  Great spot to swing by for a beer, some tequila and an al pastor taco or 2.  Staff is awesome, knowledgeable and friendly.  This bar is tequila centric...so if you like the stuff, definitely go here.  Well done to the Tacolicious crew for a new cool spot.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "Danger!!!! cheap delicious mini tacos and several tequilas to keep you entertained at the bar for hours! my first visit to Mosto quickly ensured a long time relationship to come. 2nd date butterflies!", "author": "Carolina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Best tequila bar in town. Great drinks, great snacks, exceptional bartenders!", "author": "Tatiana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Early on...drinks are amazing. Perfectly matched tequila and their choice of fruit. Margarita Picante has a splash of red chili pepper vinegar coursing through the el jimador. If I could only do this at home. Must try the albacore tuna tostada, a new favorite food. Super cool space outside on a sunny day. Rounding down to 4 stars. Maybe a 4.5 star lunch but will wait to try more local spots to be sure.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I'd say this is more of a 3.5 star place, but I will round up a bit as I'm feeling generous today.  The drinks are good (but about $1 overprice imho), the service is decent and the atmosphere is refined yet relaxed.  Great place to come when you actually want to have conversation with friends.  Love the mason jars on the ceiling.  Try La Paloma, the St Germain grapefruit tequila cocktail.  Despite the fact that it was likely a dumb idea to put a Tacolicious in the middle of the Mission (and it was super dead on a Sat night at 10:30pm), Mosto actually works.", "author": "Toby C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-18", "description": "A dark, noisy, well-decorated bar that's nice for a decent margarita.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "A fine new addition to the mission - a bar with food + a very cool ceiling.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Fun vibe, great bartender, fab drinks and tasty tacos!", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-26", "description": "While I don't seek out tequila in general (it makes me craaaaaazy...), I stepped into this new neighborhood place the other night, and I'm so glad!  We've been watching the build-out of the new space, and were impressed with the developing ambiance, and happened to stroll by the \"soft\" opening on a Friday evening.  We were greeted enthusiastically by several staff and ushered through the T-Lish space, and found cozy seats at the Mosto bar.  While the wine pours could be more generous, the tequila-based Lil Devil was stiff and tasty.  There are at least 85 million kinds of tequila, and absolutely delicious little tacos with house-made spicy sauces.  The Valencia Street corridor gets thicker with great food every day...", "author": "Ciara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "Sadly, I had eaten dinner beforehand, so I didn't take advantage of the cheap taco/tamale offerings, but I enjoyed my refreshing grapefruit-y paloma.", "author": "Negien M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "Was just there yesterday for Lunch and it was amazing. We will return to enjoy the excellent Tacos and the many other dishes you have to offer.", "author": "Jose A I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-04", "description": "This place is great! My hubs and I went here recently at the suggestion of a friend who lives in the area.  Everything tasted delicious and super fresh.  We had a pitcher of the house margaritas, which were perfect and not too sweet!  And split the kale salad, chicken and lime soup and the BYO taco special that night.  All were superb!  Only downfall was the server forgot our order of guacamole, but looking back now I don't think our bellies could have fit anymore food so it turned out for the best.  Can't wait to go back!", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "Best tacos!!! We were so happy to find this place by chance, totally enjoyed our meal. We likely return more often with friends, I have no problem to give it a five stars.\n\n-- I do have one concern: I saw waiters refill chip baskets by hand, I don't think they wash their hands when the place is busy. What happens if it is right after they take someone's money or credit card. So far, none of us got sick, it might not be very big concern. However, I hope staff at Mosto read this, and improve; then I have nothing to complain.", "author": "Liv S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-19", "description": "First of all parking sucks!....food is not that great i had way better tacos al pastor, service is really bad and they take for ever to get u anything from either the bar or any simple task....and last but not least the salsa plastic bottles look like little happy meal toys.....", "author": "Raul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "so wish they opened later than 12 on weekends , very cheap tacos and the pastor is out of this world , burger were cooked just like they should be . amazing bread buns and  the waitress is the best part ,  here is a little conversation with her , standing by the bar where the food comes out i decided to be polite and asked her if i was in her way , she replies : don't worry if you were in the way i would have pushed you already  haha ain't she cute !!, can't wait to go back", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "Went there to have a nice night out and WOW what a great place to hang out with Friends..The best food and drinks. Try it you will not be let down", "author": "Steve J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "love tequila and mezcal and love this place! i always sit at the bar so i can chat with the bartender and ask questions about he gazillion tequilas they have. they always have a bartender's flight which i usually get so i can try new things :-) they have some pretty good snacks too, but i come for the tequila and mezcal, sip it neat, and enjoy. yes!", "author": "Miss T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-07", "description": "Disappointing. I was excited to try this place--a tequila bar in the mission with an outdoor patio. Decor was fun. Pricey drinks ($9 for a tequila drink, beer was less.) and not much space. It was a Marina meets hipster/dot-com type crowd. The biggest reason for my 1 star review was the service and closing time. Apparently, this bar closes at midnight?!--it's rather strange for a bar to close so early. Our friends had just ordered drinks 5 minutes ealier and the bartenders didn't warn them they were about to close--they just happily pocketed $20+. So we had to chug expensive drinks before they booted us out. Classy.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "ADORE THIS PLACE! Checked this place out over the holidays. Amazing tacos, queso & tequila cocktails at the bar after a short wait. Servers & bartenders were super, as was the food & the drinks. I have been less than impressed with the fancy cocktails at some other spots, but Mosto's drinks floored me -- in a good way! If you like hot stuff (and I do!), try the Pasion drink. Best drink I've had, maybe ever and mos def best tacos i've had in the Bay Area.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "Mosto is great - the bartenders are friendly and helpful and had great recommendations.  The drinks rival Latin America Club as far as alcohol content...  we didn't eat here (ate at Tacolicious) but the small menu looked great.  Love the decor and feel of the bar; great tequila and anejo selections!", "author": "Cheryl E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-21", "description": "cool spot. really love the tacos behind the bar. went to their other place in the marina a while back and liked it too. make sure you check out the ceiling, it's like nothing i've ever seen before. i asked the cocktail girl if i could put stuff in a jar. she said no. ouch.\n\nstill though, mosto has a cool vibe and lots a great tequila.", "author": "thad b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-21", "description": "I was actually inspired to join Yelp just to write this review. Mosto has potential to be a great spot, but our blonde waitress completely ruined my experience there. I met some friends at Mosto before having dinner nearby and we all ordered a drink and some tacos. After about 20 minutes everyone had gotten their drinks and tacos - I still hadn't gotten my beer. The waitress stopped by and said it was because they had to change the keg (understandable) so I cancelled the beer since we had to leave soon for dinner. Apparently the bartender didn't get the message and still poured the beer a few minutes later - another waitstaff brought it over to me and I told him I cancelled. He said oh ok, well you can still have it. I took the beer - not really even wanting it - and our blonde waitress came over and literally GRABBED the beer out of my hand and said in a horribly rude tone \"you cancelled that.\" Everyone at our table and nearby was pretty shocked by the incident and how loudly she yelled. I really want to like this place, but if their staff doesn't get a better attitude it will not survive.", "author": "jennifer d."}
