{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Love Muddy's coffee. It's the only place provides free WiFi around the area. And on Sunday, San Francisco philosophy group discusses philosophy there.", "author": "Chicken B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-03", "description": "Interesting little coffee shop. $2 for a hot tea and $3 for a croissant I think makes it a little bit more reasonably priced than most San Francisco coffee shops. \n\nThere isn't a lot of natural light and it seemed pretty stuffy though. Wouldn't be my first choice for a place to get some work done but there was actually a decent number of people in there. \n\nA lot of the clientele seemed pretty local.", "author": "Alyssa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-14", "description": "Friend and I dropped by to get our coffee fix before heading to Dolores Park. I ordered a medium cappuccino and it was too hot to drink and tasted just ok. :( My friend also complained about their drink being too hot. The price-to-coffee ratio was competitive with other coffee shops in the area. On the plus side, there was ample seating and lots of power outlets; it was pretty quiet too, making it an ideal place to work/read/have quiet productive time.\n\nOverall, it was just an OK coffee shop. With all the alternative options in the Mission, I probably won't be coming here again.", "author": "Lucine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Very good place to meet friends, study, free internet for consumers, usually with some space, no always full,  coffee  is  awesome and there are variation of food to try... more than 8 years visiting this place.", "author": "Eduardo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-17", "description": "I walk up to the counter and didn't get a greeting. Ordered an iced coffee and the guy behind he counter had little to say. I couldn't connect my phone or my laptop to the Wi-Fi here. Sure there's lots of tables and wall plugs to charge but I'll seek another coffee place that has some semblance of customer service next time.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-12", "description": "I'm very disappointed of this place. Really bad service. Dry pastries. ok tea. But definitely a one star kind of place with the grumpy barista behind the counter.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "The best neighborhood cafe in San Francisco.  The coffee is excellent, the matcha is delicious, and they have the very best empanadas in the Mission!", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Muddy Coffee House is \"like an old friend!\"  It's the kind of place you walk into knowing its been there for decades, and quite possibly on a rare occasion, some of its clientele can be seen wondering around which actually, made the view quite fascinating.\n\nThere was an elderly lady that sat across me who looked to be quite up there in her years.  She sat comfortably, probably in the same location she has sat in years along with her collections of books, while she sips her favorite beverage, and enjoys the crowds attention!  What a sight!  She was dressed to the nine as most women of her status would dare not be seen without proper gathering and perfect set of hair which by the way, she looked stunning!  It is so endearingly beautiful to find women with natural beauty.  \n\nThe barista who made my over-foamed cappuccino was quite intriguing.  She reminded me of a rerun series called \"Alice\" that I used to watch when I was a kid. There was a character by the name of \"Flo,\" (Polly Holliday) who played as a fellow waitress who had a bit of a \"sassy, man-hungry demeanor.\"  She was well known for her one-liner, \"Mel, you can kiss my grits!\"  \n\nInterestingly enough, that very same woman reminded me so much of \"Flo\" as she had more interest in TEXTING (which back then that would be like filing her nails), and then looking up at me and said, \"I'll be righta with ya hun!\" The only thing that was missing was probably the chewing gum effect.\n\nAt that point, I really didn't care much about her \"blah\" service, I became enamored and found it quite fascinating to be surrounded with a group of eclectic intellectuals, doing about the things that they do daily, all comfortably plopped in their very own \"nooky spot!\"  That was quite an amazing cappuccino!\n\nUntil then, Cheers! :p", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "I have not tried the good but the chai is divine. Masala chai almost burnt my Youngs off form spicy was not temperature and that's the way I like it! Seriously the nicest barista I've ever had and very personable and welcoming. Lovely to sit and hear the locals speaking Spanish and enjoying cafe life at night not just in the am rush to work. Location ideal and plenty of not shinty seats and outlets available. The way Starbucks should be. No whitewashed product, just simply delightful with unreal fair prices paying 10-15 cents more for larger sizes drinks and free smiles and wi fi! New favorite hang out for sure. Plenty of tables and games for those who like them.", "author": "Allison I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Greatest coffee house on the planet. First came here in 1993. Still my favorite. I've always had the greatest experience every time I've come here. \nThe best people, the best coffee!!!!", "author": "West K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "The pastries are good. The salmon bagel is delicious as are the others. The coffee: acceptable. Service is friendly and fast. I'm a regular and it starts my day off right :-)", "author": "David F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "This is just enough off the beaten track to make a satisfactory respite from the hurly-burly atmosphere on Valencia between the two BART stations. Sure, there are a number of coffeehouses that serve much better coffee on this stretch - Four Barrel, Javalencia, Ritual, Borderlands - but they tend to crowd fast with the hipsters during the weekend rush. Not Muddy's. Still as a tomb in here with laptoppers commandeering the tables along the walls to be close to their beloved outlets (see photo). I get what people mean by the lackluster service. When we came up to the counter, we were waiting for just about anyone to show up for a good five minutes before the server finally emerged from the restroom.\n\nLeave a \"Be Back\" sign, will ya? I don't even remember the drip coffee she served me except that for less than two dollars, it was strong enough to keep me up that night. Looking for something sweet after our dinner at Alhamra, we noticed one last slice of a Vegan Carrot Zucchini Bread on the counter for $2.25, so we decided to share it (see photo). What a surprise to find it was quite tasty and not as mealy as you would expect a vegan mix to be with the carrots providing the right level of sweetness for what we had in mind. We ended up sticking around for at least an hour since it was fairly tranquil in there with only the occasional keyboard tapping providing the only diversion from our own chatter.\n\nCOFFEE, ETC. - 3 stars...decent caffeine but that vegan bread surprised me\nAMBIANCE - 2.5 stars...looks tired and a bit grungy as others say but it's comfortable enough if all you're looking at is your laptop screen\nSERVICE - 2.5 stars...kinda indifferent\nTOTAL - 3 stars...good back-up alternative to the more popular, fashion-forward coffeehouses in the area", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Once in awhile you will happen upon a place that has such a strong ambiance and positive vibe and is so truthfully down to earth that it causes you to grow spiritually. This happens to be one of those spots. From the Indie music to the multi-cultural flavor of San Francisco's local citizens to the sheer deliciousness of the coffee and tea to the upbeat and very personal attitude of the staff, this place is a must-go for anybody traveling through the Mission District.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-10", "description": "My friend and I meet here to do homework. Every time we ask each other, \"why do we come here?\"\nThe Wi-Fi is spotty and almost never works for both of us at the same time. The place is dirty. The coffee is crap. Honestly, it's some of the worst coffee you'll get in the city. It's also overpriced, especially since it's just hot crap. There are a lot of weird people, and the art sold on the walls is really strange. I'd say you shouldn't go here, but I do...", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-16", "description": "Toilet is scary. Coffee is ok. Baked goods look so-so.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Came here to get some shelter from the rain and for food. I ended up with delicious smoked salmon on a garlic bagel and legit masala chai. Super impressed by the barrista's swift and friendly service. The ambiance and space was nice and not cramped. Music was chill. People were working in the cafe, and there are many outlets for your electronic devices.\n\nSolid 5 cafe in my book!", "author": "Joba B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Great spot for getting work done. \n-Plenty of places to plug your computer.\n-Good coffee\n-Simple selection of snacks", "author": "Hector M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "Saw the owner again today. Still remembers what my usual is. Looks like he will be there for good, even if the other wait staff changes!", "author": "Henry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-31", "description": "Muddy's\n\nNice to. \nMeet you.\nWhere you been?\nYou would serve me incredible things\nMocha. Coffee. A Muffin.\nSaw you there and I thought oh my god\nLook at that space, you look like my next coffee place\nMuddy's is where I wanna staaaay\n\nNo money, suit or tie\nBut I can read my magazines\nAin't it nice, free wifi\nGotta love that two dollar tea\nSo hey, let's be friends\nThey're dying to see how much I can spend\nGrab my wallet and my hand\nI guess bad coffee can work for a weekend\n\n[Pre-Chorus]\nThought it's gonna be forever\nNo, you're closing an hour before ten\nYou can't tell me when it's over\nWhen the sign says you're open\nSomething something starbucks lovers\nThey'll tell you I'm insane\nCause you know I love cheap coffee\nBut when you close (early), it's lame.\n\n[Chorus]\nCause I'm young and I'm jobless\nSo I took this way too far \nThis place has left me breathless\nAnd with a nasty scar\nYeah, all them starbucks-lovers\nThey'll tell you I'm insane\nBut at ten Muddy's is a blank space baby\nAnd when they close (early), it's lame.\n\n[Bridge]\nMuddy's only wants patrons it can torture\nDon't say I didn't say I didn't warn you\nMuddy's only wants patrons it can torture\nDon't say I didn't say I didn't warn you\n\nSource: http://www.directlyrics.com/taylor-swift-blank-spaces-lyrics.html", "author": "Philip L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-03", "description": "Literally the worst drip coffee I've ever had. As a \"Coffee House\" Muddy's has one job - provide delicious coffee. The coffee is not only not delicious, it's completely unpalatable. I threw mine away. People seem to like the chai. Perhaps they should rebrand as a \"Chai House\".", "author": "Dafna C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-27", "description": "place is very well located, near the bus station\nvery spacious, ideal to get a coffee and work ...\nwhen it comes to ordering food, the experience is quite different : I asked about more than 1 ridiculous piece of salmon in my 6$ bagel and the waitress just told me \"this is not possible, and this is not my business so I can't do anything about it\"", "author": "Mike O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "Great place to work! Wifi and outlets by every table. Bagel sandwiches for about $2.50-$4.50 and average priced coffee drinks (for SF).\nCash only but they have an ATM inside.", "author": "Miriam H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-11", "description": "was around the corner for an event and needed a cup of coffee to wake me up.\nthis is the closest coffee place so I went in after a friend gave me cash (I was warned they're cash only).  got me a latte and a pastry.\n\nlatte was bland. coffee was so-so.\npastry was okay, not great.\n\nlarge space, good amount of seats, service- just okay", "author": "Learnee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "This place is my recent studying spot:) I usually enjoy a cup of organic earl grey tea during my study.\nThe bus stop for tech employees is in front of this cafe, so I enjoy seeing them off in the morning:)", "author": "Maitai N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "Smells terrible. Flies are everywhere. It's muggy. Seems dirty. Poor service. Possibly the worst cafe I've ever been to.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Cheap, quick, and they make a mean Massala Chai! \n\nFree wi-fi with your coffee (although it's free either way, I got the chair first) big open space, not crowded, small wood tables and benches all around.\nOh! And there are outlets along the walls, in case you need the extra charge\n\nIt's a nice, open, well-lit coffee shop in a good location with everything I was looking for on a lazy Saturday morning. I came in looking for a tall cup of chai, a sunny seat with wi-fi and a breakfast bagel (I recommend the egg ham and cheese). They make the coffee/tea right in front of you by hand, and they're quick!\nThey also have an impressive rack of board games for people to borrow for their visit, I hear tell it's a thing and that they have game nights from time to time.\nThere is chill music playing all day, so it's not silent, but it's not glaring either. I found myself not listening to my own music and perfectly happy\n\nGood place, I'd come here again in a heartbeat\n \n(Beware! The seat closest to the window by the power box is cursed, I've been here an hour and every single person who sits in that seat spills their coffee all over everything. I've never seen anything like it)", "author": "Noah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "I really love Muddy Waters Coffee House. Its not to popular like Starbucks and the quality of of the beverages are right on point. There are actually two locations (that I know of) one on Valencia and 24th and the other on 16th and Valencia. \n\nThe atmosphere at Muddy Waters is always mellow and never crazy busy during the week days (I have no clue about the weekends). There is a large array of individuals from hipster to the corporate worker. Muddy also has free wifi and lots of seating so come down here if you want to get shit done. \n\nAlso the drinks are pretty damn good and the coffee is legit.\n\nProtip: only cash", "author": "Pablo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "A hole in the wall classic, muddy coffee house has a calm ambiance surprising\nTo find on such a bustling street. The coffee does not disappoint, I had a house coffee and was very impressed, and the service was prompt, polite, and extremely helpful. They have free in house wifi, and\nMore than enough comfortable seating at rustic, wood tables. Great place to meet a friend, or just to spend an hour reading or\nWriting.", "author": "Katy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "I'm enjoying an excellent Couscous Salad and Spinach & Fetta Empanada @ Muddy's. I'm the first person to try this salad as Muddy's is experimenting with offering a food menu to their already great tasting coffee.", "author": "Troy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "This is my first time trying a coffeehouse in SF, and I'm not disappointed at all. The cashier was friendly, and the barista was flexible with my order (which is a HUGE plus for me.) I ordered the Matcha Green Tea Latte, but I wanted it cold, so the barista made a reasonable accomodation for my drink. A little smile goes a long way.\n\n.", "author": "Jae S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "Muddy's offers convenience, but only average quality. Grab a coffee to go, but don't plan to stay long because it's not a great working environment.", "author": "Drew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "This place is what they serve - muddy water. I stopped in for a cappuccino and a paranoid guy with tattoos and a hat was making the drink. His paranoia seemed to get in the way of his barista abilities. It's easy to see he is under the influence of meth. The cappuccino water was so hot it ruined the taste of the drink. This guy was the weirdest barista I ever had to deal with. I can sum him up in one word - creep.", "author": "Jean Paul P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "Drop in once or twice a week. Coffee is good and good location to meet friends. I notice new barista is so friendly and goes out of his way to deliver good service a great improvement of former workers and owner who were so rude and drove many customers away. Needs help. Bathroom is still dirty and lacks paper on occasion. Food and sweets are good but run out. Need to order more for the after 5 pm crowd. This could be great with proper staffing and better management.", "author": "Rick P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "Coffee is good and strong, cafe has ample seating space, and they're open late. I love that about this place. However, I don't love that they're cash only. :/", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Friendly service, lots of seating, close to BART, lots of outlets, open late, delish coffee and food! Love this place! Only accept cash, but there is an ATM inside :)", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "I've been going to Muddy's for about 8 years. There are a lot of tables, a lot of outlets, free Wi-Fi and a relaxed atmosphere. \n\nI don't drink coffee so I can't judge that but the bagels are great and the people working there are very nice. Houda, the barista that works there most days, is great and knows about half of the customers by name. Our kids really like her and she has come to several of their birthday parties.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-23", "description": "This rating is for the house drip coffee.  \nIt is always better than the house coffee at Ritual, Mission Pie, La Boheme, Silver Coffee, Bello etc.  (surrounding stores).  It is super hot and perfect flavor.  Philz is as good but it's not a fair comparison.  Also you don't have to wait forever.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "This is my favorite coffee place starting today. I got an iced soy latte with no ice so it wouldn't taste watery and it was still ice cold. The man made my drink perfect. It was so much better than peets or Starbucks. The employees were very nice and service was fast. The coffee shop was also really clean and it was cute", "author": "Cass D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-31", "description": "Go here only on my daysoff. Good coffee decent food,but I always have problems with the server from the middle east!. She either forgets my order or takes a longer time then ususal to complete my order. So now I try to go there after her shift gets out in order to getgood service. Also when her friends are around forget ordering anything because she just talks to her friends.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "Big with lots of seating. Free wifi which seemed fairly fast. Wasn't crowded and wasn't dead. Variety of people coming in but mostly an older crowd. Generally low proportion of insane people. House coffee was completely standard. Cookie was tasty. The staff was really friendly to everyone that came in -- that goes a long way. I wouldn't come here to hang out with friends, but to work it's perfect.", "author": "James C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-26", "description": "bought an iced coffee...moslty for the bathroom privilege. the coffee was an undrinkable, gritty mess. bleck. service was also very unfriendly and cold. eek. methinks not for sure.", "author": "Rhiona A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "I'll admit, the main reason I gave this place 4 stars instead of 3 is because they are open until 11pm. It's pretty hard to find a cafe open past 9, and Muddy Waters' late hours are why I keep coming here.\n\nThis location is a bit nicer on the inside than the 16th & Valencia one, but the rest is the same: alright coffee, drab atmosphere, WiFi is unreliable. But they have electric outlets available. It's a good place to come when you need to get work on your laptop done. And it's really close to BART.", "author": "Al S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-12", "description": "Not looking good.\n\nMe: Stood no chance. There is a reason why Paul Van Dyk is a legend. He proved it again Friday. Needed twice as much recovery sleep as I got.\n\nMuddy: Space uninspired. Service cold. WiFi spotty. Kind of like a cafe time forgot.\n\nBut together we were the perfect pair. I needed an Americano like never before, and despite the uninspiring surroundings, Muddy Waters serves a smooth and strong one.\n\nLooks can certainly be deceiving.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-02", "description": "I can't complain. Affordable coffee, lots of snacks, wifi and lots of seating. Good place to study, not much ambiance.", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "Open & Friendly - Were the first thoughts that came to mind when I stepped into Muddy's. The atmosphere is sans any pretension of sorts & very conducive for work [Decent free Wifi connection]. The cheerful disposition of the baristas add to the positive vibe. Would recommend the chai; coffees on the other hand are pretty strong [if you're into that sort of thing]. Oh! They have board games! The place starts getting very crowded after 7:00 PM, so get there early, if you want a corner seat by the window with access to charging ports :)", "author": "Divya A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-20", "description": "I don't even know where to start. But we used Gopago for our purchase. The order was acknowledge and received by Muddy's. When we got there, she has no idea what's the ordering system they have. She was like \"did u order over the phone!? Because we don't do that! And I was like no, we ordered thru my phone. Then she was all stressed out, a busy location and calling someone about our order. Then she was like, we'll we didn't received your payment. You just have to pay in cash. Well duh! That got me mad since the payment was taken out of my account already, so I called Gopago.\nThey told me yes that coffee shop is paid. Anyways, I was never humiliated in my life that customers are looking at me. I don't have enough cash in hand and thank God for this sweet lady who lent us money. \nBut morale of the situation is stores like this needs enough staff and should not turn off ordering system or just don't use these ordering system if you don't honor it.", "author": "Mary Grace C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-06", "description": "Roomy. Grimy.\n\nGlacial DSL wifi too slow to support 12 concurrent users:\n\nDownload Speed: 504 kbps (63 KB/sec transfer rate)\nUpload Speed: 229 kbps (28.6 KB/sec transfer rate)", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-14", "description": "This place was horrible. The person behind the counter had the worst attitude, like his job was just so difficult. I work at a coffee shop, it's really not that hard to smile. The rice pudding I wanted (advertised by a big notecard) was out, so I got this greasy, disgusting tasting meat pastry that I'll never try again. My latte was burned, and when I asked for a new one, it was bathwater warm. They didn't accept credit cards, so I was stuck paying for my friend's latte and food. \nThis place SUCKS. Don't waste your time and money here.", "author": "Amilia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "Hipster-free. Owned/womanned by a woman who looks like a scarier version of Susan Sontag. She makes a mean White Mocha, but a weak chai, but hey, she gets the job done. Love the music in this place, as well as the atmosphere.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "The very kind owner made my brother and I some bomb smoothies this morning: \nbeet, celery, apple, flaxseed and some other healthy goodies.\nExcellent post workout juice. Tasty and surprisingly filling.\n\nI found a new go-to juice joint in the work hood.  OH ya!", "author": "Athena S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "Worst cafe. No wifi. Rude, condescending staff. There was a woman who sat on the floor behind the counter texting and when I asked her to restart the router because the Internet wasn't working, she took a long pause and said it was probably because I have a Mac. Then refused to restart it. So, don't come here to work if you need wifi or want a cafe with decent customer service.", "author": "Diana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "The coffee is solid, but the pastries selection really needs to be stepped up.", "author": "Catalina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-22", "description": "I got some good work done here. I found that the service was a bit slow and the latte a little weak. There is one woman working behind the counter and she is making all the drinks one at a time. Efficiency-wise probably not the best. I hope for busy times there are more people working.\n\nThe other very strange thing is the fact that they buzz you into the bathroom and there isn't a way to lock the door (other than the buzzer they control). In theory, they could buzz another person in while you are going about your business. \n\nDecent internet speed and ample plugs. The people watching is also a plus. There are some characters in this place.", "author": "Peter V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-19", "description": "After our adventurous meal at Papalote, we walked around the corner to the Muddy Water Coffee and get a pick me up. \n\nMatt had the White Mocha. The 16oz drink, which cost $3.60, was very thin and lack of chocolaty taste. \n\nNiece ordered the Chai-tea Latte. The 16oz drink, which cast $3.25, was faired not much better and disappointed about the dilluted drink.\n\nLike Matt aforementioned in his review for Ritual Coffee House, that it's the best coffee house on Valencia St. If not, the entire city. This Muddy Water Coffee house is the opposite and Matt will let you smart-yelpers figure it out.\n\nAdd one star:\nThis place has Ms. Pac man, where you can sit down and play the classic game with you favorite coffee drink.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-17", "description": "My default source (mostly due to location) of average morning coffee. Came in for a latte and an hour of stupid clicking today in the evening.: my latte is just hot milk poured into an espresso - I'd give it 1/5. There's no vibe and it's way too hot inside.\n\nThe good: people really seem to like the bagels and the morning stuff is super nice.\n\nI think it's time to find some other place to buy coffee in the morning too...", "author": "Maciek W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "For sure fan of this place. I come here to work in the mornings pretty frequently. The people that work here are very friendly. Quiet spot with TONS of space, good food and drinks, and great Wifi speed. I really don't know why more people don't come here. Cheap prices as well. Authentic mission cafe.", "author": "Harmony P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "Don't count on the stated hours. They stop serving anything 40 minutes before they actually close.", "author": "Timon R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "A 3 star coffee shop that should only get 2 but for some ephemeral feeling could quickly be a 5 star place.  Yeah, this is going to be one of those reviews I totally hate when I read it.  The description being 1 or 2 stars lower than the actual rating.\n\nHow to get 5 stars?  Throw in a few comfy chairs or a sofa, tea that doesn't come from Safeway and a bathroom that doesn't remind one of dysentery.\n\nLets start with \"Dysentery alley\".  The facilities are just old and run down, I don't actually think it is that filthy but two trips through there put me in mind of Trainspotting or Calcutta for some reason.\n\nThe tea is from a bag that can be bought at fucking Safeway.  Seriously this is my biggest complaint with Muddy Waters.  I can't be to hard on them for this because it seems to be the standard in San Francisco coffee shops, which is a shame because I want good tea, just not from a tea house.\n\nAlso, someone mentioned the pot of tea coming with 1 bag.  I know, wtf is that?\n\nGood prices, good internet, plenty of seating and outlets.  I like the feel of the place.  Getting their act together on the tea front would go a long way to making this one of my favorites.  Doing something about that bathroom would as well.  Not sure with the space they have how practical putting in some alternate seating would be, it would be nice but what they have is good.\n\nI'll continue to frequent Muddy's, and continue to bitch about the bags of tea.", "author": "Max Jonathan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-04", "description": "The drinks are average, but their food selection is pretty bad. The only thing that's real food are the bagels (creamed cheese, egg, etc.).\n\nThe place seems to attract scummy, crazy people that hang around outside and sit at the outside tables. It's probably due to the liquor store on the corner and Muddy's is unfortunately the closest place to sit.\n\nThe bathroom is, well, let's just say it's an \"experience.\" I wouldn't go there at all except I attend a weekly social group that just happens to meet there.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-19", "description": "I'd like to give this place three and a half stars, but that is just not an option. I came here to get some work done after I couldn't find a seat at Philz and I have to say, it's a very nice place. The coffee is very good, abundant seating, and the tables are nice. The only problem: the wi-fi wasn't working. If you're looking for a place to read or just do anything that's not on a computer, this is a great place to go to though. It's quiet, spacious, and (once again) the coffee is pretty good. Plus there's no crappy music like the hipster places down the street.", "author": "Dylan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-07-23", "description": "Ok tea but you can't go wrong with water and a tea bag. cheap for sure but the library is free..\n\nBad mocha\nbland hot chocalate,\nshady atmosphere,\nquirky customers great for people-watching \nunsanitary bathroom, \n\nWHY IS IT POPULAR? Certainly not because of what they have for sell.", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-04", "description": "I freaking hate it when people bring their smelly pet's inside, \nits a freaking food eating place, not a pet fucking coffe house....\n\nI am afraid this violates the Department of Health Services, \n\nI am down for the Woking Dogs, to assist the legal blinded,  \nbut not for people who think their dog is a freaking person....\n\nCOME ON!", "author": "Davis E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "What's with all the Muddy's hate/ambivalence?  \n\nI love this place.  The coffee is solid, the wi-fi is reliable, and they're generous with the lox and cream cheese.  In fact, I think the coffee is around the best in the area, and the prices are pretty reasonable, too.  Best of all, there's a lot of seating, and there's never the 15-minute wait for a simple cup of coffee (which you sometimes get at, say, Ritual).", "author": "Maisie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-08", "description": "Muddy's is a bit rough around the edges, both in its setting and its products, but it's a pleasant place to grab a cuppa joe with your laptop.\n\nIt's spacious with plenty of seating including benches along both walls.  A bigger table promotes talking to strangers if you're into that.  Free fast WiFi is there, as well as plenty of power outlets along the walls.  \n\nThe coffee is decent, as are the espresso drinks.  The frills are few (large tank of half-n-half, no fake sugar selection out) but they have a good selection of pastries, bagels (which are super fresh) and sweet things.\n\nThe bathroom has a buzz-in door, so make sure it's known you're in there, and knock when you want in because if the barista buzzes someone in you're caught with your pants down.\n\nOne of the big silicon valley tech company transit coaches picks out out front so the crowd swells slightly in the morning.\n\nI come here when I want to get work done, not socialize, and be near Valencia/Mission streets.  I'd say you should too.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-26", "description": "This place was the worst.  Our first visit was our last visit.\n\nMy boyfriend just moved in down the street and we were really excited that he was just right across the street from the Muddy's.  Came in and the place had flies all over the place.\n\nWalked up to the register where the woman working here could obviously see us, but she was more interested in putting coffee cake in a tuppaware than helping customers.  After we asked for an ice tea and an ice coffee, we see her scoop ice out of a small igloo ice chest to serve our iced beverages in.\n\nFor my personal taste, I found it a little ghetto to see a cafe serving ice out of an igloo cooler rather than an ice machine like most coffee shops.  To top it off, she didn't look like she wanted to be there.  No \"hi\" or even a \"thank you\" after we purchased our drinks.  I understand we all have our off days, but I am paying you money and you could at least say thank you.\n\nThe iced coffee tasted stale like day-old iced coffee and the coffee bar didn't have any milk.  All it had was lids and a huge container of brown sugar with a spoon stuck in it.\n\nI'm not coming back here again.", "author": "Kameron K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-26", "description": "Had a mocha here before and a hot chocolate more recently.  I think I remember both drinks being average.  Atmosphere is average- there's nothing I really liked or disliked about this place.. it was an average experience.  I wouldn't go there unless I was in the area and really wanting a coffee-type of drink.", "author": "A T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-12", "description": "Stumbled in once randomly just to kill time.\n\nNot the most pleasant place to hang out, but it's got character, the originality and authenticity of...the mission I guess.", "author": "Yuchi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "My second favorite place to work. Unfortunately, I no longer live near here. My only complaint about this spot is how hot it can get - esp. in the summer. \n\nWhat I like about this place most is the music the employees play. Most of it is good. In fact, I have learned about a lot of music by studying/writing at this cafe.", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-12", "description": "Two stars because the free wifi worked and there's no way to give a business 0 stars, so I have to reserve 1 star for somewhere I get yelled at or scammed. But man, I wish I'd read the reviews before popping in here. Usually I always check that stuff first, but I was feeling spontaneous and there was a line at the counter - must be popular, eh? No idea why.\n\nCoffee: I got a drip coffee, medium, in a mug. Asked for cold soy milk, but their Kirkland soymilk didn't emulsify, so that came out gross. Hey, I've had that happen at home. It's not their fault. But I can't judge the taste of the coffee fairly. \n\nI can most definitely judge the disgusting spanakopita. I love spanakopita, and I've had it many times before and even made it myself. This was not good spanakopita! The barista microwaved it, but the dough was undercooked and the spinach and feta filling tasted bitter and old. I took it back and asked if she could pan-fry it, and she agreed to grill it - another reason for the second star. That salvaged the crust, but the filling was gluey. If you ever read Calvin & Hobbes as a kid, it was how I always imagined that green globbly food that attacked him must be like. \n\nIt's drafty, not cosy, although the music is good. I sat next to a woman who talked to her herself quietly for a long time. I thought she was reciting poetry until I caught the part where she claimed to be the head of the CIA. She left for a while & now she's back. Whatever, it's the Mission and she wasn't bugging me. But man, that spanakopita was gross.", "author": "J. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-12", "description": "This place is one seriously grungy San Francisco independently eclectic coffeehouse.  \n\nYuppy lady yelling at someone to keep theur conversation down while we she was on her cell phone.\n\nHomeless guy comes inside orders a latte, eats a cookie while in line then feigns looking for money we all know he never had.\n\nOld SF'ers sharing stories about the train tracks that used to run down some street.\n\n5 Macbook Pros.\n\nI LOVE SAN FRANCISCO!", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "Yeah, I gave it 5 stars... so what? I go there regularly. It's the morning coffee spot. I can't help it.\n\nReally, I just like that the workers there are so friendly (or at least they are to me). They remember what I like to get, which I always appreciate...\n\nThe only bad thing about this place is that during the day, it seems like there's just a LOT of older men there... alone... Some on laptops...\nI went there one day just to get a cup of tea and relax with a sudoku... I ordered my tea and looked for a place to sit... There were an awful lot of guys there, so there were only a few seats left. I sat at the one that was easiest to get to, which happened to be near this man on his laptop. He saw me sit down near him (not next to him), and he smirked a little, then seemed nervous and used a couple Guardian papers as blinders on the sides of his laptop (so I couldn't see what he was doing on his computer?). He continued to turn to take peeks at me, then turn back to his laptop... Strange.\n\nI relayed the story to a couple of friends and all their conclusions were the same: He was probably looking at porn on the free Wi-Fi Muddy's so generously provides for it's customers. Gross. HAHA!\n(Yes, I could be wrong about what that man was doing, but why else would he put up blinders? Unless he was a secret international spy and if I saw the information that was being sent to him he'd have to kill me?! Nah...)\n\nWhatever. I'm not gonna stop going there because of a weird guy on his laptop. The people who work there are too nice. I'm just not gonna hang out there by myself anymore...", "author": "Miss C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "Good coffee but not the cleanest shop.  Great community bulletin board for local events.", "author": "Joyce J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-10", "description": "I don't drink coffee. I know, I'm surprised I'm even allowed to live in the Mission. But I recently stopped in here with my boyfriend so he could get his fix and I could use the bathroom... \n\nNow I've been in a lot of grungy bathrooms. I'm the kinda girl that won't wait in line for the women's room at a bar; I'll just use the men's. And I don't do the hover thing. I'm not particularly germophobic or easily grossed out.\n\nThat being said, I think the Muddy's bathroom is one of the most foul places on earth. I ran out of it screaming and feeling like I desperately needed to take a shower. There's a layer of sticky on the floor so thick you can barely walk. There was no toilet paper or paper towels to be found. Which maybe explains the sign asking you not to put toilet paper into the toilet. So where are you supposed to put it? I look around. I know I shouldn't, but I look in the garbage can. And yes, it is full of extremely used toilet paper.\n\nThere's got to be a health code violation against this. Now I begrudgingly make my boyfriend walk the few extra blocks to Philz. Friends don't let friends set foot in Muddy's. \n\nBleh.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-12", "description": "If you've ever been to the Muddy's location on Valencia at 16th you know how infinitely better this location at 24th is.\n\nThey don't have all the stinky homeless guys cluttering the place instead it's filled with regular folks working on their laptops, reading books and doing homework.  It's relatively clean, the coffee is decent, and the snacks are yummy.  The service is friendly and they play good chill background music: blues, 60s soul, and 50s doo wop.\n\nIt's not the best in the area, but it's definitely a good place to sit and work for a while.  Free Wireless is a bonus.\n\nUpdate: Docking one star for only having one, grumpy, slow-moving person working Saturday morning.  It took me over 15 minutes to get my veggie bagel with cream cheese on my way to work. The veggies all tasted weird and old AND she didn't even cut it in half for me. boo.", "author": "Shayna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-02", "description": "SF Games - Friday's 7pm-Midnight (http://www.sfgames.org/)\n\nMuddy's is one of the many coffee houses in the city that serves a decent cup of java and has free wifi.  Unfortunately, I find that the music and clientele that frequent this joint to not be all that conducive to writing and working, and therefore I rarely come here.\n\nNevertheless, every Friday from 7pm-Midnight, this particular Muddy's hosts the SF Games Group.  If you're a fan of any type of games, whether card or board, strategy or chance, serious or social, there is almost certainly a place for you here.  As the website describes, this is a social group that plays games, so feel free to bring whatever game you prefer and try to interest others in playing it.\n\nI've only been one time so far, but I ended up having enough fun that I stayed until midnight even though I had a party to go to at 10pm.  I ended up learning two completely new board games, Samurai and Acquire, and because I wanted something familiar as well, I played a game of Spades with 3 of the regulars.  I only won one game, but I had a lot of fun meeting lots of new people, and even run into a couple of friends by chance.\n\nNext time I have a slow Friday, I know that I can stop by here for a game, a coffee, and the company of strangers and new friends.", "author": "Miller H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-11", "description": "Well, I recently went to Muddys for the 3rd time. It's a cool dive cafe with free WIFI. If your a student say whoot! whoot! \n\nThe chai there is strong, I think they put a little too much clove up in there. Otherwise, the coffee and cookies, especially PB cookies are really good. Cheap!!! If your tight on money just walk down to Kings Bakery on 24th and buy some pastries there,  Its like 69 cents each  and more of an \"exotic\" selection. Yummy!!!", "author": "Denise C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-08", "description": "I hate this place.  My hatred for it is largely related to the brutal meetings I had with an uncaring and inept advisor I had for my Major Project in graduate school.  \n\nIn my final semester in school, when I was supposed to be completing the equivalent of a master's thesis, he told me, after reading my work, that many people, after completing their MFAs, never write again.  (Thanks, you idiot.  Would you like to repay the $40,000 in loans I've taken out?)  He also treated me as if I were a precocious tenth grader in his first creative-writing class.  (\"Yes, I understand plot.  No, I don't need you to diagram the Arc of Change for me.\")\n\nI can't get near this place without thinking of him, so it's hard for me to like it.  It gets an additional star, though, because the orange juice is good and they have an old table video game.  (I think it's Galaga.)  Otherwise, the place is grungy, smells weird, and has some pretty rude people behind the counter.", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-11", "description": "A couple of heroin addicts were sitting across from me.  They'd been there nodding for an hour.  One leaned over to the other one to whisper something in his ear but he accidentally spilled his coffee, a giant puddle on the floor.  \n\nSilently, without the barrista finding out, they moved their skateboards, their duffle bags, and their clothes out of the way.  Then the table, four chairs.  The puddle oozed.\n\nThen they began moving the to-go boxes, toward which the puddle was relentlessly sliding.\n\nThey completed their task and I was the only one who noticed.\n\n\"That's muddy water, ain't it?\" one snickered to the other.", "author": "Abendigo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "Things I like about Muddy Waters: \n\nSpacious and mellow atmosphere \nUnpretentious clientele \nMusic isn't played at obnoxious levels \nNicely steamed milk with vanilla syrup \nParking on this stretch of Valencia is not as brutal as other parts of the Mission \nPapalote is right around the corner \nFree wifi \nWithin walking distance from my apartment (I only drove today because I was with someone on crutches)\nHearing Spanish spoken in a cafe in the Mission.  Imagine that!  \nThe Latin guys next to me playing cheese.  Laptop, what's that?\n\nThings I don't like:\nThe bathroom.  Not the worst however...", "author": "Liz P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "Went here a couple times on Thursday nights.  First of all, parking can be a bear here.  Second, this place is grunge city and puts just about any cafe in Berkeley to shame.  Cafe Roma has NOTHING on Muddy's ... so yeah it's not just a clever name.  As for the coffee, it's strong.  Strong like slap you in the neck, kick you in the crotch strong.\n\nDespite the grundge factor, there seems to be an air of pomposity here that I can't shake.  So I'd rather not go here but it's an interesting place to go and feel bad about yourself by people who clearly have stronger underarm bacteria than you.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-21", "description": "I was in Muddy's the other day when the CD player started to skip AGAIN!!! The barista was ringing up a customer so she just let it skip.  My patience long spent, I glared at her from across the room, telepathically commanding her to excuse herself for two seconds and kill the CD.  \n\nMy aim must have been off, because before the barista finished with the customer, a middle aged Hispanic woman emerged from a door behind the counter with an angry look on her face and stormed over to the CD player to remove the CD.  When the customer left she walked up to the barista and held the offending CD up to the barista's face.  \n\n \"What did I say about playing bad CD's?\", she demanded.\n\"I didn't know it was bad\"\n\"That's why the CD player is messed up you know.  People playing bad CDs on it.  I told you to throw these away.\"\n\"I didn't know who's it was\"\n\"I don't care.  You throw them away\" she scolded, and threw the CD in the trash.\n\nIf you spend enough time at Muddy's some kind of nasty scene is inevitable.  If it's not a skipping CD player it's a homeless person walking around yelling some bullshit while everyone averts their eyes, or heroin addicts nodding off and spilling their coffee on the floor.  The whole place vibrates with raw nervous energy, and your peace is always at risk.\n\nSo why do I give it four stars? Because it's strong on a couple important metrics most Mission coffee shops fall short on.  For one, there are always open tables.  I hate going to overcrowded shops like Ritual where getting a table is the biggest accomplishment I'm going to make while I'm there.  It's also very unpretentious.  I see just about every kind of person there: hipsters, middle aged computer programmers, new mom groups, whatever, and I never feel uncomfortable or on display.  \n\nIf you want the finer touches however, Muddy's is not for you.  The coffee is average, the music sometimes sucks, and the attitude of the baristas is often.......shall we say..... east coast? Still, it's the best place I've found to work, or at least convince myself I'm going to work and end up writing Yelp reviews :)", "author": "Six B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-01", "description": "Muddy's was around when I was in High School, it is still around, despite the Starbuckization of the caf scene and the birth of the Portland style gourmet coffee shop (like Ritual).  Why?  Muddy's does what it needs to do well and gives you no attitude about it.\n\nYes this Muddy's can be depressing, what with the numerous rehab/criminal diversion program sponsor meetings that seem to go on here (I think there's a Salvation Army halfway house down the street), but Muddy's doesn't try to chase anyone away (except for that one time with the ranting guy that smelled of feces).  Muddy's won't judge me for the fact that some weeks I'm in here 6 or 7 times a day for coffee.  They don't smirk when I still in the corner typing up a work memo, drunk at 10:45 PM.\n\nThey also have Tetris, which is cute, but the competition here is serious.", "author": "Gustie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-20", "description": "Muddy Waters makes a nice post-prandial stop, especially if you've just eaten at The Blue Plate and are headed back to the city's core. They're open late (by San Francisco standards) and can accomodate your desires whether they be for a white chocolate soy mocha or a peppermint tea with honey.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "Cool coffee shop.  I liked all the cartoon inspired artwork on the walls.", "author": "Alf O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-04", "description": "Best place for smoke-bound rehabbers and Russkie ex-pats to sit outside ogling office chicks on their way to BART.\r\n\r\nPotent coffee to be sure, but seriously, if you think the stuff they serve here is good, you're either in Rehab or likely will be at some point.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-31", "description": "I guess everyone else's already said it: it's a dive.  I'll admit that I'm not a coffee drinker; I only come here because one of the social groups I'm a part of (kinda) meets here weekly.   I love chai, but this place makes it too...gingery? They've taken my favorite drink and made me not like it.  But I gotta defend the bathroom: there's always TP when I use it. \n\nAlso, the people at the counter don't seem any more or less rude than the average person. No Mary Miss Sunshine, but no rudeness either and that's fine with me.", "author": "Yan E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-09", "description": "Kind of mission-gritty.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "I won't lie, this place is divey. The furnishings are old and quite random. The coffee is not the greatest, the baked goods are not the freshest, and if you want sugar-free sweetener you have to ask for it at the counter. (Apparently people were stealing it.) \n\nBut it gets four stars from me and I frequent this place more than any other in the city. Why? Because it's open late, it has free wi-fi, ample seating, and outlets lining the walls. This nerd-friendly atmosphere attracts interesting people, and they aren't afraid to talk to each other. The baristas are also quite chill and generally play good music.\n\nIt's a nice bastion of sanity in an increasingly trendy neighborhood. But don't bother if you're snooty about coffee - walk down the street to Ritual instead.", "author": "Anne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "It's open late.  It's got lots of tables and power outlets and free wi-fi.  On Friday nights there are dozens of people playing board games until midnight.  The food and drinks are ok.\n\nDue to the hours, tables, and wi-fi, I've been working here for most of the last couple of weeks.  Hot damn, do I love it now.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-13", "description": "I don't drink coffee so I can't vouch for their drinks, but I do like the atmosphere in here. Everyone is just there to hang out with their friends. Go there on a Friday night and everyone will be playing with cards and board games. My favorite part? It closes at 12am on the weekends, much later than the usual cafe, and offers free wifi.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-22", "description": "Very slow service, but the barista was very nice. It is directly accross the street from church so that was cool!", "author": "nick l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-18", "description": "i go to this place whenever im lazy to walk a block to Romy's Cafe Venice and in rush to head out to the Marin lands.\n\nThere are a couple of baristas in the morning that i like (the chubby and the buff one) their nice, but there is one Im guessing she's middle eastern, omg! doesnt know a single thing about customer service...even if you go there everyday same time for 2 consecutive weeks cant remember what you order...her mocha taste different everytime too...maybe because she doesnt pay attention too busy looking cute...there's a white dude who looks \"spacey\"...\n\nother than that if i just need coffee the place is ok.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "This is my neighborhood coffee place- the location is great; I can always get a seat to do some work or emailing on a weekend morning; and the jazzy music is great (though too loud sometimes).  BUT the service needs a lot of work! It is often understaffed and some of the newer staff are unfriendly and slow.  On the plus side, there is one woman who works there often (Houda might be her name?), and she is great. She knows all the locals, and she hustles, juggling several customers at once. Sometimes she's on her own, and there's a line almost to the door.  There's also a young guy who I see on weekends who is also friendly and hard-working.   BUT there is a new weekend lady who is unfriendly, doesn't acknowledge customers standing right in front of the counter, handles one customer slowly at a time, and looks like she'd rather be anywhere else but here. This coffee shop would be great if management would hire the right people and make an effort to have some minimum standard of customer service.", "author": "Nik S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "Totally chill dive coffee shop atmosphere.  Free wifi allows me to write yelp reviews about it while in it!  Many of these reviews speak of shady characters but I have never felt weird about being in here.\n\nI usually go with an iced mocha which is a little pricey, but I'll pay 3 bucks or whatever to chill for a few hours to study and do homework. \n\nI have always gotten a good seat and the same person seems to always be behind the register who plays good music.\n\nLike I said, kinda grubby and divey but I much prefer that to a snooty trendy coffee shop, Muddy's has that \"lived in\" feel I guess. I like it.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-06", "description": "Went to this place to read and have a cup of joe the other night.  Wasn't overly impressed with the atmosphere or my ice coffee for that matter.\n\nThe chairs were pretty uncomfortable. I think the Feng Shui was a bit off.  Although it did offer some great people watching and the array of local publications available in the window was far more extensive than I had seen before. Oh and I think it's open later than any other coffee shop in the 24th street area so that's a plus.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-01", "description": "Muddy's is your typical slightly dirty, not-too-crowded Mission cafe. Their hot chocolate is good and the service is usually pretty nice, but sometimes homeless bum-types come in here, so that makes the experience really unappealing.\n\nDespite the relatively low score I gave Muddy's, it's the cafe I come to most often. I don't drink coffee, though, so it's not that often. Good luck stalking me! Ha!", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "Muddy Waters was a happy find for me. Free internet, and LOTS of plugs!!!!!!! \n\nFun people to watch, and really friendly staff. \n\nOne hazard: Don't order a \"pot\" of tea! They only put one tea-bag in it, so it is not strong enough, unless you prefer your tea to taste more like water. Just get a mug, and you will be happier :)", "author": "M A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-31", "description": "The best coffee in all of San Francisco. They don't screw around. The secret is stirring the grounds as they brew it. It is black, it is strong, it does the job. They use Max's Blend, which I've brought home and tried to replicate the experience, but it doesn't respond well to my french press. Royal Grounds also uses Max's Blend, and does it up pretty good, but they don't stir, so it isn't as strong.\n\nThere are 4 or 5 locations. Muddy's at 16th is at the ground zero of all the grungiest things about 16th and Mission area. It's not that the bathrooms are so bad (it is) but the possiblity that someone is in there doing godknowswhat and taking forever. Joel who works nites on weekends is the Mayor of 16th Street. He makes the best mocha--- no sludge of chocolate on the bottom of Joel's mochas, he does it right. Muddy's at 24th is quieter. Muddy's on Church St. I don't like as much. I don't like the neighborhood, which is too bad, cuz walking there from my house is a nicer walk than going past the construction along Valencia St. There is a Muddy's on 29th St. kinda near Mitchell's that I haven't been to. There might be an other one, I'm not sure.\n\nIf you want Ritual, fine, but everyone there is nose-deep in their laptops and god forbid you try and strike up a conversation. And the coffee is pretty good, I guess. just don't go to Revolution Cafe and get coffee, their coffee sucks. And the service at Revolution is the worst. Sometimes I hate Muddy's but I keep coming back because I love their coffee.", "author": "kenneth m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-04", "description": "A few years ago one of my ex-bf and his pal's use to hangout in the one in 24th and Mission location and it was also run down (ie other ones in the city that others yelp about) yet they take indie artists' artwork and post them up. I recall that many of the items that were served were also found from Costco and Smart and Final ie cups, paper plates and Sabra Hummus... Anyhow the one that struck me the most was that not only did the place seem unsanitary, but the bathroom was filthy and there were flies present in the shop and it was at night!", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-10", "description": "This place is cool. The coffee is good, but I say the best thing about this place is the vibe it has. It's a good location and the owner is great. It's a cool spot if you want to bring your laptop and chill.", "author": "Johaun G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-04-24", "description": "I'm sorry if my ice coffee request is below your standard. \r\nPlease do not poor melted ice out of an ice chest that looks like it just came back from my Dad's fishing trip, into my cup and add coffee.\r\nOh, and that bathroom is as nasty as the person's making my coffee attitude.", "author": "Dixon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-06", "description": "I go to this place to assuage my guilt for being one of the \"trendy hipsters\" that drives up housing costs in the Mission. The drip coffee is pretty bad but is a good price in this New Economy.  Also, they are the only place I can find bagels without having to venture into godforesaken Noe. \n\nCreep factor among the patrons is unnervingly high. I once saw a guy who used full-body motions to describe how he wanted his bagel cut. The woman behind the counter still messed it up. \"Did you do that on purpose!?\" he screamed. I have never so feared for my life in a coffee shop. \n\nOh yeah, you have to get buzzed in to the bathrooms sometime. Just like those Starbucks in the \"transitional neighborhoods.\"\n\nI like the baristas - even the unfriendly woman in the morning. I think that kind of customer service is par for the course around 24th street. (see: Papalote)", "author": "Mission S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-11", "description": "It's Friday night and, after a long work week, I needed my caffeine fix to party on into the wee hours of the night. Though I originally wanted to go to Philz at 24th and Folsom, it had already closed for the night. Seeking salvation from slumber, I saw a shining beacon in the distance as I headed towards BART. Eureka! Muddy's Coffee House! It looked like a real coffee house - bulletin board overrun with community flyers (check), stack of Bay Guardians (check), uncomfortable wooden chairs (check). I should be in for a treat. Unfortunately, the coffee was true to it's namesake. While coffee is a hot and dark beverage, any hot and dark liquid isn't necessarily coffee. Whatever it was, it tasted burnt, left a sour, acidic taste in my mouth and an upset stomach.\n\n+1 for the hours (closes after midnight), +1 for an abundant supply People's Weekly World (I would hate to fight my fellow comrades for the crosswords and Ziggy).", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-23", "description": "I went into Muddy's while in the Mission and ordered a mocha.  The mocha wasn't as strong as I had hoped with the chocolate having a bland taste.  I got a strange vibe walking in here.  I'm with my friend John S.:  the place is grungy, smells weird, and has some pretty rude people behind the counter.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "We should forgive certain establishments their lack of cleanliness if it contributes to their charm.      \n\nUnpretentious.  Inclusive.  And the baristas always play good music.  \n\nMuddy's is exactly what a good coffee house should be.  The patrons represent a very heterogeneous sampling of every generation, race and occupation: Muni drivers, elderly waspy socialites, smelly unkempt artsy types, vanilla South Bay-employed professionals and, of course, your standard Mission hipster.\n\n(So what if their sugar dispensers are clunky, crusty-holed pylons of unwieldy plastic?  I make a game of it--the challenge to sweeten my coffee with grace) \n\nMuddy's is just what it is.  It's a place to drink coffee.  I expect nothing more and that's probably why I like it so much.", "author": "Theresa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "Can't blame the place for being a true Mission coffee diving hole.\n\nYou'll find in Muddy's Coffee the grungy atmosphere that you don't find anymore on Haight street. The type of place that really makes me feel in fog city.\n\nToo bad they've just closed the one on Church near Market. The place was crowded with coffee addict freaks and Macbook-to-the-bone wifi surfers. Heaven I tell ya.", "author": "xavier v."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-13", "description": "Meh. All the times I've stopped by on my way to clinical, the service has been slow and the drinks were always mediocre. It's definitely not somewhere I would go out of my way to visit and not one I would think of when I want a good cup of caffeine. At least the servers are nice.", "author": "Charlene S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-06", "description": "Cozy, friendly service, and an extensive coffee menu with generous cake slices and cookies tempting you too.\n\nCon, gotta have the sweetener and can't do with brown sugar. \n\nSlightly dive looking, but otherwise plenty of space and free wi-fi.\n\nI'd go back but probably feel more comfortable hanging on my own in the daytime, rather than in the evening. It was open as late as 8:30pm when we stopped in for a spicy Chai and okay drip coffee. \n\nI won't seek it out, but I wouldn't mind stopping in for a caffeine fix again. Especially after reading from another yelper that you can get sweetener at the counter :-)", "author": "Kirsten L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-14", "description": "Oh, Muddy's...I have such a love/hate relationship with Muddy's. One minute I'm in there enjoying one of the better toasted bagels and cream cheese that I've had all month...the next minute, they're giving me iced coffee that has a distinct undertone of rottenness to it (I kid you not). \n\nIt's a couple doors down from my house and often times, just so convenient that I can't pass it up...especially with my whole gotta-have-coffee-by-2 pm-or-I'll-get-the-most-massive-headache-of-my-life thing going on these days. I get screwed into patronizing them since I'm a bonafied slave to caffeine. \n\nBut, they really need to clean up their act just a bit...I mean, c'mon...I just get skuzzy vibes every time I go in there...I don't know if it has more to do with the motley assortment of people who tend be skulking around both inside and out, from all hours of dawn til dusk, than anything else...I just wish some kind of re-vamp could happen, to make it a slightly more pleasurable experience to get coffee at Muddy's...", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "Highlights: Nice weird employees, consistent service, strong coffee, atmosphere that welcomes you to stay.\n\nSo, I am biased.  I lived across the street and came here for breakfast the better part of a year.  After a few visits, everyone there knew me... everyone aside from the owners were always nice to me.  Even the grumpy girl who worked the late shift lightened up to me after a while.\n\nThis place has a cast of characters that rivals any tv show, movie, play, musical, etc.  There's the guy with the mullet who plays ms. pacman every morning.  There's the guy who looks like he's hanging out there because the halfway house isn't  his type of place.  There's the googlers that look kinda scared (please don't steal my mac), but they all leave promptly when the google bus shows up.  There's all the angsty-looking, tattooed, nice employees who seem to really just enjoy the job.  \n\nCoffee: Above average, not gourmet, but good\nBagels: All combinations, good, filling\n(I like non whipped cream cheese which is what they have)\nStaff: Nice but sometimes less than stunningly fast\n\nMy advice, if you're in a rush, and there's more than 2-3 people, just walk away, be hungry at work, if you've got the time, this made almost everyday of my job in South Bay better.", "author": "Josh Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-25", "description": "On more than one occasion I have gone to this coffee shop and experienced some of the most horrendous service of my life. A typical visit goes something like this: I walk in and the woman behind the counter takes several minutes to put down her cell phone and acknowledge there is a customer present, then proceeds with a grumpy demeanor (with a grimace on her face to match) to slam things around like it's a horrible chore to see what I want. On one specific occasion, I ordered one type of tea and quickly realized they had another brand that was somewhat out of sight that I would prefer. Upon asking her for the other type of tea, she slammed the cup down and told me, \"No. It's too late.\"  !!!?????!!! This is just one of the various lackluster experiences I have had with the rude staff at Muddys. If you don't want to work in a coffee shop, I'm sure McDonald's is hiring. I will never be a patron of this establishment again.", "author": "A F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-10", "description": "Boring.   Nothing good about the place, but nothing really bad except the atmosphere - big open room that needs some plants or good art.\n\nThey do have free wifi and good location - 24th and Valencia.\n\n3/5 coffee\n2/5 atmosphere\n3/5 service\n3/5 value", "author": "chad n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-30", "description": "I've been told that the game night has moved to Taqueria San Jose, next to the 24th Street BART station.  It's just as well because Muddy's is a filthy place with cigarette smoke blowing in from the smokers right outside the door.  Also, they don't keep their place very clean.  The bathroom is a mess and the tables are usually sticky.", "author": "Chilly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-01", "description": "2 stars for the hot chocolate - creamy and steamy but not particularly chocolaty, a bummer; I mean it's hot CHOCOLATE, hello?\n\n+1 star for the pleasant staff and the community atmosphere, a great place to go hang out with others or by yourself. I see folks playing board games there\n\nif only they had something worthwhile for this non-coffee-drinker to drink", "author": "Charles B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-03", "description": "Neighborhood cofee house with staying power - they've been there as long as I can remember and are good for a fix when you need it.   An interesting crowd, you'll get a few homeless folks in the door asking for your spare change, but it's all part of the atmosphere.\n\nI've  been in a few times over this years, but as of last weekend this place has really made a difference in my life.  I was in last weekend and overheard some in a very loud voice, obviously unsolicited, raving about \"kharmic parking\" - he just visualizes the spot and drives right up.  Not in a joking kind of way, but one of those slightly distrubed types that absolutely believes it - he swore by it.  I thought he was just another part of the charming Muddy's environment.   But yesterday I had been circuling for parking in the Castro for 10 minutes and decided to give it a whirl - I envisioned the spot right in front of JavaLisa cafe on 18/Danvers.   Sure enough it worked.  I tried it again today in Berkeley and I'm 2-0.   Unbelievable.\n\nSo when you go to Muddy's, give the coffee, clientele, and atmosphere a chance.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-13", "description": "This place has your usual coffee and pastries/bagels, but I really like it b/c it has plenty of good-sized tables and seats, plenty of outlets along the walls, free wifi, and great lighting for the tiniest footnotes in your law books even when it's dark out!  And it's only one block away from BART.  The bathroom is acceptable.  There are even some random Pacman machines.  This is definitely a place I could study all day and evening, except...\n\nNear the register there is this small sign that asks if you want to put up your art on the walls or have your music played.  That's great and all, but I'm not sure if that is why there is AWFUL seizure-inducing music that has been playing for the last 3 hours.  I am not factoring this into my rating of this place, unless they are playing this same thing again the next time I'm here, in which I will have to politely ask for an explanation of why they are playing music that makes me want to die.\n\nI'm not the only one either b/c there's this other guy who agrees it's causing him tortured pain.  No one deserves to be punished like this, except maybe the dumbass who posted a bomb threat on our school after the VTech incident.  Anyway, the only reason I didn't leave here an hour ago is that this is a great place to read my criminal procedure as long as I have my music turned up -- although unfortunately I can still hear that guy whining about something with some dissonant piccolo melody screeching along...", "author": "Erica Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-05", "description": "You know, I try, but I'm just not a dive coffee house type of girl.  I was actually on my way to Sugarlump (frequenting Sugarlump being step 2 of 5 for my latest project of trying to hipster-ize myself), when I gave up and stopped here instead. \n\nI got my coffee, sat down with my laptop and nearly froze in the draft from the always open door before leaving my half-finished coffee on the table.  \n\nThere were some middle school kids eating a pint of ben & jerry's at the table across from me, which is probably the first time I've seen that in San Francisco.  I guess school just got out or something, because the place was full of school kids. So, +1 for new experiences?\n\nThe coffee isn't even cheap - my latte was $3.60!", "author": "Maia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-03", "description": "1. one star for the cute guy working tonight(where is my mind lately,too much cute boy admiration)\n2.one star for the plentiful seating and allowing my friends and I adequate loitering time to conduct a book club\n3.last star for no weirdos like the other locale.\n\nmy latte seemed fine,but admittedly I'm not that much of a coffee drinker so what do I know?", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "Grungy yes, but no other like it.  After carb over-load at El Tepa Taqueria, we needed some Java to wake up.  We order 2 Americanos that were filled to the brim...hmmm, too much water.  Coffee is probably fine when it's not diluted.  There weren't too many folks here at 6:30, but that quickly changed as groups of people walked in with their board games and decks of cards.  The place started to look like a casino, sans the smoke and skimpily clad cocktail servers.  It was more like a bunch of people who have a standard Friday evening game at someone's house.  If you have your back turned to them, you can't even hear a victory peep out of them.  When did board games enter this level of geekdom?  'Settlers of Catan', where nobody is eliminated?  Give me Park Place & Boardwalk....2 hotels each....you owe me a zillion dollars...pay up! \nMaybe I'll start a Friday night Mah Jong game...", "author": "Arlene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-13", "description": "Great coffee shop!  It's an excellent little dive coffee shop.\n\nFree wireless (make sure you join network 'muddys' not one of the others that tries to collect a fee).  Plus a few computers you can use, I think those are free?  not sure though.\n\nI had a really excellent soy chai here.  Not too sweet.  Nice and spicy.  Yum!\n\nAlso!  They have tetris and Ms.Pac-Man... the old school table top type of arcade games.  Sweeet.", "author": "Joshua E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "First off,I love all the reviews.   Some of them are hilarious!  I had an appointment near  here and had about ten minutes to get coffee (well, a latte ) and get back to the office for my ride.  I, of course, would  have gone to  Cafe Boheme instead, but didn't think I even had extra time for that!  The latte came out really quickly, and it was the right degree of warm.    I am not sure I will come here again, as I do love my cafe Boheme, but it had good coffee with no attitude.  BTW, this place has tons of room for people in wheelchairs.", "author": "Sascha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-16", "description": "Muddy's has been my office away from the office. I don't necessarily come here for the coffee, but more for the atmosphere. WIFI connection is choppy, coffee and other beverages are mediocre, restroom is not so clean, but the crowd is definitely what brings me back each time. It's a really relaxing and unpretentious environment that draws me back week after week. Good place to meet with friends, but parking can be horrible if something's going on in the Mission.", "author": "Teresa Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-20", "description": "What is the matter with the daytime service in this place? The gal who works in the evenings is cool, but the daytime people give the impression they wish you'd go somewhere else. \n\nLast week I was standing at the counter and the two employees directly in front of me were yakking away totally ignoring me. It was really unprofessional. \n\nThen yesterday I was there and the clerk was on her cell and absent-mindedly filled my order. It took her several minutes to find the keys on the cash register because she was so absorbed in her phone call.\n\nOwner get a clue please, you are not the only coffee house in San Francisco and your service is very poor.", "author": "fishfry t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "True, this place is grungy and dingy, and often filled with laptop-iPod-iPhone-armed nerds and the occasional plaid jacket-wearing hipster, but--the coffee's not half bad. \n\nThe bagel with cream cheese, salmon, and capers is really yummy--a bit overpriced for what it is, but yummy enough to go back for more.", "author": "J K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "I purchased tea and a bagel. They were both great. The service was alright... the barista didn't try too hard to be friendly. She was just doing her job and treated me as another transaction.", "author": "Nica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "The place is not that bad. I don't get what's  everyones problem haha.", "author": "Mo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-19", "description": "I'm bumping them up because they have some new people that are friendly.  Coffee is still OK, had worse, had way better.\r\n\r\nOld Review:\r\n\r\nNot a big fan.  Coffee is blah, and the people serving the coffee are always very rude to me.  I don't know why.  \r\n\r\nIt's too bad because this is on my block.  But I'd rather walk a couple extra blocks to ritual where I can get better tasting coffee without the attitude.", "author": "sam p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-25", "description": "Cheap and relaxed and easy to get a seat near an outlet.\nA more interesting mix of people than some of the Wi-Fi-and-work coffee places around here. There are usually some old guys playing chess in the middle of the room, and some youngish kids doing what looks like a college art project in the corner near the indoor water feature (which itself looks a bit like an art project - but I love it, and the soothing water sounds).\nI only ever have my coffee black, and their depth charge (espresso in a drip coffee) is strong enough to keep me working for hours, and they have a good selection of teas for when I've finished my coffee, want to continue using Wi-Fi without being a moocher, but can't handle more caffeine.\nCan't speak to most of the food, although from the other reviews it sounds patchy, but their baklava is EXCELLENT.\nService is fine, bathroom is pretty awful, and the Wi-Fi has worked perfectly whenever I've been there.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-29", "description": "it's a divey kind of place.\n\nthe iced coffee was good and strong. they don't offer sugar substitutes, much less simple syrup. \n\nand i could have sworn it smelled like a wet dog in there.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "More authentic than Starbucks. Some people rag on the ambience, but come on! It's a locally owned café in the Mission; you'd think that the setting would come with the territory. I personally like it, and like the unpretentious feel of it. I feel as though someone like me can hang out there without showing up in a business suit or weighing 100 pounds, wearing a lumberjack beard, and wearing ball-strangling jeans.", "author": "Finn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "Generous pieces of cake, good chai. No, great chai. Not a big coffee fan, but the mocha tasted good to me. Come to game night on Friday at 7!", "author": "Alison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-31", "description": "I miss Muddy's! I have moved out of San Francisco and I still yearn for their coffee. Whenever I find myself in SF, I make a point to get a Muddy's soy latte!  At a recent job, I was forced to listen to a radio station that I disliked, but they did play one song that cracked me up because the lyrics say \"the best soy latte\"! That's Muddy's!\n\nI've been a vegan for many years and have had many soy lattes, but none compare to Muddy's.  Sometimes I find any excuse to drive to SF from Sacramento just to go to Muddy's (and Herbivore or Cha-Ya and Maggie Mudd).\n\nWhen I lived in SF, I used to hang out in this one and the one on 16th Street. I wish I could find a nice comfortable place like that here.", "author": "Tasha P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-31", "description": "I have been coming here for a few weeks and I really like the place. It is open late, has fast and free wi-fi, good coffee, and some food when you are hungry. The people here are just trying to study and get work done so that's a plus. It is far less \"sketchy\" than the one on 16th and Valencia.", "author": "Sirish M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "Maybe not the best place for coffee in the Mission, several other spots serve better joe.  Maybe not the best place to study either.  But, there are always interesting folks around.  \n\nOne night I was studying with a friend, and I noticed that the group across the room was speaking Russian (or Belorussian, or Ukrainian, whatever). I walked over and asked if they wanted to play Tetris because they were sitting at the Tetris machine (those table-top types).  Now, I'm good at Tetris, having grown up with an NES and a GameBoy, and I proceeded to wipe the floor with three of these dudes.  Then one of them turns to the quiet one of the group and says \"Nikolai, why don't you play this American?\" He said he didn't play Tetris anymore (I figured it was bad memories of Soviet Russia or something). But they kept insisting and finally he set his coffee down and sat across from me. He then says, \"Not play for long time.\" Well, I would've paid money to see this cat back in the day, because he tore me a new one.  I've never seen such Tetris wizardry in my life.  The best part was that he was humming the music while he played.  The whole group of Russians was cheering him on to beat this Amerikanski, and as my foe started humming louder, one of the group actually started singing the words to the song.  I didn't even know that song had words!\n\nAfter I got my butt kicked like Apollo Creed got killed by Ivan Drago, everyone cheered for this guy loudly.  He then says to me, \"You play good, for American\" and then he went back to his corner and resumed quietly drinking his coffee.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-21", "description": "Used to come here all the time to study, or at least that is what I tried to convince myself. Really, it was mostly because I had a teeny tiny crush on this goth guy that worked there, okay more like a huge crush. He used eyeliner and knee-high lace up boots, and had a soft voice...completely not the type of guy I usually find attractive. But every time, without fail, I'd freeze up and go ga-ga and forget what I was going to order.\r\nOkay, now that it's out of my system, here goes the real review. Muddy's is a no nonsense coffee shop that can get loud on occasion, serves up a strong cup of coffee, and is conveniently located near bart. If you are in search of the best tasting/best presented coffee (you know the one with the pretty foam designs) you won't find it here. People go to Muddy's because the coffee actually keeps you up. They also toast your bagels, and the german chocolate cake is delicious if shared with a friend because one slice is impossible to finish on your own. There are many tea flavors both herbal and with caffeine to pick from. It is also open later than most coffee shops in the area, and they have a cool game night. One of these days I'll  find the courage to challenge someone to a game of chess, but for now I'm content reminiscing about the cute guy that used to work there over a pot of peppermint tea. Sigh", "author": "X marks the spot .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "I miss this. Was a regular with my bff when I used to live in the Mission... now I have to drive for my  Muddys atmosphere. Its a great atmosphere.", "author": "Nancy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-07", "description": "A friend of mine recently moved from Tokyo to a small town in Japan. I asked her how it was, and she responded that it was much more tranquil and she got a lot more work done (she's a bookbinder) but that there was something missing. \r\n\r\nThis was how I felt after migrating from Ritual to Muddy's to work. The energy level could only be described as depressive zombie meditation. There was so much seating space that no one noticed me sitting for hours after my Mighty Leaf tea was gone. Blue-grass was playing in the background at a polite volume. No one was giving anyone else intense googly eyes. People were just chilling with their books, with their laptops, with their homies, sipping on Coke from a straw or coffee from a thermos, tapping  out tunes on a plastic toy keyboard, watching people come and go at the bus stop. A young white guy sat down to play at the cocktail Ms. Pacman and was soon joined by an older Latino man. Their intermittent whoops of victory shot through the nearly empty room. I watched dust motes float in the sunlight. The school bus came, and some kids got off and came in for an o.j. with their mom. It started filling up. An elderly lady with a garish streak of lipstick and a wispy bun sat tapping a pen on her lips and writing. She looked like an American version of a Degas absinthe drinker in a crinkly silver jogging suit. \r\n\r\nActually, maybe it's not so bad to get out of Tokyo. Life is slower here, quieter. It's a strange place, but I kind of like it. Three stars just became four. I think I'll go back and find someone to play Scrabble with.", "author": "Katrina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "Any coffee shop that has a cup size of JUMBO is all right in my book.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-29", "description": "free wifi, lotttts of places to sit (so I don't feel guilty about hogging a table to myself for 4 hours while studying), and ok coffee. not so much for atmosphere and stuff, but good enough of a place to get some work done.\n\nplenty of *interesting* people coming in though.. and I'll just leave it at that. the bathroom could using some tlc and maybe more toilet paper. the hand dryer is like a monster, probably the best about muddy's, jk.  or not.\n\n\np.s. i like this location better than the 16th/val location.", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-07", "description": "Free wireless, cheap deliciosly strong coffee, among the best in SF.  Not a starbucks type of place...so if you're seeking that kind of environment, go elsewhere.  I love and appreciate coffee, so I like Muddy's.  An ecclectic group of people visit the place, including the loyal neighborhood dwellers, myself included.  The staff are cool.  Did I mention free wireless?...", "author": "Adrian N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-19", "description": "I basically came here to kill some time before meeting my friends. It wasn't too crowded for a Sunday.  All I had was a sparkling apple juice! It was a hot day so it hit the spot.  Would I come here again? Probably not. But if I am in the area again and need to kill time...I may just come back...the only thing I liked was that the space was big enough...it's not one of those stuffy cafes...", "author": "Mel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-11", "description": "Zero atmosphere and cold service but the coffee is just like it should be : like toxic sludge. A must have for when you are trying to drag your ass to work in the morning.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-25", "description": "COMPLETE! This is coffee, dark rich, no frills. And if you are looking for frills sit yourself down for some table top Ms. PacMan. The folks behind the counter move about like gyros in space. Muddy's is also host to some talented artists and photographers. Rough around the edges...somewhat, but it's a solid place that serves its neighborhood well.", "author": "Travis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "In search of something sweet, I stumbled into this cafe full of people on laptops typing quietly to themselves.  Friendly staff patiently indulged my questions about what to order.  Tried the coffee cake, which was massive but light, not too sweet and crusted with a nice graham cracker/cinnamon mix.  Can't comment on the coffee or anything else, but the ambience was chill and the coffee cake was quite good.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-14", "description": "Muddy's very possibly has the worst dressed clientele in the city, and I don't make that comment lightly. However, if you can ignore the stylistically challenged, the grime and the preponderance of creepy old men, they do make decent coffee and a tolerable latte. Staff is super spacey but generally sweet. Great coffee cake.", "author": "Hayesvalleygirl .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-15", "description": "I can't give it more than two stars since they allow SO much loitering in front of their store. Not like, hey we are hanging out with our friends. Like hey, we are drinking beer in the bag of invisibility and gawking at all the women who walk by. It's enough to make me wish they'd lose their permit for outdoor seating... in fact maybe I'll look into that.\n\nCrappy coffee, decent bagel, always smells like B.O. due to said loiterers.\n\nI routinely walk right by here to get mediocre coffee elsewhere.", "author": "Mr. Marie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-09", "description": "Decent coffeehouse with a reasonably good ambiance.  Nothing to boast about on Yelp, but a solid choice -- particularly given that it's less than a block away from my house.", "author": "Victor R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "thank you muddy's for having a few video games!\nyour coffee is always perfect, the vibe is mellow, the baked goods are like mom would make and the music is just right. \nalthough i frequent many coffee shops- yours is where i want to read, have a conversation, catch up on what's going on, play a video game or just hang out. \nLOVE YOU!", "author": "SF U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-13", "description": "Pure Mission. Bare bones decor, good coffee, curious art, and a constant flux of eclectic customers makes for a great people watching experience at any time of day or night. More spacious and a lower street person quotient than the sister shop up the street. Free coffee with a bag of beans. Friendly staff, most of whom sport an enviable collection of tattoos. Oh and they have an original Galaxians machine. Wifi isn't free though - zrnet.", "author": "Stuart J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "I'm a fan of this place.  Sure, it's not necessarily gourmet or the most pristine establishment, but they make a damn good cup of coffee.  The place has character, and thus is always crawling with characters.", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "This place rocks! I went there when I was student, but it's still a place where I would like to spend time. The location is perfect : not so far from the BART station. 16th mission.", "author": "Max R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-17", "description": "stalwart - {stawl-wert} adj. - sturdy and robust; firm, steadfast, uncompromising\n\nCan't we agree that this defines Muddy's. Look, Starbucks for all their chemistry-geek state o'the art mumbo jumbo faux technology to keep their coffee the freshest and at ideal temperatures. Forget it. Muddy's serves strong, bold, uncompromising coffee. Same goes for their decaf even.\n\nAnd the staff doesn't bulls**t. They know what I drink and they pour it for me when I walk in the door. No drama. No fuss. No compromising. \n\nYes, I am a fan.", "author": "maureen f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-02", "description": "Cool name, very mellow atmosphere full of quiet people keeping busy online and playing board games.  They make a nice cup o joe and a yummy bagel, cheese, and egg sandwich.", "author": "Russ B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "I had been here twice before in the past.  Nothing has changed at all.  The space has a nice width compared to most coffeeshops an can handle more people which makes for a nice environment.  Always a bunch of people drinking coffee, reading and using laptops.  I had some reading to do and had some house coffee.  They have good foot traffic and the WiFi worked okay.  It is a nice place.", "author": "Cush D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-03", "description": "It'll do in a pinch but the city is too full of exceptionally good coffee served in clean, well-staffed cafes to waste time here. Bathrooms are usually filthy, staff seem disengaged and both Valencia St. locations are just plain icky inside. \nAnything good here? Great name, and the chai is very good--peppery and very little sweetness--just the way I learned to like it in Santa Cruz. But get it to go.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "This was my coffee place when I lived in the Mission (tear, sniff). Well, I guess I miss the city more as a whole than living at 24th and Mission. Anyway, I used to get my pint of black coffee and poppy seed bagel with cream cheese as I read the Comical, I mean Chronicle. They were always super-friendly and worked hard. I wish the South Bay had coffee places besides Starbucks and Pete's. Damn corporate scoundrels!", "author": "Berg W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-19", "description": "I came to review this place and found that i was in complete agreement with the star rating determined by all you other mission yelpers.  That almost never happens.  Solid 3 star coffee joint.  w00t: plenty of seating.  un-w00t: mediocre beverages that are always so hot that I burn my tounge.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "I am mystified as to what makes the egg and cheese bagels so good, exactly, but I am so glad that this is close to my apartment, because I probably eat one every single day.", "author": "Ivy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-24", "description": "Great coffee, and that's what matters.  If you are there on Friday, you might get a glimpse of \"Game Night\".    Ms. Pacman, internet, and a crazy bathroom that they can buzz you into.  Great coffee, try the brown sugar.", "author": "Dylan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-01", "description": "OH SHIT I DONT HAVE MY LAP TOP, I BETTER SHUT UP AND NOT BOTHER THOSE JERKS WITH FANCY READERS AND NIFTY PERSONAL COMPUTERS, ILL Drink my coffee on my way outta here...actually ...its fair priced, although the chai tea comes from a plastic jug, but real people drink Coffee beans. Its spacious, worth a visit if your in the area.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-01", "description": "If you call yourself a coffee house, the least you can do is serve drinkable coffee.  Toxic sludge is right.  For some reason they like to keep the door propped open even if it's freezing out.  However, it's completely and utterly free of pretension, which I find refreshing.  And they serve a decent bagel in the mornings, along with piroshkis and cake.", "author": "Esther K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-21", "description": "not the best coffee. not the strongest coffee.......but muddy's is pretty much hipster-free.......and sometimes, that makes all the difference in the world.......or at least, in the mission. so muddy's is where i go for a three star coffee when i don't want to deal with the hipsters at ritual.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-10", "description": "This really is a neighborhood joint.  It can't do wrong by me when it's on my friggen way to work, like I literally have to pass it to get to work.  If I don't get coffee in the morning, it's my fault for waking up too late.  The staff are friendly, they know what the regulars order.  Gaby is sweet and always friendly.  There was this one rocker dude who always seemed grouchy, but I took that as more about him than me.  Even though the coffee is STRONG, as it should be, I've gotten turned onto something else recently -- the name escapes me, but it is basically two shots of espresso in a cup of (already strong) coffee.  Like other things, it's made my tolerence increase.  An hour or so after having one of these cups yesterday, I noticed my heart beating fast, like I could feel it.  I freaked out for a minute, then remembered what I had just finished.  Check it out.  Oh, and I wondered about the crowds of people on weekend nights playing board games:  clean and sober.  It's all good.", "author": "Emilio O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-10-19", "description": "The only thing that saves this place from one sta... oh wait, this _is_ a one-star place. Crap, crap, crappity, crap. It's dirty. I see people go in late at night to clean, but there's no result as far as I can tell. The staff is cold. As much as I like parlor games, I'm not drawn in at all by the friday night game night. I gave this place a bunch of chances-- it's my next-door coffee shop-- but no dice.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-18", "description": "said they couldn't toast bagel cause it \"would catch on fire\"...\nonly coffee and bagels that were alright..\n\nhard benches and tables, good outlet access..outdoor seating is two tables out front", "author": "Kate R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-01-17", "description": "but really... don't people just go there for the free internet? cafe quetal is where its at..i only wish they stayed open later.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "I'm visiting from New York and wanted to check out the area coffee shops. Muddy's is right by where my sister lives. I took a book with me. It's a nice, airy space with lots of tables. The other customers were all reading or on their computers, a cool, diverse group of folks. I bought a bagel with hummus and orange juice. The bagel was served warm and was fresh and the hummus was delicious. The orange juice was also fresh and sweet. I'm here for a week and am going back again tomorrow. And the servers were friendly.", "author": "Mandy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-26", "description": "The atmosphere is pleasant, and things seem to be decently priced... but I can't give more than 2 stars to a coffee shop with that gives out tea and coffee in paper cups by default. I thought Muddy's didn't even have ceramic mugs until I saw the one person in the place who had one.", "author": "jenny d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-26", "description": "This place sucks. Had some time to kill so walked in to get a caffe latte. It just tasted weird and I didn't finish it. There are so many coffee shops in the area, why bother going to this one?", "author": "Pablo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-18", "description": "Best coffee I've ever had. My mother in law sends it up to Seattle for me when I'm out. It's my first stop when I travel to San Fransisco. The staff are nice and the locals add color to the place.", "author": "tim s."}
