{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "The jasmine tea was flavorful.\n(Yeah--tea is served here!  A lot of SF Chinese restaurants have stopped serving tea as soon as you sit down.)\n\n We were surprised at how much BBQ pork we received as an appetizer!\nThe serving sizes were very generous.  The quality of the pork was very good.  Our server dropped off hot mustard to go with the BBQ pork.\nNot to forget--- the pot stickers were good too.  Crispy and moist at the same time--nice.\n\nOur favorite were the pan fried Hong Kong crispy noodles.  We asked for a combo and it came with seafood, chicken, pork and beef.\nIt was excellent.  I love it when some of the noodles remain crisp while others are completely saturated with a tasty sauce.\n\nThe chicken with black bean sauce and white rice was excellent as well.  I originally ordered chicken and broccoli but they misunderstood and brought me this dish instead.  We decided to keep it because it was amazing.  So glad we kept it.  (They offered to replace it.)\n\nAgain, the serving sizes were large!  Service was great.  It's a hop, skip and a jump from the West Portal Muni station.\n\nClap! Clap! Clap!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "The good...customer service and delivery\n\nThe bad...where do I begin..smelly soggy tasteless pot stickers. Mongolian beef so salty it's not fit to eat. I am a salt person, but there is a ridiculous amount of salt. You might as well order Salt if it was on the menu. Pitched this in the trash.. Who the hell is in the kitchen? Obviously no one is overseeing this mess. Terrible even by American Chinese standards. While I'm at it lay off the damn white onions to cut your food costs, it insults my intelligence. Nasty food. I'm done now. Goodbye", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-08", "description": "This place has great tasting menu at a reasonable prices. I highly recommend the shrimp dishes, they're freaking good. The service is good too. Will come again soon!", "author": "Ricky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Definitely my go-to for well prepared, fresh, and delicious Chinese food.  I always get the sizzling rice soup, the vegetables and chicken are always super fresh and cooked just perfectly and the addition of the rice makes it a stand alone meal in itself.  The staff is always welcoming and attentive and parking around the corner is usually very easy.", "author": "Roger E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "As most reviews have stated, customer service is excellent and food is mediocre and cheap. I was going to give it 4 stars, but then I found a small piece of metal on the beef in my broccoli beef. Luckily I saw it, although possibly ate one on another piece that I didn't see ‍", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "I had a very nice lunch with my father here and the portions were very generous. We waited a bit for a food, I was a little concerned. All the doubt disappeared when I saw how fresh and hot the food appeared. It was appealing to the eye and delicious. Sometimes you don't get both, but in this case I did. The customer service was excellent.", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Prices were very reasonable for a ton of food that was delicious. The best part was the service. I don't think you find great service in SF much but these guys were very friendly and always made sure our water was full! Will definitely be back.", "author": "Mariana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Close to my house. Fast and friendly service. I enjoy the corn egg soup. Eggplant rice is my go to!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-03", "description": "After reading the bad review, I wanted to give the restaurant a chance because my colleague, who ate there 10 days ago with his family, was raving to everyone at work how good the food was, and he mentioned that the customer service was excellent.  My colleague raved about the Mongolian Beef (Hot), Chinese Broccoli with Oyster Sauce, House Special Chow Mein, and House Special Fried Rice.  \n\nSo today, I drove all the way up from Belmont and met friends who took BART from the East Bay and then MUNI to West Portal to try the place on Ulloa that my colleague raved about, and ordered what my colleague said to try.  Friends of mine, who came from the East Bay, and myself agree that the food had no taste, bland and very salty.\n\nOnly good thing about the restaurant is the customer service.  Wait Staff are very attentive, and came around to see how things are.  When they saw that we did not eat our food, they asked us why and we told them it was very salty and we could not eat it.\n\nIt is ranked 2 stars because of the customer service.  If it did not have good customer service, I would have given the rank 1 star.\n\nFriends from East Bay, and I were very disappointed because we have had better Chinese food than this place.  This was our first time going to this restaurant.  Won't go back again.", "author": "A M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "I've been going to NTT for several years now and it's been pretty consistent with its quality and pricing -- 4 stars because I'm spoiled with delicious Chinese cuisine in this great city. \n\nI highly recommend their Sizzling Rice Soup, Mongolian Beef, Orange Chicken, and Egg Rolls. \n\nThe locale is clean - bathroom included - and the staff friendly, accommodating, and thoughtful. \n\nThere's a metered parking in a lot adjacent to the restaurant and all along West Portal Ave, and residential parking along Portola Ave.\n\nThere's also a lot to do in the area after your lunch or dinner... perfect for a date or family outing. \n\nDinner and a movie?", "author": "Jorge R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "The eggplant dish was delicious, the edges were slightly crispy. Meant to ask for the recipe but didn't have a chance to, honestly one of the best eggplant dishes I've very had.", "author": "Patricia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "This might not be a totally fair review because 1)we consciously ordered Americanized Chinese rather than actual Mandarin dishes because that's what we were in the mood for and 2)I'm grading on my hardest \"San Francisco\" scale, which is about a star harder than average for me. Even on that basis it was pretty disappointing, though. The Lemon Chicken was overly breaded and sweet, with the lemon itself being almost undetectable. The crab Rangoon was basically just deep fried cream cheese. The pork was overly fatty, and the veggie pot stickers were tasteless. To top it off, the vinegar sauce had no bite. The only decent condiment was the chili oil. The food was also lukewarm by the time it was delivered, so that didn't help anything.\n\nGranted, it's no worse than I've had in plenty of places around the US, but in SF this is pretty sad.\n\nOh Wok Shop Cafe, I so miss you.", "author": "Nathan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "After reading the negative reviews we were apprehensive but we decided to give the restaurant try due to the fact that it is still maintaining a 4-star rating. In all honesty I could forgive a lot when a restaurant is cheap. However NTT sports some fairly high prices for Chinese food. \n\nAll things being equal even if the food had been cheaper I would not be returning.\n\nWe shared a hot and sour soup, which was actually fairly good. Unfortunately the potstickers we ordered we're just okay with the flavor a little bit off and then the two entrees, lemon chicken and Hunan beef we're really completely off in terms of flavor and the texture was even worse.\n\nI can only speculate that the chef is deviating from normal recipes. Regardless, we will not be returning and I don't recommend that you do either.\n\nOn a final note, the only reason why I gave two stars was really the service.", "author": "Bulldog W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "My husband and I tried them for the first time and we loved everything we ordered, especially because they fixed it the way we requested it.  Because of certain allergies I can't eat certain things so I have to be careful.", "author": "Cheri J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Great delivery service and a very honest business. I had paid by credit card for a delivery to a friends house and then she paid cash. We basically paid double!  I expected a fight but by the time I called the restaurant, they had already reversed the charges on my card. I appreciate their honesty and customer service. The food has been consistently good with delivery service.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "It's surprising to see New Tsing Tao Restaurant with low ratings. I would recommend weekday lunch because of the lunch specials. Moving from New York my husband and I we're always looking for a good Chinese spot that reminds us of nyc. This place hits the spot and we're beyond happy to find this little gem. The beef broccoli is my favorite it's very flavorful and the portion is huge for the price. I also enjoy the hot and sour soup and the crab rangoon. The reason why I gave the place also 5 star is the people who work there. The waitstaff is very friendly and just welcoming.", "author": "Ahline C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-20", "description": "The food is bad and not fresh. And really bad service. The dumpling smells awful and food is salty. We are Chinese and we know exactly what Chinese dumplings taste. 酸菜味的饺子是坏的蔬菜味，跟她们反映后，态度非常恶劣。以后不会再来！", "author": "思远"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "We've eaten in and also had delivery.  Food is consistently very good.  I like their Kung Pao Chicken - theirs is on the American Chinese side, but it's my go-to.  Just about everything I've tried has been pretty good, nothing drowned in sauce, vegetables all still have some bite.  It is on the expensive side, but that's pretty much the norm in West Portal.", "author": "Ed D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "We had a wonderful family style meal in this quaint restaurant.  Everything was great.  It came with great spices.  The pot stickers are as big as footballs.  The honey walnut prawns were fantastic.  You have to try the house special spicy prawns.  \n\nOf course the West Portal ambiance made a great meal even better.", "author": "Todd C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "First, I should say i have not tasted the food yet and the reason is because i've been waiting for 2.5 hours for delivery. Which is unacceptable.\nI called at 1.5 hours the told me the food is on it's way, i called again at 2 hours and got the same response and they hanged up on me.\nI'll let you know if the food sucks as much as the service.\n\nHangry Jorge.\n\nEdit:\nCanceled order, apparently they delivered to wrong address. I'll go starving to bed tonight....", "author": "Jorge B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "I have been coming to new tsing tao for years, and this restaurant is truly a hidden gem in the west portal district. The food is absolutely delicious, the prices are fair, and the portions are very generous. One of my favorite things about this restaurant is the staff, mainly William, as he is so accommodating, easy going, and great to talk to. If you are in the mood for chinese cuisine, you cannot go wrong with this place. Also, a plus is that parking around the area isn't too bad.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "I love this place! I've lived in West Portal for 3 years and food is always amazing and super fresh. I get their wonton soup every time - it is seriously the best!! My boyfriend orders egg rolls at every Asian restaurant we go to and he says these are the best ones, which says a lot  I totally recommend - you can't beat it!", "author": "Amanda O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "This place is unpretentious outside, and the inside is modest as well, but clean and pleasant. The food is wonderful, and the service, attentive.  Everything from veggie potstickers to hot and sour soup was tasty. The soup was complex with shrimp as well as the usual ingredients. The wait staff recommend the medium size, which was more that enough for three of us, with almost a full container to take home. The house fried rice had a good mix of shrimp, chicken and beef.  The only comment on the sizzling shrimp is that it wasn't sizzling - but it was still very hot and did have a nice curry flavor. Just a half-block from the West Portal Muni stop, its well worth checking out. This was our first visit, and we will be going back.", "author": "Drew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "No beef with scrambled eggs. Unacceptable, it's a classic. Anyway, the lunch specials are good. The menu is a bit small but there are enough items to pick something to eat. The portions are small as well. I order egg rolls in addition to my entree. Grab lunch here. I don't know too much about dinner here.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "First time visiting this restaurant on February 29, 2016. Clean decor.\n\nHad a delicious spicy chicken lunch plate, includes salad and soup. My friend had the tomato beef plate. Cooked-to-order and hot.\n\nA much better value than the restaurant at the corner 4 doors down.\n\nWill visit again.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "Omg, why is this place so good! \n\nLunch special with beef and broccoli. Fried rice (added peas and carrots, just ask), tea, hot and sour soup, salad, and wedge of orange--perfection. Beef was perfectly tender and sauce not too salty, hot and sour soup the best I've had, and fried rice like none other, not greasy and freshly made to order.\n\nAs a Taiwanese immigrant who's parents judge Chinese food all the time because let's be honest, my parents never went to non-Chinese restaurants when we'd go out to eat and Asian parents ARE judgey, I'd take my parents here.\n\nSolid A because we don't give A+'s.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Great service and delicious food! The boyfriend and I ordered the mandarin dinner special for 2. The size able portions made it so that we each had dinner and lunch the next day. We were there towards closing time. The waiter was kind enough to accommodate us without rushing us even, though we were the last patrons. \n\nThe hot and sour soup was superb.\nMongolian beef was good, but lacked flavor in my opinion. Tried the eggplant with chicken, but spicy style. Quite delicious. We'll definitely be back again!", "author": "Song A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "I ordered from here during the day in the early afternoon for takeout. My friend and I shared it and everything was pretty good. \n\nVegetable chow mein\nA lot of Bok choy but it was done well. I've had chow mein with more flavorful noodles but it was still pretty good.\n\nCrab Rangoons\nI didn't taste really any crab but they were delicious and crisp anyway and that's kind of how I like them.\n\nSweet and sour chicken\nGreat. Good flavor, perfectly cooked vegetables and tender chicken. \n\nOverall it was all really satisfying. Not too expensive. All of that plus a small side of rice was $32. It was ready in 10 min & was hot and fresh when I picked it up. I would absolutely order from here again. Good for a go to Chinese takeout place for a decent price.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "The good:\n\nThis restaurant delivers quickly.  Almost impossibly quickly. \n\nAnd I think I know why.\n\nThe bad:\n\nThis was the worst Chinese food I've ever eaten.  And I've eaten Chinese food on the West Coast, the East Coast, many capital cities in Europe.... not to mention Beijing, Shanghai and Hong Kong.  Even my Dad makes better Chinese food than this place, and he is British.  (I don't want to hurt his feelings, but I'm pretty confident he is not active on social media).\n\nThe wor wonton soup had no flavor.  The wontons mostly consisted of dough, and what little filling there was lacked flavor.  The broth was disgusting, and the other ingredients were clearly added in layers.  Note to the chef - you may benefit from an advanced cooking technique - it's called stirring.\n\nThe pot stickers were nasty.  I imagine that they were they output of a Chopped Junior stylee show, where the chef was challenged to create a dish from actual pot and a couple of sheets of stickers.\n\nAfter that I kind of gave up, but the combination fried rice was particularly nasty.  Spoiler alert- it's basically a combination of identical looking (I would say tasting, but that would imply flavor) brown meat.  My guess is that it is intended to look like beef, but it doesn't taste like beef.  I know it couldn't have been dog, so I am at a loss.\n\nI will yield my last words to Jason M who reported here on this restaurant five days ago...\n\n\"If I am about to die from hunger and this is the only place that serves food, I would rather die than eat their disgusting and filthy good. The food that they serve is horribly disgusting. The food was raw uncooked cold and smelled awful. Avoid at any cost.\"\n\nI was reluctant to post tonight, in case I was their only customer this evening - but I wanted to make sure to express my opinion in case I don't survive the night.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Had dinner here tonight with the fam. Had not eaten here in many years. I wanted my BF and  our daughter to experience this place.\n\nWe ordered BBQ Pork wonton soup. It was very good. It tasted the same as I remembered it from all those years ago. \n\nWe also had the Fried Crab Cheese Rangoon. It was good. But, they used to stuff it with a lot more filling before and it was a little more flavorful before as well.  \n\nWe ordered Sauteed String Beans. This dish was absolute perfection. Great texture, not overcooked. So tasty. It was my favorite dish of the night. You must try it.  Yumm-O!\n\nWe also ordered the BBQ Pork Chow Mein. By this time, I was so full that I only had very, very little of it at the end. I only added a small dash of soy sauce. Even with very little warmth left, it tasted fine.\n\nThey brought us very fresh (albeit cold) slices of orange at the end of our meal along with fortune cookies.\n\nThe gentleman who was our server has been there for many years. it was nice to see a familiar face again.\n\nI would definitely recommend this place to my family and friends.", "author": "Gigi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "Best Chinese food in the area! This is my favorite restaurant not only because is clean but also because their food is so delicious. Staff is very friendly, WILLIAM is the best! he is quick to take the order and very nice. He already knows what I like to order (:  my fav dish is Prawn and vegetable and chicken and green bean or try sizzling prawns!! \n\nTOTALLY Recommend this spot.\n\nIris", "author": "River D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "The guy who's always serving is always friendly... he's the best.  The lunch specials are perfectly portioned and priced, I love the boneless house spicy chicken!!  Parking is usually crappy, but...where isn't parking crappy in San Francisco.  Take out is always fast.  The hot and sour soup is good too.", "author": "Ems G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "This place is great for what it does...which is a slightly Americanized but very tasty Chinese food.  I like to get my takeout here when I'm in the mood for basic fare...hot and sour soup, beef broccoli  and mushu chicken are all excellent.  As someone who has lived in Taipei and Hong Kong, I can tell you that this may not be the best Chinese food around. But who cares...It's a neighborhoody family run place that reminds me of the old school Chinese restaurants scattered throughout the US. Some of the very negative reviews of this place are way off base and downright mean spirited. Seems like some people have an axe to grind.  Service is always friendly and quick.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "The food and service is excellent. Our favorite dishes are: Won Ton Soup, Scallops with Black Bean Sauce, Mu Shu Pork!, Mongolian Beef, King Pao Shrimp & Chicken, House Crispy Chow Mein. We take up the biggest table every other Thursday - don't come that day. Just kidding - hahaha.", "author": "Stefan O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-05", "description": "This food doesn't deserve four stars. It is almost completely without flavor. So disappointed.", "author": "Ellie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "The service here was excellent! We asked if we could be served quickly so we make s movie on time.  They were so attentive, and nice! The food was really good too!", "author": "Marvella W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "my family and I have eatten here for the past 14+ years. \nTheir food: fresh, clean & tasty, with a good variety of vegetarian dishes! \nThe restaurant: has always been extremely clean, with a harmonious, inviting atmosphere.\nCustomer service: is FAST & friendly. \nTheir prices are very reasonable\nThere's a parking lot behind the restaurant + it's usually not a biggie to find a spot. \n go enjoy now!", "author": "Giselle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-10", "description": "Final verdict is the food here is lousy.  Too bad b/c they seem nice and to care about their customers.  Probably a good place for people who don't much care for real Chinese food or even know what it is supposed to taste like.", "author": "Rose B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Very friendly service, on a tiny street in West Portal. Parking is tough.\n\nHoney walnut shrimp was a homerun - really a memorable dish. Everything else was above average, and our daughter loved the dumplings. They have big Tsingtoa beers.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-28", "description": "This place is pretty yummy and the service is good. Wasn't busy at all when we came, which is a plus. \n\nSimple dishes (at least what we ordered), which worked great for my picky husband. I had the egg-fried rice, and they didn't overcook the eggs like every.single.place does. And while it was pretty tasty, the rice itself was a just meh.\n\nNot bad, but not a \"come to West Portal for this Chinese food\" type of place.", "author": "Shannon O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-10", "description": "Not a fan. Wish it was a LOT better because we are tired of always ordering from Lucky River Chinese. The wonton soup had mushy thick tasteless wontons. The BBQ pork was bland. They forgot an extra rice. The reason I gave it 2 stars is that the mu she was quite good.", "author": "Cate R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-19", "description": "This was my first time ordering from this place. Like so many others, I thought I'd take a chance on this place. Never again. It was the worst Chinese food I have ever had. One of the items I tried was their Crab Rangoon. It had an inedible, bland pasty ball in the middle of the fried wonton that had no crab in it. My whole family had to spit it out. Their BBQ pork chow mein was awful. The BBQ pork was either not cooked thoroughly or it was some other mystery meat. We couldn't eat it. \n\nUnfortunately for us, it was all bad. I will not be ordering from here ever again.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "This place is really good! The honey walnut prawns are always delicious - well worth the price and the calories. If you eat in, the service is good too. Besides the prawns, I recommend the mushu pork and the Hong Kong fried noodles. The place is a solid American Chinese restaurant.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-22", "description": "I like the food, the price, location and the fact that it's family owned.\nBut this was the second time that I found hair in the serving.\nReally...   Shouldn't be that tough to stick to headwear policy in the kitchen", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "These crab rangoons will make you happy to be alive.  \n\nThis place is awesome! SF is not the best place for Chinese food as we all know, but New Tsing delivers with the quality, fresh ingredients that you would taste in NYC and Boston.  Pure greatness.\n\nThe service is top notch and its clean. I got the honey walnut shrimp and they were the best ive ever had.  If your thinking about going anywhere else for Chinese, stop and go here. You wont be dissappointed.", "author": "Petey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "The service is good and friendly, and the decor is pleasant.  The prices are very reasonable for San Francisco. My wife and I had pork fried rice, broccoli with tofu, and chicken with snow peas. It was all tasty, and there was enough of the tofu and chicken left for dinner (with fresh rice) the next night.", "author": "Harold W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "Best sizzling rice soup I've ever tried - the staff is always friendly and the food is excellent! I've been trying various Chinese spots in the area and so far this one is my favorite!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "My go to dishes ... Pot stickers, crab Rangoon, hot and sour soup .... And honey walnut prawns ... Tonight we also had Mongolian beef .... You would be hard pressed to find better", "author": "Richard G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "If I am about to die from hunger and this is the only place that serves food, I would rather die than eat their disgusting and filthy good. The food that they serve is horribly disgusting. The food was raw uncooked cold and smelled awful. Avoid at any cost.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "My go to Chinese food spot - excellent corn and chicken soup - lunch specials are priced just right.\n\nFriendly staff - family owned - always fast and consistently delivering the same delicious meals. \n\nDeep fried pork is on point!", "author": "Adrian E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-07", "description": "If you want to try the real taste of  Chinese food, this is a not a right place to go in:(", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "YUM. Their hot and sour soup is out of this world. Seriously, it was the only thing that nursed me back to health during a nasty cold. I've tried the both the vegetarian and carnivore options, and you really can't go wrong. \n\nI've only ordered take-out from this restaurant, but I've been meaning to come and actually have dinner here. They prepare the food so unbelievably fast without sacrificing any taste.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "So I'm not sure if its because the waiter basically got me and my friend drunk off the Japanese plum wine (on the house) but I love this place! \n\nIt's a little out of the way for me living in the Panhandle but its well worth the drive. The walnut prawns are amazing and the service is excellent.  Sometimes I forfeit good customer service for authentic, tasty Chinese food because I do understand that customer service isn't an essential component of their business model, but I always leave here happy.", "author": "Angelica  C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "I went here today for lunch and got the garlic shrimp lunch special.  All the food was really fresh, bright, flavorful and delicious.  No soy sauce needed, great chef!  I'm so glad I found this place.\n\nMy fortune cookie said, \"You will attract cultured and artistic people to your home.\"  I don't really believe in fortune cookies =) .... but I like that!  \n\nLocation is right near the West Portal MUNI entrance which is very convenient.  Note; restaurant is small so it's easy to walk by.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "My go-to local Chinese restaurant in West Portal (& I walk past 3 others to get there). \n\nExcellent Chow-Fun, friendly staff.", "author": "Todd R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-02", "description": "New Tsing Tao is just mediocre and the portions are way too small to justify the price. For way better Americanized Chinese food go to May Lee's on 7th Avenue.", "author": "Antoinette S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "Ordered Vegetarian Hot and sour soup. \nIt was horrible. \n\nWater with cornstarch, and bamboo shoots, eggs, that's it. \nWoudlnt issue refund, or deliver one with something in it. \n\nHorrible.", "author": "Noor K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-14", "description": "I really wanted to give this spot the benefit of the doubt, despite the many negative reviews, but I have to honestly post my first 1-star review. No bueno and not worth the money.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "This has been my take-out Chinese food for practically as long as I can remember. It reminds me of being home with my family, excited for when the door bell rang and the delicious aroma filled the house as soon as that paper bag crossed our door.\nI pretty much compare all Chinese spots to this place - it is not overly greasy like most Chinese food had, everything is extremely flavorful and cooked to perfection. I've recently discovered their Seafood Soup and the broth is heavenly with their always wonderful prawns and even scallops! \nHelen who takes our order via phone remembers us and always gives us extra hot oil, sweet and sour sauce and fortune cookies. Been in for lunch a few times too and the service is super friendly. Good hot tea also!", "author": "S. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Seriously THE best Chinese food ever. Every single time we are back in SF we always make sure to get some good food here! Everyone is friendly (especially Bill) & the food is delicious! My fav is the Chinese chicken salad, the brown fried rice with chicken and the chicken w/ broccoli! YUM", "author": "Krysten K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-03", "description": "i wanted to like this place because it's conveniently located in west portal  and there is a lack of really tasty Northern Chinese style dining in SF area. Southern Chinese (dim sum, fresh seafood, wonton noodles) style dining in this area is much more prevalent.\nthe four dishes ordered tonight were very underwhelming.\nmongolian beef - lacked a fiery sweet heat\nspicy fried chicken wings - not anywhere close to Santung Restaurant's version\nmushu pork with crepes - too much gristle left on the sliced pork\nfilet of fish with mixed vegetables was only aight.\nto sum it up, chinese food for non-chinese folks.\nno offense intended.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "A good place to eat for Chinese food as well they had a good lunch special you should try .", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "New Tsing Tao has drastically changed. Today January 3, 2015, I learned from the waiter that items ordered A la Carte or items ordered on top of rice are priced higher. \nI pointed to the price on the menu and the waiter responded by saying this was a in house rule not advertised. \nThe meal ended up costing me $4.00 dollars more because of the \"In House\" rule. \nThe servings have always been small in portion, but today they seemed smaller. To reinforce my observation, the table behind me made the same comment to one another.\nAnyway, West Portal has many new eateries, so please don't waste your time or money here at New Tsing Tao.", "author": "Eddie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-20", "description": "Stopped in for lunch recently. The food was a mixed bag. The hot and sour soup was solid. The salad that also came with the lunch was nasty. Some lettuce with a few slivers of carrot and too much Italian dressing. Seriously better to serve no salad than serve that. The food itself was mixed. Companion got the general tso's chicken (it's not called this) which was not very good at all. I had fish with vegetables, which was pretty decent, but not great.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "My family has been coming here for years and some dishes we don't even have to order anymore because William and Helen already know that is what we want.  New favorite dish as of this evening: Green Bean Chicken.  It is so delicious!!!!  Their Won Ton Soup is also top notch (much like their service!).\n\nNew Tsing Tao is the best!!!", "author": "Nora S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "We had a very bland meal, the Crab Rangoon had no crab only cream cheese, the spicy chicken was sweet zero spice, the beef and snowpeas lacked flavor although the beef was tender, overall disappointing meal.", "author": "Lilian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "One of my regular spots to get Chinese food. Comparatively the best amongst the few in West Portal.  Americanized but the food is consistently good and the place is clean and rarely crowded.  Staff are friendly. And they score well on inspections :-)", "author": "Yohdaddy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "Nora S's family is basically best friends with William and his sister Helen, the owners, so I came here and was not surprised to have a great meal.  We came on a Friday night around 6:30, were seated immediately, and went on to enjoy 3 excellent dishes.  We started with egg blossom soup--like egg drop but with small piece of tofu, mushroom, and peas.  It was piping hot and had a light and tangy flavor.  Our entrees were chow mein, which Nora created on her own, with tomato, white meat chicken, and extra sauce.  It was great, and William was happy to accomodate Nora's taste preference.  The moo shu chicken was delicious and perfect.  \n\nI told Nora that I felt like we were eating at William and Helen's home.  I would definitely come back.  It was a very small crowd eating in (most people were picking up take out) which made the restaurant quieter and more mellow.  Definitely somewhere to hit up at West Portal if you're looking for some affordable Chinese cuisine.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "This is one of my go-to Chinese restaurants. They have my favorite hot and sour soup, and I also love the mu shu pork. Staff is super friendly too and willing to accommodate to special diet restrictions when possible", "author": "Jackie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-16", "description": "I went here yesterday and ordered the sweet-and-sour prawns, general's chicken and crab Rangoon...I wasn't impressed. The sweet-and-sour prawns were overcooked and drowned in sauce, the generals chicken was also overcooked and quite flavorless but the crab Rangoon was actually quite good! Why the other two dishes failed so miserably I haven't a clue, but this restaurant is a one and done for me.", "author": "Louise I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "I almost never get take-out. But I was in a real pinch last night - totally hungry and desperate, and having physical problems that made even boiling water for pasta impossible. I looked up Chinese food on Grub Hub and decided to try out New Tsing Tao. I got Crab Rangoon and Shrimp with Fresh Vegetables. The food arrived 30 minutes faster than Grub Hub said it would. It was delicious. I am from Back East where Crab Rangoon originated, and so the ones I've had in SF have been terrible. Theirs was quite decent, actually - I would get it again knowing I don't have access to Boston Crab Rangoon anytime soon. The stir fry was light but filling and delicious - not greasy at all. (Even the Rangoon, a deep-fried dish, was not heavy or greasy!)\nMy only two issues:\n-Rice does not come with your dish, so make sure to order separately if you need it.\n-I made a note through Grub Hub that they shouldn't ring the bell but call my phone due to tiny people sleeping in my house. He rang anyway and created a mini-disaster for me. Please read the delivery notes, folks!", "author": "Sara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "We were first guided to try New Tsing Tao through YELP reviews. Really love how YELP can help us when we are curious to try a new place to eat when we are scheduled \nfor a meeting in a specific neighborhood. That is how we found the wonderful New Tsing Tao. It's been in the W. Portal neighborhood since the early 90's. My first question was if they had rice noodles in their soups. Our waiter nicely asked right away if I was allergic to wheat.. he kindly, easily offered wonton soup without the wontons and asked what kind of vegetables I would like to be added. Delightfully light wonton soup with fresh meats (without the wontons) and fresh not overcooked vegetables. My husband had the lunch version of pork chops....wasn't on the lunch menu but our waiter knew the regular pork chops would be too much for lunch, so they again offered to work off menu to our satisfaction. Everything was tasty, not over salted, great home-style cooking. The staff there talked a bit with us about gluten free and other ideas for alternative noodles. Some restaurants are offended with special diet needs. We will return soon, looking forward to it!! Will be able to be clear about more stars when we return for another try.", "author": "Betsy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "I really like this place for lunch or takeout. The vegetarian Hot and Sour soup is really good, nice and peppery, like old style SF Chinese restaurants used to serve. The vegetables are always fresh and crispy. Service is fast and friendly. One time I got a sorry looking salad with tired old Iceburg lettuce that was turning brownish reddish and so I mentioned it to the lady working that day. She took it away instantly, no attitude, and brought a nice fresh looking one. I like that. Their Won Ton soup is good too. I also like that some of the chicken dishes use white meat. Overall, it is consistently good fast Chinese food with friendly service and a convenient location. This has become my go-to Chinese restaurant.", "author": "Chanel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "This West Portal staple has been here ever since I can remember growing up in the neighborhood. It's been a great take out choice for the family for years but something's changed. First of all Christina answering the phone when I have called in for take out. Like last week. You simply call to place an order and she hangs up on you. You call back and she hangs up again. The 3rd time she says, \"This is a fax line so I can't hear you when you call..\" Like, did I do something wrong? What kind of a response is that? Not even, an apology. So snotty and uppity. Then tonight I order BBQ pork fried rice, broccoli beef and snow peas and prawns. I need to tell her she got the order wrong the last time and to please make sure the BBQ pork not the shredded pork gets into the order. MORE arguing with the customer! I haven't even finished placing my order. At that point I should have just hung up but I had two starving teenagers in the car. When I arrive Lucinda who is very professional opens my carton of BBQ pork fried rice and apologizes that Christina got it wrong the last time. She was very king and all smiles which made up for her co-worker who is rude and obviously doesn't like working in this place. Our food was piping hot and fresh. Over the years we know the best items to order such as tonight's choices. I also recommend the Wonton Soup, Pot Stickers and Chow Fun. You also can't go wrong with these.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "Our neighbors seem to like this place and during a recent conversation, he mentioned how he was going to miss it (they're moving) and liked the egg rolls (vegetarian) and hot & sour soup but skip the pot stickers, he said.\nSo, we decided to give it a try.  We ordered the egg roll, $6.25 (4 pieces cut in 1/2, came with dipping sauce), small hot/sour soup, $6.50 (enough for 3 bowls) - the soups do come in S, M, L sizes; one of the specials of the day - Chinese broccoli & chicken, $9.50; and Sizzling beef, $9.95.  Tea, rice, fortune cookies/sliced orange came w/the meal too.\n\nI liked the crispy egg rolls, not so much the dipping sauce.  The broccoli/chicken and hot/sour soup were good.  Didn't like the sizzling beef.  It didn't come sizzling either.  It had too much catsup in it and reminded me of tomato beef over rice.  The waiter was very nice and altho' it seemed slow for a Saturday nite, most of the customers there were regulars including a teen who came in by himself for take-out & the staff seemed to know him.  The prices are clearly a lot more than Tsing Tao #3 right on West Portal (no relationship).", "author": "Ry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "My favorite Chinese restaurant. Love the food and the service.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-02", "description": "I have never actually eaten in the restaurant but they have free delivery and they are fast! I love their hot and sour soup, and they have an online deal where you can get a free chow mein or rice if you order a certain amount. This is my go to Chinese food place when I want to eat in!", "author": "Lindsey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-04", "description": "We were in need of a new chinese food restaurant, and we always noticed this place when we take the Muni into West Portal.\n\nOur first two experiences were take out, and we now usually dine in.\n\nWe've tried all of the following, and haven't had one bad dish. We especially like the house spicy chicken.\n\nHoney Glazed Walnut Prawns\nHouse Spicy Chicken\nMongolian Beef\nKung Pao Shrimp\nKung Pao Chicken\nPork Fried Rice\n\nParking can be tough, check the small lot behind the restaurant.\n\nWe love the staff, the server is a nice host, and we love that he wears a tuxedo shirt and bowtie.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "We get delivery from here and every dish is fantastic.  Xlnt portions, not greasy, freshest ingredients and wonderful flavour!  They offer brown rice, and the food is always hot and delivered before the quoted time window!  It took years to find a Chinese Restaurant like what is offered in NYC and this is IT!!! Thanks New Tsing Tao!", "author": "Erika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "Even Main Street USA needs a chinese restaurant.  After all, you never know when the neighbor's dogs will run off with the Christmas turkey.\n\nBeing a nondescript-looking place well off the Yelp radar in a neighborhood that is, if anything, a respite from the endless Asian dives to the north and west, I could have walked by New Tsing Tao a hundred times without a second thought.  But then again I have, this being my gateway to West Portal and all.  So why not collect the whole block?\n\nOk, so as you might expect, there were no asian customers here on my visit.  The menu is your standard Chinese delivery stuff, and the quality was pretty average, although kudos for nailing the eggplant.  Ambience is nice (low, red lighting--hint hint, Eric's), and you gotta love the friendly, bow-tied waiter; he clearly owns the place (as in ownage, not (necessarily) ownership).\n\nOverall, this one's really for the neighborhood locals, but hey, that's me, and now I finally know a reliable place to get delivery from.  Although I will have to pit them against Kathy's to determine who gets pride of place on my speed dial.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Very tasty Chinese cuisine.  It's kind of pricey for Chinese, but the quality of the food produced is noticeably better than other establishments.  There's no MSG, the food tastes like it was cooked with quality oil (not too much of it either), and each dish i've ordered has the right proportion of ingredients.\n\nRecently, i've been calling in orders for pick up during my lunch break.  This is how I discovered the 'lunch menu.'  For an average of 8 dollars after tax, they give you quite a meal.  Unlike the normal menu, the lunch items include sides like rice and an egg roll; soup too if you eat at the restaurant.\n\nI should also mention that my take out orders have ALWAYS included utensils. a napkin, soy sauce (and other sauces when appropriate), and either a fortune cookie or a slice of orange.  As hard as it is to believe, this consistency is rare.  There have been too many times when i've ordered food requiring a utensil to consume, and open the bag to find just the food and nothing else.  It seriously ruins my lunch break.  Had I ordered during dinner hours, I can understand, as most would just take the food home to eat.  But during lunch hours?  Almost nobody goes home for lunch.  It doesn't take a genius to figure that out.\n\nAnyways, the man and woman who I assume are the owners (i've never been there without seeing at least one of them) are very friendly.  Not overly chipper, but more of a 'down to earth' type friendliness that's genuine.  In other words, they're not putting on a performance to milk you for a larger tip.\n\nAll things considered, this is the best Chinese restaurant in the area.  Despite being more costly than others, the customer service and attention to detail more than makes up for the premium.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Food:\nClean and Americanized Chinese food. Nothing is that greasy or salty. I recommend the Tsing Tao dinner set. The walnut prawns are to die for-seafood in general is fresh and tastefully done. Their lunch specials are huge- eggrolls, soup, salad, orange slice, and entree. The vegatables were undercooked in the lunch special but my fish filet cod was pan fried and fresh. This is one of my favorite Chinese places in the city. \n\nService:\nAttentive and polite.\n\nTransportation: West Portal is a very safe neighborhood. No need to drive here as parking is difficult.", "author": "Angus H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-08", "description": "I haven't written a review in years but I have to say that fellow yelpers let me down this time. My husband and I aren't picky eaters but food was really bad. We had delivery....and ordered:\n\nCrab Ragoons- edible but the worst I have ever had- usually I love these and I had to force myself to finish one\n\nWonTon Soup- I didn't try it but husband said worst he has ever had- could not finish it and he usually would push through/\n\nChicken Salad- Eh- Boring- but probably the best thing we ordered still consider mediocre\n\nSweet & Sour Pork- no flavor\n\nChicken & Snow Peas- no flavor \n\nI can't understand how anyone could rate this place a 4 or a 5 star. I would highly not reccommend this place- The Chinese Food at Lucky's or in the Food Court is MUCH better.", "author": "kristina g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-19", "description": "Having worked in the area, there's not that many places where you can just grab a quick bite under $10. Sometimes I would grab something off their lunch menu if I didn't bring lunch that day and didn't want either a pizza or sandwich. The food's ok. Nothing amazing, but reasonable price for the area.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "The best chinese food in West Portal.", "author": "Nneka O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "Best Chinese in the area. Veggies and meats are so fresh. Family owned and you can tell they care a lot about the quality of their food.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "Food = good, not too greasy, good flavors (not authentic Chinese, but americanized in a good way)\n\nService = friendly, and I've never had sit-down service here.  I always order take-out from here.  They remember people.  They remember your orders sometimes too.  They know I like my food hot.  :-)\n\nPrices = moderate, and I am willing to pay for the quality here.\n\nThey have a good lunch menu too.  What a bargain.\n-------------\nEdit 3/18/08:\n\nThey do deliver!  But it takes a while, so I rather go pick it up.  OMG...I just tried their veggie potstickers...holy crap--yum!  And really, NO MEAT!  Nomnomnom!!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "This place has the best hot and sour soup I've ever had in my entire life (from Boston to here)! The price is the same as anywhere else but they're soup is packed with pork and shrimp. You'll never feel cheated paying close to 9.00 for water and  mushrooms, etc. they deserve to win the title of best hot and sour soup in the Bay Area. I love supporting small businesses that serve good food for reasonable prices.", "author": "Trinny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Excellent eggplant & chicken dish.\n\n Hong Kong Noodles aren't overly fried but packed with crispy fresh vegetables and a generous  amount of meat.\n\nGrew up in this neighborhood since I was a tot and this place has been consistently great for years\n\nSkip the overpriced boring appetizers and stick with anything listed under house specialties.  They're there for a reason.\n\nVery nice service as well. \n\nClean bathroom too, always a good sign. :)  No smelly old towels in a bucket here.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "Very friendly staff!\n\nFood is standard Chinese food with the fake Americanized entrees as well. The pork ribs were verryyy yummy. But the gravy in one of our dishes was a bit too gloppy.\n\nOverall, I had a good time at this place!", "author": "Joanne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "A tasty, inexpensive, family style Chinese Restaurant.\n\nI've constantly been plagued with Chinese food that consists of meat and veggies drowning in sauce so salty you need to down a glass of water before finishing a few bites. I have never had this problem with New Tsing Tao. Their food is light and flavorful and they don't use MSG. Service is friendly, the owner makes a point to remember the regulars and ask how they've been doing, and delivery is fast. \n\nThe lunch special is an absolute must! A full entree, steamed rice, soup, and small salad for under $10!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "I've only gotten delivery from here and have never eaten in the actual restaurants, but every time I order for delivery it's always at my house at least 25 minutes before the quoted time. That is a definite plus in my book, especially late at night when I'm way too lazy to cook and I just want some instant grub.\n\nFood has always come fresh and hot, and they always pack it nicely so there are no spills with the soup, etc.\n\nI would definitely recommend the Honey Walnut Shrimp. I'M ADDICTED. \n\nThe prices aren't bad either. \n\nTrue, some of their meat dishes are somewhat bland, but that's kind of what you get with cheap Chinese food, just like every other place in the city. Add some soy sauce and it makes it worth it.", "author": "Kelsey A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-06", "description": "I've called this place on two different occasions to order take-out (well within business hours) and they've not answered the phones. I get it, people get busy. I called several times over a twenty minute period before giving up.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "My friend and I shared the Orange Beef and the Garlic Chicken. The beef was tasty, but the chicken didn't have much flavor, let alone garlic flavor. I don't get to West Portal often, but I might give it another try when I'm out there.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "We've been long time customers, and even though we moved out of state we still make a pilgrimage to NTT every time we're back for a visit.  We love their version of Hot & Sour Soup and nearly always order the Honey Walnut Shrimp.  The bok choy with bean curd is a favorite of my husband, and green beans with any protein are a good choice.  The owners are always nice and the service is always good.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "My local takeout place. Awesome friendly staff, delicious food. Sweet and sour chicken, broccoli beef, golden fried chicken appetizer...I get hungry just writing about it.", "author": "Renfield K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "this has become my go to for chinese in the city. really friendly fast service if you dine in, and quick delivery(over $19 then it's free). they have an amazing lunch special too. me and my husband love their veggie chow mein and the walnut chicken. hot and sour and egg flower soup are yummy too :)", "author": "Nikki W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "Pretty basic chinese food. I have to wonder about the quality of a place that misspells its own name. (The big etched glass sign inside the restaurant says \"New Ting Tao.\"", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-22", "description": "This place is so great. It has the best chicken and broccoli dish, EVER. I don't know what it is about it, but it's something that I'll randomly crave, and the same goes for the veggie spring roll appetizer. \n\nThe service is also amazing. The owner is so friendly, and because my boyfriend and I eat there so often, he told us it was our second home. He's such a sweet guy, and it is a place that I will forever continue to eat at.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "We ordered delivery from here for dinner - egg rolls, house chow mien with chicken, beef, and shrimp, and lemon chicken.  All were very tasty, classic chinese food - just what we were looking for!  It's nothing outstanding, but even the leftovers kept us satisfied.  And quick delivery was a huge plus!", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "Best tasting Chinese food deliver I've had in the area. We got Lemon Chicken, Mongolian Beef, Sweet and Sour Pork and the chicken wings. All delicious.", "author": "Mona R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-02", "description": "We used to go there a lot, but we got take out and found that the shrimp was so old you could smell it across the room. I threw it away.  I hope we don't get sick after eating some of it. I called to tell them. They were very pleasant and offered to give us a credit, but that isn't the point. You cannot deny old and stinky seafood and they denied that this obviously old and smelly food was in fact old and stinky.  She did say she would tell the chef.\n\nUpdate: I ended up with \"gastro-intestinal distress\" later that night.", "author": "Don m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-02", "description": "I've tried many chinese places, but this place keeps me coming back.  I've been coming here for years.  I don't go here too often, but the owner (I assume he's the owner) always remembers me and what I order.  I show up, we small talk for a while and he says: \"So what are you having today?  The usual?\"  That's all it takes.\n\nThe won ton soup is awesome.  The Mongolian Beef is saucy and just the right amount of spicy.  I order Mongolian Beef everywhere I go and have yet to find a place that serves it as good as New Tsing Tao.  The orange slices at the end of the meal are a nice touch.\n\nI can't wait to go back!", "author": "Marcos M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-21", "description": "I so want to give this place a better star rating! It's close to my house, and super fast delivery. But the food was really tasteless...esp. the soups (egg drop and wonton). We ended up chucking the soups and re-seasoning the other stuff. The other reason I am give a low star review was the price...it was literally 50% more than other Chinese delivery places. Sorry. I won't be going back here!", "author": "annie s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "This place is great and you can't beat the lunch specials which even apply on weekends too. $6.75 for a large plate of food that comes with soup and salad as well.\n\nI'm a fan YUM!", "author": "Bobby J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "I was forced to haul ass all the way across the goddamn world to meet my favorite round table of ladies for Monday night dinner.  \n\n\"I am driving to the other side of the world in rush hour traffic for CHINESE FOOD!!!??!! \" I exclaimed to no one in particular as I traversed my way through Market St. bumper to bumper, tank tops in the Castro, Mercedes in Potrero Hill and finally to New Tsing Tao.\n\nSo.  I got there.  We ordered like the bunch of white girls we are.  Tofu this.  No oil that.  You know how it goes.  Usually I expect at least a raised eyebrow from the waiter in a Chinese restaurant  when I ask them to hold the MSG.  Just kidding, I never ask that.  I love MSG!!!  This waiter (who apparently is there everyday all day as he is the only waiter) took the time to explain cooking methods to me, to be sure that I wasn't sacrificing my liver or my endocrine glands.\n\nThe food.  VERY good.  Shockingly good.  Deliciously good.  Besides that they put up with us talking louder than Fran Drescher at an ACDC concert about boys, divorce and sex and didn't ask us to leave once (Oh, it's happened before...).\n\nOne question though.  Was Old Tsing Tao closer to where I come from?", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "This is hands down my favorite Chinese restaurant in the entire country. Their hot and sour soup is the most wonderful thing ever. Every time I'm in the bay area I make sure and get me my Tsing Tao fix since I was about eight years old. Planning on going there again!", "author": "Gabriel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "My family and I go there all the time. It has the best chinese food you will ever have! I definitely recommend the mandarin dinner, sooooo yummy!!!!!! The restaurant is also very clean, and service is excellent!", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "This is the most reliably good Chinese Restaurant that delivers to my neighborhood. I used to order Emmy's all the time, but this is lighter and tastier somehow.\n\nTry one of the combination dinners to start with! Very reasonably priced.", "author": "Kimberley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "AWESOME, AWESOME, AWESOME! I liked it so much, I literally ate there 3 times in one week with my wife... The owner is super nice, and all the good people of Diamond Heights need to hit this place for sure, and you'll not regret it........ Boycott that lousy place in the shopping center called \"All Season Restaurant \", and give this hidden gem a try... YOU'LL LOVE IT!", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-30", "description": "Went here b/c a friend from work lives nearby and her and her bf are regulars here. Very non-descript place, small and intimate right near where all the buses are.\n\nSince our companions were regulars we were greeted warmly by the tuxedo'd waiter (I can't remember his name but apparently he's always there). I suspect though that even if we hadn't been with regulars, we would've been greeted just as affectionately.\n\nGot pot stickers to start. AY CURUMBA! I'm not usually into pot stickers, but these were unbelievable. Tasty porky innards, perfectly pan fried noodley outside.\n\nI can't remember specifically what we got for dinner (I think we got soup, a fish dish, a chicken and a veggie) but I DO remember it all being yum-o! The best part is while more people did come in throughout the night, it never got loud inside and were were never encouraged to leave, even though we were there for a good two hours.\n\nParking can be sticky, we parked on West Portal and hoofed it a couple blocks, not bad.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-04", "description": "This place is great. The owners wait the tables and are incredibly nice people. The delivery couldn't be faster.\n\nThe food is much more fresh than most chinese, and the won ton soup is the best. I do pretty much stick to my favorites here - the mongolian prawns are unavoidable. The potstickers are excellent, although i miss the chicken ones they used to have.\n\nThere definitely isn't a shortage of chinese take out around me, and i've tried a lot of them. But i settled on New Tsing Tao years ago, and i'm always disappointed when i stray.", "author": "Grem W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-24", "description": "I'm increasing their rating to 5-stars. We've been coming here for years! Consistent, good quality food. I would not hesitate to try anything on the menu. Great take-out or dine-in.", "author": "Xavier A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-20", "description": "I'm not going to say this is the best Chinese food I've ever had but it's good, simple, family style food.  No frills, no useless garnish.  We primarily do take out here - mostly soup, noodles, maybe a dish with rice, but we always go in to order and, while waiting for it, chat with the owners who are super nice.", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-03", "description": "I have been to New Tsing Tao Restaurant several times for lunch in the weekday. The one thing that, I liked very much was their House Special Fried Rice and it tasted really good it was one of my favorite item on their menu. I also have to say that their bathrooms are pretty clean as well!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Delicious orange chicken. Sadly enough they use MSG. (The stuff they use in food to make it salty which also results in getting migraines.) Other than that, all awesome food with amazingly quick and friendly service.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-26", "description": "ordered a few dishes for delivery and in the middle of eating our meal we found tiny  bugs in our wonton soup!! not just ONE, but about  5 that were visible! little nasty bugs...Actually my daughter is the one that saw them! F'n nasty ass food! So we ended up throwing everything away! What a WASTE! When my husband called to let them know, they offered to make a new one, but who the hell wants an f'in new soup with more bugs!! Nasty poop place!!", "author": "Leslie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "I was honestly a little disappointed to see that the Korean BBQ spot ive been wanting to try was replaced with another chinese spot. But seeing as i work up the block i grabbed a menu anyways. Super cheap lunch specials! ok so i was all...I must try this place. and yum is all i have to say. yum! ive only tried teh lunch specials but i keep goin back for em! $4.85 for a huge serving of kung pao chicken and rice? psh ill take thanks. so far reh sesame chicken is my fav. hmmm i think i might order that today.  i will be aregular for sure!", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "This place is really great, have been coming here for MANY years.  They actually got a new chef recently and he is even better than the previous chef.  The food is not \"high end\" fancy Chinese, nor is the interior.  If you are out to impress guests, then this is not your place.  If you are too tired to cook and want a very good meal, this is your place.  Some favs: dry garlic green beans, cashew chicken, crispy noodles beef.  William (the waiter) and Helen (the owner and hostess) are very friendly.  Once my daughter was hungry and stranded in West Portal with no money and they let her order and eat and said just to bring some money whenever she came back.  THAT is a neighborhood restaurant worth supporting.", "author": "philip h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "The place is very clean and the food is fresh.  It is great for a quick lunch as well as dinner.  The servers are very nice and the prices are quite reasonable.  You can rest assured that you will enjoy a good meal there without any negatives.  The Mongolian beef and the egg rolls are particularly good.  You will be happy with the meal and the price.", "author": "Storm J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Had dinner here last night and it made me ask the question... why not come here more often? We had the spicy crispy chicken which was like Sweet & Sour Chicken except better. You make the determination if you try the dish... We also had the Broccoli Beef. Both dishes were great. Usually when you fry chicken pieces you get the dregs of the chicken. You know ass meat, gizzards and the back fat with a little meat. Not here, they were Breast pieces which turned out tender, surprised! Also when you crispy fry chicken pieces and drown it in sauce it turns the crispy to sog heaven but not here. It stayed crispy and was very delectable. The Broccoli Beef was very tender and the Broccoli not over cooked. Very good and the price was decent averaging $10.00 per dish but the portions were good. Try it out if you're in the neighborhood. Right now if I had a choice to wait in line at Sun Tung on Irving or grab a quick seat and a hot meal at the New Tsing Tao. I choose the latter.", "author": "graham c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-06", "description": "If you've got the Chinese-American taste buds going on, then this is the place for you. I was unimpressed by my green bean chicken. I spent a lil over 10 bucks, and can't say it was worth every dollar. Very friendly owner though. Short wait time for take out orders.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-03", "description": "I was a little disappointed with my first experience.  I had walnut prawns, kung pao chicken, and brown rice to go.  the food was so so, not particularly good, not particularly bad.  maybe it would have been better eaten there.  but at about $25 for that meal, definitely too expensive.\n\nI was also surprised to read the comments about the friendly service.  Both the woman who took my order and the waiter were on the surly side.   Who knows, maybe they were having a bad night...or they just didn't like me.  (No, it couldn't have been that, it must have been a bad night!)", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "New Tsing Tao is my favorite local Chinese restaurant! I especially like their weekday luncheon specials (best value). \nThe staff/owners are very friendly and have quite a following in the neighborhood. They are very accommodating too. They are especially careful when I order due to my kids' nut allergies (although I would not order Chinese from anywhere if they had a life-threatening peanut allergy)! \nI think the prices are reasonable compared to other Chinese restaurants. There are lower priced ones nearby, but I also do not like the taste of the food at those restaurants. \nOne thing on the downside..... They are closed on Tuesdays and I get hungry on Tuesdays. Oh well.... \nAnother positive -- a few times over the years I was not able to find parking at the busy lunch hour -- never fear -- they waiter came out to my car with the food and took my cash and even a credit card once. Now that's service!!!", "author": "Jay T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "This was incredibly good! I was out in Richmond at a friend's and didn't feel like going out, so we decided to get delivery. So, please note that this review is only applicable for their delivery service and won't touch on the actual restaurant.\n\nThey were very polite and professional on the phone, asking me my phone number, address, what I wanted, and made sure to repeat all of the information back to me to verify that it was correct. I chose to pay in cash, but Credit Card is also accepted. The wait time would be about 40-50 minutes, but with the amount of food I ordered I wasn't too surprised.\n\n~Vegetarian Spring Rolls\n~Combination Fried Rice\n~Chicken Won Ton Soup (other flavors available)\n~Lemon Chicken\n~Beef w/ Broc.\n\nEverything was delivered right when they said it would be, and came steaming hot. All of the \"wet\" dishes came individually wrapped and sealed in a plastic bag in addition to the boxes, which was good since some of the sauce from the lemon chicken had leaked from the corners. \n\nThe food itself was excellent and all incredibly well-priced. The only down side is they didn't include any chopsticks/plastic utensils, but this wasn't a real problem since I had my own.\n\nI would definitely order from them again!", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "Dined here this past Friday for dinner & loved it.  The place is celean with friendly service in a casual atmosphere; serving some of the best Mandarin, Szechwan, & Hunan cuisine.  The pot stickers were probably some of the best we had with thin crispy golden warappers & a wonderful ground pork, cabbage, & ginger filling with a lite broth & perfect with soy vinigre drizzled over them.  The spicy dishes were good but not spicy which is why I took off a star; the orange beef was tender with garlic, orange peal, & chili pepper in a wonderful brown sauce but they needed to kick it up with the chili peppers; the same with the sizzling prawns which a couple bites were spicy but the prawns suculent with fresh zuchini, carrots, onions, & green peppers in a brown sauce.  The prawn chow mein was very flavorful with suculent prawns, fresh vegetables, & wonderfully seasoned cnoodles.  The brown rice was firm not soggy & nutty.  Round it all off with a couple Tsing Taos & you will not be disappointed.  So, for some wonderful Mandarin cuisine & good Szechwan & Hunan cuisine in a clean atmosphere with friendly service, New Tsing Tao cannot be beat.  Keep up the good work guys.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "I have eaten here for years.  The food is always good, hot, and clean tasting without a lot of oil or MSG.  Friendly staff and nice atmosphere", "author": "Cindy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-18", "description": "Yucky. Delivery was fast, but the food was greasy (eggrolls sitting in a pool of grease at the bottom of the takeout container) and bland. The sauce on the beef and broccoli was like water, and the cashew chicken was mediocre at best. Worst of all, this tasteless meal ran me $30! I won't order from there again.", "author": "Beth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "Great food at a great price, especially the lunch specials. Very good service and decent atmosphere. Not really up for substituting sides or soup type, but very nice people.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-26", "description": "I ordered delivery via grubhub.  Delivery was quick at 30 minutes, but that was as positive as it got.  We ordered Chow Mein, but were delivered Lo Mein.  The Lo Mein was forgettable.  We also had General Tsou's Chicken.  The sauce was light, but bland.  The chicken pieces were smaller and I found two bones!  I wouldn't recommend it.", "author": "Parker W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-05", "description": "We've had take out three times from this place.  First time wasn't bad - not exciting, but not bad.  The second time was even less exciting but it wasn't scary.  As soon as I got in the car with the food last night I knew there was trouble.  Bad, bad smell.  The ribs were impossible to eat - really hard, cold and rubbery and they were the source of the bad smell.    The chicken with peanuts was worse than tasteless.  The hot and sour soup was sour but not hot.  The only decent dish we got that had some flavor was the bok choy.   I guess this is what I get for not following my own rule:  don't get takeout from a place that never has any customers.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-10", "description": "Strict vegetarians typically have a tough time at Chinese restaurants. Chinese cooking doesn't seem to require much heed when prepping meat versus non-meat dishes - a little chicken broth here, some fish sauce there, and a sprinkle of what-part-of-the-animal-do-you-desire amongst everything...just because. \n\nWell, at New Tsing Tao, the awesome waiter in the tuxedo, who is ALWAYS there, asks if you want egg in your dish, knows explicitly what dishes are prepped with chicken stock, and even remembers you as the vegetarian in the group. He is so cool - just ask him his story - he has been a chinese restaurant waiter for over 30 years! The vegetable mushu is one of the finest dishes in Chinese cuisine.. it is basically a fried vegetable chinese burrito (withi hoison sauce).. the waiter wraps the veggies with the pancakes before your very eyes. \n\nThe prices? I think average price is like $6. The service? priceless. The food? Fresh, delicious, flavorful, hot, and big portions. The atmosphere? Quiet, homestyle ambience. veggie options? LOTS. My favorite dish? Mushu vegetables. My second favorite dish? Fried bean curd with broccoli. What to do when you're done? Go across the road to Philosopher's Club for a cold one and play some Liar's Dice.\n\nI go to New Tsing Tao all the time. Highly recommended. Park on Portola if you want to save yourself the headache of driving back and forth on west portal ave.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "This is most reliable and best Chinese food in the city and we have tried millions! They do veggies great. I love the sauces-the chef is really great. The flavors are subtle and fresh, not too sweet and no taste of additives. Also it is not greasy (but we don't do meat, just fish). Definitely worth a try!! We go over and over again.", "author": "Beth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "We love coming to dinner here.  It is quiet and kid friendly (a hard to find combo!).  The veggies/meats are always fresh and of high quality and the food is well prepared.  We love getting green beans sauteed with garlic -- it is delicious!  The owner is sweet (gives our kids riddles and word puzzles to figure out and lets them draw on the paper placemats) -- and he greets us warmly.  He knows our regular order, too, so we feel like family.", "author": "S O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "Not a lot of options for chinese food in West Portal, so New Tsing Tao is the default location to get my fix.  You get all the standard stuff, rice plates and noodle dishes.  Nothing fancy.  Hit Taraval, Noriega and Irving if you want better.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "This is a great little local Chinese restaurant that offers the usual but will cook to order, if asked..try the sizzling prawns (or sizzling anything) prepared by the tireless waiter Bill, right at your table.  It's a neighborhood staple for a satisfying meal, especially  if  you're not quite up or dressed for the more upscale remodeled eateries that have sprung up on West Portal Av..   Call them from your job downtown and pick up a great meal when you get off the K, L, or M train at the West Portal station!", "author": "Chris O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-08", "description": "The people who own the place are very nice, the portions and price are fair and the food is pleasant.  I can't imagine there ever being a long wait for a table because they seem to have a large take out customer base.   Nothing to brag about here but I have eaten a heck of a lot worse.  Besides, I received a very upbeat and positive fortune from my cookie!", "author": "ein bier bitte k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-30", "description": "This place is pretty good.  Their hospitality is warm and welcoming.  The food is pretty decent, comparitively to the price.  Parking is a hit or miss, depending on when you go.  Most of it is street parking (metered) and a small lot around the corner, but good luck with that.  The space is comfy, but not grande.  In actuality, it kinda feels like every other two bit Chinese joint, but it really isn't.  The food is good and so are the people.  Not necessarily a place I'll crave, but I'll definitely be returning...", "author": "Darkie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-29", "description": "Delivery from this joint was extremely fast. Almost like the guy had been waiting at the corner, but that's really where the story ends. The citrus chicken was not what I anticipated and turned almost into a CSI episode to figure out why the eff they named it that way. Turned out it was pan fried lemon rind which was a surprise ingredient, but none the less boring. Mushu pork was good, but always remember to ask for extra crepe/ wraps/ Chinese tortilla dealies, they never send enough. OK if you don't want to leave the house.", "author": "ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-26", "description": "Better than anything on Taraval. Love this place -- an old favorite from back when we lived around the corner. Friendly folks and very tasty.", "author": "Allan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-02", "description": "The food is very good and the average plate price is around US$7. Lunch special is very good.\nThe service is awesome. The waiter remembers your name, your favorite food and no problem with substitutions and changes on the plates.\nThis is my 4 year old favorite place.", "author": "Vladimir S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "Our favorite Chinese place.  The mongolian beef and chicken with veggies are great.  i also like the eggrolls which are the cabbage type.  Service is very fast.  The flavor varies somewhat but we are usually very happy with the quality.  The meat is usually very tender and without the grisly bites that some Chinese food has.", "author": "Bree M."}
