{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Always great service and amazing food.  Staff is super friendly and I both do take out or order for delivery.", "author": "Richard W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Man, nice little hole in the wall of well-seasoned chef of Chinese Cuisine!  \n\nTried their salt and pepper wings with the complimentary steam rice which are the perfect amount; blending deliciously crisped and satisfyingly cooked as my rating for their American Chinese cuisine .  \n\nI gave the choice to my two traveling companions on where we should partake our repast.  After about two hours of taking in Japantown's 51st Cherry Blossom Festival, King Lee's, which BE Nom Nom, INDEED!  \n\nNot too crowded but always has customers.  Plenty of parking and the ambience is homey and accepting.  Normally, I would worried about restaurants that may have an outward appeal, \"that could use improvements.\"  On the contrary, King Lee restaurant's personality and soul attracted my attendance to their miscalculated rated establishment; was the tantalizing smells wafting persuasively out the front door.\n\nSimple menu, good prices, and a perfect list of Lunch Specials. Boy oh boy!  Hot tea came out, and it was still hot after three tea cups, oh, and actually tasted like green tea.  (Free by the way!) Then the awaited arrival of my Salt and Pepper Wings and complimentary steam rice.  The sweet and attentive waitress/hostess was very professional and busy, and at this point, the atmosphere started to work for me.  I felt at home.\n\nThree bites, just three, well-prepared and palate-pleasing!  I literally stopped eating just to write a quick review. (which I am now fixing.)\n\nJust delicious, just aroma appealing, just my kind of wings!\n\n(Going to enjoy my hot green tea and wings leave me alone, oh and it was less then $10.00!). \"This was written earlier\" -Me\n\nAmazing!\n\nFYI: If you like decent food for the right price and proportion, this place's lunch specials are available between 12-3pm, but anytime is the BEST time to come in!!!", "author": "Matthew A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-01", "description": "Visiting SF and family member choose the lunch venue since he lives in the City. Family member said it was a favorite of another family member so we gave in lol. Ordered the chicken tofu and assumed it would be \"chicken\" made out of tofu. Wrong. It was chicken and tofu, with veggie rice. Dish was pretty bland. Husband ordered chicken wings and spring rolls as apps. Wings were salty but the spring rolls were good. Husband ordered house fried rice, cousin ordered his favorites: war won ton, white rice and chow mein. Subpar Chinese food, wouldn't revisit. I do have to say it's a popular restaurant, the locals were constantly in and out the entire time we dined.", "author": "Candace C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "The man at the front counter was very nice and accommodating to the fact i didn't want to spend 40 bucks on food for me and a 4 year old. he nicely gave me more options to save about 8 bucks! Thank you! The sweet and sour chicken was great. I for sure cannot say the same for the honey walnut prawns YUCK! I ate one and gave my neighbor the rest. i have never had them fried so hard in my life. So for that I took off 2 stars.....", "author": "Dunenka S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "I ordered food for delivery, and the lemon chicken was awful. Some of the worst chicken I've ever had. It was very mushy meat that I could not eat. I wish I ordered from another Chinese restaurant. Avoid this place.", "author": "Connor O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-08", "description": "I made a few last minute changes to my order but it was like I nerver had. The food was still hot, on time and good as ever. The delivery person moved too fast before I could check my order but the food was too good. Thank you", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Depending on the dish, the place is a miss.\n\nHowever, for me: I love the Singaporean stir fried noodles -- the portion filled the entire large togo box. I've been eating it for three meals with a side of chicken wings. There's shrimp, bbq pork, and pork in the stir fried dish.\n\nThe fried chicken wings are exactly what I crave from time to time - incredibly oily and unhealthy but oh so satisfyingly average. I'll definitely be back here for these because sometimes I just crave that unhealthy stuff (like watching KUWTK or opening your ex's snapchat story) that's how unhealthy it is.\n\nMy roommate got the orange chicken and it's also averagely decent, but there were a lot and the price is amazing.\n\nWill definitely be back here for drunchies.", "author": "Vi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "As usual, great food! I ordered wor wonton soup, curry chicken, steamed rice and pan fried potstickers. It was delivered by 9:15 pm (40 min from ordering), the only drawback no one txtd or emailed me the food was delivered at our front desk.", "author": "Fia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "Do not ORDER DELIVERY from here. Took nearly 2 hours. Food is MEH.", "author": "Monica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Not the fanciest food but is cheap and well portioned. The vegetarian options are extensive and very good.", "author": "Emmalea L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "King Lee's has become a regular go-to for me since they're a great bargain, taste way better / more authentic than Panda Express, healthier than pizza, super fast, and of course, very near me. \n\nHave ordered only to-go or deliveries from them (6-7 times now?).  Every time, food is ready within 15 mins of ordering, whether I called them directly, or used Eat24 on Yelp.  I had food delivered tonight (they deliver for free within a 1-mile radius). Food arrived hot and within 15 minutes of order (order placed 7:41 pm, delivered 7:55 pm). Incredible! \n\nEnglish is not likely their first language which may explain why some don't find them friendly. Order the more 'authentic Chinese' dishes.  Don't go for Americanised stuff.\n\nBe warned, this is kind of a hole-in-the-wall place. The little mall strip it sits at the corner of is a rather unfortunate, dirty area (west side of the Safeway parking lot on Ellis st.).", "author": "B. L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-27", "description": "Not even worth 1 star!!!! The food was great until I found a roach in my food! I am so grossed out. Do yourself a favor and don't eat there.", "author": "Unique U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "Filthy King Lee's closed permanently after failing a 2016 health department inspection. The premises will not be re-opened as any type of food service. No loss because their rotten food was eventually going to kill someone. I stopped going there years ago.\n\nReportedly, it was rated among the bottom 5% of San Francisco's dirtiest restaurants. Aside from their horrid kitchen, the nastiest item I saw there was won ton soup. It literally looked like dirty gray bathwater with garbage floating in it.", "author": "Pam J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "I called at 11am when the y opened placed an order for delivery and here it is almost 1p and I still haven't received my order. I am literally ten minutes away and when I called at 12:20p they said my order was on its way. I love the dry fried ribs but customer service sucks I guess I need to find a new spot. 2 hours wait time is unexceptionable.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Every neighborhood needs its local Chinese restaurant.  I'm fortunate to have the city's best one right around the corner.  New King Lee's Chinese Restaurant has been restored with new management over the years and has come back stronger than ever.  With a vast array of options to choose from on it's menu, NKL has placed the cherry on top with top leveled service.  Free delivery within a mile radius, fast delivery anywhere else, cost efficient pricing, delectable cuisine, and a blessed family running it all -- who could ask for more?  Unless you're asking for more food that is :P  I definitely can't get enough.  I look forward to NKL's growth and success.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Came here with Co workers three times this past three weeks. Solid food and fast service everytime. And who doesn't love the good prices.  Ordered a bunch of stuff and would come out super fast and fresh. Favorites were scrambled egg with beef, tomatoe beef, black bean fish was bomb, lemon pepper wings, and good old chowfun.", "author": "James L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-08", "description": "I'm really disappointed. I really wanted to like this place because it's closeby and has a huge menu selection. However I ordered a beef & tofu lunch combo and the beef was sour. I'm not talking about some sweet and sour sauce or some vinaigrette flavor, but it both smelled bad and was sour as if the beef went bad. I really want to try ordering from this place again because I want to give them another shot but I'm legitimately worried and scared that I'm going to get sick. I really hope they improve this. For now I'm going to go to Panda Express instead because unfortunately as bad as Panda is, it's predictable.", "author": "Johnny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "The address is confusing because this place is actually on Ellis Street, at left from Fillmore. But don't fail to find this classic hole-in-the-wall 'cause it's damn good.\n\nWe've eaten there twice and have been highly pleased by what, whom, and how we were served.\n\nAnd the cost is very modest.\n\nWe shall return!", "author": "Icono C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Probably one of the best websites...  At the restaurant they are extremely nice, attentive, and make your food just lightning fast.   Comes out hot and delicious.  food is very fresh.\n\nOh, if you dine in you get tea, and soup for free!!!\n\nTheir speed for delivery is amazing.  I feel like I have barely gotten off the phone with them and they are already knocking at my door with the order.  \nUmm, if you order online that is probably your best bet unless you know how the ordering sequence works as the woman that answers the phone is difficult to understand.  The few gentlemen that answer the phone have less of an accent so that makes it easier to order.    \nI generally go for a \"lunch special\"  by far your best value (you can order it at any time of the day).  You get an entree, rice and an egg roll (you can sub for a pot sticker if you'd like) for like 6.50...  its a lot of food and again, it always comes hot.  I really love this place and it is definitely underrated.", "author": "Jesse M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-14", "description": "We have ordered from this place for awhile. At first, the food and timely delivery was great. The last few times, we noticed a downfall in service.  It started taking over an hour for delivery which is ok, then the delivery guy started calling telling us to come outside to get our food.   This last time, they took an hour and a half, called us to go outside to get the food from them, then we see they sent the wrong food.  \nMy husband calls and the rude guy on the phone tells him to come pick up the food or it will be another 45 minutes.  \nTerrible customer service,", "author": "Rhonnie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-15", "description": "Dealing with the owner of this place was also a nightmare. He was rude and uncooperative when I was trying to get a refund for the food that had bugs in it. At first he flat out refused, then he said we had to bring the food to him...I had it delivered because I don't have a car, how would I get the food to you? Eventually he agreed to send his driver over to retrieve the food so he could inspect it. That's when I took the pictures of the food. When the driver arrived, he immediately noticed that there were indeed bugs in the food and profusely apologized, saying he would show the owner right away. After he left we eventually got a call from the owner claiming that all of those things were just black pepper in the soup and he refused to give a refund. My boyfriend said that you could see the legs and antennae of the bugs and he said \"No it's black pepper thank you bye\" and hung up. We had to call back and try and argue with him more, while he still refused to give me a refund. \n\nEventually I just called the credit card company and they let me dispute the charge, and I sent a nice lengthy email to the SF Department of Public Health. I hope this place gets shut down, people should not be eating food of such poor quality.", "author": "Dana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "What a pleasant surprise! We weren't sure about this place because of the low rating on Yelp.. But they delivered in less than the time it was estimated to take, the food was delicious, and we got a free, generously packed order of chow mein because we spent a certain amount. Will definitely order from them again :)", "author": "Kate B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-16", "description": "I still feel a little traumatized from the \"Fried Crab Cheese Puffs\" ($5.95).\nIf you're in the market for two tablespoons of raw onion surprise nestled inside a deep fried wonton wrapper, than has King Lee got a deal for you!\nThere were a generous eight of them, but after tearing them all open and discovering to my horror that this wasn't just one goofed up \"crab cheese puff\" but a repeat offense, I couldn't even finish one.\nNo crab. No cheese. Just chunks of raw onion.\nEven now, mentally reminiscing makes me feel a little pukey.\n\nThe Shrimp Chow Mein ($6.95) was neither the best nor the worst I've ever had and the free eggrolls were greasy, but about what you'd expect from Americanized Chinese.\nYou could probably do worse, but Lord knows you can do better.\nDine with the King at your own risk.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-02", "description": "This is a review of delivery from King Lees.\n\nIt is easy to order via Grubhub.com.\n\nThe Mongolian Beef was bland.  I did not see any peppers in the dish.  While the slices of beef were nice and large, there was also a certain level of oiliness.  They did include the sides of hot sauce I requested.  Upon delivery, the food was basically room temperature.   The portion was pretty large.\n\nThe General's Chicken was also very bland.  The chicken was crispy on the outside and tender on the inside.  The portion was large and almost all chicken.  The was no pesky broccoli in the way.\n\nhttp://tinyurl.com/3om64eu\n\nDelivery - The order was placed at 1:41 PM.  The estimated time for delivery was 2:50 PM.  The actual time of delivery was 2:54 PM.   The delivery was relatively prompt.  But at just over an hour, it is certainly not the fastest of delivery options.  The delivery person was professional and polite.\n\nThe order minimum is relatively low ($15).\n\nPacking - The food was neatly packed into traditional Chinese food containers.  However, upon arrival, none of the food was very hot.\n\nPrices - The prices were pretty much inline with what I expect for Chinese food delivery.  For orders over $15, there are options for coupons.  I chose the free pot stickers. \n\n1  General's Chicken (Hot)  $ 7.75\n2  Steamed Rice  $ 3.00\n2  Canned Soda  $ 2.00\n1  Mongolian Beef (Hot)  $ 7.75\n1  General's Chicken (Hot)  $ 7.75\n\nSubtotal  $28.25\nTax  $2.40\nTotal  $30.65\n\nOverall, this was mediocre Chinese food.  There are certainly better options out there.  It was not particularly bad.  It filled me up.  But there are a lot of Chinese restaurants that offer delivery.  I can't really see ordering from King Lees again.\n\nFortune - The first fortune cookie did not have a fortune.  I do not know if this is a sign of the Apocalypse or not.  \n\nThe second one had the following:\n\"Admire those that succeed, and learn from them.\"\n\nThe lucky numbers were:\n14, 19, 23, 25, 29, 30", "author": "Mark D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "Ordered from here on GrubHub to my job at Pennsylvania Ave.\n40 minutes past my supposedly delivery time, I call grub-hub and they contacted the restaurant. They claim that my address doesn't exist and wouldn't retry the delivery. \n\nI've ordered to this address over 20 times through GrubHub and never had any deliveries have any issues. At the very least they could of called me.\nNow I'm sitting here alone at my job hungry and unable to go get myself some food.", "author": "Nikita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "My favorite Chinese place. It has a large menu and many vegetarian options. Delivery is free within one mile radius. It's always a pleasure to dine in and say hi to the very friendly staff. Highly recommended!", "author": "Liga W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-08", "description": "Definitely, never going to order delivery again.. I got food poisoning and I only ate 2 pieces of the duck. The duck was not moist either, it looked dried up like a prune. I would stick with sf chinatown for ducks. A least the small family shops in chinatown, have better food quality. Also, the black bean spareribs were not what I expected. Black bean sauce tasted extremely weird and I guess because I'm chinese and know this is not black bean sauce. Black bean spareribs should not be FRIED.. it is suppose to be steamed...The \"Chinese food\" to be honest does not taste like Chinese food at all. I had to dump my whole food out due to the fact it tasted sour and weird.", "author": "Kaida C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-11", "description": "I ordered Egg Rolls and got Pot Stickers. \n\nAlso there as a blue rubberband in my Chow Mein.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "Good food - veggies and eggrolls are fresh and not frozen. \nGood service - took ~ 5 minutes to get the food\nCheap - lunch specials range from $5.95-$6.95 and they give you enough to take home for dinner\n\nSo much better than panda around the corner.", "author": "Eunice K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-26", "description": "I think they added copious amounts of either maple syrup or brown sugar to the honey walnut prawns. They were so sickeningly sweet that I had to toss most of the dish.\n\nThe fried crab cheese puffs were very greasy. The chicken fried rice was decent but also a little oily and the fried prawn appetizer was dry and tasteless.\n\nI didn't get to the Won Ton soup which I'd ordered to have the next day but it has a very brown color like it's loaded with soy sauce so my hopes are not too high for that dish, either.\n\nIt was 30% more expensive than almost any other Chinese delivery. The only reason I'm keeping the menu is to double-check they didn't overcharge me (and then I'm tossing that, too, along with most of the food). \n\nOther than that, it was just GREAT... pass!\n\n______instant update: I think they scooped the contents of the dishwater to create the quart of Won Ton soup that included bits of grisly meat (was that tripe I ate?) and a moldy-looking shrimp, sharp-tasting dumplings and a piece of floppy celery. I had to throw that out as well. But.. they didn't overcharge me so now I can throw out their menu, too.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Stopped by since I was in the city on Xmas Eve, and nothing has changed (except the menu got a facelift). I was nervous they no longer served my favorite dish but not to worry! They continue to offer quick, friendly service and fresh ingredients. I still haven't tried anything on the menu except for the Triple Crown, and I still don't see a reason too!", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "The food is decent for lunch if you want delivery or work around the area.  Thankfully, they deliver to my office.  The food is quick, cheap and also tasty if you like that hole in hood type chinese food.  I think much better food than Panda Express", "author": "A L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-27", "description": "OMG this place gets 4 stars??? I just ordered from here using Grub Hub. The only positive I can say is it arrived early. The jerk who delivered it handed me a bag that was dripping sauce heavily from the bottom of the plastic bag. He then turned and walked away quickly. I got into my apartment and once I mopped up the hardwood (forget the hallway carpet) and opened the bag, it was a mess. The crispy orange chicken - which was advertised as hot was NOT. The recommended by a star Chinese greens with black mushrooms was totally bland (tasted like the orange chicken). The only thing that had some flavor was the chicken and veggies. Which sounded like the most bland but I wanted something healthy. No soy sauce, no napkins, nothing. \n\nDo Not Order From Here! What a complete rip off!!!!! A waste of $28.00!", "author": "Wine O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-24", "description": "So I've noticed a few of my reviews tend to start off with \"so this place is pretty ghetto...\" and it works for this one too apparently.\n\nBut, this place has cheap ass food that tastes great if you get take out or delivery. Its not a place you'd want to take a date or business client or anything like that.... or a friend, family member, or possibly the homeless guy down the street. Okay, maybe that's stretching it.\n\nBut they have about 9 tables that seat four people so don't show up with a huge crowd. The chairs are hard and will make your ass go numb within minutes. But their food is good. Did I mention its cheap?\n\nYa, all the food is like under $9. The walnut prawns..... I had a mouth orgasm just thinking about it. Yum! The mango prawns are good too, but not as good as the walnut prawns.\n\nThe sweet and sour chicken is okay... kinda dry I thought. but it had good flavor, just needed alittle more sauce. But that could be from the fact that we got it to go.\n\nShrimp chow mein, was okay only because I'm not a big fan of chow mein... the noodles are just a weird texture for me. They were decent tho.\n\nWhen you go in to order they have a bunch of their menu's sitting there. On the front of it, it gives you the option of a complementary 3 egg rolls and hot and sour soup, or 3 potstickers and another kind of soup.... I don't like egg rolls so I didn't eat them but my sis said they were very tasty. As for the hot and sour soup, I was a very big fan! \n\nBut ya, this place is kind of ghetto. I walk by it all the time to go to Safeway and always wondered how they stay open because no one is ever in it!!!! Thats cuz everyone knows to get free delivery (with a purchase of over $10) or pick up.\n\nAnother weird thing, for a Chinese restaurant with chinese cooks (so it has to be somewhat authentic), they give forks and have forks on the table right away. The guy behind the counter gave me a look like I'm crazy when I asked for some chop sticks.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-10", "description": "I wasn't too impressed with this place. \n\nWhether it's Mexican, Korean, or Chinese, hole in the wall places like this are either extremely delicious or they're not. Well, in my experience at King Lee's, they're not. \n\nI like that it's cheap. I like that it's convenient (it's located in a strip mall with a parking lot). I like that they're quick. What I DIDN'T like was the food, and at the end of the day that's the most important thing. \n\nI ordered orange chicken. It had green beans mixed in, which was a nice surprise, but they were EXTREMELY overcooked. They were shriveled up and didn't have much flavor. The actual chicken was tough and about three or four pieces had bones! Granted, the menu didn't say \"boneless chicken,\" but isn't that just assumed when you get orange chicken?  The sauce itself wasn't bad but it didn't really matter since it covered not-so-good chicken and green beans! \n\nWould I give this place another chance? Probably not. There's a Panda Express just a few doors down, and quite honestly I kind of like Panda Express. It's no worst than this place...", "author": "George A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "I had the Fried Prawns and Szechuan Crispy Prawns (Hot) which were unreal.  The food was way better then what I expected.\n\nWe had it delivered to a room we were staying at in San Francisco.  We were told that it was going to be a 40 minute wait for delivery.  Unfortunately, it took over an hour for our delivery.\n\nI'm not fussed by it though as it was well worth the wait.  This food is absolutely incredible and very affordable.\n\nBig Bang for your Buck with King Lee's!", "author": "Cal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-06", "description": "The worst delivery service I have ever met!!! Rude! I give him my full address but he cannot find it. When the person called me, he was yelling to me and blamed me for the address!!! All other restaurants can find my house with the same address! I gave him 20% tips on EAT 24, but he is worth none of them! I will never order from them.", "author": "Tiki L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-08", "description": "Meh, I've experienced better.  The pot stickers were a little heavy/doughy, the wor wonton soup was good, but the mushu pork, well... let's just say that flour tortillas are not a valid substitute for the thin pancakes that are supposed to come with it.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-29", "description": "After reading the yelps for King Lee's I thought that it deserved a shot.  Well in short the food was greater than awful (the snow peas were over cooked, the dumplings were deep fried (yech) and veggie mix were barely bite sized.  \n\nIn summary I was underwhelmed.  The order wad delivered in less than 30 minutes.", "author": "Chaz U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "I'm so torn =(  You are my go-to delivery place!\n\nI don't know why, but king lee's, you just didn't satisfy my late night study munchies tonight. damnit, i hope you just are having an off night.\n\nIf this were my first time ordering food from here i'd never order it again and i would have given it one star on here.  But I know what King Lee's is capable of.  So i will just knock off a star or two for their inconsistency....When i order again, if it is still crap, well, then i guess it's official.\n\nHoney Walnut Prawns\nThe ONLY ONLY ONLY thing that has been consistent is the honey walnut prawns.  (Sadly i didn't order them this time around, who the hell know's why!)  They are my second favorite prawns in the city, and my number one fave delivery prawns. So crispy n delicious n the sauce is tangy and yuuuumm.\n\nPork Chow Mein:\nUsually four stars! Lacking a little texture sometimes but the giganto moist chunks of pork in there make up for everything. Until tonight, why do my big pork chunks have the texture of gritty beef jerky? ...I ate around the pork jerky.\n\nMongolian Beef\nUsually actually spicy and chewable. Today it was neither nor.  Bland as hell, not spicy in any way, and every time i put a piece in my mouth and chewed it either got stuck between my teeth because it's so gummy, or springs back to it's original form.  I've never had beef this texture. \n\nOrange Chicken\nThe flavor is there (but again not spicy like it says on the menu...did they run out of chilis or something?)  And i know this is delivery so one would expect fried stuff to be a little on the soggy side...well....they countered that assumption when they delivered my food only 25 minutes after i ordered it.  it must have been soggy to begin with if it got to me that quickly.  And why are there string beans in the orange chicken? Random, and not fitting but not really a complaint.\n\nSteamed Rice\nIt was good steamed rice ;)\n\nYou have one more chance, guys...Otherwise i'm just going to have to find the next chinese delivery, and anyone who knows anything about finding a good chinese delivery place knows that it is just not a good experience experimenting with that. bleh.", "author": "Mo L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "it will do in a pinch, but nothing great. Super greasy, super cheap chinese food. The \"Spicy Wings\" are not spicy, the egg roll (hey, it was free....) dripped oil, and the sesame chicken was soggy and overly sauced. The best thing was the BBQ pork chow mein, which had big chunks of BBQ pork.", "author": "Jeremy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "The food is really good. i like the kao pow chicken or tofu. They make your food to your liking  (add or take out any ingredients you don't like)without any attitude. The fried shrimp rice is also very delicious. The 5 stars is deserved because of service and food. Real friendly and a quick pick up time . Just Great.!", "author": "Found O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-03", "description": "The food is awful, greasy, badly flavored and it doesn't taste fresh. I ordered 4 dishes and they were all a disappointment. This place could use a new chef. It took about 45 minutes to be delivered.", "author": "Juan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-27", "description": "The food and portions were adequate, but I dock this place a star because they didn't give me my free appetizer after I spent more than $30 on dinner. I didn't ask at the time, but I saw after the fact that we were entitled to it. Don't cheap out on your customers!", "author": "Tabitha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "I moved back to San Fran 7 months ago and I struggled to find my \"Go-to\" places for delivery. \n\nAfter some experimentation, King Lee's is my go-to chinese. I usually order off of grub hub or seamless web and it gets to my door in half the time they say it will. It's always steaming hot. And the very nice delivery men never complain that I'm a walk up with 5 flights of stairs!\n\nI tip big.", "author": "Nihad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-24", "description": "Parking is a battle and the area is too bad to just park on the street; so keep circling around til you get one near the front.\n\nI would actually rate them a 3.5 *'s...\n\nDined in and order ed $55 worth of entree's including appetizers: (2) appetizers: Sal & Pepper dry fried ribs and the sampler; Won ton soup, House chowmein, House Fried Rice, and Ginger Beef.  A lot of food for 3 adults and a toddler...NOT IN THIS CASE...The portions were embarassingly small.  No left overs, and we actually left unsatisfied.  :(\n\nHowever, the food did taste GREAT, with the exception of the Dry Fried Ribs...\"ARE YOU KIDDING ME KING LEE'S!!!!\"  My brother in-law swares by them and the waiter/owner gave us his own so called rave review, stating, \"they are our specialty\"...o-k-a-y.......................If you consider seasoning a handful of rib tips BONE ONLY,  NO MEAT WHATSOEVER, and frying them... WTHEEEEZY??????? There wasn't even enough slivers of meat around the bones for me to throw to my puppies at home!  And had the nerve to charge us $9 for some salt & peppered charred (not fried) bones!\n\nMy suggestion, order to go, we receive more in the to go containers than we did dining in.", "author": "Erika H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-07", "description": "I happened to be in the old hood today, hungry. King Lee's is located near the Fillmore Safeway plaza, right next to a Panda Express. I decided to skip the $5 lunch specials at King Lee's (includes soup, egg roll and rice) and order from the meal since I wanted the walnut tofu and the King Lee's special veggies. With rice for two and three free egg rolls came to $20 with tip and can feed 2-4.\n\nThe walnut tofu is really different, I have a love/hate. Its overly sweet much like General Tao's or Sweet & Sour but it has a mild, almost milky/savoy flavor which is nicely complimented by the toasted walnuts. There are very few tofu dishes like this. I could see myself trekking across town for the walnut tofu. The King Lee Special Veggies contains green beans, eggplant and fried tofu triangles in a mild spicy sauce. It can be oily at times, much like all Chinese food but the flavors are good and consistent.\n\nThey made the food for take-out in less than 5 minutes. King Lee's dining room is dirty. If the kitchen is anything like the dining room I can imagine some scary stuff happening, but I have never gotten sick. I have never ordered delivery, but now they are on Grub Hub. My take out experience was awesome! If I am back in the hood, I will be here at King Lee's getting food to-go.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "I love ordering take out from here. Super fast and great food!", "author": "Alicia K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-17", "description": "Ordered the lunch special. No fortune cookie. Doesn't matter, I know what my future beholds: Diarrhea.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "Ordered off Grub Hub.  Estimated delivery time was about 1:15 from the time I ordered, but ended up showing up about 30 min earlier than that.\n\nGot the: \npork fried rice.  Good\nmongolian beef: Good (menu says 'hot', not very spicy)\norange chicken: Good (menu says 'hot', not very spicy)\npotstickers: Good (deep fried, like gyoza)\nwhite rice: Good\n\nEverything arrived piping hot.  I feel like everything tasted better after the juices had time to settle and was cooled a little bit.\n\nI will order from here again.", "author": "Light Bulb J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-19", "description": "This place is hidden on the backside of the Fillmore plaza but for the lucky people that know where it is at they will get some good Chinese food. Although the place is empty most of the time, they do mad work take-outs and delivery so don't let that fool you into believing the place sucks.\n\nThey have a very good menu full of authentic and Americanized dishes. It is like taking a restaurant out of Chinatown and planting it in Pacific Heights. They know how to cook it to get those taste and flavors of real Chinese food. My favorites were the salt and pepper squid and fried pork chop. Like the usual Chinese restaurant, you get great bang for your buck. They even give you free potstickers or egg rolls if you order over a certain amount. I love quality cheap eats like these.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "So by now, after discovering that not only do they deliver, they deliver with haste! I've come to really appreciate their food.  Some have told me that their food is often oily and stomach pain-inducing.  \n\nI've now had their food on numerous occasions and have yet to encounter the physical effects they describe.  As a matter of fact, I've tried many of their dishes by now and have enjoyed most of their meals.\n\nChicken Fried Rice\n-the chicken is very tender, bursting with flavor in every bite... hard to believe, right?  That's what I thought too until I bit into that chicken... on two different days.\n\nBeef Chow Fun\n-now THIS is an oily dish.  Then again, when is beef chow fun ever NOT oily?  The dish here, however, is pretty flavorful with not too much soy sauce flavor, but not too bland like some places I've tried.  The beef is well cooked, meaning not UNDER-cooked, and the overall meal was enjoyable.\n\nBeef and Tofu\n-At this point, this is probably my favorite dish.  The sauce that covered both the tofu and beef was the game changer.  While I'm not sure what exactly the sauce was, it was a good mix of tangy and salty.  Maybe a little garlic somewhere in the mix?  I'll have to try more dishes to determine how this compares with what I've had so far.\n\nGarlic Chicken\n-Tasty chicken, but too much crowding of the veggies.  It seemed almost like they put so many veggies to take up the space where the chicken should have been.  What the heck?  The meal was good, with a pronounced garlic scent and flavor, but it might not be a good idea to have this during lunch at work.\n\nHot and Sour Soup\n-A good sour kick in this soup, I'd call this a legitimate H&S item to have even when comparing it to other full fledged Chinese restaurants, formal or informal.  The price comes in at a mere $5.00, but has enough soup for 3 people.  I recommend this to anyone who likes H&S Soup.\n\nTomato with Tofu Soup\n-Bland, leave it alone.  The tomatoes couldn't even save it.  Nothing could have saved this watery bowl of disaster.  Where's my H&S Soup?\n\nQuick delivery, solid food most of the time, great prices... 4 Stars, easily.", "author": "Johnson N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "I love this place! It's defiantly what I look for, the typical Chinese Joint. Nothing fancy, old pictures hanging on the wall, boxes of soda stacked up on a shelf in clear veiw, and just through the kitchen door you can see a family tearing some delicious Chinese recipes apart. I've eaten here a handful of times. Walk there with my friends and eat in. They are ALWAYS slammed with orders and are on the phone but there is always someone that waiters us and their food is great! Their hot and sour soup is to die for and I haven't eaten anything on their menu that I haven't loved! HUGE portions too! They don't skimp! I know there are other Chinese restaurants in the Western Addition area...but I don't even wanna look. I love King Lee's!", "author": "Liz L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-10", "description": "Delivery guy shorted us $20 and when confronted he claimed his math was correct. He was very sketchy about it. The restaurant wasnt any help what so ever.", "author": "K K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-14", "description": "Sooooo!!! I have been ordering from this place for over a year and recently switched to ordering from them on GrubHub. The last time I ordered I had the walnut prawns, the pot stickers and the house chow mein. Everything was delicious until I tasted that chow mein. It tasted a little off so I finished the rest of the meal and did not get back to the chow mein to until the second day. A quarter way through the chow mein, no lie, I found a COCKROACH!!! I'm not even lying, I still get queasy thinking about it. The most disgusting thing that has ever happened to me. This place needs to go out of business. I don't care what the excuse is I should NEVER EVER find any bug og any kind in the food, especially not a COCKROACH!!! UGH it makes my stomach hurt just thinking about it. Please put this place out of business!", "author": "Whitney R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-14", "description": "2-words..... crispy chicken!\nThis place has probably one of my favorite sizzling rice soup! and combo-ing that with probably the BEST Crispy Chicken EVER is probably heaven on earth - at about $6/plate!!\n\ndelivery is probably not the best - i live about 4 blocks from the place (yeah, so what  - i'm lazy as f*ck) and it took 45 mins (definitely -1 for that delivery service)", "author": "Ken T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-18", "description": "3.5 stars?!?! These people must not be Asian. Wonton soup was very plain and they use chow mein noodles. Other foods have some flavor, probably from MSG.", "author": "Cedric F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-10", "description": "This place is disgusting!  My co-workers and I ordered food and there was a ROACH in my mongolian beef! I have pictures to prove it.  Of course my co-workers didn't want to eat their food, and King Lee's is refusing to refund the meal.  They said they will refund the dish but not everyones.  WHO WOULD WANT TO EAT HERE?@@?", "author": "Allison S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-25", "description": "This might be the worst Chinese food I have ever tasted. I ordered from grubhub and they were 20 mintues late so it took me 90 minutes to get my food. The free egg rolls were greasy no flavor, the crispy chowmein was cold and the sauce had some indescribably bad taste, the kungpao chicken smelled like urine and the crab in the cheese puffs was spoiled. I came on to yelp and noticeded they have a 65 score from the health department.  Really glad I threw the food out.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-21", "description": "NOT WHITE MEAT CHICKEN!!!!!\n\nThis place is a fraud when they say \"Chicken (White Meat)\" at the top of the Chicken section.  We ordered Orange Chicken and Sweet & Sour Chicken.  Both were DARK meat (mostly breading and breading goop meant to disguise the chicken i guess).  Furthermore I found a piece of bone in the little that I ate.\n\nI called the restaurant and they explained that only certain sautéed dishes are White Meat?\n\nCompletely ridiculous and I'd guess illegal.  I suggested they correct their menu online as well as printed (got one with delivery showing same thing).  The gentleman on the phone apologized however it's criminal in my book. I plan to report them (to whom I'll figure out later).  \n\nBE HONEST about your food!!!  Many people could care less about dark meat and may prefer it; we do not.", "author": "Jon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-14", "description": "Add two small shrimp for 1$ waited 23 mins for mah food twice. I like the last owner.. Food are great and superfast service", "author": "Jericho P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-29", "description": "Awful. Delivery guy wouldn't listen to the directions to the apartment and claimed he \"couldn't speak English\". If you can't listen to your customer repeating \"3rd & Folsom\" when you're a block away, delivery job might not be for you! I had to literally leave my apartment and FIND the delivery guy because he refused to listen and just kept telling me where HE was. The food was absolutely inedible - the steamed pork buns were chewy, tough and hard (not at ALL fluffy or soft!), the cashew chicken was bleh, the crab rangoon was mostly crust and not much filling. Overall, we tossed it and ordered from Big Lantern instead!", "author": "Pamela F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "I my ongoing quest to find a superlative Chinese delivery place, I tried out Kind Lee's the other night. The guy taking my order was friendly and patient when I asked him a question about some specials, and he promised delivery in about 45 minutes.\n\nWhen the food arrived 30 minutes later, we dove right in. The shrimp fried rice was only ok (I think there maybe 4 crustaceans!), but the mu shu pork, crispy orange chicken and above all the Triple Crowns special (sliced chicken, beef and shrimp stir-fried with scallions, gin and garlic) made up for it. Interestingly, the latter two dishes had a definitive and welcome spiciness to them.\n\nOh, we also ordered the hot and sour soup, another winner, where a $5.50 order easily serves 3 people. All in all, a pretty fine choice, especially when the weather is as cold and wet as it tends to be around this time of year.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "I've tried just about every other Chinese delivery in the NOPA/Western Addition/USF/Haight/Hayes Valley/Pacific Heights/Inner Richmond area, and NONE have been as good as King Lee's.\n\nI've found my new and only Chinese delivery.  Done and done.  Bomb diggity!\n\nNot to mention super fast delivery as well.", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "King Lee's is great! P.F. Chang quality at Panda Express prices.\n\nCombos under $10. My fav, bbq'd pork fried rice with Orange chicken and an egg roll. \n\nOnly 4 stars because of the dine in area. Not a place for a date, business meetings, or for ambiance. But great for take out, delivery, or catering.", "author": "La Toya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "I love you King Lee. My friend and I have a tradition, good conversation, and 5 lbs of chicken wings and chow mein. \n\nPs ask for the combo plate, it's like that, they totally don't mention it\n\nPPs  I love food coma", "author": "C G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-17", "description": "Stopped eating from here when I found a hair in my fried rice. Food here use to be very good but they must have added a new cook or something. Their prices depend on who takes your order. After reading some of the reviews on here I am glad I no longer eat there so far I have read that at least 3 different people have found COCKROACHES in their food \"YUCK' Save your money you would do better going elsewhere.", "author": "Beverly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "I've got to say, its pretty good for the price. We had our standard testers tonight with broccoli chicken, veggie fried rice, generals chicken, pot stickers and egg rolls. All pretty damn tasty at a very reasonable price. We caught them at the end of a Sunday evening and it was still good. HIghly recommend take out, as its freezing in there.", "author": "Raylan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-02", "description": "I usually dont write reviews for poor experiences as its a waste of time complaining but this place has the worst customer service ever.  I've been ordering food here for a few years because its close and the food isnt bad.  We usually get rude service but we laugh it off.  This time we were trying to order a party tray of food over the phone (which we have done many times in the past) and the person on the phone just kept screaming at us (in a thick accent) to read the menu and only order things on the menu.  We had the menu in our hand and was reading straight off of it.  He slammed the phone on us and that was the end of our patronage.  What a complete jerk.  Good luck dealing with these people if you choose to try this place.", "author": "Jae L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-17", "description": "I do not know how people like this place. So I never tried before. I came to my bf's house the other night to visit and he said King Lee's food is on the way. He ordered me Szechaun Chicken and Chow Mein and for himself Lemon Chicken and Fried Rice.\n\nDelivery is fast as hell. 15mins i think??\n\nSo here was the problem. I got the food, ate it right away. I was starved. It was pretty good. I'm not the biggest fan of chinese takeout and I'm always skeptical of these places. Buut I trusted it because well it seemed pretty good.  Except for twice I know that they seem to always mess up my BF's order and give him veggies. LOL. Maybe they have something against him. idk.\n\nWorst part coming up. I get home around 10:30p after eating at 5:00. All of a sudden my stomach gave me the worst cramps EVER! I know it was the food cus I literally yacked it all up. Bad trip in the bathroom.\n\nTHANKS KING LEE. i love u too. HA", "author": "Sarina I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-04", "description": "A-choo. Sniff. Cough cough. Shiver. \nWhen the following occurs, I reach for Chinese penicillin, otherwise known as hot-and-sour soup. The first chill in the air, and my body follows suit. Chills, fever, aches, and pains. And since Mr. Biscuits is useless in the kitchen and I have nobody [bring out the violins] to make me soup, King Lee's is the next best thing. They're on my speed dial. And speedy they are. Good too. \n\nNow I have some sneezing to do.", "author": "Suzanne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "After a year of testing and not finding the right Chinese delivery place I am happy to announce the search is over.  My mouth is currently full of super crispy spicy orange chicken and if I can tear myself away there are some delicious veggies in garlic sauce that smell great!\n\nWe just threw out all the other takeout menus.", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "I'd really like to give King Lee's 4 1/2 stars. Alas, this is the system we're stuck with.\n\nI've actually only had it delivered, so I can't attest to the dine-in experience but I've walked by it on the way to Harputt's and it looks nice enough. The delivery is unbelievably fast, I think they may have a secret network of underground tunnels throughout the city with their delivery boys manning supersonic rocket sleds. When I lived in the Haight I'd sometimes have it more than once a week so I began timing them to see how quickly they could make it. Most of the time it was in the twenty minute range, already dumb fast, but the fastest ever was 13 minutes. Think about that for a second. It must take at least 12 minutes to actually cook the food, pack it up, and hop into the sled. Needless to say my food was always fresh and piping hot, though sometimes the bag smelled suspiciously of rocket fuel.\n\nThere is a guy a couple of reviews away from me who said the delivery took 45 minutes and he lived four blocks from there. I'd bet that King Lee was punishing him for sloth; the old man Lee is a fair but stern monarch. \n\nLike I said everything is always fresh and hot, crispy vegetables and good fried rice with no peas in it. The kung pao could be a little spicier (that may be a good thing to you) and sometimes the dishes can be just a touch too saucy for my taste. These are trivial complaints though, I enjoyed everything the King has brought me so speedily. \n\nHail to the King.\n\nP.S. The unintentional comedy in their take-out menu typos is always good for a laugh. \"House Dumpings\", anyone?", "author": "Trav W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-06", "description": "Ok, I'm really confused.\n\nI yelped chinese delivery about a month ago and up popped King Lees. We ordered the orange chicken, some chow mein and egg drop soup.\n\nIt arrived quickly, and both the entrees were fresh and delicious. I didn't really like their interpretation of egg drop soup, but eh, whatever. didn't hold it against them.\n\nSo last night, my husband and I ordered king lees again. This time we had the crispy beef and the chow mein.  There was nothing crispy about the  beef. It was chewy, soggy, and covered in some sort of gross gelatenous coating. The chow mein tasted funky too. I ended up throwing mine in the garbage. gross.\n\nI don't know what happened? I was pretty happy with things the first go round, but this time both items were really really poor. What gives King Lee?", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "There are three things that every budget-conscious city dweller needs in their quick food arsenal.  A good, cheap stop for Chinese food, Indian food, and Mexican food.  You've got the Chinese food covered with this place. Quality meats, good price and they deliver promptly.\nJust make sure you have your favorite frothy beverage nearby cause this salty supper is sure to have you grabbing for your glass.", "author": "Nada b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "In four years of living in San Francisco, this is the first time I've had decent delivery Chinese food. Honestly, I think I'm just pleasantly surprised that the chicken looks like chicken...", "author": "Mariah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-06", "description": "I order Chinese Food from here because their vegtables are crunchy.  \n\nThis only means one thing to me.  It's fresh!  Surprisingly enough!  I was thrown by it's fillmore location near the safeway and it's less then desired interior design...but we don't go here to sit and have dinner.  I call in and their uber friendly staff deliver it so i can have dinner as god intended, in the living room in front of the television.\n\nThey know me now.  Yes, House Chow Mein.  Yes, Orange Chicken.  Yes, Wor-Won-Ton Soup.  Even their chicken tastes like chicken!\n\nAnd it's fun to play spot the typos on their take out menu.\n\nHouse Dumping Soup, for sure.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Good fast-food chinese. I've ordered delivery from this place a few times now and it's always fast, hot and yummy. It comes in those little folded take-out boxes that are so fun to eat out of with chopsticks. The classic sweet and sour pork is tasty as is the garlic chicken. One of the most important things is that the meat isn't gristly or \"mysterious\" tasting. Doesn't hurt that it's also smothered in delicious sauce. I tried the chicken chow mein once and found it a little bland, but everything else has been good. I'm not entirely able to explain why I'm not giving this place 5 stars. I guess it's good (for junk food I mean), but it doesn't really take it to another level, you know?", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "Cheap, Easy, and Tasty....\n\nOkay, that didn't type so well.  Amazing pot stickers, big appetizer portions, the best mu shu pork, and super fast delivery.\n\nDon't eat at the restaurant.  Grab'n'go or have them deliver.", "author": "kevin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-31", "description": "i have ordered here for a long time, never had a problem with my order until today. they didnt send my free rice and when i called back to try to get my rice send over they said they werent coming because i didnt tip the driver. its not manditory to tip the driver. specially when they dont come up to my office they sit outside in the car and on top of that dont even get out the car to give me my food. they sit in the car. the food is alright but todays service was horrible. food was bland (no flavor) and the customer service was garbage. im telling everyone in my office to not order from here ever again.", "author": "Gloria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "Probably one of the best Chinese takeouts in SF. Our go to whenever we are in the mood for delicious, fast and easy Chinese food. We usually order off of GrubHub and it arrives to the house within 20-25 minutes. Super convenient and tasty!", "author": "Trisha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "This is what I'm talking about: Good, cheap Chinese food, delivered to your crib when they say it will be!\n\nFurthermore, King Lee understands what Chicken Chow Mein is supposed to be. None of this fat noodles with broccoli and Bok Choy. If I wanted broccoli and bok choy I'd order it. No. Just greasy noodles and chicken the way Confucius intended.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "I can get my food FASTER when I order it for delivery to my apartment than when I phsyically go in to order and take it home myself.\n\nRiddle me that, Riddler!", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-23", "description": "Nothing special about this place. The food is very greasy, salty, and not of high quality ingredients. The last two times I ordered their chicken, there were bone pieces stuck in the meat. We use to order for take out, since their dining area is dirty. Also the restaurant is placed in the safeway parking lot that is very unsafe.", "author": "O N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "I just ate lunch at King lee's.  I had orange chicken, steamed rice.  The lunch special came with a complimentary egg roll, hot sour soup and hot tea.  All that for $7.40.  Not bad.  I've been a customer of King lee's since the day it opened. The restaurant is not the prettiest place-nothing fancy, more like a dump.  But most importantly the food is good! Cheap prices. I recommend the Phoenix and dragon.  YUM!", "author": "Cherry C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-02", "description": "Maybe I let my blood sugar get too low. But the King has made me angry.\n\nThe phone was busy so I had to call a bunch of times to get through. I took this to be a good sign. I was wrong.\n\nI live 10 blocks away. The food took 45 minutes. Not horrible, but definitely not fast.\n\nThe pot stickers were cold. And disgusting. Maybe they were disgusting because they were cold. Maybe they were cold because they took 45 minutes to get here.\n\nThe orange chicken was Panda-expressy. The mu shu was worse. The free egg rolls never came. They told me I could get double next time. But I'm thinking  there probably won't be a next time.", "author": "Maria-Fernanda G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-13", "description": "I've ordered here in the past and had a 3 1/2 star experience.  It was never 'great' by any stretch, but it would do in a pinch.  Tonight was one of those nights.  And it ended up being one of the worst chinese food experiences I've ever had.  \n\nBroccoli beef:  The meat was stringy and tough with a very high fat content.  It was like having slivers of fat in your mouth that you had to chew to enough of a pulp to get it down your throat past the gag reflex.  I understand that this can't be helped entirely and its bound to happen.  But it was every single piece of beef in the dish.  In other words:  totally inedible.\n\nPrawns with Cashew Nuts:  Prawns were probably in the sun a little too long out back.  They tasted overly fishy, and not in a good way.  Again, this dish was totally inedible.  And quite a bummer since i was looking forward to this dish. \n\nVegie chow mein:  The highlight of the meal (since you could eat it.  Although since i spent $25 on the three dishes combined and ended up eating just this one, it was kind of an expensive carton of noodles.  \n\nAgain, I've been here before and it was okay in the past; not great, but okay.  This time was horrendous.  Be prepared to take your chances. \n\nOh, and be sure to have it delivered.  The restaurant itself is pretty gross.  You definitely don't want to eat there.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-01", "description": "All I have to say is ROACH! I don't know why this place got so many good reviews. The food was disgusting and my friend had a roach in the middle of his rice. We were so disgusted.", "author": "Miss B N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "this place is great, I just moved here and needed something cheap and delicious. I am too far for the real stuff on clement, but this would have to do. plus, panda express was not what i was looking for.\n\nright now, the beef chow fun is delicious. hot, not too salty, and lots of noodles. 7 bucks including tax. I am taking this to work tomorrow.\n\ngo here for sure!", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "This weekend I introduced my parents to grubhub.com when they came to visit!  They both wanted Chinese and I was happy to oblige.  We looked for the highest rated Chinese resto with the best prices et voila King Lee surfaced.  We ordered the Mongolian Beef (nice spice, not as much green onion as I am used to), Chicken and Veg (TERRIFIC--great variety of perfectly cooked veg, I'll get this again), Chicken Chow Mein (perfect--not greasy and good flavor), Hot and Sour Soup (a bit different from I've normally had it, but I think I liked it better--it tasted more fresh).  I liked that they don't include MSG and that they deliver!  I will definitely order from King Lee again.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-09", "description": "The building looks like a shit hole and that alone might make you pass on it BUT the food is really, really good.  You get free egg rolls/ hot & sour soup with orders over $15, but you need to ask for it or they won't give it to you. Delivery is also free within something like 30 minutes of driving time. Anyways the food is really good. I love the garlic chicken and also the sweet and sour pork. It tastes very fresh and they pack the to go boxes to the top so you get a lot of food for your buck. Prices range from about $4.95-$10.95 per item, but as I said you get big portions which means lots of left overs. Oh yeah, either get the food to go or get delivery, the place looks like a homeless shelter.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-08", "description": "This place is ghetto as can be and I am not sure I want to know what they put in their food BUT it is soooooooooo good.", "author": "Lena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-09", "description": "I can't believe how good this Chinese Food is!!!! I live in the Fillmore Center and they deliver. Wonderful service!", "author": "Darrell R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-20", "description": "I would not recommend this place.  Me and my co-workers decided to try a new place for lunch and we chose this place.  Come to find out we made a mistake.  The fried wontons are not fried wontons.  Also when we did receive our delivery and the driver left, we had nothing to eat our soups or chow mein with.  Its hard to eat hot wonton soup without a spoon or fork.  I would pass on this place!", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-26", "description": "After so many great reviews, I was really excited to try this place. Disappointment. It took over an hour for delivery, which is absurd considering I ordered soup and eggrolls, arrived luke warm, and the delivery guy marched himself right into my living room upon me opening the door. \n\nIn short, I got...\n\n1) BAD food (what exactly is in that wonton soup?\n2) BAD Service..an hour late? really?\n3) A stomach ache...I ate that wonton soup and it is seeming like that was a bad choice.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-19", "description": "It's always risky trying a new Chinese place...and this time, Yelp did me  wrong!  \nI felt like I was eating food that had been sitting around all day.\nThe veggie pot stickers were inedible, as the bottom was completely blackened and looked like they were made out of play-doh.\n\nDo yourself a favor and call Tai Chi on Polk street!", "author": "Plague Eater X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-06", "description": "Barely mediocre at best. One of the local chop suey palaces that litters my lobby with menus, it caught my attention with its special offers . . . but the lure of complimentary hot-and-sour soup and egg rolls with a minimum $15 purchase is easy to resist once you've tasted them. Since delivery was fairly quick, there was no reason for all the food to be lukewarm. That it was bland and greasy is another story altogether.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-26", "description": "Not bad at all. Cheap Chinese food is always good, isnt it?!!! Good quantities and decent quality. Lunch specials are decent. Not a great place to dine with family, should be OK for carry outs.", "author": "Aussfchi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "I'm not sure people know what they're ordering here.  Looking for greasy but delicious Chinese delivery to cover that urge to eat something terrible for you  -  the IS the place.  Everyone that stays with me from out of town, when we're hung over - this is the San Francisco request over and over.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "I don't have to say much. This was by far the best chinese delivery I've ever had. The food was amazing, they delivered quickly (and we had a big order!), and the customer service was unbelievably refreshing. No need for detail when I can just say it like it is, King Lee's now has a loyal customer. =]", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-26", "description": "I know, 5 stars for a Chinese delivery place?  But seriously folks, if you want Chinese delivery this is the best in town (I've had quite a few).  The chow mein is ridiculously good!  The crispy szechuan beef is outstanding and the orange chicken is superb.  The best thing on the menu is the chicken fried rice, which you just cannot get enough of!  If you have to pick only two things go the super carb route and get the chicken chow mein and chicken fried rice.  You will not be disappointed!", "author": "Angela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "King Lee's is good. Bottom line, its cheap chinese food; but if thats what you want call up the King.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "I was looking for a good Chinese delivery in the Haight, after reading the reviews, this seemed to be an obvious choice.  Everything you've read is true: fast delivery, cheap prices and delicious food!  We ordered 5 entrees and an appetizer for $50, fed 4 plus two meals of leftovers.  This is the only Chinese place I'll order on from now on.  The walnut prawns and the salt and pepper ribs I would definitely recommend!", "author": "Emma S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-07", "description": "I found my Chinese delivery place. All I can hope is now that I've moved that I'm not outside their range. I'm sure it's americanized, but it's damn good. White meat chicken, great sauces, fast, cheap, and they always get my order right. \nI'm addicted to their orange chicken and fried rice. can't get enough, and haven't found anywhere that compares. Potstickers tend to be a bit more overdone than i like...i prefer them more dumpling-y..but still good. Egg rolls are great too. So far haven't found anything I don't like. 18 bucks gets you dinner and lunch...with a little left over.", "author": "Diane W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-31", "description": "3 stars cuz I was really hungry and they delivered it fast.  I was unimpressed w/ my dry braised string beans w/ chicken and mango prawns.  Both were high in grease and low on flavor.  Based on other reviews, the king seems to be hit and miss so maybe this was a miss night.  The search for good delivery continues.", "author": "Zach J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "Three star food + five star delivery = four star experience.  I live in nopa and the food took 23 minutes from call to arrival, pretty great.  it was good, decent, definitely nothing special.  I crushed it, though, and was more than satisfied for my $20+ tip.  Even had a little leftover chicken for the AM.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "Decent sesame chicken and crab rangoons delivered to my door just in time to help me out of a rippin hangover. Overated, not sure I'll eat here again.", "author": "M L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-08", "description": "Had I reviewed this place a month ago, I would have given it four stars for decent food, good prices and fast delivery.  HOWEVER,  the last time we ordered King Lee at work, I got the chicken w/green bean lunch special, and you know what I found in my very last bite?  A ROCK!  I'm not kidding you.  Okay, it was more like a pebble, say about 5x5mm, but STILL!  It was in my mouth!  Good thing I didn't bite down on it or swallow it.  I didn't even bother calling them.  I just won't order from them ever again.", "author": "Eileen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-23", "description": "Despite their humorously typo-laden menu, this place is surprisingly great on many levels.  Rapid delivery and by that I mean it took them at most 15 minutes to get our food to us.  Granted we were almost directly across the street from them, but still...over the years I've come to realize that means NOTHING with delivery.  Their szechuan beef is really tasty as is their triple combo w/scallions (under their specialties section).  Their crispy orange beef was only okay as were their eggrolls but the eggrolls and a HUGE order of decent hot and sour soup were FREE w/the coupon on the menu.  $21 for two people to stuff themselves like pigs and STILL have leftovers?  WHOA Blossom WHOA!", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "I would give this restaurant 4.5 stars if I could. I had it delivered and have no idea what the restaurant is like. \n\nI just moved to the Tenderloin and have been craving some good Chinese food. This area has so many different kinds of amazing food, but seems to be lacking Chinese (delivery more specifically). Again, I am so thankful for Yelp because, this restaurant rocks. \n\nWe ordered:\n-Chicken won ton soup -- so so good. Broth very tasty, veggies and meat very tender, with quality taste. \n-Walnut Prawns: I've ordered this dish from many different places. It is SOO good here. If you like this dish, get it. \n-String beans w/ tofu- really fresh tasting and good. Probably at the same level as other good Chinese I've had, but delicious. \nChicken Fried Rice- I like to get this instead of plain white rice. Very good. Not dry at all. \n\nAll this cost $32 and was delivered from the restaurant to the Tenderloin in 25 minutes. That's crazy. I'm used to waiting around an hour for delivery, even when the restaurant is close. \n\nI will be back, for sure.", "author": "Roger W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-05", "description": "I am so glad King Lee is close when I start craving great Chinese take out. The food is excellent and fresh- I swore they used MSG my first time, but they don't! And they never scrimp on the shrimps but I highly recommend the Sesame Chicken.", "author": "Ronnie Ray H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "I order here pretty often. I feel like they know me already, dayum. They have some really cheap food with free soup and egg rolls, which is great. They deliver so fucking fast it's insane. They have been there for me when I drink myself into hangover comas and through the pouring rain they always bring my orange chicken nice and hot. If you sit down and eat at the restaurant they've got that hot tea shiet.. it's good. King Lee, I love you.", "author": "Tessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "So I just moved into the general area and my roommate and I wanted to order in.  Of course, I turned to my trusty old friend, Yelp.  Since King Lee's was getting pretty high ratings, we decided to order from there.  And WOW did it arrive quickly.   The egg rolls, while there were only three of them, were really good and fresh tasting.  They weren't like those processed or over-fried egg rolls that turn your bowels upside down.  The egg drop soup was to die for and came in a giant Tupperware thing.  I had a second helping of the soup, and I'm not even that big a fan of soups.  The szechuan beef was pretty good, not too spicy, but a few pieces in there that were more fat than meat.  But the chicken chow mein??  OH my god.  SO good.  While I was eating it, I noticed that it was fresh.  I never knew chow mein could be fresh.  but the flavoring was perfect, the sauce wasn't overdone, the chicken was very tender, and the noodles... oh man... the noodles were like little golden strands of heaven in my mouth.\n\nI have found my home base for ordering Chinese delivery.  :D", "author": "Emily K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-05", "description": "This place was hard to find - it is around the corner near Safeway.  Actually they looked shocked that someone found them at all for dinner, and even more so that we wanted to eat in.  We got paper to-go menus, which was amusing.  The placemats look as if they'd been used or doused in water.  Cleanliness was dubious.  The chow fun was rather mushy.  The hot and sour soup was OK.  The walnut prawns were fantastic.  It is certainly an experience, so check it out.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-29", "description": "Two hour wait for delivery, two calls, luke warm and semi edible food. If that's your idea of service and quality then by all means order from this restaurant! No stars, no way, never again!", "author": "Michele C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "Had the General's Chicken and it was great. I'm glad to have found my new Chinese place in SF!", "author": "Erik B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-10", "description": "Have been eating here for a long time. Filling Chinese food at great price.", "author": "Haileab B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "This place is the best chinese food in SF! Not much to look at but damn tasty! Delivery is so fast it is insane!", "author": "rich f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-27", "description": "Plain chinese food with as little variety as possible. My mushrooms with tender greens should have been called \"just bok choy and mushrooms\" and the vegetable fried rice should be called \"just eggs and rice\"", "author": "Jaron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-08", "description": "When I feel a cold coming on, I quickly dial up KIng Lee for their incredible Chicken Won Ton soup. Forget the won ton, just drink the chicken stock. \nIt will cure whatever ails you... I promise.", "author": "Ave M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-06", "description": "When I am craving delicious chicken chow mein or a perfectly hot sweet and sour soup, I will call King Lees for incredibly quick service that fulfills my craving.  Three stars because their rice servings are tiny and they sometimes forget the pepsi I order for my boyfriend.", "author": "Sophie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "This place delivered my stuff in 22mins. I do live right across the street. But I was still impressed. Food is o.k. Prices are excellent.", "author": "William M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-24", "description": "this place is good and cheap. get the tomato beef chow mein. except get it w/ bbq pork.", "author": "m y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "Had a hard time placing my order because the King's English isn't so good  I took this as a sign the food would probably be pretty decent.  Delivery guy showed up in about 20 minutes.  We ordered orange chicken, vegetable chow mien, and hot and sour soup.  All for about $22.  Rice is not included with entrees.  The food was delicious and still very hot by the time it arrived.  Burned my mouth on the soup and had to spit it out on my wife.  I would definitely recommend this place.  Stop hesitating and give the king a call.", "author": "James C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-06", "description": "king lee's is the best chinese delivery in the history of chinese delivery. soo fast, soo good.", "author": "Mickey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-11", "description": "i don't know what happened, but they must have changed cooks or something because the food is not the same anymore.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-06", "description": "worst food i've had in the city, Don't eat here", "author": "Mandy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-06", "description": "king lee's is my go-to chinese joint.  and it's not like there's a monopoly or even a duopoly on the chinese restaurant market.  king lee and his court have won me over.  the food is really tasty and fresh; they even throw in free hot & sour soup and egg rolls with orders over $15 (so giving!, that king lee).  they've got a pretty large menu, including vegetarian and seafood on top of the basics (i dig the spicy garlic chicken w/ eggplant).  the portions are large enough to get two or three meals out of every order.  it's adjacent to safeway so there's tons of parking if you do pick-up.  and everytime i've had delivery it shows up waaay fast.  and to top it all off, i haven't gotten a disappointing fortune cookie yet.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "i miss this place most since moving to west la. i took for granted a chinese place that uses good chicken and lush bok choy in their chow mein. it's so easy to go in and get out that every time i go to san francisco i want to pick up an order, but my wife says it's not special enough to make a trip of it. i completely disagree because every time i have chinese all i can think about is king lee's. the longing eats away at me more and more my wife chooses to eat at another bay area restaurant not king lee's. i sometimes think that the one time she'll say yes is the time that king lee's will no longer be. so i say to anyone lucky enough to be in the city: be and eat well at king lee's.", "author": "kit t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-24", "description": "This used to be our go-to take out place when we lived in Pac Heights.  Located right in the Safeway mall, delivery service was reasonable (about 30 minutes from order to deliver) and the food was basic, but hearty and with huge portions, at very reasonable prices.  Plus, they always threw in a free hot&sour soup (just mention that you have a coupon from their menu)  However, one time, I ordered my favorite eggplant dish, which is covered in a brown sauce.  \"Hmm, what's that little brown spice they put in there...haven't seen that one before!?!\"  My wife is happily munching away.  I look closer.  It has antenna.  Yep, it's a cockroach.  Not wanting to alarm my wife, I calmly note to her that I have some news I need to tell her, but \"don't freak out, o.k.?\"  She looks at me, mid-chew, with some concern.  I tell her about the cockroach, and literally (and I still have this image in my mind, 4 years later), she opens her mouth and immediately starts spitting the contents out on her plate.  Mind you, she wasn't eating the eggplant, but I guess it didn't matter to her.  I chuckle when I think about the image, but needless to say, we have not eaten there since.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "I found this place thanks to great reviews  - and i was not dissapointed! delivery was super-fast 20 minutes, and I couldn't beleive how inexpensive it was, three entrees and an app for $28! and the the best part, the food was really good, probably the best chinese delivery I have had yet in this city!", "author": "Alicia D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-18", "description": "Pork fried rice, not so good.  Chow mien was fine.  I think it could be decent if I ordered better.  i will try again.", "author": "Matthew C."}
