{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Im jewish and i love me some bagels mmm. I cant live without my bagels and also a tip, before the store closes ask if they can donate bagel . I also dont lik the fact they show an ad of a bread and i wanted to try a bread on a sandwich  but dont got any but whatever still good bagels mmm worth every single penny that i pay with  ahaha", "author": "Jamal K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "This place is awful. The customer service is non-existent. The person that takes your order usually also makes your food. Today the guy took one glove off to ring me up but kept the other glove on. Th glove hand grabbed my debit card and he handed it back all greasy. Talk about health code violation. \n\nHalf the time I order a bagel sandwich there is usually one ingredient missing (usually the cream cheese - at a BAGEL shop). How hard could it be to make a four ingredient sandwich correctly?\n\nCorporate needs to train this staff up.", "author": "Munir M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "Awful\nAbsolutely rude staff on Saturday morning; everyone seemed annoyed to be working there. He rolled his eyes when saying they had ran out creamer. \nThe counter was an absolute mess too. \nSigh", "author": "Fran M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "Wow...how lazy can one be in order to give a customer a bagel in this condition? i asked for the bagel to be cut in half and that clearly didn't happen. also this bagel was a mess to eat! And to top it all off the cashier took his sweet time, ugh", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "While the Laurel Village Noah's shop is a staple of the neighborhood for all your bagel and smear needs...the customer service puts a huge downer on this shop. \n\nI frequently patron this Noah's bagels just as a matter of conveinence. I also try to keep my visits as short as possible. The selection of bagels is standard across any Noah's shop, however this one is operated by a disjointed group of employees. I've witnessed arguments in front of customers, eye rolling and overall just a dampened experience from the employees. \n\nHowever, in terms of the goods, my go to is usually an Asiago bagel with locks and plain smear or a hot bagel dog. This location is VERY small, only enough room for a small line and 3 places to sit on a wall countertop. It's not very welcoming to just sit down and enjoy your meal. Grab and go at this spot. \n\nBottom Line: Great bagels and smears, cold customer service.", "author": "Jaime W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "I'm going to give Noah's 4 stars. I have been coming here for a year since I work nearby. I usually come after 11 or around 1, occasionally early mornings around 7:30 but I best to avoid that since there's a lot of people around that time. Yes they should know how to handle it more. The majority of the workers there are nice and rarely a few who tend to have a bad day and don't seem very happy but I mean everyone has those days. They usually have my pretzel bagels which I love and if not they substitute it which is nice with a salt bagel. I've received good food here and good customer service. Only downside is I wish they would open at 6am on Sundays like they say online. I drove by and they weren't open at all, the lights not even on. I can live without a bagel for a day. Overall good staff/service, just have to know the times to go.", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Seriously terrible service and a terribly run place. Out of two of the 3 things I ordered (potato salad and chai tea) and the lox bagel I got had disgusting tomatoes on it (pictured) and maybe 3 capers? Also pictured is the pretty pathetic fruit bowl. Without doubt, we will not be returning.", "author": "Christine J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "Just a lousy branch.  The quality of service is dreadful.  Running out of eggs for sandwiches on a weekend by 1PM and not preparing more?  Come on.  This a a store with a dreadfully lazy and careless staff.  Surprised it has not yet been shuttered..If you are not happy with the service, do let the parent company know:\nhttps://www.einsteinbros.com/feedback", "author": "mandel b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "Do not ever go here.  Just keeps getting worse and worse. Today there is a guy behind the counter yelling at all the customers. His name tag says \"mr Hart\". He is rude, abrasive, and seems mentally ill. Customers were all uncomfortable and looking at each other rolling their eyes.  Some left. \n\nMy easy order of two sesame bagels with cream cheese and tomato has barely any cream cheese and one slice of tomato. I want to bring it back and throw it in their faces.", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "No stars. I have given this location a million tries and unfortunately today was the last straw. It is the closest to my office is why I keep making an effort to support the business. However, on multiple occasion there have been different issues which I try to look past. I always order the same thing. The problem is, I spend my hard earned money there. But not any more. I don't eat there, I pick up my order and walk to my office. Surprise surprise, the order is wrong, again.  \n\n1. First time I ordered Nova Lox, I open my sandwich and there's no meat. No salmon which ok mistake. \n\n2. The two men are always fighting in front of the customers. If you go as frequently as I, you know what I'm talking about. They never see eye to eye and this causes problems with the service and the morning rush is a bust. \n\n3. Last week ordered the same, but literally could not eat due to overwhelming amount of cream cheese, hard center cut of tomato and very large cuts of cucumbers. How could I eat that? \n\n\n4. Today ordered the same. Nova Lox, and this time I even asked if I could have light cream cheese bc. Of last week. The guy didn't even call my name or say what my order was. I asked him if it was mine and he said yes. I took the bag and walked the last few blocks of my commute. When I open my bag, same. Orders wrong again. I received 2 plain bagels with oodles of cream cheese. I'm never going back. \n\n\n\nManagement, please see to it that staff is capable of leaving issues aside that causes poor judgment in serving paying customers. I'm upset, except that I'm not walking all the way back to get my order. Should have been right. Esp when there wasn't a huge line. Just please wake up and make sure it's that you are paying attention. Very upsetting and disappointed. Happy Monday.", "author": "Shahannah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-11", "description": "I don't normally come to this Noah's Bagel. Actually, I don't remember the last time I did. Actually, possibly never. And I don't think I'll be coming back to this location.\n\nFor the most part, I don't really way upon customer service too much. For places like this, I just want to get my goods and leave. But my visit to this location kind of sucked.\n\nI suppose it was clean enough. And the product is as one would expect from any Noah's Bagels. But, everything else about the experience was weird.  Couple of the employees were kind of fighting with each other. The cashier seemed very disengaged. \n\nAnd because of this everything else seems to stand out.  All of the coffee was empty except for the decaf. That means 3 1/2 out of 4 containers for empty. The half and half was empty.\n\nNo, I wasn't going to bother them for more regular coffee. No I wasn't going to bother them for half and half either. I just wanted to get out of there. Which is weird for a Noah's Bagels.\n\nI normally go to the one on Sloat which is okay but a certainly has gotten worse over the years. I remember going to that one when they opened up in the morning and there was a line waiting outside. Which is totally cool but there was only one employee inside because the other two or three who are supposed to be there... they never appeared. The line was at least 12 to 15 people deep. I felt so bad for that girl. But that's a different location and another story. But I'd rather go there than California Street.", "author": "Miguel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "I love their bagels. All is good. Tender in the middle and crispy outside. With jalapeño, with or not egg, cheese or other, it's the rolls Royce of the bagels at Noah's on California street.\nMy fingers fooding it's there ! Bagel potatoes, seeds or cheese or other, all are fresh and very good.", "author": "Marie-Claire L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "Terrible customer service. The guy working there was on his phone instead of helping the line. He didn't seem to give any of his customers a receipt and didn't even bother to ask if we wanted one. No \"hi\" or \"good morning\" or \"how can I help you?\" You could tell he didn't want to be there.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "Sometime I wonder what's the point of placing a order when they mess it up anyway. Next time I'll just say hey!whatever you feel like making me go ahead slap it together and I'll pay for it no problem.... ugh! check your shit before you leave you'll", "author": "JAZZNET T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "This is probably the WORST Noah's Bagels I have ever been to!!!! The workers are so unprofessional and extremely rude to every single person that walks through the front door. On top of that they are always fighting with each other IN FRONT OF CUSTOMERS!!!! They can't even work together. I only go to this place cause their bagels are delicious but today will be the last. \n\nI ordered my bagel and while waiting I saw one worker shove food in his mouth Without gloves on then proceeded to make people's orders. I was sooooo shocked. Then that same guy puts like 3 people's orders in one bag and calls out one name. The guy who went to get his ordered informed him that he only got 1 bagel. This is where it gets good. The guy starts huffing and puffing then DUMPS out the bagels on the counter and gives the guy his bagel then turns around and calls out the other 2 names. Not sure what his problem is. He is so lazy and problematic but yet so are all the staff. The manager needs to get on this and start training a professional group of individuals. In n out hires high school kids that work harder and are way better than the grown adults working here. \n\nI highly suggest getting a bagel at Starbucks down the street instead. I will be finding ways to report this place to the DOH for what that guy did. It is so disgusting and dirty. \n\nIf I could I'd give negative stars.", "author": "Holli K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "Ordered a bagel dog, a sandwhich, a bagel and cream cheese and a specialty spinach and cheese bread thingy. \nThey took FOREVER to make the sandwiches and to top all that off they forgot to give me the spinach cheese bread thing! \nI know I should have checked the entire bag before leaving especially since they forgot to make someone's bagel ahead of me, but I was in a rush and had no time to spare! \nI am very upset! I paid $20 and didn't even get everything I was charged for. \nGoing to find a different location!!!!!", "author": "Darcy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "Management is the problem here.  Waiting in line to buy a box of bagels - 3 workers, 2 preparing food and one taking orders.  The worker taking orders leaves and six of us in line wait several minutes with no one at register.  Tall man (manager?) comes out from hidden rear of store.  Sees 6 in line and no one at register and returns to hidden part of store.  Another female does the same.  Third female comes out doing paperwork and ignores the six of us waiting.  I approach her and tell her we need help.  \"Are people  waiting?\"  She tells me \"I understand.\"  ?????\n\nOf previous #10 reviews, 2 are 2 stars and 8 are one star.  Can management calculate this and address it? Apparently not.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "SLOWEST place in SF--  Do NOT go here unless you have all day free to wait for rude and incompetent workers to waste a lot of your time.  Not only are they waaaay understaffed (2 employees with a line of 20+ customers) but they are also rude and snap at anyone who questions them.  I have been here many times and it's always bad.  Won't go there anymore.  Obviously nobody from mgmt./owner reads these Yelp reviews because I see my experience seems to be the norm at this location!  AVOID AVOID AVOID  (Zero stars)", "author": "Nic P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-13", "description": "There are 4 workers behind the counter, I'm behind some lady with 3 kids and of course they take forever!! Normally it should be ok since there are more workers than customers but not in this case!! I think there must be a contest with the workers to see who can be the slowest worker there!! Are you kidding me??!! Had to wait a good 10 minutes to order! Oh and when it was my turn some old guy tries to cut in just cause he had a little kid with him. It's not so much his fault but the person behind the counter didn't pay attention to who was next. Figures huh?! I wanted the cinnamon bagel and of course they are sold out!! So I waited that long for nothing! They need a sign that tells you what is sold out so customers don't wait for nothing!!\n\nSo between the lousy slow service, NO GREETING, NOT KNOWING WHO IS NEXT and nothing to buy gives them a 1 Star! THIS ONE REALLY SUCKS!!", "author": "Rod W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "This place is an operational disaster with delicious bagels. I keep coming back because my love for pretzel bagels with loads of cream cheese won't fade. \n\nBut at the same time, all the people that work here cannot get it together.  Wrong orders made. Long waits for no reason. Employees just standing and chatting. It's rough. But, love is love and I will take the pain in exchange of a bagel. Call me crazy.", "author": "Alison C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-17", "description": "0 stars, horrible service, worse vibe and the guy that's a bean burrito short of a grande combo is talking to his co workers in the most condescending way possible and belittling them.", "author": "Travis O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "Came here on a Monday morning in November and can only describe the vibe amongst employees as borderline hostile. Employees yelling at each other, publicly shaming one another, just not professional. Nothing wrong with the quality of the food, as it's consistent with all other Noah's bagels I've gone to. Wrote corporate via the website a month ago to tell them about the experience, but no response. Booo!", "author": "Sheila C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "I was so excited to eat Noah's bagels today.  I got a hot Chicken Club sandwich.  When I bit into the sandwich, there was paper in it! The girl making the sandwich left the paper that comes w the cheese.  She also proceeded to only cut the sandwich in half at the bottom and not he top.  Finally the chicken was cold and rubbery, it's supposed to be a hot sandwich.  After waiting in a long line and then another for 15 mins for my sandwich, I'm thoroughly disappointed.  I had to throw away the entire sandwich, it was inedible and disgusting.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-24", "description": "After reading several reviews I am confident in saying the  customer service at this Noah's bagel is so bad that I avoid this place like the plague!  The service is slow and the employees have such bad attitudes and are rude to the customers.", "author": "Joan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "Friday Morning 8 AM.\n\nThese folks have no capability to handle traffic. Orderd a bacon, egg, avocado bagel. Did not receive for 20 minutes. The most skimp ingredients you ever saw, and cold by the time i got back to my desk at work.\n\nI won't be here again.", "author": "Norman R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "I don't know why people are giving this location low star ratings. This location is not a bad location at all. This location is great. This is some what small. This location is in a nice part of San Francisco. I love to get the Super Onion Bagels here. I love them a lot.  The people that work here seem friendly and nice. I am glad to see this location stayed and didn't shout down.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-11", "description": "Went in. Ordered my usual bagel with melted cheddar cheese and avocado. Simple...right?  So one would think. Get to work open my bagel...It's  American cheese with avocado. Thats.just.wrong. who eats that? Anyway. Go back the next day and order my bagel, nicely let them know what happend the day before, tall guy says: \"yeah we were out of cheddar\" uhmm....ok... i asked him why they didn't just tell me that so i could change my order. He responded, annoyed \" WE WERE OUT OF CHEDDAR\"  even the cashier girl looked at him crazy. This place is a disaster. But I'll continue going because I work down the block lol", "author": "Neshama R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-15", "description": "RUDEST staff ever! Theresa was very unapologetic that I had to wait 20 minutes to get their flavored coffee. Literally said 'give me your cup' instead of a 'please' or 'sorry you're having to wait'. There is always some disorganized line during peak hours where you're not sure if you're in the right spot or not to put your order in. Horribly disorganized.", "author": "Kali L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Only had the coffee but it was good. Line was long and service was a little slow but was friendly.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-13", "description": "Location is way too small and they don't have a good (or even decent) system for ordering/paying.  Upon walking in, you'll have no idea what customers have ordered versus what customers are waiting for their bagels.\n\nThat said, the staff is friends which is why I'm going with 2 stars instead of 1.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-14", "description": "The service is friendly but incredibly inefficient. On a Monday morning, they had two people making food and one cashier who also made the drinks. He took our order, then ran around to the other side of the place to make my tea and latte. Meanwhile, the line continued to grow out the door. He turned the steamer on for the latte and ran back to the cash register to take the next order and then returned to make my latte.   The bagel breakfast sandwich took a long time too. We shouldn't have to wait 12 minutes for a quick coffee and bagel. The Asiago Bagel with Bacon Egg and Cheese was very good though. I think the Asiago bagel added a little something. This Noah's needs to be better staffed.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Dear bagels,\n\nCorrection... starting over.\n\nDear GOOD bagels,\n\nIt's been a while and oh how I've missed you. As a whole, your food genre is not perfect. There are plenty of bad bagels while the great or even decent ones surface only from time to time. Perhaps this is why I had mostly given up on you, bagel? Regardless, bagels are inherently good, flawed only by basic recipe deviation and the hands that make them. Well, the good news is that Noah's has some trusty hands, and for that this reviewer is grateful. \n\nYour friend,\n\nBrad B.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "I love Noah's and when I found out about this location I was geeked. Only a few blocks away from my work, I can have my bagel sandwiches whenever I'd like. \n\nUnfortunately the service at this location SUCKS! I went in to order my sandwich and the girl taking my order was facing the back wall making a sandwich. She was trying to take my order with her back towards me. When I told her I couldn't hear her, she turns around with an annoyed look on her face to take my order. I almost walked out just based on the look she gave me. Didn't get her name, but short lady with a bob haircut. Sorry you have to help me by taking my order. This is not the first time I've felt like this at this location. \n\nSorry Noah's in Laurel Heights, your customer service sucks and you've lost a faithful customer. I'll have to go to the CalMart or Beautiful who are just down the street for my lunches.", "author": "Hector L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "Once upon a time, the Laurel Heights Noah's Bagels in SF was staffed with cute hipsters who promptly and courteously managed the line, and delivered delicious bagel-y treats.  The place has since gone down the toilet.  \n\nThe current staff are clearly the bottom of the barrel of the applicant pool, and can't manage the lines or the orders.  The last time I went, after waiting nearly 20 minutes, the employee took my order instead of the little old lady in front of me, who promptly yelled at him, and then me.  The cashier screwed up her order and charged her incorrectly.  The cashier I had kept yelling out someone else's name until I finally asked her if she had my name on the register, to which she stuck her tongue out coyly before finally ringing me up.  I could have walked out with a free bagel.  Not to mention the fact that there is no clear place to stand in line in this location.  You always feel like you're in the way.  What happened here?", "author": "shojua p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-10", "description": "This place gets 3 stars because the staff is super friendly, but only 3 stars because I only get half of what I am paying for.  This place is consistently super skimpy with the topping, whether it's hummus or cream cheese. Today, I ordered and paid for \"extra schmear.\"  Not even passable for a regular bagel, but definitely not \"extra.\"  This is what I got...", "author": "Haley Jo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "I think I'm done with this place!! More and more disappointing everytime!! I wrote out my order and even then they got it wrong!!! UGH!!!! Look people, if you just want a PLAIN bagel not toasted, I mean NOTHING in it, on it, on the side of it, then this place is fine!!", "author": "Lissette T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-06", "description": "Wow, a Noah's Bagels with actual bagels. actual service, and employees that seem to have a good attitude towards the work they do.\n\nMy order was taken fast and I got it in under 2 minutes. Apparently, there is still hope.\n\nNow, if the joke of a Noah's bagel store on Fillmore would take a look at how things are done here, the world would be a better place.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-07", "description": "This review is based on one of the worst customer service experiences I have ever had. My office orders bagels from Noah's twice a month. It is easy and the bagels are pretty good. Our most recent order showed up incomplete. The delivery guy said he'd check in his car and let us know. He never came back. \n\nAfter attempting to contact the store 5 times (only to get a busy dial tone - they don't have infrastructure set up for call forwarding despite being a multi location restaurant business), I resorted to the catering line. After \"talking to the manager\", they promptly told me that I was incorrect and I had in fact received my full order. Huh? I am, shockingly enough, able to count to 13. \n\nIt took another call to catering, another 10 mins on hold, to finally say that they would \"submit a refund request\". However, even this is not a sure thing, in the end its up to the manager who denied fault. I finally got through to the store and of course the manager \"isn't there right now\". Really? Despite the catering person \"talking to a manager\" 5 minutes before? \n\nAn hour of my time wasted, our employees disappointed, and I'm not even sure I'll get a refund. Safe to say this is the last time we order from Noah's.", "author": "Cole J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "This Noah's is awful! The lines are always terrible and the customer service leaves a lot to be desired. Noah's can stand to learn a lot from Starbucks....", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-20", "description": "The bagels are good, but the wait is incredibly long. By the time I got to the register, I had to repeat my order about 4 times. I then waited 10 minutes. (I saw my order on their screen). Both people behind me got their orders before they started making mine. So overall, a very disappointing experience.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "I have been here several times, and I must say, the service is substandard. No matter how slowly I state the order, no matter how many times I make the guy repeat the order back to me, they ALWAYS get my order wrong. Seriously, there has not been a time they have gotten an order right! It's extremely frustrating! I don't usually leave negative reviews, but the service here is really lame.", "author": "Ian O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "I've been going to this Noah's for almost 20 yrs now and in the last few yrs the accuracy of orders has been horrible.  Today 100% of my order was wrong.  I ordered an everything w cream cheese and blueberry w butter.  I got home and realized they gave me a plain bagel w butter and cinnamon raisin w cream cheese.  There was only 1 other customer in Noah's when I placed my order so it wasn't due to being overwhelmed w customers.  I even re confirmed my order on the order screen above the counter after giving it to ensure the order was logged accurately and confirmed that I got my order as they handed me the bag. Sorry Noah's after 20+ years you've lost me as a customer.  I've given you many chances over the last 3 yrs and now I'm done paying for and never getting the order I placed.", "author": "Denise D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "These guys saved the day! I had a potluck to go to and they made me some appetizer sandwiches for this event! I was so impressed cause one guy came back from lunch early to accommodate me! \n\nA very special thank you to the team working! They made everything so easy for me!", "author": "Joie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Great cashier service but horrible at putting together a simple bagel. I order a plain bagel with salmon shmear. I took a bite and wondered why I didn't taste any salmon so I opened it up and there was literally salmon shmear on a QUARTER OF THE BAGEL. Not even half the bagel was covered in the salmon! Literally a quarter of it. So disappointing.", "author": "Kellan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Great location for a Noah's and a Nosh.\n\nThis Noah's is almost an institution in laurel village. It can get busy with all the kiddos and their moms/Nannies, after school kids, and all the hospital folks that work in the vicinity....but that adds to the charm.\n\nI still love their bagels after all these years: chocolate chip, egg, and the works bagel. Even the bagel dog is pretty slamming. Free parking in the back...Oy vey!", "author": "David G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-02", "description": "I come here at least once a week. I mean - who doesn't fancy a Noah's constantly when living in the Bay Area?! Although fresh bagels, they are quite small and a New Yorker may be PO'ed if they got one of these as breakfast. \n\nSo-so service, depending on the day. But today was the day that made me want to review this place. The cashier had gloves on, going back and forth from preparing bagels to the register and while at the register kept constantly rubbing and inching her nose WITH HER GLOVES ON. So so gross. I've also picked out chips here that come with pizza bagels and the chip bags have had mice bites out of them, which I thankfully noticed and was able to tell an employee before bringing them home. Lastly, get something that directs the people in line and tell them where to stand. The line is always a freak show here and no one ever knows where it begins/ends as the position literally changes daily.", "author": "Alexis T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "Everyone here hates their job and it's patently obvious. The staff isn't even attempting politeness. The cashier made fun of the customers to their face in front of me. Had to ask for a bag twice and got an eye roll for my troubles", "author": "paulina k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "So I understand that all businesses get busy but this is beyond ridiculous. I stand in line for 10 minutes put in and pay for my order then get my order 20 minutes later. Not to mention I handed the order to then person taking the order on a peice of paper, so this should have made it easy. Nope all all my orders were wrong, my food was cold. The refrigerator with the sliding doors was empty, the cooler(open refrigerator) was empty, display window was empty. While I was waiting 1 of the food preparers left to take a break or iono??, in the middle of a swamped time for the place, I hear the owner I believe yelling at someone that certain bagels need to go in the window. Lol you have people growing anxious, babies crying, and kids telling they're moms that they're hungry. Omg, this place is in the heart of laurel village and  they should know when rush hour happens!!! C'mon, it used to be the place to go.", "author": "VEGA M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "The lady who prepared my blueberry bagel smeared with plain cream cheese this morning cracked open a bunch of raw eggs into the griddle machine just before handling my food. I watched her the whole time and she didn't change her gloves or washed her hands. I'm going to report it to a local authority and see if there's anything they can do to require that they make amends in their sanitary condition. Also, NY bagels by definition should be quick. Mine took 20 mins to get. Horrible.", "author": "Minna F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "Came during Monday lunch hour, and the line moved slowly. It's small inside, and there were two employees. The service is TERRIBLE. While waiting for my order of a pepperoni pizza bagel to come out, I asked a question about a fruit cup, and the employee preparing orders completely ignored me. She actually made eye contact with me and just chose not to respond in ANY way. The only reason I came here and would come again is because every other place to get food on the block is obscenely overpriced.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "Really really good but today they seemed to notice something was off wth my bagel and took if off the counter after calling my name only to hand it back to me a few seconds later. I got home and they had gotten my order wrong. They clearly knew the mistake and ignored it. Still really good food though.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-09", "description": "Convenience, convenience. \n\nYet another work related convenience situation that left me limited to only but a few places to choose from to get my mid morning breakfast on....Noah's lucked out with my business this day. \n\nI'm not much of a bagel person at all, however, they had some decent breakfast sandwich options that looked somewhat appealing. \n\nI ended up getting a turkey sausage and american cheese bagel sandwich on a whole wheat bagel. I also ordered a medium cup of coffee. Got it to go. \n\nSandwich was just ok. Bagel was pretty bland and reminded me why I don't particularly care for bagels. The sausage patty was average and made me miss real sausage. It was the good ol cheese that came to the rescue and saved everything like cheese typically does with its magical ways. Coffee was also just sub par. \n\nOverall, its a get in get out spot. Service was friendly. Bagel and coffee was just average. The one plus about this location is the 1 hour parking in the back and that they offer a bathroom for customers that was fairly clean.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "Their selection of bagels is always good, but why can't we do something about the flies around everything inside the store?  I'm pretty sure that's not healthy.\n\nI also feel like the staff should be trained more often about their product, and trained with customer service.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Took a stroll this morning before work and the smell of freshly brewed coffee lured me into Noah's bagels.  I'm a bit sensitive to caffeine therefore Noah's hazelnut coffee is perfect for my sensitivity.  It's not too dark not too strong with a fresh aroma of hazelnuts.  I feel like getting my jingle on and start singing some Christmas carols because this happy cup of coffee is Christmas in a cup.  There's always a long line at Noah's but it moves rather quickly.", "author": "Sharon N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "Come here once in a while. Always just a bag of bagels and I'm out the door without much fuss.  When I do order something to order, no huge reportable issues. \n\nYesterday, I told the lady behind the counter that I was going to get the 6 bagel and spread deal.  I said I wanted 2 of each plus the last bacon bagel. Also got 1 plain bagel dog and 1 dog with asiago cheese. Asked for the plain to be heated. I paid and waited for the heated bagel dog. Got that and left. \n\nThe bagel dog was BURNT. it was so burnt I had to rip off half the bagel just to eat the dog. It was burnt before being heated (it was chewy not crispy burnt).  Why would you still save it?\n\nLater that evening, went home to put the bagels away and what did I find?  Only 4 bagels.  Said to myself, check the receipt!  Of course he didn't give me my receipt. Checked my card purchases. I got charged $17.20. Seriously?!?!\n\nOh!!!  As if all that wasn't bad enough. One of the bagels was sliced!!  That's low. Did I get someone's \"I changed my mind\" bagel?", "author": "Angie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "Horrible, horrible wait time. If you want a bagel with shmear, your gonna have to wait up to 20 minutes. I canceled my order, it appears they don't know what they are doing!  Never going back to this location!", "author": "Ig M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "This is not about the food - this is about the people working there. I was recently at this location and had a bag containing a $500 gift inside of it. I was extremely scatterbrained and left my bag at the location. I called the next day and spoke to the staff - they remember seeing my bag, but they didn't do a thing about it. They didn't put it in the lost and found, they just \"figured whoever owned it would come back for it.\" Well, somebody came for it alright - and whoever that person was had a lucky day because they walked off with my gift and a few other of my possessions.  This whole event scarred my holidays this year.  The staff at Noah's Bagels should be fined for negligence, and if they are this irresponsible when it comes to helping their customers then I don't want to know what they are like when preparing food.", "author": "Kat W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-27", "description": "Surprised that this shop has as low of an overall rating... This is typically our go to breakfast stop when we stop by up in SF.  Plenty of tasty bagels to choose from, and the employees offer things like freezer bags, as well as separate the cinnamon sugar bagels to prevent them from getting all your other bagels messy..\n\nWe'll be happy to keep coming back!", "author": "Steve L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "Ordered onion and sesame and when our order came up they had sold our sesame.  After we placed our order, they sold our bagels to other customers.  First world problem, I know.  But still.", "author": "Noah S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-23", "description": "Not great service! Phone calls not great either. Perhaps they are understaffed...don't know but this place needs big time help.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-03", "description": "The slowest service at a bagel shop! They need to hired more people specially in the morning when people are going to work.", "author": "Ty N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-10", "description": "I ordered a Baker's dozen, assorted and split.  I had to wait as they helped two other customers that came after me.\nThey did not split the bagels for me.", "author": "Kenny I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-22", "description": "Stopped in this morning to pickup a Noah's - Bagel's and Smear 'Baker's Dozen -\n(13 fresh-baked bagels & 2 tubs of double-whipped shmear)'.  \n\nSo, I picked up my 2 smear tubs from the refrigerator and proceeded to get in line.  As soon as it was my turn to order a Noah's employee girl behind the counter asked what I wanted to order.  I told her that I would like to order a Bagel's and Smear box (Baker's Dozen) with 8 Asiago Cheese and 5 Cinnamon Raisin Bagels.  She then proceeded to to box up the bagels into the Bagel box and then turned to me again to ask me if I knew how to count.  I asked her what do you mean?  She promptly told me you ordered 8 Asiago Cheese and 5 Cinnamon Raisin bagels correct?  I answered 'yes' and a baker's dozen is 13, correct?  I suppose she heard and  took in what I said with a blank look and asked me again if I counted correctly, which I answered again, 'yes' (Thinking to myself, why are we having a conversation about this topic?).  Hearing a few chuckles behind me I turned to see the other customers in the line behind me smile and shake their heads.  After the Noah's girl finally decided to finish up packing my box I proceeded to the cashier to pay for my Baker's dozen box.  This is a first, my family and I frequent this Noah's branch, being that it's located close to our home and all the employees here have been very cordial with great customer service IQ, until today.\n\nThe experience was interesting none the less, but it wasn't until I opened the box later to count the bagels is where I got a little chuckle.  The Noah's employee girl not only packed my baker's dozen order, but she packed 8 Asiago cheese bagels and 4 Cinnamon raisin bagels.  Wow, I'm speechless...  Noah's Bagels, it's not the fact that I'm missing a bagel or two, anyone can make a mistake and that's not a problem with me at all, but it's the issue of being forced to have an unnecessary discussion with a disgruntled Noah's Bagel employee on how to properly do basic addition.  Hopefully, she was just having a bad day.", "author": "Ton H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "Spent $10 on a pastrami Ruben with a side of cole slaw and a bottle of water. Of course I wasn't expecting anything fancy, but I was looking forward the sauerkraut. After paying and waiting for about 15 minutes, someone called my name and I went up to the counter to pick up my sandwich and slaw. They said they were out of sauerkraut! Did I want cole slaw instead? No, I didn't, because I only order it for the sauerkraut, but what choice did I have? I said ok put the slaw on the sandwich and give me a side of fruit salad. Another ten minutes later it was ready. The sandwich was so soggy it was inedible, and the \"fruit salad\" consisted of three grapes and two brown pineapple chunks. (Yes, brown.) I picked at the pastrami and drank my water, vowing never to try to order a meal at Noah's again. Not worth the $10!", "author": "Concha G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "The woman with the glasses is one of the rudest people I have ever met.  I can't believe they let her behind the register to serve customers.  Even the other employees don't seem to like her.  I saw her get into a disagreement with one of the other people behind the counter helping a young lady over a mistake in an order.  She then halted the register and stopped taking orders because she was unhappy with the young lady and was blaming her for the mistake.  The other employee was handling the situation sufficiently, but Mrs. Glasses was creating an unpleasant situation out of it.", "author": "Eli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Have seen it always there but not until today to stop by after visiting the UCSF Medical Center. Poured a cup of New York coffee to taste a blueberry bagel - it has to be freshly baked and tastiest compared with that from Safeway ($0.79/ea) or from Costco (about $0.50/ea).", "author": "Cz C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-08", "description": "Haven't reviewed before - mostly just read other's reviews. Today, though I am irritated enough to write. First off, love the bagels. The issue this location has is with staff. \nStarted going to this location in 2013 and it had great staff - focussed, thinking, attentive; they were a well oiled machine.  About a year and a half ago that staff started to disappear. They were replaced in volume (6 people struggling to do the job that 3 did without breaking a sweat), but not quality. The new staff were always much more concerned with their last smoke break, next smoke break, how much they wished their smoke break was that moment, how much they needed a smoke break and/or the fact they were out of cigarettes.  As a result of this obsession, the staff rarely got orders correct - presumably because their brains were SO filled with cigarette woes, there was no room to remember to type plain bagel, toasted, with butter. Invariably, I would have to interrupt the cigarette discussion to say; \"no, not an onion bagel - plain, not cream cheese - butter\". I heard many other customers make the same kind of corrections. When at last my order would come out, I would frequently (think one out ever 5 times) discover in my car, or at work; that I had not received what I ordered (completely missing or incorrect).  So, someone else would get my food and I would buy something from a coffee place or whatever was near by.  Very frustrating to have to go back and request what I actually ordered or worse, to be too far away to exchange it and have to pay twice.\nEventually, I decided that I would check the bag before I left to make sure everything was there and/or correct. Often I was buying a half dozen, cream cheese and several individual bagel meals; so my name would be called, the large bag placed on the counter and I would stand there and pull everything out in order to confirm it was correct. I found several items which belonged in someone else's order, and several errors in my orders in general. Plus, the other customers in line were invariably glaring at me. \nFor the last six months or so my orders have been correct much more often (think one error for every 8 visits). So I was not unpacking the bag anymore, and rarely having to buy other food for myself. Progress!! Still regularly seeing someone who appears to be a manager, standing behind an employee reading the orders out to the person making them (not when they're busy) and then correcting the maker when they start to put the wrong topping on a bagel; so perhaps one or two employees have some literacy or cognitive issues?\nToday I ordered the smallest order I have ever made at this location; it only involved two bagels and a drink. When I got home, instead of the bagel sandwich ordered, there was a plain, toasted bagel. I drove back because the bagel was for someone else and had lox (more expensive than my plain butter). When I went in three different people tried to help me (two people I recognized, one I didn't - but got the impression of a new manager). All three employees said one of them had 'run after me', and all three offered me a free item for my trouble. This is the first time anyone has offered this (another reason I felt the new person was a manager). I appreciated the offer, but it's too little, too late. I just wanted to get out of that store before I said something I would regret.\nI will not be going back to this location even though it has the convenience of parking. I would rather hunt for parking on Fillmore and actually get what I ordered 97% to 100% of the time, than deal with employees who either don't want to be there, don't pay attention to/care what they're doing, or don't have proper supervision (for the employees with possible cognitive or literacy issues). My advice to the franchise owner/manager: don't focus on numbers of employees, focus on the quality of employees. At the very least, hire shift supervisors who are on the ball and can motivate people.\n\n*UPDATE* I was craving bagels, so I decided to give this location another chance.  There were two employees behind the counter and including me, three customers. I ORDERED a bagel with egg, cheese and chives. I GOT a bagel with egg, cheese and chive schmear. I don't know if it was the order taker or the maker who made the error (I didn't open the bagel in the store as I thought it would be correct, since the other two customers had left). Anyway, no time to go back so I had an inedible bagel. Currently hoping to see a homeless person while I'm driving.  I am paying twice for my lunch . Oh well, shame on me!", "author": "Heather M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-22", "description": "I would agree with the other reviewers who offered one star here. Ordered a bagel dog. Had it warmed up. The outside was warm. The inside, cold. Bad. I keep expecting things to change at this place and in three visits, over a period of five months, the management cannot seem to hire competent workers. Choose better workers. Improve your business. And TRAIN them. Properly.", "author": "Dennis R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Since I am allergic to wheat, chicken and eggs, I can only get a few items while enjoying the smells.  I used to love their turkey sandwiches, so good!!!   I now get their fruit or juices or lemonades, and find them fresh and so good!  GREAT staff, all of them.  I know particularly Teresa, Rita, German, James and Arjun, and find them hard-working, great with people, practical and good people!!!  GREAT job!!! :-) :-) :-) :-)", "author": "Janet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "I don't know who these people below are dealing with but almost all of the people that work here are very nice, prompt and helpful. My bagel sandwiches and even just bagels and cream cheese almost always turn out perfect here, which is why I prefer this location compared to the one closest to my office downtown.\n\nHere's what I don't get; their RUDE ass customers who think it's okay to come get 2 dozen bagels and expect them to RUSH out their orders. So here's an idea guys, if you ever want to order a whole box or two, why don't you think ahead and get your heads out of your asses and call ahead of time! \n\nI have almost bitchslapped some of the rude ass people that come through here thinking it's okay to treat the employees here like they are stupid. I'm pointing directly at you Ms. Mercedes SUV who has 2 bad ass spoiled kids in the car and is late to dropping them off to your overpriced pre-school or their nanny so that you can make it on time to your mani pedi. This is pretty much the only thing you have to worry about today since, well, you've never worked a day in your life.", "author": "Zoeboe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Came here and got a dozen of goodness on saturday.\nFamous demolished it so here I am back to stock back up.\nThe twists were yummy. My 3 year old demolished two before I could even finish mine. \nI like their bagel dogs...three styles now days.\nLet's see how long before the wipe the begals out this time.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-09", "description": "Obviously the owners of Noah's Bagels do not care at all about their yelp reviews, or this particular location would have been long gone, judging from the poor reviews below. Again, I do feel badly for those who work here as they are all trying to make a living. But, you can be bad at your job, but you can at least be nice about it. This place lacks both customer satisfaction and service. I have been here so many times, as it is the closest and only Noah's near me and most time, I dread coming here. My heart starts to pound and I get a major anxiety attack, thinking about how they are going to mess up my order this time. And they never fail to disappoint. Either someone higher up on the administrative chain has forgotten how to hire competent people for the job or they forgot how to train folks who work there. Either way, the only recourse is for folks to NOT come here so that they get their message and shape up. I, for one, have decided to not partake in any more bagels till this location is 'cured of it's maladies'. Good for me and my waist line.", "author": "J S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-12", "description": "I sometimes treat me and my mom to a special bagel from Noah's. Lately they have become cheap with their cream cheese leaving half a bagel with no cram cheese. My mom got a Swiss and ham bagel, each half had half a slice of cheese and a half a slice of ham. Will not be going to this location again. Very disappointing.", "author": "Tierney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Good service on Thanksgiving morning. Friendly and helpful. It wasn't super busy so that probably helped.  Bagels were delicious", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-20", "description": "Light on top.\n\nExpectations were low for a parfait from one of San Francisco's most pervasive bagel chains. Danon lowfat vanilla yogurt. Few blueberries. Reasonable $2.79 price. All good.\n\nHad they also included about twice as much granola as much came separated out on top we might have been talking another star.\n\nInstead we'll stay light on stars too.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "Worst location I've ever been to. Always understaffed and staff seems like they don't know what they are doing.", "author": "BigArm K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "Was in the area and wanted a quick lunch and was actually pleasantly surprised by the results. \n\n[THE FOOD] 3/5\nFor my lunch, I bought a Lox sandwich because i just love lox. The sandwich was available on any choice of bagel or bread, a feature I really liked. It also came with a choice from a variety of sides such as chips, potato salad, fruit salad, and slaw. I chose the fruit salad. There were a few too many pineapples for my personal taste, but it was still better than the other options so I didn't complain. Also, it comes with a pickle on the side which was a great bonus. The lox was great on one of the bagel thins. It made the sandwich a little smaller and less filling, but i didn't want too much bagel anyway.\n\n[THE VALUE] 4/4\nMy sandwich was about..$7.75? I know it started with a 7. Anyway, that is a lot cheaper than I'm used to seeing lox go for (sometimes i see them at $10-11) but they gave me plenty of salmon, plus my sides all for about $8.00 after tax, so i think that was a pretty great value.\n\n[THE SERVICE] 4/5\nGreat service. Friendly, easy to work with. Although it's not like there was a lot to work with, but everything went smoothly!\n\nOverall, this place was pretty good for me. Usually, i give chains like this a 3/5 just because they're rarely ones to stand out for me, but I will definitely be back if I'm around for lunch, because I'm always in the mood for lox and bagels!", "author": "Cara O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "Never written a review before but I am just too upset and disappointed and really want to share my experience with all the customers out there. The review I am going to write isn't necessary for this particular location, but to the company as a whole. I placed an online catering order for my 5 year old son's birthday party early April. It was scheduled to deliver at 10:00 am but it was not arrived until 11:10 am. It just happened it was a raining day and all my guests and kids were so hungry for breakfast. Finally the delivery guy arrived without knowing the exact location I was at, nor did he apologize. AND he did not even know he was very late. And because he delivered my bagels in a cab, he couldn't help me to carry my bagels and all other stuff to the playground. I had to carry everything myself. Ok, its fine coz as long as my guests could eat. Next day I called the company (1800 number) to complaint and asked for a partial refund and they said a manager would call me back. 3-4 days later no one called me back so I called again and told them refund might not be really necessary but I need an apology or something (maybe I am asking too much). 3-4 days later, still no one called me back. I called again, the person I talked to said my case was resolved and therefore, it was closed. BUT NO!!!!! No one had called me and said anything to me. This is the worst customer service and just service in general. I thought businesses in the US cared so much about customer service. Plus, this was not my fault.", "author": "Kate Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "Now that I think of it... I'm really craving bagels.\n\nI usually get the chocolate chip bagel or the raisin bagels. They are too good! Slightly pricey for each bagel, but well worth it!\n\nI haven't tried the ones where they make them for you, but I should soon!\n\nI need to come here soon.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-03", "description": "Horrible service... the staff is too worried about how to make a bagel then taking orders. Unless no one is in there I would go someone where else.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "I had a turkey sandwich on a sesame seed bagel and loved it.  The bagel was fresh and cooked perfectly.  I like them with a bit of a crunch.  I asked for lettuce, tomato, onion, mayo and mustard.  Service was great and quick!  I miss the Noah's Bagels in the Castro.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "This review is really just for the general atmosphere of the store.\n\nWas in there Saturday at noon, 5-6 people behind the counter, and only 1 person ringing up and taking orders.  Line growing, not moving, and the Noah's is warm and stuffy.\n\nI appreciate the effort to make the bagels, but certainly they could have had another person manning one of the two open cash registers.\n\nOH, by the time I finally got my bagel, it was the wrong kind!  I asked for blueberry, and got sesame.  yes, they look so much alike.\n\nI wouldn't care, except this particular Noah's is always challenged.", "author": "Tobin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Today, my boyfriend and I decided to grab some bagels from Noah's. We had the pleasure of being serviced by what seemed to be the owner/gm of this location! He greeted us with a smile, and perhaps let us try one of the most delicious bagels we have ever had (cheese & bacon MELTED on top of the bagel) we will definitely be visiting this location again soon !!", "author": "Kristen G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-18", "description": "This place still is terrible after all these years. Their bagels are great but please invest in finding cashiers that can operate the register faster!", "author": "Pablo G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-08", "description": "You know the old saying \"when in Rome do as the Romans.\"\n\nWell, here is a tip. When at a bagel spot, order bagels. \n\nI was starving and decided I need to eat if I wanted to make all the sounds coming from my gut go away, so I ordered a turkey club panini. Not nearly as delicious as the photo. Again, I should know better than to eat at a place that shows you photos of the food b/c it NEVER turns out like that. \n\nThe sandwich was greasy, the avocado was really nasty and it was just a bad experience. \n\nNext time i will stick to a bagel and some schmeer.", "author": "Hector G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-21", "description": "A solid Noah's location.  You either do or don't like their generally 'fluffy' style of bagel, and I happen to like it.  I noticed that they now have a 'slimmer' style of bagel for those that are interested, essentially with a mid-section of bread cut out...My personal favorite is the onion bagel with garlic & herb spread, and the asiago bagel (with anything).  I'll be back occasionally for sure.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "The bagels should be firm and hard; the bagels are supposed to be made without the yeast. They are making bread and not bagels. The cinnamon raisin bagels are so soft and fluffy.", "author": "K L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "I work around the neigborhood and I come here on the weekends and I totally can see how crazy this place gets. Some of these customer needs to clam down and wait for your turn. \"You are not the only person in this damn store.\" For having all these crazy customer I think these Noahs worker are handling it very well to try their best to get them in and out right away. \n\nOkay, enough about that...their best sandwich here i think is the breakfast spinach and bacon paninni and the Italian chicken paninni. And I am not a person who likes to eat pumpkin, but their pumpkin bagel with pumpkin cream is soooooooooo good. I crave for this bagel every year in sept/oct! \n\nIn addition I must agree with M.B. comment the bagel is definitely getting smaller and smaller And then the price is going higher and higher...Starting to think that...is a bagel really worth that much money?", "author": "Christy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-01", "description": "Love the bagels but someone needs to come into this location and do some serious process improvements 25 minutes is waaaaaay too long to wait for a regular coffee and plain bagel toasted with schmear. They ran out of all regular coffee so 6 of us had to wait 20 minutes only for them to brew a big vat of vanilla hazelnut. Ick..why would they not just brew regular? Absolute craziness on a week day morning with the Pilates stroller brigade.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-18", "description": "I have been to this shop at least 100 times and I am always amazed at how truly incompetent many of the workers appear to be. How hard is it to create 2 lines - one for people who wish to simply get a few bagels and leave - the other for people who want to peruse the menu and then order a sandwich or toasted bagel? Why so dysfunctional? Sometimes the line is moving so slowly that people leave and walk down the street to the market to buy bagels there. The shop could triple its business if the manager went to NY and took lessons on how to run a bagel shop. The bagels are marginal - pretty much people go here because there is no competition - if a good bagel shop opened in Laurel Village - Noah's would be gone in no time at all. I dream of someone opening a clean - tasty bagel shop some day.", "author": "Ann W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-07", "description": "Eating here is like playing a delicious version of Russian Roulette. Sometimes the service is speedy, the bagels are fresh, and the cream cheese is laid on thick. Other times it takes about 45 minutes to get in and out, the bagels are barely toasted, and there's a teaspoon worth of cream cheese. In the end I have to say more often than not the bagels are sub par and the experience takes forever. I sometimes question the choices they've made for shift leader positions.\n\nAlso, this one time I went in there and there was a homeless guy waiting to use the restroom. He had soiled himself from head to toe, and they didn't seem to want to do anything about it. Lost my appetite that particular time.\n\nThey're kind of the only place nearby, so I guess I'm stuck.", "author": "Will G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-29", "description": "Love the hazelnut flavored coffee.\n\nThey've got plenty of sammiches, but I stick to the basic bagel & schmear, and it's fine.\n\nOnly three or four stools inside, and a bench out front, but I've never seen it too crowded on a weekday.\n\nIf you're trying to use up a Noah's coupon, make sure you print it out on paper, they can't seem to handle them if they're stored on a smartphone.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-29", "description": "Horrible service horrible they don't listin what u order they messed my order up twice I was late to work Becuse of that and wasted $8 for a plain egg sandwich I suggest no one go here", "author": "Ahmad P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-02", "description": "I will NEVER come to this location ever again!!! WORST customer service I have ever experienced in my life. I work across the street at clinic and Erin who use to work there was gem. Always polite, smiling, knew my name & orders. Since this new staff has come along everyone is rude, has an attitude & slow. My order is never correct and when I go back in for the right order, they are rude, have a nasty attitude and NEVER apologize for the mistake. I have had multiple encounters where my order was incorrect and I have to go back, the staff is rude and not helpful. I have an allergy to cinnamon and on two occasions when I ask for MY NORMAL order of plain bagel with honey almond smear they have giving plan with cinnamon. Lucky I notice it before eating the bagel but again NO APOLOGY, AN ONLY ATTITUDE when I inform them my order is incorrect. The new staff is RUDE & HAVE NO CUSTOMER SERVICE SKILLS!! I WILL NOT COME BACK TO THIS LOCATION AND WILL ENCOURAGE MY CO-WORKER TO DO THE SAME!!!", "author": "Syreeta T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "Another lovely place in that shopping street. I Always order half dozen bagels. Their blueberry bagel is always good. And egg sandwiches  are just delicious.", "author": "madeline m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-25", "description": "The bagels are great! But the staff were pretty stupid.... They overcharged me, gave me the wrong bagel, forgot one of my bagels, and made me late. Very disappointed.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "It depends if it's a bagel day or a hotdog day.\n\nIf it's the former, I get the Cinnamon sugar bagel with lite (I dunno why that spelling is like that, but it's really spelled \"light\") cream cheese, costs you about $3.\n\nIf the latter, I get the bagel dog, but that's $4.83.  \n\nIt really just depends.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-27", "description": "Was in the neighborhood and my 5 year old needed to use the restroom. I asked the cute blonde with the short boy hairdo whether my kid could use the restroom and the moron said \"no , it's for customers only\" with a smirk.  I asked you mean to tell me a little kid can't use the bathroom if she must go?   And she answered \"there are other public restrooms\"!   Needless to say I will never be peeing in this establishment again.", "author": "Bunzo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Sometimes you just want to consume a bagel sandwich. If you happen to be at California Pacific Medical Center in the Laurel Heights district, there just isn't many bagel options. Luckily, Noah's has a bagel sandwich shop firmly planted in the LH shopping district. My usual order is salmon lox on a sesame or onion bagel with plain cream cheese and yes to tomato slices, purple onion bits and capers (sometimes). Overall good!!", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "I don't know good bagels. I DO know that the bagels at Noah's are better than those at the supermarket (either the pre-packaged or the ones in the bins with the donuts and muffins), most independent coffee shops that I've tried, and the Noah's-type bagel place I used to frequent when I lived in AZ (Einstein's). \n\nEvery now and the I go to the Noah's by my work in Fremont for lunch, and this past weekend I came to this location on a Saturday afternoon. I got there lox sandwich on a peppercorn bagel with capers, onion, tomato, and plain cream cheese schmear. It was delish! The bagel it was served on tasted fresh and chewy. The fruit salad I got with my sandwich was even pretty decent for pre-cut and packaged fruit salad that you get at most sandwich places (it has pineapple). \n\nMy roommate comes to this location every Saturday and I decided to join him this last time because he was car-less since he had just been in a car accident the night before (I felt bad, and didn't want him to go without his usual Saturday bagel). The manager is funny and nice, and I think this location does a good job of getting orders out in a timely fashion. \n\nWhy no fifth star you ask? Well, I never come to Laurel Hts, and I've always wondered where all the children in SF live. I learned this past Saturday its this neighborhood. Seriously, they infiltrate the entire neighborhood! I've never seen anything like it since moving to SF! Plus, i could have done with a few more capers on my sandwich...", "author": "George A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-20", "description": "Today I went to this location to order a bagel for a late lunch. I ordered a bagel with tomato and cream cheese. After the cashier rang me up I asked the lady making my bagel if I could get salt and pepper on it as well. She told me 'no' because I 'should have told the cashier.' I told her that was ridiculous and I did not even see they had salt and pepper until I was watching my bagel get prepared. \n\nShe said she would make an exception this time and add salt and pepper. Is this woman kidding me? I can see why this person works at a bagel store and would be shocked if they go any farther in life. But I digress. She continued to lecture me that next time I would need to tell them in advance if I wanted salt and pepper on my bagel with tomato and cream cheese. \n\nI told her there would be no next time, that she has a lot to learn about life and left. It's sad that the order processing system at Noahs is such a quagmire of procedures that a simple request for salt and pepper could not be accommodated with a smile. Further, the person I interacted with has no business working with customers.", "author": "Oly O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "I like their bagel dogs here and their blueberry torte or cobbler not sure the exact name for it, it has tons of blueberries in it. it is about the size of a little pizza . the bagels are good especially the onion one. but got to get that cream cheese to go with it !", "author": "Nellie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "I like the idea of Noah's but when I actually get my food, I'm pretty bummed out. Their bagels are pretty tasty at times, but as the day goes by, they progressively get worse. I just got a salt bagel with shmear (1:55pm). I opened it up, the cream cheese was runny like milk and the bagel was a \"sad\" toasted. It was half way between looking toasted but felt like it was still soft= half ass job. \n\nI just took my bagel out of the toaster oven. So basically I paid $3 to redo the job myself. \n\nTheir bagel dogs are good (from what I remember) and their sandwhiches are decent. Lunch time gets crowded and busy.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-30", "description": "Fresh soft chewy Noah's bagels yummm.\n\nLong line + lots of workers = not a looong wait.\n\nThey have really nice workers, even though I'm not a regular. I'm more of a few times a year-er.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-26", "description": "Noah's Bagels is one of the best places for bagels. Their bagels are fresh and if you are looking for something under $10, come on in. Service is very good, friendly team members on duty, prompt service and clean facility.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "I've gone to this Noah's whenever I have a dr's appt.  Service is fast and friendly.  I do have to say with the current economy, they've put in a lot less meat in their panini sandwiches.\n\nThey now sell loaves of bread.  I bought a loaf of potato bread for $3.99.  A bargain considering how much Safeway charges for Wonder Bread :P", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "Come In at least once a week for the usual bagel and cream cheese. The bagels are typically fine, although at times can be too overdone for my liking, but I will live. The reason I have given this location a 1 star is mainly service. I do not exaggerate when I say this, but one of the females employed, is just rude beyond words. I always use my manners, I'm quick and I'm very simple and yet she seems to act like I just ruined her day for no apparent reason. I even had an incident of her basically throwing my change at my with force into my hand. Management needs to address these problems because it is very unwelcoming and uncomfortable to walk into an establish with very unhappy people. By looking at other comments I feel reassured I'm not the only one who feels this way. Hopefully it gets fixed soon.", "author": "M K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-11", "description": "I usually don't write reviews, but this has been the worst customer service experience I have encountered.  \n\nI ordered a Lox sandwich with potato salad and a hazelnut mocha.  A lady working there calls out my order, Lox sandwich.  There was a fruit salad in there instead of the potato salad that I originally ordered.  So I thought I had the wrong order or took someone elses since they don't call by your order number, just the name of the items.  I let her know, I think I have the wrong order.  She looks at me with the rudest stare, \"You ordered a lox sandwich right?!\"  I told her, \"My order had a potato salad in there.  This is a fruit salad.\" She grabs the potato salad and throws in my bag.  I'm still standing there waiting for my coffee.  A minute later, she screams at me, \"WHAT DID YOU ORDER? WHY ARE YOU STILL STANDING THERE?!\" I told her I'm still waiting for my coffee!  She rudely points to another counter and yells to the back asking someone to help her make drinks.  The rest of the employees there were stressed out with the yelling of this lady.\n\nThis is absolutely the worst experience ever.  The lady working there should be fired.  Noah's Bagel has lost me as a customer for good!", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "Love this location! They always have what I want and are quick about it! Pumpkin cream cheese all the way & their iced sugar cookies are amazing! Parking can be limited.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "noah's has sandwiches (7ish), open faced sandwiches on bagel,  bagels, coffees, salads and much much more!\n\nsampling:\n-pastrimi and cheese on open faced sandwich (hot 6.99)\nanything with cheese is bound to taste good and this was no exception. came with tomatoe, some pastrimi that may have been tasteless, maybe some lettuce and cheese..\n-slice of dill pickle (individually wrapped)\nnice and crunchy, fresh and a little sour\n-red potato salad (choice of fruit, potato or macaroni)\nactually not so bad. tasted  homemade but wasn't cuz of the potatoe mushiness. should have added a little black pepper\n*texture of bagel didn't hinder the eating of the sandwich which was surprising to me. sometimes bagels are chewy....not this one. (not saying whether it's authentic or not, just makes a good sandwich.)\ngood value. should note bagel wiches are smaller than regular 'wiches.\n\ncrumbs:\n-very friendly service by this chinese woman (smiling all the time).\n-sandwich a possibility next time , will the 4 stars hold up?\n-noah's blend coffee also a possibility.\n-this shop small but fast execution.\n-little seating, free parking in park.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-13", "description": "This place was so dirty!  Trash on the floor, dirty floors and counters, bathroom so gross I wouldn't use it.", "author": "Rose T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "Yummo. Their thin honey wheat bagel shmeared with smoked salmon cream cheese? Yes Please! Theyre a cute little shop to have a quick bite in. They have a good variety of bagels(of course) and spreads. They also have meal deals as well. Nice staff and good service :D", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-01", "description": "Watch out for the salads!!!  Don't grab one and think that you are eating something healthy.  They also do not keep the nutrition facts easily available- you have to ask to see a binder that they keep behind the counter.  \n\nCity Salad 11.5oz.:  830 calories, 68g fat\nCity Salad w/ chicken 15oz.: 950 calories, 71g fat\nCaesar Salad 10.5oz.: 600 calories, 53g fat\nCaesar Side Salad 4.5oz.: 280 calories, 27g fat\nChicken Caesar Salad 14.0oz.: 720 calories, 54g fat\nMediterranean Salad 13.3oz.: 390 calories, 27g fat\nSouthwestern Salad 15.2oz.: 710 calories, 41g fat\n\nFor lunch, I ordered the Mediterranean Salad because it had the least amount of fat and calories, besides the side salad.  The dressing was tasty; however, half of the salad was rotten- the romaine leaves were pink!!!  I really should have taken this back but I didn't have the time.  I just went hungry.  Also, it comes with a free bagel and I decided to give it to my coworker.  She asked for it with cream cheese and they charged me an extra $1.50!   $1.50 for cream cheese?  WTF.\n\nI do like the Egg Spinach, Bacon Panini, but I will probably only have that once or twice a year since it contains 790 calories and 43g of fat.  That's outrageous for breakfast!!!  \n\nI must say that the front staff is always incredibly nice.  One of the male managers (John? Joe?), on the other hand, is a total loser- he's rude and had no clue about their catering menu.  WOW.", "author": "Teena O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-16", "description": "It doesn't matter if there are 100 people (which is often the case) or 2 in line, the service is ALWAYS absurdly slow, so much so that I'm going to stop coming here. The line is also always confused and people often blatantly cut. Put 45 mins in your meter if you are parking. Shame because this place could be totally fine if they had capable, adequate staff. I finally mentioned it to them nicely and they complained about not enough staff. They also were standing there doing nothing, vacantly staring into space. That didn't help. Also, there were more staff (3+) than customers at that moment! Hah!", "author": "A Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-09", "description": "I ordered Chicken Salad ...they ask me what bagel I want so I said plain then the guy makes it then  he said we are out  of the plain :( that was after I paid so I was force to quickly pick bagel pesto because it was the closes  one next to me, I took it togo when I opened the bag the sandwhich fell apart and I notice they missed my side order :( too tired to walk back so to make this experience short : Make sure everything is in the bag before you leave the store and don't order that chicken sandwhich coz it doesn't taste as good :( but for the price it's ok $6+.", "author": "Kayla S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-08", "description": "The most friendly and silly staff - always make my day and never disappointed. \nMost recent favorites: Pumpkin Muffin (sans the icing) and a cup of soup (the broc & cheese is the yummiest but the turkey chili is filling too) \nLately my fave lunch stop, a soup and bagel for only $3! In the neighborhood, that can't be beat.\n Even when there's a line it's speedy and convenient.", "author": "Mary Ella D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-19", "description": "I have a confession - I don't really get bagels. Aren't they just chewy bread with a hole? My good Yelp buddies like Lizzie G and Laura N have been trying to educate me but I remain to be convinced.\n\nAnyway, when in American, where better place to try out bagels. As it was a morning, I plumped for an upmarket Egg McMuffin - egg & cheese on toasted sesame bagel. Well, it tasted better than an Egg McMuffin, filling and warm but I'm not sure there was anything special about the bread in the bagel.\n\nAnd don't get me started on pretzels!", "author": "Yee Gan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "Today I went to the this location for lunch and I was feeling irritated on the bus muni and ordered Tuna Melt should it was delicious with Potato Chips and a bottle of soda. Although the ordering guy behind the counter suggested Coleslaw or Potato Salad they both contain mayonnaise and I'm not a fan with mayonnaise even though tuna has mayonnaise in it, but Swiss cheese on it and tomatoes but I choose not to put tomatoes on it. In addition tomato on it doesn't taste very good. In addition my little sister works there and I tell her it taste terrible she may poison me. So play nice there.", "author": "Chris Ackord P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-10", "description": "SUPER POOR VALUE FOR MONEY.  I ordered a ham and swiss bagel sandwich and asked them to hold the swiss and put cream cheese instead.  She said there would be a 1.50 charge for the cream cheese.   I said ok but they put about 1 table spoon of cream cheese on the sandwich!  I also ordered an egg bagel with creame cheese.  Half the bites I took of this bagel had no creme cheese flavor....that's how little creme cheese was on it!!!  And for $2.79?  Skip this place and go to House of Bagels down the street!  Their bagels are real NY style bagels and 2x bigger for less money.  Noah's is a racket!", "author": "chauncey h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-07", "description": "Noah's is ok. Not great, but not horrible either. Being that it's one of the only quick service places in the neighborhood, I find myself popping in for a quick bagel or a sandwich. I recently tried one of their salads and it was horrible. Not sure how you can mess up a salad, but they did. I like their bagel thin sandwiches, but a little pricey for the amount of food you get. Overall decent, but like I said, if their were more options around, I probably wouldn't come as often. Also, the manager(?) is kinda creepy...Also, I bought a half gallon of \"fresh squeezed\" oj the other day. Definitely not fresh squeezed, worse than minute maid. What a waste.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-29", "description": "Yes I KNOW Noah's is a money grubbing, private business bankrupting, corporate chain. I also know that it's on the same block as a Starbucks, Walgreens, Pure Beauty and a Baby Gap. But hey, this is Laurel Heights- you want unique and fiercely independent cafes, go back to the Mission. In Glorious Laurel Heights, you're more likely to be struck by a wayward stroller than a fixie bike. \n\nI digress.\n\nI like Noah's. It's my hangover go-to when my wallet is near-empty and my window of sobriety is closing quickly. (Read: I'm broke from a drink-a-thon the night before and I need a quick refuel before starting the process all over again.)\n\nI'm a big fan of the Spinach, Mushroom and Swiss Egg Mit (sandwich) on a Roasted Red Pepper bagel. And in my confused, delusional, morning-after state, I have no problems convincing myself that it's totally healthy. (The veggies cancel out all calories.)\n\nAND unlike a certain independent bagel store *cough cough, see review below if you're on my page* the employees are super friendly. No non-Jew guilt here. And they have bacon.", "author": "Britt W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "Have been a loyal customer here since moving to SF almost 10 years ago.  I hate to say this, but I've watched the service and quality go down in the past year (putting the old bagels in my bag instead of from the oven, forgetting to put things in my order, etc.),...and now it's the last straw.  They have SHRUNK their bagels, which I can only reasonably believe is to save money.  That's a mortal sin!   Why change what works?  Owner of this place needs to get a clue.  I'm done for now, will give them 3 months to improve, or don't need it.  There are others.", "author": "M B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-17", "description": "Ok, honey, I know that it's your job to take orders and ring up customers and it's the really cute boy's job to fix the bagels for people, but instead of just staring into outer space while leaning on the counter with your head in your hands would it be possible for  you move your ass back to the toaster and grab my bagel and slap some cream cheese on it so I can be on my way? No? You just want to stand there and have me wait? Ok, none of my money is going in your tip jar. Bitch. \n\nNoah's Bagels suck. But this one is right on my way to work and early in the morning there isn't much of a line. Don't come on the weekends - it's a total shitshow. But if you do come on the weekends, wear something to freak out the regular crowd - the stroller pushing LuLu Lemon wearing hedge fund husband having Laurel Heights bitches.\n\nPlus one star for the cute young boy with the tattoo - if he were old enough to drink I'd get him drunk and take advantage of him.", "author": "Suge K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "Noah's is WAYYYYY better than House of Bagels on Geary. \n\nWhen I am hungover all I want is A) an egg mit sandwich with tomato and cheese on pumpernickel, or B) chocolate chip bagel toasted with butter\n\nAND if I am really hungover I get both - my god I love them so much sometimes its hard to decide...ya know it's like I don't want the healthy-ish egg sandwich bagel to fee left out just because the oh-so-delicious chocolate bagel is better than...better than...sex?no silly, better than any other bagel.\n\nThis location often has a long ass line - but it usually moves fast. Also, as you should expect, there are lots of strollers and pregnant women here.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "Bagels are pretty consistent. There is not much selection on the menu. Always park in the back parking lot when you come here, don't waste money parking on California street.", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-29", "description": "Is Noah's franchised? because this dump is a fail: Watery coffee, burnt bagel, slow service AND attitude. Step right up!", "author": "Smelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-06", "description": "I've only been to New York once, so I am not a bagel snobber.  I love bagels though, and this is one of the few chains that seems to do their product better than a lot of their independent and mom and pop counterparts.  Honestly for me, bagels are just a vehicle for butter and cream cheese, so no big woop.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "After my frustrating Noah's visit I sent a complaint to their customer service department via their website.  To be honest I did it more for myself as I was not expecting to hear back.  I heard back the following Monday with an email apologizing and letting me know that the issue had  been discussed with the store's General Manager and steps were being taken to improve the quality and hospitality standards at that location.  I was also provided with a certificate for a free bagel sandwich.  In a day and age when many businesses will not even review your complaint, I thought the response I received was pretty above and beyond.  I got exactly what I was looking for (granted it would have been nice if the whole incident had not happened in the first place) and I'll give Noah's another shot...we'll see how it goes.", "author": "Annalise V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-01", "description": "Good service is one of the best things you can ask for. The bagel lady here was the nicest, friendliest face you could ask for in the morning. She brightened my day and promised Pumpkin muffins in a week - who doesn't love someone who can do that for you? the bagels are always clutch here and the prices are always reasonable. Get the pumpkin bagels while they last. I love FALL!\n\nTo the bagel lady that sported the hookup, you are awesome and I'll be back for a muffin! Thanks!!!", "author": "linda t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-04", "description": "Putting a hole in the middle of a dinner role does not make for a good bagel.  \n\n\nOne star for the selection of cream cheeses.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-16", "description": "It's just okay. \n\nI worked for Noah's Bagels for all of 2 days in college in the mid 90's (hey, I needed some extra money). During the training the management went on and on about the \"authenticity\" of their bagels and one guy told me how in his store this old lady from New York came in and started to cry because it reminded her of \"old New York\". Funnily enough on day two of training another guy told me the exact same story, but he worked at a different location. That was my last day. I wonder from time to time if they still tell you that during training.\n\nThe years have past but, they still just make a mediocre bagel that is fine for a quick fix.", "author": "J B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-17", "description": "Part of the excitement of going to Noah's is you're never quite sure what you will receive. Order an egg-mitt, open the bag and discover a bear claw! Sweet, I wanted a bear claw anyway. Not really, but I'm constantly amazed here. What baffles me even more is for the most part the staff is cool and friendly. Maybe its a front. Regardless, when my egg-mitt is right (I'll guess two out of five times) and the Chelsea coffee is fresh, its a great little meal on the run.", "author": "Rob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "Who are you anyways, Noah?\n\n   You, who has just taken away your employee's rights to tips without increasing their hourly wage, cowering at the recent Starbucks class-action ruling, and retaliating with a most unnecessary blow to your entire workforce.  \n\n   You, who turns out some funkdafied hummus.  If I wanted whole garbanzo beans on my bagel, I'd make it at home, not pay you four dollars for it.\n\n   You, who is located in the epicenter of the DPT Militia warzone, a landscape so scarred by the stomping of feet and echoes of expletives, even the most seasoned veterans cringe at it's mention.\n\n   You, who puts blemished fruit in white tea and calls it \"Limited Edition Infusion\".  I know rotten fruit when I see it, and I know you need to get rid of it.  But I'm not buying it. \n\n  None of these things are the fault of your staff, who are fabulous.  Four glowing stars for them, and all my worldly shame just for you, Noah.  You jerk.", "author": "Lea N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-03", "description": "I had a bad experience at this place a month + ago,  just found my receipt and it reminded me. We had a school event early on a Saturday morning, so the afternoon before I went in and ordered and paid for a Grab and Go dozen and the cream cheese  I asked if I should call ahead the next morning and they said  \"You can call but we won't answer the phone\".  I asked if I would need to wait in line and they said \"no, we will put up here\"  (above the counter).  when I arrived the next day about 30 minutes after the place opened, there was a huge line, which I waited in for about 10 minutes and I finally went to the front and showed my receipt. The cashier pointed to a box and said- \"that's it\". Well, it wasn't it!  The box was full of onion and other flavors not requested.   The kids did not eat the onion bagels. What a waste of time and money.  I did try to call the next day and sure enough: \"no one answered\" the phone.", "author": "Meg F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-20", "description": "One star for making a bagel in such a way that i happen to like (chewy)\nthe other four stars are not there for it being unclean , no soy milk for the latte,,they couldn't break my large bill , the general low moral and that the bageldog costs $4.55  tsk tsk\n\nBeing in there reminded me of visiting my former communist Czechoslovakia. One would think that for the Marina they could spiffy things up a bit.", "author": "Barb L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-08", "description": "I recently used Noah's for breakfast catering for meetings.  I ordered bagels, pastries, and coffee for three mornings.\n\nThe first morning the bagels were not sliced.  I specifically asked for sliced bagels, and it was even on their order form!  But nothing was sliced.  I let my catering contact know.\n\nSecond morning the bagels were sliced.  The delivery guy dropped them off and ran out the door.  There were no schmears!  I had to call my catering contact and wait 30 minutes before someone delivered schmears (and they only brought two kinds).  I was never given a receipt for my order, nor was I asked to sign anything since it was on my credit card.  I had to ask my catering contact to send me something.\n\nComplaints started coming in about the coffee.  It was weak and watered down.  It looked like tea!  Again, I let my catering contact at Noah's know.  He assured me it wouldn't happen again.\n\nThird day the majority if the bagels were sliced.  There were schmears.  The coffee was strong enough.  However, there was no receipt.  Again, they didn't have anything for me to sign or even to use for my expense report!  I had to contact me catering contact to get things fixed.\n\nAnd what did Noah's do to try and keep us as a customer?  Nothing.  No discount.  No coupons.  We paid for inferior service.  For things to go wrong three days in a row, you'd think they'd want to do something to make up for their mistakes in hopes of keeping us as a customer.\n\nWe will be ordering from another business next time we need breakfast for meetings.", "author": "Keith P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-18", "description": "Noah's bagels has always been my favorite bagel joint. I love to get them fresh in the morning, and usually have a sesame or asiago cheese bagel with plain shmeer, cucumbers and lettuce, or just smoked salmon shmeer. I'm not typically a morning person but on those few rare occasions I'll grab a bagel from here with a smoothie from jamba juice for breakfast *yumo*.", "author": "Petra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-08", "description": "Eh, this place is just OK. Sure, I'll eat here if one of my friends (Ali) prefers this place over another bagel joint but definitely not my first, or second choice, for that matter.\n\nI'm a butter whore and they never put enough butter. Ever. Sometimes it doesn't even taste like there's any butter at all. Oh wait...that's because they only buttered one side of my bagel. Yes folks, it's true. They put butter on one side and then slap the other side on top and cut it in half. Dry, toasted bagels just are not appetizing.\n\nSo, now I have to specifically ask them to please butter both sides and they probably think I'm a freak but I don't care. And I don't tend to ask for extra butter because then it's like completely drenched and it just feels wrong. \n\nAnd I hate their blueberry bagels. I can't put my finger on the reason why exactly but I just don't like them. I've had a million way better blueberry bagels than at Noah's.\n\nNoah's is kind of like a Baja Fresh or something. It's not the best you've tasted and you know there's better and more authentic alternatives, but you'll take it in a pinch.", "author": "Kristin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-23", "description": "If it weren't for Lox, I wouldn't step foot in Noahs.  A message to the 15 year olds working there this summer:\r\n\"I know you close in 15 minutes.  Stop rolling your eyes, circle what I want on your little order pad, give me my $6 bagel and pickle, and can the attitude you minimum wage earnin' twerp.\"", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-07", "description": "Dear Noah's,\n\nCould you make a simple bagel more poorly? I ordered one with cream cheese (sorry, schmear), tomato and avocado. The schmear was so light that it was like melted butter, and the avocado was 2 teaspoons of guacamole spread. I paid almost a dollar more for this? Aren't fresh avocados available in California? I can only imagine what I would have gotten if I asked for their \"light\" version.\n\nThe one star is for your friendly staff. Otherwise, thanks for a bad, expensive breakfast.", "author": "H N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-10", "description": "Great selection of bagels. Love their breakfast bagels with egg, cheese, butter and chives. Their muffins are some of the best i've ever had. Wish they served iced coffee drinks.", "author": "Anne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "I've been getting lunch at Noah's bagel ever since I started working at Goodbyes Consignment Shop on May 2007. It's the cheapest place to get lunch in the Laurel Village. I love the Asiago bagels with cream cheese and chicken :)", "author": "CeeCee M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-26", "description": "I feel like Noah's Bagels are the Walgreen's of bagel shops; they are everywhere in this city and more tolerated than loved. I come to this location every so often for my lunch breaks and I'm always just a little disappointed. Everything is just kind of below average. The coffee is drinkable, but not enjoyable. The bagels themselves are pretty good, but the bagel sandwiches are not. I usually end up getting the bacon and cheese egg sandwich and everything except the bagel tastes like it could have come from McDonald's. My suggestion is to stick to the bagels and cream cheese and you'll have no idea that it's actually a pretty terrible place.", "author": "Jeremy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "Seeing as Noah's is one of the few bagel places that are reliably good I come here often. I like getting some sort of cheese bagel with cream cheese, tomatoes, cucumber, salt and pepper and cut in half. \n\nAt this Noah's you have to ask them to cut it in half. It's hard to eat and drive when they aren't cut in half. \n\nAt this Noah's you have to check to see if you got the core of the tomato. YUCK!!!!!!!!! I DESPISE TOMATO CORES IN MY BAGEL. How gross is it to be enjoy your delicious bagel and suddenly bite into a tomato core. The other Noah's core them, can Noah not afford the time or the money on making their employees core their tomatoes? I have contemplated writing them numerous times to complain about this. \n\nAlso... this is Laurel Village, so be prepared to be accosted by 30 year old skinny new moms in athletic gear with a double stroller. This is the Rodeo Dr. of young moms. So if fresh MILFs are your thing... hang out here. Sometimes I have this urge to wear an empire shirt and a pillow in my jeans and hang out here. Just to see what happens. Instead I'll just keep eating bagels and I won't need the pillow. \n\nParking tip: Free on Sundays in the meters but the back always has spaces and if you park by the Book sign you can walk right out to Noah's through the tunnel. \n\nNo credit card minimum. A definite plus!", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-14", "description": "Four stars for their bagel selection in the morning and their salmon cream cheese spread.  I've only been able to make it there before 2 PM once, so there were many bagels to choose from.  After that, selection is very limited.  I buy them by the half dozen and slice them and freeze them.\n\nTheir cream cheese spread is really good.  I used to buy Philadelphia brand at the supermarkets, but now I get them at Noah's and am taken with the salmon cream cheese, especially.", "author": "Mrs F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-25", "description": "PANINI REVIEW.  panini only.  nO BAGEL REVIEW. JUST THE PANINI.\nTuna. Hot. Cheese. Spicy. Sweet. Sour. Crunchy. Hot. Fresh. Mayo. Gooey. Hot and crunchy. happy happy happy\nF A N T A S T I C.\n\nand of course, lines suck, service is somewhat mediocre, too crowded, not really good bagels, BUT THE PANINININININII!", "author": "Nini M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-04", "description": "Bread with a hole in it does not a bagel make.  Even if you season it well.", "author": "Indigo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-22", "description": "My coworker/chauffeur and I are in this place at least 3 times a week. They're quite stingy with the cream cheese, the bagels, if uneaten in 30 seconds of getting it, seem untoasted almost soggy, and the staff sometimes has off days when it comes to being nice. \n\nOther than that, I do love their coffee and I do crave their soggy bagels. Especially, Asiago with strawberry cream cheese....mmmm.\n\nUPDATE: 8/5 \n \n1st: They received a 75 on their Inspection Score Card... DISGUSTING! I've seen hole-in-the-wall Chinese food restaurants with better scores than that!!\n \n2nd: They were out of small coffee cups. I wanted a small but because they only had large cups I had to be charged for a large. What the fuck is that about? I doubt Noah's will go out of business for the 10 cents of extra coffee I might get in my large cup. \n\n3rd: They were out of strawberry cream cheese. Go to one of the other 6 Noah's in the city and take some. I've worked for food chains before, you can do this. \n\n4th: They were out of Hazelnut coffee. \n\nThis business sells three basic things: coffee, bagels, and cream cheese. \n\nI believe I have stepped into this Noah's for the last time.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "Great noah's. A little bit smaller than other locations so not really a sit down and eat your bagel or breakfast or lunch. They have a few window counter top seats. Sometimes it's a little crowded when the line has to wrap around in the middle haha.\n\nThey work quickly and are friendly here.", "author": "upper d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-18", "description": "PLEASE HIRE MORE PEOPLE!!!!!!  I know that they are the only bagel place in the neighborhood.  Hence, they have a lock on the market.  Rare is the time that I go to get a bagel.  I left that habit behind 15lbs ago and in college.  But, if I do opt to have one, all I ask is that I am given what I ordered and paid for.  The scene.  Saturday am, 11ish.  Monster line!!  I am standing there w/ my college roomie who is in town, she is a bagel freak.  I step up, and say, Extra toasted onion bagel w/ cucumber, tomato and cream cheese.  Great thanks, Nicole pay at the end.  AH, painless right?  Wrong.  I got half the order.  10 mins later, \"Nicole!!!\"  \nAs I open my wee pkg w/ anticipation.... Gasp, not toasted everything bagel w/ tomato.  What gives?  Am I asking for to much?  Mind you I was already in the car as this all happened, to late to go back for a fix up job....\n\nPS- also change the lay out of the store, it is so cramped and does not flow at ALL!!!  Their spacial designer sucks!!", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "I love Noah's bagels.  They are delicious.  All I need is a blueberry bagel with cream cheese on the side and I'm happy!  Yum!\n\nI have been craving bagels.  Not just any bagels.  Noah's bagels.  They are so yummy I even had a dream about Noah's bagels.  Must get me some today!", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-11-06", "description": "Had Noah taken a supply of these leaden bagels on board the ark, it never would have stayed afloat.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-29", "description": "Somehow got hooked on the Asiago Bagel Dog. Haven't had a bagel from here in a million years. Just tried a Blackberry Lemonade today, that was good. This, the end of my fragmentary sentences.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-08", "description": "it was \" in\" for a while\r\nbut I like New York style better.\r\nNoah's are too sponge-like.\r\nAfter chewing a bit, I feel like I am becoming a dog.\r\nkind of boring to chew.\r\nI think it is same difference between New York Pizza and Chicago pizza.\r\nI do like New York pizza better.\r\nBut I have never been to New york and Chicago.\r\nSo, what do I know?\r\nwell, at least I am honest.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "Either I was too hungry or lucky, but I actually had a more than decent Italian Chicken Panini there for lunch. Tasty, perfectly prepared and with great ingredients. Big change from the fake Paninis with disappointing breads I had several time in other San Francisco places.\nI might get disappointed but I will get there again! :)", "author": "Cedrick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-22", "description": "This location is always packed with loud little kids. Servers are friendly and the line moves pretty quickly.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "Turkey sausage egg mitt on a sundried tomato bagel no chives please!", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "Good bagel joint. Quick service and they always have most bagels available even when it is later in the afternoon.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "I prefer this bagel place over Posh or any other in the city I've tried so far. Get the asiago bagel with veggie spread. You won't need to eat for the rest of the day. Mmmmmm carbs.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-18", "description": "What can I say. Their bagels are pretty good (Sun dried tomato, Asiago cheese) but the GOURMET BAGELS are a little piece of heaven, namely the 6 Cheese and the Pesto cheese. WOW. The best shmears are Garlic Chive and Sun Dried Tomato. NICE. Pumpernickel bagel is good, too.", "author": "O K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-03", "description": "I've been going to Noah's since my Berkeley High days in the early 90's.  I have always thought the bagels were the BEST. This particular Noah's on California St always turns out the coldest and most rubbery bagels. PLEASE fix your toasters so it actually toasts the bagels.......the last 10 times (I know i should move on by now)I've gotten a cold, partially toasted bagel with either gobs of cream cheese or a glob of butter on one side. The only way I'll have a Noah's now is if I just buy it and toast it myself.", "author": "Mighty D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "It's fall and the yummy pumpkin-related foods are arriving!  The pumpkin bagels at Noah's rock, as does the service at this store.\n\nUnfortunately, I didn't catch her name, but the nice woman who rang us up not only shared our enthusiasm for all things pumpkin, but also gave us two free bagels!!  Nothing bad happened - this wasn't an attempt to smooth things over with a disgruntled customer.  We just chatted with her while she rang up our order.  Afterwards, I looked at my receipt and noticed I hadn't gotten charged for one of my bagels.  When I went back up and told her, she said \"yeah, I know.\" (wink, wink)\n\nSO NICE!!!  I didn't even notice that she gave us TWO free bagels with our order until I got home.  Many thanks to the nice pumpkin bagel lady at Noah's.  You made what had been a horrible morning so much better!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-04", "description": "All Noah's bagels taste the same - super average, but that's what we have here in San Francisco. On that scale, I'd say this is a solid location. Service is reasonably efficient, they generally get my order right, and it's right in Laurel Village with a bunch of other chain establishments I can shamelessly take advantage of.", "author": "Kiesha R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-24", "description": "Their bagels are too fluffy, they never toast them enough, and they use whipped cream cheese.  All of this adds up to a sucky bagel.  Sometimes I eat here because I am right there and I forget how bad their bagels suck.  After one bite I remember their suckiness and wish that I went to House of Bagels instead.", "author": "Jake A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-10", "description": "I hadn't heard of Noah's until I move to SF, but apparently it is a good-sized chain.  Despite this fact, their bagels were pretty darn good and I easily enjoyed them.  If I can afford it, I prefer to go to House of Bagels on Geary, but when I am tight for money, I know I can get a tasty bagel here.", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-06", "description": "I give this location 5 stars because the guy with the ponytail, whom I am assuming is the owner/manager always gives everyone service with a smile while he is seriously multi-tasking!   I like how efficient it is in here compared with other establishments of this class.  I luv the bagel dogs!!", "author": "Sue U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-04", "description": "these are the best bagels in the city.  they are soft and fresh and delicious.  the shop itself leaves something to be desired but get a sesame bagel with plain cream cheese and lox and you'll be a happy camper.  all the other places in the city have pretty bad bagels- posh, katz, house of bagels- not good!", "author": "Mick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-24", "description": "I like Noah's for bagels in the Laurel Heights area. Service tends to be friendly and very decent. I like how fresh their bagels are and the variety of toppings. Parking can be a hassle if the area is busy. You might have more luck finding a spot on the rear side of the shops. A lot of the shops in the area have changed over the years but this place is still there.", "author": "Al B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-19", "description": "I usually like noah's bagel but it must be this location that I am not so in love with.People in this area are a bit loaded so they have a buch of kids come through here in the afternoon and they can be really loud and rude.Don't get me wrong ,I have nothing against these kids but they seem to have no manner at all.Not sure where their parents are and the people that work here never seem to want to say anything to them.People that work here seem to be real young too.Not only that they look so miserable and I can't wait that long for the snail service that they have here.The other location on fillmore are a lot nicer and they don't tolerate rich kids with loud mouth and attitude.", "author": "S F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-09", "description": "It happens everytime -- sticker shock. I forget how pricey it is, but then I take a bite into the egg/spinach/bacon panini and don't care. Really. It's so effing good. I wish this place had better seating -- there's three stools in the corner, that's about it. We went last weekend and decided to brave the cold outside and sit with my dog, who was having a barking hissyfit. Still, I love that damn panini for $8.", "author": "H H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-31", "description": "I will admit that I hit this place up often because I am a bagel lover!  Noah's makes the best bagels in the city, but they aren't always stocked full with my favorite.. the everything bagel.  I order the basic turkey sandwich but everytime, it is just the same and just the way I like it.  Its great to have bagels in the house so ordering half a dozen is cheap and easy.  This place is good but boring, I reccommend branching out in the city even though I just can't give it up.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-10", "description": "I only go here when I'm hungry and in Laurel heights, where I sometimes end up to grab some Peet's after one of my favorite running loops.  Every time I go, however, I wish I lived (or ran) closer to House of Bagels.  Noah's has gotten my order wrong several times (PUMPKIN not PUMPERNICKEL, please!) and their service is friendly but incredibly slow, even for a simple toasted bagel.  Not to mention the store is too tiny for everyone in line, everyone waiting for their slow-ass bagel sandwiches, and all their strollers, too.", "author": "Laura T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-31", "description": "what can i say? i love bagels no matter where they're from.\n\ni love how noah's bagels are fluffy, but sometimes are too chewy. and i do like whipped cream cheeses. sometimes, i get lunch here and usually get the tuna salad sandwich on marble rye. sandwiches are not bad. you can't go wrong with the swiss, spinach and mushroom egg-mit. toasted. with butter, pepper and chives.", "author": "Rosalee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "Ohhhhh. The Asiago bagel with Sun-dried Tomato cream cheese...  That's whats up.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "this is one place that is sure to put a smile on my face! living in Hawaii made me appreciate beagle shops especially Noahs (i can only think of 1 beagle shop on HI and its in boonville). There is nothing as good in the morning when you are hungry and on the go then getting the egg and cheddar on a toasted sesame beagle... oh its good ;) and the best part about this location is that its right next to Starbucks so you can get both guilty pleasures quick and easy.. mmmm", "author": "Barbara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "Just discovered the egg and turkey bagel at noahs! I am addicted. Only downside the serving of milk is a bit small for the price.", "author": "Russ R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-05", "description": "I don't go to Noah's bagels for authentic bagels.  I don't think I've ever even had a real New York bagel, so I'd be doing fine with my fake bagels if it weren't such a pain to actually get one at this location.  Every time I come in its always a nightmare.  There was a fire in the toaster today.  I know because I was there, and I saw it.  Don't think you're just going to dash in and grab some quick breakfast.  Depending on how many people are there its about ten minutes.  That's a pretty long time since the toaster toasts it in, like, 10 seconds.  But I do like their bagel variety.  I'm glad to see chocolate chip is still around.  Back in the day Noah's used to sell chocolate babka, which was like chocolate challah bread, sort of.  The guy working there didn't even get what I was saying when I inquired about it at this location, which leads me to believe Noah's is no longer a proprietor of chocolate babka.  I don't know why, but I was surprised when I first learned they didn't have Noah's in New York City.  They have all that (fake) New York stuff in there, and what do I know, I grew up in San Francisco.", "author": "Emily X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-02", "description": "this place is awesome! i just like their bagels with peanut butter, or cream cheese it is delicious! (i dont usually order any special things like egg mits or panini's.)", "author": "neil r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-21", "description": "well ..... the staff are friendly and are super busy majority at the time. some service can be your worst but they also have their best moments... sandwiches are okay.. but bagel and cream chesse is good any time anyday! nothing unexpected...", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-01", "description": "This is the Noah's EVER.  The staff is rude and customer service is horrible!!!!   Save your self some aggrevation and go somewhere else, even if its farther away.  All of the employees are angry and rude!!", "author": "Michael F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-25", "description": "First of all, all \"Noah's\" are not created equal. I used to LOVE the Noah's Bagels in Washington DC on Wisconsin Ave in Georgetown. The ones in the Potrero Center and on Fillmore (in SF) were pretty good (4 stars - will write separate review). But, the Noah's Bagels in Laurel Village was really disappointing. I adore their chicken salad on a bagel, but it seems they changed the formula recently. It's no longer large, juicy pieces of white meat chicken in a delicious sauce. It's now small, chunky bits of meat (white?dark?) in a mayonnaise-y sauce. I got the Asiago Bagel w/ Chicken Salad today, and there were (seriously) 3 tiny pieces of chicken slathered in mediocre mayonaise on each half, covered with a massive and wilty piece of lettuce. It tasted alright, probably bc I was stahvin' and had just spent the past 3 hours at the Toyota dealership. Anyhow, it was a far cry from the juicy and luscious sandwich I used to get at Noah's in Georgetown. I didn't complain, but I prob won't be going to this Noah's again. I'll stick to Potrero or Fillmore.", "author": "Maren P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-24", "description": "RUDE RUDE RUDE, and outright foolish.  OK, so I don't carry cash -- it's not my fault that this joint doesn't make you sign when you pay via credit card, and since this is the case, there is no space to leave a tip.  I honestly think the people working here have put my name on their blacklist.  OK -- so I have been going to this particular noah's bagel for about 1 whole year, 2-4 times a week!  so the people working here DEFINATELY know me, my name and my face.  AND they know that I never tip -- because like i said before -- i never carry cash, only plastic, and they don't give me the option to tip with plastic, so i figure it's not my choice or fault.  well -- after todays' experience, i am never going back there again -- i will try House of Bagels instead (they did indeed bake our wedding challah, and it was yummy).  so let me tell you what happened today.  well for the 3rd time they gave me veggie or lox schmear instead of sundried tomato scmear, which i specifically requested on my bagel.  the first time this happened, i was in the car already, and it was gross that they would put slamon lox schmear on an everything bagel veg-out (yuck!), too bad i was starving, pregnant, and in a hurry to get to my massage at mindful body, tat i just had to gobble it down.  the 2nd time this happened, they put veggie schmear on my everything bagel veg-out instead of sun-dried tomato, this time i specifically requested no onions, and i had to eat that too because again i was aleady in the car on my way to another massage, the poor masseuse had to smell my onion breathe the whole hour.  so, today, and the 3rd time this happened, i actually checked my bagel before i got into my car, and lo and behold, again it had the wrong schmear, i mean these pople should know me by now -- i order the same thing every time (2-4 times a week), i order a veg-out on an everything bagel with sun-dried tomato schmear -- you would think they would have figured it out by now.  that's not all -- when i brought my bagel back today -- they guy actually told me that he put veggie schmear instead of sun-dried tomato schmear.  AND after i ordered, i hear my name whispered 3 times to the different people behind the counter -- as though to say, yep this is the gal who's bagel we usually screw up on purpose because she doesn't ever tip us.  ALSO,  they have repeatedly forgotten my pickle, once i actually ate in the store, and brought it up, and they were very rude about giving it to me -- as if.....and if i recall correctly the bagel mishap happened not 3 but 4 times -- so i've had it -- i will not give them my $$$ anymore, they are crap anyway, the only reason why i went there was because it was close to my prenatal yoga at the JCCSF up the street.  i wish i remembered the crew people's names, so i could name them here -- but trust me when i tell you that numerous people have screwed up my bagel -- it's like they really did mark my name up.  so beware this place -- the bagels suck, the customer service sucks, and they hold a vendetta and a grudge just because you pay via credit card.  would not recommend.", "author": "Jordan F."}
