{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Delicious sandwiches, good assortment of drinks and desserts.  Friendly service, and nice interior with variety of seating options.  Don't miss the seats upstairs.\n\nYes, shut the door after you enter and exit!  It does get cold, especially for folks seated near the door.  Note: women are much better at closing the door when they leave. Anecdotal evidence.", "author": "Cathy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "Quaint little coffee shop. I only had the coffee, no food. Coffee was good and they do have free WiFi so you can get some work done. No complaints there. \n\nMy knock on this place is the door. I know that seems stupid but it doesn't close unless you actively push it shut or someone opens the door so far wide open that it gets enough momentum to close on its own. After sitting here for a while, the door closed about 50% of the time. \n\nWhy is this important? Because on days when it's cold outside (like right now), I don't want to be sitting inside freezing because the door doesn't close! \n\nI feel like that's a simple fix for a place like this so hopefully this changes soon.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "Great place to grab a bite and study! Everything is very reasonably priced and tasty. Staff is always friendly.", "author": "k k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "No nonsense café. Great value. Upstairs area is quiet and spacious.", "author": "Dawn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Sweetest women who work there, favorite spot in my neighborhood that doesn't feel overrun by hipsters... and the prices reflect that", "author": "Hannah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "I have been there just once. I ordered Bagel with veggies and it was nice.\nGood and quiet place to it sit.", "author": "Megha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-28", "description": "Do NOT get the breakfast sandwich. It's a dry bagel with microwaved eggs. Mine was so salty that I gave it back and left.", "author": "Nivi O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-01", "description": "Coffee was good. Sandwich was just ok. Staff weren't very nice or personable. They seemed irritated and annoyed that paying customers were coming in to get food and coffee. Body language from the main chaser was inexplicably negative and unwelcoming. I tried killing her with kindness but she wasn't having it. I also observed her serve a few other customers and her tone didn't change at all. I honestly just wanted to order and get out of there because they were so impersonal to EVERYONE. And to think I went there over Peet's across the street because I wanted to support small SF business. I guess I'll get go there instead next time I'm at the DMV.", "author": "Carl N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "What a GREAT little café joint located near the Haight across the street from Peets Coffee and DMV. OakSide Cafe is located on the corner of Oak and Broderick (one block west of Divisadero). This clean and casually arty cafe plays host to groovy hipsters, day laborers, and middle aged travelers, among others. \n\nThere are plenty of places in the Lower Haight to break your fast, but some places may also help break your wallet. For those travelers who might be a little cash-conscious after a few days in spend-easy free-wheeling San Francisco, visiting here is a breakfast blessing. \n\nI came here on my way to work and was greeted by a lovely worker. I noticed that once I entered there was an upstairs gallery, where you can sit and look down on the little people while enjoying your coffee if that's your thing. There is also a computer on the lower floor that customers are able to use and not to mention they also have WiFi! **Free**\n\nOakSide has bagels from $1.29 to $3.95; those at the higher end can contain scrambled egg plus bacon, ham or sausage and your choice of cheese, too. Top it off with a good cup of fresh brewed coffee or tea and you're good to go. I'm technically NOT a coffee drinker so I wouldn't be able to give any feedback on how that taste but it smells like coffee once entering this place. \n\nLunchtime specialty sandwiches run from $5.75 to $6.95, but the best deal of all might be the $4.95 lunch time special which is composed of a sandwich and a complimentary drink (11:30 - 1:30).\n\nThese prices compare very favorably to other nearby eating spots.\n\nThe decor is bright and the place is lined with original art for sale or on permanent display. Other amenities include a computer with Internet ($1 for ten minutes), a selection of free local papers, and a curio cabinet offering interesting bric-a-brac, curiosities and those free advertising postcards which often make nice souvenirs. \n\nOverall, good place to come in the morning if you are looking for a good place to eat and clear your mind. All the times that I have come here it never seems to get busy so long lines are not a big thing here.", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Got my order wrong. Service was not very friendly. Food and coffee was delicious. Price reasonable for the city.", "author": "L J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "This place is a cute little eclectic cafe. We came here for a quick breakfast and coffee. They have pastries, bagels, and sandwiches. I would probably give their coffee 3 stars for quality, if you're a coffee snob. But I'm not super picky about coffee so it was good enough for me. They also have free WiFi, so it's a good place to hang out and bring your laptop.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "The sole remaining example of kind of cafe this neighborhood used to have untold riches of. Homey, comfortable, inexpensive, decent food. I wish they were open in the evenings.", "author": "David K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Some reviewers have already pointed it out - the Asian lady who works here is incredibly rude to some people(mostly minorities I am assuming). She was overworked, I can understand that but if you cannot handle that don't be in customer service. She seemed to respond quite politely to my fellow patrons(who were mostly white) but I was ignored initially, yelled at for asking how to use the scanner and I finally left. I am obviously helpless, the least thing I could do is write a 1 star yelp review I guess(not that it makes any difference)...", "author": "Ravi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Nice, relaxing sweet little cafe right at the end of the panhandle across the street from dmv. And the best part - a block away from where I live! Coffee, pastries, sandwiches and goodies. Computer for public use, plenty of seating and friendly staff. I'm a morning person (like 5 am) they are not open that early but it's nice to have a place near my home that is open earlier than most. The Haight takes a while to wake up sometimes LOL", "author": "Desiree K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "Decent coffee and bagel! Not too expensive, and hit the spot!", "author": "Aditi D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "Bad coffee, not friendly service, below average breakfast sandwich. The only thing I liked about this place was free wifi. I will not go back unless I am so hungry and there is no other place open.", "author": "Joanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Quiet, cute cafe \nThey have matcha smoothies! \nYumm, just gonna do some reading here \n\nIt'd be nice if they played a little music?", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "I don't get the rave reviews about the sandwiches.\n\nI've been searching high and low for good sandwich places and made the trek out here to try a roast beef sandwich on sourdough with provolone cheese. It took about 10 minutes to prepare, but I was alright with that.\n\nThe bread was toasted but the entire sandwich tasted slimy. There were too many tomato slices (I ended up taking one out of the second half which balanced the sandwich more) and I don't understand why most sandwich shops don't also heat up the meat. The roast beef itself was cold and clammy. \n\nOverall, a sad sandwich. Also, the drip coffee selection only had \"house\" coffee and no flavors... which is fine by me but my husband (being a hazelnut coffee fanatic) was disappointed.\n\nSeems like a great place to work out of, however.", "author": "Sylvia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "A very cozy café:\nPros\n+ Interior: art for sale\n+ Real mugs\n+ A most broad selection of teas\n+ Very modest price\n\nCons:\n- Cleaning buckets and mops in the toilet make it look a not very clean place\n- No hooks or tables in the toilet", "author": "Dmytro L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "Love this little place. It's cheap. They serve tea and coffee. The food is nothing fancy but it's fine, and at least they have savory options. The wifi is reliable, it's comfortable, and the noise level is perfect for working. It's out of the way so it's never super packed.\n\nAnd, an increasingly rare pleasure in any coffee shop in this city, I've encountered hardly any douchebag bros in here shouting to everyone who doesn't care about their pointless startup.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "solid bagels and cream cheese for a decent price. i'll update if i try the sandwiches next time around.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-18", "description": "This two floor cafe has a real old feel to it, like it's been around for years and years. Their menu is typical cafe stuff. The staff was very friendly and the bathroom had some great art in it.\nThis is definitely a neighborhood spot and not a detour.", "author": "Tommy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "Great spot to study, work, or contemplate life. Quiet, with a variety of options for seating. Cute wall art to distract you for a bit.", "author": "Colgan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "It is worth mentioning that they offer all kinds of bagels and sandwich combinations you can imagine for a very good price. I would definitely go here again to have breakfast!", "author": "Insa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-15", "description": "Oakside Cafe is the usual neighborhood coffee shop offering pastries, sammies, bagels, coffee. small, comfy place with a tiny bit of character.\n\nbrew: peerless coffee (m, 1.85)\n-tasted a bit harsh, strange for a peerless\ndidn't mellow out. so 3 star.\n\ndrips:\n-service average.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "I can't believe I haven't reviewed Oakside yet.  This place has basically become my second home. It's the perfect neighborhood spot - simple menu, great internet speed, always a place to sit and always an outlet available.  Judy is also sooo nice! This is a wonderful place. The matcha green tea smoothies are my favorite :-)\n\nUpdate: I just wish they served salads!", "author": "ShayD E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "What a gem of a cafe. It is the perfect little setup for a Sunday of catching up on work and just relaxing with a yummy latte. \n\nI came here everyday for a week when I just moved to the neighborhood and didn't have wifi set up yet (don't worry, I tipped generously!) I tried many a drinks and had an amazing bagel sandwich. You can't go wrong. This is the cafe you wish you had on your street, but could never find. Pop in and see for yourself!", "author": "Helen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Excellent bagel breakfast sandwiches and coffee to start your day. The lox is particularly good. Yogurt with fresh fruit for those days when you want something lighter.", "author": "Ted B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Less hectic than most cafes in the neighborhood. Super relaxing + the people that work here are really kind! and good prices. Breakfast bagel!!", "author": "Tessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Solid Solid spot to get reasonably priced coffee, sandwiches, pastries, and breakfast bagels. Standard fair executed well. Breakfast bagels are a standout.", "author": "Adam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "Nice place to go and study. You can't expect great food/drinks here but that won't stop me from coming haha", "author": "Kimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Quaint neighborhood corner coffee shop with a simple menu and decent coffee at a GREAT price!  $5 gets you a tasty egg bagel sandwich and a coffee!  If you are looking for a trendy foodie brunch, this isn't it.  Relatively quiet (no music) and seating in a upstairs loft or window counter is good for people watching or sitting down with a laptop.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "I seriously love this place. I come here every day to work (as I work remotely). The internet is free (sometimes spotty though), but the food is well-priced and I absolutely adore Judy that works at the counter. She's seriously such a doll and always makes it a point to say hello. Customer service is often-times a lost art these days and Judy is one of the main reasons that I keep coming back here . . . Big love for you, Judy! Keep up the amazing work and keep that coffee coming! :)\n\nAlex", "author": "Alex D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Came in here on a Saturday morning and was a great place to break out laptop or read a book. However, I was looking for some strong coffee and this was just mediocre. It had a slightly burnt taste and a little watery. The bagel was standard as well. \n\nNice decor, mediocre food and drink.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "A true neighborhood staple! No matter how many new cafes pop up, Oakside Cafe remains my location of choice to sit down and enjoying a coffee/breakfast sandwich on a Sunday morning. The staff is great, the food us yummy, the service is fast, you can always find a seat (upstairs is my favorite), and the ambiance is perfect for getting some work done.", "author": "Lillian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "This is a sleepy cafe \nNothing particularly good here \nDusty like an old thrift store", "author": "Robert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "Adorable neighborhood spot - the likes of which are becoming more rare in our fair city. Delicious sandwiches, bagels, and a tea collection that would make the Queen weep a silent tear of joy. A perfect place to enjoy a peaceful afternoon tea. Also - staff is quite kind as well.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "How cute is this place? I love all the eclectic artwork on the wall, and it's for sale. Free Wi-Fi, great sandwiches, great prices, lots of outlets and I never have trouble finding a seat. I will definitely return.", "author": "Robyn P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-07", "description": "They the worst service and rip off these people with there service is bad and they tread costumer bad and charging double", "author": "Essa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-14", "description": "I had a really bad grilled chicken sandwich here.  The sandwich looked fine but the bland chicken had a weird, funky taste and the tomato was mealy.  Plus the upstairs isn't clean. It has a funky 70's thrift store feel and the horrible pictures are crooked. However, it is a good spot for laptop camping (easy parking, plugs, bathroom, free wi-fi).\n\nCash only.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "Super cool place! They even have a high speed computer and printer. My only downfall with this place was the incredibly incredibly incredibly rude worker who was on her phone and didn't want to answer a simple question. Some people should not work in customer service if they do not like answering questions or helping people.", "author": "Andrea N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Great for working.  A lower haight gem indeed.  I like that they don't annoying music here in an attempt to drive turnover (I'm looking at you Bean There).  \n\nI wish they were open a bit later.", "author": "Erem Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "I really like the ambience of this place. It just appears to be simple and relaxing but also very out of the ordinary. I mean, it is the kind of place where you'd like to sit for a while and hang out because it's so homey. I had coffee once here and it was pretty good!\nI used the printing service lately since there is a computer available to the public and I thought that was a great asset for the place - especially because it is located in a residential area (right near the DMV - in case you forget to print essential documents like I do) so if you are in that area your only other viable option is to knock on someone's door and ask to print. But no, this coffee places makes it all much  better and less awkward.", "author": "Dodi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "Average cafe feeling with breakfast/lunch foods. Not sure fresh/healthy but does the trick.", "author": "Tristan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "WTF is Apple pay?  Slow down everybody.  Good coffee shop.  I said I wanted \"for here\" and they gave me a to go cup, but every asshole around here does that if you're not a regular...", "author": "Jasper L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "In my idler moments, I've always wanted to open a coffee shop so I could decorate it like the big comfy living room that fits in my head, if not in my apartment. Luckily, somebody's already saved me the trouble.\n\nThe sandwiches and hot beverages were good and tasty, too!", "author": "Bob S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-13", "description": "There are plenty of outlets and is never crowded. It reminds me of a hippie spot with the plants and nature looking decor along with the natural lighting.\n\nThe coffee is mediocre and the place looks a bit dirty due to wear from the years, but I will definitely come here to relax", "author": "Dorris W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-10", "description": "Oakside Cafe is down the block from me so I visit it out of convenience more than anything. It offers coffee, tea, smoothies, fresh-squeezed OJ, breakfast items (bagels, muffins, etc.), sandwiches, wraps and other deli-type items. \n\nTheir coffee is not particularly good but luckily there's a Peet's across the street. I was pleasantly surprised by the quality of their bagels though. After living in NY for a few years and being a self-proclaimed bagel snob, my standards are pretty high. A toasted everything bagel with lox is the penultimate bagel for me. Since I'd worked up an appetite after walking around the Haight this morning, I stopped by and warily ordered my usual, which comes with fresh tomato slices and capers at Oakside. My bagel was still warm when I brought it home and I really liked the fact that it contained sliced locked and not that cream cheese spread with lox bits. I'd rate the bagel itself a 6 out of 10, which isn't bad considering it wasn't made in NY.", "author": "Elsa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "The sandwhiches are incredible! Good customer service too(: I love the art and vibe of this cafe.", "author": "Natasha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "I can't believe how many times I walked by this place...I finally went in today because I had 20 minutes to kill waiting for my oil change.\nThe inside is so cute and cozy: I love all the art on the walls, so many paintings all different styles, something for everyone.  I'm not sure how they gathered so many of them or where they got them but if they are supporting local artists it's awesome as they are all for sale.\nToday I only got a tea and croissant so I can't speak of their coffee but on this cold rainy day I was happy with my huge cup of earl grey tea and lightly toasted buttery croissant, all for $2.50. I sat in the little balcony room upstairs, so charming and was able to look down into the cafe as well as oak street.\nSo\nGo there if:\n-you are sick of generic coffee places with no character\n-you don't want to pay $4.00 for a piece of toast\n-you want to escape the hipster crowd\n-you want to chill and read a good book (it's quiet and they have a little library...)\n-you need to study for a test\n-you want a filling lunch under 10 bucks\n-you like art\n-you want to support a cute little neighborhood cafe with friendly service\nVoila\n\nGoodness", "author": "Monkey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "I love this place. \n\nYou won't have the best coffee or pastries of your life here, but Oakside is totally unpretentious and there's always a place to sit and an outlet to plug into. \n\nThe people who run it are nice, though sometimes they inexplicably give you paper cups even when you say you're staying in, and there are a row of clean mugs in plain sight. \n\nA previous review said it's cash only, which is no longer the case. They have a point-of-sale iPad that takes cards with no minimum purchase requirements.", "author": "Jimbo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "I'm here on a Sunday mid-afternoon, studying upstairs with 3-4 other people on laptops or reading. Downstairs, there's a group of ukulele players doing some sort of jam session. They sound pretty good, actually!\n\nMy $1.85 medium coffee is decent. More importantly, it's nice to have a pleasant place to study for a bit while I wait for my friend.", "author": "Patty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "+4 stars for extra tasty bagel sandwiches -the kid running the sandwich board is a natural, very good with the technique. I nor my pals have NEVER had a less than awesome bagel or egg sandwich from this guy. \n\n+1 star because the lady that runs the place will bring a sandwich out onto the sidewalk for me when I have my dog. \n\nI tip these guys super generously - I make it rain tips-wise. This is the kind of hood place you want to do that with.", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-13", "description": "If you are looking for a cafe to relax and enjoy a nice cup of coffee off of the panhandle, you'd be better off going across the street. Although a black cup of coffee is only $1.55, it comes consistently burnt. I haven't tried their food because a cafe that messes up their primary product doesn't seem like a place that I'd trust to make a meal.", "author": "Colton L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "I love this coffee shop, Judy and Amy are very friendly and sandwiches are pretty good. Go for the Turkey Special or Oakside club. Don't forget to grab one of the pastries on the counter.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "I love this place.  It's small, I think it's locally owned. I can come in, work for a few hours with the free Wi-Fi and have all my meals made here.  There are outlets everywhere to use and even additional desk lighting in the darker spaces. It's awesome.  It's also a great respite from the humdrum of the office.", "author": "Cindy W. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "The Oakside Club is the most genius combination of food! Toasted bread, mustard, lettuce, tomato, avocado, turkey, and bacon! The atmosphere was nice and the woman who served us was wonderful. Highly recommend", "author": "Kaitlyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "Love my local neighborhood cafe, they are so sweet and everything is fantastic!", "author": "Natalie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "I shouldn't even be telling people about this cafe...it's one of my secret spots!  Not much of a secret anymore...  The upstairs is really great for those who either need to work on their laptops or want a cozy spot to hide out.  I've used the free wifi both at the upstairs bar (bar table by the outlets overlooking the lower level) and on the couch.  The others who study and work up there are pretty mellow and don't mind when I need to sneak in and plug my laptop into one of the outlets by the bar.  \n\nThe hummus, drinks and snacks are pretty decent.  I was just happy that their items weren't ridiculously overpriced.  The service is friendly, but I've certainly been to more welcoming cafes.  I mainly come for the neat hideout spot.  You will not feel pressured by anyone to leave.  I agree with other reviewers who have appreciated the vibe/artwork/memorable music inside as well.  \n\nThe only major con would be the hours, but perhaps that is my own fault for not being an early bird.", "author": "Jay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "My perfect spot to grab a cup of coffee and a bagel before work/school! It's decorated super cute and cozy and they have free wifi so it's also a very nice place to relax or work in some peace.. I have to add that these ladies make my morning. They are so friendly! THEY NOW ACCEPT CREDIT CARDS (so now I can't use the excuse of having to break change for muni money) This place is a gem. I love it.", "author": "Serennah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "Just had their Oak Side special chicken sandwich. Just amazing and delicious. As good as it gets and value for money :)", "author": "Manish C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-28", "description": "Came in here for a quick coffee and the decor reminded me of New York. I love the colorful walls. The place lighting came mostly from daylight which was refreshing. There's also a staircase that leads to more seating upstairs. The coffee was ok..nothing special; similar to Folgers coffee. The sesame bagel with hummus was delicious.\n\nThis place is cash only. Bring your own laptops otherwise it's $1 for 10 minute usage.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "I come here every day to get work done and don't have a single complaint about it. The women who work behind the counter are always ALWAYS friendly, they appreciate your business, and will do whatever it takes to make sure you enjoy your time there. There are plenty of plugs to charge your computer, seating is always available, and it's never too noisy where you can't get work done. \n\nBut the one thing that I really want to stress is how great the customer service is here. More businesses should take note of this place. You won't regret going here at all.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "This is a no-frills café with decent coffee and pastries and plenty of space. It's not hip; just a place to read a book, meet a friend, or get some work done. The wifi worked pretty well.", "author": "Peter A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "Cute little cafe with a nice environment for working or reading. However, the coffee was burnt.", "author": "Erin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "Pros: cozy environment, lot's of outlets, free wifi, friendly staff, quiet, great place to get some work done or socialize,\n\nCons: closes early, only bag tea, sandwiches are average", "author": "Karl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "This place has a really delicious breakfast bagel. Piping hot and cheap, too! I don't live in the neighborhood, but would make this a stop on an urban hike any day.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-30", "description": "Big space, Wi-Fi. Homeless hangout. Lots of pastries wrapped in plastic. Can't beat the prices for the neighborhood. Great bagel sandwiches.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-04", "description": "only decent coffee joint left in this neighborhood. decent. great atmosphere. \n\nI wonder how much you actually have to type in here to get your \"tip\" qualified for \"review\"", "author": "Steve F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "I moved to the Lower Haight about 6 months ago and I'm only just discovering this place. Truly, I wish I'd have discovered it sooner.\n\nI went during the day today (A Tuesday), and it was really quiet and cozy. I was primarily looking for a place with a cozy atmosphere to sip some coffee and read a book, and this place delivered. \n\nThere was a nice wooden bar with a row of seats facing the window, and I noticed unlike most cafe bars, there was plenty of space, so that one could actually eat comfortably at the bar instead of feeling cramped for space.\n\nAlso, upstairs was a row of people seated with their macbooks. When I walked up stairs there was a cute little couch that I parked on. Very comfy. And I noticed the reason for the row of macbooks was that this place has TONS of outlets, so if you're looking to use your computer in a cafe, this is a good place to do that.\n\nFinally, the coffee was pretty good. I didn't try any of the food but the pastries and what not looked pretty good, like any decent coffee shop. \n\nI definitely recommend this place to anyone looking for a cozy, quiet coffee shop to read, chill or do work on their laptop in.", "author": "Jamie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-13", "description": "LOVE that this place has a little 10 minute parking spot out front. It's great because I don't have to circle the block 7 times to look for parking just to pop in and get a quick bite.\n\nI've never come in for lunch/dinner so I'm only knowledgeable about their breakfast items. Their menu is pretty extensive for such a \"small\" place (I guess it's not that small when I think about it). One of my favorite things is their 100% freshly squeezed orange juice. It's great on the go because it's already packed and ready to take with you. A little pricey, but I'm willing to pay extra for the omission of preservatives and artificial flavors that bottled juice can have. Yuck.\n\nTheir pastry selection is very impressive as well, and can't say that I have a favorite. Same with the smoothies.\n\nTIP: great place to catch breakfast before (or after) a good jog in the park!", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "I love this place, the young lady and gent that work here have my order ready for me as I am walking up to the counter and are always friendly. I like doing work here because of the free wifi and their amazing service.  They also have some simple but fresh and delicious breakfast and lunch options. Skip the bad layout and attitude at PEETs in Faletti'smarketplace and make this your stop you wont regret it!\n\nGrab a coffee/tea sandwich and go cruise the panhandle while supporting a local business.", "author": "Alanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Oakside is a perfect neighborhood coffee shop with no pretensions. The art adds a local touch; the coffee is good; and the breakfast sandwich is surprisingly yummy. The employees are nice also.", "author": "AJ J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "What an amazing atmosphere! Two levels, nice decoration, and good drinks&food. Perfect for studying or meeting up with people.", "author": "Tamara V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "This place makes me want to get things done and makes me happy about life. The vibrant colors of the walls and tea displays are lovely and will lull you into a relaxed and productive state.\n\nIt's the epitome of cozy, has decent coffee, lots of books upstairs, free wifi and lots of plugs (SO necessary for this owner of a first gen macbook that doesn't play nicely unless plugged in!). As a bonus, the music is never too loud and often plays some fun stuff (Elton and Whitney, for example!). Only downsides: They don't offer too much variety in coffee, and sometimes when it's mildly crowded the wifi starts getting really slow.\n\nI may be biased because I hardly go anywhere else, but I wouldn't like to spend Saturday morning at any other coffee shop!", "author": "Kelsea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "I love this place and these ladies. This isn't Blue Bottle or Ritual (the humanity), but it's a great place for an uncomplicated neighborhood small cafe experience with great food and even greater staff. \n\nEvery time I come in, these ladies are friendly and courteous and FAST. I'm a NY transplant and spend a good 15% of my day complaining about the lax service in SF, but this place is on the money. They care about your business, they make and sell delicious food (the hot turkey sandwich special is a revelation) and they don't make things over-the-top. \n\nAn obvious highlight is on weekends when the stringed instrument folks come in to practice. They take up most of the seating area downstairs, but some of my favorite mornings are popping in there to grab a coffee and a bagel on my way to the park only to be greeted by a 15-person group singing and playing folk music.\n\nAlso it's hipster-free, so.", "author": "K Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-04", "description": "A great place to chill for a while or do some work with a friend. It's pretty quiet normally, although one day I was there there was crazy rowdy party by the front. Service is friendly. Music is forgettable, which is fine if you're there to do work. The food looks tasty, but I've never indulged there. Free wifi is always a plus.\n\nWhy only three stars? The coffee is pretty mediocre. My latte was quite weak and definitely lacked any sort of complexity. I guess next time I'll have to try the tea and treats and report back.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-25", "description": "This place is cheap but the coffee is weak and the sandwiches are bland. It is a comfortable place to hang out and read or work but not a destination for food or coffee.", "author": "Alex A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-22", "description": "Good coffee and great bagels! Unpretentious, down home cafe. All the food I've had here is good. Friendly service too!", "author": "James P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "Great neighborhood spot. The staff is super nice and accommodating. No attitude, good food and a nice place to relax with a coffee and friends.", "author": "Hank H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-07", "description": "The line is very slow. Pray that the person in front of you doesn't get a bagel or an espresso drink because there's only one cashier and they don't multi-task. \n\nThey are super nice though and make good stuff, but if they had more people working and laid off the charmless tacky decorations it would be my #1 place around here.", "author": "Leo V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "Really delicious drinks! Get the Chai Mocha. Staff behind the counter is really friendly and has gotten to know my girlfriend and I well. Wonderful atmosphere + wifi = great for getting work done. Service is quick. Bagels are yummy! Great local coffee shop. The iced coffee is also highly recommended; it's the best I've had, hands down.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "I can't imagine that there is a place in the city where you can get a large latte AND a fully loaded bagel for under $8. Watchout Starbucks, this cafe is local and knows it's audience. I love going to this cafe, their coffee is yummy, service is always good and the vibe there is a cool for hanging out. Definitely a gem you wouldn't know about unless you were in the hood. Great also as it is on the way out of the city so you can pop by while heading to work or if you are heading to the DMV (ugh) or a trip into Golden Gate park. Perfect to start your day off right.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "Oakside achieves the quadfecta of what makes a good coffee shop great:\n\n1. Fantastic parfaits, where you get your choice of multiple lowfat yogurt flavors, tons of granola, and a generous topping of fresh fruit.\n\n2. Delicious lattes made better all the better thanks for nonfat milk and sugar free vanilla syrup.\n\n3. Tasty sandwiches. I bet the turkey on wheat with apple slices and cranberry sauce is fine as is, but when they let me swap hummus for mayo, I entered sandwich nirvana.\n\n4. Free wifi and plenty of outlets.\n\nThis is one of my favorite coffee shops in the city.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "I've walked by OS Cafe many times - tempted to try another neighborhood coffee joint...but alas, I keep walking and enter Peet's in Faletti's. No more. \n\nI finally entered Oakside's gates (seriously, I've often thought this place was closed bc of its door) last week when the electricity went out on our whole block (thanks PG&E). Given that Coffee to the People and others on the easy-to-walk-to-cafe-path were all affected by the outage, too...I lazily walked downhill to OS (thinking about how I'd have to walk uphill on the way back...).\n\nAnyway, I was very pleasantly surprised by the warm service, free wifi, nice seating and array of snacks at OS. I hooked up my computer and kicked off my shoes (mentally) and was served a nice warm cup of chai tea. Not anything particularly special, but good, warm and served in a nice cup. There is even an upstairs section that I plan to check out.\n\nIf you want grub, noticed there are pre-made burritos, sandwiches and lotsa snack food.\n\nI will be back OS. You might be my new hangout and def a good replacement to Pete's.", "author": "Deann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-16", "description": "Inevitably, when something cool happens, something shitty has to happen to cancel it out. For example, you meet a cute interesting fellow who is completely unlike the -geeks who collect things -trash you usually date and after having being extremely charming for hours, you fuck it all up by ending the night throwing up in the back  of your friend's car. Over and over and over again. And then you wake up the next morning to find that you have also puked in your room (uh, haven't done that since the year 2000!!!)  and all over the cute new scarf you bought the day before. And just when you didn't think you could feel any worse, you remember that you have to see your ex man today to sell him your old computer. Yeah, totally awesome Saturday morning for Maria D. \n\nSo, after I cleaned up the puke-a-torium (okay, it wasn't that bad, but I am never drinking Red Bull ever again), I took my queasy self to Oakside, a very cute, kind of run down, strictly neighborhood little coffee shop that wasn't going to be full of well dressed 117-ers talking about the shows they went to the night before. All I wanted was to be left alone with my laptop, my three beverages and salty BLT and not be distracted by ugly \"fashion\" and name dropping and crepes. And that was exactly what I got that morning. I left 4 hours later feeling like I wasn't a complete failure. Okay, maybe just a slight failure who can't hold her liquor. Anyway, thanks, Oakside.  I'll be back.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-16", "description": "Breakfast sandwiches laced in buttery goodness.  I mean laced....like if you don't like butter on your bagel you best tell this man cuz its on there.  And i mean drip out of the sandwich get all mixed up with your eggs and cheese on there.  Not your WW friendly bagel for sure, but damn its tasty.\n\nThis is a really great spot.  I never came here before last week, and it might be my new neighborhood coffee shop....at least until Abir re-opens or if i ever need to use the free Wi-Fi they offer...Thats right...Free.  A cute upstairs, regal looking desks downstairs, and a neighborhood feel that i can never get enough of.  I guess I'm what you might call a \"hood rat\".  Lord knows i love my cheese.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-04", "description": "My neighborhod cafe is an all-around decent coffee shop.  Good coffee, banana bread, coffee cake, bagels, sandwiches, odwalla juices, etc.  Atmosphere is good - local art on walls, plenty of spots to sit and enjoy the free wireless internet - especially the upstairs. \n\nDid i mention free wireless?  And its fast.  \n\nThe reason i come here is for my favorite breakfast - an onion bagel with egg, cheese, tomato, and bacon.  Delishous. I've been here 40-60 times over the last 2.5 years, and service and food has always been consistantly good. Only reason i didn't give it 5 stars is cuz you can get better coffee other places, like Philz, or PEET's, which, by the way, is opening one a new store across oak in the ne apt  complex.\n\n4/5 coffee\n4/5 atmosphere\n4/5 service\n4/5 food\n4/5 value", "author": "chad n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Dear Oakside,\n\nI love you.  I really do.  It may seem unmanly to begin a letter to my favorite local coffeehouse that way, but I'll do it anyway.  I love you in so many ways.  Where to begin?\n\nWell, there's always your unpretentious nature.  Something I used to take for granted in a coffeehouse, this quality is becoming all the rarer in San Francisco.  There are weird heirlooms for sale on some of your shelves, but in general, you don't force me to notice how cool or hip or uncool or unhip you are.  You don't make me want to think you're trying to be ironic when I walk through your doors.\n\nYour food is yummy, especially your pieroskis.  And your friendly workers are happy to warm up your pieroskis only halfway so that I won't burn my tongue when I eat them.\n\nAnd your service is wonderful.  Your workers reward regulars by being especially attentive and remembering regular orders.\n\nDid I mention you've got a lot going on up top?  Your second floor is a beautiful place to read.\n\nI wish you wouldn't have added that stupid TV-screen thing, but then all coffeehouses have their flaws, it's what makes them, well, coffeehouses.\n\nI do hope that Peet's doesn't drive you out of business.  That's one of the reasons I visit you so often.  Please hang on with all your might.  You are my favorite coffeehouse within walking distance, and I do love you so.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-10", "description": "A great little caf, well located, with a nice atmosphere. \nThe food is good and the wifi is free. It has a second floor for those who need calm.", "author": "Fred M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "This place is very convenient and has become our second office. It has free wifi, one computer and printer, and your choice of seating at tables, a couch or bar stools along the Oakside window. Our workers convene at this locale every morning when we have a renovation to complete. No one chases you out the door after you finish your coffee. My only wish is that they remain open into the evening.", "author": "Saundra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "Total neighborhood cafe. And yet another reason why my neighborhood is awesome. \n\nThey make great sandwiches, speedy but not skimpy. I like the Oakside club or just a turkey-avocado. They've got wi-fi, which kept me coming here during my college days, working on essays and papers and whatnot. I loved going upstairs in the loft area where there are comfy couches and plugs so i can plug in my totally outdated laptop into! (so many wi-fi cafe's have nowhere to plug your laptop in so its of no use to me). It's a great place for a cup of coffee and a book, too.\n\nIt's totally funky, with tons of random artwork on the walls and flyers from locals. But that's what makes it an authentic neighborhood cafe.", "author": "Nina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-25", "description": "Being a portion of the population who works from home, I sometimes feel akin to being a Vampire. My thirst is for electricity and wireless signals. I might not leave my house till night and I am alienated from the everyday work culture in dress code and small talk. Sometimes I fly to my nearest coffee shop to reassure myself that although I stare at a computer all day, I am actually in tune with the daytime pulse of the working world. \n\nWhen I arrived at this café to do some work I walked straight to the counter not noticing the stairs that led up to the second floor. After the very nice man who ran the shop assured me there was free wireless I ordered some vegetarian vampire food, a sandwich with all the fixins. Once I realized there was an upstairs I slowly, creaked up the stairs. \n\nCreak, Creak, Creak....\n\nAghast - I found a whole den of vampires! \n\nThey were all fastidiously working away on their computers and they were very accommodating when my juice levels ran out and I needed to switch seats to sit near an outlet to recharge. Did I have small talk with these vampires, no. But we did all snicker a bit when the living walked in and were jabbering away loudly about their life problems - annoying humans.\n\nIt was definitely a productive setting to get my work done and the service was good.", "author": "Sari G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-11", "description": "I really don't like it when coffee shops serve in paper cups. The cup really destroys the flavor.", "author": "Sameer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-23", "description": "Good coffee and a great lunch deal; $5.75 for a sandwich and a drink (water, coffee, soda). Nice loft and window bar for doing work. Nothing too fancy, the service is nice and they made a descent cup of coffee.", "author": "Shanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-20", "description": "Living across the street from Oakside is a blessing. Sometimes, the only things mornings call for is a perfectly warm, perfectly sweet Vanilla Latte and, um, a Bacon, Egg and Cheese Croissant. I know, I know. Artery clogger...but, but, you don't understand...it's heaven if heaven were on earth in it's cheesy, melty goodness!\n\nJames Cai (chAi) the owner is the warmest proprietor. His friendliness harkens back to when the world had sincere white picket fences, no Gin and apple pies sitting on windowsills.\n\nSince Peets moved in across the street, Oakside has upgraded itself with new paint, a granite countertop for the condiment bar, and newer furniture upstairs and downstairs. All without losing it's quirky charm. And the business shows it. It's hardly slowed down.\n\nTry looking for quirky charm at Peets...or for that matter, a Bacon, Egg and Cheese Croissant.", "author": "Rey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-05", "description": "I love the independent coffee shop feel, how the is a personality all it's own in a place like Oakside cafe. They take pride in the coffee, sandwiches, and delicious bagels while providing a relaxing atmosphere and free Internet. \n\nThey put Noah's bagel to shame- I always love adding the fresh veggies to my bagel and cream cheese. Not in the mood for breakfast? Try their sandwiches- they are scrumptious too! This is where you get quality ingredients and you can taste the difference! This is a refreshing change from the cheap crap that is semi-stale pushed on you at other coffee shops. \n\nIf you choose to grab your bagel and coffee to head upstairs you can read a book or work on your lap top in their second floor enjoying added quiet and peace...ahhhh.... \n\nA neighborhood jewel", "author": "Beth M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-14", "description": "I like the atmosphere but the background music- yikes.  She's A Maniac is playing right now. Maybe this is what some might consider ironic in a good way.\n\nThey have an impressive selection of eats from smoothies, parfaits, burritos, paninis, a ton of pastry dessert type things...  But I just tried the turkey on wheat with cranberry sauce, cheddar, apple slices and mayo,  and I'm really disappointed. The turkey was way too salty and the rest of the ingredients blahzay. Teeny tiny lifeless apple slices.\n\nThe latte was okay. Really creamy fluffy foam redeemed it.\n\nFree wi-fi and it's comfy.\n\nI feel guilty for yelping them while I'm here. I swear I have a life. Huey Lewis is on now.", "author": "ella j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "I love coming here to work on my computer and have a snack to keep my brain energized.  There are outlets everywhere for computer brain power and free wi-fi keeps me in the loop.  If your looking for a huge selection of food it's probably not the right place for you, but for a little snack and some coffee or tea it's the perfect spot.  They even have a cool loft like area with seating that is pretty comfortable.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-01", "description": "This is my morning stop on weekday dog walks at 7:00am when I need caffeine.  The coffee is strong, the service is always friendly and the bagels are some of the best I have had in the city.  I have been twice for lunch too and their sandwiches are yummy with big hunks of avocado.  They are building new apartments across the street so get to this lil gem before it gets super crowded.\n\nOh and check out the upstairs area!  They have old furniture and lots of board games to play.  The art is pretty freaky up there, but the Nightmare Before Christmas book ends make up for it.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "This place is cute. I wish they had more selection, but the chai mocha was pretty good. The service is pretty good too. The place itself is very homey, and just a fun place to get a hot cup of something on a cold San Francisco day. It's also very close to Golden Gate Park and the Haight-Ashbury district, so if you're bored after coffee, entertaining things are a walk away.", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-20", "description": "Being a coffee aficionado I'm constantly on the prowl for coffee shops. I eyed this place rolling home from from the Park ride. In actual fact, I live on Oak st and pretty much any ride or commute ends with me going by the Oakside Cafe. \n\nI slept in a bit sunday morning, but I new I couldn't lolly gag all day as I was riding down to meet my girlfriend at a BBQ in Santa Clara. So I decided to go have a quick bite to eat and some coffee at the Oakside.\n\nI walked in, probably about 1030, and was surprised to see that there were only a couple other patrons milling about. I walked right up to the counter ordered a cup of coffee( for here so you get a glass mug) and a everything bagel with tomatoes, sprouts, cream cheese an cucumbers.\n\nYum, the bagel was delicious and the ingredient very fresh. The coffee was awesome. Service was very friendly and I really liked the look of the place. It's got an older feel, maybe like going to grandmas for coffee, but it's quaint and very comfortable. They have numerous types of tables, a few sofa chairs and then even have an upstairs loft with more tables. The place gets great sun and it's a great place for people watching as Oak St is fairly busy.\n\nI will be back to try the espresso!", "author": "isaias J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-15", "description": "There are several things that I roam this city in desperate search of: the perfect record store that has everything I'm looking for, the perfect bar that has a good jukebox and cheap-o drinks, and the girl (nobody's perfect) that can appreciate or tell me where to find the above things.\n\nOne item that I never really acknowledged my desperate search for was the perfect Soy Chai Latte.  For my money,  the Oakside Cafe has the best chai out there.\n\nWhat makes their chai better than the rest? The easiest and most obvious answer is \"my personal taste\". Their soy chai latte is spicy- really spicy. Any sweetness it has is almost an afterthought and reminds me of, well, blueberries. \n\nWhatever combination of soy milk and chai they use, it's perfect. You'll gag at the sweetness and creaminess of any other place's chai latte after this. \n\nAs for the rest of the place, I must say it is a well-lit  corner shop that never seems crowded. It has high ceilings which make it airy.  The staff has always been really nice. Free wifi is a nice touch too.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "My bagel was really well toasted, which I love.  A great place to sit and work or just relax!", "author": "Caitlin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-12", "description": "Oakside really got on my bad side when they charged me 50 cents to add about 2 ounces of soy milk to my drip coffee.  I could get into the whole arguement of soy milk actually being cheaper than regular milk, etc, but I won't.\n\nThe baristas are also not super friendly.  Big wah-wah on Oakside, especially with On The Corner on the next corner down now.", "author": "Reggie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-08", "description": "I stopped in here for a sandwich and something to quench my thirst after a rowdy afternoon of volleyball in Golden Gate Park. The place is unassuming and mellow. I got some sandwich that looked pretty bland when I got it. But it was AWESOME. It was turkey with some other stuff, but included some cranberry sauce. I don't know if it was as special as it seemed or my rabid hunger, but I will definitely go back.", "author": "Ben V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-30", "description": "I usually stop by here while my boyfriend & his friends are visiting a store nearby.  I come here for the iced coffee because they are a lot more affordable than the mainstream coffee houses.  Unfortunately, the coffee here isn't as spectacular as the Peet's Coffee that opened across the street.  Oakside's coffee is a tad weaker in comparison.\n\nOtherwise, this is a great place to sit around & relax.", "author": "Tisha Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-04", "description": "I love my local coffee shop.  I have lived near Oakside Cafe for 8 years and when James and his wife bought the cafe from Joan & Sam several years ago I wasn't sure if they could keep up the same friendly, homey feel.  I am pleased to say that they have done a great job serving their neighbors!\n\nTheir service is friendly and quick.  I appreciate the cleanliness of the space.  The food is fresh - bagels, pastries, sandwiches, soups and even fresh squeezed orange juice.  And the coffee is good.\n\nThe owner's care about their customers and it's obvious that they take pride in creating and operating their business.", "author": "Kimberly P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "I Agree it is a nice neighborhood cafe which I like to support. I usully pick up a $2 double espresso & a sparkling water  for the road so I don't spend much time in there. Better than Starbucks or Peet's aint it, except for what they charge for a Geyser Sparkling water in there, this may seem petty but it's a princip. I can pick up a 4 pack in Trader Joe's for $1.59 & at Oak they charge $1.65 for 1 bottle of the same......to much!\nAverage cost @ like businesses is $1.25! I'm shopping TJ''s", "author": "Steiner A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "This is your real neighborhood cafe:\n\nSlightly uncomfortable and mismatched furniture;  reasonably sized menu with reasonably sized portions of food/drink; somewhat reliable wireless; don't really give a damn about you - cafe workers; average amount of sunlight; just the right mix  of dogwalkers/stay at home moms/agents of gentrification/old school western addition folks/work from home websters in the clientle.  \n\nI joke that this place serves \"slave juice\" instead of coffee, because their joe is neither organic nor fair trade (its close by neighbor Coffee to the People serves both).  But I do enjoy the undiscovered and rough around the edges feel of this Oakside.  Plus it's slightly uncomfortable chairs and quiet upstairs section* make it a good place to get some work done.\n\n*note: one of the days I was working in this \"quiet\" upstairs section, a middle aged group of Latino men (who were dressed in warm ups and soccer jerseys) came in and played some very loud (but amicable) rounds of poker.  Mildly annoying? Sure, but also a part of Oakside's charm that I wouldn't want to lose.", "author": "aekta s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-04", "description": "The special chicken sandwich I had was delicious but the skim latte was undrinkable. I rarely don't finish my coffees but this one was a shocker.", "author": "Joy X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-03", "description": "Oakside cafe has some great coffee and a nice staff. I get their ice soy latte when I am in the coffee mood and they never disappoint. It is a nice little place to be in with that traditional coffee shop feel. It never seems to be overcrowded and they have an upstairs for your extended coffee stays. The sundried tomato cream cheese for the bagels is something that I have never found anywhere else and is fantastic. It's like a vodka sauce for pasta on a bagel. Tasty!", "author": "William R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "Great place for coffe, covenient for people like me who drive to downtown daily. They are open very early, (I m an early birdy) staff friendly, in three times that I went there everything that I drink or eat was super FRESH. The coffe is really good I wish that I had more time to sit down and watch the traffic on oak street. Will keep coming cause it is a good place with good coffe and food.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-19", "description": "This is one of my favorite cafe! It's an adorable cafe with a nice atmosphere and unbeatable for studying! \n1. Very friendly staff.\n2. On the lounge (2end floor) you have 5 tables with nearby outlets, the 2 other tables are a bit far for the outlet. And there's a sofa too.\n3. unlimited, free WIFI \n4. quiet, the music at a not disturbing volume\n5. enough light for work: although the light could be a bit better, it's still ok. What I really appreciate are the huge windows! From every table you can see outside, you see the \"world moving on\" while studying.\n6. Coffee: I'm not a coffee-gourmand, so I can't tell if the coffee is the best, but I personally like it very much. (Food I don't know, haven't tried yet, but seem very yummy.)\n7. Very pocket-friendly prices.", "author": "Carol B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-27", "description": "Finally got a chance to stop by and tried their chicken salad sandwich (was a bit bummed out that it was actually diced up chicken rather than skinned) but nonetheless it was good and the portion was filling. I've also learned that the drinks are made best when the chinese guy is working compared to the others.", "author": "M W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-17", "description": "It's not that the bagels are horrible, they just aren't very good. The sun dried tomato spread could be described as horrible though. The place is quiet, which is AWESOME, and the wifi is free but lost connectivity a few times. I can use free wifi in a lot of places in this neighborhood and some of them have better bagels and more reliable wifi.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "Really nice staff, seems to always be the same guy and girl every time I've been in.  Reasonably priced, tasty breakfast sandwiches, ranging from bacon and eggs to tomatoes and capers.  I recently stopped in for lunch and had a remarkably fresh turkey sandwiches full of veggies.  Important to remember your cash as they don't take cards, but do have an ATM.  The tea and coffee is always really hot so be careful!  Free wifi, good meeting spot.", "author": "Erin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I lived on top of this cafe for 3+ years.  The owners are awesome.  They used to sign for packages for us and leave the free wifi on at night so we could use it during non peak hours.  They have really good bagels and coffee.  The same family runs another cafe on Noe St in the Castro and also took over Maxfields a few years back.  Not sure if they are still running those places but they clearly know the SF cafe scene.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-05", "description": "I come here when I want a homestyle chicken or tuna salad sandwich and I don't feel like making it myself. The service is friendly, the prices are very good ($4.95 for a whole sandwich, not half like at some places!) baked goods are fresh and yummy and there's free wireless. Great neighborhood coffee and sandwich shop.", "author": "Suepattra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-12", "description": "Neighborhood spot that is good on several levels (they do have an upstairs)....However what I am talking about is the sandwiches, large size , fairly priced and delicious. Very friendly staff and good deserts.", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Good, not incredible coffee, but still a great spot when I'm trekking to the Clayton Street Post Office or Amoeba. I love the coffee bar set-up, makes the 'coffee dance' much easier. Nice warm, homey feel to the iinside, seems like something you'd find in Oregon for some reason. I've had the same two employees every time and every time they have been incredibly nice. Fast, and though I've only had bagels there, they were well toasted (you'd be amazed how many laces can't seem to 'toast' anything properly). I still think Matching Half makes the best cup in the neighborhood, but Oakside is very nice.", "author": "brant f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-20", "description": "I stop in this cafe almost every morning on my way to catch the work shuttle because they have free wifi. The staff is really friendly, the coffee is yummy, and there are cute little tables that fit my Macbook perfectly. Sometimes there are some shady characters hanging out there which make me a bit uncomfortable, so minus a star for that. But did I mention free wifi?", "author": "Christina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-13", "description": "Humble, unassuming cafe, with decent coffee & free wireless (OK, maybe the pastries aren't so nice).  They do a good breakfast sandwich, which is very reasonably-priced.  Because of its location, it tends to be free of the crowds which usually infest other cafes in the Haight/Divisadero area, and is completely devoid of the hipster pretense & bullshit of cafes in the Mission.  It is a pleasant place to sit down with your computer for a few hours & chill.  The space is large enough that they could offer live acoustic music a couple of evenings a week, and this would be a welcome addition.  I'd give them 4 stars if their pastries were better.  They should drop their current supplier, and get them from Delessio's, across the street.  Apart from the pastries, it's a nice little cafe, with a lot of potential.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "There's stiff competition with On the Corner on one side and Pete's Coffee on the other- but this holds up quite well.  I love that this is a family-run joint, and it's very mellow. They have free wifi for customers so I can sit here with my computer and use the internet for an unlimited amount of time. It's less trendy than On the Corner and thus brings in more families.  It's peaceful inside and the upstairs is a cozy place for doing work.", "author": "Hella M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-13", "description": "I'm being a little harsh with three stars, I know, but they have to get better chai.  I took my sister here and since I stopped drinking coffee and we wanted to split something, we got a chai latte...  Man, oh man, if you like extra spicy chai, go here!  The flavor grew on me, but I'm not a fan.  Chai Babba Chai is the best!  The service was cool and the place was two stories (love it) and quite sunny for an early morning. There was a bathroom that was obviously painted by one of those people who looks at Pollock and says \"I could do that!\" and then proves to everyone that you actually DO need talent to paint.. anything.  Anyway, my sister says the mochas are good, but until their non-coffee drinks kick up, I'm gonna say three.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-08", "description": "This place is cheap ($1.65 for a medium coffee vs. 1.85 at Starbucks), has consistent wi-fi and nice owners (provided you're nice to them).  I go here pretty much everyday as it's right down the block from my house, and I really can't complain.", "author": "david m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "My favorite local cafe... perfect for those hangovers on Saturday and Sunday mornings. The bagel sandwhiches do the trick - try the egg and cheese for those mornings when your head is especially foggy, and for a healthier fare go for the cucumber and cream cheese bagel.  They also have a cute upstairs loft with tables and couches for people watching on Divis.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-29", "description": "We live down the street from this cafe. The owners are super friendly & nice. The coffee is good. I like to support this local cafe rather than go to Peet (ick!)They have great breakfast sandwiches too!", "author": "Heather M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-14", "description": "I stopped by here before spending a little time at the loathed DMV. I didn't have coffee so I can't judge it on that, but I did grab a BLT sandwich on sourdough. Meh, not very good. It was toasted and the bacon was crisp... good. The bacon was crisp from the microwave... not so good. It was able to rid my stomach of hunger pangs, but it definitely didn't impress.", "author": "Juls M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-16", "description": "I suppose I should like it more. It's cute, small, the ambiance is pretty nice, & the company was stellar as always. But it just isn't Cafe Abir, & it never will be. COME BACK ABIR! I CAN'T GO ON WITHOUT YOU. In the meantime, I'm sticking with my trusty backup: Central Cafe.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-22", "description": "This quaint coffeeshop is worth checking out if you happen to be in the area.  It is on a corner, which is nice.  It is on Oak Street, which is a little less nice, but visible.  The staff seemed cool.  They have a small but servicable seating area, and the coffee was decent enough.  Not great, but better than a lot of places.  I think if I lived over there I would find it a comforting neighborhood place.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-17", "description": "I'm living on the opposite coast right now, and I'm nostalgic for this old place. It's gots the coffee and the sandwhiches and the sodas and the pastries, for those who go to a cafe for nourishment, but for me, it's got the broken-down sofa goodness.  Plus, free wi-fi, baby. There's even an upstairs section, which is much quieter that downstairs. On a Saturday morning, the upstairs is uncrowded and silent, making it a great place to have a quiet talk with friends or study. Also: big windows, great art on the walls (most of the time - it varies), all kinds of hilarious random flyers on the bulletin board. I feel for the dude who couldn't sell his bass. I feel for him.", "author": "Zen O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-13", "description": "This is an OK neighborhood cafe. On the plus side they have free wifi and an upstairs area that is good for laptop work junkies. I like this space because the staff never come up and and bug you. good hideaway. Also, their tea is fairly priced $1.50, compared to other places in the area. \n\nDownside is the wall art. Feels like it was decorated by a crazy bag lady in 1971 and never updated. Lots of nanna old art on the walls and they even have prices, as if someone would buy an old crappy poster that looks like it was dumpled on the street. \n\nOther than that, the people here seem pretty cool.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "i really liked this place- good food and drink options (i don't drink coffee though so can't comment on that), sunny area in the front, not very crowded during the day, free unlimited wifi and decent amount of outlets.  i think it might be asian-owned too?  an added bonus.  or there's just lots of cute asians in there.  so far, the best option in the area i've found to do \"work\" at.", "author": "Kristin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-06", "description": "I live two blocks from here, so when I am out of coffee and have nothing to eat for breakfast, I am captivated by their service. I do have there breakfast sandwich which is OK, but I find that I am limited to what they have since I am a vegetarian. There coffee is pretty good, and I like the fact that it is small and not overwhelmingly busy. \n\nFree wi fi for those who need it.", "author": "Tedster H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-28", "description": "Not much of a cafe experience.  They have a very limited menu.  Food is ok, but nothing to write home about.  This place is like a mind eraser.  You won't remember it.  Would be a nice place to grab a coffee and read the paper/stalk people on Facebook.  Not bad but not great.  Just OK.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "since my crazy $%^!#* roommate cancelled our phone and DSL, i've been a wifi nomad.  thankfully, Oakside Cafe is a few blocks away.  the wifi is free, but they hope that you'll at least have a cup'a'joe or some tea, but they don't make ya.  now, i love \"the Peet's\", but there are so few of them where you can actually sit DOWN!  and no internet access.  plus, since i don't visit the local video store (read Netflix review) i try to make up for it by going to the local cafes.  Oakside is cute, has places to plug in your laptop, has a nice upstairs w/ couches/boardgames, a funky decor, good enuf eats, Numi tea, and nice staff.  they've even let me stay late while they're cleaning up (unfortunately, they close at 5:30p on weekdays and 3:30p weekends, but open EARLY).  and it's never too crowded or loud, so i can always get work done.  overall good neighborhood place...", "author": "Suzanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-09", "description": "No one makes Chai like the Oakside!  It's now part of my daily routine to go here.  Excellent neighborhood cafe, lovely staff, free wi-fi, chilled at atmosphere!  Love it!!", "author": "Jules O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-29", "description": "Very nice place.  Neghiborhood cafe with good coffee and food.    The owners, James and Brenna are very nice people.  Factor in free wi-fi and a nice setting = big plus.  Their sandwiches are also killer, yummy and nicely priced.  Will defintely visit here often.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "Just came here for the first time today. Great relaxed atmosphere, free wireless, and very good food. Had the Veggie sandwich, which was light buy very flavorful, and an AWESOME Green Tea Mocha smoothie. Check this place out if you're in the neighborhood.", "author": "Lee S."}
