{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "My go to spot in North Beach. Lots of Italian dishes and authentic Sicilian dishes. I recommend the spaghetti Trapanese, rigatoni alla norma, and the arancine.  And I know it's not Sicilian, but the carbonara here is especially good. \n\nI usually make a reservation but if you get there early (6:30 pm or earlier) enough there's usually no wait. \n\nFast, friendly service and the patio area is amazing, I've had a couple of parties out there.", "author": "Marco E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "A family-owned place that made us feel right at home.\n\nI hosted my sister's bridal shower in the back patio (~15-20 people, but it can fit way more, maybe 40-50?), and first of all, we barely needed to decorate the place because their default decor is smoking hot. Their walls are plastered with gorgeous murals, canvas pieces, greenery, etc. They have a bright red Vespa that permanently sits on display in one corner (which we ended up using as a photo prop). There were plenty of smaller tables on the sides for us to set up welcome/photo booths and store coats/purses.\n\nSecond of all, communication with Mario leading up to the event was seamless, whether it was discussing the menu, prices, or decorations. He was responsive, flexible, and made sure to loop in his other staff to our email thread when he was on vacation. Figuring out a family-style menu with him was a breeze - an assortment of salads and pizzas and mini cannoli for dessert, with coffee/tea on the side. \n\nService was spectacular and NOT overwhelming, and Mario made sure we had buffer time before and after the event to decorate and clean up. In fact, our event went over by a few HOURS, and all they told us was to just have fun because they didn't book any parties after us. (Though I felt bad and ordered a couple of snack dishes for the guests to munch on.)\n\nI'm writing this review months later, and I'm still shocked at what a great match this was. Mario and his staff took a lot of stress off my plate. I'm glad they were the ones I chose to work with.", "author": "Leta H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "No waiting on a Wednesday night. Service was good, petrale sole special was good, red sauce on the pasta was very good (and pasta is why we went there), house red wine was good. I liked the atmosphere. (We got a good people-watching spot up near the front window.)\n\nThe only down sides: the bread and beans served with the meal were very forgettable. And some of photos here on Yelp are misleading, as they apparently don't use nearly as much sauce on the pasta as they used to.", "author": "J R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-07", "description": "We had a reservation through open table at 9:30....we arrived at 9:26 and they were closed. They said they often didn't sync the computer with open table. We were not allowed in.", "author": "Shalee E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "The food, wine, and service was excellent. Glad we stopped here for a little taste of Italy", "author": "Keith Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "We wondered into this restaurant on an unusually hot day last Friday.  We sat at the bar for a cool Italian beer while we were waiting for our entire party to arrive. We had pleasant conversation with our bar tender.\nWe enjoyed a comforting authentic Sicilian appetizer; Panelle (garbanzo bean fritters); and Melanzana Siciliana (breaded and fried eggplant) ; our dinners were excellent especially the Gnocchi Pesto which were like little soft pillows that melted in your mouth. For dessert we had the recommended Spumoni Ice Cream Cake which was heavenly.\nOur Italian singing waiter was delightful and brought back many heartfelt memories. \nWe had a wonderful experience and would absolutely recommend this authentic Italian restaurant for its food, personnel and atmosphere.", "author": "Rose M. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Decades ago my parents discovered this authentic Sicilian restaurant. The food is always fresh and cooked to perfection. Tonight it was Arancini followed by the Petrale Sole with a homemade Cannoli and Cappuccino to finish it off. As delicious as the food is, what makes this place so special (besides the optional Italian tiled street side seating) is the exceptional service. The servers are professional and charming. Looking for a place to de-stress while filling your belly with some of the best in San Francisco? You just can't beat this place. Bring the whole family, you'll be happy you did.", "author": "Billy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "Molto bene!  Italian food hasn't been the same since we came back from Rome over six years ago but Union Sportive gives me hope.  \nOur server, a jubilant gentleman from near Naples, was excellent from the minute we set foot in the door.  He brought us waters quickly and chatted happily with us throughout our meal about our love of Rome and our mutual love of Peruvian cuisine.  \nOur meals were lasagna for the man, penne arrabiata for me, and a cup of soup for the little.  We also shared bruschetta.  Everything was excellent: pasta was perfectly al dente, all the seasonings were spot on, and produce tasted fresh.  It was definitely not Americanized.  \nThanks Yelp fam for this find.  It will definitely warrant another visit whenever we're in North Beach.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "My dinner companion said not to give this restaurant a five star as you will not take this review seriously.  So this is actually a 4.99 stars. Order the thinly sliced octopus. Everyone wants the recipe. Secret. Order the carbonara, chicken piccata and absolutely the tiaramisu. Same companion said it's thee best she has ever had. Bottom line. Real North Beach SF experience.", "author": "Mary Ann C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "I will admit that when I was looking through Yelp tonight for Italian food this was not my first choice...to be honest it was not even on my radar; I digress. I walked from the financial district to North Beach in search of some seafood pasta and the place I decided on had a line out the door, so I decided to walk around the neighborhood and see what else I could find. I walked by this place and there was a couple of open tables so I decided to pop-in; after looking at the photos on Yelp of course. Since I was a party of 1 I sat at the bar and watched the Diamondbacks and Giants game. After looking at the menu and being torn between two dishes - polpette and trapanese - I asked my server for a recommendation and without hesitation he said the trapanese with house-made sausage. I was sold. Bread and cannellini beans arrived at the same time as my meal. The pasta dish was out of this world. I don't think I have ever had an Italian meal this satisfying or complex. The pasta was cooked to my liking, the tomato and basil pesto sauce was light and not sweet, and the toasted almonds gave the dish just enough texture without it being out of place. The sausage had a good spice level to it. I walked out of there without feeling like I had gluten gut. Good atmosphere, great staff, amazing food. A+ in my book and I will be back in the near future.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "We love Italian food. I mean, from Italy. Let's be fair, the pasta were cooked to perfection: really Al Dente. The service was also very friendly and efficient. Strongly recommended if you are looking for an Italy like restaurant.", "author": "Nicolas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Our walking food tour stopped here.  The place is SO Italian that even the clocks move their hands when they tell time.  \n\nBased on their homemade meatballs, gnocchi, and panelle, I'd return.  \n\nBy the way, Panelle, which taste like thin potato wedges, are garbanzo beans pressed into the shape and size of those little triangle footballs you'd flick into a friend's L-shaped fingers making a goalpost.  Resist the urge to flick them so you don't get kicked out of the restaurant like, um, my friend.", "author": "Glen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "We had a truly lovely experience here tonight. Every thing was just wonderful. Delicious flavors, beautifully presented, and exceptional customer service from all of the servers. The restaurant is beautiful and elegant. Love the clean all gender restrooms. They really care about the food they put in front of each and every customer, and your experience being perfect. Not to mention my 16 year old daughter now has a huge crush on one of the servers who was very charming about it.  She's now decided this where she wants her birthday 17th birthday dinner to be!! So we'll be back for sure!", "author": "Julia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Came here with coworkers for lunch because we were craving Italian. The restaurant was pretty empty when we came in so we were seated right away. I couldn't decide what I wanted to order after looking at the menu but I finally settled for the carbonara. My coworkers chose the seafood pasta, the ravioli, and the other one requested a recommendation from the waiter which turned out to be the gnocchi in a pistachio sauce. They served complimentary bread with white beans prior to the meal; it was delicious. All of our pastas came to the table at the same time and it was all good. The spaghetti in my carbonara was cooked al dente. I also tried the gnocchi which was good and the pistachio cream sauce was amazing. The ravioli was pretty good too. Overall, I would definitely come back here to dine again and try all the other pastas on the menu and the service here is really good too.", "author": "Victoria Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "It was ok. The Caesar dressing was too oily, the Alfredo sauce was too thin.. There are better place to try.. \n\nThe Gnocchi Bolognese was good, but I wouldn't come back just for that\n\nThe service was fine, no issue there", "author": "Douglas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "The food was fabulous! We had a rough experience with a grouchy waiter, but the manager was very pleasant. I'd definitely come back!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Amazing food with amazing service! Very authentic Italian food! It's a must if you are visiting San Francisco.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Original U.S. Restaurant is a wonderful experience--both for its food and service.  This is a real, old-school Italian restaurant set in the heart of in North Beach, the heart of San Francisco's Italian neighborhood. I have been going to this restaurant since I was a kid and its  menu continues to  feature classic U.S. Restaurant Italian dishes plus family recipes from Sicily. \n\nThis week we held our office Christmas Holiday Party at the Original U.S. Restaurant (which stands for \"Unione Sportiva\" after the fact that the restaurant used to feed SF's Italian American athletic clubs in the late 19th century).  The food is as great as ever, the wine selection from both Italy and California was wonderful, and the friendly, loving service makes you feel like you are eating at someone's home.  It was an honor to be greeted by one of the owners,  San Francisco Giants executive Mario Alioto, who came by to say hello to our table. The Alioto family and a member of the restaurant's founding family,  Alberto Cipollina, own the place.  If you want to eat great homemade Italian food in a traditional San Francisco restaurant this is the place to come to. And the food is reasonably priced and the portions are hearty. \n                                                                                                                                                                                                                                    \nOur group was especially fond of the following dishes that I list below: I have to put in a special word for the Chicken Milanese, homemade grilled Sicilian pork sausages, Gnocchi in pistachio cream sauce, and the Spaghetti alla Carbonara. Simply great!\n\nPasta\nSpaghetti alla Carbonara (pancetta, eggs, and parmigiano) \nRavioli Bolognese (meat filled ravioli in meat sauce) \nGnocchi al Pistacchio (homemade dumplings in pistachio cream sauce) \n \nFish/Pesce \nPetrale Sole Piccata \n \nChicken/Polo\nChicken Milanese \n \nMeat/Carne \nVeal Marsala \nVeal Piccata \nSalsiccia alla Griglia (homemade grilled Sicilian pork sausages) \n \n \nDesserts\nTiramisu \nCannoli Siciliani \n\nEnjoy!", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Far from being just a restaurant, the Original US Restaurant is civic treasure in San Francisco's North Beach. Everything on the menu is lovingly created with attention to detail and an artistic flair that culminates into an unforgettable dining experience. The staff is friendly, knowledgeable and treat you like family. The ambiance, especially of the outside tables on sunny days ~ is superb ~ it gives you a taste of the \" Dolce Vita\" right in the middle of the City. The restaurant attracts visitors from all over the world because of its location~ but, it also attracts a substantial loyal following among native San Franciscans like myself, who treasure every outing to this bastion  of culinary excellence.", "author": "Armando C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "Sadly, I was underwhelmed.  I hadn't been to US since they moved over 3 years ago and I prefer the old place across the street.  The service was excellent, however, the food was just your average North Beach fare.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "Really nice restaurant that is pretty easy to get too. Friendly staff and food came out quickly. Prices are a little expensive, but food was good and we had some to take home. Pizza was very good and would feed two people.", "author": "My U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "The food is great! Pizza would be my best option to choose if I come back. Loved the place but the service is slow and not as sharp as it could be. But great food overall!!", "author": "Nicole I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "We had an amazing dinner here the other night.   As authentic Italian as you can get.    Tony was awesome and runs this place like a pro.    We will be going back again when we are in town!", "author": "Bill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Delicious food and great service! If you don't like this place, you are just hard to please.", "author": "Lamia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "I have been searching for great meat cannelloni since 1989 when Jovanelos closed due to the quake.\nWell Cannelloni Tuesday at US Restaurant is my new favorite. Took my son Vince and son in law Joe and we had a great relaxed lunch. Service excellent, atmosphere old SAn Francisco.  House red was very good and sour dough delicious.  But we came for the cannelloni and were not disappointed:  large portions that actually melt in your mouth.\nOnly issue is parking:  I found street parking but you have to hunt.\nGreat food and great time!!!", "author": "Mike S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "Ordered online. Took 2 hours. Alfredo pasta was crushed on the bottom of the bag. Wasn't the worst pasta but was not even near 16 dollar value. Honest value I'd attribute is about $1.50. Ordered a US parm, the meat is not edible.  Can't even tell what kind of meat it is, it has a reddish grey color. Will try elsewhere next time.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-15", "description": "This is U.S restaurant alright! People who say true Italian experience either haven't had Italian food or this is their first time eating Italian.\nI ordered Spaghetti alla Carbonara and It was one of the bad ones I have ever had. If you want to compare same food, check the difference between carbonara in this restaurant and Scusa Italian Ristorante lake Tahoe.  food was barely eatable. The whole experience was pretty underwhelming considering the price, portions and most importanlty taste.", "author": "Chandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "First time in little Italy and I ended up at the original U.S. Restaurant. I didn't read the reviews on the place but it looked like a decent place. Food was very similar to Olive Garden and not as I expected. Overall was a good experience, nice ambiance would have given 5 stars. But kitchen took extra long to bring the food to the table.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "While in the city we were yelping good Italian food.  The restaurant we were originally going to had a long wait so we walked and found the US Restaurant.  We were seated right away and got started with the marinated octopus which was delicious.  My main course was the Spaghetti  Polpette and my husband had Veal Marsala with spaghetti bolognese.  What we find when we dine out is that chefs are usually light on the seasonings.  Both dishes were seasoned well, the ingredients taste really fresh.  I could taste the home made goodness in the pasta sauce.  Everything taste amazing and the customer service was absolutely wonderful.", "author": "Toblessedtobestressed G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "This is one of my favorite parts of coming to San Francisco. My 1st time as a kid we just happen to stumble upon this place. I remembered the ladies did not write down our order and the cashier still got it right.\n\nFast forward 25 plus years and the guy still did not write down anything and nailed it.\n\nThis was my 4th visit over three locations of this place. That feels kind of special in a way. The food is AWESOME!! I always go with the basics and do a 1/2 and 1/2 with spaghetti and ravioli. Everytime its better than before. Im glad my family tries other things and I get to taste other menu items too.\n\nNow that Im older and can appreciate the coffee/espresso too, its also pretty amazing.\n\nI can think of 1000 reasons I love San Fransisco and this one of the top reasons.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "When other restaurants in North Beach were closed on the New Year's weekend, my friends and I decided to eat at Original U.S. Restaurant.  I was not sure what to expect, but overall I found that there are a few gems at this restaurant that may be worth ordering over others.\n\nThe Good:\n- Trapanese Pizza (fresh tomato, mozzarella and Sicilian sausage) \nDelicious! My friends and I were probably not expecting much, so this was a pleasant surprise.  I loved the spice to the Sicilian sausage, and the light tomato sauce was smooth.\n- Gnocchi with pesto \nOK, it is not on the menu, but I was delighted that they were flexible in arranging for this! Their pesto sauce is not creamy, but rather just your typical oily pesto.  Their gnocchi are fluffy and light, as they should be.\n- Melanzana Parmigiana (fried eggplant with tomato sauce and mozzarella) \nMy friends ordered this to share, and I got to sneak a piece. Great flavors, and I especially appreciate that they know how to make tomato sauce that is not overpowering or too rich.\n\nWouldn't order again:\n- Gnocchi al Pistacchio (homemade dumplings in pistachio cream sauce)\nSo, this sounded exciting and delicious, but it just did not do it for us.  It was a bit bland.  If you are going to order gnocchi, ask for the other options.\n\nWe also had their tiramisu and we loved it!  Considering that one of our friends is Italian, is spoiled by the homemade stuff, and they liked the restaurant... that should say something about this place!\nAnyway, give this restaurant a chance, and you might find out that you'll love it too.  Great service, great food.", "author": "Cristina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Wonderful spot for locals.\nGreat service and the food was superb.\nDelicate and flavorful lasagne.\nThe spaghetti pesto with Sicilian sausage was not something I would normally order and I am glad I did.\nSausage was sweet with fennel and savory pork- not greasy.\nThe waiter shared history of the restaurant and neighborhood.\nThe mural on the ceiling is form 1926 and from the bakery that used to be in this spot.\nLook for the cakes and pastries in the mural.", "author": "Lisamarie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "The Original US Restaurant is not.  \n\nThe original was formerly on the opposite side of the street.  Even the second version of the original was in that location.  \n\nThis time, it's crossed Columbus and, to my mind, has the best looking space yet.  \n\nI wish that I loved the food more.\n\nRestaurants like this - with pedigrees dating back to the 1890's - are a welcome reminder that you can still enjoy a fun meal and leave with a little cash in your wallet.  That's not to say it's inexpensive but rather, right-priced.  The menu caused me to smile, not gasp.\n\nI liked everything about the busy, comfortable space, the expansive Italian American menu, the nightly specials, and the get-the-job-done staff.  I'd even happily return for all of those reasons.  Next time though?  I'd order differently.  \n\nI started with an Arancine (rice balls filled with mozzarella and meat sauce, $10) appetizer.  Two big balls, each with a different filling, looked like the perfect start to a comforting meal and they would have been, had one not been cold in its center.  \n\nThe Melanzana Parmigiana (eggplant, $14) had other problems.  It was tasteless.  A slew of red pepper flakes were self-applied but couldn't mask the fact that what sat below was quite uninteresting.  \n\nA small part of me thinks I ordered wrong while the reasonable part of me believes that's not so.  If I returned I'd do so happily, order differently, and suspect I'd be just as underwhelmed by my meal.  Still, it says something that I'd be willing to give it another try.  \n\nI like the place and what it stands for, hearkening back as it does, to days of yore.  I'd just like it a little more though, if they'd update their flavors for today's palates.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "Located in North Beach on the corner of Vallejo and Columbus makes for easy access. The restaurant has a very soothing interior, darkly lit and comfortable. The menu is classic Italian and more and there is a LOT to choose from. I decided to play it safe and go with the Meatballs and fries-delicious! The meatballs are rich in flavor and have the perfect texture. I should add the accompanying sauce was A+ as well. And the fries were perfect, to match. Only ding is I got two albeit large meatballs on the sandwich, so I was left with some bread. However even this ding is compensated for by the price, at 11.50 two meatballs is about right. As I have paid more elsewhere. The eatery is one of the better I have tried in North Beach.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Celebrating in the Italian Festival this weekend, we happened on the BEST restaurant! U.S. Restaurant was busy and lively, and they welcomed us easily and were shown to a great seat. The waiter gave us menus and asked if we had any questions. I asked about some easy accommodations, and my Grilled Chicken Sandwich order was taken. The gnocchi with pistachio was my husband's choice, so it was all taken care of. Quickly we were served a delightfully light and refresh appetizer of cannelloni with celery and red onion in a very light dressing. These were perfectly accompanied with fresh French bread - the perfect bites before our lunch was served!\n\nThe gnocchi was light, airy and flavorful, while being enrobed in a rich, full-flavored cream sauce highlighted with pistachio kernels. YUM! - and that is just from a tasting! As my sandwich was PERFECT, and totally delightful! The chicken breast was grilled to my complete satisfaction, and was nestled on a fresh French bread, while adorned with tomato and red onion. OMGoodness, it was the BEST sandwich ever! So well cooked and full of fresh flavors! Alongside was a fresh and sweet salad - beautiful salad greens with onion, grated carrots and large very \"tomatoey\" tasting tomatoes. Absolute perfection! \n\nThis was a GREAT way to celebrate Italian Festival - or any day really. We were in the City for the festival, and could not have been more happy and satisfied with our choice. Salute!", "author": "Rhonda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "We almost missed this treasure... so thankful we listened to a local tell us that this is where we need to go! Incredible food and the service was wonderful. The owner was onsite and was so kind. We went back a second time on our visit and they recognized us... so sweet! The meatballs are beyond incredible. Side note: we almost skipped this place because of the name... we thought the U. S. was an American/Italian thing. Absolutely not the case.", "author": "Alisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "U.S. = unione sportiva.  I had no idea why it said U.S. until I arrived.  \n\nFood = good. \n\nTabletop bread with beans = awesome.  Yes, they have great balsamic vinegar and olive oil, too.  The bread is a bit dense, so don't load up too much.\n\nArancini = delicious. Two in an order. One was ham and cheese and the other ground beef and peas.  I preferred the beef and peas. Crunchy outside, soft inside and full of flavor. Perfect for two people but enough to share for 4 if you just want to sample a bite each. $11.00. \n\nU.S. Salad (romaine lettuce, tomato, olives, red onion and white beans) = good. $ 9.00\n\nMixed greens (mixed baby lettuces, shredded carrots and tomato) = good.  $ 8.00\n\nCaesar (romaine lettuce, home-made caesar dressing, croutons and parmigiano) = excellent. Crispy romaine, creamy but not overly salty. $11.00 x2\n\nSpaghetti Polpette (homemade tomato sauce with 2 meatballs) = The meatballs were moist and full of flavor. The dish hit the spot for him. $17.00 \n\nGnocchi al Pistacchio (homemade dumplings in pistachio cream sauce) = my friend's dish and he enjoyed it. $21.00\n\nSpaghetti Pesto Trapanese (fresh tomato and basil pesto with toasted almonds) with Sicilian sausage =  my birthday friend's dish and he was pleased. $18.00\n\nOsso Buco with risotto = my dish, which I actually did not enjoy.  The veal shanks were tender but lacked flavor, and the risotto was very mushy.  Sorry, but this was disappointing. I ate most of the shanks but had to leave most of the risotto on my plate. I'm usually one to take home leftovers but this just wasn't worth it. $24.00\n\nCoke = $3.00\nSparking water = $4.00 (small size).  \n\nThey have a reasonable wine menu, with a few beers.  But we didn't imbibe during dinner.\n\nService = excellent. Friendly and attentive.  We had a late dinner, reservations at 9:30 p.m. and luckily for us (not for them) it was quiet by the time we ordered.  It was very quiet for a Saturday night. But several large and loud parties had just departed as we were waiting for our table. \n\nSeating = 2-tops, 4-tops, and if you've got a bigger party, they'll rearrange to accommodate your party. \n\nPrices =  moderate. Dinner for four came out to $148.99.  \n\nWhile I was very disappointed with my choice of entree, I think everything else was great.  I'd definitely recommend this place for a nice meal without the stuffiness.  Reservations are not required but I'd recommend it for the weekend", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "We just had our wedding rehearsal dinner at Original U.S. last Friday and we could of not chosen a better placed then this!!\n\nWe had a very large party and everyone were happy with their food and experience in the end. The food was wonderful, prices are very reasonable and most of all great service and such an amazing and friendly people! We were very happy with our choice and we will definitely be going there again! Very accommodating with a large party! Thank you for giving us such a wonderful experience and making our night very special!", "author": "Elly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "Came here for my best friends birthday, 2/11. \n\nThe Vice President of the San Francisco giants, forgot his name, owns this restaurant. He was a nice fellow, the walls of the place were covered in photos that included himself which is how we recognized him. He even let me pee in the men's restroom, what a pal.\n\nThe service was 10/10. Our waiter, though we didn't get refills, was so kind and well mannered. I enjoyed his presence when he checked up on us, unlike how are usually feel toward servers at restaurants.\n\nThe food was OK. We found that the food was somewhat salty, and pretty underwhelming. It's not the most expensive restaurant in the world, but it's more than you want to pay, for the quality that is delivered. \n\nThe decor and staff were very enjoyable but sadly I won't be back. We spent 35 mins finding parking for this, lol.", "author": "Madeleine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Hi Dominic excellent service delicious food. My lady friend said music put her to sleep.\nAnita & Jason", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "This was my favorite restaurant I visited while in SF. I had the best shrimp and scallop pasta I've ever had. The shrimp was cooked perfectly and the sauce was so delicious! Definitely have to come back!", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Was recently here for a First Communion luncheon and I promise I'm not being biased just because I know the person who works here and who also happened to be the one who hosted it but everything was amazing! We had the beautiful outside patio section for the party which was setup very nicely. The restaurant itself is nice, with a few tables right outside in the front where you can people watch while eating.\n\nWe had a set menu with Panelle (garbanzo fritters), Antipasto Plate, Antipasti di Mare, Rigatoni Bolognese, Fusili Trapanese and I chose the Halibut Picatta for my entrée. I truly enjoyed every single dish and the service was great. Definitely felt like I was in Italy for a minute. Plan on coming back here in the near future.", "author": "Candice J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Just the waiter's kindness was enough to warrant a five stars! Friend and I were just sitting outside enjoying the night scenery and the waiter and manager came out and let us hang out at an empty table-- if it weren't for a birthday reservation, would come back here for sure!", "author": "Victoria W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Absolutely delicious italian food like my nonni used to make and she was an italian immigrantI I highly recommend the spaghetti all carbonara and the cannelloni!  My friend ordered gnocchi and i got a taste, delicious! We shared a fabulous tiramisu for dessert and it was one of the best I have ever had. The service was great, very attentive guy with an italian accent which added to the authenticity of this place. What a great meal, I cannot wait to go back again!", "author": "M T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Got here at 5pm on a Saturday and had our choice of tables for the 2 of us, (though we made reservations just in case), and easily parked a lot 3 blocks away, so all was good.  The restaurant had an old-timey feel that was homey, I hope this place stays here forever, truly a San Francisco gem.\n\nThe bread was o.k., not warm but good with the premium olive oil and balsamic vinegar at the table.  Like another Yelper said, the portions here are large, so don't fill up on the bread!\n\nGot a cup if minestrone soup which was the soup of the day, and it was delicious, the soup was homemade and rich with long-cooked soup flavor and vegetables, I'm going to have to order this every time I come here and a cup is just enough.  Ask for a sprinkling of parmesan cheese, makes all the difference in the world.\n\nGot the Melanzana Siciliana, fried eggplant appetizer, (fried, breaded eggplant sticks with a cup of tangy tomato sauce).  The eggplant sticks were amazingly light, but permeated with the taste of fry oil, so next time I'd skip this to save room for the hearty entrees.\n\nTasted the Spaghetti Pesto Trapanese with homemade sausage and slivered almonds.  The sausage, though flavorful with a hint of fennel, was too salty for me, but my friend, who is Sicilian, says it's just like his Grandma made it.\n\nI ordered Linguine Porticello, pasta with scallops, shrimp in a tomato sauce with sliced black olives and capers & I loved this.  The seafood was very fresh, I just could not stop eating this!  Ended taking half home to have some room for dessert, (I'm too old for a \"2nd stomach\" to kick-in).\n\nOrdered Italian Ice Cream with Spumone and I made a silly mistake.  Per an untitled Yelp picture, I thought it would be the white cake with cream and candied orange & lemon slices on top, but it was a sliver of ice cream cake with pistachios on top, (which to me in the Yelp picture looked like a cheesecake).  Next time I'm skipping dessert in favor of ordering another appetizer, like the Arancine.  Will definitely be back with a bigger appetite and a tighter eating strategy!", "author": "Johnnie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "I ate here last night, when I come to SF, I always eat Italian in North Beach.  The restaurant that used to be in this spot was my favorite, but I'm happy to say this restaurant is now my new favorite!\n\nThe service was fast, server was great. The restaurant had a real family restaurant feel with elegance. \n\nI had chicken parm with a side of pasta, it was excellent!  The breading they use is light, tasty, and is cooked to perfection. I also tried my friends gnocchi which was really good.\n\nThe bread they serve is so-so.  I would've liked better quality bread, perhaps warmed.\n\nDon't let the name draw you away from this\nplace.  The \"U.S.\" stands for Unione Sportiva NOT United States.  I learned that's because of their role in the late 19th century of feeding and hosting Italian American athletic clubs. Cool history!", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Delicious! Was going to do seafood and walked passed this restaurant and decided to change it up. We ordered the Regaleali wine and it was so good. The bruchestta was amazing. I recommend it. The spaghetti dishes were so good. So much flavor. This restaurant makes you feel like your in Italy. The server was fantastic. He was quick and super nice and helpful. I recommend this restaurant to anyone.", "author": "Rebekah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-12", "description": "Sometimes you feel like an old-timey Italian dinner in North Beach, probably when the moon hits your eye like a big pizza pie. The old location was an institution I never patronized even though I had heard it was one of Robin Williams' hang-outs when he was a struggling stand-up. If I wanted something with a red sauce when I was younger, I'd have gone to Gold Spike or Capp's Corner for spaghetti and meatballs and minestrone, but those places have bit the dust. It was with some unintended expectation that the newly renovated Original US Restauant would bring back some of that old-timey feeling courtesy of an Alioto, Mario this time. It did but not necessarily in a memorable way for me and Jamie W.\n\nWe came early on a Saturday night, around 6PM when there was only a family of four eating next to the window. There was certainly plenty of staff getting ready for the dinner rush which did start to trickle in as soon as we sat down. I looked at the vintage photo on the wall of what looked to be a swimming club (photo: http://bit.ly/1PQImtp), and it turned out to be part of \"Unione Sportiva\", a league of local Italian-American athletic clubs over a century ago. That's where the \"U.S.\" in the name came from, which was news to me since I thought it was a patriotic moniker. We started with the $12 U.S. Caprese, which seemed overpriced for four thin slices of not quite ripe tomatoes with not quite fresh mozzarella slices on top (photo: http://bit.ly/1SLj2Yv).\n\nThis classic salad was accompanied by the hard-crust Italian bread that came with cannellini beans, the most interesting touch of the evening as the beans made for an effective spread (photo: http://bit.ly/1PQI2uC). Jamie ordered the $19 Spaghetti alla Puttanesca, which made mention of a tomato sauce but appeared devoid of it. The pasta was accounted for as were the capers and olives. The anchovies were more than present as they lent an unwelcome fishy flavor to the dish that no amount of grated Parmesan cheese could hide (photo: http://bit.ly/1o5j0Nu). I went for one of their daily specials on a Saturday evening, the $21 Osso Bucco with Risotto (photo: http://bit.ly/1Xn6Fk5).\n\nIt just missed the mark as the veal shanks were hefty but not quite tender enough with the risotto somewhat overcooked as it was on the mushy side versus al dente. We decided to share a specialty dessert since we were, after all, in the heart of North Beach, the $8 slice of Cassata Siciliana. I didn't know what it would be, but the name sounded like an opera. It came out as a slice of sponge cake moistened with some kind of liqueur and layered with a slightly frozen ricotta cheese. It had a very sweet vanilla filling, and it was encased in marzipan and decorated with the type of candied fruit you would expect in a fruitcake (photo: http://bit.ly/1TcfkFu). Should have went for the spumoni.\n\nFOOD - 3 stars...old-timey Italian with no frills but not so satisfying\nAMBIANCE - 3.5 stars...a big place by North Beach standards\nSERVICE - 3 stars...nice enough but a little bit on automatic pilot as they wait for the big parties to come in\nTOTAL - 3 stars...a middling return for a North Beach institution...maybe that was the expectation?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Great food! Great service! Casual dining! I usually order the pesto and ravioli \nThey USE TO make manicotti on Thursday's \nI wish they still had it! Still good restaurant  tho!", "author": "Roxy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "After perusing several blocks of restaurant menus, we decided on this restaurant based on someone's recommendation as they were leaving. It was a great decision on our part.\n\nI had one of their specials: risotto with shrimp and artichokes. The risotto was made in a tomato-based sauce, the shrimp (6) were large and cooked to perfection, and the dish was very generous with the artichoke slices. It was the best risotto I've had.\n\nMy date had another special: chicken cacciatore. I had a bite and it was very flavorful. He thoroughly enjoyed it.\n\nThe reason for just 4 stars? I love a good crusty bread loaded with butter with my pasta. They served bread and marinated white beans. Both were ok, but just not my preferences", "author": "Laurie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Third time's a charm.  After 2 previous locations in North Beach, U.S. Restaurant has finally found, what I believe to be, the best location of all.  \n\nThe U.S. in the name Original U.S. Restaurant stands for Unione Sportiva, because of its affiliation w the first 3 main Italian American Athletic Clubs in SF back in the day.  Those 3 clubs were combined into one in 1936...the SF Italian Athletic Club that we know today (and located a couple of blocks away on Stockton).\n\nFor me, it's all about the meatballs or the chicken parmesan.  These are the meatballs that are served at AT&T Park!  I know the veal piccata is a standout, as well as the ossobuco, & the linguini w clams.  And no matter what, my man always orders the ravioli bolognese as his side dish.  \n\nThis is a true \"Italian Family Dinner\" restaurant.  Lots of food, surrounded by your peeps.  Kids?  Not a problem.  The more, the merrier.\n\nRequest the server, Renee, to wait on you.  You'll be getting one of the best servers in the neighborhood.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-12", "description": "Not quite sure what the appeal of this restaurant is any longer.  My husband and I took our teen niece and nephew for lunch last weekend and we were not impressed with the food.  The staff was kind and helpful.  But, I don't go to a restaurant for kind and helpful; i go for food.  To start off, I am not sure where they get their bread but, they are the only Italian restaurant where I did not get chewy, crunchy crusted sourdough. We had some kind of dense version. Not tasty at all.  And, no butter as an option.  My clams and garlic were boring. They needed A LOT MORE seasoning...garlic for sure and parsley.  My niece had ravioli which were barely stuffed with a lean spread of not so tasty pork.  My husband liked his picatta but, not the pasta.  I am sorry this re-opened super star restaurant isn't what it used to be.  I am bummed cause' I wanted to show off North Beach eating to the kids.  Thankfully, Beach Blanket was a fabulous show following the lunch.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "There are restaurants and then there are life experiences.\nTonight was one of those that shall forever be remembered as a happenstance life enhancing experience.\nMy colleague and I decided to walk around the North beach area after a nice dinner (another review) but not this one.\nSo we walk down Columbus and I have a \"zap\" about the original U.S.\nI said let me poke my head in and have a look. We decide to enter after hearing some nice jazz wafting through the air and from our viewpoint a lovely welcoming restaurant /bar.\nUpon entering two very nice gentlemen turn towards us and one stands up asking which group are we with? Now please note that there is a table set for about 30 people so clearly they are expecting someone or some group of folks.\nI explain, no no we just wanted to pop in for a drink and he says well great! Perhaps we will join you! I explain we are nobodies and not with any group and he says what does it matter? Let's have a glass of wine!!!\nWell, it turns out that he and the other guy own the restaurant! Holy cannoli!\nWell now you can well imagine this is a great glass nay bottle of wine and some very good company. Anyone know or heard of the baseball team called The Giants? Well you've come to the right place!\nIf you want a great setting, outstanding food, surprisingly good prices then this is a must stop!\nLike my colleague and I, you will be pleasantly surprised and if a baseball fan...thrilled \nTrust me on this one.\nCheers Mario! You made our evening.!", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "Pretty good Italian good, 3 1/2 stars if Yelp allowed this.  Stopped by here on a slow lunch hour on Dec 29 to try one of their Sicilian specialities.\n\nWe ordered the Rigatoni alla Norma, that has tomato sauce, eggplant and ricotta cheese.  The highlight was the flavor of the tomato sauce which was just right, not too bitter and not too sweet.  Our waiter was very nice and helpful.\n\nThe name of the restaurant is a little confusing until you know the story--frankly it sounds like it is trying a little too hard to be patriotic.  Surprisingly \"U.S.\" does not mean \"United States\".  They have the full story on the menu at the restaurant.  This place has been around North Beach for over a century at different locations and the story is worth the read.", "author": "Bob F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Some of the best Italian I have ever had. Service was excellent and the food was even better. Definitely recommend!", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Great experience, casual yet elegant atmosphere, excellent service!\n\nWe ordered the Carbonara, the gnocchi, and the seafood linguine with marinara. All were fresh, delicious, and the portions were very generous.\n\nThe menu features a good variety of authentic options, and the staff was friendly and attentive. \n\nOh and make sure to grab some dessert! The tiramisu was fantastic.", "author": "Case B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Whether it be for a date or for taking out clients you need a menu that offers high quality options for those that want a decadent meal as well as for those that want a healthier meal.\n\nThis is therefore a perfect restaurant. \n\nOn one extreme the Carbonara pasta was the best I've ever tasted while on the other extreme the salmon and vegetables were prepared lightly but with plenty of flavor. \n\nHigh end ingredients at every course.\n\nThe cannoli are made in house and worth stopping in for on their own accord", "author": "Patrick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "For my birthday earlier this summer, a friend asked me to pick a dinner place.\nAnother friend who remembers eating at places like these in North Beach in the good old days... Little Joe's, Caffe Sport, New Pisa, Caesar's, etc.\nMy memories of U.S. Restaurant are from their 'original' location at the triangle corner of Columbus, Stockton, and Green Street now occupied by Panatrei Restaurant.  It was one of my regular Friday lunch and dinner rotation spot as they served daily special entrees and soup.  The Friday soup was Manhattan clam chowder, served in a large hearty bowl with chunks of clam pieces.  My entrée was a half/half order of their petrale sole and fried calamari with rigatoni.  Served with locally baked bread, this meal usually yielded another half meal for me; I'd sop the remaining sauce from the rigatoni with the bread because, yes, it was that good.\nBack to the present, U.S. Restaurant closed here and then reopened a few blocks away on Columbus across from Rose Pistola.  Dining there once on their counter, in looking at the menu and after dining there, it just wasn't the same.  \nFast forward about eight years later, we came here on a Wednesday night.  After a quick scan of the menu, here's what we tried:\n\nAppetizer\n1) Steamed mussels (https://www.yelp.com/user_local_photos?select=PsY0mu07NvE84nBUYNdaLg&userid=saJuyv784apZzH--psHZ3Q) - Nothing memorable other than a.  Mussel shells all opened except two, b.  Toasts made for great dipping for the wine broth, and c.  Portions were decent.\n\nPasta\n2) Tortellini carbonara (https://www.yelp.com/user_local_photos?select=vLPbJm8VLCeJXo1WQbDKDA&userid=saJuyv784apZzH--psHZ3Q) - If you are a cheese and cream sauce lover, you'll enjoy this one.  The peas and ham offered a nice change from the other two dominant flavors.\n\nPizza\n3) Quattro Stagioni (https://www.yelp.com/user_local_photos?select=_YlIhOdiZRZ9MpIovoTpTw&userid=saJuyv784apZzH--psHZ3Q) - Very colorful with the ham, artichoke hearts, and mushrooms.  The crust was neither thick nor thin and the ingredients were good, but there wasn't much flavor sauce wise.\n\nWe were one of four or five occupied tables and our waiter was very friendly and enthusiastic (loved the Italian accent).  Besides the above, we were given a cup of bean salad, a vinegary mix of garbanzo, lima, and green beans which opened up our palates for the meal.  I spread some on my bread which quieted my hunger pangs as they prepared our meal.  I asked my host to pick two of the three dishes while I selected the pizza.  Everything was okay, probably a 3.5 in my book, touch better than just okay, for what we ordered.  Would have considered the short ribs, but didn't know whether my host was big on meats.  We had a bit of pasta and almost half of the pizza to take home, which I brought for my family for the next day.  They enjoyed the change of pace from our neighborhood pie place.  \nHard to review a place when expectations and memories are factors judging the experience.  I will come back to try other things with the knowledge that it won't be the same as before.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Amazing, authentic, homemade Italian food. Prices are very reasonable and portions are large. I had the linguine with mussels, scallops, calamari and shrimp in white wine sauce and it was heavenly. They are in a new location and it's lovely. The staff is friendly and our server definitely knew the menu. Highly recommend this place for dinner.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Ok Italian food here.\nComing from new York, l tend to be highly critical of Italian food.  Compared to NY and Rome, this is just meh. My veal was a little tough, but these are high prices for medium quality.  The gnocchi were very light but usually with pasta you get a lot more for your money. Flavors were there, service was slow. 5 o'clock and they had 1 waiter working  every table in the restaurant. With so many choices on Columbus I don't know how this place rates so highly.", "author": "Lawrence G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "In tonight for the third time in the last six weeks.  Service was friendly and prompt, fair prices on the wine list the food was great.  I had the chicken marsala, which was delicious. Polenta is only available on Friday nights but he scalloped potatoes were perfect.   Highly recommend the bruschetta and the pastina in broth.   We were a party of four and everyone enjoyed both the ambiance and the meal.  The blood orange sorbet was tangy and tasty.", "author": "Rich C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "My family and  I were in San Fran for a few days and heard good things about his place.\n\nUpon arriving we were promptly seated and given bread and some delish beans to spread.  We got the house red and ordered the rice balls as an app.  It was all very tasty.\n\nFor our main courses we had Chicken Parm, Gnocchi Bolognese, Fehttuchini, and Ravioli.  For desert we had choc gelato and Tiramisu.   All in all the food  and service was very good.\n\nThe reason for only three stars (would have been a 3.5 if I could) is that the place was not particularly lively, the food portions were on the small side for the price, and there just seemed to be something missing....don't know what, but something.\n\nIf you are looking for good food and service then by all\nMeans enjoy as we did.  It could be we caught it on a slow night but we were hoping for a livelier experience.", "author": "Vinnie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Everything was good.  Service is very nice.   Food is solid and tasty.   Pastas were wonderful.  My son had Spaghetti and meatballs - great.    I shared rigatoni with eggplant also great and authentic Italian.  My wife had pizza .    Dough was too dry for me but also good.   This is in a very touristy area but felt authentic.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "We happened upon this spot while walking around, enjoying the North Beach Fair. One word: outstanding. The true test of an Italian restaurant is the quality of their pesto, and this one was fresh, fragrant delicious! The tomato bruschetta was delicious, and even the humble spinach salad was excellent. Bravo!", "author": "F. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "I went to dinner with a large group of people from work.  The gnocchi was fantastic and service superior.   Quality to price is great.  \n\nIn an area full of Italian original us deprecated itself.  Definitely Troy worth a try.", "author": "Dan Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Great fresh food and great service. True Italian experience.\nThe Cunsato Alta Trapanese was great.  Balanced with fresh tomatoes, cheese, and just enough salt from the anchovies.\nThe pasta and meatballs were homemade and the sauce was perfectly light.\n\nThe Cappuccino was also great.", "author": "Joel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I haven't been here since they moved. Still great. The best pesto sauce, great salad dressing, and delicious veal. Everything is large enough to share, so we were able to save room for yummy desert. It's fantastic that they are still as good as ever. There are a couple of parking lots on Vallejo that are only $4 an hour, only 2 blocks away. Some places are charging $15 flat fee!", "author": "Bob P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "This is the 3rd location in North Beach for the U.S.  (At least in the last 50 years).\n\nWe first went there when it was in the triangular location at Stockton and Columbus.  It then moved down Columbus a few blocks North and then evidently suffered a flooding which closed it up until it recently opened at the new location on the east side of the street.\n\nAfter it moved to the second location we had several disappointing  meals there.  The manager and service was less than stellar and the food was also subpar.\n\nOn our frequent trips to the City we decided to give it another try in the new location.  It was lunchtime and we were feeling like a San Francisco hamburger served on an Italian roll which we had many years before at the old location.\n\nIt was as good as I remember it.  Most importantly, the waiter was friendly and efficient.  The orders that were delivered by our table looked equally good, especially one order of pasta pesto.\n\nThe clientele on our visit appeared to be a mix of locals and tourists.  You can always spot a North Beach local.\n\nThe U.S. will now be on our to do list of restaurants when we come back to San Francisco", "author": "Bradley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Best calamari in the City. Salmon had grill marks that were too burnt to eat.  Beer/ wine only. No amaro. Decent spot if you are in North beach.", "author": "Gee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Excellent food! Tons of tourist traps around North Beach, but this is tasty.\n\nService was just ok - could have used a bit more attentiveness from our waiter.\n\nAntipasto and veal piccata were great", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "We enjoyed our first visit to Original U.S. Restaurant last night and are already looking forward to our next meal there. It was hard to choose from the variety of dishes offered but we ended up trying the Lasagna and U.S. Parmigiana, some of our very favorite dishes and they were prepared to perfection! Our meal started off with Panelle and Bread with Marinated Garbanzo Beans, both very enjoyable. The service and atmosphere were excellent I'd highly recommend Original U.S. Restaurant to anyone looking for a delicious, traditional Italian meal in the heart of North Beach.", "author": "Lynn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "Kinda feel bad that this place wasn't packed on a Friday night, cuz we had a great meal.\nIt's not dressed up Italian. It's home grown down to earth Italian, so if you're looking for super fancy accoutrements you're best to go to somewhere lease... maybe that's why it was quiet- people are looking for touristy, American flamboyant Italian with a schtick, like the stinking rose.\nWhat we got was a tasty Caesar salad.  Plain, but fresh.  Some bruschetta with Ripe and delicious tomatos.  Probably the best clam linguine out there.  A huge portion of carbonara with mounds of pancetta.\nDefinitely a must try!", "author": "Roni L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "Celebrated a family members birthday here.  Delish authentic plates.  Enjoyed the festive atmosphere, the wait staff were very personable, friendly and attentive.  The meals were enjoyed by all in our group.  Antipasto platter was ample and variety of items served were true to my Italian heritage.  The De la casa salad was tasty and filled with goodies.  I had the sole dore.  Two nice sized fillets, mashed potatoes and fresh veggies.  So good!  The bolognese sauce was enjoyed by the table on pasta and lasagna!  Will definitely return to this North Beach staple.  With all the older style restaurants slowly disappearing due to high rents....it is a joy to be able to visit a true SF gem.  Bravo!", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "We went for lunch . Wasn't all that hungry so me and my wife  split an entree . That's how I ordered it \"split\" . I was fine for the 4.00$ charge except the bald headed gentleman that was our waiter delivered the entree with 2 extra plates . So we ended up splitting it ourselves . The bill came  and there was the 4.00$ split charge . So I complained and he said you ordered it split . Not used to this inferior service . IF YOUR GOING TO CHARGE FOR SPLITTING SOMETHING THEN SPLIT IT !!!!\n\n3 stars was for food . Not the Service !", "author": "scott p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "This place was great.  I tried the pizza, fettuccini alfredo and the lasagna. All three rate as some of my favorites if not my favorite.  The service was also great.", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Great experience for our group of 35 the day after Christmas!  Wonderful personal service by the staff and owner.  Great Italian food from the antipasto to the main dishes.  Too full to get dessert all the servings are Iarge.  We will make this our new family tradition!", "author": "Larry F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Finally. Real Italian food, of the Sicilian variety. Had all of our favorites. All done very well. I think we've found our go-to place in a post-Capps Corner world. Yay!!", "author": "P K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "This is my go to spot in North Beach for Italian.  The food is good, the people are great and they don't rush you.  You can sit and enjoy a great meal with friends.  The Gnocchi al Pistacchio is AMAZING!  We have started to order it as an appetizer because everyone wants to have some.  If you're looking for a great neighborhood Italian place this is it.", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Went in today for our food tour and wow the food was amazing and the service was extremely friendly and very professional. \nIt has a nice setting to it and I love the bar area (:", "author": "Eliza B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-04", "description": "Pretty disappointed in this place. The menu looked great, but the food left so much to be desired. Pastini soup was so hot that it was difficult to eat; when it finally cooled down, it tasted like it had been soaked in water. I'm still puzzled over the chicken marsala. What did they do to this bird? I've never been served a more rubbery piece of chicken in a restaurant before. I could barely even cut through it, and even when I did, it turned out to be a lot of work for nothing. My friends enjoyed their meals, but we won't be coming back.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "I got the margherita pizza here. Not what I expected, but turned out to be the pizza pizza I have ever had. Atmosphere is welcoming, service was quick and friendly. Definitely would recommend. My mom got The chicken papardelle and that was amazing, which is saying something as we are Italian and highly biased when it comes to Italian food!!", "author": "Ashton H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I don't usually review twice on one restaurant, but I had to make an exception today.  We've been to US Restaurant several times since our original visit.  My husband was working in the city yesterday so we decided to meet up for a Valentines Day dinner at US Rest.  Ok, now the reason for my review.  They DIDN'T jack up the prices and take advantage of their customers for Valentines Day.  Wow-- What a concept!  They did have a pre-fixed menu if you wanted it but you could also order off of the regular menu.  Food was excellent as always and we had a great time.  Thanks US Rest, for making Valentines Day so nice for your customers!", "author": "Nancy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Great authentic food!! \nIf you're tired of Americanized Italian food and seeking for an authentic, home style Italian food (as much I was) You'll love it here !!\n\nPasta with anchovies was one of a kind and Italian sausage pasta was to die for.\nI do go to San Diego's Lil italy often but I haven't found a restaurant like this great yet.\n\nToo bad I don't live in SF but I'll definitely be back!!\nThank you again for the great food.", "author": "Jw K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "Absolutely awful experience! Our waiter spilled an entire tray of drinks down one of our guest's back and barely extended an apology. This member of our party was forced to leave the restaurant and buy a new t-shirt nearby and when he returned we still continued to receive sub-par service. Even after speaking to the manager and several of the wait staff, it was if nothing had happened and this unfortunate event was not acknowledged. It's one thing to spill the drinks- an honest mistake- but an entirely other thing to not apologize and barely acknowledge the incident.\n\nAnd finally, on food, it was just okay- your average Italian meal, nothing to write home about.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Family owned at its finest. A place where the pride of what they do shines through. From the moment you arrive you feel like family. The service was outstanding and the food was also excellent. The spaghetti with meatballs was delicious. Calamari was a special and was so delicious. Gnocchi was fabulous. Best cannoli we've ever tasted. Good sized portions for the price. Mario, Tony and the whole staff were awesome. This was our first time to the restaurant and we will definitely be coming back. Thank you for such a wonderful experience.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "This is the 3rd incarnation of this restaurant that I have dined at and each one gets a little more upscale...\nDining on 7/30/2016 , the new location is perfect...the new digs are quite nice ditching the kitchy old school decor of version #2, and the food was quite good and very moderately priced. So they kept THAT going from the last place.\nUnfortunately our waiter was applying his online waiter training skills and that sucked. We felt so forgotten that at one point I was tempted to whip out my phone, call the restaurant, ask for the manager and ask if our waiter STILL WORKED THERE???\nAll in all I would recommend this place as our pasta and veal were spot on and we got a bottle of decent Italian Red for $25.00. Nice.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "I love this place! It is my go to restaurant because the dishes are so delicious. And I never have to wait for a table. Plus the staff is incredibly friendly and sweet all the time.", "author": "Angela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I have been coming to the US for as long as I can remember. It never lets me down. The menu is so large it's often hard to choose what to eat because so many things look so good. However, I always start with a bowl of Pastina in Brodo. It's so simple yet so delicious. It's hard to go wrong with one of the pasta dishes, but also I love their Osso Buco special. Their new location is welcoming and a great place to enjoy dinner.", "author": "Reilly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Hands down the BEST ITALIAN FOOD (SICILIAN) in San Francisco. The food is so authentic -- I'm trust me... I'm married to an Italian Chef lol! \n\nGet the Rigatoni alla Norma, Chicken Parm, Eggplant Parm & Manicotti Ricotta. \n\nHOUSE RED WINE is flipping delicious and it's very fairly priced. Don't be a fool and get a glass... Get the bottle dude!! \n\nLove this place. Been here a bunch of times, and the food and service has always been consistent. Thanks for re-opening!! \n\nNote: The best waitress is RENE ! She is fast, knowledgable, honest, super nice, accommodating and super friendly ;)", "author": "Merlino T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-03", "description": "This place is OK - we came because of the history but we were not impressed with the pizza. The crust was not great, kind of cardboard-y. I'm sure you could get better pizza in the area. \nIt was a nice touch that they brought us bread and bean salad at the beginning though!", "author": "Ariadne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "It was 11 and most of the restaurants in this area was closed - thanks god these guys were open. Since it was late, I only had some salad. Servers were very friendly and accommodating. I will stop by to try some pasta items later.", "author": "The Food L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "This Restaraunt is what you think of when you think of the quintessential romantic Italian restaraunt. The ambiance is perfect, north Beach is the closest you can get to old school SF. Outdoor seating is adorable. The food was superb. My chicken parmesan was cooked perfectly, tender yet crispy. My wife's pesto pasta in her words were \"to die for\". The only set back was the staffing, it was good but with one waiter and one lady to fill waters and take finished dishes it was kind of slow. Other than that...eat there!!!!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "March 15th is a holiday for some of us tax accountants because it's a due date for most of our corporate income tax return extensions. It's not like September 15th but it's still a big breath of relief with all the audits completed and a little bit of a compliance work completed. \n\nTypically we go to a bar and stake out a couple of tables or an area to ourselves and drink beers and eat some junk food to go along with it. This time around though one of the partners planned this nice meal for us at Original US restaurant. \n\nWe started with some delicious red wine (I mean it was pretty good for the house red) and bread with DIY olive oil and balsamic vinegar. Then the appetizers started. Garbanzo bean fritters were probably my favorite. They were really good. Most of my friends thought they tasted like potatoes and one even thought it reminded her of chicken nuggets. We also got a plate of meat and calamari. The calamari was lightly fried and definitely a great part of the dinner. \n\nWe got two courses of pasta: rigatoni alla norma which has eggplant and ricotta and the spaghetti pesto trapanese with some almonds. I'm not a big fan on the eggplant but I did enjoy the pastas. We definitely got big plates of them and they were a great dish. \n\nI ended up getting the sole with vegetables and scalloped potatoes as my main dish. It was pretty good. I definitely could have used less cheese in my potatoes but the fish was delicious. Highly suggest. \n\nWe ended with a cannoli. I was so full by the end of it that I only had a part of it. \n\nProtip: get those garbanzo fritters and calamari.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Clam chowder soup, Fried calamari, side of meatballs and then cap it with their creamy tiramisu. Renee will make your dining experience top notch. Great new location, large airy resto with high ceilings, clean bathrooms and a charming back patio that will soon be available for dining.", "author": "Reena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "This was one of my favorite places in North Beach but some time ago there was a sign on the door saying it was closed for sidewalk maintenance. It hasn't reopened in months and it looks like it may be gone for good.\n\nI liked it. It is not as spiffy as some of the other restaurants on the block, so you might walk past it. But the food was excellent, service was friendly, and it was relatively inexpensive, unlike many other other spots on Columbus.", "author": "Jon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Great service. Great wine list. Very authentic Italian/Sicilian. Favorite dishes: Panelle, Antipasto di mare, Carpaccio di polipo and cioppino.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "Excellent service and atmosphere.  Sandwiches better than pasta dishes.  Get the meats or specials if going for dinner.  Tiramisu very good but doubtful that it was made in house.  Good house red wine!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Well, this place is no longer the dive-like greasy spoon that it was in an earlier existence, and the service is much spiffier, but I still liked the old ones better. Prices seem high, but that may just be wishful thinking about longing for the old days. And I really miss the Wednesday special of Coteghino. However, the simple fact that the new owners have valiantly tried to bring back an institution to the City that so many have treasured memories of alone makes this place a must to visit.\n\nAnd, I was told by Maria Birzoni in the 70's that the US is really for \"United States\". She may have been kidding, but almost everyone called this that, then. I spent so much time outside the entrance waiting for a table listening to everyone talk about this place.............", "author": "George T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Awesome place perhaps over shadowed by the fancier places in North Beach I think the food and service on part with them. The calamari is the best ever not deep fried and no thick batter or oil but only served on Fridays. Excellent.", "author": "N A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "Good value happy hour pizza and beer. My only peeve service was slow/couldn't be found. After a while had to go inside and look for server, and order direct from bar. But otherwise A-OK. Nice pizza.", "author": "Paula M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Excellent Sicilian food. The Sicilian manager helped my Sicilian companion choose a dish she loved.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I was so glad to hear U.S. Restaurant opened back up! I've come here several times and have never been disappointed. Food is incredible and the waiters are very attentive.\n\nAppetizers-I love the panelle! My boyfriend really likes the arancine. You can't go wrong with either though, they both taste amazing.\n\nMain courses-I've tried the chicken parmigiana, the lasagna, and the spaghetti alla carbonara. All of them are delicious! \n\nDessert-All I've tried here is the cannoli. I honestly haven't had a cannoli anywhere else so I have nothing to compare it to, but I though it was pretty great.\n\nOverall definitely a must try if you're out in the city with a craving for some damn good Italian food.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "Solid food especially pastas. Pizza is only ok, so better to order smoothing else. Arancini was good, two large ones with tangy tomato sauce. \n\nThe after the appetizers arrived it took nearly 45 minutes for the entrees to arrive.  Other tables waited lengthy amount of time for their food too. \n\nWon't be adding this place to our regular spot.", "author": "Karrot L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Yep, they're back! My wife and I were sorry that this restaurant closed months ago but are now happy that it has reopened at a new location. This was and is our favorite Italian restaurant in North Beach.\n\nOn our recent visit we were greeted by one of the owners, Gaspare, like long lost friends even though we only get there a couple of times a year. Gaspare and the rest of the staff made us feel right at home.\n\nAbout the food. My wife had one of the Sicilian pasta dishes she described as heavenly. Perfect pasta, of course, and just enough sauce to make it really interesting..... not smothered in sauce the way some places do it. She added the made-in-house Italian sausage that was a real treat. Two long, thin links tasted great and really added that special something to the meal. A bottle of house red wine was plenty good and only 25 bucks.\n\nWe finished the meal with an outstanding espresso. The real deal.\n\nSo, yes, we have smile on our faces now that our fave is back.", "author": "Douglas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Best gnocchi I've had ever! Very soft and moist. I've had the gorgonzola and the pistachio gnocchi and recommend both of them. It's kind of pricy ($18-$20). It looks like a small serving but the right amount is given and does fill me up with no leftovers.", "author": "Kat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "I would call it every day italian food.  Good quantity, not too fancy and clean.  \n\nI dislike noisy restaurants so this stands out as a place where you can have a nice dinner with friends.  \n\nI would definitely go back.  \n\nOriginal US restaurant is kid friendly.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-19", "description": "Man. As you can see, I don't leave reviews on Yelp. I don't like the idea of leaving bad reviews, which is the kind most people are going to use their time to post, and a negative review has never deterred me from going to a business. But... I had a less than ideal time here on 6/17/17... So here goes. Firstly, I wanted to order an apertif. When at an Italian/Sicilian restaurant, I like to follow the customs- they only serve beer and wine- so no apertif and digestif for me- only had water. Next. The bread came. It was not good. My wife was a pro pastry chef and she suspects that the bread isn't made in-house and didn't have more than a bite, it didn't taste fresh. I am going to Sicily for the first time in August and my family is Sicilian, so I have been researching a lot of things in preparation for my trip and was anxious to try arancine for the first time. My dad makes panelle, so didn't need to try that. Even though I had never eaten arancine before, I was not impressed. Their taste did not excite me. My wife said she had arancine someplace else and that it was, \"way better\". Next, insalata, the U.S. Salad was actually good!!! Next, the main course. I had the 'Spaghetti Pesto Trapanese' It was okay. It was a light tomato sauce with some basil leaves and almond slices thrown in. But I was expecting 'green' pasta, a thick pesto sauce, if you know what I mean, but the entree was acceptable. Not sure how a few small basil leaves thrown in qualifies the dish as being \"pesto\". I ate about half. My wife's plate on the other hand... she got the 'Gnocchi al Pistacchio' (homemade dumplings in pistachio cream sauce). What the hell? It was weird. It was terrible. The gnocci itself would melt in your mouth, there was nothing to chew, it was nuked (if this is Sicilian style, well, I'll find that out in 40 days). Imagine a pistachio cream sauce, what that might be. The sauce the gnocci were in was described by my wife as \"just cream and butter\". There was no flavor whatsoever to the dish- she tried adding salt. It was gross. No hint of pistacchio. She only ate maybe 1/4 of her food. Based on our experience so far, we did not order dessert, nor coffee. We got the hell out of there and went across the street and I ordered an expresso and fernet distigif whilst my wife ordered an affogato. I tried this place out, happy to visit an old institution (I miss Caesars). But I will be checking out other Italian restaurants in North Beach and will not be returning.", "author": "Barra K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Just went to the new location.we love it! Gaspare and the same staff are there. It's been a while since we have seen him and he remembered us. Very warm and welcoming. Menu is still delicious. Sicilian style. Now they have outside seating, plus a backyard patio. So happy they are back on buisness :)", "author": "Suzanne E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I just had a great dish of carbonara at the fine restaurant.  A friend was visiting from Maine and she was impressed by the quality of the food.  As always, the staff were terrific.  The owners of this establishment know how to treat customers.  Mario, CHEERS to you from your SMC Brother.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "thursdays this place has probably the best corned beef and cabbage that ive ever had.  yes at an italian restaurant. highly recommend.", "author": "Dani S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "SOOOOOO good. Get the Calamari appetizer, the Caesar salad with anchovies, and the linguini with white clam sauce! Yum..", "author": "e w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-22", "description": "Worst pasta I had in my life. I never thought you can mess up with a bowl of pasta, now I know you can. All food we had was not tasty at all. Definitely not Italian.", "author": "Cătălina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "We fell in love with this restaurant. Wide selection on the menu that included authentic Sicilian dishes as well as many other Italian favorites. Excellent customer service. We can't wait to go back and try other items on the menu.\n\nService was great, and it's heritage as one of the oldest restaurants in San Francisco is just cool. This is their 3rd location over 100+ years, and their story is literally displayed on the walls with large format historical photos- under same ownership. A rare treasure in this city lately. \n\nBut back to the food, we recommend the homemade  caponata, meatballs, and gnocchi, and save room for their wonderful dessert - the cassata or the crostata with homemade ricotta with an espresso.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "We'd go back in a second! Outstanding food and service, wonderful menu, very reasonable prices. Everything was delicious, and everyone working at the restaurant was wonderful to us.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Had the most incredible dining experience here. Food was phenomenal and service was impeccable. Mario is the nicest person and checks in on all of his tables. The hostess was adorable and made my friend and I feel very welcomed. The service was great and I am so excited to visit here again. Thank you to Tony (the adorable bartender) for recommending this place to us! Couldn't have asked for a better night out in North Beach! Will definitely return again.", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Their meatballs are a solid go-to. Otherwise try a chef's special. Don't be intimidated by the curt staff.. it's part of the \"show\".", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "Casually elegant, but lacking charm. Good but impersonal service. Adequate yet uninspiring food. I wanted to love it, but didn't.", "author": "P S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-16", "description": "Very mediocre Italian food. Nothing is particularly bad, but nothing is particularly good either. Don't waste your time if you're expecting to get great Italian food. This is coming from someone who's had great Italian food in the U.S. and in Italy. There only good part are the antipasti. Everything beyond that is mediocre at best.", "author": "Alexandra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-09", "description": "What a disappointment. We pretty much assumed that a place in Little Italy that has been around forever would be top notch, but it was far from it. Now to be fair, we are from NY and we all know that is where the best Italian comes from. The food was marginal at best and it wasn't cheap. Their chicken parm was so disappointing, we are still talking about it. It was thin, the sauce was tasteless and the square of mozzarella they put on top looked like it was prepackaged from Kraft. So mad. We also had the veal marsala. Again, it was just OK. The pasta was also just OK. Really nothing great here. How they have stayed in business so long when there are many better places out there is beyond me. Oh, I know, they charge you a fortune. Sorry fans, I know Italian and this ain't it. Service was just OK. That is the theme, just OK.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-19", "description": "A friend and I visited this restaurant Saturday 1/16/16 - we were in the mood for an appetizer & a beer so we decided to try this restaurant out. We go inside and sit at the bar anticipating a good experience with good food and good service.   However what we received was none of that!  We sat there for a good 10 minutes and NO ONE acknowledged us!!  Waiters walked by us, there was a bold guy with glasses behind the bar who didn't offer us a glass of water, a menu or even a hello. At that point my friend & I grab our things and walked out!  We will Never go to this restaurant again!  Shame on you!", "author": "Shelly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "I was very happy with the new US Restaurant tonight! My friend had the soup which he really liked. Then we split the seafood antipasti. It was fabulous! Definitely enough for a meal itself.\nFor dinner my friend had the spaghetti and meatballs and I had the gnocchi with gorgonzola sauce. It was delicious.\nWe shared the spumoni for dessert. It was more of a spumoni pie. Very good but not home made.\nAll in all we really enjoyed our dinner and would go back again!", "author": "Victoria M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "I loved this place. Small, nice, quaint and holds a little history (you guys can do the research). Authentic Italian cuisine, all the ingredients seemed fresh. The staff was very attentive and helpful. Would definitely recommend.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Great Food, Great Service, Friendly People! I had dinner at the bar and Tony took care of business serving me! The go to place in North Beach!", "author": "Doc B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "We've been there 3 times in the last three weeks, and each experience was worse.  For context, we remember and loved the first restaurant, managed by the ladies whose photos are on the walls of the current incarnation.\n\nThe first time we went, we just had a glass of wine at the bar - a good selection of wines at decent prices.\n\nThe second time, we tried a late lunch (3:00 p.m.) on a weekday.  While the food was decent, the service wasn't great, and there were a bunch of staff leaving for the day and coming in for the dinner shift.  They serve lunch until 4:00, so all the bussing of tables and chatting amongst the staff out on the floor was inappropriate and unprofessional.\n\nThe third time, last night, finished it.  I ordered carbonara, my friend ordered the special ling cod, which was described as \"fresh fish with tomatoes, capers, and olives\".  The carbonara was overcooked and sticky.  The fish wasn't fresh and what's worse,  it was a plate of potatoes covered in red sauce with, literally, two small chunks of fish.  Ugh.\n\nIt's probably not fair to post about others' experiences since I wasn't there and didn't see it.  I'll just say that I've now been told our problems were not unique.\n\nIf you're looking for decent food at a decent price, go across the street to Caffe Puccini.  Seriously.", "author": "TR H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Had a great dinner here with my wife. We had the Linguini Pescatora and the Gnocchi al Pistacchio. Not only was the food great, but it came out in less than 10 minutes. Our waiter was great, overall great experience, highly recommend for authentic Italian food.", "author": "Brett B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Great food, good seating arrangement and nice service. We had the pasta with eggplant and the lasagna and both were great. Will definitely come back here.", "author": "Babak G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Apparently they just opened last week. We enjoyed it a lot, food was good, house wine was a winner. Husband had a pesto pizza en I had a burger steak. Both excellent :).", "author": "Joke D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Liked it very much. Since I went to the real original many many times, starting in the 60's, I was happy to see the incarnation of the place. They have lots of great photos of the old place and staff on the walls.  Pleasant setting, scored a window seat overlooking all the action on Columbus.  Service was excellent and professional.  The three of us all enjoyed our food. We all got the US Salad, a bit overpriced at $9, but very good. We were served bread with a white  bean dip, also very good.  We got an outstanding house red for only $25 a bottle, an outstanding Italian wine.  Very good experience and we will be back.", "author": "Osama B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "fine food, tremendous portions; ordered the seafood linguine, had enough shrimp/scallops/salmon/white fish to feed 2-3 people.....and the white wine sauce was exceptional.  Get a window table and watch the \"City\" life go by.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-17", "description": "LOL!!!! Got an order to go.   Their food is very good-- that's not the issue. I handed the blond gal $22.00 on a $21.85 bill and extended my hand. She kept the change and shut the register.  Lol!! I had been prepared to give her 18% on the purchase!!! Greedy greedy gets you niente and a poor review.", "author": "Judi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Wow! The mushroom ravioli was to die for.  A bit rich, had to have the waiter remove it as I couldn't stop eating it! Eat here!", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "One of my favorite Italian restaurant is back!! Great new feel, awesome service and food.", "author": "P T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Fabulous dining experience! My wife and I decided to go to North Beach for dinner and started walking up Columbus Ave. We passed this place, very unassuming look compared with the nearby places. We saw people going in and saw the Yelp emblem. Did a quick check, saw the favorable reviews and decided to give it a try. Really glad we did. It was a Saturday evening and the place was crowded, but we were offered a table for two near the door and took it. We were immediately pleased by the ambiance. Lots of people, including two large parties, and everyone having a good time. Seems like there were a number of regulars who were greeted like family. By the time we left we felt like family.\nWhat impressed us about the food was its simple, clean, \"straight ahead\" flavors. The Pastina in brodo had just the right chicken stock flavor. The Carpaccio di Polipo was delightful - octopus sliced razor thin, almost melt in your mouth, marinated perfectly in olive oil and lemon. I had the Spaghetti Pesto Trapenese with housemade sausage and my wife had the Linguine Pescatora in white wine sauce. Both were \"Trinacria: authentic Sicilian dishes and both were amazing. The Spaghetti was flavorful itself and the pesto was strips of basil - not the heavy pesto sauce I was afraid of. The flavors were simple and subtle. The Linguine dish was an abundance of seafood perfectly cooked, with the white wine base that was not overstated. I had the cannoli for desert - again simple was best; no chocolate chips or lemon peel or candied fruit. \nThe service was superb. In spite of it being a busy, crowded evening, we never felt neglected. Our waiter was attentive, gracious, knowledgeable. \nThis was a great discovery! We cannot wait to return!", "author": "James A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Had an incredible dining experience at this wonderful restaurant! The service was amazing and the staff was very welcoming. If you are looking for that Sicilian home cooked experience this is the place to go! The food is delicious and so fresh! Make sure to order wine because they have a great selection and the bartender is adorable. This family operated restaurant is wonderful and I recommend everyone go and check it out!", "author": "Gabby L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "Positively dreadful...service is non-existent and the food is overpriced nothing. Place makes the Olive Garden look good. While I was eating a deranged street person kept wandering in off the street bothering the few dinners. Reaction of the wait staff was nothing. They didn't even ask this person to leave. In fact wait staff was MIA nearly all the time. Penne pasta---they didn't even try. Frankly I am not going to waste a lot of time detailing the many faults of this dive. Suffice it to say there is a lot better in North Beach and I would not even recommend this as a fallback---starving would be a better option. Truly worthless. P.s. I find some of the glowing reviews posted here to be suspicious either that or the posters have been living in a cave for last 20 years.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "Enjoyed a recent dinner here w/friends. Highly recommend the \"Salami\" di Polipo (marinated octopus) as a starter -- you won't believe how good it tastes & how appealing they make it look. The Mozzarella cheese sticks & Bruschetta were also good. Ravioli Bolognese, Ravioli Porcini, & Veal Piccata were all excellent main dishes. Extensive menu with choices for every taste (seafood, chicken, meat, pasta) with a wide selection of Italian wines (try the Rosso Piceno for a great glass of red). Nice ambiance, but service was slow & spotty through-out. It was early on a Sat night, before the big dinner crowds. Water refills came just at the end of the meals, one of the side dishes was wrong, the waiter didn't check on us once the food came, and we had to really flag him down to get our bill. The food was good, the real thing, & the place is worth checking out. Service was disappointing though & we'll probably stick to our other favorites in North Beach when we go back.", "author": "HJ B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "Food was pretty good. Service was bad. My husband ordered a special. 20 minutes later found out they now longer had any.", "author": "Toni Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "We heard the Original US Restaurant was reopening and wanted to give it a try.  What a pleasant surprise.  The food was excellent, the menu had a wide selection, the prices were reasonable, and it had a nice family atmosphere.  We tried the calamari and mussels as appetizers.  They were some of the best mussels I have had in years.  For entrees the Chicken Parmigiana and the Seafood Pasta were excellent.  We highly recommend the Original US Restaurant, we definitely will go back.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "I went to the US Restaurant the other night for the first time since it reopened. As an Italian-American from San Francisco who grew up in North Beach, I can honestly say that the food was excellent. I ate what I always ordered at the US - breaded veal cutlet. Perfect! I had a cup of pastina - also perfect. Salad excellent - fresh, delicious.  The waiter brings this nice little dish of Ceci beans and I think chopped onion - wow that was fabulous. I was going to ask for olive oil but I stuck with the Ceci. The house wine was perfect - $24 I believe, and it was nice. Now for dessert, I had this ricotta cake. I do not remember the name, but I love cannoli and this beats cannoli a for sure. Of course I will always miss the original location but my experience was wonderful and it is very nostalgic. I will be a frequent diner. It's worth it!", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-12", "description": "I ordered the Halibut special on Friday. The fish was very thin, bony, tough and over cooked.  Tasted like they had thawed it in the microwave.  The sauce was fine.  I have never sent back a meal in my life, but I thought about it.  My husband ordered pasta and it was ok.  I will never to back to this restaurant.", "author": "Janice P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Went here while visiting San Francisco and it was my favorite dinner place out of everywhere we went! I got the chicken parm and it was probably the best I've ever had. Service was wonderful. Our waiter was very sweet. Only issue was, our table was in an awkward spot so we felt like we were in everyone's way. Great wine menu as well! I have already recommended this place to my friends who will be visiting SF soon!", "author": "Jerilyn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-21", "description": "This was a terrible experience. Ordered through Seamless. They forgot to give a pizza as part of a delivery of 3 items!?!  After waiting 20 minutes they said that it's their policy not to redeliver the pizza.  Sorry. So I pay the delivery service and tip but don't get my meal.  On top of it the fries were undercooked and cold and they provided no ketchup nor napkins.  Never again will I order from here and I recommend nobody does.  Customer service is not part of their vocabulary. Thanks for nothing", "author": "Gregg P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Old school Italian restaurant, been coming here on and off (in various incarnations) for decades. Does everything it says on the tin. Great food, affable service, reasonable prices, spacious new locale. And - it's nice to give one's patronage to a remaining piece of old San Francisco. Recommended.", "author": "Hugh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Great new location. Beautiful ceiling and nice decor. Food as usual was wonderful. The lasagne to die for, tuna salad excellent, tiramisu perfect.  Hidden treasure in the best location. Took my family from out of town and had a nice celebration.", "author": "Katrena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Dinner was great. Very authentic. Antipasti was tasty. Had meatballs and the eggplant dish. All was delicious and cooked perfectly. Prices were excellent and wine pours were great. Very friendly service. Location and atmosphere was great.", "author": "Clark H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "My daughter & I had an early dinner here last week. We started with the Caprese as an appetizer. I ordered the Eggplant Parmesan and it tasted great. My daughter ordered the Risotto & was totally happy with her choice. I used to eat at their old location a lot and I think the new location is okay, but I think I prefer the old location better. The food (portion size) was also a little better at the old location. The service was excellent. I will be returning.", "author": "L H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "I went here for lunch...a simple omelet, fries and a glass of wine.  The omelet was overcooked, the fries were undercooked, flabby and greasy.  The only good thing about the meal was the dish of canellini beans.  The service was slow.  I had to constantly wave my arms to get the waiter's attention.  I'm Italian and also grew up in San Francisco.  Lunch was a huge disappointment.  I don't think I'll go back.", "author": "R212y3s P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-28", "description": "went last evening for eggplant parmigiana.  Started with pastena en brodo.  Waiter offered cheese and then put in so much that I had cheese soup and could nott eat it.. Egg plant was greasy and floating in sauce rather than fried and resting on sauce, so wound up not eating more than a bite.  Companions had linguini in seafood sauce, Seafood was decent but linguini was far too al dente.  Wound up taking two mains home, perhaps they would taste better next day, but they were packed in kitchen and packages leaked , so wound up with soggy mess to be thrown away.  There are far better places in North Beach", "author": "ira l."}
