{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "A neighborhood gem in Laurel Heights, this place would be on my weekly restaurant list if I lived in the area. \n\nEverything from the service, to the wine list, to the food, to the desserts, to the SERVICE. What a great experience. \n\nThree of us for dinner, two of us wanted to share a primi and a secondi. They split the plates and delivered them in a perfectly sequenced way. \n\nThe food was spectacular. We tried the tortellini that everyone raves about - the hay and straw - so good. The Veal with mushrooms. DELISH and the chicken milanese - so good. The carpaccio and a few salads rounded out the meal... but dessert! \n\nThe tiramisu was big enough for the table of three. HUGE slide and it was wonderfully decadent. \n\nAnd a side note. Lots of people from the neighborhood were there. You could tell because it was like Cheers - where everyone knows their names. The staff dotted on some of the older ladies who were in attendance that night. Helped them to their seats and helped them as they left. It was so comforting to see the staff treat everyone who entered like they were a special guest. \n\nNext time in SF - I will search this lovely haven out and drag some friends along with me.", "author": "Marilyn D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "Osteria has been a fixture in the Presidio Heights  Neighborhood for decades....and that says something as to how well they run a restaurant!!!\n\nIt is a very warm and quaint place to get a good classic Italian meal. Nicely executed appetizers, pastas, meats, and desserts.\n\nServices is warm and efficient. Prices are what you would expect for San Francisco and classic Italian fare.\n\nFood is good not great but it is always consistent.\n\nThe three of us had:\nBruschetta : crostini served with mozzarella, marinated chopped tomatoes, minced garlic and fennel ( It is good but not something amazing and at $13 somewhat overpriced)\n\nThe three salads were all okay: The Cesar was very pedestrian, as was the house salad. \n\nThe only unique salad was my friend's brother's salad : the spinach salad which was really good ( spinach, feta, roasted almonds, peanuts and mushrooms with balsamic vinaigrette:  A very unique blend of items and tastes).\n\nMy friend Michele and I both had the tagliarini contadina (spinach pasta with chicken, tomatoes and shiitake mushrooms). It is well executed but pretty pedestrian.\n\nThe Salmon (https://www.yelp.com/user_local_photos?select=juEiq2XuppveJouPqwOesw&userid=kroQYWSj-BhIEXT4VwLRHA) looked fine but was very pedestrian as well.\n\nOverall Osteria is a fine place to get a classic, consistent, yet uninspired Italian meal.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Wonderful neighborhood restaurant, great quality food with a relaxed vibe.  The staff remembers you and what you like.  My favorites are the minestrone soup (best i've ever had), and the gnocchi.", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Very impressive food and service.  It's a typical small family restaurant with people who welcome you sincerely, are happy you're there, and who know how to cook.  Highly recommended. \nMerritt Weisinger", "author": "Merritt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "As always, lovely staff and made to order food. Fresh and homemade pasta. If isn't on the menu, they will try to make it for you. The scampi superb and the gnocchi with bolognese is heaven. This is a small family style restaurant that never fails.  We drive from Reno, Nevada -- just to eat here.", "author": "Leanh E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "This place has been a favorite from when we lived in SF\nWe were staying in the area and decided to go back\nIt's as good as ever\nFun local\nPlace for delicious food", "author": "Mary Ann C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "I have lived 2 blocks from this place for over 10 years.  It was a Saturday night and we wanted some grub and had made no plans.\n\nI thought of this place - called them and they said we could come over at 8pm. \n\nWe arrived and though the place was packed - we got seated right away, in the back - 1 table away from the kitchen.\n\nService was good. The wine prices are steep. The cheapest was about $14/glass or triple that for a bottle.\n\nMy man & I split the Carpaccio (really excellent - a bit too much red onion - but the beef was great.\n\nFor entree's we split the veal with mushrooms and the tortellini with cream and peas.\nThe veal was a bit too thin - so I think there should have been more of it.  The pasta hit the spot...that spot where you crave very fattening pasta.\n\nAt the suggestion of the two ladies next to us we got their lemon cheesecake. it was very light and tart.\n\nI think $150 total so kinda pricey\n\n...we waddled out.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "I have gone for 20 years - I remember the original owner and chef. He's not there anymore - he died, and the wait staff is different. \n\nThe food is still great, though. Simple, seems like the same recipes, and it's reassuring and comforting to eat here - so many places change and go downhill. Osteria has kept its allure for me. \n\nTheir salad dressing on the radicchio / watercress / arugula still kicks ass. I can't find dressing that good anywhere else", "author": "tom p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "A very nice neighborhood spot, with an owner to greet you and remember your name to thank you as you leave. Solid Italian food, simply prepared.  Wine list was short but well-chosen. Didn't see any cocktails being served. Veal picatta was nice as was the bruschetta.", "author": "Lee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "So tonight it was just my 90 year old dad and me for dinner. I have had many a meal with my family but for whatever reason this meal was one of the best ever. We come to this restaurant often but tonight was over the top. Minestrone is always good. The Tucson melon with pots churro was without question the best; the melon was so sweet and the porsciutto was incredibly delicious. Salmon was next and it was absolutely delicious. It was with a wine and tomato sauce, truly outstanding. Dessert was a flourless chocolate cake with strawberries, and a panacota with strawberries. Truly outstanding", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Nice neighborhood restaurant. The service was great, the food was very good. We ordered artichoke bottoms with shrimp which was very fresh, gnocchi which was delicate and delicious, and veal scallopini with mushrooms which was also very good. Helpful to have reservations because this is a very popular spot. Great menu, service, cozy and warm. We will be back.", "author": "Adia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "This is a family-owned business that has been open for years yet still has the owner on site nearly every night.  Their food is consistently good and they are happy to answer questions and direct you to ordering the items that are best suited for what you like.  (For me, it's the healthy side.  I loved the spinach salad and also a pasta with chicken breast--and the staff was right--it was enough to bring some home : )  I thought the pinot noir was very good as well.  I personally like to patronize small family-run businesses and to support my local community.  This kind of restaurant is one of the reasons it's great to live in San Francisco and not  be surrounded by national chains.  Osteria is special.", "author": "wendy b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "What a great restaurant!  From the moment I walked in and smelled the aroma of good Italian food I knew it was going to be good.  And it was!  I had the insalata Della casa which was very simple but delicious.  Then the Gnocchi which was the best I ever tasted, melted in my mouth.  The wait staff was very polite and attentive.  Great meal!", "author": "Carol M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "We've been coming to osteria for years.  This is my favorite Italian in the city.  The tortalini proscuto is my all time favorite.    Strong recommend you try this nice local establishment.", "author": "Dan Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "Osteria is the prototypical Italian neighborhood restaurant that also doubles as that special occasion romantic date night choice.  In fact, we tell the kids this would be a good place for a first date.  You can even walk across the street to catch a nice movie after dinner at the neighborhood theater for your dinner and a movie date.\n\nWe made reservations for an early dinner for 4 for my gal's birthday.  We were greeted by Gina, the proprietor.  We were seated promptly and asked if we were on any time budget.  We started with the shrimp artichoke appetizer as well as the pancetta with brussels sprouts.  The brussels sprouts appetizer I've had a couple times here and love itt\n\nOn this occasion I had the mushroom risotto special instead of my normal  gnocchi. My dining companions had the tagliarini and the tortellini.  We ate it all and then finished with the hazelnut flan and tiramisu  for dessert.  They even added the candle and sang!\n\nThe dishes are standard Italian dishes or slight twists and done in a very unpretentious way but with some sophistication.  One could quite possibly go to Osteria several times a week for a nice home cooked meal.\n\nEarly seatings have more young families and later seatings seem to cater to more adult families. Dinner was done in an hour and 20 minutes for those planning on a movie night.  We will be back as always.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-28", "description": "We had a great server but very bad food. Bland food. Very bland. Carbonara heavy on the cream side with little pancetta. There is no cream in Carbonara. Very bland veal. Caesar Salad that I'm not sure was made with anchovies it was so tasteless.   The bread was good. But I'm not sure it was worth $150.", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "We used to eat dinner every week at the Osteria , wonderful meals and wine ,then we moved to Italy, returned home to San Francisco after 17 years there and guess what? The Osteria is still here serving fabulous food, wonderful waiters (who all speak Italian) and the amazing family who owns and runs the restaurant. A wonderful place for dinner.", "author": "Julie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "A perfect neighborhood restaurant. I had linguini with white clam sauce and it was just what I hoped. Terrific comfort food after a busy day. The service was friendly, personal and prompt.", "author": "Ian G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-10", "description": "I went into Osteria last week with a friend for dinner.  We didn't have a reservation, but the place was not very crowded so we didn't think we would have any issue getting a table.  When we told the hostess we didn't have a reservation, she became visibly irritated and told us we needed a reservation.  I pointed out that there appeared to be plenty of space, and she reluctantly seated us.  Our service was good, and the food was delicious - the gorgonzola gnocchi was my favorite.  The restaurant was still not full by the time we left, so I was confused about the hostess making a big deal and giving us attitude.  Aside from her, it would have been an excellent experience.", "author": "Nicholas N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "We came here for a lunch, ordered a salad appetizer which was very great. The bread came with the salad was the greatest of all. We also ordered italian sausage pizza with mushroom ( succiccia as I remembered). Pizza was goog but we did not love the sausage with pizza taste. The waiter seemed cheery to the former customers and to us at first. When he learnt we were from Turkey he seemed a little changed. He did not do anything mean but became not cheery at all.", "author": "Aygül K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "Last night I had one of the worst nights of my life after dining in this restaurant. It was 5:45 and I was headed in for an early dinner. When I walked in just before 6 the restaurant had one other couple sitting in it. A woman with long black hair asked if I had a reservation and I said no. She told us that the empty restaurant was fully booked for the night. My friend then let her know he had put in an open table reservation. Btw, open table had availability every half hour thru 9:30. They were not even close to fully booked. As the night went on we ordered food and had a lovely experience with our amazing waiter, Juan. We brought in two very nice bottles of wine and had them opened for us. In the middle of eating and just after opening our wine the same lady came over to our table gave us the bill and told us we had to leave bc a new reservation needed our table. I told her we too had a reservation so we were going to finish our meal, drink the wine, and then go. She told us we had to at least move to a different table bc even though we had a reservation it was booked by opentable and there is a time limit on how long you can stay with opentable reservations. That is not true. You can call opentable, we already did. We moved to the other table per her demand so we could at least eat our dinner and have our wine. As we moved seats we told her that in all of the years of living here we had never been treated so poorly in a restaurant. She then told us we could leave if we wanted to. I started to finish my food as quickly as possible as I just wanted to leave. She then returned to our new table to tell us how rude we were and that she'd comp our bill and to get out. I asked her to please leave our table as we finish up as quickly as possible. This is where the most horrific part comes in. As I'm eating my food, I see the restaurant being surrounding by 5 police cars. They rush into the restaurant and remove us. I have never gotten in any trouble in my life and we had done absolutely nothing wrong so needless to say I was scared and humiliated. I was immediately in tears so once the police took us outside they told us not to worry. They said they could tell we were good people but she demanded that we leave. They said  to just look at it as a free meal and to go enjoy the rest of the night. They were so kind to me and apologetic that helped with the initial trauma and fear of being bombarded by a barrage of police officers. \n\nIt's fair to say that it was one of the scariest nights of my life. I cannot understand why the woman did not want us there since we walked in or why were treated so abusively. I hope that this review is helpful and that this never happens to anyone else. :(", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "The good service, great food, and prices are surprisingly reasonable for the area.  It looks like everyone there is a regular patron.  A great comfortable neighborhood gem.   Hope it does not change.  It is very likely that we will return.  Do make reservations.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-10", "description": "Old timer place in a cute neighborhood.\n\nenjoy a glass of wine with classic antipasto, entrees, and desserts.  we had the grilled veges which was simple.  then we split the special of the day, penne with meatball and the veal with lemon caper sauce.  pasta was decent, topped with shaved parm.  veal was tender and light.  for dessert, we shared the classic tiramisu, which was light, fluffy and delicious.\n\nservice was friendly.  full of locals in the neighborhood.  wine selection was good.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "This is such a cute and delicious Italian restaurant! Has such a nice home feel to it and the food is excellent!! Great service as well!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "I ordered the eggplant parm. and wanted pasta instead of the vegetable that came with it.  The waiter told me that no substitutions were allowed, but could order a half portion of pasta for an additional charge.  Eggplant parm  comes with a side of pasta in all the Italian restaurants I've dined, and was disappointed that it was not included here.  Pasta is a very low food cost item and frankly surprised that it was not offered with the main course,\nThe eggplant parm. was delicious as was the sauce.  It was not greasy and either lightly breaded or no breading at all.  \nMy wife ordered the pasta with sauce and enjoyed her meal.\nWe finished two bread baskets.  The bread was nice and fresh and had a good flavor.\nI would have given 5 stars if substitutions were allowed.\nI would just like to know their reasoning behind the no substitution rule.", "author": "Jerry J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Osteria is our favorite go-to Italian restaurant when we want to treat ourselves to a nice white tablecloth dinner.  Gina and her staff are very warm and with a nice, intimate upscale neighborhood environment away from the crush of Fillmore Street in Pac Heights.  We see lots of regulars every time we visit with an array of (well behaved) families dinning on occasion. \n\nTheir food offerings are very good and consistent and they usually have one or two specials each night that are occasionally worth trying.  My wife favorites are the Insalata Di Spinaci,Tagliarini Contadina and Scaloppine or Piccata Di Vitello.", "author": "Brent V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Pretty solid neighborhood Italian restaurant with good quality food. \n\nWe came here for Valentine's dinner and surprisingly the restaurant was not too crowded, but there were definitely couples coming in throughout the night, likely with reservations. The ambience is actually relatively bright with light colored walls.\n\nFoodwise, everything was tasty and portions were generally decent. We ordered mussels, a blood orange fennel salad, and gnocchi pomodoro to share, and veal piccata and pork over polenta for entrees. I will say that the veal piccata was more of a traditional Italian second course size while the pork special had a lot more food. \n\nService was fairly attentive and friendly. \n\nThis place is worth checking out if you live in the area.", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "This restaurant is owned/ managed by the cutest old man. I made a reservation for 2 at 8:45 and when my friend and I walked him he jumped up from his little nook in the corner and knew immediately who we were (I don't think it was necessary to make a reservation. He was so adorable and at the end when we left, he got up from his dinner to personally thank us for coming in. \n\nThe atmosphere was very cute and family oriented. \n\nFood- We ordered the caprese appetizer and the spinach pasta with shrimp. The caprese was good and came with a pesto sauce which I really liked. The spinach pasta with shrimp was really good. They were little baby shrimps which were interesting but the actual pasta was delicious and the cream sauce was light but flavorful.\n\nAs for the bread we got at the beginning, I wish there would have been a better sauce, like an olive oil- garlic- spices sauce, instead of just plain olive oil.\n\nAll in all, it was a very cute little place and I would be down to come again.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "I came here to see one of their Monday night acoustic performances. It's a tiny place, full of Botoxed SF yuppie matrons and other pretentious liberal types, but the atmo is fairly cozy and homey. On Mondays, they squeeze the performers in the front of the room, by the windows facing the street...so if you want to see the act, better request a table up front. The place is small enough so you can hear the music from any table, but the view is best from up front.\n\nFood-wise, I had 2 glasses of wine, a spinach salad and some risotto ($55 total). All were good, but nothing exceptional. \n\nService was attentive and polite...everyone was friendly, and I felt pretty comfortable, despite the fact I was sort of underdressed (upscale-casual seems to be the shtick here).\n\nWithout the live music, the ambiance would probably be kinda weird...so not sure I'd come here again, unless some I knew or liked was performing.", "author": "Sarah Jane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "After going to the movies at the Vogue movie theater we went into the restaurant across the street, Osteria without a reservation. We were a party of 9  & were accommodated by the pretty, gracious hostess who seated us immediately. She asked us if we had reservations. The Decor  had an Italian feel. I must say the food was the best part of our night. Almost 3 hours  into it we did not feel rushed and we had a wonderful meal that felt as if it was cooked by grandma... after talking to the of hostess we discovered it had been around for over 20 years and we now know why...Thank you for a wonderful Italian dinner - now it's a regular eating place for me and I am on my 4th visit.  Ran into Madeleine Albright on my third visit", "author": "Milly M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-28", "description": "Came here with two other \"young\" people. The bread and olive oil were good, the wine and pasta I really don't remember so they must not have been that great. After paying the bill I asked, who I presumed, was the Executive Chef, where the bathrooms were. He pointed to the street and with a straight face and bite in his voice said I had to go outside. Disgusting way to treat a paying customer, especially on a slow night.", "author": "Kali C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "We had fine dinner here after a show nearby. The place was nearly full, but they got a cancellation via open table and were able to take us on short notice.\n\nExcellent gnocchi, and delicious tender calamari steak. Attentive friendly service. Better meals than I've had for twice the price.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-27", "description": "Hey Mambo, Mambo Italiano!\nHey Mambo, Mambo Italiano!\nGo, go, Joe, you mixed up Sigiliano!\nAll you Calabrese do the mambo like crazy...\n\nI rarely make it over to Laurel Heights for no particular reason except I have no reason to go there. Except on Wednesday when Jamie W. and I happened to be in the neighborhood to see none of the city mayoral candidates duke it out in a debate at the spacious Jewish Community Center. It went on so long that we just had to skedaddle to satisfy our stomachs before fainting from another argument about pension reform. We just strolled up Presidio a block and happened upon Osteria. Glad we did. \n\nHey Mambo! Don't wanna tarantella,\nHey Mambo! No more-a moozzarella.\nHey Mambo! Hey Mambo Italiano.\nTry an enchilada with a fish-a-barcalada.\n\nThis is what I call a real neighborhood Italian place. You could tell the gregarious owner Vahid Ghorbani takes great pride in his place by the way he greets you and explains all his daily specials in great detail. The menu is traditional Northern Italian - no heavy red sauces but plenty of seafood and cream sauces. Jamie and I shared the $8 Pomodoro Affetatto con Gamberetti, basically a shrimp salad in a light Green Goddess-like dressing scooped on top of a sliced tomato and a heart of palm with red pepper strips (see photo). A bit fussy in a grandma sort of way but good. \n\nHey goombah!\nI love-a how you dance rumba.\nBut take-a some advice paisano,\nlearn how to mambo.\nIf you're gonna be a square,\nyou're never gonna go nowhere.\n\nWe both went for pasta for our entrees. Jamie ordered the $14 Tortellini Della Casa, which came in a hearty meat sauce (see photo), while I opted for the $15 Tagliarini Contadina, which came with chicken, chunks of tomato, and sliced shiitake mushrooms. Only they were out of tagliarini and served linguine instead, as if I would have noticed a difference (see photo). Both were good, old-fashioned plates of carb goodness with plenty enough going on to be quite satisfying on a crisp night in Laurel Heights. \n\nHey Mambo, Mambo Italiano!\nHey Mambo, hey Mambo Italiano!\nGo, go, Joe, shake-a like a Gioviano.\nHello quesadicha,\nyou getta happy in the feets-a\n\nValid lured us with his $8 Tiramisu, which was uncommonly well made with a hint of Kahlua in the highly calorific blend of ladyfingers, espresso and marscarpone cheese (see photo). Quite delicious, and we were not worthy to deserve such a treat. Jamie and I both agreed that we'd give Osteria another try if we were in the neighborhood, but like I said, we're never in that neighborhood. But maybe, just maybe, we won't get off at Polk when we're on the 1 California and let ourselves indulge in some of that tiramisu again. \n\nHey Mambo, Mambo Italiano!\nHey Mambo, Mambo Italiano!\nGo, go, Joe, you mixed up Sigiliano.\nIt's-a so delish-a, everybody gonna preshi-ada.\nMambo Italiano!\n\nFOOD - 4 stars...good, old-fashioned Northern Italian dishes \nAMBIANCE - 4 stars...a nice and airy spot good enough for grandma and Gen-Y'er alike \nSERVICE - 4 stars...Vahid was a charmer \nTOTAL - 4 stars...killer tiramisu may just warrant a repeat visit", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "Kinda your average Italian neighborhood restaurant. \n\nI've never been blown away by a meal here, but the food is decent. I enjoy their carpaccio and antipasto assortito (mmm hearts of palm), and as for entrees, I've always gone with pasta and they're always fairly tasty -- just not in any way memorable or extraordinary.\n\nFor some reason I've been here several times, mainly because business associates work nearby. I think it's just a pity when San Francisco has so many phenomenal Italian restaurants (Beretta, Flour + Water, Delfina and so many more I haven't even had the chance to try yet) ... you catch my drift.\n\nOn the positive side, the vibe is very family-friendly -- you won't have to worry about taking Mom or Grandma to Osteria because she will be surrounded by her peers.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Osteria seemed like a neighborhood restaurant in a very nice neighborhood.  Down the street from two of my favorites - Spruce and Sociale - it had a lot to live up to and most certainly did.   The linguine alla vongole tasted the same as it did in Venice with one interesting exception - they substituted basil for italian parsley, which totally worked.  The winner, though, was the spinach gnocchi my wife ordered.  It raced to the top of her all-time favorite gnocchis; beating out the salmon one we had in Croatia!  The wines by the glass were both excellent.  For dessert we had the cheesecake with lemon - fantastic.    This pace is definately worth a visit.", "author": "Marcus P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Authentic and fresh! The staff treat you like family! Who could ask for more! The pear salad was a treat and the homemade cheese cake is light and delicious.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Good Italian food but nothing to write home about. The space is very nice and cozy as others have described and the staff is extremely friendly and accommodating. The price is very reasonable compared to other Italian restaurants in the area.", "author": "Marcus P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Ate a delicious dinner here with my mom and absolutely loved the gnocchi pomodoro that I got! The service was wonderful, just make sure to have a reservation in case it is a busy night! Both plates were cleared and bread was devoured. They serve both beer and wine, and a nice variety of both, though there are no cocktails. It is a lovely layout on the corner with lots of windows to help with the people watching. Great place to eat!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "The food here is absolutely terrific. One of my good friends suggested this for my birthday dinner so we made reservations for a Friday night, showed up on time and were seated. Everything was fine except for the service. \n\nThe food was absolutely delicious and I love the environment of the restaurant. It was very comfortable and cozy. However, service is really important to me and the waitress we had seemed really grumpy and damped our mood a bit. \n\nI don't know if I'll be back again. The food, again, was really great but the service turned me off to the restaurant. We'll see.", "author": "Jeannie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-25", "description": "Its just ok.  It has the cuteness neighborhood thing going on, and the lovely host and waiters - but the food is just ok.  \nWe had risotto ( a bit over cooked and over flavored ) and the linguine w clams and a few salads.  \nFood needs a step up - thats all I am saying.  Go local, go fresh.", "author": "Lione B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "Food was simply not good....Our server was pretty nice though (thus the 2 stars, rather than 1).  There are much better Italian restaurants in town.", "author": "Charlie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "Went to dinner with a girlfriend last night.  Friendly service.  Delicious olive oil as the starter.  The salmon was good,and the menu said sustainable.  I forgot to ask if this was wild caught or farmed raise.  It would be helpful if they indicated.  These days I'm only eating fish in the city caught by Two by Sea.  But overall, great meal.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "I really enjoyed this restaurant. I have been back a few times and try to go when I am visiting SF.\n\nThe staff is always very friendly. This place is small and quaint which is nice when your in San Francisco. Its a neighborhood restaurant. \n\nThey have some good wine choices that aren't super expensive. Which is also sometimes hard to find these days. \n\nReally have enjoyed eating here and will be visiting again sometime soon.", "author": "G L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "We have been dining at Osteria for a number of years.  Over the past couple of years it has been at least once a month.\n\nMany other restaurants we've enjoyed over the years have closed and/or their food and service\ndeteriorated to the point where we stopped going.  Also, a number of restaurants have raised\ntheir prices to the point where we will go only for special occasions.\n\nOsteria has actually improved over time.  They have a diverse Italian menu, ingredients are always fresh, food is very well prepared, service is excellent, and their portions are very generous.  On many occasions we will order one or two starters and split the main course\nand walk out comfortably full.  Prices are very reasonable for the quality of the food,  the portions, and the excellent service.\n\nI like to order a glass of wine with my meal.  Their wines go well with the food and the pours are\nvery generous.\n\nWe went there for dinner on New Year's Eve with two other couples who were not familiar with\nthe restaurant.  Everyone was very happy with the meal and the service was excellent.  They\nwere very busy that evening but we were seated right on time and servers did not miss a beat.\n\nThey had a special menu for New Year's and the price was appropriate for the occasion.  We\nactually wound up paying a little more than we would pay on a regular evening at most of the\nrestaurants where we dine.  Our friends were very pleased and Osteria will probably be where\nwe dine December 31, 2016.\n\nP.S.  Yelp sometimes takes posts out because they think they come from people connected to\na place.  You can check with Open Table to see how often we dine there and many times I will\ngo there on my own without making a reservation when I've had a long day and my wife is\nelsewhere.", "author": "michael s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Ordered the gnocchi, chicken parm and salmon. All were delicious and very well prepared. Service is exceptional- very helpful and friendly. A nice neighborhood spot it you live in the area but also worth traveling to.", "author": "Hadley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "One of our favorites the last 24 years.  A neighborhood restaurant that never disappoints.  Every time we are in the city my wife and I go to Osteria for a fantastic meal.  Our favorite waiter retired but service is still fantastic!  My wife and I always have the same.  Veal Picatta for me and Gnocchi for her.  Their salad dressing is fantastic and was published online for a while.", "author": "Jose G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Stopped by early this evening without a reservation was shown to a table and treated like royalty. Thanks to Juan, et al   for dining recommendations and excellent service. .  I've dined at Osteria a half-dozen times over the years and have found it  a lovely respite from a stress-filled day.  No television, and no Muzak. GREAT !", "author": "Claudia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-16", "description": "We wanted very much to like Osteria, as its location is so convenient for us.  The reviews were quite mixed, but we decided to take a slot on OpenTable and give it a try on a recent Friday evening.\n\nWhen we arrived a few minutes before our reservation, the person who greeted us seemed surprised that we had a reservation, and told us we would have to wait. She blamed OpenTable for making a reservation they weren't ready to accept.  All restaurants can run behind, and waiting for a table on a busy evening is fine. What bothered us was the overall sense of annoyance that the staff displayed towards us and our reservation, far from the welcoming attitude we have come to expect in neighborhood restaurants.\n\nWhen we were finally seated, we were given a single menu for our party of 3, and were told they were dealing with a menu shortage. Fine, except that the larger party seated a few minutes after us had menus given to each guest, including several children. Despite the fact that we waited about 12 minutes for someone to take our order, we were not given another menu.\n\nThe food was fine but inconsistent.  The brussels sprouts appetizer was very well-done and tasty, with pleasing flavors and just the right done-ness.  My Chicken Marsala, one of the specials that night, was overdone and quite dry.  The sauce and accompanying vegetables were quite good.\n\nThe service could most generously be described as benign neglect.  No check-ins once we had ordered, no sign that our server was aware of how very long we were waiting for our meal.  Once our dishes were delivered, it was difficult to even get our water glasses filled.  By the time we were done, we just wanted to get the check and leave, but it took some time to even catch someone's eye to accomplish that.  Is it possible that this place was simply overtaxed on a busy Friday evening, and that we would have a better experience at another time?  I suppose so, but I do not plan to return to find out.", "author": "Jeffrey Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "This is a busy little restaurant. I suggest reservations or eat later in the evening. Service was very good as was the food. Good selections and will please everyone in your dinner party. Locals were eating here which I feels is a good sign!", "author": "Kim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-13", "description": "My boyfriend and I checked out this place on Friday. I had a gone a few years ago and had a great experience, but unfortunately that was not the case on Friday. We had a 7:30 reservation and were seated immediately, which was great, but the experience went downhill from there.\n\nWe ordered a bottle of wine while we were perusing the menu (the Zin, which was a decent bottle for under $50) and while the waitress was pouring the wine I ordered an appetizer, the antipasto for two, and asked her a few questions on the menu. By the time she was done pouring, we were ready to order and did so. I went with the angel hair pasta with fresh tomato sauce, garlic and basil, and added prawns and my boyfriend got the spinach pasta with chicken, tomatoes and shiitake mushrooms. (Both were good, mine was better.)\n\nLess than a half of glass of wine later (so, I'd say less that 5 minutes), our pasta comes out to the table. No sign of an appetizer in sight. My boyfriend asked the waitress and she said oh, I am sorry, do you want me to put your food under a heat lamp and get you your appetizer? Of course we didn't want our pasta sitting around, so we declined, but were very disappointed. And while she did offer us free dessert about 5 minutes later, she didn't seem to really care that she had made a mistake. (We all make mistakes, but own up to it, right?) Also, the pasta came out so fast that we had no time to just enjoy the wine - the whole experience felt rushed. After we started eating I saw that other tables were being offered fresh Parmesan to go on their dishes - so I asked her to bring some over, and when we received the dessert we ordered, it was not presented as nicely as the other items we saw come out. I know, some little things, but if you mess up, which is human, at least try to make up for it!\n\nSo to recap, the food and wine, pretty good, the service? Needs improvement.", "author": "Jane F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Plus: the food was excellent, and not over priced for its class and type.\n\nThat said.\nI made a reservation with Open Table for tonight, a Monday, when it opened, at 5:00. Easy. My mom and I got there, and were the only people there. It took two minutes to get acknowledged. Despite every table being open and having a reservation, the waiter told us to come back. We shopped for a minute and came back, and were reluctantly seated. We considered just walking out, but decided to give it a try anyway.\n\nStill, we were literally the only two people in the restaurant. It nevertheless took minutes, the two employees were much too busy arranging seats for other parties who were not yet there. We made our order, and after the food arrived, we were not paid attention to at all for the rest of the meal. Other parties were arriving, along with a band. The waiter, a 40-something hipster who still went by Andy, had the same snooty attitude with all the other customers as well.\n\nThe terribly poor service, along with the generic, soulless atmosphere, made for an experience I'd not want to repeat. It made for an excellent opportunity to tell my mom all about the huge amount of entitlement amongst a huge percentage of San Franciscans, and how this type of BS is just so common these days. What ever happened to just being a nice person?", "author": "Alex L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-24", "description": "Very mixed experience.  Four of us went to hear a singer who was there this Monday night.   We had never been there before.  The first problem was the set up - this place should never book entertainment.  Only the front two tables out of the 10 or 12 in the restaurant can actually see and hear the entertainment, a disservice to the artists and the diners. \n\nService was very slow due to understaffing.  There was one waiter and one busboy for the entire place.  The waiter had essentially given up trying to keep up; you would just have to wait.  It took 30 minutes from seating to ordering and another 25 minutes to get our appetizer and drinks and another 30 min. to get dinner, so I assume the kitchen was backed up too.\n\nThe food was adequate; of the four dishes we ordered, one was meh, two were ok and one was very good. The appetizers were ok...nothing special, but ok.  \n\nMay we hit a bad night.  The fact that one dish was very good indicates tht the kitchen can turn our outstandning food, but if they are rushed and backed up, don't expect it.  I won't go back, but others may be luckier than we were.", "author": "Patrick O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "I've lived in the neighborhood for years and passed by Osteria countless times. I've always wanted to try it but somehow never made it over there. That all changed last weekend. My boyfriend and I were on a loooong walk through the Presidio, to the Marina and back and decided to finally venture in when the warm glow from the bustling restaurant lured us out of the rain. We didn't have a res (obviously) but Gina greeted us warmly and told us we could wait for a table. She anticipated 45 mins. We decided to head over to Swank for a cocktail to \"kill the time\". That was fun! (See separate review for Swank). Then we headed back over to Osteria and Gina had our table ready for us! \n\nWe were immediately given some lovely bread and offered still or sparkling water. The menu looked awesome. We were hard pressed to pick just one starter and one entree but we managed. I started with the insalata della casa - a butter lettuce salad with delicious green goddess dressing. Dave opted for the Caesar - I stole a crouton and it was gooood. \n\nWe ordered a bottle of wine that Gina recommended to us and it paired perfectly with everything we ordered. I'm completely forgetting what it was - but for $42 it was a steal. Gina orders all of the wine for the restaurant so she is well acquainted with the wine list and can help you with any questions you may have.\n\nFor our entrees I ordered the linguine with clams in a light white wine sauce (amazing) and my bf ordered the tortellini with peas in a cream sauce. Both dishes were cooked to perfection. We seriously ate every last bite and almost licked our plates. Luckily decorum won out over gluttony. Phew.\n\nGina introduced us to their fantastic-looking dessert menu and while the cheesecake sounded out of this world, we just didn't think we'd have room after gorging on everything else. Gina comped one for us since it was our first visit and told us to enjoy ourselves. We did!!!\n\nFood: totally authentic, cooked perfectly and downright delish.\nService: awesome! Gina, the owner/food server/wine connoisseur made our experience wonderful.\nAmbiance: great! Even with it being a full house it never got so noisy that we couldn't talk.\n\nTotally recommend and can't wait to return :)", "author": "Carrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Two years ago we met some mutual friends for a dinner here. We hadn't had much contact since our children were elementary school aged long ago. The great food, atmosphere, and great wine had us laughing  like long lost friends. Great wine, good veal, and a stellar antipasto. \n\nI'm in my 50's now and the comments about old people, hearing devices, blue hair makes me chuckle.  This sounds like insecurity from a generation that can't seem to do anything without a phone in their hand, checking it during a nice dinner with friends, and generally clueless about how to behave socially. The ball cap wearing crowd indoors is a real peeve. (There's a great scene in the Sopranos when Tony confronts a 20 something doing the same)\n\n\nGreat food Osteria. We will be back soon.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Outstanding food and service.  Cozy, warm ambience.  Always a great dining experience.", "author": "Molly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Great food! Reasonably priced & great service. A nice treat. I recommend the Risotto of the day!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "Great service! Very authentic! I would recommend it to anybody passing through or for a solid night of good Italian food!", "author": "Taylor J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-08", "description": "Before I tell you why I rated Osteria so low, I need to give you some context of the evening. We were starving and hadn't eaten since before noon, and it was after 8p by now. We were going to make something at home but decided it was too late and we were too hungry to put in the effort, so I called Osteria. I ordered the grilled chicken (petto di pollo paillard alla griglia, as it's listed on the menu), and my girlfriend ordered the gnocchi. \n\nWhen I got home, the two meals were packaged nicely and were still hot. As we started eating, I noticed that the portions were good sized, the chicken was filleted completely and looked very big. The food seemed to be prepared well. I was pretty happy until my 5th or 6th bite, when I bit into a combination of chicken and vegetables and felt and heard something unusual as I pulled the bite from my fork. As I started to chew I realized there was a long hair that was intertwined in my chicken. To make it worse, the unusual sound I heard was the hair breaking numerous times. I removed the food from my mouth and began to inspect the chicken. I found 3 long hairs that had found their way into the fillet of the chicken. \n\nThis isn't the first time I found a hair in my food. Hair is natural and not unheard of in food preparation. I have even finished a couple of meals that had hair on the edge of a plate or even found laying on a portion of food. \n\nBut this time was different for me. In the context that Osteria is a \"nicer\" restaurant, and the price of the food was not that of a diner, I expect more. In addition the hair was intertwined in the chicken prior to cooking and was not simply on the edge or even on top of food. Unfortunately, I lost my appetite, and so did my girlfriend, and chose to not finish the meals. \n\nI understand that this was most likely an isolated incident, but I will not return to Osteria.", "author": "Jeremie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "I hadn't been to this place in a long time, gave it a try with my dad the other day and again about a week later with a friend. Awesome. Food is simply delicious without being heavy. A lot of Italian places are too heavy on the pasta, not here. Fresh fresh ingredients, superbly put together. Service is refined and top notch without being stuffy or pretentious. Prices are a little more than a regular night out, but worth every penny. I would come back here any day if invited.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "I recently dined with a friend in SF. Since she's pregno I let her pick the restaurant...and we ended up here at Osteria. And Italian food is always A-OK by me.\n\nI was leaning towards the calamari steak entree, but when the waiter informed me it was fried I opted for the chicken scallopini instead.  The chicken was scrumptious and I had no problems cleaning my plate...even after eating way too many pieces of their yummy bread.\n\nMy friend's pasta dish looked delish as well. The service was also good & fast...and fast service seems to be a rarity in California.", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Osteria serves up some tasty dishes worth coming back for and the decor isn't tacky like other Italian restaurants. We tried the gnocchi, carpaccio, bruchetta and tiramisu. The bruchetta was a bit different with marinated shaved fennel root. \n\nWe came for acoustic Mondays to see a friend play. The performers were very good. I'm not usually into live music so this is a huge deal for me. The music was a bit loud for my old lady ears and it was hard to chat so we mostly sat in silence or tried to scream across the table.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "neighborhood dining room: warm, bright, cheery and clean atmosphere redolent with beaming waiters, opera singing expediter, seasoned cooks, and delicious food. extremely professional delivery of service, even if the offerings are not on par with san francisco's farm to table/local/sustainable/seasonal food scene. \nThis is a great place to take laid back, easy to please friends and family who you just want to enjoy a fulfilling, quality, stressless, and fun weekday night meal with. smiles vacated the spaces of all faces this evening at this fantastic little italian-american eatery. \nvery good chilled rueda spanish white wine. fresh from the chilled bottled. yum! a must try if you're in the neighborhood and in need of a classic italian 3 course meal. the caesar salad and the spinach/mushroom salad are both 5 star!", "author": "Libra J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "The pasta,  Caesar salad, Italian wine and bread were delicious and reasonably priced and the service was most gracious and fast, as we asked for a quick meal before going to a movie across the street at Vogue. The place was packed and had a congenial feeling. This is the kind of neighborhood gem that clearly has a loyal following. Atmospheric. Able to talk  without yelling.  We are returning\n~ Kare  & Walt", "author": "Kare A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "I find Osteria a bit less pretentious when compared to Garibaldi's (across the street), but alas, San Francisco still does not manage to deliver top notch italian cuisine. The restaurant bathes in beautiful rays of afternoon sun giving it a sort of  golden glow; it's actually quite gorgeous! The atmosphere itself is very calm and serene but is sadly ruined by waitstaff running around like headless chickens. I mean honestly, there wasn't that much business when I was seated but the waiters and waitresses were coming in and out, back and forth, and it didn't look like they were doing much.\n\nWhen I was ready to order, I decided on the house gnocchi as the dough was made fresh in the kitchen and munched on my house bread. Not much to say on the bread; the olive oil was olive-y; maybe they could have added some additional spices like red pepper or parmesan cheese? Either way I was not impressed.\n\nWhen my Gnocchi arrived I was disappointed first in the portion size. When spending $20+ a plate I expect a little bit bigger of a portion rather than just a kids size meal. I finished my gnocchi in about 2 minutes with the intention of making the meal last longer. In a traditional sense, I suppose I should have ordered a main course along with my pasta but even still, the gnocchi was just alright. \n\nMy red wine was great and paired well with the pasta however the gnocchi was quite bland. I ordered tiramisu for dessert and found that tasty and authentic. I probably wouldn't come out of my way for Osteria but I did notice they do take out, which is convenient, if you're looking for a quick decent italian fix.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-24", "description": "Average italian food - I tried:\n1) minestrone soup (lots of vegetables, a bit too much black pepper, and not enough beans)\n2) gnocchi with tomato sauce (nice, but a bit eggy tasting; the sauce could have done with more basil)\nFriendly staff, quick service, family friendly.  Well-priced, and good portion sizes (not too big/small). \nI'd go back at some point.", "author": "Shweta V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "I was pleasantly surprised the food was great I had the calamari it was so tender . My friend had the scampi it was to die for . The salad was good as well as the desert\nWe ordered takeout for someone else gnocchi Gorgonzola perfect. \nService was fine . Greatbplace", "author": "Stef M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Pretty good: very flavorful risotto that was just a tad soft in texture, and excellent Italian lemon cheesecake (lighter than traditional NY cheesecake). The service started out quite good & friendly but over time they forgot about me.\n\nVery nice cozy atmosphere, in a small, quiet commercial district.", "author": "George F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "Great neighbohood destination with a steady, reliable menu. They also have live music on Monday nights--be sure to reserve a table ahead of time for that!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "I don't know why so many are ripping this place.  It's good home style food. Their tomato sauce isn't diluted like Bella, nor are they fancy like Seven Hills.  If you actually do the research on the name \"Osteria\" the definition comes up \"A place serving wine and simple food.\"\n\nSo yes I'm very much a fan of this place.  The food is simple, as their name should suggest, it's got an old style Italian American restaurant feel to it like most Italian restaurants in Chicago and Long Island.\n\nI'm going back and the food was good.  The Spaghetti and Meatballs was good, and their Tiramisu was the way I like it: A bunch of cocoa powder and Kahlua added in.\n\nService was good and the head of the front house actually got pissed off when another waiter told us the cheesecake was ricotta instead of cream cheese.  After mentioning it to the waiter she came to us told us of his error and we ordered it anyway.\n\nSimple, honest food.", "author": "Adrian E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-04", "description": "If you gave this place a 5, you're an idiot.\nIf you gave this place a 4, you're an idiot.\nIf you gave this place a 3, you're an idiot.\n\nYelp has been an awesome sidekick, but sometimes I have to scratch my head and wonder how many idiots are on here pretentiously writing like they actually know about food.  Look at this guy saying \"a shrimp salad in a light Green Goddess-like dressing scooped on top of a sliced tomato...\"  Dude WAKE UP!  It was a spoonful of precooked, preprocessed store bought small shrimp on a slice of butter lettuce and a slice roma tomato!!  Did you seriously enjoy it that much?  You couldn't thrash that together from the safeway dumpster?\n\nMy belle and I came here for a Saturday night date and were very excited based on reviews by you idiots.  The place caters to the 60+ crowd; I know some of you other idiots said it was \"lively,\" but realistically everyone's screaming since they're all hard of hearing.  Whatever, I've volunteered at elderly care places and I enjoy elderly people - but I wanted to clear up the atmosphere.\n\nThe bread was absolutely delicious with the olive oil - if they make the bread there, then I'm seriously perplexed by the quality of the rest of the dishes.\n\nI ordered veal scallopini with lemon and caper sauce.  When it got to my table, I was absolutely disgusted.  The veal was grey, not browned (haven't you heard of a maillard reaction?!?).  The sauce - OMG THE SAUCE!!! It was covered in a greyish, slimy, flavorless WHITE ROUX based sauce with lemon juice and capers!!!!  I took a look around and saw that everyone's food had the same color and was absolutely disgusted.  I can just picture a big tub of roux in the back bubbling away all day.  Whenever they need to make a sauce, they'd mix a ladle full with whatever flavoring agents.  Seriously - the most expensive item on the menu and you cheated.  \nShame on you.  \n\nIs it that hard to make veal scallopini without cheating?  Here's how (and PAY ATTENTION TO THE DAMN SAUCE):\nFlour on veal (helps it brown) - throw it in an oil/butter mix - cook until done and remove from pan.\nSkim fat, put in white wine, lemon juice, and capers and reduce for 2 minutes\nTurn OFF the heat and whisk in a cold tablespoon of butter (Monte Beurre method)\n\nTHAT'S IT!!  IS IT THAT HARD!?!?\n\nWHERE'S ROBERT IRVINE?!?!?!?@!?!?@#!?@", "author": "Nico M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "Every time I come here I wonder why I don't come in more! Wait no - I don't come here more because then I would be SO obese. I love italian food like no other and this place does homestyle italian just right. Solid portions for standard prices and great customer service! I once left a scarf there and called a month later and they had held onto it! They also sometimes have live music which is great!", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-15", "description": "We were really hoping that this would be our new favorite Italian spot. Instead I think we brought the average age down in that restaurant to about 70. The food was mediocre - heavily sauced overcooked pasta and not a very creative menu. We won't be going back.", "author": "Paty H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Came here on a Tuesday night at 7:30pm for my mother's birthday dinner. We made reservations so we were seated immediately in a small little area on the side of the restaurant. They had fresh tulips for the tabletop design. We ordered an appetizer called ANTIPASTO ASSORTITO (FOR TWO) for $20 which has prosciutto, salami, tuna, heart of palm, artichoke and eggplant. I love prosciutto so I was pretty excited to eat this. I loved the artichoke most with its green sauce on top! We then had our own entree. I had the GNOCCHI FATTI IN CASA with meat sauce, my mom had the pasta of the day, and my sister had the TAGLIARINI CON GAMBERETTI. All three dishes were flavorful and we had leftovers because the appetizer was quite filling. We were also served bread with balsamic vinaigrette and oil. Delicious, but it filled us up before the main entree. The service was excellent, though their accent could make it hard for us to understand them sometimes, but they were super nice! Got our bill, to-go boxes, and everything served to us quickly. They also packaged our foods to-go for us. Very closeby home, so I will definitely be back again. I rate this place 4.5 stars for its good service, good food, and decent price for the quality!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-11", "description": "How anyone can give this place less than amazing reviews is beyond me.  I've eaten here a few times - with large groups or with only one other person.  The food is always delicious, and the staff are accommodating.  This past Sunday we showed up without a reservation, with 6 adults and 3 children - the owner's father was the host, and he was so nice to us.  He gave us a long table for the adults, and even allowed us to have a kids table - what restaurant in SF does that?!?!  It doesn't necessarily look like a kid friendly place, but it really is.  The pasta was delicious, and the kids even ordered seconds.  I believe that the previous owner passed away very suddenly a few years ago, and maybe some inconsistency ensued for a while while the family recovered from their loss and attempted to maintain the business.  IMHO, they've done an amazing job, and I'll be coming back here.", "author": "Cori D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-06", "description": "We ate here last night for the first time. The service was good and the pour of the wine was generous as were the potions. The food, however was lackluster and not worth the price. I had the gnocchi, which was actually too mushy. My husband's veal piccata was not good. The decaf cappuccino tasted like whatever solvent was used to extract the caffeine. We were really surprised at how well this place was reviewed on Yelp.", "author": "Rachele F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Osteria is a solid restaurant in the neighborhood.  Not everything is fantastic, but there are some gems,  I really like their artichoke and shrimp appetizer, and their spinach pasta is good.  I wasn't impressed by their gnocchi, and several of their meat dishes have fallen flat for me.  They do have good bread, and I like their olive oil.  The servers are friendly, and it seems like a nice local place without any attitude.", "author": "Scott E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "Osteria Cucina Toscana serves simple, elegant, northern Italian fare in a cozy setting off the beaten track.  This unpretentious neighborhood gem, an increasingly rare find in San Francisco, offers tasty food, an impressive wine list and impeccable service.  Our server handled our large party with finesse and joked with our children.  The owner paid ample attention to her guests, some of whom were clearly on a first-name basis with her.  If you seek good food, good vibes and a good deal, this is the place for you.", "author": "Cat R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "Really good food, but terrible service. We arrived at 5:20 with no reservation. Two couples in the whole place. Then we waited. And waited. And waited. Waiter is looking right at us several times, finally comes over.  We get water, we get menus, and now we wait some more as the hostess stands and chats with a friend (her back to us) and the waiter ignoring us yet again, despite menus closed and to the side. I finally have to get up and interrupt the hostess' conversation so we can order. Waiter is training someone but doesn't sound thrilled about the specials. That's the last we see if him. Someone else brings food. Luckily, the food is good (the only good thing). Hard to enjoy, though, when several people insist on serving the table next to us with their butt practically resting on my place setting -- despite the table on the other side of this couple being empty. It was just all-around frustrating and we felt like we weren't up to their standards.", "author": "H C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "I absolutely love this place!  We live in the East Bay, so it's a haul to get there for us but this is some of the best Italian food I have outside of Italy and better than much of what I have had in Italy.\n\nI admit I am in a bit of a rut as I always order the same thing plus a different dish each time to share but I dream about their carpaccio which is to die for and the veal piccata which is so tender and the lemon in the sauce is just right.  My wife and I shared the lemon cheesecake and it was so creamy and just the right amount of lemon flavor.\n\nJust a great neighborhood Italian restaurant that I go way out of my way to get to.", "author": "Dalr R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-12", "description": "I have to admit I rarely write reviews on Yelp because usually the places I go to have a ton of reviews already. After my experience at Osteria I felt compelled to write one, because my dining experience was TERRIBLE! \n\nService: Was fine nothing special\n\nPrice: I looked at the website to get an idea of the prices and it looked very responsible for the neighborhood. When we showed up the prices on the menu were all higher from the glasses of wine to the entrees...WTF who does that!\n\nFood: Cheep ingredients, horrible presentation and bland bland bland! truly pathetic and shameful ESPECIALLY  because the entire restaurant is run by Italians!\n\nI'm baffled by how this place is still in business and that it seems to be always busy. \n\nSTAY AWAY FROM THIS PLACE!!!", "author": "joshua g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-22", "description": "After walking by this place pretty much every day for the last few months I decided it was finally time to try it! I must say I was a little disappointed. No, it wasn't terrible at all, but it definitely wasn't worth the months of curiosity I allowed it. \n\nThose who say the place is \"buzzing\" are likely confusing the sounds of a hundred hearing aids for frenzy excitement. Definitely attracts an older crowd. Everyone there seems happy to be there though. \n\nFood was neither great nor terrible. I actually think the bread was the best part although I ordered the poached salmon and thought it was decent. Everything was a little over sauced - makes sense since the place is packed with deteriorating taste buds in need of accommodation. Not a bad place but not great either...", "author": "Zoey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-27", "description": "I am sorry, of all the restaurants in SF I would save a dining trip and just order in if you are thinking of eating here. Or if you are too lazy to boil your own dried pasta and add canned sauce. But I think there are those that may need that service, therefore the extra star.", "author": "Kourtney P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "We wandered in here before a comedy show.  The place was buzzing.  We didn't have a reservation.  The hostess told us that she would try to squeeze us in and we negotiated with her that we would be done by 7:30 since we had a show.  We did get a table!\n\nThe waiter was great and made it a memorable experience.  We shared a heart of palm salad with peppers.   The gnocchi was really really good.   \n\nIt is a sweet neighborhood spot and the people at the table next to us started talking to us.   It was all fun apart from the hostess who just didn't fit the atmosphere.   When we left we didn't understand why she made us feel like she was doing us a favor by giving us a table - there was no evening rush.  Oh well.  I will definitely be coming back here for the food, wine and great waiters.", "author": "Ayelet B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-28", "description": "Just ok. It is a local spot that you go to if you are in your neighborhood. I got the spinach pasta with chicken and mushrooms. The pasta and sauce were good but it was really hard to find the chicken and mushrooms in this dish. Butter salad was over dressed. Wine list was awful. \n\nI think this is more of an older person place. We were visually the youngest people in the room. 55 and older is the crowd which is not a problem but was a strange coincidence. Felt like we hit an early bird special. \n\nLast but not least - I don't think anyone who works there is Italian or even Italian American. \n\nCiao", "author": "Doreen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-24", "description": "This is a solid 3 1/2 star spot.  We live in the neighborhood and had never experienced Osteria and walked by a million times so decided we do a double date there. \n\nWhile I think our young age shocked the wait staff, the service was good, sometimes awkward but I chalked that up to them being shocked that a group under 55 was there for dinner on a Thursday night. \n\nI had the tortellini with meat sauce which was quite good, the Caesar salad was also tasty.  I wasn't a huge fan of the artichoke bottoms, i didn't like the sauce and thought there were too many shrimp plainly sitting on top of it.  Just not what I expected maybe? \n\nLike a said, a good 3 1/2 star spot.", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-21", "description": "I'm really sad to read all these mediocre reviews...maybe you guys just aren't ordering the right stuff? The best pasta I've ever had is from here, and ok maybe I'm a little bias because it's the only thing I've ever ordered...but hey if it ain't broke, don't fix it! If you want a guaranteed delicisous meal, order the spinach pasta with shrimp. It's simple, with a light garlic butter sauce and fresh ingredients. The spinach pasta is house made and is always perfectly cooked to al-dente. The ceasar salad is super fresh and tangy too. I think the staff here is great- very personable and cheery and always happy to see you.", "author": "Kara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "Solid Italian fare. Linguine alla vongole (red and white!) is great. Daily specials usually good. Only complaint is wine list is a bit sparse without having a couple of stand by classics. And no chianti (recent issue)?  Doh", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "Trajesty after trajesty I finally had a good meal! \n(Trajesty = Travesty + tragedy) \n\nCame here with the whole family and it was a really good meal. Above average Italian can always cheer me up! The restaurant was able to seat our party of 16 right by the front window. A little cramped but it worked. Bread, water and oil were plentiful and of standard quality. I ordered the prosciutto and melon appetizer, tomato-basil gnocchi entre and tiramisu for dessert. I won't attempt to recall what everyone else got, but the bites I had were all good.\n\nMy only complaint of the meal was of the prosciutto to melon ratio. The prosciutto was excellent alone but was overwhelmed by the ammount of melon. Maybe that's how it's done in Italy, but in America I want more meat! \n\nThe gnocchi was excellent! Perfect chewy, perfect tender and perfect portion size for me.\n\nhttp://www.yelp.com/biz_photos/-QCX1EAgUQBBrbddDkPK8g?select=_XPnqtkn51_YaRFP19pDng\n\nTiramisu was average, nothing wrong with it at all, but I've had better. \n\nSadly, given the number of Italian restaurants in SF, I doubt I'll ever come here again by choice.", "author": "Eli G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-18", "description": "food is okay. simple italian food, nothing exceptional.  would give them three stars, but the little cockroach on the wall staring at me brought it\ndown one star.", "author": "Girly Foodie F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-30", "description": "Fresh & flavorful pasta in a cozy neighborhood restaurant, but terrible and slow service for a large party of 14. Hostess was very unwilling to resolve our 14 person booking when the table was set for 12. Food came out extremely slow, given what seemed like a lack of kitchen staff and waiters. But very odd for some people to get their dishes when the rest of the table was finished eating. The best part was the eager Asian cheese grater man, he definitely lightened the mood for us!", "author": "Sheena Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-09", "description": "If you are a young adult I recommend not coming to this place. While the food was good, the service was horrible. Not only were the staff rude and condescending towards us when we were ordering, but the manager managed to stop us when we were leaving and claim that we were 'dining and dashing.' The bill was on the table, and he said that it was \"hiding.\" To the people of Osteria, just because you're young doesn't mean you don't have money.", "author": "G T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "Delicious food. I usually avoid marinara sauce, but I will be getting it next time I go (the bite I had of my friend's meal was delicious). The waitstaff was attentive and humorous. If we had not been at a table in the corner, the meal would have been very loud, but that's too be expected with such a small, busy restaurant. The meal was less expensive than I thought it would be considering the neighborhood. Over all it was a good experience and I'm sure I will be back.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "I came here for the first time last night to see some friends play. (Every Monday is \"Acoustic Bistro\" that has 3 different singer/songwriters perform). Everything, from the wine, to the bruschetta (I usually hate tomatoes) to the calimari steak mungnaia to the gelato (a delicious combination of safron and pistachio) was mind blowingly delicious. The wait staff was wonderful (Minh is amazing), and I enjoyed the intimate setting. I would definitely go back!", "author": "Lindsay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "We met friends we haven't seen in over a decade. We had a big table near the window, enjoyed a great meal, and had some very good bottles of wine--I just told the server to pick what he thought best and he was spot on with a a white and several more Italian reds that matched up great.\n\n I'm not an expense account guy anymore, I teach school, but one thing I know is sometimes just let the place and the server simply 'take care of you\" in old school Italian places and they never disappoint. Osteria is one of those places where I'd walk in and just say-Antipasto, soup, salad, and pasta- Bring us what you think is best as well as the wine that complements the food.\n\nWe just wanted to enjoy a good meal and re-connect with our friends instead of fretting and stressing over the food. Osteria did a great job. I felt like I was back in the dining room of my Italian American friends growing up in Stockton. The food was great, but the traditional SF/Italian menu made it easy to get something good to eat and allow us to focus on our fellowship, not worry if we ordered something goofy.\n\nAntipasto-outstanding\nPasta w/Clams-just the right amount so I would feel like a bloated pig\nGnocchi- all who ordered it, loved it!\nSalads-perfect and the dressings were all fresh\n\nParking is SF standard-a challenge sometimes but a good walk is a good thing in the neighborhood.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "This is a charming neighborhood restaurant with friendly staff and great food. I went twice in three days and enjoyed home made eggplant pram, veal piccata and a fabulous cheesecake. The wine was delicious too. \n\nFor a single woman traveling alone, I was welcomed and completely comfortable.", "author": "Susan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "This was a nice little cozy place. The lasagna was exceptional, the prices were reasonable, and you must try the lemon cheesecake. Moreover, I've been trying to explore the neighborhood (Laurel Haights) and this was a first nice experience.", "author": "Josué H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-26", "description": "LOVE this restaurant!  Really enjoyed the wonderful food, excellent service, and unpretentious, friendly atmosphere!  My taglarini (pardon the spelling!) with bay shrimp, lemon and garlic was sublime.  My friend (who's birthday we were celebrating) enjoyed her linguini with clams just as much!  The icing on the cake -  so to speak - came when one of the very talented waiters came over and serenaded my friend with an Italian rendition of \"Happy Birthday\" in his fantastic operatic voice.  And speaking of dessert, tiramisu rocked as did the Gran Marnier custard.  What a feast!\n\nThe staff told us they will soon be opening up on Mondays featuring entertainment by Rome Bauer (wonderful singing waiter, who surely has a future on stage.)  Sounds like the Monday night menu with have a choice of small plates to be enjoyed with cocktails - sounds like a winning combination!  \n\nI will certainly bring family and friends back to this neighborhood gem - it's a treat!!  Thank you to all who made us feel so welcome, and for the fabulous dinner!", "author": "Runr G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "A gem of a little neighborhood Italian Restauran.\n\nEnded up in the area and wanted a place to eat without driving around.  Glad we ended up here.  Very nice place.  May not win a Michelin star but tasty food, nice people, good atmosphere, and good service.  Actually liked the fact it was not a crowded tourist place.  Really enjoyed it.", "author": "L R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-19", "description": "Maybe it was just a bad  experience, but it made me never want to return here again it was so bad. A group of friends and I ate here during a night with a set menu. \n\nFood wasn't great, portions were redonkulously small, and the prices were insane. If that weren't enough the server was a complete a-hole and further ruined the experience with a shitty attitude and arrogance.\n\nGiven, we were a group of guys in our early 20's so he may have been less than excited to serve us; however, little did he know how sophisticated a few of us were and we all live within a 10 block radius and how winning us over could've produced 4 more patrons that tip really well. Whoops!\n\nIf you are considering this place, I would say walk across the street and stroll into Garibaldi's, it's much better. Or Laurel/Sociale up the street a bit (Sacramento)  is really good too", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "Ok, I'll admit it, I've never met a potato I didn't like, and will die to try gnocchi anywhere.  \n\nThis place was incredible, and the best gnocchi I've ever had.  Soft pillows of goodness, that actually tasted like potato, instead of starchy nuggets  (i had the tomato and basil sauce).  Really really good.\n\nAlso, we started with the assorted antipasto, which had three different types of cured meats, and heart of palm and artichoke hearts, all on a bed of bibb lettuce.  \n\nThe place had excellent cordial waitstaff.  \n\nReservation on a Saturday night is a must.  All in all, a cool place that I'd visit again.  Awesome for date night.", "author": "Beth V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "We have considered Osteria a wonderful place to enjoy very good food--the gnocchi are the best ever; the wait staff is attentive and friendly; and the hostess is welcoming.  But we are put off by the host.  Would someone please tell him to get a decent haircut and comb his hair, wear clothes becoming to a white-table cloth restaurant not the worn blue jeans and tuck his shirt in at the waist and look like a professional.  His unkempt appearance lessens the pleasant atmosphere of this restaurant. \nThank you.  I hope for improvement to this otherwise great neighborhood restaurant.", "author": "Deanna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "Wonderful dining experience. Made reservations for large party and arrived with table ready.  Small restaurant with beautiful and understated Italian decor.  Some house wine and sourdough while waiting for orders and looked around and observed locals come in and pack the restaurant on this Tuesday night. Delightful!!  Food was delicious and pasta homemade. Loved the chicken Parmesan and the scampi.   Waiters were attentive and we met the owner.  The whole experience of food, gracious owner and local diners provided a wonderful evening for us. Loved it so much went back the next evening and same consistent experience.  Food was delicious but sometimes the dining experience is more than just the food. Try this place!", "author": "Jill M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "I can't say enough good things about this charming neighborhood restaurant.\n\nFor our 30th wedding anniversary my wife and I decided to trip across the bay and spend the weekend in San Francisco, where we met.\n\nWe stayed in the Laurel Inn where they recommended Osteria for dinner. We ended up eating there twice.\n\nEverything previous reviewers said about the gnocchi was correct. I couldn't decide which sauce I wanted so the waiter suggested half and half. Both were delicious. Like \"butta\".\n\nThe second evening I had calamari. It was the most tender calamari I have ever eaten. The sauce was perfect.\n\nService - Great, Atmosphere - Great, prices - reasonable.\n\nI could go on for pages but I think your table is waiting. Enjoy", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "Crema Gianduia, yes, it's worth going just for this.  It gets better everytime I go.  I SO want the recipe.  Having it would not deter me from enjoying Osteria at all, I'd just be fatter from making this awesome desert at home.\n\nThe food on each visit has been consistently delicious.  This is one of my favorite spots in town for a dinner.  The staff are friendly and care about the quality they are serving.  The place is packed every time I go, so it's obvious others love this place as much as I do.\n\nThe only complaint I can offer is that the restaurant can become very noisy.  It's popular, tables are close and no carpeting means the noise level can get high enough to enable you not to hear some of your dinner companions.  Once the food arrives, the conversation can stop dead anyway.  The sign of a good meal, too busy eating to talk.\n\nI've upped my review simply because after several experiences dining here, they're consistent with dishes I've tried before and even better with the new (to me) or seasonal dishes.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-11", "description": "Lots of people in the restaurant we were hoping the food was as good as it seemed! Unfortunately, the menu was much to be desired, the waitress was slow and non responsive to our requests, and the food was bland and boring. I was so disappointed!\n\nWe were warned not to get the artichoke shimp dish AND the shimp salad app because that would be \"two shrimp dishes.\" What our waitress didn't tell us was that it was the EXACT same dish except one didnt have artichokes. The dish was even plated the same, no different sauces or anything. it was so bland and such a disappointment.\n\nWe then ordered the spinach salad. The vinagrette was non-existent and where it was on the plate it was TART. There was no substance to the salad. they put the dressing on the bottom and the dry leaves on top. Interesting, but not good.\n\nI hope we just ordered the wrong thing, but then we also had the proscuitto,pea, tortillini dish. That wasn't good either! Missing flavor, too aldante, and the tortillini were similar to the ones u find int he grocery store under \"Burtoli\"\n\nI was very unpleased with the meal. I was hoping to get out of there but no. Our check didnt arrive until 15 minutes after we requested it. It had already taken 10 minutes after we had finished eating for us to give up and ASK for the check ourselves.\n\nReally horrible experience. Too bad because its in my neighborhood!", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "Came here with my co-workers to have a gathering few times.  It looks like a neighborhood restaurant with simple setting and moderate decoration. \n\nMy impression of this place seems to be a bit cramped.  When it is packed with people this place gets loud.  Even though the environment is not as comfortable as one think, the food is not bad at all.  \n\nWe usually order the carpaccio for appetizer, caesar salad, a pasta dish, a bottle of chardonnay for dinner.  As for dessert, they have good solid favorites.  However, the price is a bit high in my opinion, but overall this is a good, solid italian restaurant if you don't want to eat at Olive Garden.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "It saddens me to see so many unflattering reviews of Osteria. I've been a number of times when I'm in San Francisco on business and every time I come out raving.\n\nEvery time I go the service, food and ambiance is exceptional, and I look at Osteria as an oasis for this tired road warrior. When I go out to eat, I do so alone, so it's not the most fun experience, but when I'm there I always have a good time.\n\nI've never ordered anything that I didn't enjoy, the servers make me feel at home and the owner is a wonderfully sweet woman.\n\nIt really is one of my favorite Italian restaurants anywhere. It has a great family feel in the ambiance and staff. The food isn't too heavy or too light, and the deserts are amazing.\n\nBased on my experiences there it's a no brainer... go, have a good time and enjoy a great meal.", "author": "Max S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-18", "description": "Wonderful service, and authentic Italian food. I eat here twice a week! Ignore the bad reviews b/c the staff here makes you feel like you are fresh off the boat just like the owners.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-06", "description": "Great customer service!!!  Real good linguine and clams!! And a really good open environment!!!\n\nWe were treated as if we were their first ever customer, or at least that is how they made us feel.  Imagine a party of 5 coming in your restaurant at 5:30pm on a Saturday without reservations.  Yeah, that was us... Before they even committed to seating us, we were given a dose of that lost art called  customer service.   Based on their kind approach and their attention to our need, I would have still written this review even if they could not have seated us.  However, we were fortunate, and they made room for us, and  treated us as if we were one of the their regulars.\n\nBottom-line -- Great service...and really good pasta...the coffee and cheese cake was pretty good...Great service!!!", "author": "Ron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "I absolutely love Osteria. I have been going there for years, and have always experienced consistent, friendly service and delicious meals. This is a cozy, neighborhood place that has its \"regulars\" (including me), who dine there often and are known by the staff.  However, even if you are not a regular, they will always greet you with a smile and make you feel welcome. Their ingredients are fresh and tasty and are presented pleasingly.\n\nIt seems like a lot of the reviewers have criticized the older age of Osteria's patrons or its less-than-trendy atmosphere. That is exactly what I love about this restaurant, and what I sometimes loathe about the \"hipper\" spots in other neighborhoods. I like that folks don't come here to see or be seen, but to have a great meal in a comfortable atmosphere.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-13", "description": "We had a belated date night there last Friday. Although the ambiance was lovely, the food was OK. We got dressed as that was what was indicated by the times I have walked by, and when we got inside, lots of jeans. Ahhh hate that mix match dress code. \n\nAnyway, we had the shrimp w/ pesto like sauce and hearts of palm. Which was great, bu my shrimp mountain was frozen in the middle. Major bummer as it was good. I had the eggplant parm and the beau had veal. Both very good, but the lemon cheese cake was where it's at. Soooo good, delicacy and creamy. \n\nWould I run back, probably not, but at least we have another Italian option in the neighborhood.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-04", "description": "Well I came here on the recommendation of my best friend from high school David who was in town with his wife.  He chose the spot and I am always open to new places so was excited to try something else in this neighborhood since I don't get out there that much.\n\nOsteria is a nice little spot with friendly service and very neighborhood feel to it.  Seemed like many of the diners knew each other as evidenced by bottles of wine being bought for each other and convo after their meals.\n\nI'd say the food was pretty good but not unforgettable.  I'm not an expert on Italian but I have had some memorable meals at Delfina and A16 and Osteria wasn't quite at that same level for me.\n\nThere's nothing wrong at all but it just didn't have that extra special-ness.  It was a Tuesday when I went so definitely not a big night and there were just a few other groups in there.", "author": "Gene X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "It is with great sadness that I give this two-star review as we have been going here fore years. Food and atmosphere are fantastic however the poor service at our recent trip to Osteria was unforgivable - servers were friendly but woefully inattentive. We were seated on Valentine's night at 8:45pm. Halfway through our meal, our waiter sat down at a back table, began eating a dinner of his own, and completely forgot about us. Normally this would not have been a problem if other servers had picked up the slack, but we were left for over 20 min without anyone to ask for water refills, bread, more drinks, etc. We paid $65 a piece for the prefix and expected more by way of service. Was a complete buzzkill on an otherwise nice evening.", "author": "Russell M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-12", "description": "Really nice place, but it is expensive and it has the fancy style feeling on it. \nThe waiters were nice, but they were all over the place running from corner to corner. \nFood was good but nothing special... I liked the family owned feeling on the restaurant.", "author": "jaime b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "Years ago I lived in this neighborhood.  This past weekend, in San Francisco for a wedding, we stayed at the Laurel Inn and walked up the street for dinner at Osteria.  It was great  Wonderful service, food was great, really a terrific neighborhood restaurant.  I would definitely go back.", "author": "Stuart S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "The food is always reliable at this quaint spot, and the  prices are very fair. There's rarely a significant wait, but there are always lots of happy diners inside - perfect.\n\nI typically get the salmon, which is a bit on the lighter side - very fresh tasting. But most recently, I indulged in the tortellini della casa, which is a tortellini in meat sauce - outstanding Italian comfort fare.\n\nThe host is friendly and enthusiastic, and his servers get the job done. As one of the few restaurants in this 'hood, it pleases.", "author": "Kiesha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-11", "description": "very nice and warm atmosphia.\nNo.1 Italian in town !\n\nFriendly staffs and great fods.", "author": "Osamu I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "LOVE this place! Love that you can tell this is where the natives go. Very friendly atmosphere, along with friendly fellow diners. Small and intimate. The food is always so good, and I end up taking leftovers.  I wish they had a full bar, sometimes wine just ins't enough after a looooooong week!", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "Osteria has to be my favorite Italian restaurant in the city. It's simple, fresh, and delicious. The service is excellent and the waitstaff is always eager to please. \n\nA few of our family favorites: \n\n1) The Gnocchi: these fluffy little pillows of tastiness are the best I've ever had. We usually go for the Gorgonzola sauce but the Pomodoro is equally good. \n2) Veal Piccata: bright and robust flavors, tender veal cutlets. \n3) Tortellini de la Casa: tortellini with a hearty meat sauce. \n4) Tiramisu: not your standard brick of cream and sugar! Osteria's tiramisu is lighter and well-balanced.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "This is at least the 2nd if not 3rd review I have written about gnocchi.  But for real- the gnocchi at Osteria is sooooo good.  I like that this restaurant is super cute and nice and in a somewhat unexpected location.  Reasonably priced, and the people who work here are absolutely lovely.  Definitely make a reservation if you can because it is small, and thus fills up quickly.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-01", "description": "Nice neighborhood type restaurant. I had the Caesar Salad- blah bottled salad dressing and not well tossed. For dinner I had the pasta with clams in a white garlic sauce- very nice flavor, perfect size portion. Prices very fair. Decent service.", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "Our favorite italian restaurant in SF. The tortellini and gnocchi are belissimo!!! Ambience is very homey and casual, no frou frou here. Just down right good italian cuisine.", "author": "Joanne R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-31", "description": "Osteria is a good neighborhood restaurant. The food and service are good. The gnocchi was very good. The restaurant is very loud. Recommend making reservations since it was quite crowded on a Saturday night.", "author": "Garrett H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-15", "description": "This place specializes in mediocrity.\n\nIn fact, it excels at mediocrity.\n\nHo hum service (do you think you can get that plate down on the table OK? Could you please not spray saliva  on me as you recite the specials?)\n\nBad food. Bad food.  Bad food.  (well, the bread's OK)\nEXTREMELY limited menu.  Veal, veal, and if you don't like that, there's veal ravioli.\n\nNice-ish atmosphere. Good intentions. But doesn't Osteria mean they serve oysters?\nThey don't.  I think that might be beyond them.\n\nBut really, it's all pretty clueless.  In a town of a zillion Italian restaurants \nand quite few amazing ones, it's just plain hapless to be as yuck as this place\nJust the other night, I found a spot FAR  better (yea), for the same price range.\n\nThere  is an ilk that patronizes this place (accustomed to eating at Applebee's), and as for me, never again.  Dey ain't got no clayusss.", "author": "harmonia b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-13", "description": "Some of the best Italian food in Laurel Heights. It's authentic, small, homey, clean, overall always a pleasant dining experience. Large helpings, dress nicely, and enjoy how magically tender they make their chicken. \n\nThe staff is so very friendly. My bf and I walked in once after a long bike-ride looking like a pair of total ragamuffins with no reservation on a Saturday night. They sat us asap and treated us with such kindness. It's not a toddler-oriented place, but the true gentleman of Osteria tolerated my rambunctious niece and nephew with great patience. No disaffected 'hip' young waiters here! \n\nGreat for to-go dinners, always healthy vegetarian options, good wines, a little on the heavy side- may want to split stuff.", "author": "R J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "Came last week with my girlfriend and had a delicious meal. She had the veal with mushrooms, while I chose the prawns in a creamy garlic sauce.. Both came with an assortment of vegetables that were tender and perfectly seasoned. We shared dessert, a chocolate-hazelnut custard with a caramel sauce that blew us away. In addition to the great food, we experienced great service. Will definitely return.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "Was introduced to Osteria by a family friend and decided to give it a shot.  Overall, really pleased.  The service was very friendly, the meal was nicely presented and perhaps most importantly, the food was hot when served.\n\nIs Osteria a 5-star place?  No and it's not trying to be.  It's a very clean, friendly and reasonably priced neighborhood restaurant in a nice area of San Francisco.\n\nI'll definitely go back when in the mood for a casual and satisfying meal and a good glass of wine.", "author": "Robert N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-28", "description": "I have to agree that this was a pleasant surprise for Laurel Heights.  The ladies and I enjoyed a nice pre-movie meal here and will definitely be back for more.  \n\nWe started with a nice, reasonably priced bottle of the Vermentino and the antipasto plate, which was fresh and filling.\n\nI am a huge fan of gnocchi and try to get it at any restaurant where anyone says they \"specialize\" in it.  Even at the very best restaurants in North Beach was I disappointed.  However, Osteria was a different story.  Their gnocchi were like little pillows of pleasure in my mouth!  Heavenly.  They were also very accommodating with switching the sauces, which allowed me to pair the pancetta, cream and peas with my pleasurable pillows : )  Everyone else agreed the dish was great, as was the special of the evening- porcinis, tomato-cream sauce & sun-dried tomatoes (which they also gladly substituted gnocchi).\n\nAfter all that indulgence, the bill only came out to $82.  I'd gladly pay more for such a wonderful night out.", "author": "Tara G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-09", "description": "Don't eat here.\n\n(unless you have blue hair, dentures and no tastebuds -- if that's your deal, this spot's for you -- oh, probably best if you can't hear, either, since it's noisy)", "author": "C'est La V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-01", "description": "Great Caesar's ghost, the gnocchi at this place is incredible. Imagine if the contents of a divine down comforter were enveloped in a rich gorgonzola cream sauce -- except that sounds gross.  Trust me, it was delicious.\r\n\r\nI made it clear I was just a working stiff on my dinner break and the service was prompt and courteous.  The room warm and friendly and not at all geriatric -- the crowd was mixed ages, if a bit tonier that what I'm used to.  The staff was chatty without being invasive.", "author": "Tailypo W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-30", "description": "I went in very Hungry and you know when you are hungry typically anything is great food. But it was terrible. Also the price was way to high and it took to long.", "author": "rsa s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "good tortellini and wine. good bread, but not enough of it. pretty good service. great music and atmosphere for a monday night. I would go back.", "author": "Chancelor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-08", "description": "I think some of the people who have rated this low have mistaken it for another restaurant.   Hands down my favorite Italian restaurant in SF.  Having lived in the City for over 10 years and in the area most of my life, before moving down south, whenever I come home I make a point to set a reservation.  It's just good food served by people who care.  The same cast of servers is there every time I've been in over the last five years -- that tells you something.  There is no pretentiousness and the prices are more than fair.  It's a great neighborhood joint with a family feel.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "Great Food---not \"scenester\"--but Great Food!\n\nOkay, so the vibe isn't hip or trendy, but the food is amazing. Just went to Osteria last night. I had done my research in advance and wasn't impressed by the wine list so I opted to bring my own bottle of '97 Barolo. At $15, the corkage fee is well below the outrageous price that other SF restaurants charge.\n\nWe started with the prosciutto dish and shared the radicchio salad---the dressing on the salad was perfect. Oh, and the bread and olive oil were both fresh and aromatic.\n\nWe then moved on to our entrees. She had the gnocchi was some of the best either of us have had in the city. I opted for the spinach pasta (Tagliarini Contadina) with chicken and shitake mushrooms in a tomato sauce. This dish was incredible. The pasta was fresh and cooked to perfection and the sauce was not overbearing, but instead highlighted the fresh pasta and the other ingredients. Both our appetizers and entrees were recommended by our waiter and he was spot on.\n\nThe service at the restaurant was excellent. We had a two hour meal and were allowed to enjoy our wine without being rushed through the courses. We ended with the tiramisu, which I wouldn't consider the best I've ever had---but it was decent. \n\nOverall, this was a great dining experience and you just can't beat the prices for such high quality food. I will definitely be returning to Osteria to try the other enticing dishes on the menu. \n\nPlease keep in mind, this is NOT a wine bar. . .it's a full service restaurant. So, for those of you who want to sip wine and don't want to eat---well, there are many other options not too far from the Vogue theater (Nektar, Terzo etc.).  \n\nSo be open minded, give this place a try and don't be so bothered by the \"older\" crowd. After all, it's about the food and not the other patrons, right?", "author": "David R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-12", "description": "This place is great!  I really love the family owned feel of this restaurant - from staff to the customers.  Perhaps this was because I went on Sunday night.  But it doesn't matter, I'd go again just on Sunday for the same vibe.\n\nMy friend and I had the vegetable soup, poached salmon with lemon, and angel hair with fresh tomatoes and basil.  I liked the angel hair the best.  It was extremely tasty and I highly recommend this dish.", "author": "Alan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "Gnocchi was as delicate as everyone said but the sauces on the two gnocchi dishes were on the bland side. Bolognese very good. Price very reasonable for such good food.", "author": "M W K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "Came here with some friends - one of whom is a regular here with his wife. A quaint little bistro-like environment with very friendly servers. Everyone was always smiling and so polite. Even the patrons looked like they were in a better mood just being there.\n\nI really appreciated the ambiance - tightly packed and plenty of energy, but never feeling like someone was peering over your shoulder or vice versa.\n\nThe food was also equally as pleasant. The carpaccio was delectable and the melon/prosciutto was very fresh. Entrees were well-sized and you definitely get your money's worth. They're packed with flavor and they carry a tone of authenticity with them. \n\nThis place reminded my wife and I of our honeymoon in Italy. For that alone, I have to recommend Osteria. Definitely an enjoyable experience.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-07", "description": "A cute & cozy place with good food at a great price.  Walking into this place, I thought it would be expensive, but it's pretty average.  The portions aren't huge, but will fill you up.  There's only street parking, but oddly enough, we found a spot right away.  I would definitely come back here.", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-08", "description": "My friend and I were seated very quickly on a bustling Sunday evening. The guy that seated us was a manager / head honcho of some sort and he was extremely friendly and polite, despite all the bustling going around.\n\nThis place is indeed a locals type of place...and in Presidio Heights/ Laurel Village, that means families and older folks. I didn't mind this at all, and despite what other reviewers said, I don't think I was treated any worse. In fact, I felt I was treated extremely well.\n\nMy friend had the eggplant parmagian, and I had meat-filled tortellini in meat sauce. (Tho if I were more decadent I'd go for the cream sauce). Fresh sourdough bread came with fresh butter (mmm, bread is only an excuse for butter), and then our server/manager gave us an extra special dipping bowl of love... a blended combination of fresh raw garlic, basil, oil, and balsamic vinegar, this sauce contributed to our eating about an extra half loaf of bread each!\n\nExcellent value for the dishes - only a few dollars more, in some cases, than an entree from the Pasta Pomodoro chain...if you can get this homemade stuff, why ever go back to PP?\n\nMy only regret, since my belly is so insatiable, is that the portions were too normal. ;) That is, with just an entree and a few slices of bread, I was still hungry. I needed to eat a lot more bread and thankfully that green sauce helped me pack it away. I guess that's when ordering appetizers actually would make sense. ;-)", "author": "Liz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-16", "description": "I've been going to Osteria (no relation anymore to the Osteria in Palo Alto, btw) since it opened back in the early 90's. The food is excellent and consistent, the price is reasonable and the staff is always friendly.\n\nI don't know what Faith S. means by looking like Pacific Heights people, but we are just average Joes that like good food (the sauces are all homemade...I especially love the salmon and chicken sienna) and don't live in the neighborhood BUT enjoy the neighborhood feel. I don't like trendy, yuppie restaurants.\n\nThe weekends can be crowded, so I prefer to go during the week. Osteria has stood the test of time with its consistently good food, reasonable prices and friendly service (most of the servers have been there since it opened and always remember us with a smile).", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-28", "description": "I've been eating at Osteria semi-regularly for the past 3 years. The food is always good, especially for the price. My husband and I both love the tortellini with proscuitto, as well as the caprese salad.  The homemade tiramisu is the best I've ever had - although a bit much to eat by oneself. The gnocchi is also very good.\n\nIt's a good idea to have reservations here. I think they only keep a table or two open for walk-ins, especially on a weekend.  Every time we call at the last minute, they are full.  On all but one occasion, however, we have been able to walk in.  By 7:30pm, the place is packed. The crowd is often a bit older so it's not the most hip spot but it is a good meal and the staff is friendly.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-21", "description": "I've come here 3 times total in the past 6 months. Made reservations after the first time (learned my lesson). Every time it was a great experience, with great food, great waiter, great host, and even a great busboy. I'll definately be coming back. Their desserts are yummy every time as well.", "author": "Katia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "I'm really surprised at all the negative reviews. My girlfriend lives down the street and we've been in a couple of times when we didn't feel like driving to other favorites.\n\nPersonally, I'm not big on Italian (Asian food's my thang,) but I've enjoyed everything I've ever had there, the staff (especially the owner) have been really nice (complimentary dish once and an after dinner cocktail another time,) and the prices are reasonable. Furthermore, I don't consider myself to be crusty; on the contrary, I'm probably one of the  younger (and sketchier) customers they have.\n\nIf you're not an ageist, check it out.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-17", "description": "Weak food but great service.  My girl ordered shrimp pasta, and the shrimp were those frozen mini-shrimp dudes.  I ordered gnocchi and it was decent, but nothing to rave about.  The waiter was awesome, but the prices were way too high for the crap food they serve.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "We had a table reserved for five, seated right away, great waiter and service. Had the tortellini, linguini with clams, and angel hair pasta. All al dente and well presented. Stayed for tiramisu, cheesecake, cappuccino. Will come again. The salads look good too.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-12", "description": "Some dishes at Osteria are really good, and some are average. The chicken special is usually good. The tiramisu is probably the best thing to get here - we sat next to a table that ordered a second one after powering through the first one.", "author": "Laralynne B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-27", "description": "I've dined at Osteria twice in the past month for business dinners. Overall, the food is pretty good, the gnocchi is  *amazing*, and the desserts are sublime. \n\nThe space itself is trattoria like, and yes the clientele tends to be older....which makes sense given its proximity to the retirement center and its location on Sacramento street near the part of Pac Heights with all of the stately mansions.   In response to Alan E.'s review about aging and us \"younger folk\", I would like to say that the staff at this restaurant do not seem to treat customers of diverse ages equally, and this was evident to me in both visits.  Yes, we all age, some more gracefully than others, but at this restaurant there is a clear bias of catering to the older crowd. \n\n When I entered the restaurant I stood at the front waiting for someone to come greet me - somebody (the Maitre D? perhaps) came to greet me with a blank look....no hello, or even a good evening. I had to speak first, and then I was seated and the bus boy brought me some bread and water. No hello even from the assigned waiter (perhaps I would like a glass of wine while I wait for my companions?) Contrast that to the elderly party of three that came in right after me: that were greeted immediately, and kindly escorted to their table. The waiter was over in a flash with the specials of the day, with not a glance in my direction (I was seated at the next table!)\n\nI also agree with Karen F.'s review about being too loud, such that the other customers complain. I won't get into too much detail here, but one of our party was wearing a *medical device* that evidently some other customers were complaining about. We explained the need for it. Did we receive any empathy from the Maitre D' or owner? No, none. Instead, we were asked to rectify the situation so as to appease the other diners.  Sadly, our comfort , or shall I say discomfort, was of little regard to the restaurant.\n\nOverall, the food is good here, but the service is not. If you want to experience a fantastic neighborhood, locals only Italian street with a diverse clientele, delicious food and gracious service, go across the street to Garibaldi. You'll find it all there and more. \n\nAs for Osteria, three stars for the food, but minus two for the service.", "author": "Suepattra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-19", "description": "Always delicious.\n\nOsteria is a great find for a casual, intimate Italian meal. Despite the neighborhood the place is quite unassuming, the meals are respectably priced, and the atmosphere is romantic and inviting. \n\nI've been on several occasions and particularly love the gnocchi with Gorgonzola. Both the pasta and sauce are delicious and sumptuous, but still light. \n\nI've also had the prociutto di parma & melone and carpaccio appetizers, and the veal scallopini..all of which have been superb!", "author": "Trish C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "The food here is just outrageous!  Have a gnocchi dish.  They melt in your mouth.  The biggest problems are the cramped seating and the noise level.  Avoid being seated near the kitchen because the bustle as the servers swish by, and the noise in the kitchen, are very distracting.", "author": "Josie O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-28", "description": "I used to really like this place years ago. However, on a recent trip I found it mediocre at best. Served me the worse Chianti I have ever had. \nHowever, if you feel you must try this place get there at 5PM or earlier. It is always crowded.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "Osteria is a great NEIGHBORHOOD restaurant.  I'm stressing *neighborhood* because there are plenty of regulars who frequent this restaurant weekly and are, thus, treated warmly and attentively by the owner and staff.  If you come more than once or twice, chances are you will be remembered and treated just as familiarly as the regulars.  If you come only once, you'll still be treated well.\n\nBefore you assume that the older clientele are treated better merely due to their age, consider the fact that you are visiting a restaurant in a neighborhood where locals actually live, shop and eat.  Many of these patrons ARE older folks, but most of them have lived in the neighborhood a long time and are fixtures at Osteria.\n\nCome here with blinders on if you need to, but come you must!\n\nThe owner told me that the spinach pasta is the only pasta that is actually \"fresh\", so I order that most of the time as my main dish.  If you ask, they'll use whatever sauce you want on whatever noodles you want ... even if the sauce is not on the menu.  \n\nOnce, I asked the owner if he would ever bring back the olive, caper, anchovy, pepper and lemon sauce, and he offered to go back into the kitchen and make it for me himself.  How many restaurant owners would do that?\n\nAs you've heard from others, the gnocci really IS spectacular.  Get it with the gorgonzola, cream and pine nuts and save some bread to wipe up your place.\n\nThe linguini with fresh tomatos and clams is indescribably perfect.  It's not at all too briny as one might expect of a clam dish, the tomatoes are so sweet and ripe and the pasta is cooked to a perfect al dente and heaped seductively on your plate with clams, tomatoes and garlic hidden in every forkful.  I'm drooling now.\n\nThe artichoke bottoms with shrimp and the caprese are my favorite appetizers.  The basil sauce that is served atop the artichoke shrimp dish could stand to be lightened up a bit ... perhaps with a squeeze from a lemon wedge? ... nevertheless, it's a great starter.\n\nIf you need a sweet finish to your meal, the crema caramella (grand marnier custard with caramel sauce) is a good choice.  There are several others to choose from if custard's not your thing.\n\nSUGGESTIONS:  Call ahead and make a reservation to be safe.  It's hard to say what nights you may end up waiting.  As I said before, it's a neighborhood place so there are plenty of nights when couples show up with their entire brood and you have to wait for a table to free up.  Other times, there's no wait at all if you just show up.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "Delicious little Italian eatery in a sea of non-restaurant commercial zoned establishments.  I have to admit I caved and ate the gnocchi per several yelpers; and it was excellent.\n\nExtra points for any place that automatically bring me bread and olive oil.", "author": "Nelson A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "I've been going to Osteria for years and was first introduced to it by my grandparents (they would frequent a few times a week!). It's a great neighborhood spot that I would highly recommend - good food, good service, reasonable prices, small-ish space and quite a relaxed atmosphere. Have had a good meal on every occasion which is why I keep going back!", "author": "Anne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-30", "description": "This is our favorite neighborhood restaurant. There is nothing pretentious about the food but it is well made and tasty. We go there often when we feel like having a good pasta fix. We recently moved to the neighborhood and had dinner there the night we moved. They have been very friendly and welcoming to us. From reading other people's reviews, this is not everybody's experience, perhaps it has to do with the fact we go there regularly, who knows?\nAnyway, I love their gnocchi! They are addictive, so it is hard for me to order anything else. My husband gets the special  anytime it is a vegetarian pasta and has never been disappointed. A lot of families go there with their kids, but there is no wild running around or screaming. It just reinforces the comfortable neighborhood restaurant atmosphere.\nThey serve good desserts too. The creme caramels and alike are delicious.", "author": "Elsa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "I thoroughly enjoyed my dining experience at Osteria.  \n\nI started dinner with the proscuitto and melon.  Very good.  I love proscuitto so if it's not up to par, I'd let you know.  \n\nFor my entree, I had the gnocchi with pomodoro sauce.  It was Fantastic.  The gnocchi was large and tasty.  The sauce was garlicy but not overpowering.  My mom had the tortellini with meat sauce.  Hers was really good too.  \n\nThe people that worked at Osteria were nothing but extremely friendly and welcoming.  I'll definitely come back.", "author": "Angie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-28", "description": "This was an interesting place to go to, especially since my friends and I are not over the age of 60 .. My roommate had celebrated her b-day here and there was probably 10 of us, laughing, joking around and talking. We found out that we were being rude and many of the old folks were telling us to be quiet.. VERY RUDE!!  Anyways, we made a joke out of it and laughed it off... \r\n\r\nIf you like the older crowd, go for it... just don't talk to loud they might have a stroke or something.. \r\n\r\nI really liked their gnocchi, its really good, it melts in your mouth good.. i would usually have them at other restaurants and they would taste chewy and under cooked...I heard that their desserts were good.. The place is nice and homey and the painting on the walls are nice to look at.", "author": "Karen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-04", "description": "3.5 stars rounded up to 4.\n\nI've been let down by some Italian restaurants in the city, pleased with others, but we keep returning to Osteria's comfortable setting. It's not as fancy or creative as some of the alternatives, but it has so far been the most consistent.\n\nWe have yet to be let down, but some of our favorites include the creamy tortellini, spinach pasta with bay shrimp, calamari steak (quite unique - and tender!), any of the veal dishes, the minestrone, and most of the appetizers, especially the bay shrimp with hearts of palms. It's not the best Italian I've ever had, but it's always good and, as it's right down the street, we will remain regulars for a long time.\n\nNegatives: cramped, and it's time to update the decor.\n\nThere's also an Osteria in Palo Alto that's pretty good. Same menu, but not all the dishes are prepared quite as well (I was especially disappointed that the spinach pasta with shrimp was very much not up to par). Also, the staff at the Palo Alto location has a reputation for being rude with good reason. They were very unpleasant to our guest last time. But their dining room is less crowded, which is nice.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "It was a weekday and hubby and I didn't want to cook so we walked over to Osteria and hoped and prayed they had a table open at 7:00 p.m. on a Thursday. We lucked out and passed all of the Reserved tables and got a table in the back.\n\nWe got the prosciutto with melon ($8.75) and that is always delicious. My husband and I both ordered a salad. I had the salad with radicchio ($6.75) and there was nothing special about it. Hubby had spinach salad ($6.75) and he really liked it. We hadn't eaten greens in forever so the salads were devoured for lack of nourishment.\n\nFor entrees I had the gnocchi in tomato and basil sauce - DELICIOUS! The gnocchi was like little balls of heaven. So light, so tasty, so yummy! Hubby had a special which was pasta in a similar tomato sauce - equally delicious. The pasta was a bit oversalted but I LOVE salt, so it wasn't all that bad. \n\nThis is a great neighborhood restaurant. You could tell there were a lot of regulars there. By the time we left, a little past 8 p.m., the place was emptying out. \n\nI also love their website and the way you view their menu. You can turn the pages of the menu - pretty cool.", "author": "Wendy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-30", "description": "When I was younger, I used to love Italian food. Then my tastes matured and I became a fan of Indian, Thai, Mexican, Chinese, Ethiopian, Senegalese, Cambodian, etc. and had no room in my life for Italian.\n\nThe other night I stopped in here with a friend while waiting for our movie to start across the street, and I was pretty impressed. There was a wide enough range of prices -- if I remember correctly, I could have ordered something for as little as $9, or for $18 or more. I settled on the linguine and clams for $13. I got a reasonably filling portion and really enjoyed it, while my friend had the tortellini in cream sauce with prosciutto, which I, of course, loved because it tasted like bacon.\n\nAs I was tearing my bread, I knocked over my glass and spilled water all over the floor -- before I got a chance to even react, three waiters were on the job. They were really polite about my mistake.\n\nAfter our main course, I had the hazelnut custard, which I loved, and an accompanying muscat wine that was probably the best I had ever tasted.\n\nBasically, this restaurant provides high-class service and flavor for a middle-class price.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-14", "description": "You haters are crazy.  This place is consistently good... seriously.  Ok, so they clientele is probably on the retirement age side, but its cozy and the staff is so nice and funny.  Food is tasty and its a good value.  \n\nCarpaccio, veal, pastas... all MMMM... delicious.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-14", "description": "I've gone to the restaurants nearby so many times and always avoided this place--and if I recall correctly, the owner of a nearby restaurant was the one who said \"you gotta try it\".  I like that neighborhood support so off I went.\n\nI swear the owner (17 years, he's usually in the kitchen) swoops in (not eerily...swoop makes it sound bad) on newbies...or maybe that is just everyone under 70, based on the other reviews.\n\nI think I was actually there on a lively night b/c I though the energy, while far from \"trendy\", was solid.\n\nAnyway, I went in thinking the food would be a 5 or a 6, but a quaint experience. I didn't up my expectations when learning that the linguini w/clams used canned clams but ordered it when this dish turned out to be the one that the people next door were having...the one that looked so good that said to the waiter (owner) \"oooh...what are they having??\".\n\nas others have mentioned, the gnocchi is really etherial.  It's the kind of dish that makes you say, yes, I'm not surprised you've been around for 17 years.  This place has seen a lot and stood the test of time, so it must be doing something right.  It may be your father's Italitan restaurant but hey, isn't retro in?", "author": "Laurie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-29", "description": "This one is a bit difficult to summarize....the entrees were reasonably priced (shockingly so...all under $20) while the wine and salad seemed over-priced (why pay $8 for a plate of lettuce when you can get salmon for $15?). \n\nYes, the restaurant was loud, and yes, the decor was dated (especially for the fashionable Sacramento St.). I dunno...guess I just expected more stylish pizazz.", "author": "Leah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-02", "description": "Somebody only gave you 1/3 of the name.  What's up with that?\n\nOsteria Cucina Toscana is the full name.\n\nIt's *WONDERFUL*!!!\n\nThese are terrific people!  They serve terrific food!  \n\nI'll go back in less than a heartbeat!\n\nThere's a reason for all these exclamation points!  They earned them!\n\nYou in San Fran?  You hungry?  Go there?  You will leave full & happy!", "author": "Charlie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "I love this little bristo type restaurant. They have one cook, one washer, one waitress and one hostess/manager that works as a team.  It really gives you that small family restaurant feel although they are obviously not related.\n\nThe roasted pork is what i usually have and comes with a milk sauce which sounds a bit weird, but it tastes like cheese.  I would stay away from the penne bolognese.  The sauce has a ragu vodka sauce taste to it.  I'm not even sure if thats a real product, but its what pops in my head. :]", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-01", "description": "This is our neighborhood Italian spot.  The service is friendly and genuine, and the food is always delicious.  I bring my parents here when they are in town and my dad always, always loves it.\n\nThe crowd is generally older, so if you want dinner at 6:30 or 7:00 it's going to be packed.  Wait a little later until the older folks are sleeping (8:30)!", "author": "brittany z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "One of my top three Italian restaurant favorites (Ideale and Marcello's are my other fav's). I agree that an older crowd frequents Osteria, but I dine for the quality of the food not the scene.\n\nIf you are a fan of gnocchi Osteria makes the best in San Francisco hands down. I also enjoy the artichoke bottoms filled with shrimp served with a delicious green goddess dressing. \n\nIf you want great Northern Italian food at a reasonable price, Osteria is a great selection.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "My hunny and I ended our trip in San Francisco with dinner here.  We had reservations promptly at 5pm (which is when they opened).  The place was quiet at first and within a half hour or so filled up quite nicely.  The establishment has a very comfy feeling to it, it almost felt like having dinner at home with family.  Staff was wonderful.  Food was delicious.  We will definitely be in again!  Thank you!!", "author": "Dee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-17", "description": "Authentic, delicious Italian food.  \nThe linguini with clams is fantastic!  Always a treat when the family gets together at one of our favorite Italian spots.", "author": "G W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-18", "description": "Overall very disappointed with both food and service.\n\nWe arrived on time for a Friday night reservation for four, but the other couple from our party were stuck in traffic. The host and waiter were both rude, and the host repeatedly asked us specifically where our friends were at the current time (somewhere on highway 101?!).  Initially they refused to seat us and said \"We usually don't seat partial parties.\" This would have been fine if they had been nice about it (hey, we understand) and especially if the restaurant was busy, but there were several empty tables at 730 on a Friday night. They ultimately did seat us when we said we wanted to order wine and appetizers, and our friends arrived 15 minutes later. The restaurant never filled throughout the entire evening. \n\nThe food: Shrimp and artichoke appetizer - cold baby shrimp, artichoke heart, sauce and bed of lettuce. Good but nothing special. Friends had minestrone soup and a salad - also average. For dinner we had gnocchi and veal (two ways). All was average but definitely nothing special. \n\nDessert was the only highlight of the meal - hazelnut chocolate cake and tiramisu were both delicious. \n\nService continued to be sub-par throughout the evening, and at 10pm when there were still two other tables of diners a waitress said \"We are going home now,\" to get us to leave. We will not return. This experience was overall so bad it inspired me to join Yelp and write my first-ever review...", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-06", "description": "I walk by Osteria at least twice a day, and each time I would wonder why I hadn't eaten there yet. That finally changed this past Saturday, when I brought some visiting family in for dinner. The decor may be a bit dated, and the space a bit tight, but the (very traditional) menu delivers and the service is good. I got the impression we were the only first time visitors during the entire dinner service - each new group that entered was greeted with big hellos and hugs and kisses. With customer loyalty like that you have to think they're doing something right!", "author": "Lindsay J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "the location on sacramento is good. in a clean area. the parking isn't great, but i didn't mind the walk 3 or 4 blocks to the restaurant. \n\nthe place is small, intimate, and elegant. a bit antiquated. clean. good lighting, not overly dim. \n\nthe waiter was polite and subtle. he did a good job of blending in to the surroundings. i prefer for the focus of my experience to be on the food, and on who i'm with. not a waiter that tries too hard, or too little. \n\nthe food was light and tasty. i ordered the calamari steaks and prawns. the calamari was a healthy size and the prawns were tender. the sauces used were not overpowering. lemon was used in both i believe, which gave the dishes a crisp taste. good! \n\noverall, a nice experience. good date place.", "author": "Drew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "I've eaten here twice this year, and both times I've had a great experience. The first time was when my mother was in town for a conference, and we got there about 45 minutes before the restaurant closed. We had dinner, and actually ended up staying after the restaurant closed. The waiter was very nice(he may have been the owner), and he didn't try to rush us out of the place even though it was closed.\n\nThe second time was with my GF, and again it was a great experience, fast service, and excellent food, and to top it off, we were able to get two dishes, and a glass of wine for ~$20!\n\n\nJust for the record, this place has the best Gnocchi I have ever had.", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "Even though I live in this hood, I've only gone to this restaurant a couple times before and never thought to review it.  Last Monday, I went there for their new \"Acoustic Bistro\" (free live music always pulls me in).  When I arrived, the place was packed and there wasn't an empty table except for a 4 top. Since I was alone, I told them I would wait because I didn't want to take up a large table just for me.  There was a large fun group at one table and the host asked me if I minded being seated with them.  He checked with them and they welcomed me to their table.  I ordered the shrimp risotto and grilled asparagus.  Both were yummy.  Turns out some of people I was seated with were friends of one of the performers and were musicians as well.  They ended up having to leave a little early because one of the them was the featured performer at the Utah later that night (he gave me his CD and invited me to another show he would be performing at).  After they left, the owner came and sat at the table and chatted with me for a bit.  They are excited to have live music there and couldn't have been more accommodating.  I will definitely be going back (and love that I can walk there!).", "author": "Tina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-26", "description": "A good place to eat, though I advise it for lunch over dinner. The menu is a little limited, though all of the dishes on it are very well executed. The service is friendly and it had a neighborhood feel - go in few times and I get the sense that the waitstaff will start to remember you. I do find the interior to be a bit cramped, especially if you're eating with a group, unfortunately. The prices are fair so long as you don't order wine, though salads and deserts will run up the price quickly if you indulge. Overall I'll be back, though for specific types of occasions rather than for regular dining.", "author": "Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-27", "description": "You know, I am disappointed, but not wholly surprised, at the reviews from my fellow diners. Disappointed because the shallow reviews of \"my grandparents would love it here\" to \"I just can't stand the retirement vibe\" really show the lack of support for restaurants that are not \"uber-trendy\" night-life spots. Restaurants can be good even though they don't have a waiting line of very skinny girls in low slung jeans and designer bags next to the couture grunginess of the couple with dreadlocks and a snotty hostess.  Come on, people! Does it really matter to you if the retired set eats at your favorite spot too?\nTo get to the food-the gnocchi is truly the best in the city.  To the reviewer who said that the place smelled bad-well, I guess you don't like garlic-the staple of ALL Italian restuarants. The garlic smell is from the wonderful marinara. No blandness here! Their wine list is good, and the service was excellent. The owner checked every table and made the rounds, welcoming people inside and saying goodbye to those of us who left. The prices were excellent!\nDear reviewers, let's remember that sometimes its ok to eat where your grandparents like to eat. It might not have disco lights, thumping house music, half naked waiters/waitresses, or a 20 page wine list, but it will have low prices, good service, and, more than likely, great food.", "author": "Tova S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-26", "description": "Don't go to Osteria unless you enjoy being scammed. My girlfriends and I went in to share a pre-movie bottle of wine. Upon asking the owner for a recommendation, he offered to let me taste one of the wines we were considering. He proceeded to bring us an entire bottle and uncork it -- as if we didn't know the difference between tasting a wine to decide whether to order it and tasting wine to determine whether it's corked. We weren't interested in any food, but he brought us plates \"just in case\" and lingered about the table insisting that we should eat something and sighing to himself. When the bill came, I noticed that we'd been overcharged for the wine. I brought it to the owner's attention and he blamed some hapless waiter even though I'd seen him handwrite the bill himself. Never again.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-29", "description": "We took my grandmother for the 85th bday. We had reservations for six.  We showed up the table was ready, the service was fast and very on top of things for such a small place.  The special was Gnocci which was amazing!  For desert I had the cheese cake, it was creamy with a hint of lemon.  Overall a great experience!", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-01", "description": "Osteria is great.  We found this place about six months ago, and we've been a half dozen times since.  Always great.  Some of their pastas are hand made, but they are all delicious.  As others have said, the gnocchi is the best in the city. \n\nOrder the fondo di carciofo con gamberetti (artichoke bottoms with shrimp) as an appetizer.  Just trust me on this one.\n\nThe wine list is quite adequate at very reasonable prices (no where else have I seen a good brunello for under $100).  While you won't find the very finest wine here, there are some very good selections.\n\nWe usually walk in or call right before, and have only run into a long wait once.\n\nWon't break the bank.  Oh, and they take AmEx.  Complete package.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "Great veal dishes. The cheesecake is amazing!  Artichoke bottom with shrimp starter is also a favorite. \n\nBeen an irregular patron for over 9 years. Cozy and warm atmosphere. Lots of neighborhood  regulars. Friendly and good service. Menu does not change, but everything is solid and good. Affordable. My go-to SF Italian restaurant for family get togethers.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "Got there on a Thursday about half an hour before they closed. We were seated by the owner of the restaurant who is a very nice gentleman. Had a great conversation with him after our dinner was done.. Prompt service from the waiter (constant refill of drinks, bread) The food was great (reasonably priced) and we didn't have to wait long for it to be served. Would definitely go there again.", "author": "Andy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Best gnocchi in the city - by far. I have yet to find a place that even makes gnocchi that is competitive. It 's got a great neighborhood feel to the place. Very low key. Not good for a posh night out, but a nice place to take your parents out to dinner. The eggplant parmigana is not so good, however, so I'd recommend skipping it if you usually go for this dish (as I do).", "author": "Jenica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "i love this place!  its one block from my place so i have been there to dine in and to order take out many times.  no matter what the circumstance is, the staff here is terrific and so is the food.  i just called to ask for a simple fettuccine alfredo which is not on the menu but ive been really craving it lately and they are totally going to make it happen.  she even said she would talk to the kitchen to make it extra delicious if thats even possible.  the point is that customer service is still alive in some restaurants in this snobby food city and i really appreciate it when it happens.  ill be sure to leave an extra tip for the extra special treatment for extra delicious fettuccine alfredo.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-06", "description": "Simply a wonderful neighborhood restaurant .  Friendly staff, warm decor, and delicious food at reasonable prices.  My favorites are the caprese salad and the veal picatta.  My daughter used to live nearby and we went there often.  Now only rarely, and it is like visiting an old best friend.", "author": "Clay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "Went here for the second time Sunday for a friends birthday. The food was as good as I remembered. \nThe four of us shared the Antipasto Assortito,  the menu said for 2, but was plenty for us all to get at least a taste of everything. \nThis time I ordered tortellini panna al prosciutto e piselli, meat filled tortellini with peas and prosciutto. The dish was perfectly portioned, just enough after all the bread and appetizer. The peas and prosciutto were nicely paired with the cream sauce and the tortellini. Everyone else got tortellini della casa, gnocchi al gorgonzola con pinole, and petto di pollo dorato alla parmigiana. The tortellini della casa was served with meat sauce and very good. The gnocchi, which I ordered the first time I visited this restaurant, is amazing. Fluffy pillows that melt in your mouth, absolutely delicious, and a must try! The petto di pollo dorato alla parmigiana, chicken parmesan, was nicely done and served with vegetables. \nFor dessert they brought out some tiramisu for the birthday girl and we also ordered crema gianduia. The tiramisu was fantastic and flavorful, no skimping on soaking the sponge layer. And the crema gianduia, a chocolate hazelnut custard was delicious. WIth both of these it was just enough for us to share and round out our meal.", "author": "Emily P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-22", "description": "I just have to jump in and defend this restaurant against some of the poor Yelp reviews... this is one of my favorite neighborhood spots. Granted, on some nights you might be the only one under 50, but that's part of the charm. Order anything that's \"della casa,\" like the house salad with their special mix of Green Goddess dressing (how retro is that??) or pasta with the house sauce. My guests have always been impressed.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "Love this neighborhood gem and its gnocchi (they're nice and soft and just melt in your mouth).  This is a nice intimate spot where you can hear your companion, sit in flattering lighting and pay a reasonable price for your food.  They'll also accommodate take out orders.", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-23", "description": "This is just an adorable little place.  Great intimate atmosphere, great service, decent food.  We had a lovely dinner there with Mel and Al (thanks guys for introducing this to us).  I would come here again for: random romantic dinner with sig other, girlfriend catch up dinner, close family member in town visit.", "author": "Ann F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-10", "description": "Great place. Extremely friendly staff. Good food. Easy to get to on public transit. I had a pasta dish with seafood. Loved it. Check this place out for sure.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "I've been here 4 or 5 times, and the food is consistently good. The service is wonderful. Great neighborhood atmosphere.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-19", "description": "I've been on two dates here.  I also took my 16-year old brother who was visiting from out of state.  He loved the gnocchi.  We shared the mocha almond ice cream torte.  Some of my other favorites are the spinach salad and shrimp scampi.  Bring a big appetite... there are so many excellent creations to sample at this place!\n\nAs Osteria is physically tucked back on a quieter part of Sacramento Street, a night sharing Italian food makes this intimate trattoria a place of many memories!  The house red wine is cheap and pairs well with just about anything...", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "Food is excellent. Always has been. Service is good, though depends on the individual. Lots of conversation takes place, thus the feeling of energy, which we like. You may find better food somewhere, but Osteria is consistent with its food and we know what we will get, each time we eat there. We have never had a bad experience here or at Osteria in Palo Alto.", "author": "Average Guy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "A great destination spot.. only 20 mins from Novato!   We've been there twice.   Alex was our favorite waiter.. he has moved on.. and we have yet to be back.  A mid week night out .. drive thru West Marin.. stopping in Pt. Reyes.. a little fog..   Not much better!", "author": "Sean R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "basically the best Italian food in the area, Osteria has the vibe of a neighborhood restaurant with quality of a bistro, \nyou really can't go wrong with the gnocchi with tomato sauce and basil, or the special gnocchi with cream, tomato and peas, \nI was a bit disappointed with the deserts, the tiramisu is great, but the sorbes where mediocre (I tried the vannila and raspberry).", "author": "Ira S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "This a great neighborhood spot.  The food is great and very reasonably priced.  I took the folks here when they were visiting and they were quite impressed.  I had the spinach pasta with chicken and damn was it good.  Dad loved his chicken special and Mom was a fan of her pasta with shrimp.  The service is friendly and warm and its a comfortable, casual place to go when you just need a good meal without the flair.", "author": "Miss M G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-17", "description": "A great neighborhood restaurant with wonderful service and yummy Italian food. My family and I go there all the time. I always get the gnocchi with marinara sauce and mozzarella cheese on top, which is fantastic. My mother loves the veal piccata and my dad loves the calamari steak. The waiters are super friendly and it is always an enjoyable dinner. They are closed on Mondays.", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-03", "description": "It's just not that good. It's not bad, but, c'mon basic Italian should be so much better.  The gnocchi seems like it is not homemade - it's mushy and bland. The basic pomodoro sauce is unremarkable. The minestrone is tasty and passable.\n\nI been there twice. The first time was with a friend who made reservations. I had the soup and gnocchi. Gnocchi sucked, the sauce was good. The second time I dropped by with my partner and a friend on a Saturday night at 9pm. The waiter (owner?) asked if we had reservations even though it was late and there were 5 empty tables. We thought he was joking since the place was deserted, so we laughed. He was serious and seemed offended. He grumbled that he would have to check his reservation list to see if he could fit us in. He proceeded to walk around the restaurant several times for the next 5 minutes, checking NOTHING, and then he returned and seated us. We continued laughing since it was obvious that the 5 minute wait was punishment since we didn't have reservations. What the hell is it with San Francisco and reservations? Why can't you just stroll by a place - and when it is EMPTY - be seated promptly and courteously?\n\nOn this visit I had penne that was bland and flavorless and my partner had a fish special that was passable. My friend ordered the gnocchi and it was definitely not homemade once again.\n\nWhen the check arrived the sour puss waiter/owner suddenly got friendly.\n\nWe won't be going again.", "author": "Marcia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-20", "description": "Cute little old school, non-trendy neighborhood Italian restaurant.  Gnocchi is one of their specialties, but I am especially enamored with their linguini and clams.  Reasonable food and wine prices too.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-12", "description": "Osteria is a small family run place, with good food.  The waiters were excellent.  The person that greets you upon entering is best described as snooty.  We did not have a reservation, but it did not matter since the place was not half full.  If you go, get a table away from the front door and the blast of arctic air that washes over you whenever the door opens.  The waiter entertained our kids with two magic tricks, a nice touch.  The lemon cheesecake was out of this world.", "author": "Chad M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-28", "description": "I guess, as my husband mentioned, for American standard is good (he is American, I am European). It's been a long time since I felt so bad spending 60$ on food. I had the butter lettuce and it wasn't fresh, brownish, wet and the dressing was very heavy. It almost felt like garlic mayonnaise. I went there for gnocchi, I have read a lot of reviews about their gnocchi. Overcooked to a point that were already melted, the Gorgonzola sauce was super salty and too peppery. My husband had prosciutto and melon. The melon wasn't fresh but mushy. We ended up with same strawberry grand Marnier sauce dessert and this one was very disappointed as well. No flavour. No point to go back. The prices on tehi website are not the same ones that are on the menu'.", "author": "Biemme B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "I love love the past bolgnese.  I die for fresh monade pasta and they are best.  So cozy and inviting gota try it!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-02", "description": "Really solid food. I was pleasantly surprised by the presentation and quality of every dish that was presented to my table. Service...kinda odd. We couldn't tell who our waiter was and we waited for our bottle of wine for almost 20 minutes. Not a deal breaker, but definitely noticeable error in our service. i would come back because the food was so good.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-03", "description": "I like the casual ease of this place.  The food is alway good, and the service very neighborhood-y.", "author": "Barbara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-14", "description": "I liked this place.  It's probably my addiction to homey neighborhood Italian restaurants, so if you like that kind of thing you'll like this place, too.  I thought the food was okay, and it was definitely reasonably priced.  I took out-of-towners here and we had a really nice time.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-25", "description": "Normally, I wouldn't publicly say how much I love this restaurant, because I really like it as an undiscovered neighborhood gem... but when I saw the low scores, I had to speak up.  Agreed, this place is not about the \"scene,\" but the food is amazing & very reasonable.  Standouts on the menu are the artichoke/shrimp appetizer, gnocchi & the calamari steak - which is calamari unlike any you've had before.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-04-18", "description": "Sallow Italian food served up to sallow customers in a sallow room by sallow staff.  Pick something else, anything else, even if you have to go home and have Jif.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-28", "description": "Great neighborhood restaurant-- really cozy.  Service was warm and unrushed.  The food was good as well-- especially my unbelievably fluffy gnocchi with pink sauce (pink sauce = marinara + gorgonzola; not on the menu but they'll make upon request).  After dinner, you can catch a movie at the Vogue which is right across the street, or go down a block to G Bar for a post-dinner drink.", "author": "shoba d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-15", "description": "Basic italian food. We went for mothers day and it was very loud, my cesear salad was just ok (kind of hard to have an ok cesear I thought) but I did like my entree which was tortillini's with cream, peas and ham which is how it wound up with 2 stars instead of 1.", "author": "Jenifer B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-14", "description": "I really really wanted to like this place 'cause it looks like my Grandma's place and it's really close to my house but I can't.  I just can't.  I might send my grandparents there...", "author": "Cosmolicious L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-28", "description": "This is a solid Italian eatery in Pacific Heights. The pasta is fresh and the tasty sauces aren't too heavy. This place is better than the chains, but not quite what I had in Italy. It's still very good, though. The place attracts an older neighborhood aesthetic, but surprisingly....it's not pretentious. Aaahh! I like to hit this spot every few months and each time they are consistent. Their table service is good, parking is easy and the prices are pretty reasonable. This is my \"diamond\" in the rough Pac Heights.", "author": "Fil L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-25", "description": "L 'Osteria has been here for years, and it really is one of the Best Dining values in San Francisco. The restaurant is always busy...a very good sign. We don't come in often enough, but when we do I always end up ordering the same thing,, \nThe best salad on Planet earth is right here...Artichoke bottoms stuffed with bay shrimp served on butter lettuce and topped off with a green godess type dressing...oh my god...this is good...\nThe gnocchi in a Gorgonzola cream sauce with pine nuts , it is out of this world. This is the worlds best gnocchi (in my opinion). they are light, fluffy and melt in your mouth, that along with the Gorgonzola cream sauce....The fish dishes offered are always executed well...but I need my gnocchi fix and this is the place for it... \nDesserts are great as well... \nThe staff is just great, very friendly and they've all been here for years, the service is just excellent...for a neighborhood Italian restaurant it doesn't get any better than this....", "author": "Jim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-02", "description": "Absolutely solid, immediately put into the rotation of places to enjoy again sometime soon.", "author": "T O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "I, unlike some people, LIKE going places that have old people.  To me it says \"reasonably priced, quiet, dependable, early dinner rush, smells slightly like diapers\".  Okay, so this place had all of it but the diaper smell.  I had a class across the street at 7 PM, walked in at 6:10 on a Tuesday night, was seated right away, and was eating 10 minutes later.  By the time I left the place was packed.  Definite neighborhood vibe to it...like the older patrons come to order the specials every week since they've eaten everything else on the menu a million times.  Pasta portions were medium sized and I did need to eat some bread to fill up.  I had the spinach pasta with chicken and mushrooms.  Tasty.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-15", "description": "i agree with Janet... the neighboorhood is great becaue there is so many things you can do around that area. The food itself was pretty good; It was filling and I would definitely go there again.", "author": "Judy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-26", "description": "I ordered classic Italian dish clam pasta, and it turned out the clam was from a can. If I had known this earlier, I will never have ordered in a restaurant. Very low rating here, don't bother.", "author": "Wen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "Great neighborhood Italian.  Staff is great, nice atmosphere, very reasonable prices for the neighborhood.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "Staying at the Laurel Inn for the Christmas holiday and huge fans of Italian food this was a natural. Made Reservations for 3 @ 7PM and we were seated in a nice cozy private little section to enjoy what was about to happen. This is a very small local neighborhood bistro. Loved the menu selections starting with the Antipasti through the Zuppa and Ensalada and Pasta Courses.  Entrees' of course are superb. This kind of dining you will enjoy slowly and one course at a time. The food is to be savored and enjoyed. Don't expect huge portions this is not that kind of restaurant.  Perfect selections and portions sizes to enjoy while conversing with your company. Dolci of the homemade variety rounded out our evening. Wonderful neighborhood feel. Wait staff very friendly and accommodating.  Wish we lived in SF so we could become regulars. It is that good. Great value too. We will be back. Enjoy....", "author": "Bob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-10", "description": "I like what I had which was a spinach pasta with shrimp. Its a nice little place. 4 people about 65 dollars. Very Welcoming!", "author": "LaLa n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-29", "description": "Great casually elegant Pacific Heights restaurant without the \"attitude\".  We're hooked on the Artichoke Bottoms w/Shrimp & the \"very tender\" Calamari Steak sauted in Lemon Butter...Yum Yum!", "author": "toni u."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-03", "description": "We love, love, love Osteria!!!  Wonderful Italian fare without the frills. The Sienna Chicken and Ravioli are fantastic as are their regular staples, Tortellini Dela Casa and Calamari Steak.  Dominic, Andy, John, Raul and the rest of the staff make you feel right at home.  Definitely our favorite restaurant!", "author": "Felice A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-05", "description": "This is the perfect neighborhood Italian restaurant. The prices are totally reasonable the service is super nice and the food is consistently good.  I especially like the spinach pasta with chicken tomatoes and mushrooms and the veal scaloppini", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "Love this corner neighborhood spot.  There are not a ton of great places to choose from up in presidio heighs but this one consistently hits the spot.  I would recommend making a reservation, especially on the weekend.  Best gnocchi in the city.  I love all their salads: the caprese with green goddess dressing, the spinach salad with peanuts and the butter salad are all divine.  My husband is a big fan of the steak carpaccio  The tortellini is also delicious.  If they have a chicken special, get it.  It's always good.  The only thing I did not love there is the pasta with cream and peas.  Everything else I've tried has been great.  Meals are portioned right which allows them to keep the prices reasonable.  We usually get out of there around $80 with salads, entrees and wine.", "author": "Janet L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "A lively yet supremely comfortable neighborhood place - with service that makes you feel like home yet is executed with professionalism.  \n\nA fantastic people-watching spot of the who's who of Presidio Heights and Pac Heights - I've spotted Robin Williams with family and Dede Wilsey here (separately). \n\nComfort food abound:  linguine alle vongole (the best in town), veal scallopini with mushrooms or piccata, and incredibly light fluffy homemade gnocchi with gorgonzola that is a must-share dish to begin with.", "author": "Michaela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-04", "description": "The prices and qualify of food are reliable; you get a great bargain across the board.  Good gnocchi, fish, and salads.  The staff is friendly, engaging, and flexible about substitutions.  (There is one co-host or waiter that we find a bit strange; Dominic is the best!)  Several mentioned older diners at this restaurant and they are right.  Just like any neighborhood restaurant that caters to its regular customers, the older folks eat early and the younger ones dine on the later side.  If you are looking for good, affordable Italian food in the Pres Heights area, this is the place.", "author": "M.D. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-25", "description": "this is a good italian restaurant! my teacher, who recently came from italia, told me about this restaurant which had food that actually resembled the one he used to eat in italia soooo i went and it was delicioussssss. i have never tried italian food so good as this.", "author": "Carol i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "nice neighborhood restaurant.  the food is good but not amazing.  there's a pleasant, casual, neighborly feel to the place, with a good number of regulars and families.  the servers are friendly and funny, so you may excuse the occasional lack of attentiveness. we like to go here for a relaxed night out.  to me, they seem to offer a lot of comfort food; it tastes homemade in a good way.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-19", "description": "Osteria is a charming little spot with friendly service and a comfortable neighborhood feel to it.   The food was high quality, and I have had some memorable meals there.  It's very cozy and a great place to take a date or someone you don't mind getting close to.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-22", "description": "osteria is \"our\" little neighborhood place, even though we only go there every three or four months.  it is so adorable.  always full of families.  the service is friendly but a little slow--maybe because the servers are always gabbing with the regulars.  and everyone in there always seems to be a regular!  it's all part of the charm.  my husband and i have tried a few different dishes but always come back to the same two--tortellini with prosciutto and peas for him and capellini al pomodoro for me.  delicious with insalata della casa and minnestrone soup!  also, i'm not sure what brand of olive oil they use but it is heavenly.  if it wasn't so frowned upon, i'd screw the bread and drink it straight from the dipping dish.", "author": "kate s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "OMG! Everyone in here is older and super cute. Not older I want to date you Mr. Clooney but older you remind me of my grandparents and it's okay because this restaurant is so warm and charming. My BFF brought me here for dinner last week and told me that it definitely was not on and poppin but that the food was very good and inexpensive. From the moment we walked in everyone was so NICE. The host came over and immediately greeted us and told us it would be about 15 minutes or so ( which it was ). We were then seated and our server was amazing. Super friendly and knowledgeable about everything on the menu and I don't see much of this anymore so it was a treat to be taken care of. She did not skip a beat, rattled off specials, brought out meals right on time, kept checking in on us with out overstepping and always had a smile on her face. Best part was the fact that we each had an appetizer, then a salad, an entree and about 5 glasses of wine for 35.00 each.", "author": "Jazzelyn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "Osteria is a really great little find!  I ate here for the first time last night, and I am so happy I did.  The food and service was great.  The prices are also quite reasonable.  The gnocchi was great, and my boyfriend had the Osso Bucco special, which was yummy too.  This is a perfect little Italian restaurant.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "I went here awhile ago with my friend prior to going across the street for a movie.  The food was AMAZING!, and I've been dying to go back ever since.  Both of our dishes were excellent!  And the service was very friendly, just a little on the slow side.  Good ambiance as well, very relaxing and cozy, and I'm hoping to bring my husband along next time for a 'date night'.", "author": "KG P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "Great authentic food with a wonderful homey atmosphere. Reminiscent of family-run Italian restaurants in the New York area.  Not at all touristy like the majority of Italian in SF.  Best Italian restaurant I've been to here.", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-13", "description": "Kind of boring. Like its neighborhood, Laurel Heights.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-04", "description": "I love the food here, it's always fresh and delicious.  I have to say that the service is the only thing keeping this from being a five star rating.  The waiters aren't as friendly or attentive as I like, but the food is well worth it.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "Had dinner here last Friday and it was great!  We did not have a reservations, but they sat us quickly and explained the menu and specials. I had the shrimp scampi yum and my husband had the calamari  steak amazing! We would drive back just to have dinner here again.", "author": "Adele H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-27", "description": "It always amazes me to see how totally ignorant some of you are....this is a nice place....I wonder if you \"young\" folks will have the brains and good fortune to live long enough to be older so you can enjoy eating there also. You will be surprised to find that aging is inevitable...until then, enjoy your ear splitting \"music\", your cell phones attached to your ears, and your simplemindedness........it is probably blissful to be so ignorant....I have no way of knowing......", "author": "Menlo Man n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "Not the most hip and happening place in town but the food is GREAT!  The gnocchi is fabulous!  Another Yelper raved about it so I had to try it.  I highly recommend it.  The price for the quality of the food was pretty darn good too.", "author": "Marie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-19", "description": "We went here tonight to relax and enjoy good food.  Ta-Dah!  Our favorite waiter, Domenic, was there, and so were other friendly staff people.  It wasn't crowded -- today IS Wed.!-- and we got seated right away. We have come here for years and it nearly always rates among my favorites.  (Sometimes the noise level gets me crazy. ) I adore the totellini de la casa and the spinach salad.  The mocha ice cream pie is yummy for an occasional treat!  We especially love that the food is excellent and arrives hot.  The portions are perfect-- ample but not huge.  Good food, great people, and -- as long as it isn't too crowded-- a great place for a relaxing meal.  Be cautious if it's super crowded.  It only takes 2 or 3 loud talkers to make the place seem deafening.  Also, a rez is a good idea esp. on the weekend. Definitely worth a visit, esp. if you live within walking distance.", "author": "Joan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-09", "description": "This is a hidden gem! It is simple and yummy. The prices are great! I love the staff - it seems like they have been there forever which is always a good sign.", "author": "CC C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-25", "description": "This is one of my favorite Italian Restaurants in town. I'm Italian and I know italian food. The price is right which is why I give it FIVE stars.", "author": "Lorena M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-09", "description": "Yeccchhh.  The food was so disappointing!!  I had a simple pasta dish -- the pasta special of bowties with a red sauce, Italian sausage and arugula -- and it was so salty, it just about made me gag.  Didn't the cook taste it before allowing it to leave the kitchen?  Why ruin a dish like that?  Their house white California wine was downright disgusting.  Yes, we should have ordered an Italian wine, but we had a friend in from out of town, so thought California might be better.  What a bad idea. I would give it only one star, but the atmosphere is admittedly lovely.  The decor is pretty and the Italian arias and songs, playing not too loudly in the background, were nice. Still, at $40 a head for dinner, if you want a decent tasting meal, go somewhere else!!", "author": "Antonia J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-09", "description": "Let's just say: The Dining Experience From H-E-L-L. I went to Osteria in hopes of a lovely evening with my work colleagues and we three were s00000 disappointed because: 1. the service was terrible; I had water splashed on me by a waiter at the table next to ours; we waited and waited and waited for EVERYTHING (dare I suggest it was because we were three women??); the waitress stood at the back of the restaurant staring offf into space and taking her sweet time and there were perhaps three other tables of diners,i.e. it was not busy; and our water glasses were never refilled; and we had to remind the waitress that we had ordered wine 3 time. ...2. The food was terrible: my salmon tasted like chicken that had been soaked in salt water and it had an unpleasant-tasting and unidentifiable sauce; my colleague's soup was \"terrible\" and my salad had a hideous dressing on it.When the waitress picked up my plate at the end of the meal, she looked at my salmon (much more than half remained) and asked me what was wrong. When I told her it was terrible, she said \"we'll get that taken off your bill.\" However, she came back later and said \"He (the manager) can't do it. If you had not eaten it, he would have not charged you.\" Say, what???  Avoid, avoid, avoid.", "author": "mar b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-16", "description": "Love this place...Veal picata is great....long time friendly staff....butter lettuce sals good....great neighborhood spot", "author": "Scott W. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-22", "description": "Okay.  My husband and I fit the profile of the 50 and older crowd and we LOVE this place!   This restaurant is unpretentious and comfortable and is such a price performer!  Our favorite entrees are the calamari and the veal piccata or scallopini.  We have two teenaged daughters and they enjoy the pasta or the grilled chicken.  Being able to walk to restaurants in the neighborhood and having the staff give you a hug as you walk in is part of the wonderful charm of San Francisco and Osteria clearly fits the bill!", "author": "Maureen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-21", "description": "After reading the other reviews for this restaurant I can only conclude I've had the misfortune of dining there on off days.  I first ate there when we moved into the area several years ago and was so disappointed I vowed never to return.  Twice since I've broken my vow - most recently last month - and both times I was reminded why I avoid the place.  Slow service, excessive deference to regulars at the expense of others (we have always been placed at the worst table by the door where everyone who enters bumps you as they walk by, regulars get seating preference and their food is always served well before ours even though they arrived 20 to 30 mins after us etc) and so so food.  I last had a veal dish that was so salty it was inedible.  I have renewed my vow...three strikes is enough.", "author": "Dennis B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-13", "description": "This review is not about the food, which we did not have the opportunity to try, but about the unpleasant manner my wife and I were treated while waiting for a table.  We did not have reservations and the host asked us to wait while he prepared one for us.  After about five minutes, another couple (older, Asian), likewise without a reservation, walked in, and the host sat them immediately while we incredulously stared on.  After about ten minutes, we were ushered to the table everyone dreads being sat at -- you know, the one in the far reaches of a restaurant, next to the restroom.  We kindly declined the table and requested one near the door that was available and were told that it was a three-person table.  (A three-person table?)  The host then told us he would see what he could do and we waited at the door and after a few minutes of not being tended to we left.  The host had a very faux-accommodating manner about him -- the one with the fake, put-on smile.  We were very nicely dressed but appeared at least twenty years younger than the rest of the customers who belonged to the mid-fifties, monied-seeming demographic.  It kinda felt like a reverse age discrimination thing going on there.  Anyway, we walked across the street to Garibaldis where we were graciously welcomed and had an amazing meal and phenomenal time.", "author": "Salvatore Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-10", "description": "This might just be the best neighborhood Italian food in town.  Everything on the menu is solid.  And I know everything is fresh and home-made as I spent an afternoon in the ktichen learning how to make gnocchi and tomato sauce from the owner.  This place does have the best gnocchi in San Francisco.  It isn't worth even ordering gnocchi in other restaurants.  You can have it with a fresh tomato basil or with gorgonzola sauce (both are exceptional). The only other place in the area that rivals is Della Santina in Sonoma.  In addition to the gnocchi, Osteria's  fresh spinach pasta with chicken that is excellent.   Another stunner is their chicken parmegiana which is made with a flatened chicken breast-- it melts in your mouth.  The nightly specials are always a treat..when the owner makes ravioli you should order them.  You can't go wrong with anything on this menu.  And save room for biscotti, those are also made by the owner.", "author": "Kathryn P."}
