{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "LOVE that they have loyalty/rewards card!\nDefinitely an incentive to make you come back for more.\n\nIm obsessed with their Oreo coffee flavor!\n\nI don't drink coffee but its my favorite ice cream flavor and I love coffee flavored ice cream paired with texture such as crushed espresso beans or something but this paring is a perfect marriage! Or should I say over the moon;)", "author": "Jasmine-Desiree L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "Came across this cute ice cream shop while walking around in the Marina. \n\nSaw that they had a variety full of homemade ice cream!  The thing that caught my eye and sold it to me was the cookie cup. Imagine craving a cookie and loving ice cream?! Best of both worlds if you ask me. \n\nI got the chocolate chip cookie cup with cookies and cream ice cream. The ice cream was super delicious and being able to eat the cookie cup after topped it off. Instead of wasting paper cups, this cookie cup invention is brilliant. Would definitely come back when I'm in the neighborhood.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "Got one scoop of raspberry and coffee oreo cookie. Very creamy and had a strong milk taste. Melts quickly!\n\nRaspberry actually tasted like raspberry and not overly sweet. But my favorite was the coffee oreo cookie, a perfect balance between coffee and oreo! The coffee ice cream was on the sweeter side of ones I've had at other places.", "author": "Joey W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "Standard pricey-but-good creamery joint in SF (3/5 on value). Flavors were a 4/5, but knocking it down to 3/5 because their lavender honey was pretty bad. It's my favorite flavor -- I sampled it and it was great. Then about a quarter way through my cup, I had to stop. The lavender flavor started becoming this cloyingly artificial sweetness.", "author": "Calvin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "I stopped by this ice cream shop after having brunch a few doors down. I've heard about the honey lavender ice cream here so I already knew what I wanted. We got the ice cream in a cookie cup since it looked interesting. Big mistake! I don't recommend the cookie cup as it's not fresh, it's stale, it's hard, etc. The ice cream will also start leaking all over. The honey lavender ice cream on the other hand was interesting and creamy! I would stop by again if I was in the area!", "author": "Flora L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "This has been one of my favorite ice cream spots in SF until this past weekend, hence I'm knocking off a star. Their Nutella banana flavor is phenomenal. My favorite part about this place are the cookie cups!! Usually their still a little warm when you get them, and not too soft or too hard. They're perfect. Except this past weekend, I got my ice cream in a cookie cup and the cookie was so hard :( it made it extremely difficult to eat. Hopefully this one just a one-off because I have consistently loved it in the past!", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-17", "description": "The roommate and I wanted dessert. Decided to try Over the Moon on Sunday, March 11th. We placed an order through Caviar for delivery at 9:08pm. It arrived at 9:39pm. We live in Outer Richmond.\n\n*Mint Chip Ice Cream: Mint ice cream with chocolate chips ($3.70), Pint (+$4.75)\n*Coffee Caramel Crunch Ice Cream: Coffee, caramel, and chocolate chips ($3.70), Pint (+$4.75), Waffle cone on the side (+$0.55)\n*6 Cookies: Chocolate Chip, Cookies and Cream x2, Snickerdoodle x2, Peanut Butter Chocolate Chip ($10.50)\n\nI got the mint chip while the roommate got the coffee caramel. The mint chip was minty and refreshing. I did find the consistency a little too soft though as it wasn't as creamy as I like. A little airier than normal. The roomie's coffee caramel was richer and thicker. Though it had a very milky flavor. I wanted there to be more black coffee flavor. It almost tasted like a coffee with too much cream. We were really looking forward to the cookies. Unfortunately, we never got them. Not sure if it was Over the Moon or Caviar's fault, but it made our dessert less satisfying. And we couldn't get them redelivered as they were closed by the time we figured out how to report it.\n\nGood ice cream, but I really wanted those cookies. For this delivery experience, three stars.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "My sisters and I wanted dessert after eating lunch at Super Duper Burger, and we came across this ice cream shop. Its a small cute shop with lots of ice cream flavors to choose from. The flavors that we got are Salted Butterscotch, Pistachio, Butter Pecan, and Cookies&Cream. We all went for the classic ice cream cone =) I got the pistachio flavor, really good. I love the quality of their ice cream. It's creamy, has smooth texture and soft consistency.\n\nWill try the cookie cup ice cream when I come\nback! =)", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Such a cute little shop, how could I NOT give it 5 stars? \"And the cow jumped over the moon.\" Come on!\n\nThe gal behind the counter was so sweet and patient given it was a group of 7 of use barging in there. They have unique ice cream flavors that they let you sample without hesitance. I was so full from lunch, but decided to split a cone with my mom. We tried the Lavendar Honey, Funfetti, and Earl Grey. We settled on the Earl Grey scoop, and it was soooo good. Nothing like a scoop of ice cream for dessert!\n\nThey have ice cream sandwiches, too, and you can just walk in and grab a pint to go right from their freezer! Oh yeah, there are these little cookie bowls they have, too. Cute! The location is tight, but has some room to sit in the back. If you have a sweet tooth for some ice cream, I'd definitely give this place a try.", "author": "Crystal A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Walked in to this place not expecting the unbelievable experience we just had. Met Brian the owner that gave us outstanding service and really took his time to show us around and let us sample different ice cream's. Everything is handmade with the owners heart and tastes fantastic. Highly recommend this place. Try the Oreo cookie. Fresh out the oven.", "author": "S L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Obsessed with their ice cream! The most amazing and you are either a over the moon or smitten person! Highly recommended :)", "author": "Ellie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Cookie Monster greeted us at the door on Halloween with THE best chocolate chip cookie I have ever shared with my grandson. All of the vendors on Chestnut at the Halloween parade are wonderful but I have to say the cookie monster was the best ever and I will be back to fill my bags with cookies from this place it was amazing!! And the nicest happiest Cookie Monster was great!!!", "author": "Mb M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Sweet treat in the city. This was a little gem of a ice cream shop i stumbled upon while being out in SF this past weekend. They have a great range of flavors, which you can taste test before hand, and the best part is the cookie cups they have. You basically choose your flavor, and can get it in a chocolate chip, snicker-doodle or oreo cup. (*Yes the cookie is hard like everyone complained about, but if it was soft your ice cream would most likely drip or melt through it. Plus it softens up by the time you get to your last bite.) I tried the Oreo Coffee ice cream with the chocolate chip cup, a delicious treat all for $5. Next time you are in the neighborhood give this place a try, the staff is welcoming with a smile, and who can ever complain about good ice cream. \n\nP.S. - They have a area in the back you can sit and enjoy your treat as well, and take cute pictures for Instagram and your Yelp review :)", "author": "Vanessa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "The cookie cup is YUMMMMY! That's what I come here for (and as I always tell people, I don't even have a sweet tooth). I always order a single scoop of the honey lavender in a chocolate chip cookie cup. The honey lavender is sweeter than I prefer my ice cream, but the lavender is potent and floral-y enough to balance out the taste for me. The cookie cup is light and crispy around the edges, and then as you get to the center of the cookie, it's so chewy -- just like frozen cookie dough! It's a revelation. :)\n \nOnly complaint is the high price for the cookie cups -- it's $6 for a single scoop in a cookie cup. That's just a bit more than I'd like to pay for ice cream. But I guess I'm not surprised considering it's in a bit of an uppity neighborhood. :(", "author": "Jazzica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "This place was around the corner from a restaurant my husband I had for dinner so we decided to give it a shot. So glad we did! The cookie butter ice cream is fantastic! The cookies (I had peanut butter chocolate chip) were great and the staff was friendly! Great place!", "author": "Angela P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-15", "description": "the ice cream at Over the Moon was extremely soft in not a good way and frosty for the most part. The flavors were interesting but it was almost 5$ for a tiny scoop so i left feeling like i didn't get my money's worth.. the customer service was very nice however and i wish i at least got to try a cookie and if i ever come again, maybe i'll try.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Happened to be in the area and the ice cream craving was too real. I had to choose between Smitten and here, and considering the fact that I have had Smitten in the past, of course I had to give this place a try. I can definitely see why people are saying this place is better than Bi-Rite. I tried a couple of flavors and easily knew it was hands down way better. Their service is also pretty awesome. Normally I'm hesitant on trying more than three flavors, but they actually encouraged me to try more to make sure I'm making the absolute right decision since their flavors do rotate a decent amount.\n\nI decided to get a double scoop of earl grey and honey lavender together. It only costed about $5, which is very reasonable for good quality ice cream. My tastebuds exploded. If I didn't live so far, I definitely would've taken home a pint or two. \n\nNeedless to say, I will definitely be back... with a freezer bag and dry ice soon. Need more of them in my life.", "author": "Sondra T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Quality of the ice-cream is really good, consistently creamy texture.\n\n\n---- ICE CREAM ----\n\nLemon Cookie: 4.5 stars\n\nAmaretto: 4 stars\n\nHoney Lavender: 3.5 stars\n\n\n---- COOKIES ----\n\nChocolate Chip Cookie Cup: 4.5 stars\nI had mine fresh out of the oven and it was delicious, except that the ice-cream melted and began to drip out of the cup base corners so not as clean as I'd hoped.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I love this little ice cream shop! Staff is super friendly, the store is SO clean, and the prices are super reasonable especially for this area of SF. I have the Funfetti and it was the best (I can a b-day cake ice cream coonosier so believe me when I say this) birthday cake ice cream I have ever had. Really. None of those icey freezer burned chunks. Super smooth and creamy ice cream. Almost the same texture as Nitrogen ice cream. My boyfriend got the Snickerdoodle and it was amazing as well. In my opinion way better than the over-hyped Bi-Rite. \n\nPlus, where else can you hear country music in an SF establishment? I absolutely loved it. The decor is cute and simple. Will definitely be returning!", "author": "Brianna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Really busy on a Sunday. There was only one worker but he was super nice despite the stressful situation and many door dashers (I assume) coming in and asking for their orders. I felt bad for the guy working!\n\nAnyways, the ice cream was good. I'm surprised the  cookie cup that I got was still warm and not really hard as I'd think it would get after ice creams on it. I got the peanut butter banana and my sister got honey lavender. The smallest size is a very generous scoop so I was full after. The shop is suuper cute and they actually have seating! Will definitely be back", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "First off... this ice cream is FANTASTICALLY creamy. The shop offers a ton of flavors, but I was heavily influenced by the customer in front of me to choose the honey lavender ice cream. I wasn't disappointed, but really want to come back and have more of those flavors- especially a coffee one that looked especially amazing. If you're planning to walk around be careful.. this ice cream melts kind of quick. Also, grab a napkin.. because you'll feel some of the sticky luscious creamy goodness sticking to your lips after you've devoured your treat!", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "I was excited to see the cookie ice-cream bowels and all the flavors.  We ordered (chocolate chip bowl with vanilla) and upon my first bite, was slightly disappointed.  It was good, but not over-the-top for me.  The service was great and maybe I just ordered the wrong thing, but I'm sure I will be back.", "author": "Christine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "We usually always come here or smitten after dinner on chestnut street. \n\nThe staff here are friendly and are patient with you trying flavors even when there's a line. And the price is very reasonable! It's also a small narrow shop so don't expect to find seating. \n\nThey have some great flavors including salted butterscotch and mint chocolate chip which I usually go for.\n\nThey have cookies, which you can make a cookie ice cream sandwich with, but unfortunately don't have a gluten free cookie option. Also, I've been meaning to try out their shakes since they look so good!", "author": "Gita r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Omg best ice cream in the marina area.. the oreo swirl is so smooth it just melts in your mouth and the coffee Oreo is the like best of both world.. caffeine and sugar together I love it and the customer service is awesome. They are so nice and welcoming. If you are in the area I would recommend you coming here to try it out", "author": "Jennifer V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Went to visit the Bay Area and this ice cream spot was recommended and we definitely not let down on the amount of flavors they have! Really cute ice cream shop and they have Cookie cups", "author": "Belle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Yum in my yum! 2 scoops of coffee caramel crunch please!! Delicious!! \n\nThis place has so many delicious favors!  I couldn't decide! The guy at the counter over heard me tell my husband that I hope the coffee caramel crunch is good so he got a baby spoon and let me have a taste! SOLD!!\n\nThis place was a perfect way to end an incredible day!", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "This ice cream place was good. I would recommend getting the drumstick flavor. They have about 15-20 flavors available. I probably wouldn't recommend getting the ice cream sandwich though... the cookies were kind of hard and not that amazing. But ice cream was really good! Definitely come here if you are looking to get ice cream. It costs about $5.\n\nThere are a couple tables and chairs in the back if you want to enjoy your treat at the place. Parking is on the street and the place is located across the street from the Apple store and Walgreens. I would recommend this place to other people.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "This was an excellent ice cream shop - definitely better than Humphrey Slocombe to me. It still doesn't beat my SF favorite, Garden Creamery in the Mission, but it is definitely an excellent options in the Marina. I'd definitely stop by here anytime for a sweet treat.\n\nAlso, the guy behind the counter was super nice to us and incredibly friendly. I forget his name, but he was very patients with me taking all my samples and struggling to pick on a flavor.", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "I've actually never stepped foot into this location, but I constantly get Over the Moon delivered to me via GrubHub. All of their flavors are AMAZING and the texture/softness of the ice cream is unparalleled. Definitely one of my favorite ice cream places in San Francisco.", "author": "James D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Yummy and delicious... variety of coffee and liquor creams... mmmm... but not as hyped as they make it to be... its upscale baskin robbins ...natural flavors ...very creamy ice cream... i prefer my ice cream hard not soo churney.", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Can't get much better than cookies and ice cream. The cookies at this place were incredibly tasty! They were simply and perfect. Lightly crunchy on the edges and gooey in the middle. The ice cream sandwich can't be beat! \n\n4 stars for cleanliness and no bathroom :(", "author": "Kaley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "We had a lemon cookie ice cream in a snickerdoodle cookie cup. It was absolutely scrumptious! The ice cream was true to its word -- there were little chunks of lemon cookie inside the ice cream. The cookie cup itself was the most interesting part. The cookie was thick enough so that the ice cream did not melt through the \"cup\" and then it was really fun that we were able to finish some of the ice cream and then bite off some of the cup. The cookie itself is a little bit thick because it has to hold the ice cream, but it definitely tasted fresh. It may be a bit small for two people, but not necessarily for two people who are trying to \"be good and somewhat healthy\" while eating ice cream ;) Also, the cashier was very friendly (we went on a Saturday night), and we would be back next time we are in the area.", "author": "Molly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Nom nom - I really love this place :). My coworkers and I were having sushi nearby and decided to come here after for some ice cream. I got the caramel cookie dough in a waffle cone - really soft and good. They're also open quite late which is a bonus.", "author": "Mira B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "The ice cream is pretty bland. I tried 4 flavors and they were all meh. The cookies are airy and stale tasting with a weird after taste. Cream Is much better. $5 for the whole thing. I'd recommend going to another spot but it's location and inside seating is quite nice I'll say.", "author": "Kalani R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "WHOOHOOOOOOO anotha one \n\nCame here for an Uber Eats order and FELL. IN.  LOVE.\nNo seriously though this is some epic stuff. If you've ever been to Tara's Organic then you'll know what it kinda compares to. \nYeah. Epiiiiiiiiiiic.\n\nBoth workers were super friendly and patient with my indecisiveness. Explaining everything patiently yet fun is how I would describe them. Went with Andes Mint Chip and a Cookies and Cream cookie! Very easy to eat even WHILE I was driving (no I don't do that all the time). Love my ice cream with a good balance of creamy yet firm. I'd best describe this combo as fresh with a soft, milk chocolate kinda finish.   Perfect  \n\nWould definitely come back after any and all meals in the neighborhood!", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "Eh. Just a typical ice cream place to me. Maybe I'm not an ice cream connoisseur. :/\n\nThe bf and I tried the earl gray flavor, and it tasted exactly like the tea. It was delish! The salted butterscotch was way too sweet. We were hoping the salt would subdue the butterscotch's sweetness, but it didn't...\n\nThere were some baked goods too if ice cream isn't your main attraction. Though Over the Moon was small, there were some tables and chairs towards the back. Oh. And we also saw a to-go order take place. Ice cream to-go during the winter?! Okay...", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "If it was possible I'd give this overall rating 3.5 as opposed to 4.\n\nThis ice cream is tasty and mad creamy, which I like, but overly sweet. This place is not just over moon, but over the top. The ice cream becomes inedible after a few bites, at least the flavors I had which were funfetti and salted butterscotch. \n\nThe chocolate chip cup needs work, not good, flavorless, and too tough. I would give the chocolate chip cup 2 stars if I could.\n\nBut the girl working at the counter was mad gorgeous.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "My boyfriend and I tried this place for dessert after dinner. I loved the wide variety of flavors and how helpful the staff are (especially with sampling). The single scoops were generous servings. I got the earl grey, which was delightful and so creamy! The place also has a small seating area in the back if you wanted to sit and enjoy. I'd definitely visit again if I'm in the area!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-03", "description": "After seeing the reviews, we decided to drop in while in the Marina.  The reviews & claims about Over the Moon intrigued me.  Sadly for me, the ice cream didn't live up to the hype or 4+ stars.  I tasted a few flavors & nothing wowed me because most were too sugary.  I ordered 2 flavors in a single & they were so underwhelming that I can barely remember what they were.  1 chocolate somethings and ... ???  My friend got a cookie cup & didn't like it because the cookie was hard & lacked flavor.  Maybe it was an off night but it was a prime weekend night so that doesn't bode well in my book.  There is no way I would select Over the Moon instead of Bi-Rite.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Great prices. Good sizes. Fast service. And a very cute place to sit down and have some ice cream with friends! I went with my friends and we all loved the location and setting, thanks for being so awesome Over the Moon!", "author": "Frances D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "I found this place while trying out MAC'D up around the corner! Their cookies and ice cream are delicious!! I can't wait to go back! I will def bring some cookies home with next time!! The whiskey Praline ice cream is sooo good!!", "author": "Tahvooche S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Finished up a business meeting in the area. Didn't want coffee, didn't want food....\nHow about Ice Cream Yogurt!\nThis place was perfect for great tasting ice cream. Great modern interiors with adequate seating. They had yogurt with minimum flavors.", "author": "Pstephan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "If you are in the Marina and are craving ice cream, I recommend trying this place.   I love how there are so many options!  Although they can get busy, it is worth it.  I did come here before and got the cookie monster which was amazing but this time I opted for an ice cream sandwich ($6). I ended up choosing the oreo swirl and wow it was so creamy!  I also got the cookies n cream and peanut butter chocolate chip cookies for my sandwich.  I loved the peanut butter chocolate chip that was so good! This place will not disappoint.", "author": "Mikayla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Over The Moon has amazing ice cream. My favorite flavor so far is Drumstick which just rebranded as Nutty Cone Dip. It has peanuts, chocolate, and waffle come inside. After first trying this place, I've stopped by to get a pint every week. The staff here is very friendly and clearly passionate about their product. They make all the ice cream in the back of the store and that's why it's so fresh and delicious. A must try!", "author": "Kana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "Cookies - I absolutely love coming to Over The Moon creamy for their chocolate chip cookies. I've tried Sift, Cream, Baked Bear and a few other shops but NO ONE has CC Cookies as good as OTMC: they're big, full of mini chocolate chips and not too sweet - just perfect. \n\nIce cream - it's SO sweet. I just can't. The flavors are creative. The chocolate is weak. \n\nI love the location and friendliness of the staff. I'll continue to come here for the amazing cookies!", "author": "Angel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "I came here since I was eating nearby. I was so excited to see honey lavender, I absolutely love flower flavored ice cream. \n\nI got two scoops, honey lavender and the whiskey praline. The lavender was delicious ! It is one of the strongest lavender ice cream I ever had. The whiskey was flavorful too. But the lavender ice cream stood out. Great ice cream here!", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "Yum. We came here after dinner at Isa. My boyfriend and I ordered 2 scoops on a waffle cone to share. We got the Earl Grey and Lemon Cookie flavors. The flavors they offered were really interesting. The Earl Grey was so delicious and tastes floral just like the tea but without the pungency and bitterness. The Lemon Cookie was sweet and satisfying with a hint of lemon. The waffle cone was crisp and light.\n\nThe quality of the ice cream is rich and decadent. This is definitely a good place to come for dessert after a meal. I only wish there was more seating!", "author": "Joan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Lou'ed this place! I had their whiskey ice cream, it was real yum. Price is also pretty decent. Definitely recommend.", "author": "Sai J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Popped in here on a whim after lunch and loved the idea of a cookie cup for your ice cream. But we both ended up getting a sugar cone. But the ice cream was good, had wonderful flavor and the service was good and quick.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Cute and affordable ice cream shop in the Marin! Perfect spot to cool down after walking around the neighborhood.\n\nRecommend their coffee oreo cookie and earl grey! It's a bit on the sweet side but what ice cream isn't sweet. \n\nIt's also reasonably-priced - $3.50 for single scope, in a cup or one a cone (no extra charges). Very friendly staff and cute store decors. \n\nThere are seats inside but they are all of the way to the back. I would have liked to be closer to the street where I can people watch and enjoy the sunshine.", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Genius idea, homemade cookie ice cream bowls.  Had not seen that before and the place gets 5 stars just for them (the ice cream was quite good too)!", "author": "Brian N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-20", "description": "I really liked the flavors of the ice cream I got, honey lavender (I love lavender flavoured ice cream) and whiskey praline (which tasted a bit like a ferrero rocher) but the ice cream consistency was weird and goopy... like when i pulled the spoon out I could wrap the goop up around the spoon a couple of times... I thought it was fun at first, but it ended up just becoming borderline gross.  I'm not sure what causes this consistency/if all the ice cream is like this but I'm not a fan and would not come back here again...\n\nNot apart of the rating, but the parking here is also ridiculous... we found it quite hard to find a parking spot and also the meters are $6.50/hour.", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Good ice cream flavors (I would say maybe a tad more inventive than your standard flavors, but you won't find anything super crazy here), and I love the cookie cups!", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-07", "description": "In a city that has some of the best ice cream in the US, you have to bring your game. I tried 4 flavors and they all tasted the same. The ice cream here is very thick and carrageenan laced. The cookies were stale. We threw our whole order in the trash it was so bad.\n\nLife is too short for mediocre ice cream", "author": "Perry V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Came here around 8pm on a Thursday after dinner for desserts! Parking sucks around here but lots to look at when you do find parking. There was a short line when we arrived and got to try flavors before buying. I wish they had the earl grey when I went, but I really enjoyed the mint cholocate chip and the caramel cookie dough on top of my sugar cone. It is $5 for two scoops and they have a specialty where they have fresh baked cookies as a cup for your ice cream or a cookie ice cream sandwich - I was too full so I didn't get the cookies, but I will return for it one day. Service was friend and quick. They also sell freshly packed pints for you to bring home too. There's also a seating area in the back :)", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Wow. The best of both worlds! Ice cream in a cookie bowl. Natural ice cream in a bowl of chocolate chip, snickerdoodle, oatmeal raisin, peanut butter chocolate chip or Oreo. A great treat!!", "author": "Lorin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-22", "description": "Manager treated employee that I know extremely disrespectful. This manager does know what to do and always makes a scene about everything. I witnessed the manager grabbing his female employee, (maybe 16) and show her something or try to prove a point. The ice creams taste worse then Safeway ice cream, all you come here to see is the drama between the manager and employees. Never coming back.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "I stopped here with a few friends on Sunday as we were looking for a late night spot to appease our sweet tooth. First of all, I love the RENT connection (Over the Moon monologue). It's a cute little shop with some chairs in the back to sit down and enjoy your treat.\n\nI ordered one scoop of the the honey-Lavender ice-cream which was unique and excellent. (Cost $3.50) My friends each got a small chocolate chip cookie and the Coffee Caramel Crunch (Cost $4.75). I had a bite and I must say it was quite good.\n\nThe servers were friendly and helpful. Overall a great spot that is open late :)", "author": "Janie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "This ice-cream joint definitely gives you a \"home-y\" type of feeling. The worker was very patient with us and allowed us to sample more than average amount of Ice cream flavors since we were very indecisive. I ordered a single scoop, and she allowed us to do a 'secret-menu' half scoop of two different flavors which was great since we couldn't decide on just one. The ice-cream was thick and creamy and the service was great. The pricing was reasonable for the amount you get. There may not be much exotic flavors but still a great ice-cream creamery! Will be back once I go Over the Moon once more (:", "author": "Binh P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Cute place with great ice cream - standard and fun flavors. Great little seats in the back for devouring.", "author": "Tamara d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Such good ice cream! Was so happy I stopped in. The woman who worked there was so nice and friendly and the ice cream was great!", "author": "Aviva M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Been here a couple of times. It's largely an ice cream parlour but they also have cookies which I think are actually better than the ice cream. \n\nGet the chocolate chip cookie and the cookies and cream cookie (ask them to warm them up for you)!\n\nOn the ice creams, they do have a good variety of flavours and toppings. They also have ice cream sandwiches and have a bowl made from a cookie.", "author": "Tanay J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Small ice cream shop in the middle of a lot of high end shops and people.\n\nIce cream is good - on the rich side but not as rich as some other ice creams.  Great flavors and they let you taste it too.  I personally like their cookies better than their ice cream, especially if they give you a warm cookie.  A few tables in the back and a few stools in the front, otherwise there's not a lot of space to enjoy your ice cream here.\n\nBUT, I also just discovered there's a Smitten ice cream down the street, and I do like Smitten because of how smooth their ice cream comes out, so next time I might do a comparison!\n\nSuper friendly but sometimes it looks like there's no one in the shop.  Just ask for help and someone appears out of nowhere!", "author": "Traci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I had the frozen banana and it was the best ice cream I've ever had. It had nuts in it! There were so many great choices, definitely will come back again to try more flavors.", "author": "Maritza A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "My first time at Over the Moon was this past weekend, when I discovered they don't use eggs to make their ice-cream! Big win for me. I ordered the Coffee Oreo flavor and it was delicious. I've definitely become a repeat customer! :)", "author": "Nidhi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "I had the Cookie Monster ice cream, and it was average. Note: I'm not a huge ice cream fan to begin with, but the blue ice cream and high reviews intrigued me.\n\nBut the cookies are to die for! We sat down outside to finish the ice cream and decided to try a cookie, and O M G. They were still warm and oh-so-soft. This might sound weird, but the cookies were fluffy! The texture was really unique -- the inside was almost bread-y and the outside was nice and crunchy. And did I mention it was still warm??\n\nWe tried the snickerdoodle and the cookies and cream cookies. They unfortunately ran out of the Oreo flavored ones ): I really liked the snickernoodles while the bf liked the cookies and cream ones. \n\nI'd definitely come back for the cookies, and to try one of their ice cream sandwiches!", "author": "Doris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Staff was friendly, cookies were tasty, ice cream was bland and didn't have much to it.  We got the cookie monster ice cream and it was just vanilla ice cream died blue with a few cookie pieces here and there and it was super soft so you couldn't eat it like an ice cream sandwich.", "author": "Geena G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-01", "description": "Bad service and attitude. The ice cream is too sweet and the waffle cone I got was soft", "author": "Yuheng D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "This is one of the neighborhood ice cream shops and the quality is really good. I've tried the Cookie Monster and pistachio flavors. Prices are reasonable and service is friendly. Be sure to ask for samples!", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Good stracciatella  ice cream. It's creamy but not too sweet. The cookies are good to. However, the cookies are a little cakey", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Really good ice cream. Tart vanilla frozen yogurt. Great service. Price is a little steep.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Yum yum yum! The ice cream is super rich and delicious. Got the cookie sandwich. The cookies taste homemade, and are soft and chewy. The salted caramel ice cream is insanely yummy!! Not a lot of seating inside, but the area is so cute to walk around.", "author": "Kaylee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "Very cool concept of a cookie cup. This is the main reason why I came to try this place out. I sampled a few flavors, and I was totally into the lemon cookie (I'm a lemon fanatic). I ordered a scoop of the lemon cookie on top of a chocolate chip cookie cup, and the total came out to be $5, which was not too bad of a price, considering it's premium ice cream. The cookie was a bit stale and DEFINITELY not gooey and fresh, so I didn't even bother finishing my cookie. However, I think the ice cream made up for it because it was just so creamy with a refreshing lemon kick. I would come here again, except maybe skip the cookie and just get the ice cream in a cone or something.", "author": "Sue Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "For all the flavors we tried before choosing the ONE, I have to say the guys behind the counter were pretty patient. \nThere was one flavor called \"nutty\" (tasted like a drumstick) & that was delicious! Will be back!", "author": "Tina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "SWEETNESS OVERLOAD! Cute little ice cream shop with a bar to enjoy your ice cream and view the busy city. Two small scoop of ice cream and two cookies came out a total of $9.-- Expensive in my opinion but it was worth the try. \n\nOrdered:\nSmall with cookie.\nCookie Monster w/ a chocolate chip cookie: Their chocolate chip cookie is delicious. It's not your average cookie either. It's very moist and chewy; plus the fact I got my cookie warm was the best thing. I like how the ice cream was very creamy but I over did it with the cookie monster ice cream though. Cookie on cookie was too much for me. Glad I found out about this ice cream shop. \n\nP.S they offer a cookie bowl!", "author": "May N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Although they have many flavors to choose from, nothing really stands out. Most of the ice cream colors are white too so it's hard to tell which one will really look flavorful(I personally think colorful things taste better). You also get to try the ice cream before you choose your flavor which is really nice. I tried the honey lavender but the \"lavender\" scent was way too light where you can't really taste it so I tried the whiskey praline and it tasted better the honey lavender so I stuck with the whiskey praline and coconut. Two scoops are $5 is a good price compared to $4.50 for a single scoops at Bi-Rite. The ice cream is a little too sweet for me but come here to try some extraordinary flavors like whiskey praline and earl grey(*wanted to try this but they didn't have it today)", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Amazing! I had small size Chocolate ice cream. It  is  the best  ice cream I have ever had. It reminds me of the days when I was a kid and went to school. There was  the same ice cream in our tuck-shop.\nSo sweet memories. Thank you. I give five stars", "author": "William S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "I'm surprise that there was a long line even for night time...i guess it was a nice night. \n\nHad the honey lavender, one scoop for $3.50. I thought its kinda expensive for a small cup. Not sure its that price since its in the marina district. They didnt charge tax which is a good thing but to me its still pricy for a really small cup.\n\nAnyways, the flavor of this ice cream was good. Had some honey/candy crunch. Had that sweetness and taste of the lavender. \n\nNow i can finally say i tried this place after passing it so many time", "author": "Julie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Definitely rich and creamy. I love ice cream so I was happy to taste the funfetti, caramel cookie dough, and chocolate. Nothing wowed me but it's def ice cream so I'll eat it. Funfetti was pretty and fun looking and kinda tasted like cake. I ate it with the caramel cookie dough and both tasted the same  to me - just really sweet and creamy.  Perhaps the cookies compliment the ice cream better so I should opt for an ice cream sandwich next time.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "Not a fan of the raspberry sorbet but the cookies look great.\n\nRaspberry sorbet seemed too sweet and lacked raspberry flavor. Last night I had the best raspberry crepe from Ooh La La on Polk. Maybe Im spoiled now. Cool looking polka dot cup but I think you should try their cookie cone.\n\nInterior white with one bright orange accent wall. Music plays at a comfortable level. Some seating in the far back but outdoor benches or eating to go are also good options.", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-17", "description": "When we found this spot on Yelp after having lunch in the area I was really excited. I love homemade ice cream places and the flavors sounded so delicious...but turns out something gets lost in translation here from concept to final product.\n\nThere was a line out the door when we arrived, which I took as a good sign, so we patiently waited. The place is a really narrow store front which makes it a bit stuffy when you get inside, but nothing worth complaining about because everyone takes their ice cream outside (there is only seating for 2-3 people up in front but no other seating area). \n\nI sampled the funfetti, caramel coffee crunch, frozen banana, and salted butterscotch. These were all flavors that sounded amazing to me but each one fell flat when I tried them. I felt so bad though, because the man and woman working the counter were so nice, so I ordered the salted butterscotch because it was best out of the ones I tried. I had it served in a cookie cup, which was the only thing I loved, and together they ran me about $5.\n\nI was thinking that maybe the ice cream was just outside my personal taste but the two girlfriends I was with were feeling the exact same way. I don't know...service here is excellent but the ice cream was a total miss. Sorry, Over the Moon!", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-27", "description": "Two stars for the simple fact the ice cream is good! Unfortunately the manager is in there treating his employees like crap. It's sad to see this in front of customers and not even no what's going on behind closed doors.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "I only came in for a one scooper ($3.50) after dinner and got the honey lavender flavor.  I got pretty excited when I heard they had cookie bowls but they looked either overcooked or stale, so I just opted for a bowl.  \n\nThe honey lavender tasted a little soapy?  Honey lavender is usually a pretty difficult flavor to perfect in my opinion, and I don't think it was really captured in mine.  But my other friends also noted their ice cream was pretty meh and on par with Rite-Aid ice cream.  With so many other ice cream shops in SF, I think I'll probably stick to those.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Cravings for ice cream got to myself and group of friends. A friend wanted to try this place out and insisted we go. Once I saw Earl Grey and Honey Lavender, I was set on what I wanted. I opted for a cookie cup for my scoops.\n\nOverall, I regretted the cookie cup the most because it was hard to eat and not particularly tasty so it really was just a more expensive bowl for me. The ice cream was flavorful, but too buttery? I'm not sure how to describe it, but the texture was overly creamy for me and hard to stomach. Granted, I was extremely full from dinner. \n\nOverall, I probably wouldn't choose to come back here but I am curious about the actual cookies.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Over the Moon is over the top.  Wow, how do you get your ice cream so creamy?  I enjoyed the mint chocolate chip, oatmeal - raisin cookie sandwich.  The people that work here are friendly and this place rocks.   Good ingredients and tasty homemade ice cream and cookies .", "author": "Justin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "I thought scoops of ice cream served in a chocolate chip cookie bowl was only something I'd ever see on BuzzFeed, but they've got 'em here along with a ton of unique flavors like drumstick (what we got), earl gray, funfetti, pb&j and honey lavender. A pretty good treat except I wish the ice cream was creamier and the cookie bowl was softer.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Yum! Great selection of ice cream flavors, frozen yogurt options, add-ons, and the cookie bowl.\nThe ice cream is rich and creamy, thicker than most other places. \nI enjoyed the \"mix-in\" flavors I got: chocolate with peanut butter and vanilla with waffle cone bits, hardening chocolate, and peanuts.\nThe cookie bowl is one thing I liked but won't get again; it holds together but I like soft cookies and didn't love it. Not unhappy with getting it, but wouldn't get it again.\nOverall, am for sure going back for the ice cream!", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "Yes good. Icecream is good rhey have in cone or in cookie as sandwich. I think the hype is over. This place was empty. Its in the marina so unless they start selling beer to the marina bros or strained tofu to the marina chicks they are gonna be boarded up. Unless there is a possibility of a marina chick getting laid there they also wont support this establishment so good luck to this little icecream place.", "author": "Satoshi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Can't say no to ice cream on a hot day! We stopped by after the Fleet Week airshows and each got a scoop. They have a wide variety of flavors--some unique, some conventional. \n\nThe place was clean and service was very friendly, happily helping us sample some flavors. I was torn between Honey Lavender and Lemon Sorbet, but decided on the sorbet in a sugar cone. My boyfriend got the Oreo Swirl in a cookie cup (very creative!).\n\nWe both loved the ice cream, very creamy and flavorful. The Oreo Swirl and the cookie cup were a little too sweet combined, but overall everything was delicious.", "author": "Julianne V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "Limited ice cream flavor but pretty tasty, the froyogurt is okay, but the fresh baked cookies are a must! Warm and gooey deliciousness. I would definitely come back here just for some fresh baked cookies.", "author": "Amrita P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Loved this place!  I had a scoop of coffee oreo and stracciatella on a plain cone and it was wonderful.  I will try their cookies next time because they looked delicious.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "2 flavors in a small! Score. Nice treat while walking around the shops/bars/restaurants on Chestnut in the Marina. I got earl grey and honey Lavender and both were so good. Love the whole gourmet ice scream scene that has exploded between here, Salt & Straw, Humphreys, Bi-Rite, etc.", "author": "Anya R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "I visiting in March. The cookie was perfectly cooked and although it wasn't warm it was nice crunchy, gooey combination. Great for a warm afternoon stroll through the marina. Friendly staff.", "author": "Olivia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "Amazing ice cream and always a great place to top off your meal with this ice cream. I would recommend the Cookies and Cream, honey lavender or lemon sorbet.\n\nGreat recipes and def worth trying when you're in the Marina.", "author": "Kunal T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Best ice cream,  not like ones you buy from a grocery store and so many flavors really had to choose which one to get. Must visit if in that area", "author": "Lavi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "I am updating my opinion about this location in the Marina. I had initially given them four stars. Now a few years later I am dropping them to a two. I just had ice cream delivered, as we do all the time. Again they've sent the wrong ice cream!!! Ugh! If you are like us and have that favorite one. Then you can understand just how annoyed we are. Especially if you are being bad and splurging.. then you want the extra calories to be worth it. The scoops they sent weren't even close to what we wanted. And was the least sweet choice out of all their choices. We had a sweet tooth! We live locally and have ordered many times from the Marina location.  (Several years) We will never order delivery from here again. Lost a good couple of customers guys! Your employees need to flow down, read the orders and pay attention. Bye, Bye", "author": "Kirk M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "Definitely worth a try if you're craving a cookie ice cream sandwich.\n\nThis place is located on a really hip looking street. At least it is at night! The whole street is full of activity, but family friendly activity. The ice cream shop itself if VERY well lit so it's absolutely perfect for pictures! \n\nThe man who helped us was super nice too. He patiently waited while we were tying to decide. They had a flavor called Straciatella, which I've never heard of. It was good! He let me try it before I got it too, which was nice. \n\nThe cookie itself was pretty warm and perfect amount of softness. \n\nThe only thing is that this place wasn't tooooo memorable for me. It was a great little shop and I enjoyed my ice cream sandwich, but the flavors are kind of generic and I could easily make these cookie sandwiches at home or find a place anywhere I go that would have similar flavors and same concept.\n\nOverall I enjoyed the place and would consider coming again if there wasn't another place I wanted to try.", "author": "Hana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Ice cream was amazing! It was a hot day in the city so I decided to get some ice cream on my walk. I got Honey Lavender and Earl Grey. Those two together was divine! It was creamy and tasted very fresh.", "author": "Anissa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Went after dinner from Blackwood, the family and I had funfetti in a cookie cup (DELICIOUSNESS), mango on a cone, & caramel cookie dough in chocolate chip cookie cup - about $13. Little pricey but it was delicious and we enjoyed the sweet, delicious ice cream treat!", "author": "Verenice F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "I don't like their cookies. I feel like they are too undercooked in attempt to make them extra soft chewy. I do love their icecream; it is perfectly creamy. They had a berry flavor that was perhaps one of the best flavored icecreams I've ever had. I was sad when I learned it was only seasonal, but the other flavors didn't disappoint.", "author": "L. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-10", "description": "Since I'm an ice cream lover, I'm surprised I never heard of this place. I was in the area and paypal was offering a deal for Over the Moon, so I just couldn't resist.\n\nParking in the marina could be a bit difficult depending on the time of day and what day of the week, but in general, the marina is a pretty busy place. It's all street parking or residential parking. You really have to test your luck and patience here.\n\nThey have a great ice cream selection here. I ended up getting the coffee caramel crunch with chocolate chip and snickerdoodle cookies. Their ice cream sandwiches are only $4! Personally, the cookies were way too sweet for me. But they were soft baked cookies which I like. But I LOVED their ice cream. They also had Andes mint ice cream which was chocolate ice cream with bits of andes chocolates. This was also one of my faves, the chocolate was rich and not too sweet, reminded me of a fudgsicle and the subtle hint of mint was delicious. They also have the cookie monster flavor which is blue colored vanilla ice cream with bits of chocolate chip cookies, how adorable! They also have other unique flavors like honey lavender and earl grey.\n\nService was meh. The girl that helped us was definitely not happy to be working on a Saturday night. I came with the bf after dinner and he ordered himself a bag of cookies. I was ordering separately to use my Paypal offer. After helping him, she went ahead and just stood behind the register on her phone! I felt bad for interrupting her but I asked to try some flavors. After sampling, she asked me if I was going to order something with some attitude in her tone of voice. Of course I was going to order something! Why else would I still be standing there after sampling ice cream flavors?! Afterwards, she went to the back and left the front unattended. Pretty unprofessional if you ask me. A group of people walked in right after she left too and they weren't helped until another work came back out.\n\nThe only good thing here was their ice cream. Honestly, a 2 star place, but giving it 3 because of their ice cream.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "I picked up a pint of vanilla ice cream from them to give it a taste. More like melted marsh mellow refrozen. Didn't like the taste or consistency. Maybe I'm missing something...but I always judge new ice cream by vanilla because you can't disguise anything with taste. Vanilla is vanilla.", "author": "norman c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "A small shop located in the heart of the Marina.  Not a lot of seating inside, but there are chairs outside to sit and people watch.  Line was out the door when I came on a Sunday afternoon, but the line moved quickly.  Parking is the worst anywhere you go in the marina, so can't blame them for that.\n\nPrices:\nSmall (one scoop) - $3.50\nMedium (two scoops) - $5\nLarge (three scoops) - $7 \n2 Cookie Ice Cream Sandwich-$5 (Must-try) \n\nThe selection is very different than most ice cream shops.  There are a ton of unique flavors including Drumstick and Cookie Monster.  I tried the HONEY LAVENDER, OATMEAL CHOCOLATE CHIP COOKIE SANDWHICH ($5), and everything about it was perfect.  The cookie is not your ordinary cookie, but rather thick and freshly baked.  The ice cream was higher quality than normal, and the unique flavors really add to the selection.  The cashier also recommended the COFFEE CARAMEL CRUNCH, so I am definitely trying that the next time I'm here.", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "So, I will shamefully admit that this marks the fifth time I had ice cream this week. But man, was it worth it! Move on over CREAM, you've got some sugary competition! Kind of. CREAM, in its various incarnations across the Bay Area, is still far more easily accessible than Over the Moon out in Marina, and sometimes convenience does win out over quality (instant ramen, anyone?).\n\nWhile my friend ordered their coffee caramel crunch with a chocolate chip cookie on the side, I went with their pistachio and a double fudge on the side (neither of us were willing to do a full ice cream sandwich for our first meal of the day). I was initially a little skeptical about the savory and sweet combination, but it worked out fantastically well: the slightly salty pistachio ice cream offset the super sweet double fudge (and chocolate chip half I snagged from my friend) nicely.\n\nTheir ice cream alone can't stand up to the likes of Humphry and Mr & Mrs, but was definitely tastier than that of CREAM. Their cookies, on the other hand, were quite tasty on their own, though a little inconsistent in texture: the chocolate chip was nice and soft, while the double fudge was harder. Whether this was due to higher demand and thus, faster turnover for the former, or just a matter of how the cookies are made, I'm uncertain.\n\n***Accessibility Info***\n\nVenue - The venue's pretty small, with slightly higher counter seating up front, and a few regular two tops in the back, that are perfectly accessible.\n\nBathroom - Didn't check them out.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-12", "description": "The caramel cookie dough had a very smooth texture and good flavor. I ordered it with the cookie cup and unfortunately the cookie was not warmed up nor tasted good. There is also no bathroom provided.", "author": "May M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Over the moon, the stars and maybe the universe. I'm glad I made my way to Over the Moon from an overcrowded/overrated ice cream shop. It was de most memorable kilometer of my trip. The two of us walked towards the cashier. I ordered an ice-cream sandwich with one oatmeal chocolate chip cookie and a cookies'n'cream cookie. For ice cream I have chosen chocolate/raspberry. \n\nEverything was absolutely exquisite. My only suggestion for improvement is adding some sort of ventilation, and a bathroom for customers. \nHopefully I will make my way back to the Marina soon and have some more Over the Moon.", "author": "Fernanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Seriously the best I've cream ever! I'm from Seattle and we have to stop by Over the Moon every time we visit family in the Marina!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "So many unique ice cream flavors! We got the espresso Oreo and earl grey in a cookie cup  the cookie cup was surprising quite enjoyable! It was a bit crunchy//chewy in all the right areas. Yummy!!", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Yummy flavors and cookies! I had the ice cream sandwich with oatmeal raisin cookies and ginger ice cream. It was amazing! My husband had the funfetti ice cream, and approved of it (it really tastes like frosting from childhood birthday cakes)!", "author": "Catherine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "Their ice cream isn't too thick but creamy! This is comparison to Bi Rite Ice cream.\nBut over all I like over the moon ice cream. They have about 16-18 flavors and my favorites are:\n\n* Honey Lavender\n* Caramel Cookie Dough\n* Crunchy Caramel Coffee\n\nSorry I'm not a sorbet or fruity type of ice cream person, so I have not yet tried those flavors.\n\nAnd here are their pricings:\n* Small (one scoop) - $3.50\n* Medium (two scoops) - $5\n* Large (three scoops - $7\n\nCheers!", "author": "Inge C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Let me just say..... honey lavendar.... does it get much more incredibly delicious than this? No.\n\nLots of other delish flavors. Great service. Awesome post date spot!", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Great service.\n\nWonderful flavors that I have loved are salted butterscotch,strawberry and vanilla bean.", "author": "Priyanka L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Love the COOKIES, but the not-so-much the ice cream. In fact, this joint can quiet possibly be one of the top cookie spots in the city! Yes, I would chose this over Cream any day -- because the cookies are THAT good. Their ice cream is very flavorful but a bit too rich and creamy for my liking -- kinda gave me a stomachache. \n\nTheir homemade cookies though... O MG I would come back solely for the Oatmeal Chocolate Chip cookies -- PERFECT googey center, buttery, and full of cinnamon and chocolate sugar goodness. WOW!!\n\nI got Ice Cream Sandwich ($5): coffee caramel crunch ice cream (sounds amazing already, right?), chocolate chip cookie, and oatmeal chocolate chip cookie. I ate the whole thing deconstructed aka I asked for the cookies \"on the side\", so that I can enjoy each treat individually. \n\nThey are known for their Coffee Caramel Crunch and Honey Lavender flavor. The homemade cookies were the perfect size and shape, medium with height so you know it's gooey and buttery inside -- so amazing!\n\nThe man behind the counter could be a bit sweeter, I mean it is an ice shop after all and people want a happy, joyful overall experience. Nevertheless, his service was speedy and efficient, but I did feel pretty rushed to make my choice and move on. It's a bit stuffy inside too, but they have a great countertop seating at the storefront, so it's perfect for people watching. Overall, cookies are worth it and Da Bomb!  I'm a fan fashizzles :D", "author": "Ellen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "We stopped in here to grab ice cream quickly (like, really quickly because we were about to get a parking ticket). It was a little pricey, but what isn't pricey in San Fran? I like that they have cookies too so that you could make an ice cream cookie sandwich if you had the time and weren't about to get a parking ticket.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "I had a fantastic experience at Over the Moon!  They offer several flavors of delicious and creamy ice cream! After selecting a flavor, I topped off my sundae with a warm, fresh-baked chocolate chip cookie. Yum! Fast and friendly service! Two thumbs up!", "author": "Desiree J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "To rate this place anything less than five stars would just be dishonest. \nEasily the best ice cream shop in SF without a doubt! Taste homemade and they always have fresh cookies hot out the oven.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-19", "description": "There's nothing wrong with Over the Moon, but I just didn't feel, um, over the moon?\n\nAlthough they have a wide selection and some of the flavors are innovative, the ice cream was too creamy (if that's a thing). I also tried the cookies, but they simply tasted like break-and-bake. \n\nNow, I'm not necessarily saying this is a bad thing, but I don't see the need to try it again.", "author": "Gabriela K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "Slightly over-cooked cookies, surly service, and decent ice cream are the hallmarks of this overrated ice creamery. If you're looking for ice cream this establishment is serviceable, but if you have a discerning pallet, or an acute sense of expected service, you should go elsewhere. Try Cream in the mission for a cookie that is superior in all respects.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Got the freshly made banana ice cream and can I just say \"YUM!\" A sweet little sweet shop with out of the ordinary ice cream flavors and freshly baked chocolate chip cookies, what more could you ask for?", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I've never had ice cream this good in my entire life!!!! For the price you get a generous amount, and no matter what you order, the ice cream tastes EXACTLY like that. My cousin got PB&J and it tasted so accurate, and I got honey lavender and coffee and the smell and taste were DIVINE for both of them. It's really rich so don't expect to eat 3 scoops like you probably would at Baskin Robbins or Smitten. But. It. Is. Worth. It. I drive an hour for this place every Sunday lol", "author": "Nykki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "I came to Over the Moon on a Friday evening with a buddy.\n\nWhen I witnessed a large party of preteen girls indulging in Over the Moon's delectables and later leave the premise fashionably in limousine, I knew I would be in for quite a surprise!\n\nI was delighted with a scoop of PB&J and a scoop of Mint Chocolate Chip ice cream.\nI enjoyed the ice cream's fresh and milky flavor. The chocolate in my mint ice cream also had a nice softer texture (differing from the usually chunkier chocolates that you get in mint ice cream from a grocery store) which blended well with the mint ice cream.\n\nThe service was good and the place was well kept. I don't remember the exact price, but I paid roughly $4 for two scoops.\n\nAddendum:\n\nI found the naming of the store to be quite witty. The name of the store pays homage to the nursery rhyme \"The Cow Jumped Over the Moon\". Check out the cow and the moon in the store's logo! Over the moon is also an idiom that means very happy/delighted.\n\nI guess you could say my experience was \"over the moon\" :)", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "All around great ice cream. The shop has a great array of flavors which are all innovative and delicious. Would not recommend the cookie cup. Would highly recommend the funfetti flavor ice cream.", "author": "Rose J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-03", "description": "i love ice cream especially homemade that has thick creamy consistency which this scream really had but the rest was total failure. Overly sweet, extremely sweet. i couldn't get passed 3rd spoon. I had to throw it away. I have a 3 year old and of course I din't want her to eat her scoop either so was trying to figure out what to tell her so she can willingly give her ice cream to me and give up on eating it which was extremely hard. Kids are unfortunately addicted to sweet.\nFor reference I had vanilla lavender and coconut and she had peanut butter and jelly flavor.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Over the Moon is amazing! We stopped by Over the Moon twice while staying at a nearby hotel. The ice cream was so creamy and the flavors were creative. I tried pistachio, whiskey praline, and snickerdoodle. Delicious!", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Delicious, creamy ice cream! Tried the earl grey, cookies and cream, and caramel flavors. I don't think you can go wrong here regardless of what you order! The ice cream is so rich that even a single scoop is almost too much but that shouldn't deter you from heading over to Over the Moon on a hot day!", "author": "Sol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "visiting from LA & on our last night we wanted have some ice cream while we enjoyed the beautiful city of SF. Well this this spot is the perfect gem! I had cookies & cream with a chocolate chip cookie & my fiancée had coffee caramel. The chocolate chip cookies are fresh out the oven. it's a perfect combination with the ice cream. And before you pick out the flavor the server is not greedy about letting you try the different flavors.", "author": "Wendy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "The cookies here are so good! Not too sweet but they're thick and soft and chewy. So dangerously good.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Great flavors, happy service, great tasting ice cream!  Casual happy place! Good service", "author": "K T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "Flavor quality very inconsistent and mostly subpar. Most of the flavors I tried tasted like much of anything and were way too soft. I could barely taste any raspberry in the raspberry Oreo and couldn't taste any amaretto in the cheery amaretto. The drumstick tasted like it was made from spoiled milk. Nutella banana and whiskey praline were okay. Caramel cookie dough would have been decent if it were more frozen. \n\nThe girl who helped me was super nice. Otherwise this place is a joke.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Incredible ice cream sandwiches, yum yum! Docked a star because it's not personally my favorite type of ice cream - it was a tad on the creamy side. But the cookie was good and the standard ice cream flavors were pretty good too (I erred on the side of caution whenever I see flavors like honey lavender...)", "author": "Judy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "So often I see people say they have homemade ice cream. When I came here I actually felt like I was eating homemade ice cream in the best way possible.\n\nOver the Moon lacks pretentiousness, and offers incredibly thoughtful flavors, great quality, and the price is right.\n\nSo glad to have found it!", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-13", "description": "The staffer we dealt with was fantastic; very patient in letting us taste several different ice creams before making our selection.  I love that you can custom make cookie ice cream sandwiches.  The ice creams themselves were just OK - I would have preferred the flavors to be bolder (i.e., ginger ice cream doesn't really have much of a ginger flavor (try adding candies ginger nibs), the honey lavender also could use a stronger infusion of both lavender and honey).  I ended up going with the Earl Grey because it was the most flavorful.  Overall, a good stop on your culinary and shopping adventures on Chestnut.", "author": "Donna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Best. Ice. Cream!! Try the Funfetti - it's a birthday party in your mouth. Seriously the most legit take on bday cake/cake batter ice cream out there. My mouth waters just thinking about it...\n\nOther great flavors: Andes mint, coffee, etc. really you can't go wrong.\n\nNom nom nom. Over the MOOn!", "author": "Magda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "We just visited Over the Moon again and they have cookie bowls!  How delicious!  I prefer the ratio of ice cream to cookie with the cookie bowl than an ice cream sandwich.  What a fantastic idea!  Our whole family (from 2-60) loves their ice cream and cookies (bowls or sandwiches).  When we finished our ice cream my two year old (almost 3) said \"that was yummy ice cream!\" We will definitely be back for more next time we are in the city.", "author": "Jill B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Amazing! Generous scoops, super yummy waffle cones.  Great price for what you get! Loved it!", "author": "Lori T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "I love the cookies and ice cream here \nWhat I don't like is the extremely rude, arrogant, smug, entitled, owner or manager (short chubby, big nose male). Almost every time I visit over the moon the manager/owner is being a complete jerk to his employees or deliver couriers. I've seen the staff here change 4 times with in 1 year, no employee seems to last a more than a month or two here every time I come to over the moon it's a new employee with the same mean rude manager/owner breathing down the employees neck micro managing everything the employee does correcting their every mistake not giving them a opportunity to learn. I live in the marina and my kids love the ice cream here however I will not return and I will tell all my friends and neighbors how unprofessional the owner is and how unfairly he treats his employees. I for one do not want to support his behavior or his business and I know my neighbors won't either", "author": "yoo s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "I thought this place was great. The cookie was amazing and the ice cream was good. I would go back", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "You can choose 2 different cookies to make the base of the ice cream sandwich! I would stay away from the oreo cookie because it was so hard, but the chocolate chip was amazing! They have a bunch of flavors including green tea and earl grey! You'll definitely find a cookie and ice cream you love! The person making the sandwich is really nice too even though he is the only person working the cashier AND making the sandwiches with a LONG ASS LINE. Props to the hard worker and leave a nice tip! =)", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "I went there yesterday with my 3 kids and a large group of friends.  Total 4 adults and 8 kids.  I think any treats / desserts shop see a large group like us will be ecstatic to have the business.  Oh....not his place!  \nEach of us got a single scoop and some of the kids had toppings with it.  We gladly paid for our ice cream @ $3.50 per scoop and $0.50 per each topping.  Most ice cream shop I've been to in SF will make sure to present a hefty scoop so that their customers can fully enjoy the creation.  The scoop we received was sloppy and slimy.  The toppings were so stingily spread, I can actually count the sprinkles on my daughter's scoop.  I ordered a scoop of the butterscotch, there was no butterscotch flavor at all.  It was all sugar.  It was so sweet, it made me thirsty.  After quarter way through, I couldn't take it anymore.  It was tossed in the garbage.  I don't think I've ever done that with ice cream!\nWhat also made it worst is the service at this place.  The Asian girl at the ice cream bar had a total attitude.  She rolled her eyes when she was taking our order.  The kids in our group were all 6-10 yrs old.  There was no whining or crying on the floor like toddlers do.  We might of been a little loud since we are such a big group in a tight space.  It still does not give her any excuse to have such displeased behavior.  This is not a place any of us will visit again.", "author": "Patricia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Oooooh mouth is watering a day later over the caramel cookie dough ice cream and funfetti!! I thought the funfetti was going to be boring - just vanilla but with colorful sprinkles. I was WRONG! It was so good!! I can't explain what the extra flavor was but it wasn't just vanilla with sprinkles - or at least if it was, it didn't taste like it. The guy behind the ice cream was really kind and gave us endless tastes, which my friends and I really appreciated :D", "author": "Mio W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "This ice cream is OVER THE MOON!\nThe Carmel chocolate chip cookie dough is the best ice cream I have ever had. Seriously!\nThe only reason this is not a 5 star rating is because of the atmosphere in the shop. It's just a little too narrow/crowded, and not a place I want to sit and enjoy my ice cream at..", "author": "Louise S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-06", "description": "Aiiiight.\n\nFound the ice cream to be on the icier side. I tried 3-4 flavors and didn't really like it enough to commit. Bf got mint chocolate chip oreo ice cream sandwich. He said his was good.\n\nCookies aren't homemade.", "author": "Shereen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-13", "description": "Pretty good but too rich - fatty mouthfeel and a little too sweet", "author": "Josie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Classic style ice cream with strong flavors.  Competitive pricing and excellent location.\n\nI'd highly recommend the:\n-  Oreo Cream\n-  Honey Lavender \n-  Snickerdoodle\n\nProtip:  For $4 you can get an ice cream sandwich with your choice of cookie.  The cookies are soft and pliable, not crunchy.  Really glad I opted for this choice.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "After eating at Blackwood, we've decided to go next door for some ice cream.\n\nI've only tried the frozen banana and the drumstick ice cream.. I loved both flavors and that's what I got, 1 scoop of each on waffle cone. Just thinking about it makes me miss it as I'm leaving SF. I'll definitely have to return to this place if I'm ever back in this area, it is that good! I really enjoyed the drumstick flavor as it had tiny pieces of sugar cone?  It had chewy texture that I liked and the flavor was perfect! \n\nMy brother and his girlfriend opted for the cookie monster ice cream with cookies (ice cream cookie sandwich), they said the flavor of ice cream was good but the cookie was bit too sweet.\n\nWe found a parking structure down the street, it was only 2 min walk. It's also in an area with shops along the street, so you can do some shopping. =)", "author": "Jasmine V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "This place is super yummy! My favorite flavor is the Earl Grey or the Honey Lavender. The only reason it is not five stars is because the tables in the sitting area are sometimes left uncleaned, covered in melting ice cream. Other than that this place rocks!", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-11", "description": "We stopped by and it wasn't the best ice cream I've had but it wasn't too bad either!  I ordered mine with a cookies and cream cookie and probably could've done without it, didn't have too much flavor.  One of the girls helping us was very nice but the other seemed annoyed that we asked to sample.  Overall not a terrible experience but not sure if I would go back", "author": "Yarah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "Earl grey ice cream had an interesting savory/sea salt flavor that I couldn't really appreciate. The ice cream texture was also very creamy and quite dense. Different flavors had inconsistent textures. The Nutella Party flavor was much more solid, but the Earl Grey was much softer. There wasn't really any flavor that screamed out to me, although the Honey Lavender was interesting and different.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Love, love, LOVE this place!! Where else in SF can you get a made-to-order ice cream sandwich with freshly baked cookies?! And in the posh Marina district, no less. They have quite the cookie selection: chocolate chip, chocolate chip w/ Oatmeal, Orea, cookies & cream, snickerdoodle, peanut butter and oatmeal w/ raisins. They have around 20 ice cream flavors. I tried the earl grey, the lavender honey and the coffee with toffee crunch. The girl that served us was super nice and very sweet, even though we asked to try so many flavors. This place is dangerous to my waistline, but oh so worth it!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "5 stars for the one on the Embarcadero, zero for this location purely because of the service. Decent ice cream if you get what you ordered, which is never. And don't pay for a topping because it's barely visible.", "author": "Nancy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Pretzel, peanut butter, cookie dough ice cream is great! 2-3 minute line max on busy Sunday afternoon. Nothing greater!", "author": "Erik O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "Can't say enough about this ice cream shop. They have some of the creamiest, tastiest gelato I've had since I moved to SF. After I found this place, I went there 2 more times in the same week... That's how good it is. The workers here are also incredibly nice and almost encourage you to try every flavor, which I recommend doing!", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Really great ice cream! Came down from SoCal to try it with friends and love their ice cream sandwiches. The ice cream is pretty dense and you can easily share the sandwich with a friend", "author": "Ray T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "We got a small cup of salted butter scotch ice cream with a chocolate chip cookie on top. \n\nHeavenly, delicious, ecstasy-inducing\n\nThe girl behind the counter was nice and accommodating as we sampled different flavors", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "My S.O. and I really enjoyed this place. Nice selection of traditional and nontraditional ice cream flavors, plus frozen yogurt. \n\nThe girl working was friendly, but did not offer any toppings or samples. She did give us a fresh chocolate chip cookie instead of the ones already out, so that was a plus. I had the mint chocolate chip ice cream and thoroughly enjoyed it.\n\nSolid choice for ice cream and cookies in the Marina.", "author": "Lyndsey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "I came here with friends after biking across the Golden Gate as we all wanted to treat ourselves for a good day of biking with some ice cream in the rain. This was my first time trying Over the Moon and I think I would definitely come back again.\n\nThough I was really tempted to get the Oreo cookie sandwich, I ended up just keeping it simple with a scoop of the cookies n cream. I love it when the cookies are soft and chewy and that's exactly how this cookies n cream ice cream was. For $3.50, it might be on the pricier side but I was expecting this so no real complaints. Next time, I think I'll try the Oreo swirl which looked unique!", "author": "Manosai E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "From the outside its an adorable little ice cream shop. But the inside is as warm and inviting as the people who work there. \n\nLet's just say that I am an indecisive person. And when it comes to ice cream flavors I'm basically hopeless. But I have to give a serious shout out to the woman who helped me pick my ice cream flavors when I felt like I literally had to try them all. This review is mostly for her because she was just the sweetest thing and she never made me feel like I was being unnecessary. She even went as far to help me with my cookie choice as well after spending like 15 minutes on the ice cream. So yeah she's the real mvp. \n\nOh right yeah and their ice cream and cookies are simply amazing too.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "Ice cream too on the wet side. Ice cream should be hard and creamy, not soupy and creamy. I had the oreo cookie and the flavor was good, it was just more like gelato than anything. Tasted other flavors like funfetti, salted butterscotch and drumstick and they were all soft, so not just a bad batch. \n\nI also agree with others that prices are a little steep here. $3.50/small scoop but you can easily find other ice cream shops that are better and more worth the money (and line!)", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "The ice cream was creamy and thick. It came in delicious crunchy cookies as well! The flavors were delicious and sweet. They have no bathrooms. The shop was clean and fresh! The service was great! I'd come here again any day!", "author": "Connor B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-16", "description": "Ice cream with the options to put it inside a cookie. The honey lavender is a unique flavor for sure but I'm still a mint chocolate and cookies and cream kind of person.\n\nI can't really compare this with Diddy Reese in Los Angeles so let's just leave it at that.", "author": "Julia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Not the best I've had but, pretty good.  I had the honey lavender and that was fantastic.  I sampled the earl grey ice cream and thought that was good.  The caramel coffee crunch was only okay in my opinion.", "author": "Bellatrix C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "I got the Nutella Banana flavor in a cookie cup and it was literally one of the best things that I have ever had. That ice cream was amazing and to top it off it was in a chocolate chip cookie cup which was crispy around the edges and soft in the  middle. It really reminds me of the cookies that I used to bake at home from the grocery store which I might add are pretty awesome. I wish I could've tried their other cookies by it self because they looked so good! Highly recommend this place.", "author": "Song V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Over the Moon has such a smooth texture to the ice cream. They have a large variety of flavors to choose from and they have cookies! You can make an ice cream sandwich with the cookies, or simply just add one on top of your cone.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Tried about 5 flavors and loved them all! Funfetti was surprisingly amazing! I typically like cookies and cream but the Oreo swirl took cookies and cream to another level-wow! And the Cookies and cream cookie was perfection. Favorite ice cream shop in SF so far!", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Because ice cream really can't get any tastier.. It's creamy, it's fresh, the flavors are unique and tasty. A must eat, must love ice cream", "author": "Sridevi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Best ice cream in SF. So creamy and goid. Love all of the flavors. We come and buy 4 pints to go every time.", "author": "Ari F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-11", "description": "Stumbled upon this place as it was the only ice cream place open at a late hour (10pm) in this area. I sampled the earl grey, honey lavender, and cookie-something-or-other.\n\nI chose the earl grey because it wasn't as sweet as the other two and it REALLY tasted like earl grey tea.\n\nThey give you plenty of ice cream in the cups and the price is reasonable. I noticed that they used real earl grey tea leaves in the ice cream as the ice cream was really grainy and infused with tea leaves. \n\nThe place itself is a little unorganized and you don't know where the line starts. Luckily there weren't too many people at this late hour.\n\nOverall I think this is my favorite earl grey ice cream in the area, but I didn't enjoy the other flavors as much. My date didn't like his samples (that I didn't try) enough to order his own scoop.", "author": "Martina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "I'm a sucker for ice cream sandwiches, so I was pretty excited to stumble into Over the Moon on a sunny afternoon in the Marina.\n\nI wasn't very hungry, so I asked if I could do a half sandwich (a la CREAM), which they said they couldn't accommodate, so I instead went for one cookie and a scoop of ice cream, which was alright but slightly disappointing because 1) for some reason the staff refused to sandwich the ice cream between the two cookie halves, and 2) my cookie wasn't warm. If you're not hungry, I'd definitely recommend trying to split the sandwich with someone else as the cookie + scoop of ice cream was literally only cents cheaper than what the whole sandwich would have been. To Over the Moon's credit, though, the ice cream was tasty and old-fashioned -- I had the coffee crunch, which went well with the chocolate chip cookie.\n\nI'd come back for regular ice cream if I'm already in the area, but otherwise, the Bay Area has better ice cream and ice cream sandwich options.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "My favorite place to buy ice cream!\n\nI love this place for so many reasons: perfect location, friendly staff, clean store. Most importantly, they have an amazing variety of flavors!! My personal favorite is funfetti-- yum! If you can't choose, they let you try a reasonable amount of flavors for free. Definitely would recommend!", "author": "Barbara P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Replaced the Yogorino shop (even same Ice Cream freezer) but with much more reasonable prices. They can even make a custom ice cream sandwich for you since they have cookies too!\n\nCheck 'em out!", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "This is probably one of the best ice cream place I've ever been to. There were a huge variety of flavors, along with little tester spoons to try out as many as you'd like. The flavors were very interesting and rich. The service was great, the woman was very patient with me trying out pretty much every single flavor. She was quite attentive and was quick to get my order. I ordered the \"lemon cookie\" which I do not regret! My friend ordered a shake of \"salted butterscotch\" which was basically the ice cream melted down into this creamy substance, and it tasted absolutely amazing. I gotta give this to them. Definitely come here if you're looking for diverse and flavorful ice cream, and good service.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-01", "description": "Sure they offer ice cream sandwiches so that's great, but they are very disappointing. The ice cream was melted before it was served. It was textureless and flavorless. How does chocolate not even taste like chocolate? The cookies are not good cookies for their ice cream holding purposes. They were burnt and too hard and thick. The seating area was basically a storage place for all the business's stuff. I.e. old ice cream machines and mops.", "author": "Erin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "They constantly have the best service and they have some great ice cream flavors. If you're walking down Chestnut and looking for a tasty treat, you should definitely stop by this place. Their cookie monster ice cream has officially become my favorite flavor!", "author": "Hana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-19", "description": "Ice Cream was amazing. Loved the drumstick flavor. \n\nOnly problem was the person working there. She was a heavy set woman with red hair. She seemed like she was overwhelmed but because of that she was being extremely rude to the customers. It was my first experience so I didn't know how the things were run there. She was belittling me for not being prepared to answer the ordering questions because she was overwhelmed/stressed\n\nLove the place hate the service.", "author": "Ernest O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "Make your own ice cream sandwich?? I'm there! Had a great selection of ice cream flavors to choose from. Decided to order a couple ice cream sandwiches to split with friends and was happy with the selection of cookies. Although you'll notice that some cookies are bigger than others so made me feel I should get the biggest cookie to get my money's worth.\n\nDelicious and fun sweet treats :)", "author": "Kim-Anh P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Their ice cream is amazing, specially the strawberry flavor. So creamy, but yet light, and the perfect flavor! Their other flavors are great too, like mint chocolate chip. I am a regular customer now :)", "author": "Abhimanyu Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "The guy working here is super friendly. He is the definition of excellent customer service. I tried an ice cream sandwich. It was so rich and decedent!!!", "author": "Hayden C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "This place is in the heart of the marina. I had my first cookie-ice cream sandwich there\nThe ice cream was delicious and the cookies super fresh. I will go there again soon!", "author": "Romain D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Amazing ice cream and cookie. I had the butterscotch and coffee ice cream with a snicker doodle.", "author": "Jude A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "Super friendly staff and lots of options - just didn't find the ice cream all that flavorful. I had the coconut and the mint chip in a cup and it was simply fine.", "author": "Laurie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Ice cream is amazing!! It's so good and fresh! \nThe girl who works there Maddie is the sweetest girl ever! I was in there the other day and she was super helpful and lovely!", "author": "Meagan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "This is my go-to ice cream place whenever I am in the Marina area. The ice cream here is great with a variety of normal & unique flavors from Vanilla Bean and Cookies&Cream to Nutella Banana and Cookie Monster. My favorite here is the Cookie Monster which is blue coloring vanilla and cookies, hence the Cookie Monster from Sesame Street. But the ice cream is rich & so delicious! Definitely recommend this spot when you're in the area", "author": "Trina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Enjoy a rare day in the quaint village of San Francisco in the Marina area I was waiting for a meeting. Seeing the normal Marina \"girls\" and \"guys\" that having been roaming around for the years I have been out there but somehow they always remain about 28 as their next step is probably Marin as they get married and have kids and they get recycled for the next crew coming in for the $ and the bleach in their hair.\n\nOK. So now for the ice cream. I am a world expert in coconut ice cream. From my days in the big city known as New York, I would run to HoJos as that was the only coconut option during those days. This place crushes that with the flavor and quality. Truly exceptional across the board and though not the biggest portion or cheapest but all I can say is OMFG this is great stuff. I can't speak to the other flavors but why would I.", "author": "Rickey B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-12", "description": "The idea of this place and its novelty ice cream flavors is ambitious, but poorly executed. The ice cream is way too sweet and concentrated. It's more sugary than rich/creamy. Originally I ordered the second smallest size, but then I noticed the server gave me the smallest size anyway. At first I was annoyed, but upon biting into the ice cream I realized the server was doing me a favor. The ice cream is way too sweet to finish anything other than the smallest size. Nice try, but not for me. After one serving, I feel like I have to have my blood sugar checked for diabetes.", "author": "Sanaz O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "It's a darn good thing that I rarely get to visit The Marina because Over the Moon would be my favorite treat! Their salted butterscotch ice cream is smooth and perfectly balanced between being not too sweet and also slightly salted, this flavor between two of their chocolate chip cookies is the perfect dessert. The cookies are a bit crisp on the outside and chewy on the inside -- yum! I also give 5 stars to the very friendly and super helpful young lady behind the counter who described their various flavors and combinations! I'm sorry I didn't ask her name, she was wonderful!", "author": "Melanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Unbelievably delicious ice cream and soft batch cookies! This review is a few weeks overdue but on the night of mine and my boyfriends anniversary we weren't feeling the dessert list at the restaurant we are at so decided to uber to Over the Moon. The minute we walked up we realized it was 5 minutes after closing and were so sad as we approached the door. The man inside said \"come in, I'll take care of you.\" This literally made my day...yes, I have an ice cream problem! Haha. I'm soooo glad he did this because I had the most delicious honey lavender ice cream and oatmeal raisin cookie to cap off a fantastic night! HUGE thank you to the gentleman who was working on September 4. You're AWESOME! :)", "author": "Audrey R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-19", "description": "After hanging out in Golden Gate Park and then Chrissy Fields with my husband and our bulldog we were all needing something to grub on. Since we had our fur baby we decided on ice cream.\n\nI quickly goggled ice cream even if I really had a taste for Fentons ice cream. I settled on Over the Moon since they were close and we wanted to be able to share with our furbaby. \n\nAfter finding a park - we walked down to the shop and immediately I noticed a small ice shop that had a small town look and feel. The service was good - friendly. I tasted the lavender / honey which was okay and then the vanilla bean which was again okay. I settled on snickerdoodle cookies which are my favorites with vanilla bean ice cream. I then went outside to watch my furbaby and my husband picked his selection. \n\nWe sat in front of the shop and enjoyed the treats we selected. My bulldog loved the vanilla bean but he loves ice cream because he only gets 2 spoons worth as a treat occasionally.\n\nMy experience is this a \"Cream\" like place with a SF vibe to it. While they were inexpensive the portions were definitely very small compared to Cream. Was it very good? I was left with a feeling, \" Not terrible and not impressive\". The real question is- Will I brave trying to get a parking spot the next time we are out in SF with our bulldog and have a taste for ice cream and the answer is DEFINITELY NO.  \n\nThe ice cream was okay, service good, portion size small = I wont be back.", "author": "Chryl R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Good ice cream at a reasonable price, though I wish the cookies were bigger and crispier. Those who like soft cookies will find them here. There's limited seating inside and outside of the store.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "I got the honey lavender flavor which tastes like a very creamy and mild honey ice cream with bits of dried lavender. It wasn't too sweet for me and it melted really fast on a warm day. Nothing special. I recommend taste testing the different flavors since they offer that.", "author": "Yuki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Heaven.  Stopped by for an ice cream sandwich and it may have been the best decision of my life. I'm not kidding. I can't wait to come back in October.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "My niece was being sneaky, but she's eleven and adorable and savvy and observant and generally way too perfect for someone who's only been around since 2003.\n\nI was sad that Sweetdish closed, but it's not like I spend much time in the Marina, so maybe it deserved to die?  Sweetdish had ice cream as well.  It was either Mitchell's or Three Twins, but I'll venture to say that Over the Moon's ice cream is better than not-on-San Jose Avenue Mitchell's ice cream.  Because storing and transporting ice cream changes it, somehow.  Or It's-Its.  Whatever.\n\nGood prices, surprisingly.  They're totally wasting all the space they have, but I'm no interior designer, so I don't have any suggestions.\n\nYelp helped me with this one, so I guess I'm giving credit to my stranger-buddies.  Thanks, stranger-buddies!  They so lovingly replace the doggy water, too.  Who knew?", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "I'm often on Chestnut  for banking and was so happy to see this adorable new shop. Stopped in and got the very creamy coffee caramel crunch and will be back  to try more. The small was the right portion size to feel like I was getting a treat without guilt. Took home a choc chip cookie for next day- equally as yummy and the right size. \n\nNoticed a nice spot to sit in the back  as well as by the window, with cool retro photos of people eating ice cream. Very clever design. Apparently they are getting a freezer for ready made ice cream sandwiches etc. May make double parking worthwhile.", "author": "Joan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Really amazing ice cream!  Absolutely delicious! I got the cookies and cream ice cream and Cookie Monster with the Oreo chocolate chip cookie and regular chocolate chip cookie! The chocolate chip cookie was literally one of the best chocolate chip cookie I had in my life! Can't wait to come back! :)", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-07", "description": "2.5 stars\n\nWe were in the neighborhood and decided to stop by this place after lunch. We sampled several favors, including our usual favorite honey lavender. However, we were quickly disappointed by these samples to the point we considered not getting anything. Eventually we settled on the Oreo coffee and the Nutella banana. \n\nThe real problem with all the flavors was they were poorly blended together - the honey lavender was overwhelmed by honey with barely a trace of lavender, the Oreo coffee was all Oreo and no coffee, and the Nutella banana tasted strongly of banana with only a weak taste of Nutella bits mixed in. Also, the banana ice cream left an undesirable aftertaste.\n\nThe service was friendly but overall we would not come back.", "author": "Justin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-18", "description": "Not worth the hype and long line. I was able to try as many flavors as I wanted but the ice cream wasn't creamy enough for me. I only ordered because I felt bad I asked for so many samples.", "author": "Fernilla S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-01", "description": "Pretty good! Whiskey praline and cookies and cream cookie were winning combination and service was kind. It's not anything I would go out of my way for and I wouldn't wait in line more than 5 min but the location is great for post-brunch dessert in the area.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Oreo swirl-- my new favorite ice cream flavor! Great service. Awesome flavors.  My daughters tried vanilla & strawberry cones.  Best ice cream so far on our trip!", "author": "Miss L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Delicious! This is a busy spot, but worth the wait. I got the lavender honey flavor. So good, and it had proved of lavender in it. Yum!", "author": "Therese M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Pretty sure that if love was an ice cream flavor, it would be honey lavender.\n\nAnd if you want to remember your childhood, try their peanut butter & jelly ice cream; it tastes so much like a PB&J sandwich you'll swear you just had lunch while sitting on the grass with your friends.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-30", "description": "I tried the Earl Grey Ice Cream and I really wanted to love it but it was definitely lacking flavor... Very slight hint of earl grey and not enough... The sample spoon of earl grey tasted best sadly and went down hill from there... The guy behind the counter was really friendly and nice though...", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Best Ice Cream Sandwiches in town, hands down. The staff is awesome and friendly which adds to the experience of enjoying the treats.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-01", "description": "I order from them a lot, usually they are very good. This review is just about my most recent order. Tonight I placed an order, and half of the ice cream wasn't delivered. I called and was informed that I'd get a refund but they were out of my flavor. That's great, but what I wanted was ice cream. Most places would call and give me the option of ordering a different flavor instead of just wordlessly refunding me and leaving me with no ice cream.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "First time at Over the Moon yesterday! Simple menu and very delicious ice cream. I had a scoop of the cookies and cream, so rich and fresh. Will definitely come back for an ice cream cookie sandwich!", "author": "Allison D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "One of the BEST ICE CREAM I've EVER HAD. \n\nIt's a good balance between ice cream being down-to-earth and innovative/high quality. \n\nTheir cookies aren't necessarily mindblowing, but their ice creams are AMAZING. I can taste the density of quality ingredients so well made together into an ice cream that it's almost chewy! \n\nI had one scoop of honey lavender and couldn't resist getting another scoop of coconut. OMG. SO good. creative but not crazy! \n\nWill be back for sure.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "If you haven't tried funfetti you haven't lived. Truly melts in your mouth AND you can buy it by the pint. If I could eat it every night and not get fat I would.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "Review is only for the honey lavender. \n\nI tasted it and liked the light taste of honey and hint of lavender. I got a small scoop in a sugar cone and it wasn't until I really started on my ice cream that I realized there were bits of lavender in the ice cream itself. This could be a pro or a con depending on how you feel about little bits of lavender in your ice cream.\n\nI am unfortunately not a fan of the bits of lavender and felt that it was too overwhelming. Maybe that was my mistake but when I tasted the ice cream, I didn't get a chunk with the lavender. I do think that if I had tried it with a piece of lavender I would have went with a different flavor.\n\nOverall, I still enjoyed my ice cream for the most part. The service was nice and the girls that worked tonight were friendly!", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Their ice cream is delicious, and their yogurt is the same as Yogorino, which was there before! :) I loved that yogurt so much, and I'm so glad that they are still serving it in the mean time. The service is friendly, prompt, and efficient, and as an added bonus, it ALWAYS smells like fresh baked cookies in here! \n\nI would highly recommend trying the coffee toffee crunch, and peanut butter and jelly flavors of ice cream.  Their frozen yogurt is also great if you like tart yogurt.", "author": "Jennifer Hom C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-06", "description": "Cheap tasty desserts. The cookies and cream cookie was  just Ok i would stick with the basic chocolate chip .. but overall can't go wrong with any ice cream and cookie combo", "author": "Steven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Really delicious ice cream sandwiches for only $4! The ice cream is creamy and rich. The cookies are a bit sweet, but they're soft and very good.\n\nPlus, they accept bitcoin :)", "author": "Phillip K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "After trying Over the Moon twice for its cookie sandwiches a few months ago, I vowed never to return. The cookies were too small, and the sandwich left something to be desired. Every time I saw hordes of people gathered inside, I scoffed at their bad taste in ice cream sandwiches. But maybe all this time, I was the wrong one.. \n\nAfter skimming over some more recent reviews, I decided to give them another shot-this time for the ice cream. And WOW, have I been missing out.\n\nWe tried three flavors: honey lavender, pb&j, and peanut butter chocolate. All three were extremely rich and creamy. Exactly how I want my ice cream. I must say I'm not a HUGE \"normal\" ice cream person (I'm no fan of bi rite for example), but this so called \"normal\" ice cream was amazing. \n\nI think I just found my new neighborhood dessert spot. And if you, like myself, also gave it a bad rep because of its mediocre ice cream sandwiches a few months ago, give them another try.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Great ice cream with a good variety of flavors to choose from. Came here after getting some dinner at pacific catch right around the corner. It is a small place with some seating inside. The service was great, the cashier let me sample a good amount of the ice creams without complaint. I ended up going with the Madagascar vanilla bean, it is phenomenal! Great rich ice cream that was exactly was I was craving flavor wise. My GF got the Cookie Monster which she loved as well, I recommend this spot for desert if you are in the marina!", "author": "Josue V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Had an excellent experience at Over the Moon!\n\nPluses:\n- Everything is homemade in the shop, the ice cream AND the cookies\n- Variety in cookies and ice cream\n- Free samples of ice cream so you can be sure you like what you got (just ask)\n- Great customer service, the guy who helped us out was really friendly and patient with us\n- They have a non-dairy, non-fat frozen yogurt option\n- They have togo options of ice cream and icecream sammies that you can take home to enjoy\n\nMinuses:\n- Parking in the Marina is expensive, but you can just skip out on the drive\n\nIf we're ever in the Marina, it'll be hard to say no to another snickerdoodle/coffee ice cream sandwich!", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "While chatting with my wife in this tiny takeout ice cream parlor about what to get, she happened to point out the fresh-made cookies--which my nose had already scouted beforehand--when another customer said, \"their cookies are delicious.\" Followed up by, \"the ice cream is great too.\"\n\nYou know a place is good when people are happy to brag about it unsolicited.\n\nSeeing that they had a vanilla bean ice cream, warm chocolate chip cookies, and a custom ice cream sandwich menu item to combine the two sold me. Thankfully, it was served in a wide cup with a spoon, because the ice cream portion was too generous for me to get through it just as a sandwich in my hands.\n\nThe cookies were indeed delicious and the ice cream dense and rich. I had no room for this dessert after the lunch I just consumed down the street, but that didn't stop me from devouring my treat. I will be back--after a bit of guilt-induced exercising.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "Their chocolate chip cookies for their ice cream sandwiches are AMAZING!!! \nToo bad they don't have more dairy free options", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Still decent ice cream. Got screwed by PayPal (again), system down and found out too late to walk out.\n\nAlmost had to wash dishes until someone found cash. Damn you pay\"pal\"!!", "author": "T J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "Great ice cream, but not a great place to enjoy your ice cream.\n\nOver the Moon truly has ice cream that is out of this world. The cow lept out from Cow Hollow (OMG I just figured out this place's name) and it's leftover milk spewed and became a delicious mix of snickerdoodle and chocolate ice cream that settled in this tiny shop.\n\nThe ice cream sandwiches are fully customizable - you choose the cookies and the types of ice cream. Nice! \n\nMy negative remarks have to do with the interior of the place. Unfortunately Over the Moon looks like it was left on the far side of the moon. It's a plainly-decorated, sterile interior like the hallway of an art studio. Cozy but in the wrong way, like when you're trapped under a stranger's armpit on the BART. \n\nThere were only two tables to sit in the back, and one shared bar table facing the street. Quite un-accommodating.\n\nNo bathrooms. So I spent the whole time considering whether to pee in my leftover ice cream cup.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Prime dip.\n\nGreat lunch sandwich: http://www.yelp.com/biz/prime-dip-gourmet-sandwiches-san-francisco-2?hrid=Max4NqOFg_U46_5ar-gOfQ\n\nGreat dessert sandwich: Homemade lowfat frozen yogurt paired with a homemade cookies 'n cream cookie. \n\nFormer was sweet with a hint of tartness. Latter was rich and full of flavor. Break apart the latter and dip into the former for something really great.\n\nStaff was friendly, enthusiastic and offered plenty of advice and samples. Really impressed with the variety and how everything is homemade.\n\nThis dessert is ready for prime time.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "I had a good experience here. It definitely hit the spot while Sara and I were walking from the palace of the fine arts.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "I came here for dessert on a warm evening with friends after having dinner at a nearby restaurant. \n\nOne of the best ice cream places in the neighborhood. Came in and was greeted with a smile. Was offered a sample of each flavor and went for it. Very delicious,  I must say. Ended up getting the minty mint for the night.  Checked in on Yelp and got free toppings. Yes, worth the while! They got tables inside, too, so you can hang out for a bit if you like.\n\nI'm coming for back for more ice cream and cookies.", "author": "Ellen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "The ice cream is ridiculously creamy. It literally melts in your mouth. Like eating a cloud. I had the lavender honey, and it is delicious. Highly recommend it!!!", "author": "Josué H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "Stopped by and tried the custom ice cream sandwich. 2 chocolate chip cookies + chocolate peanut butter ice cream = party in my mouth and everyone is invited! \n\nInsider tip: eat it quick before it makes a mess!!!", "author": "Travis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "So many unique flavors to choose from! I went with a scoop of the snickerdoodle in  a sugar cube. Generous scoop, fresh, crunchy cone, and the ice cream was so creamy and perfectly balanced with cinnamon. Great shop!", "author": "V P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "Swore I would take a picture or two for my next review, but I'd already demolished half my ice cream before I remembered...\n\nAnyway, halfway through riding the crimson wave and pathetically squealing \"chocolate\" from the couch all week, the bf finally acquiesced and found an ice cream shop right around the corner from us (true story). I was OVER THE MOON about his initiative so I, being the sugar mama I am (untrue story), paid $4.75 for both our treats. BALLIN'!\n\nYou can get as many samples as you like, so if you wanna annoy the people behind you, try all the flavors like the people in front of us did!\n\nI got one scoop of rocky road and one scoop of coffee caramel crunch on a cake cone and the bf got his usual mint chocolate chip on a waffle cone. SO YUM. Creamy, melt-in-your-mouth delicious, high quality ingredients, kind employees, clean store, bright lighting with seating in the back.\n\nDefinitely stop by if you're craving a sweet treat and are in the area!", "author": "Michele P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "The ice cream and the waffle bowl is very good, but I quickly regretted it. Not so much the ice cream, but the bowl. Instant food coma. I only had one scoop of coffee caramel crumble ice cream in a waffle bowl. I walked in very energetic, but after finishing the ice cream and bowl, I was drained of my energy. I would say go for the ice cream, but don't be a glutton and get the bowl too.", "author": "Stacy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-01", "description": "It is one of those hole in the wall great places to check out. It was my first time going here. I ordered two scoops of ice cream. One was chocolate mint and the other funfetti which were filled into a waffle cone. Very delicious both flavors. And the customer service was good. Only two factors that I did not approve was the very crowded/small seating area. And the limited selection on ice cream. Regardless of limited ice cream selection it was still made up with their other delicious flavors. Overall it checks out pretty ok.", "author": "Mariela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Ohhh hooo yeah.  The only thing I love more than pizza is ice cream.... and this place does ice cream very well.\n\nThe Ice cream is great on it's own but you can also get your ice cream sandwich on by adding some cookies.  The wife and I went on date night and I went with the snicker doodle ice cream with the chocolate chip cookies. It almost blew my taste buds right out of my mouth!!!\n\nBrian the owner is also one heck of a guy.", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Actually different and *good* ice cream in San Francisco! Personally I've not been wowed by the recent trendy ice cream spots (yes, I know, Bi-Rite is just uh-maiz-ing to you, but I think it's just okay, shoot me now). But between our little group we tried a nice sampling and the consistency and quality of the ice cream was some of the best I've had in the city.\n\nThe cookies & cream was outstanding, a flavor everyone tries, but Over the Moon actually crushed it. Thanks!\n\nOnly reason I can't give it 5 stars is price, which isn't outrageous, but definitely on the higher end of what ice cream could and should be.", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "I'm over the moon! \n\nHoney lavender, pistachio, lemon sorbet, coffee caramel crunch, and earl grey. \n\nI'm in love. : )\n\nCreamy, rich, delectable...\n\nLove and ice cream. Eat well. Good life.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "On vacation here in SF from Orange County and randomly yelped this place for dessert after sushi and it's AMAZING!! Ice cream cookie sandwiches with fresh, warm cookies and amazing creamy homemade ice cream! Also, the service is outstanding. The guy working here is the reason I'm writing this review, thanks for the hospitality Sam!!!  :)", "author": "Bridgette A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Great combination = earl grey and vanilla.\n\nCute place with an interesting selection of flavors!", "author": "Kira G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-21", "description": "Honey lavender was a bit too strong on lavender, wasn't great. Crunchy road was little too sweet. \nIt is nice that you can create a custom ice cream sandwich with your choice of ice cream flavor and cookies. But the small\ncup only let u get 1 scoop. \nThe flavors were not impressive but given the lack of ice cream options in the neighborhood, it is still a popular spot.", "author": "Nancy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-08", "description": "Ordered the peanut butter cookie sandwich with the pb&j ice cream. It was good but really  sweet!! Like you needed a cup of water with you after eating that ice cream sandwich. my cookie was not soft or moist and was hard and crunchy. overall I still like cream the best in Berkeley and walnut creek!! Nothing beats their ice cream sammies.", "author": "Jacqueline J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Cute name and very neat store. There are a few stools in the front so you can people watch as you are enjoying your frozen dessert. There are a few tables tucked in the back for larger groups. Ready made ice-cream sandwiches and ready packed ice cream is available in the freezers in the front.\n\nWe had decided to get 3 scoops and had chose honey lavender, crunchy road and banana. It was all under $5 which isn't bad. You can check-in and score a free topping. Each of the flavors were good, but not amazing. We also tried the oreo cookies which were all right... nothing beats Anthony's Cookies n Cream.\n\nMight return if I am in the area but will not go out of my way.", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "The honey lavender ice cream is absolutely incredible! So rich and flavorful while being the perfect fluffy texture. The mint chip is also great. One of my favorite ice cream spots in the marina.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "The cookies were perfect, chewy and a little crispy on the edges. \nThey Had cute little mini pies. \nWe will be back for sure!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "We happened to walk by and strolled in, because an ice cream sandwich sounded dang good! We tried the following flavors:\n\nHoney lavender - sweet, creamy, and more honey than lavender. Good.\nSalted butterscotch - sweet, salty, creamy. Good.\nFrozen banana - tasted like they stuck a chocolate-covered frozen banana into an ice cream machine. Quite good!\nCoffee toffee crunch - my favorite of the flavors I sampled. Delicious and creamy!\n\nWe ended up not getting sandwiches, but I'd definitely come back for the coffee toffee crunch again!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Parking is difficult but the ice cream was good and the price was reasonable! Their cookies are yummy too.", "author": "Andy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "Now this is the ice-cream that is worth the calories! I absolutely loved the lavender one, and my friend enjoyed their PB&J on the mini-apple pie! Parking is hard to find as always, but there's a Starbucks right next to it, so you can get coffee with your ice-cream :D", "author": "Anna P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "First-timer and came here with a friend; I found out about this place via a Facebook friend's post.  I sampled their whiskey praline and went for their ice cream sandwiches, using chocolate chip cookie and the whiskey praline ice cream.  Pretty inexpensive for house-made ice cream.  If you didn't want the sandwich, they also have other options like ice cream on cup or waffle cone , and 2 - 3 frozen yogurt options, for those who prefer yogurt.  Great place to chill esp. on a 2nd (in a row) warm San Francisco night.  For those who enjoy simple, more \"standard\" ice cream flavors with a just a bit of variety, this is your place to be.  \n\nThe place itself was comfortable and brightly lit; if you wanted to sit and enjoy your ice cream inside, there are some small tables towards the back of the shop.  OTM is also nicely located 2 store fronts over to restaurant that had a TV outside, for those of us casually enjoying our dessert outside and wanting to catch a sports game.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Super tasty ice cream that has a very homemade feel to it. Brian is a chill cat and dishes out the goods quite well. Not sure on the longevity of the store, but I think it is a good place to grab a snack on a chill afternoon or post dinner date stuff. I would come back for sure. Price is right there with any other ice cream place in SF.", "author": "Ezra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Great ice cream!!  I tried the peanut butter and it was delicious.  Big servings and good cones too!", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "Couldn't decide so I got one scoop of the ginger and one scoop of the lavender honey in a sugar cone! The lavender honey was my fave, really creamy without being overly rich.", "author": "Beckie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "The Best ice cream in SF. Rich creamy with interesting flavors. For all the European people, this is the place to go for ice cream when in SF.", "author": "Vladimir K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Awesome place! Delicious ice cream. Try the double fudge cookie. Or the chocolate chip. Mint chip is my favorite ice cream, but the coffee camel crunch was also really good.", "author": "Rich P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "Grabbed some ice cream here after eating at Dragon Well.  Really tasty flavors.  Got a scoop of the root beer float flavor and it tasted just like it!  Others in our party got cookie monster and really enjoyed that one too.  Would return here.", "author": "L S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "OMG. I love peanut butter and chocolate so I had the peanutbutter with chocolate chunks cookie ice cream sandwich with chocolate peanutbutter ice cream   $5.00. Hubby had snickerdoodles with choc mint ice cream. So for $10 we had a great honemade dessert very nicely done. Wish I took a pucture but it was too good it went fast !", "author": "Kristin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "I've sampled my fair share of ice cream throughout the years, but the flavors I tried at Over the Moon might be the best I've ever had. Cinnamon smores was amazing- like a churro and a smores cookie combined to make the most heavenly flavor that was both sweet and spicy from the cinnamon. I also had Oreo cookie, not to be confused with cookies n cream, which is ice cream made with the cookie part of the Oreo & swirled with the white creamy oreo frosting. The only thing I dislike about Oreos is the texture of the cookie and this completely solved my problem- plus it gave me a straight shot of the amazing Oreo frosting I love so much. My boyfriend had caramel cookie dough which he claims is his new favorite ice cream flavor. We also got to try one of their freshly baked snickerdoodles, which was perfectly soft on the inside with just a little crisp on the exterior. A perfect accompaniment to any ice cream experience! Don't miss this little place on Chestnut if you're looking for innovative flavors that are old school in creaminess and richness.", "author": "Stacey O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Spent the weekend showing family and friends visiting from Romania the City.... This was definitely a stop. Their name says it all, Over the Moon because their desserts are absolutely delicious!!  Love the variety in flavors and presentation ie cookie sandwhich, cups or cones, waffle cones, etc. \nIn a quaint neighborhood, can be difficult to find parking at times but so worth it. My fav is the waffle cone with oreo cookie ice cream. \nEnjoy!!!", "author": "Strovenyia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Awesome place. Try half ice cream 1/2 frozen yogurt milk shake. It's the best!", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "If you are nearby, you need to go in. You won't regret it. AT all. I sure didn't. Orange chip ice cream. Sweetness in my mouth.", "author": "Rebekah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Place is really small.  Across the street from the Ferry Building.  There's not too many flavors here but the ones I got is nice.  Ice cream is not too sweet.", "author": "Byron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "OMG- this was AMAZING. I loved my ice cream sandwich, I've been wanting to try this place for awhile and finally got a chance. I got the cookies and cream cookies and the oreo cream ice cream (NOT the cookies and cream ice cream) it was described to me as being similiar to the middle of an oreo and was SOOOO GOOD. The ice cream was super smooth and creamy and the cookies were fresh baked, dense and so yummy. Cannot say enough about this place, a must go for a sweet treat and try this combo if you love Oreo's/ cookies and cream :)", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Best ice cream on the block. But they need to update their hours on Yelp, now:\n\n12-10 Sunday to Thursday\n12-11 Fridays and Saturdays", "author": "Wyatt G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-27", "description": "I didn't like the ice cream or the cookie, ice cream not creamy and cookie tastes like grease.", "author": "Debora M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "Came here for dessert and ended up getting a ice cream sandwich.  I got the coffee caramel crunch ice cream and oatmeal raisin cookies.  The ice cream was definitely better than the cookies.  The cookies are probably made that morning or the night before, they aren't soft and right out of the oven like I'm used to with CREAM.  Good thing about this place is they give you the ice cream sandwich in a cup that way if it breaks while you're eating it you can still scoop it up with a spoon.", "author": "Joycelyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Creamy and yummy enough to compete with the BIG CONES in SF. Only open one week, still getting their rhythm down but the ice cream is perfect . The are friendly and neighborly too. When  the owner discovered that my favorite flavor was chocolate chip he went to the back room and pulled out a special pack of chocolate chip ice cream he was mixing up and asked my opinion. My partner, who has a very critical pallet, loved the ice cream as much as I did.\nWe are thrilled that Over the Moon has opened in the hood. We will return as the prices are reasonable for an excellent ice cream. Over the Moon gets a well deserved 5 stars from my partner and me.", "author": "Anna Spathis D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "The funfetti is so yummy!!! Great place to grab a cone and walk along chestnut with the family or take over to the park. Recommend it!", "author": "Z W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "I ordered a scoop of lemon sorbet and coffee caramel crunch on a waffle cone (~$4.50). The lemon sorbet was lemony! It tasted like a lemon square in ice cream form. Pretty dynamite -- until a couple more bites in and the sweetness became a tad overwhelming. The coffee caramel crunch was aiiiite. Can't complain. I can't say it's the best ice cream I ever ate... but it's not bad.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Place is amazing. Walked in randomly and left a huge fan. I had an ice cream sandwich when you can pick two different cookies and have whatever flavor of ice cream that you like.  The staff is super friendly and I would highly recommend this place", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "BEST ICE CREAM EVER!! Ginger ice cream w/ snicker doodle ice cream sandwich was a little piece of heaven. The staff couldn't have been nicer...we tasted a ton of samples. Last night in SF was made memorable by this amazing shop. My family also highly recommends the honey lavender, pb & j, and raspberry ice creams.", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-05", "description": "I was walking by and noticed the old Yogorino shop had been reopened. I went in to see what the new offerings are and was not greeted (sparsely occupied...2 other customers). When I finally got someone's attention to help me it felt as if I had inconvenienced him. I think he might be the manager or owner of the place...news flash you run an ice cream shop perk up a bit. I had to walk out of there, he had so much attitude and was extremely rude. He claimed the froyo recipe is precisely similar to the old Yogorino recipe, but it wasn't as good. The new recipe makes the froyo softer than how Yogorino made it.", "author": "Kiran J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "It wasnt very good. I had coconut and butterscotch and i had a really hard time finishing it. The coconut one tasted like whipping cream and sugar and it left a really greasy sugary coating in my mouth. The butterscotch tasted like molasses with the same sugary whipping cream after taste. \n\nThis isnt good ice cream no matter how you price it.", "author": "fernando z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "Just had the Oreo mint chocolate chip sandwich.  Awesome - 2 large Oreo cookies and a scoop of homemade mint chocolate chip ice cream.   ...and very reasonable price at 3.75", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "I was just killing time alone the blocks and everyone was out eating ice cream and I started craving. I saw a sign \"cookies and ice cream\" and decided to try it out because why not? I had this place bookmarked but had no idea until I came inside. It's a pretty small, cute place. Sitting by the window and way in the back. The ice cream flavors didn't  stand out to me much except for the Whiskey Praline. I gave it a try and sure enough, I got it (in a small). And I immediately gobbled that down. Right before dinner. The ice cream is not frozen like most, but on the creamy, soft side. I also got 2 cookies for $2 total! Cookies and cream and Snickerdoodles. The guy gave me the ones straight from the oven instead of the ones in the jar. They were very moist (plus!) and they weren't grainy or flaky or super hard like other cookies. 5$ for everything!! Very cheap, quality taste and texture. Definitely worth it.", "author": "Yvonne N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-03", "description": "The ice cream + cookie deserve 5 stars... really great.  The reason for 1 star, they served them in a styrofoam cup with a plastic spoon.  There are plenty of environmentally friendly options out there for food packaging.  I won't be going back until they make the change to something more responsible.", "author": "Greg F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "Hands down the best honey lavender icecream ever! Better than bi rite any day honey tastes real and non sugary and real bits of lavender. The owner is always making new ice cream flavours and offers us little samples to try and test it. Freshly baked cookies are an added bonus. My comfort treat place in sf.", "author": "Rujuta G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Tasty coffee crunch ice cream. The honey lavender great too. If I had had enough space to stomach 2 scoops that would have been my second one!", "author": "Allie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "Wow, for sure, legit homemade ice cream. You can really taste it in the creaminess. I loved my ice cream, but wish there was a bit more variety of flavors, especially unique, authentic flavors.", "author": "Meagan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-26", "description": "I absolutely love ice cream and trying new things. When I stumbled upon this place, I became super excited because there was a variety of flavors that were not available anywhere near such as honey lavender, earl grey , green tea, tropical praline and more! I got one scoop of earl Grey and the second scoop of honey lavender. It was okay and I got kind of mad because their scoop sizes are so small! I ordered a Oreo chocolate chip cookie to go along with it and for what I paid, it was not worth it and the cookie did not taste how I expected it to taste. I guess my expectations were too high. I like to go to the liquor store up the street on Fillmore and union where they sell Mitchell's ice cream for really cheap and really huge scoops.", "author": "Shan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-19", "description": "OMG, the salted butterscotch is absolutely AMAZING!!! Please don't judge me, but I had TWO waffle cones with this smooth, succulently creamy, handmade ice cream! YES!!!", "author": "M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "I wanted to post a pic of my tasty treat but it was so good I ate it before I had a chance. Whoops. This place is awesome. Warm cookies, great quality ice cream and super friendly staff. They gave me free sprinkles to \"brighten my day\".", "author": "Emily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "Small place with some epic ice cream flavors... They had me with their confetti cake flavor.....", "author": "Max O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "I got a cappuccino cookie, chocolate chip cookie, and salted butterscotch. No complaints. It was perfect and worth the $4!", "author": "Tomas P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-03", "description": "This place is gross they do not wash there hands after handling your money. I will never go back.", "author": "James L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-11", "description": "Food coloring, ice cream tastes artificial and way too sweet, country music, and U.S Flag cone wrappers.", "author": "Kitty F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "tasted: nutter butter banana, earl grey & honey lavender. Honey lavender stood out to me so I ordered one scoop in a cup. My daughter got the cookie monster with chocolate chip cookies. Omg..the first 5 bites of the honey lavender was super delicious...but after a while, I got so sick of it! It's really creamy and heavy. I couldn't finish it anymore, kinda ruined my appetite for sweets that whole day!  My daughter's combo was not that great because the cookie monster already has bites of cookies, plus the chocolate chip cookie made it too much cookies!  But the cookie was yummy.  I think I will stick with the frozen yogurts next time.....", "author": "Alyce l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "Clean, bright, friendly and fun spot!  Even the decor is fun--with a great spinning ice cream display case. The ice cream flavors were innovative, with new twists on old favorites--i.e. Bumpy Road instead of Rocky Road--as well as some great new combinations--my favorite was a Whisky Praline.  A stand out were the cute mini-pies individually wrapped.  The ones I tried were flaky, golden crust with a blueberry/blackberry filling that emphasized the fruit without being overly sweet.  They were great on their own, as well as a complement to the ice cream.  The store will warm up a pie for you to eat there with a scoop of ice cream.  The owner was there, as well as the pie chef, and they were both friendly and happy to be sharing their recipes.\n\nBoth the ice cream and the pies emphasize local ingredients and highlight farms and producers from around the Bay Area, so the ingredients are really fresh.\n\nI tried a bunch of ice cream flavors and in the end I bought 3 of the pies and took them home for a dinner party, along with a couple pints of ice cream.  The pies were delicious!  I'll definitely be back!", "author": "Kate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "Great ice cream and cookies, especially on a hot sunny day walking in the Marina District.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-18", "description": "Awesome ice cream. We are hardly ever down in the Marina but we would come back regularly just for this ice cream. The honey lavender is creamy and I want more just thinking about it. Mmmmm!!", "author": "Kelin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Best ice cream in SF. Milkshakes are ridiculous. Cookies too! Do yourself the favor and stop in bc you won't regret it!", "author": "Justin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-06", "description": "We dropped in the area to get some shoes for running but ended up having ice cream instead. Good quality ice cream, place to sit and eat and friendly staff. They were playing the movie 'Frozen' when I was there so that was fun :)", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "Very creamy ice cream with many different flavors. We ordered the cookie sandwich and the cookies were good as well. But I think I like their ice cream better and would probably just get ice cream next time. We had the pistachio and the drumstick.", "author": "Uerica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "mmmm, awwww, uhhhhhhh, yaaaaa. Sumptuous flavors, delightful service, mouth-watering ice cream, tingling ambiance, and intense emotions. How did I not find this place sooner?", "author": "Joe G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "Having read most of the outstanding reviews, I guess I set myself up for more than what should have been expected. \n\nI ordered an Ice cream cookie sandwich made of snicker doodle cookies and the vanilla bean ice cream. \n\n1) snicker doodle cookies were so hard and had way too much cinnamon. \n2) The ice cream was ok but the amount of cinnamon in the cookies was pretty much all I could taste.\n3) If your going to put my cookie sandwich in a cup at least put a decent amount of ice cream in the sandwich. (Should match the price!) \n\nI also ordered the whiskey praline and crunchy road both were good. \n\nOverall, service was good and the ice cream was alright-nothing to rave about.", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Best place for ice cream! They have amazing honey lavender ice cream that's to die for!", "author": "Jigesha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "Their ice cream is simply delicious. I had snicker doodle ice cream and it was amazing. So creamy and smooth but incredibly flavorful at the same time. My boyfriend has the strawberry ice cream and it was incredibly flesh and fruity. The price wasn't too bad and the girl behind the counter was very sweet.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "I'm kind of a purist. Vanilla chocolate strawberry.  When did lavender become more than a bath soap and take on ice cream.  Not my favorite. But none the less their ice cream is very smooth be creamy.  I just urge you to go with your gut. You know what ice cream flavors to order. Don't step out of your comfort zone on this one.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "This is the best ice cream I've ever had. The texture is ridiculously creamy and even when you bring a pint home the texture holds up for a whole week. My favorite by far is the Raspberry ice cream (not to be confused with the Raspberry sorbet). I can also vouch for the Blueberry and Cookies & Cream. The chocolate chip cookies are also to die for - they warm them up for you and they taste like heaven. There's even a little bit of salt on top. I'm obsessed.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "Try everything twice! This place is the best of both worlds, you not only get original old-fashioned ice cream but also, you guess it, warm, delicious home-made cookies. I've had this place so many times it's become my go-to ice cream shop. Not to mention the service is so great, everyone is always super nice. This shop reminds me of the Mid-West, not sure why.", "author": "Cindy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-09", "description": "I don't usually write yelp reviews, but I was very disappointed especially after reading such favorable reviews of this place that I decided to share my experience. My friends and I stumbled onto this place after dinner and went inside. It was busy and the server looked a bit overwhelmed. After 10 or so minutes, I finally got my ice cream. I chose Snickerdoodle and Pumpkin Spice Latte. I should note that the flavors were good (although a little sweet when compared to other places). The texture, however, was unappealing to say the least. When I began to eat it, the ice cream stuck to my spoon and fell back into the cup- it had a texture similar to glue or melted cheese that was both stringy and thick like caramel. This ruined any potential that the flavor had. I couldn't stomach more than two spoonfuls before throwing it away. I would likely not come back and waste another $5. I recommend Bi-Rite on Divisadero or Smitten in Hayes Valley for your next ice cream fix- the two are consistently excellent.", "author": "Dominic L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "Spontaneous decision to come in and I'm glad we came in.  Quick line.  The girl working was really nice and guided us on what to get, since we've never been there before.  Got the ice cream sandwich with fresh warm cookies.  Delicious!  I would come back, if I actually lived in SF.", "author": "Nina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "OMG can I just say YUM!!!!! The best coffee ice cream sandwich ever! I wish there is one closer to home! If you are in the marina please do yourself a favor and stop by this little ice cream shop!", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Warm, melty chocolate chip cookies with a big scoop of mint chip ice cream......amazing!  People were really great too.  Nice addition to the hood.", "author": "Eamonn T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "Walked in the other day to check it out, looked like a shitty version of Cream in Berkeley. The cookies didn't look that good and the decor/ambiance was subpar.", "author": "Olivia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Over the moon is scrumptious! Their funfetti ice cream is as good as it gets! Haven't tried many of their cookies but they look great and smell delicious. Love this little local spot!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "This place is awesome. Super friendly workers and tasty ice cream sammys make for a great spot in the marina, especially when it's so nice outside like it was today. The cookies are fresh baked and delicious, we tried the oreo, chocolate chip and peanut butter. The caramel crunch coffee ice cream was really awesome, as was the Whiskey something or other.", "author": "Kajal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "Been here a few times already! Lots of great ice cream flavors to choose from, I love the pistachio and vanilla. Also have delicious cookies and cute pies. Tried a warm apple pie with vanilla ice cream the other day. Absolutely delicious. Can't wait to go back!", "author": "Kristin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "OMG...sooooo good.... forget your normal ice cream sandwich. This is THE BOMB. you will never buy a store bought ice cream sandwich again.", "author": "Julie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "Frozen yogurt was SO yummy!! It was a sweet tart flavor and made my night! I will be back to this cute ice cream shop that smells like heaven!", "author": "V H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "Great homemade ice cream and generously & graciously served by Mele. She was so kind & cute, definitely added to an already great ice cream experience!", "author": "Linda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "We stopped by here the first night we were in San Francisco....well...we were back the following 2 nights as well...The ice cream was on point and the service was exceptional..I will definitely be telling everyone back home about this gem.", "author": "Mr. C S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "We stopped here today while in the neighborhood for a trio of the ice cream sandwiches with some friends.  They make the ice cream AND the cookies in house, from scratch (unlike Cream, which can tastes a bit like grocery-store cookie because I don't think they do).  I am a complete sucker for interesting flavors so had a lot of fun putting together flavors (earl grey and lavender honey on snicker doodle really works well! So does cake batter and chocolate on chocolate chip cookie).  Cookies were soft and amazing.  Also, the staff were super friendly and so helpful.  They are also very patient with samples as I worked through what my masterpiece ice cream sandwiches would be composed of!  Cannot wait to go back.", "author": "Corinna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "ahhhhhh..... $4 for a custom ice cream sandwich????!!!!! yyyyyayaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaasssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssss \n\nmy love life - completed. i now live for their amazing hand crafted ice cream.", "author": "Zak C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "The homemade ice cream here is top notch. Could smell the fresh baked cookies when I walked in. Got a scoop of coffee caramel crunch and it was excellent. I don't even normally like coffee ice cream.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "these are the kind of shops I like in my neighborhood. The owner behind the counter, friendly people, good service, great ice cream, AND: reasonably priced. I always felt I was being robbed at Tutti L. down the street when I paid $12 for two ice creams. I now know I was, as these guys can deliver a better product with a better service at a much lower price.", "author": "Peter J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Love this place! It's such a cute idea and a perfect dessert or snack spot. Not too bad in price and the homemade ice cream and cookies are so very good. Coconut is right on!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "Very disappointed. This place used to have One of the best ice creams in the neighborhood and friendly, good service. Today I came here for a usual weekend visit. The store was empty and when we came in the attendant didn't acknowledged us it was like we're not there. I had to ask her to place an order and even then she kept doing what she was doing for a minute or two, which didn't seem important or urgent. My wife ordered the pistachio that she always orders but it tasted sweeter than normal, and it had a different texture than usual, not as creamy. So we informed the attendant, Jasmine, explained it to her and asked gently if she could exchange it for us. She told us that she could, but she'd have to charge. Her bad attitude went on and it simply destroyed our experience. We ended up not eating our ice cream and will never come back. It's sad to see a good establishment in the neighborhood go to waste.", "author": "Rogerio B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "Best ice cream in town, great flavor choices, friendly service, low prices, open late.", "author": "Howard B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Yum Yum and Double Yum. The custom ice cream sandwich is a must. Peanut Butter cookies with Honey Lavender ice cream!!!", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "really nice staff, tastey flavors, let us try lots of samples, put up with my crazy grandparents--awesome!", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-21", "description": "If you like thick, creamy, dense and rich ice cream then this place is for you!  It is too heavy for me and very dense, more dense than gelato! Very sweet too. I prefer the texture and taste of Tin Pot ice cream in Palo Alto.", "author": "McKenzie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "chocolate mint was very tasty and yumm ! so in luv with this place:) highly recommended !!", "author": "Nastaran G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "An explosion of joy in my mouth. Coffee ice cream cuddled lovingly between two WARM chocolate chip cookies. Such a simple dessert restaurant idea, but they got it right! I will definitely be back!", "author": "Jennie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "Just stopped by to try something new. Omg best whiskey ice cream ever !!! You must go and try it", "author": "Fina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "This place rocks. I went there as I was at the Hyatt for a few nights, right next door. I kept telling my girlfriend about it and she started getting annoyed. I was so pleasantly surprised as I had gone to other more well known ice cream shops around town looking for the exact experience that was offered here. First off the ice cream is cheap, like $2.30 for a large scoop. The taste and texture is off the charts good. The coffee crunch is amazing. And considering my main squeeze when it comes to ice cream, their chocolate is just what I was looking for. Gets an A+ from this ice cream enthusiast.", "author": "Paul P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "This place was so good we went back 2 nights in a row. I had the honey lavender both nights, others had mint chocolate chip and chocolate. The owner was so helpful offering samples. Great customer service and fresh delicious ice cream!", "author": "Lindsey G."}
