{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Wickedly good pizza! We had the BBQ chicken and the dough just melted like milk chocolate... Sounds strange but it was wildly good. The customer service was phenomenal as well. \n\nIn the same night we went to the place up the street and they were very rude and took cash only. \n\nDon't go there... Eat here instead.", "author": "Eddie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-02", "description": "I love a good pizza-by-the-slice joint, especially one with outdoor seating where I can people-watch. There are three little tables out front and theres a sign on either side kinda shielding you from the pedestrians. \n\nI like the combinations offered here (ie; basil, sausage and ricotta) but they definitely looked better than they tasted. I also had a regular ole pepp slice. They were both piping hot and the crust was okay. The cheese was the cheaper kind though so it was lacking some flavor and neither slice had enough meat. \n\nOverall it was just ok. I'll try the pizza place on the end of Castro close to Market Street next time. I was just too close to my car to head back that way this time.", "author": "Marilyn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Came here a little while back with my sisters on a night out. We were all walking together somewhat late at night and had a craving for some pizza so my sister showed us this place. Soon as we walked in it smelled soooo good! We decided to get a whole pizza to share, the chicken pesto pizza and let me tell you.. YUM! It was hot and cheesy and very flavorful. The crust was good and thick enough to hold it up without being too much. \n\nI'd definitely want to come back and try some of their other pizza specials like the Figgy Piggy and the Potato pesto. These combos are a lot more interesting than I've seen in other pizza spots. Will come back when I'm in the area again!", "author": "Cheney E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "Have weird meats of animals I feel uncomfortable eating (Im someone who typically loves meat). The pepperoni pizza I ordered soaked through multiple napkins and paper plates.... it shocked my entire friend group...", "author": "Akash S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "I love their pizza!!!! Their crust isn't heavy - it's just right. Amazing! Highly recommended. I've never had an issue with it and I don't think I will.", "author": "Jeannette A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Gross would never go here. They definitely don't have any regard for customer service.", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Yummy slices in the Castro :))) \nThe pesto is super good and great just by itself - my fav. Oz pizzas are super unique, huge and it's a must try when coming to the Castro and getting food. They also have weirdo topping like Ostrich and Alligator if you want to be daring. For beverages - Sodas, beer and wine and they have these are great ice cream sandwiches. Go!", "author": "Tere C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I came here with my best friend and didn't even get anything (because I was allergic to everything -- LOL) but they were so incredibly kind and allowed us to charge our phones and let me overstay my welcome by a LOT. A very special shoutout to Jojo (I hope I'm spelling that correctly). He is such a sweetheart! I am so grateful for his kindness! Definitely stop by here!", "author": "Pooja S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "Came here drunk. There was a short line. I remember the slices were a bit on the pricey side but the slices were pretty substantial. Would come back here for my drunchie desires if I was in the Castro.\n\nThe venue is pretty small, service was really fast (or so I believed b/c of my mental state).\n\nOrdered the\nPotato pizza - drunk me thought it was pretty good, really big. I even stole some from my friend", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "The gentleman behind the register and one gentleman server were very nice. They both worked with smile on their faces and made the experience at Oz very memorable. \nThe pizza was delicious, hot and fresh!!! \nDefinitely a great place to stop by for a slice and a beer after the club", "author": "Rodney G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "Jus ordered lg Hawaiian with mushrooms.. pizza came soggy.. vest was too thin to hold up the cheese n meat n pineapple n mushroom.. is best to eat at restaurant.. hot with crispy crust.. not going to do delivery ever..", "author": "Crisy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I order pizza from them through an app. It's pretty good.  Basic pizza and nice delivery people.  They're pretty fast too.  Plan to continue ordering. Yum!", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "It was one of those nights, you know, the ones where you bar hop and have fun drinking and dancing, then come closing time at 2am, your stomach says \"I want pizza, and for you to go straight to bed after\".  Yes sir!  We actually wanted to grab some slices from a joint across from the Castro Theater but they were closed.  You can't make money if you're closed!\n\nATMOSPHERE:\nIt's a typical little pizza shop with indoor and a few outdoor seats.  The pans of pizza were pre-made then zapped to order.\n\nMENU:\nSalads, chicken wings, pizza, dessert, beer.\n\nFOOD:\nMushroom Pizza - My choice, and it was the last slice left!  The Costco-sized slice was a thin, chewy crust, with fresh mushrooms, cheese, and had great flavor.\n\nPepperoni Pizza - My spouse's grub.  Pepperoni is a pepperoni is a pepperoni... Tasty, salty, not too oily.  Because we had 3 huge slices, they put them in an entire pizza box, a bit of waste for a city that's into recycling.\n\nSERVICE:\nFast and friendly from what I can remember lol.  We were in and out in less than 5 minutes.\n\nTIP:\nYelp check in offer of \"one free soda\"  was honored!  Thanks guys!\n\nOVERALL:\nGood pie, open late till 2:30 am!", "author": "Vince N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Huge slices and solid pizza.  There's always new combinations that I want to try but I'm basic, pepperoni and mushroom every time!", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "$5 for a slice is pretty steep, especially if it's not that good. The slice is just average, it's not terrible nor the best, but it'll satisfy the pizza craving. The service is quick, but the slice wasn't hot enough and the pizza was made sloppily (even though it did have a lot of pepperoni).", "author": "Spencer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "My boyfriend ordered from here for the first time today. He was a little skeptical at first but was starving and tired of looking up places to eat. The delivery was pretty quick about 30 or so minutes. When it arrived it was still hot and every piece you pulled off had that nice gooey cheese look. And he said the taste was there to match! He gave it a 7 out of 10 (and he's pretty picky with pizza)", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-20", "description": "My friend and I walked into Oz. The first thing the employee said to us was: \"we don't serve people with Afros here\" then preceded to try and make a joke about that comment. We decided to ignore it. Twenty mins later he says \" you all gotta get the fuck out\" someone asked for clarification. He preceded to say: \"I'm gonna body slam the fuck out of you if you don't leave\" I'm really offended at this point, I just paid for food here. I asked to speak to the manager, and he said\"I am the manager motherfucker, I'll respond to your yelp review\"\n\nThis is insane I would be treated like this in sf, in the castro. It's disgusting", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Had this pizza delivered to our office for lunch and it was great! Thank you so much for bringing a variety of vegan, gluten-free etc. options! As someone who is lactose intolerant I usually just end up having the \"vegan\" pizzas, however, I love having meat and flavor on my pizza. They brought a pizza with vegan cheese and meat it was delicious! Pepperoni, sausage, green peppers, and onions! Loved it! I do not feel like there is a taste difference, however, since I feel so much better after eating \"vegan cheese\" pizza I might have a biased opinion! My boyfriend is even open to trying some as well, WIN! Thank you and I look forward to ordering from you personally!", "author": "Mary W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Well they've been here for 3 years it's very clean they have outside seating they have all kinds of different kinds of pizza you would like by the slice to go or you could order a whole pizza. When i was there i found out they have gluten free pizza they also serve ostrich camel and alligator never even heard of that wow! By the slice $5.25 plus tax equals $5.50 a slice  that is a cheap and look how big the pizza that's enough for one meal. If you want a slice to go they heat it up and they have combo comes with the salad or drink for $10 and they have pepper flakes for you to with ur pizza which I like. \nIf you want to sit outside and you enjoy people watching or sit inside they also have a TV you can watch while you eat lunch.  If you're out partying in the neighborhood and you're drunk and you need some food to sober up then come on by and get a slice of pizza. lol\n(Thank you for Reading my oz review!) ~Lizzie~\nOh ps. They do deliver!! Whoop whoop!", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "In the Castro Area and hungry? Oz is the place for you! Open late night for all the party goers and hungry drunken souls with an apetite. They have beer and wine (if you must keep drinking) as well as sodas. The pizzas are ready for serving and they are fast and friendly.\nWe had 3 because they were all so original I could not resist!!! Camel toe (lmao) was my fav! With 1000 island dressing drizzled on top and camel meat!! Then I also loved the potatoe pesto!!! So good!! You can have gator on your pizza and Ostrich or just a regular pepperoni. It gave us a much needed break from all the bars. Cool crowd with outdoor seating too. I will be back for the Ostrich. About $8 dollars a slice, thin crust and cheesy. I checked in and got my free soda. Yay!!! :)", "author": "Theresa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Was I town for the first time and I was hungry. I had just parked and turned the corner and I saw OZ Pizza. Went in, ordered a slice of pepperoni Pizza Pie, and a cold IPA. They cut my Slice free of the others, and stuck it in the oven heat and crisp it up.. it was great!! Really great tasting pizza. The beer was on tap and was nice and cold. Really a good spot.", "author": "Steven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Great pizza!!! Great place!! Will definitively come back for the best service, great variety and the best pizza. They have amazing beers on tap and TVs for the games.", "author": "Carolina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "The night before last was an experience to remember. It had been about a week since my last slice of pizza and I finally caved in and indulged in the neighborhoods best slice of heaven. Good times in this place the second you walk in. Always. Great convo, a glass of wine and for once, something other than my usual slice until some activity sparked up and a random group of guests went bat-shit bananas. \n\nWe all do what we do while having a glass, two or three.. Aside of what I had to witness from the inebriated or whatever the bunghole those folks had been on; Oz Pizza seemed to have it under control. Safety, standards as well as patience from the main man himself; Tanner handled the conflict with confidence. As the difficulty continued, he unfortunately had to share the story with ten police men and women. I sat and waited, wondering which one was going to order pizza first. None! Lol. \nGotta say.. SF cops are focused and pretty fit. \n\nIn the end a refund and a vegan pie was left with nothing better than to share. I took it upon myself to take the entire pie and feed the neighborhood. \n\nGet in this joint already and get that gator meat!", "author": "J H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "I've never actually been here in person, but I order delivery a lot and these lovely people and this drool-worthy pizza is the best! I've only gotten the Figgy Piggy, cheese, and pepperoni. All so yummy and the XL size leaves you with delicious left overs! Order away Yelpers!", "author": "Heather N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Amazing service quick and delicious pizza! So many flavors and special pies to delight your tastebuds:) conveniently located in Castro. Recommend the fig goat cheese arugula, or the alligator, or the ostrich or the camel !!! Whaaaaaaat crazy flavors , and classics !! An old classic and a new twist , welcome to sf", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "The pizza here is spectacular, the prices are reasonable, and their GLUTEN-FREE pies are fabulous as well!\n\nThey also deliver pizza late at night, which is great for night owls such as myself!  The guys who've delivered are very polite, friendly, and helpful.\n\nThe restaurant itself is WHEELCHAIR-ACCESSIBLE, with indoor and outdoor seating.  There are always at least 5-6 varieties of pizza slices available at any given time, and they are interesting flavors, not just the same old pepperoni or mushroom.  There is a Creole-flavored Alligator pie, Ostrich, too, if you prefer...This is a pizzeria with options!\n\nI ordered their GLUTEN-FREE vegetarian pie, and it was immensely popular amongst my friends.  I also really love getting their meatball and ricotta pie...mmmm!!!\n\nOrdering from them online via Eat24hrs makes life incredibly easy, too, for someone like me, who sometimes orders large numbers of pizzas for events, and submits the order a day or two in advance.\n\nAs for me, what's my favorite?  Plain ol' cheese pizza!!  Can't beat the classics!!!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "DAMN this pizza is good and I CAN'T eat food with dairy but have been known to make an exception or two (closer to five) and this is one of the foods I will bend the rule because its just that good. Enough said.", "author": "Tanya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Ordered delivery from here. When we got the pizza all the toppings had slid over to one side. As a former pizza delivery driver, there really is no excuse for this. It's not hard. Its probably good pizza if you order take out. But I can't tell since half my pizza doesn't have cheese and the other half is extra everything \n\nUPDATE: shortly after leaving this review the owner of the restaurant messaged me and asked if we'd like a free replacement. Unfortunately we were about to leave so we couldn't take advantage of his offer. I just texted him about month later and asked if the offer still stood and he honored it. This is a business I will continue to order from because of this. Everyone makes mistakes but everyone deserves the chance to make up for it and they went above and beyond in that department", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Great salty big slices of pizza at 2 am - reminiscent of jumbo slice in DC. Can't imagine patronizing it at a respectable time.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-08", "description": "There was no parm on any table, I looked at every table. It's $5 with tax. The pizza isn't tasty so I will not be returning for a free slice. Thanks.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "This place is not bad at all. Not bad for coming in late-nights and grabbing a few slices. It'll do the job if you're super hungry from either being drunk or just having those late night munchies. Me and some friends went bar hopping around the city and ended up here where we ordered a load of slices. Their pesto is not bad at all and their prices are pretty cheap too! I can't remember the price of each slice because I was drunk but I still knew that they were cheap. If you're in the Castro and looking for some decent quality, cheap, quick pick-up, I totally recommend coming here and grabbing a few slices! Trust me, it'll do the job.", "author": "Allister D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "what well endowed man wouldn't subtly or unsubtly broadcast his giftedness to every living woman in existence?\n\nyet at the same time women are expected to smooth over & hide their lips. (i'm not talking about your mouth)\n\nclizza plz y'all know idgaf about double standards\ni got the CAMEL TOE PIZZA 14\" $30 (camel meat, sauerkraut, pickles, 1k island, mozz)\n\nto chomp while watching jackie brown\nso ladies if you've got it flaunt it ;p in a stewardess suit or a tux too\n\nall i know is my pizza was missing sauerkraut & pickles\nunless i just didn't see em under the yoga pants heyooo\n\n4 stars despite topping snafu bc tasty and where tf else has camel or ostrich pizza", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "Got pizzas delivered from this place and the \"vegan\" option had parmesan and I got sick. They need to fix their labeling before someone else gets sick as well.", "author": "Ricky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Solid slices, especially the specialty ones with unique proteins like ostrich and alligator.  The guy working the counter helped me figure out what to get and even though it was a tad bit pricey, well worth the price.  I work in a pizzeria in Los Angeles and these guys make some good pizza.  If you're an SF local, I'd highly recommend checking this place out.", "author": "Taylor F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-28", "description": "really enjoyed the spinach cheese pizza. the flavor of the month pesto potato pizza was creative and tasted pretty good.  I liked my vegetable pizza, they could have more vegetarian options. Pizza was kind of greasy but overall good.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "Never ordered a full pizza but I'm a definitely a fan of the pepperoni slice...thin crust, melty cheese, spicy red pepper flakes and delicious peppperoni... thats all I need!", "author": "Jenny E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "The service was good, but the pizza was horrible. Every aspect of the pizza was dry and flavorless--the bread, the meat, the cheese. My friend tried one of their macarons, and they were dry and crunchy.\n\nThey have ostrich, alligator, and camel meat pizzas if you're into that.", "author": "Paul T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "Stumbled upon this place while looking bite to eat, and was pleasantly surprised. Being from the east coast, I'm always wary of pizza places in this city because I've been let down too many times already (and always find myself wondering how can you get pizza wrong...but obviously, you can). But this place actually turned out to be okay. I really liked the eclectic type of pizzas they have. I ended up with a pesto pizza with sliced potatoes and garlic. It was really delicious and wish I would have gotten another slice. There was a line but it seemed to go pretty fast as well (so you're in and out in a jiffy. But please note it takes a little longer for an entire pie). Definitely a must if you happen to be in the Castro district and looking for a quick bite to eat.\n\nLikes:\n-overall good pizza \n-variety of eclectic pizza options\n-fast service \n-inexpensive ($5/slice)\n\nDislikes:\n-some of the pizzas didn't look the freshest (like the beet and cheese pizza...but then again, who wants a beet and cheese pizza?) \n-parking can be a bit difficult to find in this part of town (try going on a weeknight, if you're interested in trying their pizza, or take public transportation)", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "This is the best pizza I've had since moving to the city.  Perfect dough, great sauce, ample toppings.  I especially appreciate the exotic ingredients (ostrich, alligator, kangaroo. Seriously!) and how they're balanced well with other ingredients.  \n\nI'll definitely be returning and often.", "author": "Tanner O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Wow - simply amazing pizza without the attitude that you get at Marcelos and the meager toppings at Marcelos. This is how my absolute go to place for AWESOME pizza in the Castro.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-15", "description": "The worst ever they take no responsibility for there WRONG pizza not that good and they are a ripe off ....they blamed me for everything I ordered from there web site and it said eat something did the delivery ok my recite had MY ADDRESS there recite had my parents address they have been dead for 10 years and your going to BLAME the deliver service when your recite had my address and feel right about it ...I don't think so.....THANK YOU FOR NOTHING.... don't make the same mistake I did order ELSEWHERE  do your self a favor .... there are better I'm sure ... just a heads up ....I paid $40.00 some bucks a TOTAL WAIST OF MONEY AND TIME ...   YES TRUMP BLAME EVERYONE ELSE....READ THE RECIPE YOU SENT ME WITH YOUR WEBSITE YOUR ADDRESS AND YOUR MISTAKE ....PROCESS THAT ....print...", "author": "Kai R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "Staff at night time (weekends) except for the cookers, rest like cashier and delivery chick are extremely rude. \nThey expect a tip when they test you like a second class citizen, I guess the Trump situation makes them feel that they are better than other people. \nThis is the first and last time I'm trying pizza at this place. \nIs it a favor that your are asking here. Is actually a service, which by the way customers are paying for.  \nFirst time I've been called I'm rude at a place. \n\nI wouldn't recommend anybody to come here, if you like to be yelled and ask WHAT DO U WANT, then come here. I'm sad for the owners.", "author": "Mr C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "I come here every now and then when I feel like spending an arm and a leg for a few slices & when I'm craving pizza lol. I give a 5 stars on the pizza, but I'll give a 2 on there prices   smh & there customer service is really shitty. The  short little latin guy who who's taken my order every time I've gone there is always hella rude and always acts hella irritable.... But other than that the pizzas great lol", "author": "Santana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "Good pizza, but worst customer service ever!\n\nThis was my first time here and my last.  I asked for one kind of pizza and was looked at like I was crazy and was rudely told what I could get instead. \n\nThey were not busy at all, but the attitude of the cashier was like just get order and leave us alone. So much negative energy. I was in a good mood before this place. The pizza I got can't even put me back in the good mood that I was.", "author": "Tajster H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "$32- for a \"medium sized only available\" Gluten-Free pizza? How tf did the owner come up with that price?", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Hands down best pizza in SF. I've been here four or five times now, and Oz never disappoints. Slice of pizza, and a beer less than $10. Sold.  No matter where I'm at in The city I will go out of my way for this pizza. The fig bacon and balsamic pizza is to die for. Also had a slice with camel and ostrich meat. DONT PASS THIS PLACE UP!!!!!", "author": "Haley C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-05", "description": "I stopped here for a slice before a film at the nearby Castro Theatre. Plain cheese slice in a box - to go. $4.75. Ouch! The pizza itself - not great. \n\nI know that Slice House (in The Market on Market Street near 10th) is $5 for a cheese slice, but that's for GOOD pizza. \n\nAlso: 12oz can of Coke - asking $2 - pass. Cold 16oz cans at Walgreen's across 18th street for $1.45.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "SLICES: best in the Castro. Have not ordered a whole pizza, but I work in the area and have tried all the shops around recently, these are the best slices by far. Great variety of things you've never tried (Camel, Alligator, etc). Big slices, big fan here. Open very very late.", "author": "Richard V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Good pizza and fast delivery. Pizza toppings were generous. Recommended. Also came with red pepper and parmesan cheese on the side.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "Came home so hungry I was getting a headache...grab phone hit food app and Oz Pizza springs up.\nNice menu, and after a bit of a think I order a feta cheese black olive pizza, a bit of sausage.\n\nSoon pizza delivered, hot and so good to my nostrils and stomach.\n\nFirst bite confirms nose: excellent feta, really creamy and flavorful.\n\nJust a memory now, but the smile still lingers...\n\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-22", "description": "COME ON! how hard is it to bake a pizza?! ours looked like someone threw up on the pizza; it had a rubbery crust, almost no toppings and for $35, we'll probably not order here again. seriously, how much do we have to spend to get an edible pizza? do we need to double every item on the pizza so the pie doesn't look empty? we try to support local businesses when we order food, but this was disgusting.", "author": "Torrpedo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "walked in here with a group of friends for a quick bite of pizza slice. I got meatball pizza...lots of quartered meatballs but were a little dry... the crust is kinda thin crispy and chewy at the same time.", "author": "Raquel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "I liked this place . No frills service  but decent, thin crust  pizza with some cool toppings . I had a slice of the caramelized  fig,  blue  cheese with fresh  arugula pizza, and washed it down with a beer . They offer a varied enough selection of pizza slices and and 4 of the more popular beers on tap.", "author": "Umar G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "These people charged me $3.25 for a Snapple.\n\nUPDATE:  Oh I just read the review by Joshua H. below.  I have brown skin... I guess that explains it.\n\np.s. Onur O:  Your not \"getting\" my point proves my point.  Don't worry, I won't be back.", "author": "L. S. A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "Went here for a late night bite after going out in the Castro. We were a little bit before the rush so we did not have to wait in line. \n\nThis place has a wide range of pizzas, including one that has alligator on it. I decided to go with a slice of the Hawaiian pizza--it was a decent rendition and hit the spot after a night of drinking. It wasn't the best pizza I have had, but it definitely was a large portion as I only ended up having one slice. \n\nNot anything super memorable, but not a bad spot for some grub after a night out.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "Was in here getting pizza with a couple girlfriends and while it tasted good there was a lot going on here that was a huge turn off.  \nI have an opinion that you should be able to eat a pepperoni slice with your hands.  Not the case here.  The crust was so thin and soggy I couldn't get it off the plate and had to scrape it off with a fork to eat it.  \nStill hungry I got a second mushroom slice and the crust was so thin it didn't even make it into the oven in one piece.  The guy at the counter looked extremely embarrassed and said he'd put a different one in for me which I declined because I could tell it wouldn't matter as all the other slices looked as pathetic as that first.  \n\nNote to the cook - Leave more dough in the center of the pizza so it doesn't get so soggy and will become more crispy.  \n\nThis seems like something that should be very easy to fix.  I can't even imagine what the slices with more than one topping turn out like.  \n\nWho's is in charge? A line of five or six people built up at the counter when the phone rang.  The server finished up taking a couple orders, put the person on the phone on hold, helped a couple other people then went back to take the phone order.  It took a while on the phone so a bigger line built up at the counter.  The entire time the cook was literally lying down on the freezer chest in the back.  If I'm standing in line waiting on food I don't ever want to see an employee lying down.  That's just ridiculous.", "author": "Karyna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Tanner (the one with the hat) was very awesome and helpful! He gave me great pizza and then I left my backpack there. Shortly after I called the restaurant and he made a few jokes with me about how the found it but people stripped it of everything valuable. I knew he was kidding and he got it back to me with everything in it!!! Thank you friend :D", "author": "William K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "Decent pizza slices, good variety including veggie.  Ok prices for the Castro...refill on a fountain drink AND 7th slice free w frequent pizza lover card.  Plenty of indoor and outdoor seating -although getting a bit worn out - great location to people watch, staff is usually friendly.", "author": "Scuba J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "Told that a piece of plastic is cheese and refused to admit it... did offer another slice but unacceptable to not admit fault. If you think a water bottle is cheese you clearly had too much to drink.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Great spot to try out of the norm type of pizzas! I got a slice of the loaded ostrich pizza after midnight coming from a club...my first thought...Ostrich?! What kind of of pizza joint is this?! And there was Camel slices left as well!! I was looking forward to a traditional American meated pizza...but I said, \"what the heck! Why not?!\" and it looked delicious and let me tell you...it was so DAMN good. Full of flavor and not weird at all. It was literally a match made in heaven and the crust was made to perfection! Hands down one of my favorite pizza joints I've tried and I'm visiting from Los Angeles. Thanks OZ for a fun and tasty experience!", "author": "Miracle E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "The disappointing news is that this isn't really a new restaurant, it's definitely a minor update of the old Escape from New York Pizza. But update isn't really the right word, they sort of stripped all of the personality out of it, and left the structural integrity intact. \n\nGood news is, escape from New York pizza was pretty good, so the product remains respectable. They definitely could've used a little more imagination though. Seriously, no designers in the Castro? Inconceivable! The style is way lacking.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "It's kind of hard to mess up pizza but if anyone knows how to mess up pizza it's these guys. I don't think of ever had such a vile soggy cloying piece of pizza, if one could call it that, in my life. I feel like I need a purgative and a hot shower. Ugh!!!! Seriously, how hard can it be?", "author": "Geoffrey V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "This review is for delivery. Pizza slices from Oz are decent (I'm a fan of the Figgy Piggy). Feeling lazy and ordered for delivery for the first time since the ownership change. The pizza you pick up as a slice has a medium-thick crust. It's not the greatest pizza in the world, but it's pretty good in a pinch. \nPizza that arrived by delivery is cracker thin and was overcooked to a sad, slightly burnt crunch. It's pretty clear that they have a completely different recipe for their delivery pizzas and don't take a lot of care with the preparation. Simultaneously complaining that something is not that good and that there isn't enough of it is silly, but we were surprised that our large pizza order was so tiny. For the quantity and quality, I found it to be way overpriced. Stopping in for a slice is your best bet. For delivery, skip it.", "author": "LISA K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "I just tried this place tonight, so the size of my data is small.\n\nHowever, I walked in, and the place was well organized, people were sitting, there was a clear pathway to get to the counter, it was very inviting.  Then the front lady was exceptionally friendly and talkative, just wanted to make sure I chose a slice that I was excited about.  \n\nI chose a slice of pesto garlic potato (how cool!), brought it home, and it was delicious.\n\nI just thought the whole experience was fantastic.", "author": "Jon E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-16", "description": "RUDE! RUDE! RUDE! -- staff is so rued. Came in and asked for a pizza without meat, pizza guy looked at the cashier and rolled his eyes. STRIKE 1. Asked if it was okay if I got a small pizza box, hence why we ordered 2 slices, cashier threw a box on top of the class and proceeded to become super sassy while I received another eye roll. STRIKE 2. Charged us for 3 pizzas instead of 2, cashier then proceeded to argue until the pizza guy confirmed that we ordered 2. STRIKE 3. -- May I add, I am no where near those crazy, demanding customers. I don't deserve the sass, I DGAF if you're having a bad day. \n\nGave this dump 2 stars, mushroom pizza was marginally okay in comparison to the rest of the 2am pizzas in SF, definitely not worth 5 dollars!", "author": "Shela D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-23", "description": "Nothing turns me off more about a business than shady charging.  You advertise a pizza and salad for $10.99 but charge $17 with tax?  That's a fast way to lose clientele.  Pizza is good though.", "author": "Inked I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-13", "description": "Had pizza delivered. Not bad, but really just pretty average. They have some interesting pizzas with unique toppings like alligator meat and kangaroo meat (both of which are pricey for pizza), but we stuck with mostly classic pizzas. The crust was thin enough for the pizza to be somewhat floppy, which I liked, but still thick enough to hold together, and despite being pretty bland and flavorless, it was pretty fluffy and doughy, which I also liked. The pizzas were a little greasy, but that's pretty typical for pizza. I would've liked a lot more tomato sauce though and a little less cheese.\n\n-CARNIVORE'S DELIGHT - 3/5\n[pepperoni, sausage, salami and canadian bacon]\nPretty standard/average meat lover's pizza. Nothing super special, but there's a good amount of meat.\n\n-POTATO PESTO - 3/5\n[roasted golden yukon potatoes, garlic and pesto sauce]\nMeh. I was expecting more from this pizza, but I found it underwhelming. Oddly, I really liked the garlic. Lots of whole roasted garlic cloves but surprisingly didn't taste too garlicky.\n\n-MOZZARELLA WITH ARUGULA (custom) - 1/5\nSuper disappointing. I was expecting the pizza to be topped with arugula, but they cooked the arugula into the pizza, under the layer of cheese. There was barely any of it and since there was also barely any tomato sauce, it was just too much dough and cheese.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "the cashier with the hat is a hottie with a body and the pizza is bomb- so many different kinds and a great location", "author": "Haley W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "I ordered a slice of cheese pizza today from Oz.  It was a good sized piece of pizza.  I also appreciated the fact that they added lemon to their ice water dispenser.\nService was fine.  The pizza was thin and crispy but I thought the sauce didn't have much flavor.\nI paid $3.50.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Good solid pizza that's delivered hot and fresh.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "If I could give zero stars I would! I placed an order for delivery an they said 40 minutes, an hour goes by an no word so I give them a call they tell me the driver should be there any minute.  I get a call back a few minutes later to find out when the driver was leaving to deliver the pizza he dropped it and it landed upside down....", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "Not a fan. Had the combo and it was 4.75 whereas a combo up the street was 4.20 and the combo included unique combinations!! Also, the crust of this pizza was very think and full of flour. If it had flavor, would have been so much easier to finish up the slice. However, crust was extremely flavorless. A plus is the pizza had plentiful toppings and cheese(which made pizza very oily, so I suggest soaking the pizza with napkins first)! \n\nAdditionally, I was very disappointed that they didn't toast my pizza slice just like any ordinary pizzeria would have. I mean, the pizza was warm and all but it would have tasted more fresh and crunchy if toasted before given to me. All in all, my first experience here was not all that great. I hope to come back some time and update this review with possibly more compliments! For now, I suggest skip this and head up the street for some Marcello's.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "The \"my grandma loves me\" pizza is the best vegetarian pizza I've ever had. I think their secret is that they marinate the vegetables in something delicious before putting them on the pizza, but I'm not sure. \n\nI generally order delivery via Grubhub, and they always arrive early. Highly recommend.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "This place is very good to grab a slice at. They have a variety of pizzas and some combinations I've never heard of before. The individual slices come out well and I was very impressed. \n\nHowever, it is night and day when it comes to their full pizzas. I ordered my pizza well done and it arrived undercooked. The flavor was lacking, and it was crumpled in the box. I was very disappointed because I liked their slices so much. \n\nWon't order delivery again.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "In the heart of the Castro on a chilly SF evening, OZ is a great place to get a specialty slice and a beer. Go traditional with the classics or exotic with flavors like alligator meat or kangaroo meat.\n\nI got a slice of the kangaroo and for $7 beats the airfare to Australlia. I was hoppy ;) with my choice.\n\nThe people behind the counter are also friendly. I will go back!", "author": "Marcus T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "The pizza will not disappoint! I never thought I'd be eating camel as a pizza topping, but there's a first time for everything! The Camel Toe pizza was spectacular and I also had a slice of Carnivores Delight as a back up. Those were two of the best slices of pizza I've ever had. We went in on a Saturday night close to dinner time and the wait was minimal for pie slices.", "author": "Rocio R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "I have tried so many pizzas but this far best\nOne !\nbig slices and there is about 8 different\nSlice available !\n I will be your customer as long as you provide this excellency   :))))\n\nMost important one is beers $3.50 \n\nAwesomeness  \nAwesomeness", "author": "MATT K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-03", "description": "This place has the most tasteless pizza. Ever since Escape from New York left they must have taken the flavor with them. One star because now they do serve beer but the pizza sucked. We had pepperoni and the pesto, potato, garlic and both were bland.Never coming back.", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "This review is based on delivery only. \n\nI have ordered twice now from Oz via the Order Ahead app, and Oz has not disappointed. I love that they will deliver to Twin Peaks, as sometimes it's hard to get businesses to deliver up in my hood. Paxti's Noe Valley won't deliver to our place, for example. And I need more options besides Twin Peaks Pizza. \n\nThe first time, I ordered chicken wings with blue cheese, and made my own medium pizza with pesto, garlic, ricotta, mozzarella and meatballs. This pizza was ON POINT, and I impressed my boyfriend with my ordering prowess. The second time I thought I'd mix it up, so I ordered the chicken wings, and an XL (mistake unless you need to feed a small village--we had pizza coming out of our ears, and the box wouldn't fit in the fridge) with pesto, meatballs, garlic, artichoke, feta and mozzarella. There wasn't enough feta, and the artichokes did not work with this combo. \n\nTIP: You will get a much fresher tasting pizza if you custom order. I see a lot of the low star reviews say that the pizza tasted old, like it had been sitting around. Order a pizza they have to make from scratch so this doesn't happen. Sometimes you have to take matters into your own hands. \n\nThe only thing I don't like about Oz's pizza is the crust, I think it needs salt big time. But it's not bad enough to deter me from ordering again. Otherwise, we really enjoyed it. And we LOVED the chicken wings. You are going to want those-just make sure to wear pants with an elastic waistband. Those wings are great for game day, or any day, really. My boyfriend is crazy about the wings, and he is pretty discerning when it comes to chicken wings. We like that Oz knows to have a blue cheese option. \n\nThe delivery is fast, the wings are good, and the pizza is not bad. Overall, you could do a lot worse.", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "Oz is delicious. Their gluten free pizza is really good, and is a pretty decent size.  The folks working there are really nice too.", "author": "Gary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "Great pizza!!! Very friendly owners!!! Throwback music!!! Open LATE!\nThe Beer selection on draft: Stella Artois, Budwiser & more. \n$4.00 a slice pizza. Freshly made, thin crust, great topping selection, and very delicious!\nThis is my second time trying & was surprised not to find them on Yelp. Spoke to the owners & they open the doors on October 4, 2014. \nThe location is on Castro around corner from Badlands. People are so chill & you feel comfortable to hang out & chill.\nWishing them much success & on my next trip to San Fran, I'll be stopping by!", "author": "Mike G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Dude this place is the spot. Hella cool people, wild ass flavors of pizza, what a good place to hang out on a Saturday night! Bless, Oz pizza. Keep it cool cos u guys are and your pizza is dank af.", "author": "Becca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "What's not to like...\n\nBig slices\n3.50 pints\nOutdoor seating\nBig tv's and music\nFriendly staff\nClose to muni\n\nAlso they take cards which is convenient.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "There is a large variety of pizzas here which is great! They also have some unique toppings like ostrich, alligator, and camel meat! Definitely a cool place the adventurous type. On top of it all the service is great and the people are friendly. Stop by if you're in the mood for trying something different!", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Great little place in the Castro district, awesome customer service and wonderful food.a must try if your in the area.", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Just took my daughter to OZ Pizza and she LOVED LOVED LOVED it! I am excited because she's a picky eater, and will not eat most things, including pizza when we go out. She is 19 months old, has no allergies, a diverse pallet, yet likes very little food when we go out to eat. This is the only pizza she will eat aside from Seniore's and Costco pizza believe it or not. When we went to Pizza Orgasmica, Patxi's, Marcello's, and Nizario's my daughter would spit out the pizza almost as fast as you put it in her mouth.\n\nShe loved the Hawaiian Classic and I loved my Figgy Piggy and also Carnivore's Delight!\n\nAlso @ Melissa R. who wrote \"  I like golden showers, but I don't like this pizza.\n\nThe cheese is always melted perfectly, but I have an issue with crust that tastes so badly, not even ranch dressing can make up for it.\"\n\nNo offense Melissa (your review made me laugh)- But anyone who likes the taste of urine may not be the best judge in Pizza......I can only imagine what other kinds of \"crust\" you eat and find better tasting than this particular pizza Crust, hahahaha, not judging..... but seriously. Cute review I'd say-", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Best NY style pizza in the west. I eat pizza all around the world and this is one of the best. Very friendly staff too. 6 stars", "author": "Dennis Uluç' T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Really enjoyed it! So far, It's the best pizza I've tried in the area! Nice crust, nice everything!\n\nIt was packed when I walked in around 7pm on a Tuesday night! I'd be really stressed out if i was the one behind the counter cuz it looked super busy but they were calm snd smiling! Impressive customer service and great taste! I grabbed a huge slice of pepperoni and a lagunitas on tap! Totally enjoyed it! This place is recommended for sure.. \n\nThumbs up!!", "author": "Kaya B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "This used to be an Escape from NY pizzeria. I'm from NY. I love thin crust pizza. Ever since Escape from NY sold their place and this joint became became Oz, its level of terrible has been steadily on the rise. This isn't just, \"waah, it's not exactly the same place.\" No, it's legitimately become terrible. Their slices have become way more expensive, and of lesser quality, with idiotic meat toppings like alligator, camel, and ostrich. This is literally the gamiest, chewiest, most leathery meat you could possibly choose to put on a pizza. It's disgusting. And they charge nearly $7 for the privilege of consuming a few exotic morsels on your cardboard dough. There's nothing redeeming happening here. They can't even be bothered to offer oregano anymore. SINCE WHEN? They're too busy importing camel and ostrich to afford oregano? Really? No oregano?\n\nThe dough itself just isn't as good anymore. I've tried these guys a bunch of times, hoping for salvation. The last time, the dough was literally like eating cardboard. I didn't think you could ruin thin crust style pizza so badly, but Oz takes the gold medal on that one.\n\nYour changes to the dough aren't good, and your bizarre meats are terrible and unnecessarily expensive. Please follow whatever formula you surely obtained from Escape from NY. They're winning. Thanks for ruining a great neighborhood pizza joint.", "author": "V. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Amazing pizza, can't wait to go back definitely have the Carnivore Delight!", "author": "Bret A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Fantastic!! you all need to go and check this place out. Pizzas are amazing, try the camel toe! Stays open late and hits the spot after a night of partying and drinking.", "author": "LaLa F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-26", "description": "Have eaten in the restaurant many times and not bad. Had friends over tonight and had  an extra large pepperoni and sausage pizza delivered! How awful! I was soooo embarrassed ! There was NO SAUSAGE!! Maybe 3 pieces ! There was NO PEPPERONI!! Maybe 10 slices ! Lots of cheese though!!! Never, NEVER AGAIN!!!!! My point being where's the meat!?", "author": "Gary R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "I don't review much on Yelp, but when I do, I mean it.\n\nIf you're looking for new-age pizza, to rekindle your spiritual enlightenment, this is it. I'll throw pepperoni and sausage toppings at you on your way out the door.\n\nThis pizza blows. I'm not a fan of SF pizza in general, but this has to be some of the most gag-worthy wannabe topped bread I've sunk my teeth into. I honestly wish I could tell you I didn't regurgitate my pizza cause the flavors were so off. I was served COLD, SOGGY BREAD. No one deserves that.\n\nI paid $13 for two slices, gave a 20% tip, and ended up leaving 80% of my pizza on my front stoop for a rando to pick up. \n\nScrew this place. It's several levels below the place it replaced, Escape from New York. Makes me wish a legit pizza establishment, like Arninell's, would open up an outpost in the Castro. \n\nI'll never visit this place again and tell everyone I know I had diarrhea for several days just so that I can spare themselves the travesty.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "Pizza is solid, nice fresh medium thick crust.  Pestolicious is great for vegetarians.  \n\nSkip the salads unless you want a $7 box of lettuce and prepackaged dressing.", "author": "F G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "This is te best pizza I've ever eaten.  I come here all the time and the people that work here are always great (especially the hot guy with the hat)", "author": "E B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-19", "description": "Stopped here to grab a quick slice after work. Fast and easy service. Pizza was okay. Good amount of cheese and sauce. Plain dry crust. It's open late so it's great for a late night slice after some booze.", "author": "Morgan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Ok, first let me tell you that I am a Ninja Turtle.  I love pizza and I am very snobbish about my pizza.. It can't be mediocre. It HAS TO BE BOMB!!! The Pesto Pizza!!! enough said. A bit expensive though. $8 for two slices... they were big and delicious so oh well! not an everyday thing...\n\nThis place took over the space of Escape From New York Pizza. I recently discovered that they closed... RIP Escape From New York Pizza!!! :(\n\nI went to elementary school back in the days just up the street (Harvey Milk) and would frequent here when I had the chance.\n\nI returned from living for the East coast to find they were closed.....\n\nI am happy to say Oz lives up to my expectations. \n\nI will say the owner or manager (maybe he wasn't the manager but came off as he was) seemed to be a bit dingy... I made an order for Pesto pizza that wasn't cooked and when it came out I went to the counter to retrieve it, he looked at me as if he had never seen me and told me that would be $8. ummm!! I ALREADY PAID, BUDDY! It wasn't even crowded..", "author": "Drea W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-20", "description": "My 3 year old daughter got raged at by a (seemingly) homeless derelict in this place. Not cool. Pizza's at best mediocre, at worst disgusting (alligator, anyone?). Next!", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "I don't know how I haven't written a review for Oz yet, they recognize me when I come in so I should have at least checked in about 100 times already.\n\nOz is hands down the best pizza in the Castro. Perfect for grabbing a slice of anything from cheese to alligator beet (they have some wild toppings) and they have beer! It's pretty nice hanging out there too, they have some really wild art on the wall and when it's nice out they have a few tables outside.", "author": "Raquel L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Pizza arrived cold and undercooked. Pepperoni was super salty. Was not worth the price!", "author": "Jason A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "You got to experience Oz Pizza for yourself.  Great really nice staff and people, good food and very good drinks.  Keep up the great work you guys, will always be back.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "You should be ashamed of making pizza. I ordered the \"Mahrgarita Pizza\" and let me tell you, its basically melted mozzarella on bread with sliced tomatoes. Nothing about it is \"delicious\" as the menu says on the site. It should be named \"Shluck pizza\" try looking up the ingredients before trying!! Disgusted.", "author": "Lynton M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Could be better.. Came here with family and friends and the customer service just wasn't good at all. \nEverything is way overpriced especially for the quality and taste of the food. The food is real dry and left out for too long. Not coming back ever again.", "author": "Jet G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "For me, the crust makes or breaks my pizza experience. Here you will find the Worst Crust Ever.\n\nAlso, I came on a busy Saturday night and they had dozens of pieces of alligator and ostrich slides and NO pepperoni. Another major strike. Never again...", "author": "Malcolm K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "Every time I've been here for pizza, I was drunk. From what I remember, the pizza is pretty good and the crust is actually really good. I've had the all meat pizza, pesto chicken pizza, and veggie pizza. It's a bit small inside to accommodate all the people sometimes but not a big deal.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "This place is different then the other pizza places due to having such a unique pizza toppings . \n\nI don't remember when I had kangaroo pizza last time ( never had before till oz opened up ) no need to go to Australia for it . \nIt's here in the heart of Castro \n\nBottom line is ;\n\nIf you are an avid pizza aficionado and you enjoy food, then this place is a must (don't forget to get beer ) goes really well .", "author": "ercan b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-23", "description": "The cheese is always melted perfectly, but I have an issue with crust that tastes so badly, not even ranch dressing can make up for it. \n\nI miss Escape From New York.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "We just ordered our first pizza and it was delicious! The cheese used on the pizza was of good quality & so cheesssy! Home delivery was quick, came before the scheduled time.", "author": "Maria W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "This place is magical because they took arugula, feta, and dried figs and put it on a slice of pie that slayed me.\n\nit. slayed. me. hunty, like for real.  Everybody tries to do those three on pizza - Oz did it RIGHT.\n\nNot to mention the fact that I walked out of here feeling like the Queen of The Castro because HOLY SHIT 3 SLICES AND 2 BEERS for UNDER $25 - if you don't recognize that as a steal in the City, you ain't been livin' there long enough.", "author": "Daisy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "They have the BEST \"potato pesto pizza\" omg it's amazing! It comes with pesto sauce, potato slices, and roasted garlic on top! (The garlic really makes it delish) The portions are huge! I ordered the potato pesto pizza for an event I had and everyone loved it!!! I ordered a day in advance and they even text me when the pizza was ready. Great service!!!", "author": "Justin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Pretty mediocre pizza here. Bring back EFNY!\n\nDough was just ok and the toppings decent. Hopefully just working out the opening jitters.", "author": "Jim O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "I stopped by this pizza joint after spotting it tipsy leaving a bar in Castro late at night. The guy working was really friendly and chatted with me for a bit before taking my order. As much as I wanted to try the Wild Alligator pizza I just couldn't stomach it! Still think it's pretty cool that they carry it though, very unique and gourmet of a hole in the wall pizza place. I went for a plain pepperoni and my friend went with a meat and veggie slice instead. Pizza quality was really good, you don't really get this quality of pizza from hole in the wall pizza joints in LA no matter how popular it may be. Definitely worth a visit if you're a gourmet food connoisseur and are heroic enough to stomach the Wild Alligator pizza or just want a regular decent quality pizza!", "author": "Harout S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "I've been coming here for a few months I love their pizzas specially cheese pizza delicious \nClean restaurant", "author": "Mohammad Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "This was the first time I ordered delivery and the combo sausage/peperoni/onion/bell pepper Pizza came fast and hot! Steam actually came out when I opened the box. Yum. Quality is good, pizza is tasty (I've had slices when I walk in and now a full pie delivered). \n\nI personally like the crust but i suspect the reason some don't is because it is plain like french bread, and not sugared or salted like most American bread products. I think the flavor should come from the toppings and the crust should be just like this.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "I adore the pizza from here it is a dream and the best I've had in San Francisco that compares to pizza from Europe and Rome. Love it so much!!!", "author": "Thom H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "I'll keep this brief.\nGot 3 pieces to go, two pepperoni and one onion, pepper with sausage.\nGot them home and heated them up (I live less than a block away, so travel time wasn't a cause for poor quality).\nThe two pepperoni-crust was soggy and the back quarter near the crust was completely with out cheese.\nThe combo-sausage was greasy and again soggy crust, and this one was over sauced and still light on cheese. \nI should've walked the extra block to Marcello's where I know the pizza is good.", "author": "Bob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Pizza is good but somewhat pricy with a drink.\nThe person in the counter accidentally gave me someone's pizza. When I told him, he took it back. I don't know what he did with the pizza so I was disturb about that. At least just give me the pizza. It was just awkward the way he approached and talked to me.", "author": "Kiro C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Alligator, ostrich, camel on pizza? Sounds weird but tastes great. Good service nice selection of tap beers for less than $4. Tastiest pizza in the neighborhood and best NY style pizza in the west. I'll be back.", "author": "Mutlu T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "Was starving and needed something in my stomach before a night of drinking :).  I didn't want to venture out of the Castro so just decided on some pizza.  I ordered just a slice of the combo and it basically got the job done, let's just say it wasn't great but it wasn't horrible either.  I kinda wish I  was aware of the unique meat options though .  I also liked the fact that you get a free soda upon Yelp check in.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-23", "description": "I've had better.  Even when I was hungry I ate this and still thought it was mediocre. Got a slice of chicken pesto pizza with tomatoes for little over $4. Toppings tasted like it could have used some garlic. Crust I didn't care for. Crisp yes. Thin yes. But tasty? No. I attempted to eat the crust and to try to pick out the flavor. Didnt taste like much and I tossed it on my walk home.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "Just OK pizza, at best. Not as good as Escape from NY. Better choices a block away.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Pizza by the slice was perfect for our tour around Castro. I had the figgy piggy and was surprised by the goat cheese. Overall, it was good but the crust had a bit too much flour for my taste. The cashier was very nice, which made the visit worth it.", "author": "Jacqueline O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Personally I m not a big fun of pizza and I had never been until I got potato pesto. Actually I was trying to learn that what item makes this pizza so delicious and finally I found out the homemade pesto sauce that they use for that slice! If u haven't tried it yet, you miss a lot ..", "author": "Mustafa Burak K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Order the largest pizza. They delivered it in half the estimated time, and it was still hot (unlike other delivery places). And quite large. Prepaid for it with tip, so the delivery guy said, \"Enjoy!\" Hassle-free purchase w/ Apple Pay. Nice surprise to find packets of parmesan and red pepper inside. It also tastes great - tastes like homemade sauce.", "author": "Cub C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "At this point I'm writing the review, must have been at least 20 times that I come here having this location be so close to to my walk home.  Every slice I have had at least once.  Favorite is the buffalo chicken and celery.  My new favorite beer is there not your fathers imagine a mix between root beer that actually gets you drunk. To me that is perfect pairing with a slice of pizza, hats off for that. This is my second review and again I will be giving them 5 stars. With amazing customer service and exotic meats from around the globe oz pizza is definitely a destination worth the trip.  Enjoy pizza connoisseur's.", "author": "Marc W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Best pizza so far. Very similar to NY style. They have regular toppings as well as crazy ones such as alligator, kangaroo and ostrich. Gotta try those soon. Staff is way friendlier than other 2 places in Castro. I ordered for a delivery once it was fast and hot.", "author": "Serena H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-21", "description": "The pizza was decent but the staff was shitty. Poor customer service. Also, handling cash transactions and then food orders without hand washing in between doesn't seem very sanitary. Training their staff on food safety is a must. Just saying.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-30", "description": "I just paid 5 dollars for the nastiest cold pizza I've had in years. Total dissapoinment.", "author": "Kim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "Ordered from here twice. The pizza was OK but nothing to write home about. The customer service was pretty bad. The second time, our driver put in the wrong address in his gps and didn't make it to our house until 1.5 hours after we put in our order. The pizza was ice cold and made incorrectly. The manager was unsympathetic when I called and never gave us our refund. Pretty unfortunate. I wanted to like them b/c they deliver gluten free pizzas but we never even finished the pizza that got delivered, which is saying something.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "One of my favorite, nearby places for pizza delivery.  Delivery is usually faster than they say, pizza is great, and the tomato sauce they use is very good.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "I've been here twice and both times I was satisfied with the food. The staff was very nice and the pizza was really good. I wouldn't say this place is special or anything but it's very good for the price.", "author": "Anais T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "I prefer oz to the other pizza by the slice places in the Castro. They serve a few variety of pizzas that change daily. I particularly enjoy the chicken bbq. They also have a $7 deal for pizza and a speakeasy beer. They also have some indoor and outdoor seating. The staff is pretty laid back and they cups for accessible ice water. They also charge extra for boxes and a side of ranch.", "author": "Mel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "I really like Oz Pizza!  It took me a few years to realize pizza here would never be what it was in New York - but that is something you just adjust to.  So basing this just on SF pizza alone, I think it is one of the better ones in the neighborhood.  The staff is always attentive and friendly, they take credit cards (which others in the Castro do not), and they have a good selection - there is always something fresh that you are in the mood for.  They also have frequent customer cards where your 8th slice is free.  Two thumbs up for Oz!", "author": "Sean R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "It's a shame their oven doesn't heat up the top of the pizza.. The meat ended up cold and the cheese was congealed.. Looks like Nizario's is gonna get more business.. The toppings were nothing special.. The sauce was pretty bland.. What else is there to get me to come back.. Nothing when there's better options 200 ft away..", "author": "E S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "Had the very mediocre garlic potato slice. Had to ask for additional heating as slice wasn't warm enough. Had to add salt, parmesan, and garlic powder just to get a fuller flavor. This is dull, lazy pizza and the interior design feels disjointed and looks unattractive.", "author": "SF R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "Really had high hopes for this place, as I was fan of Escape from NY's consistent pies. But, there was nothing that special about this pizza. Sauce was ok and the cheese was fine. The crust, however, was too thick and heavy for my liking.  And the sausage was more fatty than meaty. To meet the delivery minimum,  I also tried the buffalo chicken wings and would advise against them unless you like them unfried and soggy.  Best of luck to the new place - seems like some folks are enjoying it. Me? I'll stick with the place that starts with an M down the street.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "Bland pizza and unfriendly service. Miss you, Escape from New York. Head up to Marcello's instead!", "author": "Shawna Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "Ordered a meat combo slice and was told that it would 3 minutes.  Pizza pie came out and all but 3 slices were served to customers ordering after me before the worker remembered to ask me what I ordered.  Inefficient guys! Very inefficient!  And simply shameful for being in the food service industry! Not recommended for mediocre pizza.  Seems like most of their business comes from being the only place open at late hours.  If they were in a real consumer market, their work ethic would sink them. You're better off at Nazario's down the street!", "author": "Al F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Happy to not see another vacancy in the Castro, but we definitely  didn't need another mediocre pizza place to replace the one that just left. Pizza dough had no flavor and was doughy and underdone. Sauce wasn't any better. We'll give it another try once they get more settled.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "I've ordered delivery from Oz pizza through Eat24 twice and stopped in the store once for a slice to go. \n\nIt's decent pizza but not extraordinary. (I am well-known for my love of pizza, so I'm confident in my ability to identify truly tasty pies.) Their toppings are tasty and pretty creative. The toppings themselves always taste perfectly fresh, but the crust is mediocre. Normally I love eating pizza crust but theirs just isn't worth the calories. Seriously, it's rubber, floury junk. However, if they improved their crust, they would be among the top contenders for best non-artisan pizza in the city. \n\nTonight I ordered the Caprese pizza. It's a lot like a Caprese salad. I added ricotta to mine and it was magnificent. These guys really know how to make their ingredients shine. But alas, gnawing on the cartilaginous crust exhausted my weak jaw. Le sigh. \n\nOne thing really bothered me about my order though. Based on the options on the menu, I ordered a Diet Coke and a Sprite. When my food was delivered, I received a Diet Pepsi and a 7-Up. Uh, that's not what I ordered... I know it makes me look like a first world jerk to distinguish this, but I hate both 7-Up and Diet Pepsi. If they had advertised their sodas properly, I wouldn't have wasted my money. I'm not trying to be a jerkwad about it, but it kind of reminded me of the lawyer in Boston who threatened legal action against the Chinese restaurant that misrepresented their prices. So that kinda ticked me off...\n\nAlso, I was rather offended by the guy who delivered my pizza. He delivered it on time, but he was unacceptably rude. He called me and immediately commanded me to come outside because he had been waiting for 10 minutes. He said, \"I know you're home because your dog is barking.\" (Which doesn't even make sense, I'd like to point out.) I live in a studio apartment below my landlord's apartment, and I could hear her dog barking. I told the guy that he was at the wrong apartment and that he should have gone left at the top of the stairs not right, but to just wait there and I would come outside. I have the directions clearly written out and linked to my Eat24 account. Probably 80% of the delivery people understand the directions fine, but I don't get mad when there's miscommunication. Except tonight, the guy starts arguing with me. \"I did go left,\" he insisted. \"You don't know left from right!\" Um, excuse me? I paid a 15% tip in advance and usually I'll tip the driver another $3-5 if they arrive at a reasonable time. For that, I expect to at least be treated politely. I felt like he was picking a fight with me just because he didn't properly read the instructions. Totally inappropriate. I didn't catch his name, but I think he was driving a yellow car. Between the false advertising about the soda and the antagonistic delivery driver, Oz's Pizza lost a full star for my rating.\n\nOn a side note, I wish they had more side-dishes. Oh well", "author": "Christine K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "Wanted to let owner know that after I ate his $6.50/slice alligator pizza, 3 weeks ago, was I was gagging\nthe next day. Just the mere thought of it, grossed me out!\nLast nite, I showed him the receipt and told him what happened after I ate the alligator pizza.\nHe said pick a vegitarian piece. Then he changed his mind and said it was 3 weeks ago.\nCalled me a cheat. Could not believe he said that to a customer. He will not have my business, nor my friends and this review is something I would prefer not to write but I had no alternative for the way I was treated.", "author": "phil C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-22", "description": "Mediocre pizza. It's good but I only got through half without it starting to taste gross. Really oily. They do have Stella on tap for only 3.50 though that bumps it up to 3 stars. But based on food, 2 stars seems good.", "author": "Dulce O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "This use to be the Escape to New York Pizza place in the Castro. Now it's Oz's Pizza, fun name easy to remember. They cleaned the place up a bit new coats of paint and some wood paneling on the wall to make it have a cleaner look (thanks so much cause it use to feel dirty). The pizza is good, served by the slice as always and it's got a thinner than the normal pizza crust, it's toasted to perfection on the bottom, which gives the pizza a little crunch, but not like toast left in the toaster at setting 6, everyone knows that that is the worst. There is a variety of vegetarian options potato pesto; veggie combo with olives, white onions, and green pepper; mushroom; and cheese; and tomato, basil, and pesto. If you like things spicy, try the BBQ chicken with jalapeño or the Pepperoni with jalapeño. OH THEY HAVE 6 BEERS ON TAP AND SERVE WINE! Nothing like a slice with a cold one. I highly recommend coming and saying hello to this new pizza joint.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-16", "description": "Ordered delivery pizza looked nothing like the pics on here. the pizza wasn't even cooked fully had to throw in oven for 15 minutes. Honestly i barely right reviews but the pizza was like domino's pizza. We ordered wings to they were horrible like rubber. Look elsewhere trust me.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Come around 1am because they start pulling out all the fresh selections. The ingredients are authentic, unlike the acme food brands of the other mid eastern ran pizzerias.", "author": "Stanley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Seriously, if you are in the area, stop in and grab a slice. Oz Pizza is worth writing home about. The toppings range from traditional, to damn right creative. I chose to try a more traditional pie just so I could taste the tomato sauce, which I believe is all made in-house. I was told it was good, but baby it was delicious! I have never tasted such sweet and savory sauce on a pie. \n\nThe next time I'm in the Castro, I will definitely come back to Oz.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Stopped by the Castro for some lunch with the hubby, and had the Figgy Piggy slice!  Omg it was so good!!  Figs, Bacon, Garlic and Goat cheese!! Mmmm!!  Had to pair it with a Hefeweizen!! Perfect lunch after a long hike up to Twin Peaks!!  It was a beautiful day!!", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Best pizza ever. Highly recommended.  Must try bbq chicken and veggie gourmet. The place is the best", "author": "Ersin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "I love pizza, but didn't love this. It was decent, nothing to write home about.\n\nThe good - \nGoat cheese as a topping. I love when pizza places offer this. Crust was thicker than my go-to place as well, which I liked. Pizza seemed fresh.\n\nThe not as good - \nOverall the pizza didn't have a lot of flavor. I found it bland, even with some higher-flavor toppings.\n\nThe salad dressings (including ranch) are packets of Hellmans, and you pay extra. Great pizza places know that quality salad dressings go a long way, whether it's for the salad or for pizza dipping. That was disappointing and our salad people (and our one dipper) were unimpressed.\n\nOverall -\nIt's a solid pizza if not exciting. Not a fancy foodie pizza for sure, which is ok with me. While I wouldn't go out of my way to visit or order from here again, if it were a convenient option nearby or the only place open, I'd give it another try.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "This pizza unfortunately is on the bland side. Not much flavor in the sauce or toppings, and the crust has too much leftover flour on the bottom.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-29", "description": "Had a pizza delivered.  It was very late, barely warm, greasy, and tasted like pizza from a high school cafeteria.  No thanks, won't be ordering from here again.", "author": "Kendra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-26", "description": "Ordered from Oz Pizza today for the first time, it was delicious! They were quick for delivery, the ingredients were fresh & tasty! It wasn't greasy which is great! Will be ordering from them again!", "author": "Janet P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "New pizza place on Castro St. In San Francisco. And I have to say that the pizza I had was very good! A very large slice of pepperoni only $4! All the employees are very friendly and very welcoming. They have a large selection of slices, and they also have salads and buffalo wings. I will definitely be returning here very soon!", "author": "Anthony F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Wow. Pizza was so good I came in wanting to share with my date but got jealous of her piece I had to ordered another.  Also $3.50 high quality drafts!!! Yes!  Open late double yes!!!", "author": "Jacklyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "I like this Spot. Very friendly staff & thin crust pizza with fresh toppings & they have a few beers on tap . ;)", "author": "Tambo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "I was looking for a escape pizza but I found oz pizza it's pretty good. service was okay  for midnight on I did catch a peek at the cook picking his nose while he played with his phone literally while sitting on the countertop will see if I get sick yuk", "author": "Pedro Proz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "Best crust and the sauce ever. It's hard to find good NY style in San Francisco. TV and Beer on tap is a good touch. Way better than the previous pizza joint. Best in city. Even though it's counter service, staff checks on you.", "author": "Omer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Excellent vegetarian pizza.   Friendly, efficient counter service.  Tables cleaned as people left which was nice.", "author": "David R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "I was very impressed by the veggie deluxe, unlike most pizza joints it actually had a substantial amount of toppings. Beers were only $3.75 which is a deal in SF. The staff were super friendly behind the counter. I wish the crust was a little crispier, but for vegetarians, this place is good.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "Awful. Nothing compared to Espape from NY or Marcello's up the street. Pizza slice doesnt even stay in one piece when reheated.", "author": "Noel S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "Do not order delivery from Oz! The \"thin\" crust was thick and soggy, the pie was under baked and doughy. The toppings were undercooked and the pie was mouth burning salty. Tried a slice at the store, it was okay, not great, but was willing to give delivery a try. Don't make same mistake! Avoid Oz at all costs, there are plenty of other options in the neighborhood for both a slice or delivery.", "author": "Kenan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "I came to Oz Pizza because I was looking for a place not too crowded to watch the Giants play in the World Series. As an added bonus, it was also their opening day. So they had some promotions going on. At first I cared more about the game than the food until the owner came to me and asked me how the food was. This was when I began paying attention to the food. I had the bacon jalapeno and combo slices. The jalapeno is quite spicy, which I am fine with. All I could think about was the pizza bread however. The crunchiness of the bread was PERFECT! Not too hard, not too soft. Dining area is clean and spacious. I finger checked the dining table, neither sticky nor dusyt. The fact that the owner came up to the customers and acknowledge everyone shows me he really cared about the food that he makes. When I gave him my feedback about perfect crunchiness of the bread and he responded that it does cost more to make the break. This showed me that quality ingredients and not skimming matters to him. If he's willing to spend more on the bread, then I feel safe that everything else will fall into place.\n\nGood food, beer, and the Giants won! What more can I ask for?", "author": "Pullse P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Closest thing I've had to real new york style pizza in San Francisco. Service is great. I would personally take it just a few minutes less in the oven but I love my crust super soft. They do it right here and I have probably been a dozen times since they opened-I've forgot my punch card every time though :(", "author": "Lazer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "Cheap pizza-by-the-slice and a good go-to after hitting up the Castro bars. Pizza isn't anything special, but it's not bad either. I like the variety they provide and have always had good conversations/laughs with the workers.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-19", "description": "Yeah, not really feeling the build your own pizza. It was too doughy/bready with not enough sauce to keep me interested. It did have the right amount of cheese, but that cheese was also a little on the bland side. By the time you get to the crust you're just eating a gluey glob of gluten. The Artichoke heart topping included some of the rest of the artichoke, which is tough and inedible. It's better than a single star, but there are other places in this area that I feel are betty.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "I was curious about the people liking the place but giving only 2-3 stars. Anyway, I was in the neighborhood and wanted to have a slice. More friendly staff than other 2 pizza places in castro, bigger slices and more options. Especially figgy piggy and sausage ricotta and basil ones. Cheapest and the best beers on tap all day everyday. Overall, one of the best pizzas I've ever eaten for a while.", "author": "Oz W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-05", "description": "lukewarm dominoes-grade-but-with-stingier-toppings pizza arrived after an hour and ten minutes to my house which is four blocks away. Just not good enough.", "author": "Matchak R."}
