{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Best cocktails in the city hands down. Gets packed but it wasn't too bad when we visited during the week. There's seating towards the back and ample standing room in the front.\n\nBartenders get busy real quick so make sure to flag one immediately. The menu pretty much has something for everyone and all four drinks we ordered were delicious.\n\nQuite frankly, I'm just mad I don't live/work closer to PCH so I can visit more often.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Really impressed by PCH, and I can see this becoming one of my favorite cocktail bars in the city. All three of the cocktails pictured (forgot the names, there's a lot of them and they all have weird names!) were unique and had interesting flavors.\n\nBe warned, this bar definitely exemplifies city pricing, so don't expect a cheap bill if you have more than a drink or two here.\n\nCome here for a happy hour or a drink before dinner (it'll be less crowded), or make it a stop on a bar crawl in the Nob Hill area.", "author": "Kedar V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Favorite cocktail place in the city hands down. Delicious and inventive cocktails. My favorites are the Silk road and Lime in da coconut.\n\nSmall space and gets crowded quickly.", "author": "Jenny J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Came across this place in my zealous hunt for bars in downtown San Francisco. It's dimly lit, but there's a lot of seating both at the bar itself and towards the back, where there are comfy lounges. The leather-bound menu was also very cute, with extensive pages of drinks. \n\nI ordered a lime in da cocunut, made with reyka vodka, coconut lychee milk, citrus, and topped off with salted pistachios. An absolutely delicious drink that didn't taste strong at all. I savored each sip. However, the entire glass was filled with little chunks of ice--not the normal cube shaped ones that allow more liquid to permeate through the empty spaces. These little ice chunks fit tightly together, meaning that though the glass was very tall, there was actually very little of the drink inside. It's a pretty big complaint I have, especially since I paid about $16 for the drink after tax/tips. Taste wise, however, this drink was perfect for me. \n\nMy friend ordered the thrilla in Manila, made with Evan Williams bourbon, shiso, calamansi, coconute, absinthe, and li-hing mui. It was a fruity drink that also tasted good. \n\nAll in all, a nice place to go for delicious tasting alcoholic drinks. It's a nice place to kick back and relax. The staff were very welcoming and nice. They allow you to go next door to Hogwash (a pub) and order food and bring it to the bar, as this bar itself does not serve any food.", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Tasty, Instagramable, and SF priced is how I would describe the cocktails that PCH serves. For the first two reasons, there usually isn't a time when PCH isn't packed after work hours. It can be a little chaotic trying to get the bartender's attention to place your drink order, but if you're able to secure a table in the back, the rest of your evening will be a lot less stressful. With a table and/or seat, somebody will come over to take your drink order, and you can now order food and not have to juggle a plate and a cocktail between your two hands. Whew.\n\nAs it's been a while since I've gone to PCH, I can't remember the exact drink I ordered. However, I do recall that PCH has a very expansive menu that's sorted by liquor. No matter what your preference is, I'm sure PCH will have a cocktail for you. I always opt for the drinks that include some sort of spicy element and I definitely was able to find something on the menu that fit the bill. If you have a friend who's visiting from out of town, I'd recommend taking them over to check out PCH (maybe go before dinner when it's likely to be less crowded). It's super close to Union Square/BART, and it has a lot of elements that popular bars in SF have these days.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "I just got a job in the FiDi and one of the unexpected perks is being near this gem. Great service, even when it gets busy, and strong but balanced drinks. I came here with a group of friends, all with different taste, and we were each able to find something on the menu that we positively loved. My cocktail of choice? The \"Return Of The Mack,\" hands down. Sweet but not cloyingly so, a tad salty (in a delicious way), and a nice frothy head of egg white to even out the strong taste. One of my fave bars in SF!", "author": "Imani B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "So how does one Judge a bar or a \"Purveyor of Mixology\".\n\nIs it the beautiful people? The Vibe? The ambiance? Cheap Drinks??\n\nWelp for me if you can make a mean Vieux Carre you are a bad ass bar imho.\n\nPCH does an amazing Vieux Carre ( actually Francis does!) but they do so much more exceptionally well that this could be one of the best in San Francisco.\n\nSimple small bar with a discreet outside you could easily pass by without a notice. Bartenders are great...you can tell them your preference for ingredients or flavors and they will make you an Elixir of the Gods.\n\nI especially love their Critical Mass ( if you have ever driven on a third Friday in SF you'll know the other much hated critical mass!): wild turkey 101 rye, aperol, benedictine, green chartreuse, sweet vermouth....it's an awesome cocktail.\n\nSeveral drinks come with a chilled sidecar: a 1/2 extra portion of your cocktail. Very few bars do this and makes the cost of cocktail's very reasonable imho.\n\nActually I've never had a bad cocktail here.\n\nGo early as the place gets mobbed.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Solid place for a few drinks. I like the drink with mezcal and cucumber which seemed to be a special from a few months back and not on their regular menu but they still made it for me anyways (called Witch Hazel?). Had some other drinks and didn't love all of them but I think it's personal preference.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "One of the best experiences...the cocktails were so creative and the mixologists were very knowledgeable  and friendly.  Non-pretentious. My gf and I tried 6 different drinks between us. If we didn't have dinner plans we would have liked to try more.  She even came back the next day with a few other friends. Go early before it gets busy to converse with the mixologists to learn a little about the drinks that they create...that's if that is your kind of thing...:) cheers!", "author": "Spoon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "This is a great place for happy hour after work or before dinner. I am always amazed with their Negroni, there's a twist of pandan in there and it just blows my mind! I also really love their Coffee drink - turn down for nut! Great cocktails!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Extensive beer and liquor selection and tons of chic mixology options. No attitude though and they're more than willing to mix up something special for you.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "If I could afford to guzzle $14 cocktails all day, every day... I would camp out at the bar here. Apparently there is a happy hour, but it's best I don't know.\n\nThis place is on another level for craft cocktails. It's not just \"let's barrel age and dress up a negroni\" - this is something new. The carefully thought out glassware you are handed will contain a textural and flavor combination completely unknown to you until this moment. Cilantro flowers, flaming cinnamon sticks, mystery garnishes will surprise and delight. I've brought several visitors from out of town and they've really enjoyed it.", "author": "Billy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "The Pornstar drink here, with the passionfruit is delicious! It is rich, fruity, perfectly sweet and just an overall enjoyable drink. Probably one of my favorite drinks I've gotten at a cocktail bar in a while, so this bar gets high ratings just for that!\n\nThe other drinks were good as well, I had a smoky melon tasting one which was excellent, had rich flavor, quite a bit of depth, and a nice blend of different tastes, ranging from the saltiness, to the sweetness to the light bitterness of the alcohol.\n\nThe place also has a decent amount of seating and standing space so you can lounge around and talk with your friends for quite some time. Overall an excellent place and one of the cocktail lounges I like more in the area.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "This is a great place for a date-- awesome drinks and pretty intimate without trying too hard. I went for a simple Pimm's cup but my drink was great and I had no complaints. I do wish this place served food-- some truffle fries would have been the perfect addition.\n\nI would definitely recommend Pacific Cocktail Haven if you're looking for a place to enjoy a great drink over conversation.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "MY 500th Review goes to.......A great little bar that helped me get my night started!!! \nThis place is what everyone should think of when \"handcrafted cocktails\" comes to mind. There's a real technique that goes into making a great drink. This bar has it. \nSmall but quaint and has nothing but hipsters chillin here.\nThey have happy hour till 7 everyday with some basic but tasty drinks on the menu.\nThe real creativity is in the specialty drink menu. Sorted by alcohol, each drink has some interesting ingredients. The Swizzle my nizzle was perfect! It was sweet and tart and beautiful to look at. I could have had 10.\nI had a great time here. Check it out!", "author": "Ada J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Yessss to all the cocktails here! \n\nCame on a Friday night actually because Smuggler's Cove was waay over capacity, but I'm super glad we did. This place was way more chill, which actual breathing room, ample bartenders, and seating. Probably a nice place for a date (like most people we people-watched for fun).\n\nAll the drinks on their drink menu were super intriguing-sounding--I really didn't know where to start. They all have great names and fun ingredients! While each cocktail drink was about $14, they were all pretty generous and looked super nice.\n\nI ended up trying the Miso Old Fashioned (yeah, I'm not that old fashioned usually but wanted to see what the miso was about), Lime in da Coconut (intrigued with coconut-lychee milk), and Sweating in a Sundress (had almond milk and mango). All of them were sweet, tasty, and went down easy even though they were pretty strong. \n\nThey even have punch bowls for groups--got to come back for sure for a chill time and so many more drinks to try!", "author": "Clarissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Crack. Pornstar martini w/ passion fruit. Soooo goooooooooooooooooood. We'll be back again. Swizzle my nizzle. Pootie tang.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Came here on a Wednesday after work and found 2-hour street parking nearby. There was still seating inside around 6. I ordered 2 drinks - Toki Hi-Ball and Silk Road. The Toki was very light; I wouldn't order it again. However, the Silk Road was super good! The Japanese curry really completes pineapple... Who would've known? Service was very good - a server was very attentive in making sure we had everything we need at multiple times. This is a great place to grab a 1 hourish drink(s) with a few friends. I thought I saw a food menu online but did not see one, which would have been nice for my non-alcohol-consuming friends.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "I came here to catch up with an old college friend. I ordered a whiskey cocktail called the Thrilla in Manila while my friend ordered an agave drink, the Swizzle My Nizzle.\n\nThis place is very fun - from their uniquely created cocktail names to the decorative cocktails themselves. Surprisingly, the place was not that crowded and people were already filing out around 8pm on a Friday! If you come and there are no more seats at the bar, I believe there are tables further down inside. \n\nThe Thrilla in Manila was really good! However, depending on your preference I did not find my drink to be particularly strong. Instead, it was very sweet and heavy on the coconut flavor. Considering I was drinking on an empty stomach and left without a buzz, I am positive that there was no alcohol in my drink! \n\nThis place has great reviews and came highly recommended to me, so despite their drinks being weaker, I want to come back and try their other creatively named cocktails. This place also just has a great vibe. The noise level was not too loud to prevent you from having any sort of conversation and (was) located right across the street to the Color Museum.", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "I'm too old for this crowd. No: this crowd is too young to be enjoying cocktails this good. \n\nThis is not a quiet and orderly Tokyo-style bar. Nor is it a dark and moody speakeasy. Noisy, frenetic, ceaseless. Full of groups. Fun. \n\nSurprisingly, the quality and imaginativeness of the cocktails did not suffer. My bartender was dizzying to watch - multitasking and constantly moving. In amongst some nicely done menu items (the vegetal  'Oh Snap', the mouthful 'Salaryman' overflowing into a wooden masu cup, the nicely bitter 'Leeward Negroni') I was also served a bespoke cocktail on request. \n\nWow. A fun night.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "I liked this very unassuming spot, with it's dark atmosphere and tiki-adjacent drink menu. \n\nCame here with a big group on our first night in SF. Granted it was a Thursday, but I was happy the place was pretty empty, meaning we got attention from the staff and drinks came fairly quickly. \n\nWe tried all manor of things, including a few holiday items (mine was fig based!). I have to say all the drinks were pretty good. Prices are what you'd expect when ordering fancy cocktails from a nice bar in a big city. \n\nOverall a nice spot that I'd recommend if you're looking for a low-key type of night!\n\nStay Cheerful ;)", "author": "Garen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "I love everything about this place.\n\nEveryone here was so nice!!! Friendly! Cool! Just what you want from bartenders!! \nI was able to joke with them! \n\nThe drinks were wonderfully sized, unique, and delicious! I love all of the variety. We also loved that no one was like uptight about their aesthetic. \nLike, they get it, it's a bar. And they let you bring in food. And if you're not going to let me bring in food, or be weird about it, I'm not going.\n\nBut anyway, yeah. I want to make a trip to the city just for this place.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Another cocktail bar that has pretty much everything I want in a drinking spot. A rotating inventive cocktails menu, but can also make the classics. The good liquors are available if one prefers just sipping. Bartenders are friendly and attentive, awesome when they're so busy and all.\n\nCurrently, this bar is in a holiday mood. Festive cocktails with Christmas decorations are all over the place. It is quite fun and will put you in holiday spirits if the outside surroundings doesn't.\n\nNote this is a pre- or post-dinner spot but will let you bring food in. And, it does get crowded on the weekends. be conscious of when you show up, or go on school nights like us locals.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Hands down, the best cocktail bar right now in the city. For me, it's all about the ambiance, the crowd control, the style/decor, and finally, the creative cocktails. This place does a great job with mixing a variation of ingredients from South American spices, Asian ingredients, and SF style creations. \n\nI'd like to give Francis a huge shout out for taking good care of me and my company. He is everything a bartender should be. He's skilled, knowledgable, swift and super attentive.This guy is knocking down a couple drinks while taking down orders down the line. He's top notch. Me, my cousin and friend basically stayed here for 2 hrs last night. From 4pm-6pm ish. We had around five drinks including some shots. \n\nLast night was their showcasing of their holiday menu which contained about 15 cocktails all within the holiday category. They had mixes from egg yolk, nutmeg, Mexican chocolate, peppermint to even gingerbread whiskey. I also had to order their special which was a Kung Fu Pandan. If you know what pandan is and taste like, then I totally recommend this!!! So far my favorite mix. Drinks range from $10-$15 which is typical SF cocktail prices. This is the only bar up to date where the ingredients & mixes are different and truly out of this world in terms of creativity. \n\nThis place can get packed quick (within the opening hour) so I totally recommend arriving early and grabbing a seat at the bar. Last night they had classic holiday music, lights hanging everywhere, Christmas decor, and even the bartenders were decked in holiday clothing. They have plenty of seats but the front lobby can be narrow as hell when packed so prepare to squeeze through a sea of people. \n\nI will be coming back for more and this time with more people!", "author": "Allister D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I'm obsessed with PCH. I met up with Nina Y. here for drinks, and I wish I could have stayed longer, but it was just for a brief night cap. PCH is pretty dark and swanky when you walk in, lit by the tabletop candles throughout the bar. We were seated at a barstool table for two. It was a little chilly since we were in the \"line of sight\" of the outdoor wind.\n\nAnyways, I love that the drink menu is sorted by spirit. Easy to find exactly what you're looking for. I decided on the Tuk Tuk Tea, which is basically alcoholic Thai tea. I'm not usually a fan of Thai tea, but it sounded like a delicious combination of ingredients... and it was. Super strong, flavorful, and beautifully presented. How can you turn down scotch, cognac, laphroaig, honey, thai tea, and cream?\n\nLike I said, I wasn't here for very long, but I'd love to come back to try more of their cocktails. Perhaps for a happy hour? This is a smooth operation, and I love reading more about them on their website. About the pineapple logo. About the fact that the owners also run Press Club. About being able to book PCH for private events. The possibilities are endless!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Love this cute, random spot I found in downtown sf! Super cute and intimate ambiance. \n\nWe ordered:\n- Swizzle My Nizzle ($14) Tequila\n- Ko'Olina Swizzle ($14) Rum and had a hint of spice to it \n- Lime in da Coconut ($14) My favorite! Tasted like a very mild pina coloda \n- Stop and smell the Ros'e ($14) Yum! Similar to a light sangria. Nice and fruity with a hint of wine taste to it \n\nSuper friendly service! Would definitely be back and recommend this place.", "author": "Miranda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "We came here on a Monday night after going to the MOIC, and we were so glad to have stumbled upon PCH! The ambiance was nice; laid back crowd that paired well with the dim lighting and candles at each booth. \n\nThe menu was extensive, but very well organized. There were different pages on the menu for each type of alcohol; everything looked so good that it took us quite awhile to order. Each of us ordered one drink: Simple Jack, Lime in Da Coconut, Tokyo Drift. We were definitely tempted to try one of the punch bowls, but decided to take it easy on a Monday night. \n\nAll of the drinks were equally good, with great finishes and not too much ice or mixer. There were a lot of interesting flavor combinations, which I never would have imagine together, but greatly enjoyed. The bartenders were super friendly, and helped us make our decisions. We greatly enjoyed PCH, and will be back any time we're in the area!", "author": "Prathna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "I love this bar. The servers are really friendly and the ambiance is perfect for date night or a night out with your besties. It doesn't hurt that it is a short, albeit a little hilly, walk from the Powell Street station.\n\nWe came here on a Thursday in search of good Filipino food from Pinoy Heritage, which was the pop-up restaurant that evening. We were lucky to find a table right away upon getting there. I ordered one of the special cocktails on the Pinoy Heritage menu, and the hubby ordered a glass of wine. Loved my cocktail which had gin, calamansi and Green Chartreuse. So refreshing and not sweet. \n\nI look forward to returning, even without Pinoy Heritage as the pop-up restaurant. I definitely want to try one of their many special cocktails!", "author": "Hazel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "I thought this spot looked enticing. Cocktails could be from $12-18. The interior was not as nice as I thought it would be and it was dim in lighting. We found a spot to sit in as a group was leaving. People got some drinks and I sipped them. I tried the Cane Jane(from Zane) haha! Pretty neat creative bar like a creative cafe. I wouldn't say it felt so hipster. Since it is located near Union Square downtown, there are after-work professionals.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Unexpectedly one of my favorite local bars in SF. But more importantly, serving my favorite cocktail of all time. Just trust me. Try their Porn Star Martini now and thank me later. Comes with half a passion fruit and a shot of bubbly on the side. My mouth is watering just thinking about it. Heavenly!", "author": "Tayler H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "You can't go wrong with PCH. The menu is extensive and you can guarantee that each cocktail on the menu hits the perfect intersection between wildly creative and delicious. This place has plenty of seating, both at the bar and at various cozy couches or tables in the back. The service is great too! Plenty of water refills and the server came around super frequently to check for more rounds of cocktails.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Beautiful and well crafted cocktails with good service. I wish there were some food items or snacks because I like to munch on something when I'm drinking but they focus on drinks and do it well. Very extensive menu with each page dedicated to a spirit.", "author": "Marilynn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Love this spot! Super cute pineapple themed decor. \nThe menu was extensive, with each page of the menu featuring cocktails with a different alcohol as the base.\nI wanted something sweet, so I just told the bartender to make me any gin based drink he sees fit. He ended up making me a gin drink with snap peas in it (forgot the name, but it's on the menu) and it was really refreshing and tasty. Everyone in my group had drinks that tasted great. Will be back!", "author": "Sijia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Tiki drinks galore! Ambiance is a divey, but with such finesse! \nIf you ever find yourself on that Liholiho Yacht Club waitlist (that can be grueling hours), I would highly recommend you spend your wait time here at PCH. In fact, if you ever find yourself in this general area, I would say go to PCH. By general area - let's say, San Francisco lol  \n\nThe drinks are all fascinating, unique, and delicious (usually ranging from $12-13). My friend had a Tuk Tuk (alcoholic thai tea), and it was magnificent. I normally don't like already tasty drinks like that mixed with any form of liquor but it really worked! I tried the Ko'olina (comes with a dried pineapple slice!) and it was beautifully crafted, but I think the Tuk Tuk took the cake on that one! We were just about to order our next rounds when Liholiho called our number. Can you imagine - one of the top restaurants in SF with a wait time of typically 3 hours calling us to let us know our table is ready - and all we could feel was disappointment that we weren't able to try more drinks at PCH. I think that might give you some idea of how creative and worth a visit this place is! \n\nIt's definitely a haven and I'm definitely returning!", "author": "Deanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Solid tiki drinks. Chill ambiance.  \n\nEnjoyed the \"lime in the coconut\" tropical flavors and other tiki drinks without having to listen to super loud music and rainstorms at Tonga Room(Tonga room is fun, but kitschy to the max)\n\nExtra points/stars because this month PCH is home to Miracle bar, aka an \"aggressively festive holiday pop-up bar\" according to Eater SF. This is the most accurate description and words cannot even describe it.  Drinks were festive and came in Santa mugs or other holiday drinkware.  Very very crowded but worth checking out!", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "One of the best cocktail bars in the world. All the bar tenders are top notch. The attention to detail is bar none - glasses are spectacular and extremely clean, the ice is the best, and atmosphere is inviting.\n\nI highly recommend starting with something off the menu but then quickly move to discussing what you like with one of the bar tenders and let them create something off menu that suits your palate.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "This is my first time at a bar where I had a hard time deciding between cocktails since all of them sounded enticing! My friend and I came by for after-dinner drinks and the place was very busy at 9:30 PM. There are a few tables in the back but you probably need to come earlier to snag a seat. Luckily, two seats at the bar eventually opened up and we were able to avoid standing in the crowded area by the bar.\n\nAll of the drinks we tried were flavorful, yummy, and strong enough to get your buzz on. I loved the variety in presentation and pretty glasses they used. I also appreciated that they separated the drink menu by spirits, which helps to narrow down your choice from their many options.\n\nThe staff was friendly and attentive, even when the bar was packed on a Saturday night. If I had to pick one thing to improve upon, it would be to dress up the interior a little nicer to match the glory of their cocktails. However, it's quite dim inside so I guess it doesn't matter that much.\n\nPCH is now at the top of my list of spots in SF for a delicious drink. Can't wait to come back and try more cocktails!", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Loved this place. We held a customer event here and everyone loved it. Great ambience, fabulous cocktails and excellent service. Even the finger food we had here was very good. The beef on chips was my personal favourite. \n\nThe cocktail list is extensive and of course if you ask for an obscure cocktail you are likely to get it. They are made well, served nicely and I specially loved the Pisco Sour they made me. It was excellent. \n\nDefinitely come back here any day :-)", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Pacific Cocktail Haven is such a fun bar! I went while they had the holiday pop up and had a bunch of special holiday themed cocktails. I had the You'll Shoot Your Rye Out, which was a delicious pumpkin cocktail and I had quite a few others but I can't remember the names.\n\nThe bar itself was super Christmas decorated and it made the atmosphere so much fun. The music was all Christmas music too. The bartenders were super friendly and pretty quick for being really busy. I really can not wait to go back on a regular night and try out some of their normal cocktails and I definitely want to take some of my friends there to check it out as well.", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I have had the chance to try PCH multiple times. I had something new that blew my mind. I guess my all time favorite is Leeward negroni (with sweet pandan taste and aroma). In addition to bar seating, they have different configurations at the back. If you come a little earlier in the evening, the place is also more quiet to catch up with your company over great drinks. In my mind, PCH (along with Trick dog) is the best cocktail bars in SF.", "author": "Doruk B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "I finally got a chance to try the cocktails here and I got to say the cocktails are pretty good here. On my 2 previous visits I never got a chance to try the cocktails cause the place was way to packed.    This place is pretty small ,the walk way to the back is Narrow you got to pretty much rub up against people to get to the back. But the cocktails make up for it. I got the Hall pass and it was good and I felt it right away, I've had drinks at other places and as soon as I'm done the frost  thing I say is Was there any alcohol in that. I will be back here for some  more bomb cocktails.", "author": "Dennis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "The drinks here are really great! I love their stylistic and trendy menu, that comes with some sketches of the drinks as well as explanations of the different cocktails and flavors. \n\nI got the Ko'Olina Swizzle (rum) on multiple occasions because I just love it that much! The drinks are all really pretty. I have gone back with different friends because I think the drinks and vibe here are great and worth the price and I wanted all my friends to experience it!\n\nHowever, one downside is that there isn't much seating or space for large groups.", "author": "Hanna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "PCH is now probably my new favourite bar in the world. I have nothing bad to say about this place. From the gentleman at the door to the servers and bartenders, everyone was tremendously nice and welcoming. The decor was great. They have a cool wall painted in the style of airport suitcase tags that also include recipes for transitional drinks from those countries. \n\nIn terms of the actual drinks, there was a variety to choose from that is appealing whether you like a more intricate cocktail or a classic old fashioned. \n\nI don't think I've ever had better cocktails. The Return of the Mack was my favourite. It is a tequila, mezcal based drink that also includes an egg white foam on top. Each sip was bursting with new flavours while not being too much at the same time.\nSilk Road was another fantastic drink that was a little more on the fruity side. We had four drinks and based on that sample, I think they don't have a bad drink on the menu. \n\nA pineapple is definitely the international sign of hospitality.", "author": "Mati K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Came here yesterday to meet some friends from out of town for drinks. Unfortunately, they were caught in typical SF traffic and weren't able to make it, but I dropped in for a Swizzle My Nizzle, which I can best describe as a spicy tequila sunrise w/ passion fruit. I'm more of a tart than sweet kind of guy (maybe that says a lot about me), but the drink was a bit sweet for my taste. It was still well-made, and I'm sure others w/ an affinity for sweet and spicy would have enjoyed it. \n\nAmbiance was a bit bustling, and it was pretty loud inside with minimal seating. Drinks and service were still served quickly and were quality. Was glad to finally try this place out.", "author": "Ravi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "For those who are alcohol allergic:\nGreat mocktails, always give them some direction for what you might want (citrus-y, berry notes). We got something with coconut juice and it was great!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Where can I begin. So I'll start here. I've been in this industry for 15 years and have considered myself a professional bartender for maybe 5. I've been on a sangria binge for a while now and tried yelping places close to this area and didn't find one. I found this place on yelp and decided to try it. I came in and asked Ann Marie if she had one on her menu and she said no but \"I'd be happy to make an in house one for you.\"  I was sold. Being a full mixology bar with fresh ingredients, in house made syrups and tinctures she concocted a sangria and we played around with the ingredients and eventually found the one that I wanted. An expertly maintained and run bar which focuses on attention to detail, which in any industry, leads you to become the best of the best. \n\nIf your into intricately crafted cocktails, and a good atmosphere: good lighting, good music pretty much everything that touches your senses, this is the place. I drink a lot and love all types of bars depending on my mood. I live in LA but will continue coming back to this bar every time I come back to SF.", "author": "Han-Sol H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-19", "description": "Okay, drinks are nice but let's talk about my experience. \n\nWalking into the door the bouncer did not appear yet and had a woman younger than me checking ID's She thought my ID was fake- I'M ALMOST 30! She was holding onto it until she could correctly tell if it was fake or not. (When in doubt, use a scanner). \n\nThe bar was so crowded. Took me 15 minutes to wait to place an order and extra 20 minutes to get the drink. I ordered the Lime in the Coconut. It was delicious but mostly ice. When I placed the order I asked them to close my card at (I was standing at the POS machine w tender.) He took my card. I asked him again to please close my card. 60 minutes later, nothing. It's now about 11pm and I forgot about the card... left and experienced my first leaving my card at the bar experience. \n\nI live on the peninsula and was not going back to city for card. I emailed them and will update the review accordingly based on the response.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Amazing spot!  A little pricey but expected for a cocktail bar.  Each drink is around $13, handmade with love, and absolutely worth it.  I had the Swizzle my Nizzle (tequila, passionfruit, vanilla, lime, and habanero bitters) and it was delish.  I tried quite a few drinks actually... As a group of 6, we each tried something different so I got to sample quite a few.\n\nOne of my favorites was the Do Re Mi with rose syrup, and it comes with an adorable mini clothespin + herbs.  Would definitely recommend this!  You can't really go wrong with any of the cocktails, they're all super well done and taste good.\n\nEven on a Friday night around 9PM we were able to get a table for 6 people without hardly waiting.  The waiters do a stellar job at trying to find your party a table and letting you know when tables open up.  Considering this is a bar and not a restaurant - I found this especially considerate.  \n\nThe place is pretty small and gets very loud.  You pretty much have to yell to be able to talk to each other, so don't plan on having some deep intimate conversation.  There are bathrooms, and it seems like there's a downstairs available but it was blocked off when we went.  This would be a great spot to come on a weekend for a cocktail or two, or even a happy hour!", "author": "Kenna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "A small, fun cocktail bar with a wide variety of very interesting drinks. It can get a little crowded and tight inside, but it's worth it given the eclectic ingredients in their fancy cocktails!", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "I was looking for a bar not too far from Bart but something I hadn't tried before. Based on the reviews, Pacific Cocktail Haven (PCH) was a no brainer. And shocked that it was right next to Hogwash - I had definitely walked past this place before so glad I could finally go inside.\n\nThe decor isn't going to blow anyone away - it's very similar to a lot of the modern cocktail bars - a slightly industrial vibe with the exposed metal beams; a long gorgeous bar, and some cool seats in the back for groups or dates that got lucky on their timing. \n\nI arrived a bit before my date and had a chance to look over the menu and understand why the place was packed before 7 on a Sunday. They have a solid happy hour menu until 7 every day. \n\nBut beyond the HH menu, the menu is diverse but organized by spirit. There is a page for Agave beverages, multiple rum pages, a few with Whisk(e)y. What I really loved was some of the names like Simple Jack, Ultra Magnus (I'm a Transformers geek so debated getting this just out of the name). Also they have pictures of all the cocktails next to the drink to prepare you for what you are getting. I ended up with the Shizzle My Nizzle but substituted Mezcal. It was a great smokey, sweet, citrusy, and spicy cocktail - which is what I want out of my mezcal cocktails. \n\nThe service was solid, with two bar tenders handing out the menu the second you walk in, and a server helping those at the tables or back seating area. Prices were okay - $14 per cocktail, but they don't skimp here.\n\nSo if in the area and looking for a solid craft cocktail on a date or meeting with friends, can highly recommend PCH.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "This is a great place to grab a unique and delicious cocktail. We were in town for a wedding and stayed at the Hotel Beresford nearby and decided to check this place out. Really nice vibe here, cool decor, attentive bartenders, and like I said - really good cocktails.  If I lived in the area, this would be my hangout.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "I've been to PCH about 4 times now in 2017 and I don't even live in SF! I live in Chicago! I'm lucky enough to be able to visit SF so often, which allows the repeat visits. Truly a fan of this place. Craft cocktails in an industrial setting. The bartenders are friendly, professional, and they know what they're doing. I love their aprons :)\n\nThe cocktail list is pretty extensive with sections that focus on different liquors.", "author": "Teri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Their cocktails are awesome and delicious. I make it a point to go to at least a couple craft cocktail bars at any city I travel to, and after a while, all of them kind of start to blend together. So I was really happy that all the cocktails I ordered from PCH were memorable and innovative. It got crowded pretty quickly so I stood sandwiched in between others in front of the bar, but I don't regret coming at all. \n\nKung Fu Pandan - whisky-based cocktail that's a special on the board, not in the menu. This was my favorite - if you like pandan, then you'll love this too. It has a slightly savory yet sweet finish. \n\nMiso Old-Fashioned - miso-butter rum, pommeau & bitters. This had a unique umami twist to it that came through without being overpowered by the alcohol.\n\nThrilla in Manilla - shiso, calamansi, coconut, absinthe, li-hing mui, bourbon. If you don't like cocktails that taste like alcohol, this is for you. The best part was the sprinkling of li-hing mui powder on top, which gave me intense nostalgia to my time in Hawaii, but that's another story. \n\nOverall, I would highly recommend PCH if you're in town.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Wow this is definitely my new favorite bar in the city. Usually don't write reviews for bars because I forget or they don't make an impact, just a place you go in and out. Well anyways they have drinks specials and a menu with witty names, not in a corny rolling your eyes kind of way but wow I see why that's named that way. For example they had two specials the \"King fu-pandan\" and the Jeepney\" the KFP highlighting taste of \"Buko pandan\" a familiar \"south East Asian\" flavor reminiscent of young coconut, or that green jello drink. The jeepney is a Filipino public taxi/bus but I forgot what was in it. Highlights you should try is the r\nTuk tuk tea (an alcoholic Thai tea), and the thrilla in Manila, but you really can't go wrong with this place. They have a happy hour too", "author": "Jenelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "My favorite bar in the city. Despite how crowded it can get for such a small spot, I've inexplicably never NOT been able to find a seat. Large part due to servers finding you a spot right when you need it.\n\nThey retired my favorite drink (you'll be missed dearly, scotch Thai tea) but that's also a strong point of this bar in that I've been able to get something new every time I've gone. Even something as strange sounding as a Curry flavored cocktail nails its execution. They also have punch for big groups... or courageous small groups!\n\nLove this moody corner of the city: its music and lighting is the perfect kind of turn down. Careful of bringing friends who fall asleep.", "author": "Stephen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "What better day to review this awesome place than on the day I got Elite gold and also my birthday! Poised for drinking!\n\nThe holiday drinks here are just plain awesome -- the cups, the flavors (melted peppermint ice creamish, anyone), and the venue. It just warms my jingly heart. Great place to hang out with friends and be merry. Only downside is they are very uppity about keeping an aisle to get to the back bathroom area...it's a bar, don't police aisles. \n\nThe drinks are so bomb and the vibe is great. Holiday spirit galore with the decor. Fun at PCH! Come on, it's called Pacific Cocktail Haven.", "author": "Libby J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "I really loved this spot! They have a variety of drink options so you're bound to find one you like. Also, the drinks are really unique, fruity, and delicious. The prices of the cocktails are reasonable, ranging from around $12-$18.", "author": "Helen z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Good dimly lit cocktail bar in downtown SF. Not a place to meet up with more than a couple others and a bit pricey (though most SF cocktail bars are). One of the best cocktail bars in the area though", "author": "Clayton B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "Several of my fellow yelpers including Joe Cool came here after the recent San Francisco Elite event.  This is my first time here. And this is a great place to hang out and enjoy many of the blended and creative cocktails made by the gifted bartenders.  This medium-size place has a tropical ambiance with a cabin-like feel. Amazingly, the bar carries at least 200 kind of assorted spirits. \n\nRight off the bat, one of my favorite yelpers bought me an unknown cocktail which was one of the daily specials. But the problem is that I am strictly a beer- drinker.  I only had one small sip of the bar's famous cocktail, my palate did not agree with me. \"Yes, I am very fussy!\"\n\nI am very fortunate that the bar also carries six local brews on tap, including micro-brews from the Fort Point Brewing Company; one of my favorite brew companies.  The bartender was understandable and made the exchange and gave me a pint of the light amber ale in a cold glass. My reactions did change immediately after the first sip of the brew. \n\nI did not want to sound like a party-pooper, but this cool bar is great place to grab a cocktail with friends. But for me, I am better off at a brewery.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "We were sent here by a bartender over at Coqueta, and he did not steer us wrong! The space is very trendy, atmospheric, and just enough people to keep things lively but few enough so everyone had a seat or place at the bar. I had the Tuk Tuk and Sweeney's Revenge. Both were phenomenal, especially the Tuk Tuk which tasted like a more balanced Thai iced tea! If you're a pretentious cocktail lover, definitely do yourself a favor and buy a few rounds here!", "author": "Marissa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Pacific Cocktail Haven on the surface appears to be \"just another\" tiki bar. It is so much more than that! Their cocktail menu is vast covering delicious and complex drinks using spirits varying from whiskey to rum to gin! I highly recommend their Kung Fu Pandan (whiskey), Turn Down for Nut (rum), and the Punch bowl that has Pimm's in it (not sweet at all!)\n\nChill spot close to the train station. Great spot for grabbing drinks after work =)", "author": "Frances P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-08", "description": "The service was great, bartenders are fast and artistic, however like most places in sf overpriced,small, drinks are good but nothing out of this world you can find other places with better drinks for a fraction of the price, the clientele is typical of current sf, music is loud to a point conversations become a scream match.", "author": "Rubens T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Pacific Cocktail Haven is a cool, hipster ish, small bar with the most amazing cocktails. I've been to many cocktail bars, but this bar did have a special kick. Lots of the drinks had Asian inspired ingredients such as pandan (this was a special that they had). Pandan is a great way to add fragrance and sweetness to a drink, it is a refreshing sweetness that you may not have experienced before. \n\nThere is also a list of sake inspired drinks.\n\nI had the city of dawn- Partida Blanco Tequila, fino sherry,watermelon, ancho reyes verde,\nkaffir lime, citrus, bitters, with a long rectangular ice cube. It was refreshing!! \nMost cocktails on them menu are about $13. \n\nI can't wait to come back- the cocktails are unique and amazing!", "author": "Stephanie Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "Cute venue, but drinks were a little pricey - star off for that. They don't serve food, but hogwash is sort of connected so we ordered fries before our trip to the color factory \n\nWhile pricey, the drinks were good. I had the swizzle my nizzle (tequila based) and the other girls had the double Dutch (vodka based). They're a perfect balance, not too sweet & I love that mine came with the crunchy snow cone ice.", "author": "danielle a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "The drinks are different and very interesting. Came here on a Friday evening and couldn't snag a seat. There were around 6 of us so we were just standing by the wall across the bar. Luckily, there's a credenza we can put our drinks. Another 2 met us after 40 minutes and were able to snag a seat at the bar. Got another round and left. Service was alright but it does get busier and busier later in the evening.", "author": "Vanessa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Fantastic spot for some cocktails. The staff is amicable and helpful. You can let them get creative, or you can stick to the basics. Either way, you won't be disappointed. \n\nHighly recommended. ​", "author": "Felix C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "This is a great, central spot with a sophisticated tiki vibe. The drink menu is constantly changing and - surprise delight - always has a few Filipino-inspired cocktails with a heavy dose of calamansi and pandan!", "author": "Morgan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Super hip and fun bar. Cocktails are amazing! We went for the holidays and everything was Christmas themed, including the drinks, we had a great time and I can't wait to go back again on our next visit to San Fran!", "author": "Laura R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Excellent cocktail bar in San Francisco. \nThey have a variety of drinks and a great menu . The bar is very low key and trendy at the same time . Very calm and serene atmosphere .\nAbsolutely check out this cocktail bar if you are in the area .\nYou can't go wrong with their drinks . \n\n Came here around 10:30pm it wasn't too packed however just the right amount of people to make this bar enticing . \n\nWe sat at the bar it was very interesting to see the bar tender make the drinks in front of us and explain what each thing was when we had questions .\nMy only complaint is that it was a bit chilly that night and the bar kept the door open which made it pretty chilly to sit at the bar for too long .\n\nEnded up doing one round of drinks and left because of the cold however an absolute must check out cocktail bar .\n\nI ordered a Pyrenees crossing cocktail it was heavenly . Not too strong but just the right amount .", "author": "Binita S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Definitely one of the best cocktail place in San Francisco. This place really understand craft cocktail. Every bartenders take pride in their creation, and make sure that the customers are satisfied. I got the Smell the Roses one. I highly recommend to check this place out if you are looking for quality cocktail and a great vibe ambiance.", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "What an impressive bartender. I could've sat and watched him work all night. He was genuinely the entertainment. So talented and way less cocky than the cocktails & dreams movie but as entertaining or more. I dug this spot! \nGreat crowd. That's always important to note right? Very different crowd from LA. Millennials of all types- extremely diverse group. Everyone was happy, yuppie-esque but cool. No buttheads or drunks to speak of. So great! \nThey had an impressive cocktail list and few other places I've been can make \"hand drafted creations\" with such speed. I lamely stuck with vino as a carry over from dinner and was a happy camper.\nThe place is not refined in the least. There's no veneer of beauty to it. It's rough, loud and they have poop emoji stickers on the door leading to the bathroom- I kid you not. However, it's still a fun place and something new and different to try. It also got packed!\nFor sure I'd come back with a group simply to order one of those pitchers. They looked amazing and were being consumed all around me. Clearly a hit and a recommended cocktail to get here. Thanks for the great night! Will definitely be returning.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "PCH is a pretty cool little cocktail bar located right in the heart of downtown SF near union square. This place actually yields some pretty good hand crafted cocktails and has a fairly chic vibe. The space itself is decorated nicely and the bar is quite substantial, but the area is rather narrow and gets really congested when crowded. The bartenders are super friendly and really do make some good cocktail concoctions. For those of you who can't decide what you'd like, you can just have the staff make you something consisting of your favorite liquor and it tends to turn out pretty good. Overall, a nice little cocktail bar that is worthy of a visit, or several... \n\nLegit-\nFriendly staff\nNice space\nOverall ambiance \nStiff drinks \nCool vibes \nGreat location \n\nMeh-\nGets really crowded \nNarrow layout gets congested \nA bit pricey", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "Pacific Cocktail Haven is a tiki bar in drag.  \n\nWhere good tiki bars are over the top with kitsch and ambiance, PCH is a whispering aside to its brethren.  Such a faint whisper in fact, that one might question how one came to the conclusion that PCH is at all related to the tiki bar genre.  \n\nIt starts with the island-inspired pineapple logo which is reminiscent of something I saw long ago at SoCal's \"Don the Beachcomber\".   \n\nInside, PCH is a stunner.  The front section is dominated by a sparkly, inviting bar with a wall of attractive alcohol climbing to the rafters.  Friends of mine installed a similar bar-wall in their kitchen area and PCH's could've been the inspiration.  Alcohol bottles can be things of beauty.  \n\nThe back half of PCH is dimly lit and filled with tables and seemingly where you should go if you've planned a clandestine tete-a-tete.  The front of house was far more inviting to me but then, I wasn't in hiding.  \n\nPCH has an extensive cocktail menu that hits upon all genres, further masking the tiki-whispering influence.  Look closely though, and you'll find the rum-based drinks and even a couple of $60 punches which serve 6 - 8 people.  They look nothing like those flaming things served in a coconut but they're \"punch\", which is a nod in that direction.\n\nNo food is being prepared at PCH but if you need something with which to sop up that punch indulgence you can order in from next door neighbor, Hogwash.   \n\nWatching the bartenders do their magic I regretted that I was only up for wine.  The pour of red was generous, the service excellent.  This bar may be whispering \"tiki\" but it screams what it's name was saying all along: \"cocktail haven\".", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Gee, where were the Tahitian dancers with their gyrating hips providing an ecologically sound energy source? I guess my dated expectations of another Tonga Room were dashed when Jamie W. and I came in here after attending a nearby holiday party. There's no room for a band barge anyway as it's a relatively compact yet sleek space that happens to serve upscale versions of cocktails you might find in a retro-tiki bar. Kevin Diedrich, who used to tend bar at the Burritt Room and Jasper's Tap Room, owns this place with Sidecar Hospitality, and the result is not nearly as overbearing as some of the youngsters who stagger in here.\n\nThere are about twenty creations on the menu, some quite elaborate. Jamie decided on the $13 Pootie Tang, a powerfully puckery libation with pineapple-infused H by Hine cognac, Enter black sake, coconut, absinthe, and bitters (photo: http://bit.ly/2lUCnMJ). Mine had an even more tropical twang, the $13 Lime in da Coconut with Reyka vodka, salted pistachio, coconut-lychee milk, and citrus poured over crushed ice in a tall glass (photo: http://bit.ly/2lXhPQk). I liked the flavors although the ice overwhelmed it. I kept wondering if it would have been better in a hollowed-out coconut with a pink parasol sticking out of it. Maybe not.\n\nWe weren't quite done yet, so we both ordered the $12 Cawfee Twalk, written just like Linda Richmond used to twalk, no big whoop. It was a deceptively relaxing drink with Ketel One vodka, orgeat, cold drip coffee, and Campari (photo: http://bit.ly/2kIPwUh). It reminded me of my post-adolescence when we used to mix Kahlua and coffee at the Peppermill before prom. You'll be happy to know we didn't go for a third round given the debacle that recently occurred to us when we downed three chocolate mint kiss martinis in a row at Blondie's. It wasn't pretty though I thought I was, and that was only the beginning of the delusions. No, we left with a nice tropical buzz.\n\nCOCKTAILS - 4 stars...creative upscale cocktails in a non-tiki setting\nAMBIANCE - 3.5 stars...really no different than most of the hipster-focused bars in town\nSERVICE - 4 stars...a mostly quietly effective bar staff\nTOTAL - 4 stars...the Pacific feels far away", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Good place for drinks. Bit loud of a vibe but nicely tucked away from the hustle of downtown. Located conveniently above Union Square. Large selection of drinks and fun creative drinks. Get the pandan!", "author": "Royal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I've been exploring the cocktail scene in San Francisco for awhile now and this is currently my favorite bar to go to at the moment. It's a mix of tiki and artisinal cocktail mixes.\n\n Very unique flavor profiles that please my Filipino palate. The drinks I had were the Manila Killa that has kalamansi juice, bitters, coconut, absinthe, and I believe scotch or cognac. Taste: sweet from the coconut and a little citrusy. Mouthfeel: creamy, and cold. The other drink I got was called a Pootie Tang (my new favorite word by the way). When I was ordering this drink I couldn't stop laughing because I kept saying Pootie Taaaahhhhhng. This drink contained pineapple infuse cognac, bitters, and sake. Taste: real harsh taste in the beginning, but suddenly disappears. No after taste left behind. Mouthfeel: typical liquid cocktail.\n\nGoing to make it a stop when I go into the City.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Tucked away amidst the big hotels and shops is this narrow space that serves great drinks in a cozy setting.  We went after dinner on a Sunday night so it wasn't crowded, but it was still buzzing a bit, but in a relaxed way -- friends catching up, couples on a date night, and everyone seemed nice and friendly -- not the hipsters or after-work crowd that you have to sometimes share a banquette with, and their conversations are just cringe-worthy.  I had the Thrilla in Manila which was delicious, but everyone in my party had cocktails that were equally as good.  I'd definitely go back!", "author": "Carlo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Went on a Saturday night.\n\nWe were really excited at first because of the music - BBD and Bobby Brown - so a little throwback vibe.\n\nThere wasn't a DJ however and they didn't play old school R&B all night. It's actually just a playlist of songs from all genres.\n\nCocktails were good. The Jeepney was inventive and a shoutout to Jeepney in NYC that also serves bespoke creative cocktails.\n\nWe found a high-top table to the side and had a couple other cocktails. \n\nI like how this place is small. And next to our hotel.\n\nCrowd was truly mixed. \n\nI recommend this place especially for small celebrations as there's a nice area in the back that a group can take over.", "author": "Ray M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-14", "description": "This was disappointing. The drinks look better than they taste. The bartender seemed annoyed when I asked what drinks he was preparing.", "author": "Glorimar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "This small but upscale bar features bartenders who really know what they're doing. There aren't many seats at the bar and the front of PCH can get pretty crowded, but there is additional seating towards the back. The cocktails are creative and delicious!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "I was here for Miracle, the pop up Christmas themed bar hosted by PCH. Decorations and holiday spirit was definitely top notch. The place looked incredible decked out in lights, snow, and Christmas cheer.\n\nA bunch of rotating cocktails were available. My favorite was the Egg Nog. Nothing too special about the drinks though, they are merely okay.\n\nCome here with a bunch of friends, but make sure everyone is on time because they are busy, especially on weekends. The bar is relatively narrow and small.", "author": "Henry Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Place was chill and had some very interesting drinks. Service was awesome and and the bartenders knew exactly how to describe the drinks. Their cocktail menu was awesome and they had some very catchy names for some of the drinks. I kept trying different cocktails and loved all of it. I would definitely come back and try more of their drinks!", "author": "Jenry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Delicious drinks. Definitely worth coming here. Good atmosphere. Laid back, dark ambiance. Drink quality is excellent.", "author": "Warren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Great place for a drink. Interesting menu. Nice staff. Went with the sparkling wine - mercat cava. Not overly sweet and very good. Place gets very crowded.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Spent the whole evening sobbing at the bar and the service was magnificent! Awesome cocktails and a very nice atmosphere.\nHighly recommended if you're looking for a nice evening alone.", "author": "Asaf N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "A tinnnyyyyy spot for cocktails in the hustle and bustle of it all in SF. \n\nWe popped in on a Wednesday evening around 7pm for a quick round with some friends who were visiting from out of town. Their specialty cocktails were interesting and pretty tasty, but expect to pay between $14-$18 depending on your drink of choice. \n\nI can imagine this place gets crowded on the busy nights and there isn't too much seating to begin with. \n\nOverall a hip spot to grab a drink in the area.", "author": "Siobhan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Delicious cocktails and exciting ambience. \n\nCame here with friends for after-dinner drink around 8pm on a Saturday night and the bar is already semi-crowded, only few tables were left in the back of the bar. Menu has wide varieties of cocktails with different liquor base. I was able to sample 5 different cocktails and all of them are good. I ordered the swizzler and it came with a huge tall glass. It was dazzled with a dried pineapple on the top of the glass and it's refreshing and vey tropical flavor.  My least favorite of the night is probably the whiskey highball among the 5 drinks I tried. But they do have happy hour everyday before 7pm for the highball if you just want to grab a quick drink after work. \n\nWould definitely come again and look forward to trying more cocktails.", "author": "Erica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Gotta adore the bustling ambiance and the innovative, artfully crafted libations from PCH! Shoutout to my girl, Janice C., for introducing me to this chill, brick wall neighborhood bar. \n\nDuring my visit, I tried their tropical Saffron, a savory and herbal saffron infused Montelobos Mezcal and Campari, with grilled pineapple. \n\nI love me a good extra Dirty Martini and here, they execute this classic well.\n\nI'll definitely be back to check out the rest of the menu!", "author": "Merica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "Haven: a place of safety or refuge. This is definitely a nice haven from the busy work week, but the sound levels (as is the case with every other bar) leave something to be desired\n\nStopped by Friday night for a quick cocktail. There's a larger area in the back for seating-- the bar is at the front. The servers do come by and take drink orders, but don't check on you super often. \n\nThere is clearly a good amount of work that's been put into the cocktails, with inventive ingredients such as salted pistachio and coconut lychee milk. Drinks weren't super strong, as evidenced by my non-tipsiness after drinking one (because let's face it, I'm a lightweight). They also weren't too sweet, which I liked. Creative names like Manila Sunshine were appreciated. \n\nThey also have giant glasses (we're talking like 2 feet tall) of drinks that you can get to share with friends-- probably cost effective? or also may just induce your group to drink more....\n\nNot sure I'd call the place classy since it's kind of small, but it's well decorated and nice inside. Not too dark either, which is nice.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "It was my first time here, but it won't be my last! After a late dinner, we were wandering around the area and stumbled onto this place. The first thing you walk into is the well-stocked bar with seats that leads onto another large and dark seating area which is kind of shabby looking. A ramp leads to the questionable bathroom. There's also a set of stairs that leads down to another area, but it was closed off, so we'll be back to check it out. There's a yellow neon P.C.H. sign, and the rest is typical SF bar decor. The ambiance is lively with a younger crowd.\n\nThe menu is large with cheesy puns for cocktail names. They also have a few specials on the board. All the cocktails sound like they have too many ingredients, but they're actually pretty amazing and are designed well. We tried the Lime in the Coconut, Kung Fu Pandan, and some Kavalan. The cocktails take a while to make, but they're truly a labor of love. The bartenders are seasoned and professional in demeanor. \n\nThe cocktails were well balanced - you could very subtly taste the base alcohol while well-placed accents danced around with every sip. The coconut drink was finished off with lime zest and coconut shavings that smelled refreshing as you sipped. The pandan drink was slightly salty and sweet with a delicate flavor of burnt pandan. I eyed some Kavalan on the top shelf, so asked for a makeshift flight to try the sherry and bourbon for $12 a pour.\n\nAverage drink price is around $14, but well worth it for the quality ingredients and expert execution. Would definitely go back - Cheers!", "author": "Farhan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "The drink options all sound delicious! I got the lime in the coconut and it was delicious!! My friends got the stop and smell the rose- and I did not like it. It was too sweet. I definitely recommend the lime in da coconut.", "author": "Kim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Pacific cocktail haven, indeed!\n\nFun names to their drinks!  I ordered up their Ko Olina Swizzle that was tropical and a looker.\n\nThe ambiance to the place is dimly lit and passive flying birds are patterns of their beige wallpaper in the back.\n\nIt's surely for the lovers of crafted cocktails.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "PCH (as the sign above the entrance and the retro neon lighting inside call it) is a really cool, laid-back cocktail bar that's on a quiet stretch of Sutter. Rolling in on the weekend on the early side (6-7 PM) meant that getting a seat either at the bar or in the back at a high-top table was a cinch. The bartenders here are very friendly and know their craft, as evidenced by the skill they showed in making my wife's mocktails. The front has high ceilings, giving it a spacious feel, while the back has low lighting, lower ceilings, and a bit more of an intimate ambiance. I also liked the contrast of the walls of the narrow cocktail bar - one side is old-school exposed brick, with shelves of liquor lined up at the bar, while the other has what looks like simple Chinese-style light watercolor paintings of mountains, although a closer look reveals a some subtle maps (of the U.S.?) laid underneath the outline of the mountains. It gives the spot a bit of a zen vibe, which I really liked.\n\nAs for the offerings here, I don't think food is offered - I didn't see it on the menu, nor did I see anyone eating any. However, there are a lot of cocktail offerings, presented in a slightly worn leather covering and laid out by liquor type. All the ones I had (which were 4 or 5 different ones) were quite good, although I will say my favorite was my first - Hall Pass, which was a robust vodka-based drink with a decent amount of citrus and a very nice thick layer of egg white foam on top. I also enjoyed the Hot Toddy - warm and soothing and quite perfect a drink for the winter. There are a few beers on tap (I didn't bother with those), and you can have cocktails made on demand - although I found you had better luck if you were at the bar talking to the bartenders directly as opposed to the waiters, who didn't have the same level of patience.\n\nIn all, I really enjoyed how casual the vibe was, and given the quality of the cocktails, I thought the prices were quite reasonable (particularly compared to NYC). Definitely a spot that I am going to hit up again next time I am in town!", "author": "Asuka N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "PCH is a wonderful cocktail bar in an old industrial building complete with brick walls and steel beams - perfect for a date or catching up with friends. we got the saffron which was a smoky mezcal drink cut with citrus and saffron notes ($12) there is no food on site but they have an agreement with hogwash next door and you can order food there and they will deliver to you at the bar. the staff was friendly and attentive, will be back!", "author": "Alexandra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Love this cute little bar located in downtown SF!\n\nCame here one night with my friends, and I can't wait to come back. They have an amazing amount of hand crafted cocktails that taste amazing! We each ordered a different drink, and rotated around the circle, and every one of those drinks tastes amazing. \n\nPrice of drink is a bit over priced, and the inside is quite small. We had to wait a while to get a table for a group of 6 of my friends.", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "The parking in the area was better than expected. My friend and I both got good spots. Granted, we came around 9 PM. \n\nI am not sure that the drinks are as well made as they are attractive. The ambiance is okay, not too memorable. No cool vibe, btwn the setup and the music volume. \n\nI might return for cocktails just because they're pretty.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "I love grabbing a few happy hour drinks with coworkers or friends after work to treat ourselves. I happened to be in the city and my friend came across this bar on Yelp. With such glowing reviews, we had to try the drinks out.\n\nBefore I begin, DEFINITELY TRY THE OH SNAP! \nAs someone who's not a big fan of the taste of hard alcohol, this bar's drinks are incredible. They taste high quality, refreshing, and gourmet. Their menu is unique, has drinks such as the miso old fashion, which my friend enjoyed a lot (if you're a whiskey kind of person). The bartenders are also extremely nice as well. \n\nI recommend coming to this place. Yes, it can get busy, but it's worth the trip!", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I get attached to my bartenders.\n\nBIG TIME.\n\nMy cocktail loving heart broke with Josh's departure from Burritt Room and I found myself needing an \"in-between\" while I heal myself and lick my wounds.\n\nExcept Pacific Cocktail Haven has too much of a golden heart to be an in-between. It deserves love and loyalty and I'm happy to say that it's converted me to become a regular. \n\nIf you've been a follower of the big man Kevin Deidrich, you'll know that this man has not only been a pioneer in SF's cocktail scene, he's been instrumental in setting the scene. He's also been credited to having inventive cocktails at several hotel bars he's previously worked at and even got featured on the Wall Street Journal (oddly enough, not for his bartending skills but for his workout routine!) True to his style, he tends to experiment with less sweet, more complex flavors that really tickles your curiosity. Although, PCH being a tiki-haven, some sweeter style concoctions are on the menu too. \n\nI consider myself a well-researched cocktail aficionado and in my years of cocktailing, you can say, I've seen it all. My palate is now looking for something new, exciting and different. PCH's menu gives me the junkie fix that I've never had before!\n\nDrinks are fun and approachable, like the Lime in da Coconut (salted pistachio! coconut-lychee milk) and the Ko'Olina Swizzle with its orgeat and pineapple notes. This is a tall drink and it's not shy on the rum either!\n\nThere's also geek out cocktails like the Miso Old Fashioned that serious cocktailians will love. It has Miso-butter infused Bacardi 8 rum combined with Pommeau and bitters. It's savory and the surprising creaminess of the faint butter flavor will astound you. If that doesn't, then the proprietary \"PCH\" large ice cube will. Or for the more classic drinkers, their Bobby Burns and Martinis come with a little sidecar, it's like getting two drinks for the price of one!\n\nThe more adventurous should like OH Snap! which highlights sugar snap peas as the main ingredient. (Mom always told you to increase your vegetable intake, right?) or the very aesthetically pleasing Santorini Summer made with gin, cucumber, yogurt liquor and housemade tzatziki sauce. YES. You read that right! the only thing missing is a pita bread ... \n\nNow that I've given you a thorough breakdown of the menu, it's time to focus on how they treat customers here. Whether you come in two's or in a big group, you wouldn't need to fret. They lavished our group with the utmost service: recommending, entertaining and checking up on us. Do you want to bring food? no problem! you can order at Hogwash next door or bring your own. (I HIGHLY recommend Milan Pizza for serious drunk eats! ;-) \n\nThose long work weeks when I have to pull double shifts or work a 7 day stretch and all I want is to go to a neighborhood bar where I won't be ignored for 20 minutes --- I come here. The staff KNOWS that hospitality earns a customer's trust much faster than putting a cold bevvy in my hand.\n\nThat sole reason is why I'm now attached to my bartenders here. And when I get attached, it's for life.\n\n* 2000th Review *", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Yum yum yummy are the drinks! A little loud, but good vibes and cocktails. The owner is really nice. Check out the secret menu in blacklight. Ask bartenders for a blacklight to see it.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Went to their Christmas pop up and it was awesome! It looked like Christmas threw up in the bar. All cocktails were served in different holiday cups. There was a long line to wait in though. I'd like to go back when it's not a holiday bar to check it out. The holiday drinks were great so I'm sure the regular menu is awesome too.  Very close to downtown.", "author": "Makenzi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Met a friend here for drinks after work. A small, but open space with a great vibe. The bartenders took the time to make good drinks and also the waiter was very kind and helpful in explaining the cocktails I would be most interested in. \n\nThey have a good variety of drinks pending on which spirit you would want and they are open to suggesting what drink may be right for you.", "author": "Bori B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "I like this bar a lot. They have a great selections of drinks and a cool vibe. I came here with a group of 5 on a Friday night and the place was pretty full. We were able to snag a table towards the back and all tried a few different drinks. I had the Saffron (a mezcal drink that I highly recommend) and Ko'Olina swizzle, which was also pretty good. I'd love to come back to this place soon!", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "The bartenders are super kind and generous geniuses, masters of mixology, and cocktail superheroes! I can't say enough great things about this amazing place. It's a must go for the Bay Area libation seeker.", "author": "Ahsan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Most amazing cocktails and very cool ambiance! I definitely recommend checking this place out!!!", "author": "Lisa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "We were on vacation in San Francisco and stumbled across this place. The drinks are the best! Not only to they look great they taste amazing! Love the atmosphere and the bartenders were great!", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Came back here a second time. They had the Kung fu pandan, which was pretty good. They should make this a permanent menu item! Also, happy hour ends at 7pm here.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Great service.  Great drinks.  Handsome bartenders!\n\nI noticed that the exposed brick walls held a collection of cocktail books along with various liquors.  Their concoctions are original, inspired and proof that this place loves what it does.\n\"Pineapple\" is a theme that presents itself everywhere.   Multiple brass pineapples sit on the shelving along with the bottles.  It's also part of their logo.\n\nIt's a friendly bar--the bartenders will engage with you. And, it's a nice change of pace as it is also pretty mellow.  The clientele tonight was a professional mix of locals out for the evening looking for a craft cocktail.  I tried a Blinker tonight--rye, raspberry, grapefruit.  Excellent taste and has a kick too!\n\nDefinitely worth checking out if you want to drop out of the hustle/bustle of Union Square when you are there.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Pretty cool place. It's small but there's plenty of seating. They have some crazy cocktails to try, with groovy glasswear. One was served in a wood cup with a lid, the wine was in a cute straight glass, my beer was in a cold stein. The menu is arranged by spirit (whiskey page, gin page etc). Each drink sounds normal enough, but then as you read the ingredients there's one in every entry that makes you say whaaa? \nThe atmosphere is very chill. The servers are polite and patient, it's dimly lit but is good for groups. I'd go back.", "author": "Lindsey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Stopped by here for a drink with a friend. Walking in, the ambiance was awesome - trendy and laid back with lower lighting. They also have a couch and other seating in the back, a nice area for a relaxing time! I was very excited to try the drink called Lime in Da Coconut after looking at photos and reading through other reviews. I was so glad I got this drink because it was delicious although on the sweeter side. It tastes exactly as the name suggests! My friend got a Miso old-fashioned, it was very smooth but we couldn't really taste anything specific that was different.\n\nChatting with the bartenders helped to make my time more enjoyable. They were friendly and were open to talking about the multiple types of alcohol they offer and the differences between the brands. It was awesome to learn about new brands I haven't heard of.\n\nDefinitely a nice place to get a nicely made drink in a relaxing atmosphere.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "\"Your friendly neighborhood bar\" is what how the website greets you. An understatement. \n\nFrom the welcoming and accommodating service (bring your own food, or order from Hogwash next door) to the exquisite, ever-changing cocktail menu, this place is the new hot spot in San Francisco. \n\nThe drinks are creative and fairly priced ($12-$15). My favorites: the spicy Swizzle My Nizzle (Olmeca Altos Blanco Tequila, passion fruit, vanilla, lime, habanero bitters, $13) and the amazingly fresh Ko'olina Swizzle (Banks 7 Rum, Banks 5 Rum, banana, orgeat, pineapple, bitters, $13). I do like my drinks on the sweeter side, but there are plenty of other options on the menu.\n\nCocktail lovers stop by - this is a great spot.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Absolutely loved this cocktail bar near Union Square. My friend randomly chose this place (first time for both of us!) because it was in a convenient location - such a great find! Atmosphere was chic, service was greaaaaattt, and they have a seriously impressive collection of liquor. My friend has high whiskey standards, and he kept making comments about the rare options they had.\n\nWe came on a Saturday around 5:30pm. They have happy hour everyday from 5-7pm, even on the weekends! HH is $10 for the cocktails on their HH list. There were many open seats at the bar and in the back at that time; after ~1.5 hours, around 7pm or so, the bar started getting pretty packed.\n\nMy friend asked for a cocktail with egg whites, and the bartender immediately made him something delicious off-menu. Later, we asked for bourbon old fashions, instead of the miso one, and there was absolutely no hesitation. Great service! The one drink I personally didn't enjoy was the Lime in Da Coconut because it was too sweet for me. If that's your style though, I'm sure it's delicious.\n\nCan't wait to come back!", "author": "Tanisha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Ok. For cocktail lovers out there, PCH is a must.  The mixologist (I wouldn't dare call him simply a bartender) was passionate, intelligent, and an artist. If I had a better tolerance, I would have stayed their all day. We walking in to an empty place right when it opened, 5 pm, to the smell of roasted pineapples. The bar was full next time I looked up and the drinks were amazing and beautiful. The second drink had mushroom dust (no not the magical kind) and pan dam (spelling?).  The combination and the perfume alone made me think about drinks differently. I could right more but I'd rather spend my time driving there to get another drink. (Attached are a few photos which don't do the drinks or atmosphere justice.)", "author": "Don O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "The art in the cocktails drew me to PCH. The drinks are so pretty. Didn't even want to drink it but it's alcohol and you can not waste alcohol. I got the Ko'Olina Swizzle, under the RUM page. It was delicious!! My friend got the Coconut in the Lime with Vodka, so good too. About $12-$16 dollars on most cocktails, pricier but so worth it. \n\nI think I might like this place more than Local Edition. As for the decor, rustic look towards the back. Paintings on one side of the wall and black bricks on the other. Small but good amount of seating.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "Good drinks, small place, nice vibe, but a little pricey. Came in on a Tuesday night and it wasn't crowded but not dead so a good place to grab a drink anh night of the week and be able to get a seat.", "author": "Saleem E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "Came here with my friends on a Thursday night in the city. We were barhopping and decided to stop by this place. When we came here, there were no seats available, the place is quite cozy. No security carded us at the door, so anyone can go in, however if you chose to order a drink they will card you. You find your own table, no one seats you. We wandered around and there were no seats so we were ready to leave, however a table just wrapped up and we took over the seating. Drinks are typical SF prices, especially located in the heart of downtown, this appeals to tourists. I didn't think this place was super interesting or special when it came into the interior decor and design. The drinks were separated on the menu based off of liquor. For example, one page would be vodka based drinks, whereas the next were rum based. Overall, our party of 5 people, we didn't feel anything special about the drinks. It was one of those, oh we're in the city, let's go try it on time kind of places. Nothing that convinced me to return again. Service was mediocre, order drinks, bring drinks, that was pretty much about it. Parking is hard to find, so be prepared to shop around for a spot.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Thanks to Janice C, I finally went to Pacific Cocktail Haven! A group of us got together last Friday, July 22nd around 8:15pm. It was pretty packed so we started out at one of the barrel tables to the left of the back. After we got our first round, a table opened up in the back and we finally had a place to sit down.\n\n*Bobby burns: cutty sark prohibition scotch, sweet vermouth, benedictine, bitters ($12)\n*Blinker: wild turkey rye, raspberry, grapefruit ($12)\n*Saffron: saffron infused montelobos mezcal, campari, grilled pineapple, citrus ($13)\n\nI got the Bobby Burns. A little reminiscent of a manhattan which I adore. The drink was actually lighter than I thought it would be, but I do like my drinks stiff. I am a scotch neat girl after all. Later for our second round, a one of us ordered a Sake drink and I asked for a special Whiskey special cocktail. This was more my style as it was nice and boozy.\n\nSuper fun atmosphere. I've been to Cantina several times, but PCH has a sexier feel. The space is more or less the same, but I loved the vibe. Busy, but it feels a little more intimate. Nice lounge feel.\n\nTheir cocktail menu is extensive, so I can't wait to go back and try more drinks. Or even ask for another specialty cocktail. I did enjoy that last one. I'm already thirsty just thinking about it!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "Right off of Union Square, this bar is a classy and fun place to spend happy hour. We came in on a Wednesday afternoon to find all the seats at the bar full, so we sat in the back booth. Our waiter was friendly and helpful in answering questions we had about the extensive PCH drinks menu. The menu itself was well designed, listing the beverages by liquor type and showing elegant drawings of the drinks. The first drink I ordered was delicious, and the Pimm's we ordered was fantastic. The drinks here are a nice size and are strong without tasting strong (so basically, they're super yummy). Definitely worth stopping by if you're in the area and need some down time.", "author": "Alexis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "I love their Holiday/seasonal drinks! Everything I tried has been absolutely delicious, and wish Christmas would never end so I could keep coming by to try new drinks. My favorite by far is the \"Kung Fu Pandan\" drink which isn't in their menu, but listed as a special on their board. It's light, refreshing, and has a slight taste of savory pandan flavor. It gets super crowded though so be sure to come early (5pm?) or late (9pm!) to avoid the crowd.", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "oh, PCH where have you been my whole life?\nPCH has been on my radar since it's opening a few months ago. My bartender friends were visiting from the east coast and we were able to stop in for some pre-flight cocktails recently before they had to leave. \n\nEntering in, PCH is relatively small. A little table in the window, long bar and some seating in the back area. I can see why this place is poppin for happy hours, luckily we got there early and were able to snag some seats.  The bartender immediately came over to greet us and hand us some menus to look over.  The menu is extensive and well organized. Each page has a different spirit base and a little something for everyone. Drinks are priced around $13+ which I think is pretty average for the quality of ingredients you are getting here. We had the following drinks: Swizzle My Nizzle, Saffron, Ko'Olina Swizzle, and Bay Bridge Buck. Each cocktail was perfectly balanced, tons of flavor and strongggg. \n\nIf only my wallet would let me I would come here on the reg. But, for now, PCH is a great spot to come to enjoy a high quality deliciously made drink and a great addition to the neighborhood. cheers.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Talk about being the new hot spot! I've been getting this place and Pagan Idol confused for weeks. Just stopped by here for after dinner drinks after a double date. \n\nWalked in around midnight Friday and was scared there wouldn't be a seat. It was pretty packed but luckily this bar has a pretty large space once you get past the initial bar area. We managed to be right on time to take over the entire back lounge seats so we could feel like pseudo ballers sitting in the back of a club. \n\nThe menu is extensive and can be overwhelming. The drinks are categorized by alcohol type and they serve giant fountain sized ones for large parties. I got the rum version of the fo shizzle my nizzle or something. Wait it was the Ko'Olina Swizzle. It was huge but think it was mostly crushed ice. All the drinks were pretty good. My friend's drink was oddly spicy and I wasn't into it but she loved it! \n\nRan about $60 for four drinks which is not horrible. Music is pretty loud and it was really hot in the bar. It would've been nicer if they played reggae or something to go with the theme but Top 40 it is.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "PCH is an awesome spot to come for drinks in the Lower Nob Hill. Convenient to Union Square,  they have a huge selection at the bar. However, this place has a limited cocktail menu, with 3-4 drinks per alcohol. The cocktails on the menu each look fantastic, and I've had a couple during my limited stay in the area. The Eastern promises is an interesting asian fusion drink, and you can definitely taste the spice in it. The Oh Snap was also delicious. The barkeeps and the service here was also great, though admittedly I did not come during rush hour.\n\nIf your going to be in the area the PCH is definitely a goto spot to get drinks and hang out.", "author": "Leon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Such nice atmosphere and great drinks. The vibe is as if you are drinking with your close friends at home. Cool people and very attentive mixologists. I ordered three different drinks and had a couple of sips from my friends and they were all almost perfect... definitely suggest this place.", "author": "Rou B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "I'm a cocktail snob who just went to PCH for the first time - and it's already my fav cocktail bar in the city. cocktails were amazing, creative, and had a great variety - especially if you're familiar enough with cocktails to see how they stand out. I hadn't realized the menu was south east asian inspired - which leant everything some really fresh flavors.\n\nservice was great. we came on a saturday afternoon, easily seated, and got table service. our server was sweet and helpful!\n\nthrilla from manila, rappers delight, and pootie tang were all shockingly excellent. banana stand was great too, but maybe a step down.\nthrilla from manila had sooo much flavor - and reads as very tropical. i might have had a hard time guessing it was a whisky cocktail if i didn't know.\nrappers delight was super flavorful too - it was especially well balanced for a scotch cocktail, with tropical and salty flavors.\npootie tang was elegant, floral, nicely boozy.\nbanana stand was a nice whisky cocktail, and the kaluha and sherry blended with each other really nicely, but even though the flavors were unique somehow it tasted closer to other whisky cocktails i've had.\n\nGOING BACK SO SOON", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "Since moving out of the bay area 5+ years ago, I have found that I am nowhere near as hip as I used to be, and that I am far more east coast than west coast at this point.\n\nHowever, when a gorgeous friend wants to go out for cocktails, and is an expert in that area, you go where he tells you to.\n\nThe good:\n\nThe cocktails, naturally.  I had the Swizzle My Nizzle and Pootie Tang, because why shouldn't I pick my beverages based on their names?  Both were expertly crafted and delicious, although I much prefer the Swizzle over the Pootie.\n\nWe sat at the bar and there is a lot to look at- I'm particularly enamored with the Star Wars tiki mugs, although there are others to covet if you're interested.\n\nThe bad:\n\nFor two people sitting at the bar, one of whom is well known in the cocktail industry, the service was...lacking.  It's clear that the set of bartenders are the under-30 set who have not yet mastered the art of growing a loyal guest base by utilizing excellent customer service.  I get that it is relatively near to touristy places and at roughly a billion dollars a drink, that's all they may get, but seriously, why not?\n\nBonus points for the guy who came in with some sort of wrestling champion belt.  Still don't know who he is.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "I had been wanting to check this place out the next time I was in the area. My cousin and I got to PCH about 15 minutes just after it opened on a Saturday evening. We walked right by it at first, as it's easy to miss. There were a few patrons already in the bar, but it was fairly empty. That was the idea anyways, for us to get there early before the crowds that a Saturday evening can bring. We were able to grab a seat right at the middle of the bar. \n\nI'm a whiskey/bourbon drinker, so I went for the Ward Eight, which had Wild Turkey in it I believe. The drink was amazing! Probably one of the best cocktails I've ever had, no joke! I ordered my cousin the Cowfee Twalk. She enjoyed that as well! Tasted like coffee as one might imagine! \n\nI finished off with the Miso Old Fashion. It was a little different than what I'm use to drinking when I drink Old Fashions but it tasted pretty good! It tasted like a lemon cough drop but in a good way! \n\nWe hung out for about about an hour or so and the bartenders were very attentive and I don't remember the bartenders name who made my drinks, but he was very informative about the drinks and kept checking on us. We even share a love for Rye Whiskey's so he showed me one of his favorites that he thought I should try. \n\nOverall it was a great experience and the drinks are top notch! I actually prefer little places like this and the overall vibe. It's a very welcoming cocktail bar that I will definitely be coming back to!", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "If you're looking for a place to grab an extraordinary cocktail and catch up with a friend, this place is for you! Definitely get the $13 \"Lime in da Coconut\" with reyka vodka, salted pistachio, coconut-lychee milk, and citrus. How good does that sound?! I kid you not, it's actually as good as it sounds. It's delicious, but extremely dangerous because you'd want another one right away..\n\nAdditionally, there are plenty of comfortable seating areas. They don't serve food, but you can order food next door (or anywhere else) and bring it in! I can't speak from experience, but I saw someone eating a burger at the bar and asked the employees ;D", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "So happy my co-worker recommended this place. I came here with a girl friend on a Wednesday night and we were both impressed by the unique drinks menu and the variety of drinks. They have a lot of Asian-inspired flavors like pandan, which you don't see too often. Being from Southeast Asia, my eyes and tastebuds naturally gravitated towards the Asian drinks. I got the \"Lime in da coconut\" which was dangerously delicious. There were so many other drinks I wanted to try and I'll definitely be back. Since this is so close to work, this might become a regular thing!", "author": "Joan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "This place is bomb. Their have a big cocktail menu and the drinks are pretty good. They have a nice casual lounge type of seating beside the bar section which is nicely lit up. They are not as good as Trick dogs in Mission, but they are still good.", "author": "Ash M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-03", "description": "The venue is cool but the drinks are loaded with sugar. Had a sip of three different cocktails and couldn't stand them. We asked for something that wasn't too sweet as well.", "author": "Kartik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "every drink is delicious, ya won't regret it. Get the one with the candy cap dust, tastes like fancy af mushrooms but is still bomb", "author": "Melody E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "New favorite cocktail bar. These people are def mixologists!! The server was so friendly and attentive and the atmosphere and music is awesome. I loveeeeeee this place !", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "this was my second time coming here without realizing that i've been here before! i came here about 2 years ago and really enjoyed the drinks. this time i ordered from their charity events drink menu and thought my drink tasted like juice! i forgot the name of the drink but it didn't look as aesthetically pleasing as my other friends' drinks but it was okay haha. the second drink i got was a bell-pepper tequila drink? i felt like i was drinking vegetable juice but it was good! i just got a margarita for my last drink and i like how much they salted the rims of my drink lol. i will be coming back here again!", "author": "diane d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Used to go here when it was Cantina's, but love the place now.  It's nicely lit up inside with a huge lounge area in the back.  Great selection of whiskies.  Not too crowded on a Saturday night.  Bartender, Francis, was very attentive.  Detailed when making drinks.  Not too loud, music was old school hip hop jams.  Mixed crowd.  Would definitely come back to PCH!", "author": "KB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "If you're going to charge $11-$13 for a cocktail, it'd better be good. I met up with one of my friends at PCH on a Saturday night and the place was packed. We couldn't get a table for over an hour, so we settled for the shelved wall near the bar. I ordered 3 cocktails from PCH and I absolutely loved each drink:\n\n- Swizzle my Nizzle: tequila, passion fruit, vanilla, lime, habanero bitters\n- Saffron: mezcal, Campari, grilled pineapple, citrus\n- Bay Bridge Buck: Ketel One Citroen, strawberry-shrub citrus, egg white, ginger beer\n\nThe cocktails are strong, well made, and layered with flavor. The bartenders are also super friendly and give great drink recommendations if you're not sure what to try next. I look forward to coming back and trying more of their cocktails.", "author": "Helen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Amazing amazing team, excellent customer service! The drinks are so diverse, so many options on the menu with great descriptions. The ambiance and crowd is so chill. My husband and I came in on a Thursday night, and the music was perfect. Everything here has a unique, creative touch. Kevin, the owner, makes you feel at home and welcomed. We will definitely be regulars here. Soooo worth the 45 minute commute from our home!", "author": "Lecille P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "The best cocktail in the city!! This is my go to bar in the city no matter which of the town I am in! I brought many friends here and they also loved it! The atmosphere and the decor is on point!!", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Cocktails, staff, service and vibe...AMAZING!!! Hands down one of the best (or THE best) bars in San Francisco. Had the Local Word and Pepitas Banditas recently and absolutely LOVED both drinks. Don't walk - RUN to P.C.H! Otherwise, you're missing out.", "author": "Kalani K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Clearly the owner of this restaurant or the mixologist has ever heard of Snoop Dog. Otherwise they would never name one of their \"exceptional drinks\" the \"Swizzle my Nizzle\"! I'm offended reading/seeing it published in San Francisco Bay Area Where magazine. I will never patronize your business and other people of color shouldn't be doing so either. You might want to google what \"nizzle\" references in the urban dictionary. STAY WOKE!", "author": "Nhp C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "I used to come here when they used to be Cantina. I didn't realize PCH opened here, but PCH's drinks are awesome. I wasn't sure if I would call it a tiki bar though since their menu has a lot more than just rum drinks. \n\nEach page of the menu focuses on a key type of spirit in your drink (i.e., whiskey, brandy, vodka, gin, etc.). They have really creative names for their drinks, and attention to detail is high as they even brand \"PCH\" on their ice. All the drinks I've had were delicious. Bartenders were friendly and drinks came out pretty fast. There are so many other drinks on their menu that I would try so I'll likely be coming back soon!", "author": "Rick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "PCH has a great selection of craft cocktails! Lounge atmosphere and the prices are very reasonable for the types of drinks they are serving.", "author": "Robin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "PCH is an upscale bar minutes away from Union Square known for its snazzy cocktails.\n\nWe arrived around 5 PM on a Friday, beating the crowd by a couple of minutes. When you walk in, PCH seems a bit small, but as you pass the bar you walk into a much more open, roomy seating area perfect for couples and groups alike. \n\nUpon taking a seat, we were promptly greeted by a waiter and given our menus. The menus are organized with each page defined by spirit, and cocktails becoming less citrusy and stronger as you go down the page.\n\nAfter a fair share of browsing and contemplating, I opted for the \"Oh, Snap!\" a super sweet and refreshing gin based cocktails coupled with sugar snapped peas. My friend opted for the Lime de Coconut which was a bit stronger but just as refreshing. Also, shout out to PCH for its cocktail/ice presentation. \n\nAll in all, a great bar to splurge on some creative cocktails and get your fancy on.", "author": "Umeet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Great music! Been exploring the city on my own and popped in here after a solo trip to the color factory! Loved the vibe and felt okay being alone-- if you are single and trying to find places that don't feel awkward to just hang out, this was it for me! \n\nCocktails are expensive- as expected at a cocktail bar :) well worth the coins!", "author": "Leanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Stumbled across PCH while on vacation, had just left Hogwash next door and was on the look out for a good cocktail.  We were lucky to find a spot at the bar and enjoyed a few rounds.  My hubby stuck to his favorite an old fashioned.  They had branded large ice cubes which I thought was a nice touch.  I'm not a big fan of old fashions but really liked the taste and craftsmanship here.  I asked for a custom drink based on flavors I liked and was pleasantly surprised each time.  Had a great time and was happy to have found this place.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Delicious drinks!!! Try the pornstar cocktail!!! So good! Loved the ambience and bartenders were awesome too! They made sure to take care of you quick! If I'm ever back in SF will be sure to check them out again!", "author": "Duran D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "There's not many places that win my heart instantly, but PCH definitely came at me with a swoop.\n\nThe bar is casual, but the drinks are delicious. I love the openess of the place and all the natural lighting. The drinks are well balanced with just enough complexity, not incredibly sweet like a typical tiki/tropical drink. Plenty of seating at the bar, so if you snag one you can watch the bartender to their thing, which I am a fan of people watching.\n\nI think I found my go to spot afterwork!", "author": "Minh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Came in around 5 for Happy Hour and left impressed!!\nThe atmosphere was great and the bar wasn't too crowded around that time!\nPlenty of seating and cozy couches towards the back!\nThe drinks were out of the ordinary and both looked and tasted great!\nDefinitely worth checking out", "author": "Tejal G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "I have probably been to PCH about 10 times, and I enjoy my drinks every single time. What gives this bar a one up on other craft cocktail bars, is that the bartenders are friendly (the ones I have dealt with anyways.) You tend to get snotty, or aloof bartenders at fancy cocktail bars, but that isn't the case here. The bartending staff can make or break a place for me, especially in a neighborhood bar. If I want to grab a drink by myself and sit at the bar, it's nice to deal with a friendly face, and that's what greets you here. \n\nThe drink menu is obviously carefully thought out, and each drink is made with precision. My favorite, hands down, is the Ko'olina Swizzle. It reminds me of a mai tai, kind of. There are two kinds of rum in it, some banana flavor, pineapple, and a few other things. What kicks it up a notch is that it's presentation is really fun. It's served on crushed ice, with a dried pineapple slice and I think a pineapple leaf. And it isn't an overly sweet drink; it has a nice bang of liquor that will make you feel all warm and fuzzy inside. Prices aren't cheap, but that's typical for craft cocktails in SF, or I guess anywhere. \n\nThe atmosphere is cool, pretty laid back. They play pretty good music, and as the night goes on, it gets louder, making for a pretty fun environment.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Very nice low key bar with good drinks. Met up some friends, wasn't overcrowded, quick service from open to close, clean and very nice atmosphere.", "author": "David T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "I absolutely love all the cocktail options they have here!! There is a delicious coconut milk one in the vodka section that is to die for. I could drink 10 of those because they taste so good! I have yet to come with enough people to get a fish bowl, but I definitely need to try it. This place also has enough seating but at times it can get crowded.", "author": "Nicole Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Great cocktail bar. Somewhere in the middle between speakeasy and local dive bar, fancy drinks with super chill vibe. Came here for NYE and had some great craft cocktails. Service was great and prompt and our server was quick to recommend cocktails based on our likes. Great music, great service, great drinks. You can't go wrong here.", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Thank you Pacific Cocktail Haven for making my friend's birthday a great one!  Janice C. chose this easy to miss gem for her birthday.  It's owned by the owners of Hogwash so if you need some eats to soak up the booze you can order some sausages from them and they'll bring it over.  \n\nBobby and Rodney were the first to get there to hold down the fort.  They told us one of the employees was so nice with helping us get a large seating area in the back for all of Janice's friends.  He was also helpful with helping me what to order.  While the Ko Olina drink caught my eye because I love pineapple, Janice told me that it's very strong, so ultimately I went with the Sherry Cobbler which is on the LBV (low alcohol by volume) page.  Drinks here are handcrafted and very creative with mixes of spices and herbs.  I loved my Sherry Cobbler - not to sweet, not too much herbs, and it was unique.  Prices are standard due to location.  Two drinks sent us back about $26.  Next time I'll get a little more ballsy and order something not on the LBV page.  ;). The guys were very sweet and presented Janice with a golden pineapple containing their boozy punch concoction.  They checked on us frequently and totally didn't mind us bringing in some outside pizza and cake.  \n\nIt's in a great location in the heart of Union Square on Sutter.  PCH I'll be back for more!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Funniest story ever. My boyfriend and I had reservations for dinner close by so we had decided to grab drinks beforehand. Lo and behold there are a bunch of bars nearby and I just had him choose a few for us to get a few drinks at. He had chosen this place as our first stop. As we were sitting down, I got a text from Stefanie C. She and I are both avid Yelpers and love trying new spots, but for the most part only send each other spots if we're making plans to hang out. Randomly she sends me a text about a bar because it looked really cool. And it was the SAME bar I was ALREADY in. Anyways, I told her that; we laughed and I decided to put in my Yelp review. \n\nThe drinks here were great. I'll admit I've been drinking less lately since trying to slim down without really working out means I have to cut calories. And the way to best so that is through drinking less.\n\nI got this pineapple inspired drink and he ordered some old fashion inspired drink. Mine came in this cup that made the whole thing look like a pineapple which is super fun and his had a ice cube with the initials of the company on it (PCH). Drinks were delicious and glad we dropped by. \n\nOverall, great vibe and I wish we had a bit more time there. A little dark when you're not close the outside or under the skylight. The seats by the barrels weren't the most comfortable, but still pretty awesome. Great theming and presentation within the drink. \n\nPro tip: pineapple!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "came on a tuesday night around 10pm. it wasn't too crowded which was nice, and there was a good amount of seating between the bar and the back couches. the music was fairly loud, so it was a bit hard to talk and hear. \n\ni got an oh snap! at the recommendation of the bartender. i don't do well with mass amounts of alcohol nor do i like the taste of it, so he took that into consideration (with no judgement, which was much appreciated). it didn't taste that strong, nor did it affect me much, so that was nice. if you want your cocktail to taste like green juice, i'd recommend. otherwise, maybe not. definitely unique though.\n\nmy friend liked her moscow mule, which was super gingery and refreshing. my other friend also really liked the lime in da coconut, whose predominant flavors were lychee and coconut. mmm.\n\nwould recommend for unique cocktails in a casual setting, especially if you're looking for something low alcohol.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Normally I try to steer clear of Union Square because it's so touristy, but this is a hidden gem. As soon as you walk in the bartenders greet you with a genuine smile and hello. The ambiance is awesome; trendy with gold pineapples and dark colors, but not tacky. I got there around 4:30 on a Friday and it was pretty empty so I had my pick of the tables. By 5 it was completely packed though. I started with the oh snap! which was amazingly refreshing and almost too easy to drink. All their drinks looked really refreshing and tasty.", "author": "Sara T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "Drinks:\nThe drink menu is minimalistic with different sections depending on the type of alcohol (which I think more bars should do, it makes it so simple to order!) All the drinks averaged around $13+, which is fair for a bar in San Francisco. I was able to try two of their drinks: \n\nSwizzle my Nizzle\nOlmeca Altos Blanco Tequila, passion fruit, vanilla, lime, habanero bitters   13\n\nLime In Da Coconut\nVodka, salted pistachio, coconut-lychee milk, citrus   13\n\nSwizzle my Nizzle was quite spicy, too spicy for my taste. I felt like the spice drown out every other flavor of the drink, it wasn't necessary terrible, but it wouldn't be my first choice if I were to come back. I did enjoy Lime In Da Coconut! It was super tropical and tasty, I could drink this stuff all day. If you're intro tropical, lighter tasting drinks, Lime In Da Coconut is the way to go. \n\nService:\nBecause this bar isn't over the top packed (visited on a Friday night ~9pm), the bartenders are able to provide great service to everyone. Usually there's an uneven ratio between bartenders and customers but that's not the case at PCH. We were able to score seats at the bar and were promptly attended by the bartender. They were fast and efficient, but not chatty; they are there to make drinks! When our glasses were empty, they were prompt in offering the drink menu once more. \n\nAtmosphere:\nPCH is on the smaller side, with only a couple of seats at the bar. They do also offer some seating towards the back and plenty of standing space. PCH offers a dimly light, trendy atmosphere. This spot would be ideal for a first date because it doesn't get crowded and it's not crazy loud. Only downside is that they share a bathroom with the bar next door...so be ready to wait in a line for the bathroom. Overall, PCH will be added to my list of bars. Def a great addition!", "author": "Stefany Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "I used to work for a guy whose management style was called MBA.\n\nManagement by walking around.  He would walk around the office, with no particular agenda in mind, but just to observe.\n\nI applied that MBA style to one of my post work cocktail hunts, which lead me to PCH.  And what a find.  I just wished they had a whisky list so my poor eyes didn't have to strain to see what was lined up on the wall.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Visited PCH with Sandy B. and we were both impressed by the delicate cocktaill art. The bar is small and we got there at a really good time (around 5:30pm). I always go for Vodka when out and about, this time the same; even I am usually not a fan of coconut, Coconut in Da Lime looks so delicious that I had to give it a try, and I'm so glad I did. \n\nI love how they have the drawings of the cocktails on the menu so I can kind of expect what it would look like. It's a little bit pricy but I will definitely come back again (:\n\n2016040", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Fantastic drinks, friendly bartenders, conveniently walkable from union square. I'd recommend the pornstar martini!", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "*** In Short ***\n\nCozy cocktail lounge succeeding Cantina, with an extensive and varied drink list.\n\n*** In Depth ***\n\nGoodbyyye Cantina, helloooo PCH!\n\nA lot of new bars have cropped up in downtown over the past few months, and, wanting to make sure headway through the ever-growing list of places I bookmarked, my friend and I made plans to check out PCH after work one day. Imagine my surprise when I show up, think to myself, \"this place looks familiar,\" and then realize that what was once Cantina, had now become this new and spacious cocktail bar (Cantina patrons will remember how cramped the place was), with a far, far more extensive cocktail program, from the folks that also brought you Press Club.\n\nNow, was I delighted or disappointed by this development? As far as the venue itself goes, I much preferred the new layout at PCH: clean, slick, and again, most importantly, more spacious than her predecessor. And for those who like variety, PCH's liquor-specific cocktail menu is nothing to shake your finger at. But (and I know y'all expected a but), the couple drinks that my friend and I had all had a rather floral aftertaste to them: as she put it, more plainly, \"their drinks all remind me of potpourri.\" An unfortunate association, to say the least.\n\nThat said, the drinks weren't bad, and there are certainly enough of them that I'll reserve further judgement for a future visit.\n\n***Accessibility Info***\n\nVenue - As with most bars, you'll find a large percentage of the seating here to either be bar counter seating, other high tops, or a lot of standing areas with high top level counters for drink placement. I can't recall if they had standard height tables, but my friend and I found ourselves by the front bench instead, people watching.\n\nBathroom - Didn't use them, but assuming they're the same as Cantina's, they should be accessible.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "SO GOOD.\n\nSorry trick dog, but another cocktail lounge has stolen my heart. I'm so impressed by SF's cocktail scene as it stands but like WOW. This takes the cake in terms of quality, creativity, and selection. I wanted to order everything off the menu. Prices are sort of steep $13 and the setting feels really cramped, which I don't like but it's SF so ... \n\nYou can order food from Hogwash next door if you choose!", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Ooooo I will definitely make more appearances here! I stopped by here with a friend after she got off work to hang out a bit and catch up on a Wednesday around 6pm. The place had an adequate amount of people and all the tables in the back were taken, but there was still plenty of standing room and a couple seats at the bar. Bartenders were very attentive and friendly also :) \n\nThe menu is separated by the spirit used--each page consists of 2-3 cocktails of that spirit listed--super easy to find out what you want/prefer. \n\nWhat we got: \n1) Swizzle my Nizzle: mmm this was spicy and sweet at the same time. This drink came at the suggestion of Miguel, our bartender, and it didn't disappoint! I'd definitely try this one out again. \n2) Bay Bridge Buck: This was probably my favorite--it tasted like a strawberry lemonade. It didn't taste dangerous but I'm sure it was!\n3) Lime in da Coconut: really tasty for those wanting something a bit more tropical with a hint of lime. \n\nThe vibe was pretty chill, got a bit more busy as 7:30-8pm rolled around, but still wasn't overly crowded where it became annoying or too loud. I'll definitely be back!", "author": "Shannon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "Just had some great cocktails made by Francis our bar tender...asked him to do off the menu a spicy grapefruit Margarita ..not so spicy but great flavor ..", "author": "Peggy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "I've been passing by this establishment since I arrived six weeks ago. I finally stopped by. Drinks are A+++ and the staff is even better...and great to look at. #ImMarriedThough", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Love, Love, Love the drinks. \n\nIt was one of those weeks where I ended up at what seemed like almost the same place each day. It made comparing very easy and Pacific Cocktail Haven is the winner in my book. We met for drinks right after work on Friday and I had such a fun time reading the names and descriptions on the cocktail menu.\n\nI started with a Lime in da Coconut, which is one of the tastiest drinks I've ever had. I would like to clarify, though, that I absolutely love coconut milk and that was the star of this cocktail. The drinks are beautifully designed, meticulously crafted, and served in the perfect vessels. For drinks with big ice cubes, they even brand the PCH logo into the ice. How cool is that?\n\nAs we sat there sipping our drinks, I noticed that some people got drinks with metal straws. Maybe I was tipsy but I had straw envy. When I tried a new drink, Swizzle My Nizzle, my date ordered it with a metal straw. I was so happy. The drink was so pretty that I didn't want to ruin it.\n\nPCH is a great addition to the SF cocktail bar scene. The drinks here are original and delicious and the bartenders are friendly. Highly recommended!", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "Another must visit spot. If you're into cocktails you must come here as the drink selection here is phenomenal. Super hip and young you'll find young professionals as well as hipsters from all across the spectrum. prices are standard but hey we pay that for a good cocktail anywhere in San Francisco. Rum heavy and if you go up a big group of friends get one of their giant punch dispenser bowls for sharing. If you go that route, make sure you snag a table.  \n\nDefinitely another good places for bar hopping in FiDi/tenderloin", "author": "Diane T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "If you're a fan of cocktail bars, you could walk into PCH and think \"It's another cocktail bar, what's the big deal?\"  Then my friend, look closer.\n\nLook at the ice cubes.  They are perfectly clear. \nLook at the bar stations.  They are cleaner than some hospitals.  \nLook at the glassware.  Every drink has it's own cup.\n\nThe attention to detail and organization is just the starting point.  Owner Kevin Diedrich uses  chronic OCD to his advantage.  The attention to detail doesn't just stop with the setting-  each of his award winning cocktails are carefully and expertly made by Diedrich or one of his very capable bartenders.  There's a cocktail for any mood, and any of the staff are happy to help you find the one that is right for you, either on or off the menu.  The staff is always going to go out of their way to make sure that you have a good experience.  If you're a fan of craft cocktails, then try to go in at a slow time to talk shop with the staff.  They are all very knowledgeable about spirits.  \n\nRemember back ten years ago when you used to use Internet Explorer and didn't understand what the fuss was about this Firefox browser?  Then remember how you switched because your nerdy friend made you, and then a week later you realized that you could never go back?  Well, consider this review your new nerdy friend, and PCH is your new way to browse San Francisco cocktails.", "author": "Hiland H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "4.75 stars While San Francisco is certainly known for sporting some of the best cocktails in the country, there is no question PCH is in the upper echelon even for what this city offers in that regard.  Their modern updates on classic cocktails are certainly appealing but perhaps the best drink I've ordered here was an odd number featuring sugar snap peas (the oh snap!).   Other drinks offer extraordinary attention to detail -- you may notice that even their ice cubes are branded in certain cocktails.  Travel downstairs and instead of a bathroom you may stumble into a dance party.  And on the main floor, you can either sit at the bar for quiet conversation or perhaps snuggle next to a date in the cozy nook with a tiny table meant for two.  \n\nI don't live in SF but I certainly wouldn't be above judging a local if they didn't enjoy this bar.  Highly recommended for locals especially within the neighborhood.  For non locals, it's probably best if you have 1 to 3 friends looking for a casual evening with exceptional cocktails.", "author": "Yelper N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Just like Tom Cruise, this place is all Cocktails and Dreams!  The decor wraps you in a delicate ambience that makes you feel that you have already been here.  The drinks are far beyond superb, even Trump and Hillary would get along and have a great time here.  \nCome for drinks stay for more drinks!!", "author": "Doug S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "These guys know wat they are doing and they are doing an amazing job. I would give them 6 stars if I can. Their coctails are must try I mean all of them, seriously. It is a very cool experience to watch the staff preparing your drink and stamping the ice. It is not only the show but the drinks are very balanced, flavorful", "author": "Fikret D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "This place is awesome. If I could give it 10 stars I Would.Not only is the atmosphere awesome, they were playing Fleetwood Mac when I walked in. I had a Pimms Cup which was absolutely delicious and beautiful. And the icing on the cake was that they use stainless steel straws instead of plastic straws which are much more environmental. I will be bringing my friends here.", "author": "Colin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "I think i found my new chill spot. At first i didn't know what to expect when i walked in . This is one of the few times i didn't check the reviews before going to a place. At first glance i was like this joint is nice and laid back. So the crew and the big seating area in the back and was immediately greeted by one of the staffers. He brought us a few menus and told us about a few of his favorite drinks. I have to say this dudes selections were on point. So we placed our orders and started chatting up a storm then realized the music. When i hear that old school music i get pumped nothing beats some old WU Tang playing in the background. That totally caught me off guard that's a true sign of a good night. Then i hear the drinks are here the drinks are here and it's go time. I can not remember everything we ordered but each drink came out good as hell. Those are the kind of drinks that will definitely get you in trouble later and a lil trouble isn't a bad thing. i have to say my two favorite drinks were the Swizzle my Nizzle and the Pootie tang! if you are reading this and need a cool place to have drinks this is it. The ambiance and the staff are just amazing!", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Great little bar.  Top notch service, attention to details and some really awesome drinks!", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-14", "description": "Went here on a crowded night. The bar is a unique small space but the bar tenders took FOREVER to make a drink. I didn't even order something so unique or hard to make. I know it was busy but c'mon! they couldn't even remember who's drink it was when they were done - I had to flag the guy down. I would come back as long as it wasn't crowded. Or just order a beer.", "author": "Ruby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "This place is just fabulous. I came here on a Saturday night to celebrate my good friends upcoming nuptials and Francis was our bartender. He was friendly, attentive, and clearly very passionate about the cocktails he creates. One of the ladies in our group was expecting so he made special virgin cocktails for her. He also made me a special drink towards the end of the night that would help alleviate any ill effects I might encounter the following day! \nThis bar is on the smaller side, but the decor and ambiance are very unique. The bar is very large and well stocked, and the music was on point. If I still lived in San Francisco I would be returning regularly!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Wowzers amazing craft cocktails and a hip vibe to boot! We will absolutely be back again and again!", "author": "Maggie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "PCH is such a hip little cocktail bar with great service and really unique drinks. I love the simplicity of their menu and how there are exact drawings of each drink. \n\nBartenders are very friendly and actually care about serving you quality cocktails. The first time I came here, I learned about the differences between tequila and mezcal. Our bartender also made my boyfriend a drink on the house when the first drink wasn't exactly what he had expected. \n\nThe ambience is definitely trendy and I think it would be great for first date drinks! It is pretty small and doesn't have a lot of seating, so you might have wait at the standing bar for a seat to open up.\n\nrandom: they have a little collection of Star Wars (and maybe also Marvel? I can't remember) themed tiki cups collecting above the bar. I thought this was a cute touch.", "author": "Estelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Great cocktails and ambience. Long lines in Fridays, though. otherwise is a great place to meet with a friend, have a cocktail and catch up.", "author": "Lorely G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "Pretty Crap Hellhole\nTLDR: This place is absurdly over-priced to the point where it is basically highway robbery, making it essentially a bougie tourist trap.\n\nIf you are a San Francisco native, or generally reasonable person, then you will appreciate this review. Forget all these hipsters saying this is the best place for a cocktail-- it is a place where you can spend $15 to convince yourself it was worth your time to stand there while the bartender pours 20 things into an insultingly tiny glass which comes out tasting like... nothing? This place is basically for pretentious douchebags who want to drop alot of money to fill the empty hole inside their souls.\n\nA note on the decor: though it was cheerily decorated for the Holidays, I think it's very clear that it epitomizes the neo-SF bare bones yuppie aesthetic we have come to see so ubiquitously. Like, think of something better.\n\nBYE.", "author": "Marie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "This is one of the best cocktail bars I have ever been to in the whole US. From drinks, high quality mixers (gin and tonics are made with Fever Tree as an example) exquisite bartenders and friendly atmosphere. It is the perfect place for\nA night out in beautiful San Francisco.", "author": "Sergiu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Amazing bartenders that will take the time to get to know what you like and make something that you will love and have likely never heard of. Patrick was great and made \"a quick\" drink into three or four. Great people and drinks if you want to find something new or just have a comfortable, familiar drink.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Saw that this spot was a little bit newer with some good reviews and decided to check it out. When we first arrived it was a little busy for such a small space but they really made the best use of the area they did have. It's nestled in between some hotels and other bars so it's easy to miss and walk past but please if you're in the area, stop by and check it out. The decor, service, and drinks are all amazing. We browsed the menu for a little bit and there were a lot of drinks that caught our eyes. The bartenders are very attentive and even though it was busy they noticed that we didn't have a drink or menu in our hands and waved for us to come get a menu so we could order. Even though a lot of the drinks had a lot of different fruit components in then they were by far not weak. You really get what you pay for here. We ordered the cocktails according to what we thought were weaker to stronger and it did not disappoint. Tonight was the first night I actually had an egg in one of my drinks and it was delicious. The sesame seeds on top really made a difference. If you chewed on the seeds it added a whole new and interesting new depth to the flavors. It gave it that nutty buttery flavor kind of like peanut butter to a drink that tasted like creme brulee. Overall this bar is a must go to and I will definitely be back to visit. Everyone there seemed happy and had a smile on their faces. The music was a nice mix to the atmosphere. Greatly enjoyed our time there.", "author": "Camera P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "As lovely as Cantina seemed when I was shoulder to shoulder with sweaty young trendsters waiting to get a drink, I love the fact that I can have something at PCH previously unseen from my experiences at Cantina: space to breathe.\n\nBar dude Kevin Diedrich (Burritt Room, Jasper's, BDK) and Sidecar Hospitality are the masterminds behind this hip joint. Drinks are great, and I especially love that there's one named after my hometown beach are, the \"Ko'olina Swizzle.\"\n\nService is friendly and not at all pretentious. Very comfortable space. \"Haven,\" indeed.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-14", "description": "Definitely a very cool place and the cocktails are original. However, they are not particularly delicious and for how expensive they are they are not very strong. Won't be back!", "author": "Vv V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Great place to sit and watch talented, friendly mixologists at work.  My test of a great bartender is telling them what I like and don't and seeing what they come up with.  They did a great job here.  Pineapple is the star of the show so try to order something with the sweet citrus as a featured ingredient.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Came here on a Friday night and were able to find a seat for 6 people immediately. The wait staff was really nice and came back periodically to ask us if we needed anything. I got the \"lime in a coconut\" drink and it was good but definitely a creamier drink and heavier. Also ordered a vodka tonic and it was good and heavily poured. Would definitely recommend to anyone looking for a cool place to grab a cocktail.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Great Cocktails and Great place to people watch. Must go to this exciting Bar. Had a blast!", "author": "Renee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Amazing drinks and bartenders!!! Wouldn't change a thing and everyone must try their cocktails. Sooo good and will come back anytime", "author": "Kym R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Fun amazing spot in Union Square to enjoy tiki drinks. Prices are reasonable, great service, fun atmosphere.", "author": "Trekforbeer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "Great place to get drinks after work, although pretty crowded. Best for smaller groups of less than 4. Also, be prepared to stand. There is some seating in the back but hard to come by. \n\nI was pleasantly surprised at how awesome my cocktail was. I got the \"Oh Snap\" with gin and sugar snap pea and absinthe. It was sweet, strong, refreshing and overall delightful!", "author": "Jamie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-31", "description": "Cute little cocktail bar with inventive drinks. Wasn't crazy about the 4 I tried (my wife had 2). They have one of my favorite beers on tap, which I liked too (KSA). Prices are on the high side of SF, but still reasonable.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Thrilla in manila is to die for! Good luck finding this drink anywhere else in the world.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "We came here shortly after they first opened, and found the cocktails to be less than stellar, and decided we didn't need to come back. But we recently heard that their cocktail menu got revamped, and had to taste for ourselves! We were super impressed with both the drinks we got, and had we not had plans afterward, would have definitely stayed for more. I had the \"Stop and Smell the Rose\", which was a fabulous and refreshing summer cocktail.  J. had the \"Tuk Tuk Tea\" drink that had thai tea in it! The drink was a seamless blend of the familiar Thai Tea flavor and the alcoholic taste of a cocktail. Would 100% go back.", "author": "Lydia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Ladies-Infested Place! To be expected with cocktails in the name and an awesome pineapple as the logo. \n\nTHE BAR: It seems small looking from the outside, but there's more table seatings for small groups and two large group tables. as you past the narrow bar area. As you past the bar, the lighting does go darker and kind of made it a way too romantic ambiance. \n\nMENU: All the cocktails looked enticing! (Check online for their menu if you want to see ahead of time). \nSwizzle My Nizzle: My friend's go-to. She likes sours and this was perfect for both of us. \nKo'olina Swizzle: Reminds me of the tropical drinks I had in Hawaii. I tasted the pineapple and appreciated the fruity notes. \nLime in Da Coconut: Serious dessert. Creamy with the coconut-lychee milk. Wait, does this really have alcohol? Oh, Vodka? ... okay, just checking. \n\nPRICE: Beware with cocktails, you can easily go from one - two - three to what? And with the pricing at $13, that bill can go high for my wallet. I would make this my go-to for a drink before dinner. if I ended up staying there longer, I might as well get the punch bowls that they offer fitting for 5-8 people.", "author": "Casie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "You are missing out out on a unique experience if you do not go here. Crowded, but all the good places are. With that said fast service and spot on old fashion! Giant punch bowl drinks are one of the specialties and we're fun to watch them make drinks", "author": "Steve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Why even mess around with other cocktails in SF? This is your mother ship if you enjoy booze crafted into artistry!", "author": "Travis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Pretty good drinks! Very attentive waiter. And it's nice that you can also order food from next door. Only downfall was just how cold it was even when we were all the way inside even after a few drinks!! But besides that, it was a pretty good experience.", "author": "Nadia I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Went here for a casual meeting and the ambiance and sound levels were perfect for chatting. Drinks were unique and the servers were very helpful.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "This spot became our favorite cocktail bar in SF, while on vacation from New York City. Not overly crowded, good music and solid drinks. The bartenders were very friendly and did a great job.", "author": "Tri W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "Came here with two of my girlfriends to get cocktails. We got a little lost on the way there and as a result came in with a minute to spare before happy hour ended (it runs from 5-7pm). Our waiter was very nice though and allowed us to order from the happy hour menu. Walking in we loved the ambiance until we tried to read the menu and realized we practically needed flashlights. One friend had the single village hi-ball, the other had the Normandy hi-ball and i cant remember the name of mine but it had root beer in the description and tasted like black licorice. My drink was fantastic but my friends village hi-ball was dreadful. She sent it back once, but felt awful considering they'd been so nice to accommodate us. The second one was worse than the first but she politely drank it.  It was not our scene and we will not be returning, but I could see the draw for a more hipster crowd.", "author": "Kelsey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Awesome vibes and great tropical drinks that aren't too sweet. Go with a group and share a punch!!!", "author": "Sophie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Very good drinks. Good service and attentive. Highly recommend if you are wanting a good craft cocktail.", "author": "Scott A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "I went here for their special themed pop-up that they had over the holidays.  It was very nice and the decor was really good.  They gave you the option to buy the drink glasses there too and I got a cute Santa one.  Not sure what it's like \"off-season\" but I imagine pretty good.  Great service too.", "author": "a f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "As a NYC resident for 6 hours, I had my fair share of cocktails at the Pegu Club and Raines Law Room.\n\nStopping in on a Wednesday night, the place was pretty popping and the vibe was pretty chill.\n\nA crucial aspect of a cocktail bar is the bartender and all three of them were very nice and accommodating. The one that served me was Miguel and he previously worked at Pianos in NYC and puts a lot of effort and passion into his craft. He also took the time out to go over several notable drinks on the menu.\n\nThe drinks I had were Swizzle My Nizzle and The Fourth Regiment. Both were perfect for my taste as I do not prefer drinks too sweet.\n\nGreat spot.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "PCH, affectionately named after the most beautiful highway in California (as I like to think), is modest in appearance, and dynamic in drinks. PCH takes the best elements of \"tiki\" bar, and makes everything its own (PCH is not a tiki bar - no tacky tiki-ness here). The drinks are island inspired, and there are a few tiki statues on the bar shelves, but that's about as far as it goes. I came here early on a Saturday night (just after 10pm), and there was a decent crowd, but definitely comfortable for someone who doesn't enjoy super crowded or super loud places. The crowd is mixed in age, and the music was a good mix of 90s and current r&b/hip-hop. I tried a few of their rum and whisky drinks, and the definite winner was the Ko'Olina Swizzle, but the Tuk Tuk Tea (thai-tea inspired) was a strong second. The tartness in the Ko'Olina made for a bright drink. Most cocktails here are $12-13, and I don't recall seeing anything cheaper, but you get what you pay for here. PCH keeps things casually cool - great place to meet up with a few friends (larger seating areas are limited), or take a date. Cheers!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "I usually drop in here for a night cap after slowly bar crawling home. They have a great drink menu and whisky concoctions are great. The Bobby Burns is one of my favorites because not only do you get a cocktail but you get a second portion. It's like two drinks in one!", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Delicious unique cocktails served in beautiful glasses. There is an eclectic mix of music and people with the place starting to buzz at around 9:30PM. Tip: Get a seat at the bar; the bartenders are friendly and watching them craft cocktails is both fascinating and captivating. I'll definitely be back!", "author": "Erika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Amazing cocktails, great ambience and overall, a great place to spend your evening. We were on a date and couldn't have asked for a better evening.\n\nCocktails of special mention- oh snap, saffron and deja vu.\nCocktails to miss- vodka in da coconut is on the sweeter side, if that's not your palate.", "author": "Priyanshu J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Very cool space, great decor, great drinks and friendly bartenders. You can get food from Hogwash next door ANOTHER awesome spot!", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "I checked out PCH last night with a group of friends, and the reviews were mixed. \n\nPros: I loved the vibe and decor. Our server was great, too. \n\nNon-pro #1: We tried three of their custom cockails. Two of them were pretty sweet, which isn't really my jam. The third was just not good. So not good that my friend actually ordered a different drink. Our awesome server happily obliged, and didn't charge my friend for that drink. \n\nNon-pro #2: The music was good, but REALLY loud. Like, \"too hard to hear your friends even when they're shouting\" loud. \n\nI'd definitely give this place another shot, but will be more careful with my drink choice!", "author": "Connie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Love love love this place!!! So different and amazing. The quality of drinks is insane. So much time and effort is put into making them. Each drink I tried was amazing and the service was just lovely. I will definitely be back!!!", "author": "Micaela N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "Cocktails are okay. The place fills up later in the evening and isn't all that comfortable. You can get a sense that they are trying to be creative with their cocktails, which is a positive for sure. Nonetheless, the drinks we ordered felt like they were not very well balanced.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "I rarely give a place 5 stars. I love this cocktail bar. The drinks are inventive, delicious, and unpretentious, just like the staff ;)  I love the ice cubes - they know what's up here. So much more relaxed and fun than the Gen Gen room across the street. I'll be a regular.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "I like this place. It has a good vibe. \nThe music is good but quite loud\nThey had some good choice of cocktails \nI tried 2 cocktails - blinker and saffron\nSaffron had a smoke pineapple which gave it a weird taste.\nBlinker was good. \n\nThe bartenders are so good. They made me a cocktail  with my choice of alcohol which was not on the menu.", "author": "Prashanth V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "So so so good! Great service and great drinks! Music selection was on point and it's really chill and vibes were perfect for a drink or two. Intimate setting for sure", "author": "Daja W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Tremendous. \n\nDelicious cockatails. That's the best way to spell that word. Love the location. Tried a few different bevs recommended by the bartender and enjoyed the trip down creative cocktail lane. Fave had rum and a cayenne sugar rim.  \n\nAsk for Kevin. Because he rocks. His drinks are best in the city.", "author": "Jeremi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Been going here for a long time (before it was reopened as PCH). Love the atmosphere. Very chill and fun, not too loud, and the crew is very nice. Drinks are all very tasty also.\n\nWould highly recommend for a casual drinks w/friends or for a date.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "I think this place is run by a mad man. There is wallpaper on one wall that is amazing. and exposed brick on the other wall, also amazing. He must not of been able to make up his mind if he liked wall paper or brick and decided to have both. \n\nThe menu is a assault on the senses! So much to read and see and taste, really too much to read, I am not a big reader. There are offerings from #Gin, #Whisky, #Brandy. (I am using # right). My personal favorite was the Bobby Burns. A scotch cocktail of a rare delight. I think everyone should drink this scotch cocktail featuring Cutty Sark Prohibition #whisky. A whisky of fine elegance and distinction.\n\nThe #beer is great, they have Field works on draft, my personal favorite brewery in the bay area. And make sure not to miss the bottle water feature. They bottle their own water, very fancy for a bar. Most people just put it in a glass in front of you. Not his mad man, he puts it in a bottle for you! So classy.\n\nThe food was amazing as well. Try the candied cherries or the brined olives for a unique small bite experience. If that is to heavy for you ask for the shiso salad. Hand picked shiso served inside of a cocktail glass! and it comes with Rum and lime as well. If you are feeling a little religious and really who isn't these day go for the Monks Buck. A cocktail experience like i have never had, well except for the wine in church.\n\nLast but certainly not least, this owner must be a super nerd with terrible taste in sports. He has superhero coffee cups all over the bar. Star wars soda glasses full of straws, when I asked what was in the cup and if i can drink it they said nothing... I was very confused why a cup had so many straws with no beverage. I also saw a Washington RedSkins mug, by far the worse sports team in the history of sports. This is all forgiven because everything else was 5 stars.\n\nAll in all this is an amazing destination for anyone who is looking for 5 star cocktails, 5 star service, 5 star beer, 5 star wall paper, 5 star bottled water, 5 star whisky collection, 5 star bar top, 5 star glass ware, 5 star 5 stars.", "author": "brian m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Cocktails are really delicious and the bar tenders are very nice.  This is a good chill spot to have a drink or 2 before going out.\n\nThank you for making me a happy Jew!!", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "I like artisan cocktails and they deliver. Extensive menu, incredibly friendly bartenders, and they all really know their spirits. Our bartender explained to us the difference between rye and bourbon and I appreciated that. Always a wonderful time here.", "author": "Cathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Cocktails were delicious and fancy-pantz.  They actually stamp the bar initials into your ice for several cocktails with a brand!!!  And though the bar was crowded and busy, the service remained speedy and friendly.  Prices were a little high $13-14 for cocktails, but that's not unusual for SF.\n\nProbably the only negative is no hooks under the wall bar to hang your things, so everyone's jackets were rolled into balls on the counter leaving little room for drinks.", "author": "Sasha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Really fabulous drinks - spicy Swizzle My Nizzle and refreshing Oh Snap. Think it was the owner serving us, really nice and attentive and was fun to have a seat at the bar to watch him work his magic. Lots of creative drink options. Nice ambiance and decor. Also really liked the fancy metal straws.... I'm sure there is a fancier proper bar term for these but I shall dub them fancy metal straws for now. ALSO the ice cubes are like what???? So cool how do they get them like that? Big rectangular one in Oh Snap.. saw the bar tender branding ice cubes in another drink. Lots of attention to detail, A+!", "author": "Katie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "The crafted cocktails are not something you will get anywhere else I have been in the city. Talk about a cool ambiance with the dark brick and the alcohol climbing the bar behind the stations. Everyone in here was helpful and the clientele were fun to talk too also. If you can get a spot in the back don't let it go!", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Great place to get your craft cocktail on with friends. Attentive service with an unpretentious, and laid back atmosphere.", "author": "Kimi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "My friend and I had a moment of confusion when we walked through the door of PCH. We definitely had been there before, but the bar had a different name and a slightly different vibe. I recognized the same bar manager as before, so I knew I wasn't totally off my rocker. So yes, PCH has an updated vibe and a more tiki-focused menu that what it was before, which is a plus. The decor itself is a little mismatched and lacks a cohesive feel from space to space, but overall a very inviting environment. We stood at the counter along the wall for a bit, waiting for space at the bar to open up. I was disappointed that there weren't wall hooks to hang our jackets and bags. \n\nThe first cocktail that I ordered was the Blinker (rye, raspberry and grapefruit) and my friend got the Kingston Crusta (rum, maraschino, ginger, citrus, cayenne, bitters). Both drinks were served in beautiful glassware, but I liked the taste of the Kingston Crusta better. Thankfully as we were finishing up our first drink, two spots opened at the bar and we grabbed them. By this point (6ish), the bar was starting to fill up. For our second round, I ordered the Naked Mai Tai (rum, combier, orgeat, and bitters) and my friend got the Eastern Promises (gin, cocchi rosa, black pepper, lemongrass, bitters). Again, I liked her drink more than mine. The Naked Mai Tai was STRONG and I had a hard time tasting the distinct ingredients. However, the ice cube in my drink was very impressive (they somehow managed to get PCH onto the ice cube with some kind of stamp/brand. By the time we finished up our second drink, the place was packed and we were ready to find a more quiet (and less expensive) place.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "Very rude security with an attitude. First time visitor, I was waiting in the line to join my friends at the bar. He made me feel like I don't deserve to be here. And I came to spend my money. Won't ever come back again", "author": "Schroen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "This place is a must for a great cocktail! Amazing bartenders who have honed their craft to perfection! If you don't stop by you're just stupid!", "author": "Denny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Cool little Tiki style bar, be carful it fills up during the weekend. \n\nThe bartenders are very knowledgeable here. After ordering a few cocktails from the menu we decided to have them make a cocktail of their choice off them menu. After a few preference questions they made some pretty amazing drinks.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Made me an excellent Old Fashioned, Wisconsin-style. And so cute during the Festichristmahannukwanzakah season.", "author": "Matte E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "The coconut lime drink is da bomb!!! Great drinks and great ambiance. Probably gets packed on weekend so come early!", "author": "Penny Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "We were greeted right away with menus (even while it was pretty busy) the drinks are fabulous, fresh and the service is quick and very friendly. What more can you ask. My advice, sit at the bar so you can see the bartenders make their masterpieces with the drinks, it's truly impressive.", "author": "Kristin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "This place is awesome! Incredible drinks and even better customer service. I've been here 3-4 times now and the bartenders couldn't have been more friendly each visit. After one or two cocktails it can get a bit pricey but these are quality drinks! Great place to stop for a one-off before dinner some night.", "author": "Charley A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Extremely impressive! My drink pick is the Ward Eight. Not only was Miguel our gracious bartender, he was also an artist while mixing these amazing drinks! Visiting from Ohio but I will return just for this bar. :)", "author": "Leslee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Drinks are phenomenal. Atmosphere is great. I recommend sitting at the bar so you can see how the drinks are made and chat up the bartenders. All the bartenders were incredibly nice, attentive and answered many questions asked by my husband and other patrons sitting at the bar. The music is great. It was a bit loud but at the same time did not take away from the conversations I had with my husband or the bartenders. \nThese are not your typical craft cocktails. You can tell the bar staff take great care and consideration in creating these delicious concoctions that are not typically found in a craft cocktail book or bar.", "author": "Rene R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "A beautiful place: intimate, candlelight, strong drinks, comfortable couches, engraved ice, and creative glassware. I will have to come back to try out some more of the drinks. However, I must say that the prices here are steep, but it is Union Square, so I can not complain much. Great mixology skills here.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "The cocktails here were pretty unique and tasty. I'll definitely visit again. They don't serve any food though.", "author": "Uma N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "We had a great experience here on a Friday night. We were able to get a table in the back and ordered two drinks each. The waiter gave great recommendations when I described the type of  cocktail I like.", "author": "Carrie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "I love this cocktail bar.  It really is one of the best in the nation.  Every cocktail I've had there has been crafted carefully with style, grace, & attention to detail.", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-14", "description": "Chill vibe, fun drinks, good times. The bartenders are nice. One was showing me how they make the miso butter rum in-house.", "author": "Mila C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "One of the newest bars to open in the city. We opted for the ko'olina swizzle and the swizzle my nizzle. Both of these cocktails are super delicious! Definitely recommend this place for a fancy cocktail night! The only thing I dislike is when I received the bill and noticed they charge tax on top of the menu price! Other than that, I wouldn't mind trying a few other drink options in the near future.", "author": "EccentricAura A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "The cocktails here are delicious and are carefully crafted by the bartenders! The menu is quite diverse with unique ingredients that you won't find at other cocktail bars in the city. Each time I come I try to order different drinks, and I am never disappointed. If you like cocktails, this is definitely the place for you!", "author": "Roberta V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Miguel is the absolute man. After a long conversation and plenty of explanation of the drinks here, we got the miso old fashion, oh snap and the lucky melon. They were absolutely outstanding. If you are looking for something trendy with some crazy talented bartenders this is the spot. If I could give it 10 stars, I would!", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "I give this place 3 stars just because to me it's neutral. They ONLY serve cocktails, no food. The reason why it wasn't anything special is because the drinks were a little too unfamiliar for me. The place had a good ambiance tho.", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "ambiance//*****\nbar up front is set up properly\nsmall lounge area in the back...yay comfy seating!!\nand i think there is a basement floor that may be negotiate for private events...or so i'm told\n\nservice//*****\ntheir crew is fairly attentive and very pleasant\nwe were there for a good hour or so....never feeling rushed\nthat and they kept checking on us so we just kept ordering\n\ndrinks//*****\noohlala~ menu of adorable drinks look like a sketch of a design to be experienced in person\nwe ordered a few and not only were they visually beautiful, they were all delicious af\n\nmy friend had some girly drinks like ka'olina swizzle, swizzle my nizzle, and lime in da coconut \ni had the blinker and my hands down favorite mum's the word...both drinks were good but mum was so pretty i had to IG that \n#icegame strong says something when i don't even like ice in my beverages\n\npoint being whether you like them light and fruity or strong and simple...they have everything\n~*~\nif you're attached to the previous bar, it may take you a while to come around like my friend\nor if you're like me...be an equal opportunity drinker ;p you won't be disappointed!\n\nthx to Hao L. for being my barhopping buddy!", "author": "Donna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Super nice bartenders, amazing music (so that in itself deserves 5 stars alone, and...just come and drink the \"Lime in da Coconut\"...so yummmmz.", "author": "Clarissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Our group had an Oh Snap!, Lime in de Coconut, and the big Winter Cup. I noticed the bartenders making customers' drink with care, and I really liked that. The staff was very friendly and I felt that the bartenders were genuine with their craft. All the drinks were on point tonight, thank you!", "author": "Miguel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "PCH, your drinks are strong, and your bartenders are knowledgable. Your patrons are also hilariously hitting on people while in various states of massive intoxication. Thank goodness your bouncer is also hilarious. It will take you a while to get to the bar, so be patient. The bartenders work quickly, but they're crafting lots of different drinks - be kind, they're doing a great job. There are two reasons why I'm giving this place 3 stars instead of 4 or 5. The first is that, even for a hipster craft cocktail establishment, this place is insanely expensive. It's $90 for a bowl of punch, whereas even at Whitechapel, you can get a bowl for $50-60. The second is just the ingress and egress. Whoever put this place together, and said the bar would be in a prime location where it is, should not get another job. It's impossible to walk around this place without bumping into numerous people. I like the drinks, the music, and the ambiance, but I'll pass on coming back. There's nothing that I can't find elsewhere at a lower price point.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Great decor, amazing staff, absolutely unique selection of complex drinks with astonishing flavors. They have a selection of Japanese Whisky like I've rarely seen! great time!", "author": "Alexandre V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Great place.\n\nGet there early, this joint is jumping!\n\nReally well done drinks... artful. \n\nThe decor is upbeat.\n\nIts worth the wait.", "author": "R C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "Expensive drinks filled with ice and a small shot of Alcohol. Order an over priced beer to at least kind of get your monies worth.", "author": "E K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Had a really fun Mai Tai twist which had no citrus. Kevin and Adrian were super friendly. Amazing to see how much the space has been transformed from the old Cantina days! Looking forward to popping by more often!", "author": "Zachary T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Awesome spot. Friendly staff and more importantly delicious drinks. I will definitely make this a regular stop because all that tequila isn't going to drink itself.", "author": "Traci V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Kevin Dietrich strikes again. #nailedit", "author": "Maggie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Been to PCH a couple of times now. Great unique drinks. Maybe a little Asian influence there with some of the flavors! My favorite drink there has been the \"Cawfee Tawlk\" not sure about spelling, but it's supposed to be \"Coffee Talk\" with an accent. Haha. Vodka based drink, and it's damn good! Might be the drip coffee they use? Bottom line, delish. My go-to drink. I believe we have ordered food from Hogwash and have been able to eat it at PCH? Perhaps since they share the restroom area space. Fun times here, but it was a bit loud so if you wanted to have a decent conversation, perk them ears up and project your voice! One thing about this bar is that since it shares the restroom space with Hogwash, it can be a bit of a wait to use the toilet. Just a head's up! And it's nothing fancy either so don't expect much. See ya again next time, PCH!", "author": "Mariel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Creative cocktails, super friendly staff, dim lighting, great music.  Wasn't much else I could ask for. Had a great time, now one of my favorite bars.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "We ordered one of their enormous fish bowls. It was delicious and served more people than the menu even said. The only think lacking here is atmosphere. It was a little bland and it's a fairly small place so make reservations or come early to get a seat at the bar.", "author": "Carey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "the menu is kinda short but the ones i tried tasted really good! interior is cute too :)", "author": "Yeonhwa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "This place is truly a haven for delicious drinks. One night- 6 drinks later, and not a single one that we didn't like. 6/6 approval rating, 5/5 stars, all in all this place is the new spot to tell your friends about. Don't let the unconventional ingredients deter you from a worthwhile experience. A whole egg, matcha, yogurt extract, sesame seeds... just go with it and find out which one you like the most.", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Just had the most delectable libation. A feast for the eyes and the palette longs for more.", "author": "Silvanita R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Had the saffron, a mezcal and pineapple cocktail. Really great cocktail for a reasonable high quality cocktail price, 13$ I think. Bartenders were very quick and happy to make the cocktails. Good atmosphere early in the night around 730ish.", "author": "William S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "I've been here a few times now and really like the drinks.  However, last time we were sitting at a table,  the waiter asked us if we wanted another drink.  We said no, and he came back in a few minutes, took my drink I wasn't done with and gave us the bill!  Really unprofessional - I know you want to get another party at the table, but please let me finish my $15+ cocktail first.", "author": "whatever I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Some of the best cocktails in SF. The staff is courteous and attentive. Intimate seating for groups in the back. only drawback is that it's a smallish place and gets pretty crowded on a friday night. If you come during the off-time though, the staff is happy to help you select your drink and chat about their scotches (great selection).", "author": "Mark M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-29", "description": "Loved the small bar feel, decor, and ambiance. But dang - over priced small drinks. Even my beer was small. For $14 you'd think the martini would be served in a full sized martini glass. Right?", "author": "Jack C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Great ambiance. Great drinks! Bartenders definitely know what they're doing. Must try if you're in San Fran", "author": "Brenda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Awesome drinks! Hands down the best cocktail place in SF right now. Super balances, creative recipes and they're pretty strong :)", "author": "Priti P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "My favorite cocktail bar in the city! The bartenders are friendly and knowledgeable about all drink options. PCH has a well done and diverse drink list, but it is simple enough to follow. The menu gives you a description of each drink and a physical depiction of it as well. You can tell that they really put effort into every drink. I mean, they probably have over 5 different types of ice to perfectly fit any given beverage. They take care of all of the details, whether that be placing a perfect garnish or literally branding one of their over-sized ice cubes with their PCH logo! The only real problem with this place is that you'll feel the need to try everything before you go! Good for both first date drinks or a place to hang with friends and have some fabulous drinks. Current favorites are the Swizzle my Nizzle, Bay Bridge Buck, or Classic Moscow Mule; but really everything is worth a try at this place! I'll definitely be back... again", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Delicious, adventurous cocktails in a beautiful space - plus a friendly and unpretentious staff with none of the hipster 'too cool for school' attitude you find at so many other bars in SF! When we found one of our drinks too sweet, they immediately struck it from the tab and replaced it. We liked the Swizzle my Nizzle, Santorini Summer, and Shizo Delicioso. Would definitely recommend!", "author": "Lara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Love this bar.  If I could live downstairs I would.  Extremely creative cocktails, friendly for all types of palates.  The punch bowls are beautiful and so is the staff.  One of the most welcoming and hospitable staffs in the city.  Sadatay my dammies.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Came for an after work drink and was pleasantly surprise by their bar program.  I had the swizzle my Nizzle and the habanero bitters went perfect with the tequila base drink.  Had a some heat but just the right amount.  Nice balance drink!  Didn't get a chance to try any others but will be back for sure.  This place use to be the Cantina which I went to once and the lay out hasn't changed much.  Lower level was closed so I didn't get a chance to see what's downstairs.  Will be back as there was a few more drinks I wanted to try.  I give this place a thumbs up!", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "Really like this place. It has a good vibe. \nThe music is good but quite loud\nThey had some good choice of cocktails, will def come back with a group", "author": "Suzie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Drinks were great. Our bartenders were friendly and helpful in finding places to visit during our road trip. Love the decor. \nWill be coming back next trip to San Francisco.", "author": "Jenya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "I was blown away... This spot is amazing and and a must go to.... If you are into great drinks, great service and fine details...", "author": "Maricel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-06", "description": "I like the vibe of the main room, although my god the restroom is terrible. But the bar has a nice feel and the bartenders and staff were very nice. Drinks were ok. Too sweet for me as a whole, but could be promising and maybe we ordered the wrong ones. But I bet that most of the drinks are pretty sweet.", "author": "Amjad S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "The music is so loud you can't speak. I asked for a zombie and the bar tender didn't know how to do it, so he used an app to make it. It was nothing like the cocktail it should be and they charged me randomly for 18$ for a little glass of something which I wouldn't call zombie...", "author": "Zoltan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "I always measure the quality of a cocktail bar by how perfect they can make the world's first cocktail, the old fashioned.   Hence the name.  It's the gold standard.  It needs to be made in the tradition of a clean and neat drink.   The way George Washington would have made it.  This Is usually how I order.  \"Make it like George would have\".   Proper attention to detail is the only way to differentiate, since the ingredients are so basic.  Rye, simple sugar, bitters, orange and lemon garnish and ice.  I've had them with muddled fruit, seltzer, cherries etc..  To me those additions are mere distractions and disqualifies the establishment from further patronage.   \n\nLet's break it down.   At PCH  each element of the old fashioned was made to perfection.  I'd say it was the best one I'd ever purchased, even better than my own.   Starting with the right glass(low tumbler), they add clear ice that is cut on-site to fit the glass, they even \"stamp\" the ice PCH with a special tool while making the drink.  The right amount of rye, bitters and sugar is added into a glass beaker.  It Is stirred not shaken within a generous amount of small ice cubes to achieve maximum chilling. This is critical, it must be small ice cubes that have more surface area then large ones.  This ice must be very cold to the point where it feels dry so as to NOT water down the cocktail.  Then they rim the glass with fresh cut lemon rinds.  It can't be pre cut because the lemons loose their essence over time. They start drying out when left out on the bar.  They pour the cocktail into the low tumbler to 2/3 full. This is critical to keep the lemon and orange scent persistent while enjoying the drink.   Just awesome execution.   A+.", "author": "Doug D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Amazing cocktail menu. They take mixology to a whole new level.  Super enjoyable old school music too.", "author": "Vanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "GREAT cocktails, solid vibe but not a place to come in a hurry. The drinks are all carefully crafted so understandably take a while to make.", "author": "Whitney T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "I love the way the menus are laid out by alcohol type. You can also have food brought in from Hogwash next door. Cocktails are a little out there but great!", "author": "Kate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "amazing cocktails with great bartenders who are super talented and attentive to the drinks they're creating.  its a great space and low key vibe with great drinks.  definitely stop by! its a really amazing bar.", "author": "F S."}
