{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Happy hour, from 4pm to 6pm, is great. Their menu changes; on their current menu the pulled pork slides, mussels and meatballs are best. Their flat breads are good and light on your stomach, but heavy on your wallet (a bit expensive for what you get.)\n\nService is better or worse depending on whom you get (as is usually the case). I'e had great service and not so good service in the same visit. I was served a bad piece of meat, in half of their fried chicken sandwich and when I mentioned it to the waitress, all she could do was say, \"I'm sorry.\" You know what should have happened and so did she.\n\nIn summary: their a good neighborhood hang out, but inconsistent; no culinary landmark, but not a bad place to drop by and have a drink.", "author": "Tushar N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-14", "description": "I live two blocks from Palmer's and was really looking forward to it when it opened. Been there about 4 times, twice in the first year, then after a long gap due to the mediocrity of the first two tries, we've tried it again twice recently in the last 6 months (last visit on 10/4): unfortunately I've never had a solid experience here. \n\nThis past visit, had the bacon-wrapped, roasted trout: it was overcooked/dry, and dry ... and did I mention overcooked and dry? Also served with a large pile of forgettable veggies. Definitely not a $26 entree by any measure. Every other experiences here was similar, not even really hitting for average and priced above it. It's strange because I find Leopold's is consistently solid for the German-fare that it serves and its the same ownership group. Bummer.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "I met a friend here for drinks on a Tuesday evening. They were busy and it had a nice buzz. This has a classic feel, I loved the cozy vibe, colors and the oil lamps on the table. Not a big fan of the animal taxidermy displays though.\n\nEnded up sitting outside by the heaters so we could have a conversation without yelling. Good drinks and appetizers.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "okay, this ambiance is AMAZING. I truly feel like I'm in Paris when I'm out on the patio enjoying a cocktail. Ever since I moved here, this has been my \"go to\" spot. \n\nDespite the service subpar to put it mildly, the patio and mussels kept me coming back. \n\nTo be honest, after tonight I don't think I'll go back. The service was worse than usual. The server only refilled my water upon my request and I had to ask for more drinks and flag him down each time. He left the table for over an hour without coming back. If they are THAT busy, they need to hire more help. Without getting into a ton of detail, the waiter that works the cocktail area on Friday nights is an entitled prick in my opinion. He's lazy and gives lousy service. Tips are based on performance and I refuse to leave 20% just for the sake of social norm. I waited tables all thorough under grad so I have been there and I get it. \nThey recently changed their supplier for the mussels as well and they are fishy tasting and I won't be ordering them again. If I do go back, it will be for a cocktail only.", "author": "Jillian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "LOVE sitting in the sun outdoors at Palmers! They have overhead heat lamps too! Friendly bartender and service! Great HH selection! I recommend the fries - crispy, tasty and delish! I had the moules which were huge, but I didn't care for the red tomato soup because I prefer the white wine sauce. Bread was warm and had toasty crust too! Paired it all with 2 glasses of Sauvignon Blanc. Just love sitting in the sun outdoors and watching city life go by... :0)", "author": "Aaa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "Charming French-like Bistro along the Fillmore Street corridor.  Intimate indoor seating and great outdoor patios setting.   Feel like one of the Cafe on the streets of Paris.   Good selection of food and drinks.", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "I was surprised at how good the cocktails here! The food isn't anything to go out of your way for, but this was conveniently located across the street from the Clay Theater, so we pre-gamed here before one of their midnight showings. There is definitely a loud, happening vibe here on Friday nights. \n\nRESERVATIONS: We made reservations just a few days in advance online (8 people, 9pm, Friday). They were very flexible and let us sit late, when only 3 of us were there. Our group filtered in slowly over the next hour, and we had basically a private booth in the back (there was a curtain that drew closed around it!\n\nTHE COST: $211.11 before tax/tip for drinks and some dishes for 6 people.  Overall I felt their food was overpriced, but the drinks were fair. \n\n* Bee's Knees cocktail ($12) - 4.5 stars\nDelicious! Refreshing, well-balanced, not overly sweet.\n\n* Penicillin cocktail ($13) - 4 stars\nI rarely like scotch cocktails, yet this one was really well made, with a good balance of flavors. \n\n* Spicy meatballs ($16.75) - 3 stars\nNot very impressive. Meatballs were dry, sauce not particularly memorable. \n\n* Filet of salmon ($26.75) - 3.5 stars\nDecent, but expensive for the quality.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "Was shockingly surprised. The decore is quite comfortable, dark, lots of wood. I was there on a Wednesday and there was a surprisingly jumping bar scene going on. At 8:00 I had no issue securing a table for 3 for my friends and I.\n\nService was excellent. The waitress and maitre'd were both friendly and prompt. Food was shockingly good, I don't know if the chefs were just on tonight but the Devilled Eggs were delicious and original while the flatbread made a filling and tasty appetizer.\n\nThe real winner was the duck ragu with gnocci, it was meaty, delicious, rich and filling and I almost kept eating after I was full. We paired it with the mussels which had a very delicious sauce/broth and were fresh and large. With 5 drinks, food, and a decent tip it was about $50-$60 each.\n\nRecommended.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I came here on Valentines Day for dinner with my friend who lives in the city. We had a reservation which is probably a must on Valentines Day. My friend came here previously and loved it, so I figured it would be really good. We ordered wine to start and then got the vegetarian version of the gnocchi and then a side of Brussels sprouts with no cheese. Dinner was amazing! I was so impressed and loved every single bite. I would 100% come back next time I am in San Francisco. The waitress was also nice. I'm pretty surprised by the amount of negative reviews I see on this restaurant because I really enjoyed my experience here. A lot of people are saying this place is only for drinks, which I don't agree with because the food was amazing. The vibe of the restaurant is also really cool and unique. I loved the red booths and photographs on the wall.", "author": "Angelica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Stopped by here for a unplanned family meal. Great choice !! I went for the pan seared herb chicken\nEntree. One of the nicest meals I've had here. the chicken, veg and mash - cooked to perfection ! Great drink selection and great service - I will be back!", "author": "Alice M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Wonderful restaurant found via other Yelp reviews. Fun exterior and greeted by the hostess who opened the door and greeted us warmly. Water was delivered to table as we sat. Great cozy atmosphere without being on top of eachother. Food came quickly and as described. Nice experience and would return.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Homemade desserts and great tasting food all cooked to perfection !  Saturday and Sunday brunch is wonderful!", "author": "Areli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Great time, great service at Jazz Fest.  Food was fantastic, drinks quick, server was wonderful.  5 star.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "A neighborhood gem. Palmer's has a large contingent of regulars and repeat customers that love: delicious food - hand crafted cocktails - a staff that treats you like family - affordable prices ~ all wrapped up in a classic San Francisco Victorian. The deviled eggs here were the best I've ever had- the mixed beet salad was fresh, delicious and big enough for two. The sage gnocchi was amazing & the steaks here are better and bigger than what most chop houses offer - at a fraction of the cost. A warm & cozy interior presents an inviting setting for a truly memorable dinning experience. Al Fresco dining is also an option if the weather is warm. Palmer's is the complete package.", "author": "Armando C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "One of my good friend came and visited. We had about 10 people in our table. The food was good but the service we had was impeccable. Our server was so accommodating and patient!", "author": "raimundo t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "We couldn't recommend this place more. The food was great but what took our experience over the top was the service we got for our waiter, Ray. \n\nWe stopped in right before closing hoping to get a bite before heading back to the hospital where my family member was having emergency open heart surgery. As you could imagine we were tired, frustrated, and most of all hungry as we'd been in the ER all day. \n\nThis is where we met Ray. He greeted us warmly and made us feel so welcomed. Asked about our day and was genuinely sympathetic when we told him about what brought us in. From there he made a point to ensure everything we needed was taken care of. He ensured for a brief moment, we could take our mind off what brought us to the city. We didn't order a lot, a burger split between 3 people, but he treated us like we were ordering the whole menu.\n\nIt's not often you meet someone who makes such a big impact in such a short moment but that's what Ray did. He was absolutey the highlight of our day and are so thankful to have had such an amazing experience here!", "author": "Mary D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "We stumbled in here on date night, looking for new places to try. We decided not to stay for dinner because immediately the experience was off to a bad start. We weren't greeted, and finally when he came (15 minutes later, I mean seriously I sat there staring for what felt like forever) it was \"what would you like\". Simple and nothing more. \n\nBiggest complaint was the fact that we always received food before our drinks. Such a let down. And one of the drinks was forgotten for 20 minutes, and then randomly slid onto the table watered down. No acknowledgement of the fact that my boyfriend had to wait 20 minutes for his scotch. \n\nThe food was bland, we ordered a kale salad- came with some other lettuce. The sauce was pretty nice actually. But the leaves were too tough, they should have sat for a moment to soften. \n\nThe drinks were strange too. You could barely taste the alcohol in one, and it tasted like there was just pure sweet lime juice and nothing else in my Parisian bouquet. \n\nThe truffle fries were actually pretty good. But the only person around the whole time was the bus staff. The bussers were fast, on top of things, and more than happy to grab us anything we needed (water and sauces and stuff) because the waiter was never around.\n\nDeviled eggs were the worst. I don't know who's idea it was to combine all those random things, and put green oil on it, but it was GROSS. \n\nFunny enough both tables next to us we're also not pleased- and one gentleman said the bbq sauce with his ribs tasted like pure ketchup. \n\nThe hostess would seat a table and it would take about 10-15 min for people to get greeted. \n\nWe came in for a drink and app and the experience ended up taking an hour and a half. It makes me sad. Just a little more detail and intention and this place could be really great. \n\nJust maybe encourage your wait staff to say a \"welcome in, how are you?\" here and there. Sometimes personality can outweigh ALOT OF OTHER ISSUES. \n\nAlso- the faster you are to get the liquor to the table, the more likely people are to spend. Buzzed means you order more. He probably couple have got 2-3 more drinks out of us had that been the case. Booze = money.", "author": "Sierra B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "Food was mediocre. We received almost no attention from the staff even though the place was not packed.", "author": "Leeor N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "As my friend and I were searched through Yelp for a spot to grab some post-work snacks and drinks, it wasn't a surprise to see Palmer's sitting atop our search on Yelp.  In practically every one of their reviews, the words \"happy hour\" would come up.  Which suited us just fine since a good happy hour on Fillmore was exactly what we were looking for!  And apparently, if I was ever going to check them out, it should be for happy hour!\n\nStepping inside of Palmer's, it almost felt like stepping back in time.  Harry's down the street has a similar \"old San Francisco\" vibe, but it's much stronger here.  The wood paneling, the light fixtures, the metal studded leather furniture, the mounted animal heads perched above the bar...all of it adds to that retro sort of feel.  Fortunately, the menu didn't look have the same dated look, as it offered a solid mix of starters to choose from (much needed, current photos below).\n\nHappy Hour: Daily, 4-6pm\n- Food Menu (as of 10/2016): (https://www.yelp.com/biz_photos/palmers-san-francisco-2?select=tv6UHw1o3Kbry3XObB698Q)\n- Drink Menu (as of 10/2016): (https://www.yelp.com/biz_photos/palmers-san-francisco-2?select=wLL2AX3eJ2LhDp5IIP71VA)\n\n-- PIMM'S CUP - Pimm's No. 1, Cucumber, Lime, Mint, Ginger Beer...$8\n(https://www.yelp.com/biz_photos/palmers-san-francisco-2?select=wbNh8nKZy-vwBBPRzDNOgQ)\nIf you've never had a Pimm's Cup before, it's like a cross between a Mojito and a Moscow Mule.  Sadly though, this wasn't as enjoyable as either one.  I don't know if it was the Pimm's, the ginger beer, or the mint, but the drink had a weird tinge to it that took some getting used to, in addition to being a bit sweet.\n\n-- DEVILED EGGS...$2.50 (2 Pieces)\n(https://www.yelp.com/biz_photos/palmers-san-francisco-2?select=4MqBa2OUADGOWatmWWA0YQ)\nI love deviled eggs, but ironically, I actually liked the rest of the components better.  That's not to say the egg was bad though; it's just that the taste of the yolk portion didn't amaze.  However, I liked the bacon and jalapenos, as well as the pickled onions, as they added salty and acidic elements.\n\n-- CURRIED FRIES...$4\n(https://www.yelp.com/biz_photos/palmers-san-francisco-2?select=TqDh3aQj_BXT3uO4r_IgTA)\nWhile it didn't have a strong curry flavor specifically (rather, it just wasn't what I expected), this was great!  Not only were the fries cooked to the perfect crispiness, but they were seasoned really well (not heavy handed, but enough to pack a punch).  I'd definitely recommend this.\n\nGiven how little of their food and drinks we tried, I can't say with a ton of confidence how Palmer's ranks overall.  However, after skimming through their dinner menu online, I can see why everyone says happy hour is the best time to come here.  From what I can tell, a lot of the same starters can be had, but at notably lower prices (though still kind of pricey compared to other HH menus I've seen).  In any case, Palmer's may not be a bad bet...for happy hour, at least.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Rude bartenders - completely absorbed with cleaning glasses rather than serve customers.   This place is busy due to location, but never ceases to disappoint...as a local neighborhood customer - along with our friends - we've decided to embargo because of the consistently indifferent service.\nRecommend going to The Snug across the street - great drinks & team that appreciates customer.", "author": "Dennis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "After a nice stroll along the Marina, my friends and I decided to eat here for lunch.  Always passed this place heading to work and never tried it till this day.  Parking is very difficult in the area because of all the shops and businesses  around.  The host wasn't as friendly as she should be... sat us down on a table without a wait.  Our waitress was very friendly and engaging.   Hubby and I shared the chicken ceasar salad and the chicken sandwich.  The chicken caesar was not our favorite that day... chicken was very dry and more dressing was definitely needed!  The star of the day was their chicken sandwich...it is probably the best chicken sandwich we've ever tasted!  It had this aioli that made the sandwich so tasty and the chicken itself was very moist!  Besides the not so friendly greeting we got at front, we'll definitely come back just for the sandwich!!", "author": "Erna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-12", "description": "Atrocious service:\nSat outside enjoying the sunset.  No hosts/esse in sight. \n10-15 minutes go by. \nWe get menus from another customer. \nWait staff working the table next to us makes no attempt to even say hello. \nWe waive hands to no avail. We sit there, relaxed, with empty glasses from the previous dinners and a dirty table.  By now, we are joking that it reminds us Paris years ago when service was usually crap.  My friend is from Stockholm and is shocked how bad it is. \nI go inside and the place is 2/3s empty. No reason to be so bad. \nIt's a lovely place. I'd give it another try.  \nThe table next to us had a much better server, but she messed up their the order. When the bill arrived  for them, items that were not ordered where still on the tab. Every time the guests need help THEY had to get up and search for the servers. It was as they could not be bothered with the sidewalk tables ( maybe drinks only = little tips = who gives a f... ).\nManager REALLY needs to get more involved, their fail.", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Stopped by for a quite bite and wine on a hot summer day. The cold wine with deviled eggs enjoyed outdoors under the shade was a perfect rest after walking up and down the many shopping spots.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Whenever we are in Pac Heights we like to stop by this place! The cocktails are awesome and that staff is always cool. If you're more in the mood for drinks, they have a cocktail section in front which is usually pretty busy and fun!  \n\nFor cocktails, we especially love the sayulita and the boulevardier. Last time, our server recommended us the doctors order which was also great! \n\nI've had a bunch of food here, but the burger and the gnocchi are both awesome. The servers have been on point with their recommendations which is always nice too.", "author": "Rita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "I took my children on a week day for happy hour after school. It was a warm day, so we sat outside and were served promptly. We ordered the pulled pork slider (single portion for HH); fries; the meatball and the bacon Mac and cheese. I have to say that the quality was really good for the price! We all left full and happy. We may go back to have something on the dinner menu next time.", "author": "L. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "Interesting spot for a drink but did not order any food. Most dishes looked extremely heavy. No wait on a weekday evening.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "After coming across some crazy wait times for brunch in the area, we stumbled upon Palmer's. Who knew they served brunch in this tavern? There is a dark wood & creepy taxidermy theme going on. On the plus side, there were a lot of large booths. It was early in the afternoon, so we were one of the only people there, but we were just glad to be seated quickly and get fed.\n\nSmoked Salmon Benedict, smoked salmon on hash brown:\nThis wasn't really a smoked salmon Benedict. A couple strips of smoked salmon sat on top of a potato cake wedge, which almost tasted like focaccia. \nThe poached eggs were cooked well with very runny yolk & soft egg whites, and seasoned with some chili powder and chives. They were sitting on top of sauteed spinach and English muffins. It was pretty good!\n\nBrioche French Toast w/ strawberry mascarpone, mixed berries & Canadian maple syrup:\nFour slices of buttery brioche toast were accompanied with berries & powdered sugar. The best part was their housemade strawberry mascarpone. It was plenty sweet, so it didn't need maple syrup, in my opinion.\n\nOur friends ordered eggs and toast with a bunch of sides. For a side of bacon, they sure give you a generous amount. It looked like about 10 slices of crispy. A side of sausage includes 2 grilled sausages, which is also quite a decent size for a side. \n\nOur unexpected brunch turned out to be pretty satisfying. If I were in the area, I'd try Palmer's again for some appetizers or bar plates & drinks.", "author": "Joy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "I went here on a Friday night and was looking forward to a fun dinner with friends. The service was great, which was not the issue. Unfortunately, I was the only person in our party to have the \"Demons on Horseback\" (Bacon Wrapped Prawns, Cucumber Salad, Salsa Verde). It should have been called \"Demons on Toilet\". I got food poisoning and was up all night releasing the \"demons\". When I finally came around Sunday night, I had enough energy to call the restaurant to give the manager a heads up. I wanted to give them the benefit of the doubt because they did receive a 94 out of 100 health score, and alert the staff about the prawns. The hostess was apologetic and promised that the manager would call when he/she was back. I never received a call back. I am truly disappointed with the managers and more disappointed with the lack of cleanliness from the kitchen. My friends and I will regrettably not be coming back to this establishment. No use wasting your time here if the food is poorly handled and the managers don't care about the well-being of their patrons.", "author": "Thomas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Enjoyed a tasty New Year's Eve beverage at Palmer's. It was a fun spot to pre-party before heading over to our friend's NYE soiree. \n\nMy friend had a Chardonnay, and I ordered the Sayulita (a mouthwatering medley of tequila, green Chartreuse, and some other tasty ingredients). It was a damn good (and strong) drink! Perfect way to kick off the night's festivities.\n\nPalmer's really seems to have found its stride. Looks like the neighborhood has totally embraced this tavern. It's a more mature alternative to Harry's Bar down the street. This is where the adults come to eat and drink. It's definitely more my speed.\n\nI'll be back for sure!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Still my favorite in Fillmore. I love the garlic truffle fries, the burger is one of the bests ever and what about the deviled eggs?? I never have enough!!\nEverything tastes better with a Palmer's punch in my hand. I just adore it. It's pure perfection.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "Came here after a meeting with a few coworkers for happy hour. We ordered a few things off the menu to eat family style, and got a few drinks. The atmosphere is pretty cool, is very.... masculine. Dark woods, deep reds, taxidermy animals on the walls. Service was ok, but the food was pretty great. I would totally go back again- for happy hour. Not full price.", "author": "Morgan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "The plates at Palmers were dirty when we got our food. The service wasn't that great. I did like the atmosphere though. The dirty plates I couldn't get past.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-10", "description": "Low quality food at pretentious prices - all sizzle and no steak. Decor is nice and bar is well serviced but food disappoints. My chicken was dry and my daughter's salad was overdressed to the point of being inedible. Lastly one of the bartenders (young, salt and pepper hair) was downright creepy - bad jokes, sour demeanor, wouldn't leave my daughter alone. Overall nice setting for a drink (IF you can get the right bartender, the bald one was super sweet) but dinner not worth it at all! Blech!", "author": "Judy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "I really like sitting outside and having cocktails but I wish they would take down the dead animal heads above the bar inside. So creepy.", "author": "Ess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "This place has such an awesome vibe to it.   We stopped in for dinner and the place was hopping.  Super cool vibe.  They didn't have a table right away for us but said it would just a short time.   The hostess helped us find a seated at the crowded bar which was cool.   Drinks were outstanding and the service was so quick and top notch especially considering how busy it was.   We had a paper plane and a doctors order.  Both were great.  The hostess informed us our table was ready ahead of the time she told us which was nice (though I could've hung out at the bar all night.  \nDinner was incredible.   We started with the mussels which were served in this amazing tomato and white wine sauce. Then for dinner we had the trout and short rib.  We were thinking of some other options but the server highly recommended these dishes and we're glad we listened. Service was stellar and we again took some recommendation on glasses of wine that were spot on.  Can't wait to come back.", "author": "Jamie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Our favorite go-to neighborhood place. Great happy hour, fun service staff, and excellent drinks/food! Can't beat the atmosphere, location, or prices. We love Palmer's.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Palmers is the best. Doug is the best. Not only does he know the menu but he created several of the best drinks on the menu. And he recommends custom drinks and that hit the spot. Come to Palmers for the best cocktails and best ambiance.", "author": "Tessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I was in the bay area and was in the Pac heights area visiting from San Diego.  This bar is great very cool! It has a cool old school feel.. Long story short is that i had such a good time drinking anchor IPA that I forgot my cell on a table or something. A week later back down in SD I get a email from the owner asking me if I lost my cell.. I tell him yes, give him my address and 3 days later my cell is at my front door via UPS..  I have lost lots of phones throughout the years and never had one returned after a night of drinking.. For that I thank the owner and his crew of employees.  It says alot about the place.. Thanks again and cant wait to visit in the future!", "author": "Brett P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Disclaimer: This review is exclusively for the front bar. Palmer's is a gem. As a happy Pacific Heights resident, I actually find it difficult to find restaurants or bars that are on my wavelength. My friends cheekily remind me that I've been living in the wrong 'hood and should be in NoPa or Hayes Valley. That said, when I finally stopped by Palmer's the other night with some friends I was relieved to know there's a place on Fillmore I'd happily return to. My two friends and I wanted an early evening cocktail to end our weekend. We went in around 7 PM and sat at the bar. We were quickly greeted by the bartender and he provided us with menus. You can order food at the bar as evidenced by the well-dressed gentleman who sat next to me savoring a hearty meal. But, as I mentioned, my party was there for a cocktail party. I ordered a Parisian Bouquet which had gin, elderflower, lime, grapefruit, and basil. It was refreshing and bright. You also have a choice of vodka instead of gin. My friend ordered a delicious chardonnay from their impressive wine list (On a related note: he'd been to Palmer's before and found it charming the first time.) His boyfriend ordered a scotch-based cocktail which he enjoyed. We sat there for a little over an hour and during that time the bartender checked up on us twice to make sure we were good with drinks and whatnot. I appreciated that he maintained his distance but was still attentive -- so few know how to strike that balance nowadays. Another bartender rang us up on the way out and she too was delightful.\n\nThe overall restaurant is handsomely appointed: rich colors/fabrics and rustic tavern-like lighting and mood. The ambiance is lively but not painfully loud nor crowded. In other words, it's bustling but you have elbow room. The clientele (at least that night) is a mixed bag of older neighborhood sophisticates, 40-something couples in classic Ralph Lauren, handsome men and lovely women wearing Patagonia, and 30-something ladies in Scotch & Soda-like attire enjoying beverages and juicy gossip. \n\nPalmer's is now on my list as a go-to spot for a laid-back environment appropriate for friend time.", "author": "James Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "This review is for the bar only, I didn't have any food (but it looked good). Excellent atmosphere, a real old timey feel and look to the place in the best possible way. The staff was all very friendly and welcoming and the drink I had was terrific. The service was good despite it being very crowded (jazz festival weekend). The drinks are not cheap but they're very high quality and if you're a whiskey fan their list is extensive.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Mac n cheese... bomb!\nMussels dish... bomb!\nCame across this place at Fillmore Jazz Fest one year and we couldn't remember the name but we found it again and we are fans of this place... yummy food!", "author": "Mindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Nick is the best server! He's so present that there's never an empty glass or a check waiting to be run. As an ex-server myself, I am super impressed by his stellar attention to detail and strong interpersonal skills. If he wanted to work in corporate, he'd probably do amazing there as well. Just sayin.", "author": "Emyli V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "How many burgers have I had in my life? Embarrassed to say in the thousands and probably tens of thousands. This one was one of the best. Get medium rare and really anything on it because it will be good and the burger will be the star. I can also say this is one of the best omelettes I have ever had at brunch. You literally can't lose here and one of SF, no the worlds best. Owner Albert - well done!! He also co-owns Leopolds where you also can't go wrong. Getting back to the burger - perfect meat, perfect soft brioche, perfect condiments and avocado and cheese.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Took my daughter and her friend to this neighborhood restaurant. Great service perfectly cooked steak and reasonable prices. Love the red leather \"clubby\" interior", "author": "John K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-27", "description": "Unacceptable. The Radicchio salad had NO avocado, NO blood orange, NO goat cheese, NO pistachios and NO pomegranates. $15 for just Radicchio. I've been a repeat customer for years but I am tired of restaurants reducing their portions and quality to cut costs. Please don't serve this $15 salad if you are going to give customers a plate of Radicchio.", "author": "Ashley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "Friendly service and pretty decent food.  I especially loved the fries which were crispy!  The ambience is great too.", "author": "Siv L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Came here for a drink after dinner at Troya on Fillmore (highly recommend).\n\nI ordered a delicious gin cocktail served up - just how I like it. \n\nThe server kind of seemed in a rush to get us to pay so she could leave but not a big deal. We had a great time and both loved our drinks!\n\nSuper busy on a Thursday night around 10 - pleasantly surprised!", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Palmer's has one of the best and most generous charcuterie platters I've had. Some charcuterie platters are disappointing with just a few slices of meat but their charcuterie platter has heaps of cured meats. At $20, I think it's a screaming deal. The only other food I've had is the burger which is also really good. \n\nPalmer's is a great spot for a casual drink, either at one of the few tables out front on a warm afternoon or at the bar inside. They also have a great happy hour with select drinks and nibbles at $5 until 6 pm - not sure which days but definitely seems like it's M-Saturday!", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Hard to believe I've lived in the neighborhood for several months and just discovered the Palmer's cocktail menu! This is a great spot to come for drinks with friends with a wide variety of creative cocktails available. Plenty of seating after the dinner rush and not too noisy. Will have to come back and give the food a try.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Apparently I did this wrong.  You're only supposed to drink here, and only during happy hour when you can get great deals on food.  Mea culpa.  I brunched here, late on a Saturday afternoon, without first reading the yelp instructions:  happy hour happy hour happy hour.   \n\nBut let me tell you about brunch.  \n\nThe inside was dead as can be and, as a result, looked like a completely inhospitable place to brunch unless one sought alone time with one's newspaper, a bloody mary, a stiff cuppa joe, and food.  There's a market for that and if you're that market, welcome to Palmer's.\n\nThere's several sidewalk tables which bring you a little more up-front and center with humanity and signal the onset of a good time.  Of course I brunched there and since I'd done no reconnaissance my expectations were low.  The result?  A tasty fennel sausage omelet, good home-fried potatoes, oft-refilled coffee, and a perfectly chilled bottle of Rosé.  Another dish, an exuberant breakfast flatbread, received a similar stamp of approval from my tablemates. \n\nPalmer's isn't trying to be the latest thing which probably accounts for the reason it'd never before wound up on my radar.  But often, one just wants brunch, and not from the trendiest spot in town.  Palmer's is nice looking inside and serves up a good brunch and, apparently, a great happy hour.  Tuck that fact away for the next time you just want a solid meal and drinks without needing to book a reservation months in advance.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "Waited 10 min to get a seat, it took 30 minutes to NOT get the drinks we ordered, and our server gave ME shit. This place is an epic fail", "author": "Tauasa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Solid food, friendly service and a good pacific heights spot that is the locals for the most part.  It rarely gets run over by the Marina people, and it has a great neighborhood vibe.", "author": "F S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Very pleasantly surprised with this first visit. Plush red leather banquettes, brass railings, and a lively bar presided over by Doug, who makes the best Negroni's in the city. Seven of us were there on a Sunday afternoon for drinks and bar bites -- we tried them all, all were delicious, crispy truffeled French fries a winner. Though the place was packed, the service was great, our waitress Jackie took care or our every need. We'll be back for dinner next time.", "author": "Cathy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "I've seen three different restaurants birthed and expired here, and thought this corner space on Fillmore Street was cursed. Huzzah for the arrival of the Chosen One, Palmer's, which has weathered the buffeting winds of exorbitant rents and fickle patrons! But, of course, it's owned by the pair who have made Leopold's on Polk (that awesome Austrian gasthaus you look into sometimes, where everyone seems to be having more fun than you have ever had in your whole life and are all holding massive boots of beer) so successful. I imagine those two could single-handedly revive half the failing restaurants in this city. \n\nThings to love: \nThe atmosphere. Very unique and cool, with gleaming wooden surfaces and floors, comfortable, studded, ruby leather chairs, glittering mirrors lined with bottles, high ceilings with elegant light fixtures, and arresting, controversial, and (in my mind) beautiful animal heads jutting from wooden panels above the bar.\n\nThe Happy Hour: Unlike some bars, which like to play games by putting their least alcoholic, least delicious selections on their cheap list, Palmer's puts some of its best here--and it has some of the best Happy Hour prices in the whole city. The best drinks: the Old Pal, the Boulvardier, and the Parisian Bouquet (get it with gin)\n\nThe Cocktail List: Extensive and fantastic--especially their whiskey drinks. Even when it's not Happy Hour, the prices aren't too bad considering the heights to which so many others appear to have risen in the last year. No idea, though, why the list isn't on their website--there is literally no way to see it unless you walk past the restaurant. Seeing that this is the best thing about the place, I'd recommend posting that menu!\n\nThing (yes, singular) to less-than-love: the food prices. If it's not Happy Hour, the food here is too expensive. It's not bad, but it's also not great. Were they to decrease the prices a little, or perhaps add some entree options that were less than $20, I might eat here more regularly. As is, this is my Go-To Happy Hour place but not where I take anyone for meals.", "author": "Ali M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "New creation, the Southern Belle. Must be tasted to be believed. Bourbon, Aperol, Lemon, Bell Pepper, Rosemary.\n\nNot into Bourbon? Eat the Duck Bolognese!", "author": "Nathan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Late night cocktails and drinks - great place to be! \nVery nice decorated and very friendly people working here, the drinks come fast and delicious :)", "author": "Corinna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-09", "description": "I was very disappoint when visiting this Sunday brunch. The restaurant looked very pleasant. As well as the liter of mimosa. The waiter did not check on us after we received our food. My salmon sandwich came with fries, I received a salad. This is a high end restaurant and maybe we did not fit into their demographic of \"wealthy\" we would not have spent 20$ on a salmon sandwich anywhere else.", "author": "Summer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "This is only for drinks.\n\nGreat spot to pop in and grab a creative cocktail on Fillmore. We came in last weekend after a great meal at Pizzaria Delfina. We sat at the long bar that runs parallel to the actual bar. \n\nService was pretty fast for a Saturday night with a packed house. \n\nI love the ambiance. Think old world bar that's just a little more modern than the prohibition era. Though I dislike all the dead animal heads. Not a fan of those. \n\nThe drinks are great. This is one of those bars where they really see it as an art. That being said, the glasses our drinks we're services in were less than inspiring. For the prices, I think we should have gotten something more interesting than boring standard glasses. \n\nFor the boys: the bar was LINED with attractive ladies and no makes. They all looked on the prowl as well.", "author": "Aggie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "Review for cocktails only!\n\nGreat spot for a first or second date.  It's cozy enough that you want to sit close to your date.  However, it's not so overly romantic that you feel awkward all the other couples around you are playing footsie and you're not.  \n\nCocktails are delicious.  A little too easy to drink!", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Excellent food. Good vibes. Awesome server. If you haven't been, you're missing out! Great brunch spot!", "author": "Mike P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "Overpriced and poor service. It seems to attract an inordinate amount of tourists, while locals steer clear.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "This place was great! Went for happy hour and was pleasantly surprised. Started off ordering some food followed up by a few drinks. \n\nThe food: The burger was amazing cooked just right with a side of curry fries (get the curry fires!!!!). It was medium well and still juicy not dry at all. I was impressed by the portions too.\n\nThe drinks: The cocktails were on par served up by mad scientist looking bartenders rocking lab coats. I only had a few but they were masterfully done.\n\nThe atmosphere: Very chill old school vibe with comfy booths, a nice sized bar, and deer heads on the high ceilings. Enough room to bring a party and intimate enough to meet people when alone.\n\nOverall I liked it a lot and would recommend it to anybody. Will be coming back soon to explore the rest of the menu. Top notch and five stars!", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Palmer's is a refreshing addition to Fillmore's many cafes & high-end boutiques. Stepping into Palmer's Tavern transports you into a classic tavern-like setting with red leather booths and animal heads above the bar. \n\nAlthough they are known for great cocktails, the food is excellent (and a steal during Happy Hour, 4-6 pm everyday!). Quite a few of their signature dishes are discounted during Happy Hour, including pulled pork sliders, dry rub ribs, and devil eggs. And the curried fries is a must order too!", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Went back to Palmer's on New Year's Eve to meet up with friends for dinner.  The food and drinks were fantastic. I highly recommend the osso bucco. It was extremely well-flavored and tender. Definitely will return", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Great happy hour. Classier than your average cocktail and dinner lounge. They have really good sangria and Manhattans. Great bartenders and a friendly host. Fries are the right amount of crispy.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-20", "description": "This is a really nice spot - beautiful masculine decor - and a great place for a drink.\n\nI started with a Four Roses single barrel and was quite pleased.\n\nThen we got food - lots of it:\ndeviled eggs (meh)\nkale salad (so-so)\ntrout (pretty good)\nfilet mignon with chimichurri (overcooked)\n\nI'd go back for a drink and maybe appetizers, but skip the food.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "I love this place.  It feels old-timey (1920s?) and classy, which is a rarity in SF. (Is it just me or does everything old feel run down and everything classy feel brand new?)  Anyway, believe the hype on the curried fries (and they go great with ketchup so order extra) and also order the excellent flatiron steak (delicious sauce!) and the classic Vieux Carree (whisky, vermouth, bitters, and some other stuff).  But skip the flourless chocolate cake, which was oddly soggy rather than fudgy which is what you want.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "Agreed. Eric was a bit obnoxious. I don't post much but what he did was uncalled for. \n\nThe bartendress was great but I'm not happy about Eric.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Happy Hour.  Bartender Cory made us the best rose sangria we've ever had.  Delicious! The bargain priced brussels sprout chips were very good, as well.", "author": "REN S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "As a visitor from out of town, I thought this place was way cool and very San Francisco.  We sat at the bar for a late lunch.  I thought the atmosphere was cool (except for the animals heads...).  I got a delicious glass of wine and we split french fries (yum) and mussels (yum again).  Perfect high end bar food in a great location at a neat bar.  I was happy.", "author": "Carla F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-07", "description": "Palmer's Tavern disappoints on so many levels.\n\nThe menu at Palmer's Tavern centers on more substantial dishes and could use the addition of some lighter selections for women or those who are less hungry.  The roasted beet salad was rather small and only average.  Ordered medium-rare, the Wagyu beef entrée ($23) was overcooked and tough.  Served with cheese, lettuce, and pickle on a plump bun, the burger ($13) was OK, but nothing special.  French fries were so salty that they were almost inedible.\n\nWhile service at the bar was slow, the cocktails ($8.75) that were finally served were well made.  Service in the dining room is disorganized at best and haphazard at worst.  There seems to have been no planning to the waitstaff's workflow, and there is a great deal of wasted effort, resulting in slow, inefficient service.\n\nA surprising disappointment from Albert and Klaus Rainer of the wonderful Leopold's on Polk Street, Palmer's Tavern is trying hard, but failing miserably.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-06", "description": "First glance, not THAT much different looking from long bar. Unclear why it took something like 2 years to open something here. Warning: the heirloom tomato salad is quite frankly a scam. When I have had a dish named like this elsewhere it is a salad almost totally made of chopped tomatos, think Italian or middle eastern style.\n\nThis dish was $11.50 for butter lettuce with 5-6 approx 0.75\" cube tomato chunks on top -- almost a joke. Cocktail was fine. Scene was nice. But overall this place is a disappointment, though I am sure I will give it another chance. Food was real amateur hour and they set expectations way too high for a long bar lookalike.", "author": "alex v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "I visited the City yesterday with my family with the intent on exploring.  When it came down to dinner time we referenced Yelp for a suggestion.  The couple of places were either closed or had too long of a wait time that we did not want to deal with.  We decided to go to the Fillmore and we had a back plan of La Mediterranee - my wife and my first date together - a Classic and a sure thing on reminiscing alone.   As we finally found parking, we walked by Palmer's and I was enamored by the small groups of people eating outside and enjoying a nice libation out in the little bit of sunshine the City had to offer.  We continued to walk towards La Med when I came to a complete stop.  The thought of eating potentially good food in an old world bar atmosphere seemed like a good idea.  I talked my wife and eleven year old son into popping our heads in to explore a little bit more.  We decided to give it a go!\n\nWe ordered a deviled egg each which was topped with a small slice of bacon and a pickeled jalapeneo.  It was also served with pickled onions, carrots and cauliflower.  My son opted for the small plates of mac and cheese and creamed spinach - and a large glass of milk - which our server stated, \"Hadn't heard that in a while.\"   My wife opted for the burger on a Brioche bun with curried fries.  I had the pan roasted chicken that was served with Gruyere mashed potatoes and sautéed kale.  And a Ballast Point Sculpin.\n\nThe food was delicious - the atmosphere was the type where you could spend hours just sipping on a drink and eating at a slow leisurely pace.  My one regret was that I did not order a cocktail.  I had a feeling that it had a high chance of being made very well.  The barkeeps had a look of experience and looked sharp with their black slacks and white coats.  Absolutely loved the feel and vibe of the restaurant/bar - that it was older and refined.\n\nI would definitely show up for a drink and maybe the burger again or a pork chop.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "The black caddy helped me grow chest hair.\n\nNot sure what to make of the short white coats though.  Waiters rocking that med student look.", "author": "Beef S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-02", "description": "Don't even get me started about this place ... I waited tables all through college at crowded bars and it's laughable that the owner said this was his busiest day of the year. The back of the restaurant is completely empty but they did not have the decency to acknowledge our table until we went to order at the bar 20 minutes later. We did speak with the owner and he did not even apologize. I would never come back here again... There are a million restaurants in SF with better food and better customer service.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Decent place for quick happy hour and catch up with friends. I like the crowd and the staff is friendly. The bartender was also very attentive given they were busy because the basketball game was on.\nGreat bar and I alway had a great time every time I came here!", "author": "Ty N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "I must say that I was pleasantly surprised by our dinner at Palmer's. We were a group of six, looking for a table at 8pm on a Saturday evening. We called up Palmer's and to our surprise they had a booth for us. When we arrived the place was hopping. Super loud, do not go for an intimate dinner for two. Unless you are cool people watching, and not being able to hear yourself think. We had company from London, so with the thought that we wanted to hear each other, the hostess moved us to a back booth with a curtain. Perfect space to dine like a King.\n\nWe started off with cocktails and deviled eggs. Cocktails were imaginative and delightful. Loved the Bee's Knees. Deviled eggs were good, and were able to order bacon free if you so desire.\n\nNext we ordered a bunch of plates and shared family style. We ordered the vegetarian gnocchi, burratta with peas, beet salad, flatbread, mussels and burger with curry fries. All except the burratta were much better then expected. I somehow thought it would be mediocre bar food, but was definitely an elevated meal. The big disappointment was the burratta, which was tasteless and crying out for salt, pepper, olive oil and/or aged balsamic. I'm a huge burratta fan, and was bummed that is arrived so bland.\n\nThe knockdown from five stars to four was for their dessert options. The menu selection was so boring we didn't even order a dessert to share. They definitely need to kick it up a notch in the desserts.\n\nStaff was friendly and attentive. I would definitely go back if I was with a group of three or more. Again, don't go thinking it is a romantic spot or a great place to catch up with a friend. Super loud, but fun with an old school steak house vibe. Fabulous place to get a cocktail or two.", "author": "Victoria O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "The location is great and so was the ambiance with dim lighting (but not so dark that you can't read the menu, similar to most steak houses) and room for sitting and standing. Started with the curry fries which I don't regret at all. Crispy and coated in curry seasoning with some ketchup on the side. The gnocchi was excellent, slightly crisped but soft on the inside sitting on top of duck bolognese. I got full about halfway through but it tasted so good I forced myself to eat the rest. My husband ordered the salmon which was also cooked to perfection. If you're in the mood for something light but flavorful this is the dish for you. It came with some crunchy vegetables which was a great touch if you're able to include some in every bite. \n\nUnfortunately the dessert was nothing like the entrees. We ordered two vanilla bean creme burlees for a table of 6 to share and we ended up sending both back. The entire thing (both of them) were freezing cold and gelatinous, the caramel on top tasted burnt and was crunchy only in the center and not on the sides. If you enjoy creme burlee I advise you not to try it at Palmer's - give something else a try. \n\nOverall, I enjoyed 80% of my experience there. Service and dessert were not notable.", "author": "Shireen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-04", "description": "Atmosphere was hip and light. Large stuffed deer and other forest creatures adorn the walls but don't let this make you think it's a cheesy Tahoe lodge. Stay a while. \n\nMet a friend for drinks and enjoyed the meatballs (not smokey despite the menu description) and Mac n Cheese (not very flavorful but nice to split). \n\nGrab a seat near the bar (a lot of stools) and have fun with staff - all of whom were great.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Very classy place to take a date or just a casual gathering with friends. Grab a dinner for a business meeting is also great. Service is friendly. There's a full bar menu with wide selection of interesting drinks. It's in the trendy Fillmore.", "author": "Nessa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "Stopped here with a friend on Sunday afternoon (just before 5pm). We had appetizers which were pretty good: deviled eggs, pulled pork sliders, and brussels sprouts. The eggs were excellent and we were happy with the other appetizers as well. Our server was nice, although it was a little hard to get her attention sometimes, I think because she was very busy, but still good service overall for the meal. We had four appetizers for $33 --  the quality of the food was great for the price.\n\nIt's at an appealing location and the decor overall is nice except for 1) creepy dead animals mounted above the bar, and 2) inlaid Amish-style woodwork around the flat screen tv. This is like one of the bars where the owner decides to add their own special touches instead of using a professional, and the staff are too afraid to complain. At the same time, I really liked the lightning, chairs, and overall decor. The bathrooms were clean and beautiful. It was a nice space.\n\nThe only thing preventing this place from being 4 stars is the Sunday afternoon bar service. After the meal, we asked if we could move to the bar to get some cocktails. They wanted us to have the cocktails at our table, which was next to some really loud people shouting that they should short LinkedIn (even though MSFT already bought them). We wanted to get away from these people, and the bar was empty. We also wanted cocktails, so we insisted that we wanted to move to the bar, and the server asked if we could close out our table ticket, which we happily did and then sat down ready for a drink.\n\nIt was hard to get the bartender's attention even though there was one bartender and one assistant at the bar, and only about 5 other people sitting with us in the entire bar. Both the barhop and the bartender were only about 3 feet from us, washing dishes, having small talk, adjusting bottles, making drinks, and doing what people do on a fairly quiet Sunday afternoon. \n\nWe sat there for 15 minutes and no one asked us for our order. No one even said \"I'll be with you in a moment\". We waited. Then we waited some more.  Then I said saying \"excuse me, we'd like to order\", but was ignored. At that point, I suspected why the waitress wanted to be the one to get our drinks. I waited 5 more minutes and tried a little louder \"We'd like to order\", and was still ignored. Finally I had to raise my hand (hate doing that) and loudly say \"Excuse me, We'd like to order!\" at which point the barhop (and not the bartender) asked what we wanted. \n\nA note to the owner: A good bartender sees everything. Where a normal person would see a throng of people clamoring for drinks, the bartender knows who's standing where and for how long, how many drinks each person had, who is alone or with a friend or on a date. They see all.  You only need to make eye contact, and most of the time not even that. You don't need to say \"I'd like to order\", as you are at their bar without a drink. You should *never* have to raise your hand or gesticulate to get service at a bar, and waiting for 30 minutes is inexcusable outside of a club of Friday night type environment. This bartender just didn't have a vision of what his customers were up to. He was more in the mode of needing to be prompted for drinks and delivering them -- like someone working at the back of the house rather than at the front. \n\nEven then, no one offered to give us a drink menu or tried to promote any house specials.  I ordered a Sazerac and was given a very sweet drink which tasted like a splash of vermouth added to an ounce of Jim Bean bourbon and an ounce of simple syrup. They used one of the hip big square ice cubes which would be nice if the drink wasn't supposed to be chilled. A desiccated orange peel was placed across the top of the bucket.  The only thing they got right about this drink was that it's best served in a bucket, although if the bartender knew how to make it, he'd want to serve it in a cocktail glass. \n\nSo our experience was that the meal was good, prices were reasonable, bar was poor, and the dead animals were just creepy. But hey, we had a good time, so three stars. I wish this place well, and with a few tweaks it can earn four stars.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "Stopped in for drink and appetizer, great people watching and staff was friendly. Beautiful day in The City, Fillmore was bustling. 2 beer offerings so if that's what you're looking for check it out before ordering. An extensive drink list.  We decided on appetizers (dinner service doesn't start until later) had onion rings and brussel sprout chips. Both were good.", "author": "Gwen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Great atmosphere for happy hours.Awesome drinks and bites! They have excellent cocktails, great wine list and tap beers. Devil eggs are delicious!", "author": "Tatiana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Recently made a move into San Francisco, and I've been looking for a good place for dinner and drinks. After a couple visits, Palmer's is my go-to place on Friday nights! My friends and I love sitting at the bar, having the mac and cheese and a happy hour cocktail. My bartenders are always one of the Carloses! They're fun, silly and have a lot of energy! Carlos with the tattoos, he always take the best care of us and makes our drinks just how we like it. I've become familiar with both Carloses behind the bar, and they're both great.", "author": "Kay J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-16", "description": "My experience her was all in all unpleasant, sorry!\nThe waitress (petite Asian chick, like me) there showed visible signs of annoyance because I only ordered vegetables (not some hefty, expensive course). She asked me more than an okay number of times (at least six during the entire evening) if I wasn't going to order more food. I had other friends there with me who received the obviously friendlier service because they actually ordered a ginormous burger, sides, and drinks. \nOkay, maybe I should have ordered more since I was seated In a nice, cozy, dim-lit balcony but c'mon I was with friends- and the place was packed, let me be for goodness sake!\n\n\nFood: first of all, I got the wrong order- so I asked the waitress that she probably had misheard me and she resorted to arguing with me (in a passive-aggressive way with smiles and all) that she absolutely DID NOT mishear. All three of my friends at the table heard what I had ordered and kept supporting me but it took her at least five minutes to give up. Wow. Someone help this chick take her stubbornness elsewhere! \nThe food was all extremely oily and salty. I would not order the sautéed/grilled vegetables ever again there. \n...Need I write more into trying to defend my reason for the sour rating? I think this will suffice. \n\nIf you're looking for a nice bar with cozy, dim-lighting, and elegance this place is a gOod choice. BUT- only if you're in a galant, dashing mood that fades the ignorance that may surround you.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "I came here with a little hesitation because of the Yelp reviews, but we needed a place for a birthday dinner for a party of 6, so we headed our way up Fillmore. Restaurants everywhere seemed crowded and had wait times, and Palmer's doesn't take reservations, but luckily they were able to take us right away when we arrived, so in we went.\n\nAnd I am so glad we did! From the outside, Palmer's is nondescript and very easy to miss among all the other shops and restaurants. On the inside, it's classy, intimate, and even a little historic, with deer heads and lots of photo frames mounted all over wooden walls. There is also a bar area, which makes it more comfortable. I ordered the entree special, which was a shortrib served on pappardelle and vegetables (25), and the shortrib was super duper tender. Other people got the steak (35), gnocchi (20), trout (24), salmon (25), and lamb (27 and massive), and everyone really liked their food.\n\nTo top it off, the waitress overhead us talking about our friend's birthday, and surprised her at the end with ice cream and a candle!\n\nNext time I'll try getting that curtained little table in the back corner. Scandalous.", "author": "Cynthia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Fantastic electric and eclectic atmosphere!! \nGreat wine and beverage list and good food items.  I particularly like that I can get an early dinner on those \"school\" nights and have a raucous time on Thursdays or weekends.  The owners Klaus and Albert are very hands on and keep the quality of the place in check.  And they are great personalities in their own rite!! Staff is very professional without being to stoic.  A definite \"must go to\" restaurant in San Francisco.  BTW, the Devil eggs are to die for; also the trout and pork chop!!", "author": "BRENT P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Our dining experience was excellent! \n\n5 stars for drinks\n5 stars for food\n5 stars for service\n5 stars for fun ambience\n\nWe were a group of 6 on a busy Saturday night and the staff was accommodating, super attentive, and the food and drinks came out fairly quickly. Everything except for the pork chop (too dry) was delicious. Great addition to Fillmore Street!", "author": "Hanna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "This place is great! \nI love the food (especially the ribs), the staff is really nice and friendly, and the drinks are great. First Bloody Mary I had after coming back to the States this month and it was superb! Plus I got the one that came with bacon-how can one argue?", "author": "Benjamin K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "I was in the neighborhood yesterday and stopped in. It was happy hour and very crowded. I sat at the bar, the bartender handed me a menu and walked off while I decided what I wanted. Suddenly, something moved on my menu - it was a cockroach. I pointed it out To a waiter who was nearby who killed it and then got me another menu. I only had a drink and I left. I don't think I'll return.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "One of my favorite cocktail bars in the city. When I saw this place on Fillmore I knew I had to stop by -- it has a classic European style decor: with perfect lighting, high ceilings, and taxidermy on the walls. The old-world historical ambience is rare in SF and I felt like I had been transported to a different city. The cocktails were/ delicious and the service was excellent. I hope to try the food on my next visit.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "When Palmer's is packed, as it often is, the experience really drops off - chaotic, slow, sometimes unfriendly service.  But when it's a bit more quiet, Palmer's is a lovely place for a drink and a snack (wouldn't recommend for a full dinner, as the food isn't very special).  We were there early on a weeknight for Happy Hour and had a great time - drinks were delish and came quickly and the FRIES were insanely good - almost wish I hadn't discovered them, if you know what I mean.  Oh my, they're kind of magical (we got the plain ones).  yummmmm.  Other food items were fine (glad we got a HH deal) but unmemorable.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Burger is great!  Bartenders are even better,!  Look forward to the new cocktail menu", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Absolutely love this place. Just discovered it last night, came back again tonight. If you're looking for a great east coast gastro pub or european brasserie, this is your place. Lively atmosphere, great service, superb food - had the pork chop two nights in a row - and incredible attention and friendliness from the owner, Albert... I've finally found a place in SF that I'll be coming back to again and again and.... :)\n\nPROS: food, small outside seating areas, service, cocktails, ambience\n\nCONS: It is a bit TOO loud, but they're going to address that with some acoustic modifications", "author": "Marc H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "I really, really like this spot, and I'm a little bit surprised by that!\n\nI've walked by a bunch of times, and always figured the crowd was kinda, well, not my scene. I figured it was bros journeying up the hill from the Marina, and older, richer folks from Pac Heights. And you know, maybe that's true on some nights, but it wasn't the night my lady and I ended up at Palmer's after our own little Fillmore cocktail crawl. \n\nAnd what a great place to end up. We sat at the bar, and enjoyed watching the bartender (a big, tattooed gent bedecked in a strong beard and a classic white barkeeper jacket), lovingly create each cocktail. He and the other keep were nice guys--friendly and talkative, but not so talkative as to be annoying. \n\nI don't remember which cocktails we ordered, but they were served in the old-timey glasses. In general, I'd say Palmer's is paying homage to the 1920s Jazz-era Fillmore Street: a vintage feel with lots of solid wood and incandescent lighting. I like it a lot--it's speakeasy-ish without the pretense.\n\nWe also had some food: the burger and the side of brussel sprouts. Both were well-priced, largely portioned, and delicious. Particular shout out for the brussel sprouts, which were cooked in balsamic, and cost only four dollars, for as many veges as you normally be able to buy for $4. Impressive. \n\nGreat place, will return. Holding off on the fifth star for now, as we didn't have dinner proper there, but I expect they'll be able to get it.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-12", "description": "Don't know about the food ... hopefully it's a lot better than the drinks!  Not only did the drink go back because it was bitter, the replacement wasn't any better.  The bartenders need to go to school to learn how to make drinks & in what glass to serve them.  I did not expect to see my drink served in a sherry glass ... it was not sherry!", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "My husband and I really enjoy this place. It becomes one of our regular place to go for a relaxing happy hour.  We loved to sit at the bar and mingle with the bartenders.  We definitely enjoyed their mixed cocktails. My husband current favorite is their Vieux Carree.  They also gave a great happy hour food menu.  We always order their fries, mussels and ribs. Nice drinks, great foods and awesome atmosphere. I highly recommend this place if you don't know where to stop for a drink and bit to eat on Fillmore.", "author": "Becky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Late dinner for 3 people.  Great atmosphere when we walked in.  We were seen to quickly and ordered and received cocktails promptly.  Servers were very helpful, taking time to help me choose what gin I wanted etc.\n\nService throughout was attentive, friendly and patient.  \n\nFood was very nice, server recommended the gnocchi and I'm very pleased I ordered it.  The texture and flavour was perfect with a little crunchiness on the outside.  The others had a burger and salad which I'm told were both great.  The berry cobbler for dessert was a bit average and my friend ordered gelato which was unusual but perhaps just a different texture than we're used to in Europe.\n\nI would definitely come again for a drink or dinner.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Slow service but food and drinks were awesome. Old fashioned and the chicken were a great combo. Spicy meatballs and pork chop also very good.\n\nI'll be back.", "author": "Julian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "My fiance and I were here on Saturday to celebrate our engagement. We'd arrived early and had ordered a few dishes from the bar when our friends started arriving en masse. The bar area we had occupied began to get a little congested but the bar staff were absolutely superb and kept careful tabs on who was ordering what, and making sure that everyone was looked after. At one point things seemed quite chaotic (in a happy way) but the team behind the bar on Saturday night were simply wonderful. Professional, attentive, friendly. We will both always love this place. Oh, and the meatballs - epic.", "author": "Dustin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-21", "description": "Ambience- Corner location with awnings and warm lighting make for an inviting vibe.\nFood- ok to very good among the five items we ordered.\nDrinks- lots of choices; good atmosphere \nService- What is there to say?? Waiter slipped a second bottle of wine onto our bill, not just any bottle, but one that increased the bill by 50%. I caught it as he was walking away and he instantly grinned saying \"Oh you probably want that removed from your bill\" as though it was a joke. Guess my sense of humor is impaired...\n\nThe place is attractive from the street and interesting inside... A mistake? A cabal of thieves? The one bad apple? In this neighborhood I won't need to sort that out any time soon.", "author": "Bailey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "Nice visit on a Friday night couple of drinks and some apps. Flatbread was a little undercooked. Sliders and shrimp however were nice. Worth another trip back. Good atmosphere.", "author": "Randy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-05", "description": "I had been going to Palmers since they opened. I have a small service animal due to a medical condition and he goes everywhere with me. We have been in Palmers more times than I can count. Yesterday I dropped in mid-afternoon and asked to sit in my usual spot. The hostess was unfamiliar to me and immediately started stressing about my dog being with me per usual, 100% of the time I go there. She said I couldn't be seated unless he was placed on the floor. I explained that wouldn't work for us since he needs to be close in order to manage my condition. I offered his paperwork and tags. She was not listening to me. Wait am I a customer, am I a human or something else to her? She stopped making eye contact and became abrupt and rude. It was if I was nothing.\n\nSome of you might be thinking oh a service dog, a bogus claim to get into a restaurant like so many in San Francisco. That's not the case. He is silent, trained, always swaddled and covered on my lap so as not to get on any furniture and as he has been trained.  He was professionally trained for 8 weeks as a puppy. He never ever gets near food, begs, etc. In fact, nobody ever notices him unless I am entering or leaving.\n\nShe didn't care she didn't want to see my paperwork which by the way is illegal to ask for. She's breaking the law in fact by even asking. I am sure if I were blind or deaf or with a large dog she would have rolled out the red carpet for me. I am not blind I have a chronic illness covered under the ADA that requires him to be with me.\n\nOne of the worst parts of this experience was that I am a regular customer with no familiar faces to greet me and an uncaring person treating me like I was nothing. It's NOT OK and anyone reading this that cares about people like me I don't recommend spending money and time at Palmers ever!", "author": "emily b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Palmer's is my favorite date spot! Great staff, GREAT food, a bit on the pricey-er end, but worth your money. Go for happy hour! You can get their best dishes in an app size and the drinks are amazing. Get the Pimm's cup!", "author": "Clay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-30", "description": "Palmer's confuses me. \n\nFor a while my husband and I were going to Palmer's for dinner pretty often. Most of the food we've had there was delicious. The lamb was incredibly tender and flavorful. The pork chop was incredibly moist. The gnocchi with duck bolognese was to die for. \n\nAnd then I had the steak. It was not only overcooked (I got medium instead of medium rare) but it was also completely unseasoned. Not a dash of salt or pepper. It must have been a fluke, right?\n\nA few months later I decided to try the steak again. This time it came medium-well so I didn't even try it, I cut into it and sent it back. My new steak came undercooked (which I prefer but still, not what I asked for) and again it was completely unseasoned. The mushroom sauce it came with was also completely unseasoned. My husband's burger, on the other hand, was perfectly cooked and seasoned. \n\nI don't know how they can get their steaks so wrong and everything else so right.", "author": "Sofia F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "Good cocktails delicious pulled pork soldiers and dry rub pork but portion were really small.", "author": "Aj K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "Food and service were lovely. But on Friday night it was so, so noisy that my dinner companion and I were literally shouting at eat other (ironically contributing to the noise level) and had trouble holding a conversation. I would definitely come back on a less busy evening.", "author": "Barbara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Nice neighborhood restaurant. We ate at the bar. I had a burger which was cooked just right. Added blue cheese and bacon to my burger which they accommodated. \n\nThey have an assortment of New Zealand wines which is very unusual in San Francisco. Overall, the service was good and the location is great and very vintage atmosphere. It just lended to the areas charm. I will be eating here again.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "My husband and I came upon Palmer's by chance yesterday afternoon when we mistakenly went north instead of south when looking for a particular shop on Fillmore. What a happy accident! The beautiful Palmer's sign drew us in. We were seated immediately in the gorgeous, high-ceilinged dining room. It was brunch time. The menu was fairly small, but everything on it was interesting. I had the grilled flat-bread with bresaola, gruyere, fried eggs (cooked perfectly) arugula and - wait for it - onion confit. It was a rather massive portion for only 12 bucks - hubby had to help me finish it, despite having polished of the vegetarian frittata on his own plate. We were not going to waste a bite of this dish.\n\nI also had a glass of excellent grenache rose - just delicious. And I would be remiss if I did not mention the excellent service. The host, the server and the owner were all smiling, attentive and genuinely kind. The whole experience was a total mood-elevator. We'll be back!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Palmer's drinks are great and foodwise is very good.  Brunch is  also very good.  I am surprised it's a bit empty for brunch (they open at 11 AM).  Brunch burger is massive and juicy (bacon, fried egg, avocado) and the omelette is tasty.  If you want to meet friends for brunch without the wait and have nice conversation, Palmer's would be fantastic choice if you are in the area (or couldn't wait for Elite Cafe brunch).  Service is fine and no issues.  I feel Palmer's is the grown up (more mature) version of the Brixton (youngish crowd on Union) but with better food.", "author": "Mr. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "I've been here a few times, and thought Palmer's was ok. But I came in this weekend and was delighted. Lovely service, cocktails and lunch. Salmon on the salmon sandwich was perfectly prepared. And chocolate mousse cake was delicious. I look forward to returning.", "author": "Kirsten Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-14", "description": "We had reservations here and our table was ready right on time but the entire meal I felt rushed by the waiter. He tried taking our menus and our plates before we are finished with either. The food was fresh but just okay. We had bacon wrapped scallops and a buretta cheese plate. At the end the waiter came up and said we need your table for someone else so I basically felt kicked out of our reservation. If I ever go back there I will definitely sit at the bar because the bartenders were super friendly and very attentive, but I wouldn't recommend this place a good date spot if you plan on making a reservation.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "I would give this a solid 3.5 stars, but alas, Yelp only allows stars without decimal points, so since I feel like it was OK and I'm not a total fan, I'll go with the 3-star rating. Went here my first night of a weekend visit to San Francisco with Sam C. It was within walking distance of her place, which was great, especially since the walk to dinner was more/less downhill (meaning the walk back did mean we were going uphill!). It had a very neighborhood-like feel and was definitely packed when we got there. They had a table for the two of us in the back and when we got back there, it was definitely HOT. We were seated and our waitress came by and got our drink orders (red wine, please!) and then we agreed to do some sampling and splitting of things from the menu. We shared an iceberg wedge salad, which was exactly what you would have expected for this type of salad. Then we split some orders of pulled pork sliders (yum!), a Palmer's burger, French fries and Burratta (which I personally thought was a disappointment). All in all, it was great to visit with a fantastic friend in a convenient spot with good variety and plates that were shareable. I just thought for the price of the food and wine that the quality of our meal would have been a little bit better.", "author": "Christa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "Came by on a weeknight for a couple apps and drinks:\n\nPretty hoppin' place!  Lively, nice ambiance.  \n\nFlatbread is just ok. I recommend the meatballs.\n\nCocktails were good. My husband and I sat at the bar, and the bartenders were friendly and could make a solid drink!", "author": "Riz W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Really fun place for drinks and food. The ambiance is a combination of Chicago and the northeast. I come by once a week and it's always a good time. Try the shrimp app!", "author": "Scott K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-18", "description": "4 Stars: service, ambiance, drinks\nNegative 2 stars for the food. Ordered ribeye for two- Within what was definitely the non-ribeye'est cut of meat was every thing except flavor- from bloody to very well done all within one steak. And the sides tasted like nothing (gratin potato) or salt (spinach). \n\nStep it up Palmers. I eat a lot and know what I'm saying.", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-24", "description": "The best part about Palmers is the service, particularly the dinning room. I was provided with 5 star service which was thoughtful and prompt, better than any I've had in SF. The food: Not very impressed. The wedge was lackluster and missing more of everything. The burger would have been good if it weren't so charred. The mussels were GREAT and so were the fries!!!!!\nThe decor and ambiance are also great! Very charming 20's vibe and huge bar, If you are meeting up for drinks & appetizers this is the place to do it. On our way out we got a thank you from 4 people including a bar tender, That was impressive!", "author": "L V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Since it's very close to my house, I come here pretty often. The cocktails are delicious, creative and strong. The food is good, somehow always better than I expect it will be even though the menu is sort of typical American cuisine. \nI always get the deviled eggs...always really good. \nPerhaps it is because I usually end up drinking several of the above mentioned strong and delicious cocktails before the food. \nThe service has always been super friendly. When it gets crowded you might get a bit less attention but I've never had an issue here.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Great place to get a bite to eat and some beers/cocktails! So much fun to sit by the window or at the bar. They have a nice selection of beer, wine, and cocktails. The French fries with the curry spice was so delicious. It went perfectly with a cold draft beer. :)", "author": "Kyoko T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Stopped in for a drink, and was delighted with the service we received. Carlos was our bartender, drinks were fabulous, service and personality were even better. Highly recommend this place for the drinks as I did not eat here...well their bacon was really good in the Bloody Mary!!!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-02", "description": "I hate to do this.  I really do.  But this experience is like poison that I have to get out of me by telling someone.\n\nMy experience is solely with the bartenders/drinks.  I can't comment on food.  My story begins with a perfectly reasonable cocktail, Diablo something, ordered from a friendly bartender at a reasonable $8.50.  I went back and wanted something a little stiffer.  This is where my tale begins.  \n\nI asked for a double Makers on the the rocks.  The bartender types in a Makers into the POS.  Its $9.  I can SEE this with the EYES I have on my head.  He then clearly is puzzled as to how to put a double Makers into the system.  He heads off to my right to speak with what must have been the manager.  He comes back with my drink and my receipt.  \"$27 dollars.\"  Im rather surprised that a double makers cost $18 more than a single.  \"27 dollars?\", I say.  \"So you are telling me a single cost $14.50.\"  Looking me right in the eye - \"Yes.\"  \n\nI don't argue with restaurants, I don't send food back, and I never complain to anyone.    I wasn't about to start here.  I sign the check, even give a tip.  The point here is instead of checking on something that seemed wrong, ie a $27 dollar drink, he looks me in the face and charges me that amount.  Screw you dude.  Check on that.  \n\nI wish my story ends there.  However after drinking my cocktail I want just one more.  I head back to the bar and avoid eye contact with previous bartender.  I don't want to complain, I don't want him to comp anything, I just want to avoid the situation and get charged properly.  I also don't want to order a single Makers and seem like I am \"testing\" the price on him.  Just trying not to be a jerk here.  \n\nTo avoid any confusion and keep the price down, I order a \"whiskey on the rocks\".  When asked \"What kind of whiskey would you like,\" I respond \"whatever is fine\".  Mind you today is not my first rodeo - I have ordered drinks before.  Generally, when a patron does not specify the type of drink they would like, they want the cheapest you have because they are indifferent.  However, the bartender elected to serve me a $10 whiskey.  My bill was $10.  The brand was 4 shamrocks or something like that.  Again, possibly i should have specified that I would in fact not like your most expensive whiskey, but rather the cheapest.  So maybe its on me. But I don't think so. \n\nEither way, this is my experience, and my tale.  Screw you bartenders at Palmers.  I wish the same fate as Long Bar upon your establishment.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Great food, great cocktails, great service, great ambience.  Highly recommend this classy spot on Fillmore.", "author": "Adam M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-01", "description": "Paid a five star price for a 3 star meal. \n\nThe portions were ridiculously small--two plops of rubbery pork that combined for a golf ball sized dinner. $47 for a teensy of steak. The sides were about nonexistent. \n\nAll this would've been forgiven, had everything not been overcooked and bland.", "author": "Dagmar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "A new fave! Recently moved here and this has become our go-to spot for sitting at the bar and having drinks/small bites. The bartenders are fun and super knowledgeable. A classy bar/restaurant with an upscale decor.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "5 Stars = Atmosphere\n3 Stars = Food\n2 Stars = Value\n\nPalmers is a great bar trying to be a great restruant.  They had great bones to work with from Long Bar, the previous occupier of the space, and they seem to have made some nice touch upgrades.  I'll probably be back for drinks regularly.\n\nThe food is mediocre.  I had the Wagyu Beef entree, which was bad.  I wasn't expecting fillet mignon for $23, but it was the toughest cut of meat I've ever had.  One of my friends tried a bite and couldnt even swallow it.  We sent it back.  Also had a burger, which was solid in and of itself, but kind of a let down at $13.  The bun was buttered.  The cheese was okay.  lettuce, peppers and pickles came on the side, but no tomato or onion.  IMO, highend bars, should focus on top quality beef, prepared simply, for burgers.  \n\nGreat bar with mediocre food that is over priced.  My overall sense is that Palmers is trying to be a little too fancy and that if they focused on doing a few simple dishes really well, it could be one of the best hangout spots in Lower Pac Heights.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Went to Palmer's Tavern the other night with the beau. He got lucky, I was planning on breaking up with him this night, but he scored big with the dinner so I let it go. \n\nThe re-done restaurant is beautiful inside and I really loved the music, not too loud but I couldn't hear the people next to me either. \n\nThe bartender made me one of the signature cocktails with whiskey. They had some other cool signature drinks I would try, like the Fillmore Fizz or something like that. Yum! \n\nOur server Eric was knowledgeable about the menu and suggested a couple of his favorites, which the beau and I shared. We are big foodies so I was excited. We had the rolls, and the chilled corn soup to start. Fan-freakin-tastic. Then we shared a couple other appetizers, the quail and oysters. NOM!\n\nnom \n1) The act of eating \n2) An act of affection \n3) A sound to express satisfaction through eating \n\nThe reviews below seem a litter hater-esque. Who freakin judges restaurant based on one interaction with a bartender who clearly doesn't know the register yet?", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-09", "description": "Parking is hard but this place is cute.  The bar area is pretty popular and gets loud.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-01", "description": "Disappointed is the most friendly yet comprehensive adjective that can describe our evening at Palmers. We left discussing whether we were more disappointed with the food or the size of the bill. I have paid parking tickets that felt like a better use of my money than our dinner bill. Our bread order should have been a clear signal of where our meal was headed. For $4.75 we got 2 defrosted dinner roles with butter (in most cases I would not admit that I paid nearly $5 for bread, but because we had never seen bread cost so much on a menu we had to try it).\n\nIt is not worth getting in to a discussion of our entrees, but I will say I wish I had a camera to capture the look on my wife's face when she saw her plate of hen sausage meatballs. \n\nOn a somewhat positive note, aesthetically the restaurant looked great with the exception of the animal heads and marlin on the wall (very confusing decor given the theme in the restaurant).\n\nTo sum it up, Palmers needs to step their game up big time before everybody starts wanting their money back, which I do.", "author": "Adam J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "I wish this was better, as I like the looks, the location (near my house) and the no-reservations policy.  My BF and I went for the first time on a Saturday night, arriving just before 7 and were promptly seated.  Good service.  Mediocre cocktails.  My tequila diablo was (predictably, my Bf informed me) too sweet; his old fashioned was okay.  None of the dishes were standouts: the deviled eggs, roasted beet salad, caesar salad (my entree) or pasta (his).  Nothing bad, just not as good as you can get elsewhere in San Francisco.", "author": "Robin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-29", "description": "Great food and a clean friendly atmosphere. The pork chop was excellent. Server was friendly. Cocktails were awful, just off in every way. Advice to Palmers: Don't put cocktails on your sign if you guys can't make them! If you're heading here, just order a beer and enjoy the food instead!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-12", "description": "Management inefficiencies affects this place.  If you have a busy restaurant then have your bus people set the tables.  The tables are empty so the waiters have to bring napkins and silverware. They forget or bring it after your food. The waiter was serving tables on the other side - he walked here. Got a glass. Walked there. Filled it with water.  Then walked to the table. It was like 1 minute of wasted time for him. It's obvious that there is a dining room mgmt problem.  We sat at 6:20 and at 6:35 we order and 6:40 the utensils. It's just amazing how amateur the dining room management was.  \n\nMenu is cool.  Yes.  Could use some lighter portions for women or light eaters.  Good bar menu.  Cleanliness score of 96 in the kitchen means very clean!!\n\nOk.  The frittas (fries) were BEYOND salty.  The meal was so salty. The other person with me said his meal was very salty.  They heavily salt their meals.  \n\nThe frittas (fries) sitting on same plate as the steak = soggy from steak juice!   \n\nA nice fancy restaurant - they don't take American Express.  Good lord!\n\nI wouldn't go back because there are plenty of better options.  I just felt that I needed to get a cholesterol / heart check after this salty meal.  \n\nOh well. C-", "author": "Robert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "I went in expecting an average bar food but I was pleasantly surprised. we were group of 8 trying to make reservations on Friday for same day and lucked out! \nwe started out with Devil eggs, mussels and macaroni and cheese all of which were good but spicy meat balls was awesome! I got the ribeye which was good but my Friends got other dishes that I tried all, so I can say with confidence get the braised lamb shank it is by far the best dish on the menu, after that sage gnocchi and ribeye are good. the trout and salmon were good as well... but the burger was awful! (burnt).\noverall the place has great atmosphere, service and food. I will go back...\n\nTotally forgot to mention the fries!!! the curry fries at this place is to die for!!!", "author": "Arash H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Looking for a chill place to hang out and grab some cocktails, look no further... This place is great! \n\nDrinks are on point, I personally thought it was strong. Bees knees was doing it for me... Penicillin wasn't that bad either. \n\nGreat bartenders. \n\nI'd come back!", "author": "Joaquin A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-20", "description": "Worst customer service I've experience thus far in SF, including the manager. Had to order from the bar while sitting in the booth due to MIA waitress. Ordered food/drinks from bartender and had to keep returning to the bar since waitress would not even approach us - no apologies, nothing. Informed the manager who didn't apologize either and had nothing to say about the god awful experience. Fortunately, now I know to never dine here again. My one positive is your bartender who helped us out and got in our order.", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-12", "description": "Came here during the week about 8pm. Had to wait a while for the bartender to talk to us, had to ask for water, then never got it refilled until dessert time. Very annoying. It wasn't that busy & they just weren't attentive. Wine was great. Food was meh. Chicken was salty & the Mac n cheese on the menu doesn't mention that it has bacon in it, which I don't like. \nWe ordered dessert-butterscotch creme pot. It was the smallest dessert I've ever had & 1/2 of it was whip cream. For $100 for 2 people, there are tons of other places to go!!! Tried it, not impressed, won't be back:(", "author": "Sfgal S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-16", "description": "Sunday afternoon bartender thinks his main job is talking to the hostess at the end of the bar. Portions tiny. Slow even though pretty empty.", "author": "Boner J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "Came in for dinner on a Friday night. Had as started the ceviche and meatballs. Both were wonderful. I enjoyed the freshness in the ceviche. As main dishes we had the gnocchi which was perfectly cooked and well accompanied with the bolognese sauce. We also had the skirt steak with chiles. As a dessert we ended with Chocolate cake which had berries and whip cream. Overall a great dining experience definitely will go back and recommended.", "author": "José A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-30", "description": "UPDATE: The owner is a lovely guy who made certain to contact me right away to let me know that they are installing a changing unit. Thanks on behalf of all the SF mamas! \n\n\nWe have been here for dinner so many times. Tonight we arrived with our new baby (who sleeps soundly in her car seat the entire time she's out). It was time to change her diaper and I went to the (very large) handicapped bathroom. It had no public changing table that just about every restaurant has these days. (This restaurant is brand new.) I went out and asked the manager about it. His response? \"It's not required.\" ...that's it? I cannot believe this lack of customer service & absolutely zero concern on the manager's behalf.  It could have been so simple. He could have a least showed a bit of concern regarding his patron's comfort. My issue is not whether a changing table will or will not be installed in that huge restroom. It was the manager's entire lack of concern.", "author": "ems k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "A great spot to meet up with friends. The decor is classic and there is something to capture your eye wherever you look. Great bar too!", "author": "Liz D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "I have been going to Palmer's for a couple years now and it is usually good.  HOWEVER, the last couple times I have been to Palmer's the nice folks seem to not really care that much about getting the order right or to the table in a reasonable amount of time.  Yesterday 4 of us ordered deviled eggs and 3 burgers.  The deviled eggs never came (which is the same thing that happened last time I was there) and the burgers were all mixed up as to specific orders, but since they had taken so long we opted to eat them rather than send them back.  I think Palmer's has great burgers, fries and drinks.  The gnocchi os good too, but the SERVICE NEEDS TO GET BETTER or people will quit coming and it won't matter how good the food is!", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "I'd actually put it somewhere between 3 and 4 stars.\n\nThis opening was forever in the making, yet it still has the same creepy dead animal heads up on the walls.... but that's ok. \n\nAs the new kid on the block the place is always packed.  Good for them.  Let's just hope it doesn't bring too much Fri/Sat night douche-ness to the area.\n\nOn the plus side the staff was very friendly.  They seemed committed to making certain the service was good.  And, let's be real, it takes some time for a new staff in a new restaurant to gel.  We were seated quickly, and our food server was very cool.  \n\nOn the downside is the menu.  It really was developed for a man.  Big heavy portions of big heavy food.  I think they'd do well to have a more robust appetizer menu and more salads, fish and pasta dishes, etc. to be more \"girl-friendly.\"\n\nI'd go back for cocktails, but not so much for meals.", "author": "brandie y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "Expected to love the bar, and we did (good Happy Hour crowd and professional, friendly bartenders. Warm, sort of clubby, swanky decor). Did not expect much for the food and yet we were incredibly impressed with the quality, originality and favors. We went for multiple small plates that added up to a great dinner for two. Enjoyed different scotches followed by wine - great selection of each. Generous portions of wonderfully presented deviled eggs, deliciously seasoned, dry rubbed ribs, diverse selection of cheeses and meats on the charcuterie platter, and lastly burata with ham and peas. All fresh, all perfectly prepared. Overall it was great, but we did have to knock off one star because the dining room can get very loud making conversation difficult at times. But the drinks, food and service are all top notch!", "author": "Rita G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "After half a year of peeking in the window like a serious creeper, I finally got to step inside the hallowed halls of Palmer's Tavern. I had a feeling I was going to love it after seeing the decor from the outside and reading about their craft beer-friendly menu, and I certainly wasn't disappointed. I met a friend there for drinks 20 minutes after their official opening (I told you I was excited!), and it was overall a very pleasant experience.\n\nPalmer's has a bit of a Gatsby feel, but not so much that it feels trendy or as if it'll be dated soon. The music was peppy, 20's jazzy, and at the perfect volume to provide a nice background without drowning out conversation (take note, Harry's Bar down the street). My brown ale was tasty and served very, very cold, and our server was attentive without being overbearing. \n\nIt was absolutely packed, with patrons ranging from Pac Heights-ritzy to post-work flannel-wearing hipsters. You wouldn't look out of place wearing a cocktail dress, but I'm hoping it ends up veering more towards the casual side- we could certainly use a low-key place on Fillmore.\n\nGiven that I live two blocks away, I have a feeling I'm going to get to know Palmer's very, very well. I think I have my new go-to!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "I can hardly describe how nice my experience at Palmers was - the staff were wonderful, the craft cocktails enticing.  I plan on testing out more of them soon (and by \"more\" I really mean ALL).\n\nSometimes you'll chat with a nice bartender but I spoke with six employees, all of whom were friendly and accommodating!  (Three barmen, two servers and the hostess.)  I asked one of the servers about a cocktail ingredient, she wasn't really sure but then lo and behold, a sample showed up so we could taste it.  Later, a different employee offered another sample when perusing the gin options.\n\nWith poor service the San Francisco norm, it was lovely to feel taken care of and be surrounded by professionals who enjoy what they do.  \n\nKudos (and thanks) to the Palmer's crew!  I'm sold.", "author": "MJ P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "All I have to say is \"wow!\"   I hadn't been to Palmers in about 5 months and decided to stop in the other day.   Fantastic!!   They had obviously made a lot of changes to the menu and they were all home runs.   Starting at the bar I had two drinks that were made exactly the way I wanted.   Old school cocktails that have been bastardized at other places are made with the attention to detail they deserve.  Thanks Doug for a geat old fashioned.   \n\nSat down for dinner and our server was Brian.  Great service and extremely knowledgeable about everything on the menu.  Kept it simple on this trip and got deviled eggs and the burger.   I'm a fanatic for deviled eggs and these delivered big time.   Burger was excellent.  Classic with some nice twists.   Definitely jumped up on the list as one of my favorites in SF.   \n\nOverall a great experience.  They've made some really nice changes and improvements since the last time I was in.  Good job!!   I'll be back in force and with friends.", "author": "Joe Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-20", "description": "This review is based solely on drinks.\n\nI stopped by this place for the first time last after after dinner down the street.  Only stayed for an hour or so, and had a few drinks and checked out the atmosphere.  \n\nGood drinks and a cool space with a manly old school feel and vibe.  Only negative thing I can say is the website said they close of 1:30am, but last call was around 12.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "good ambience, great burger and nice cocktails.  it is balboa on filmore of sorts.\nI would highly recommend this place for dinner or just drinks!", "author": "kevin a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-21", "description": "I'm on a deviled eggs hype, which really translates too I like high cholesterol and boy do these suckers not disappoint! \nFood was mediocre at best, nothing really wowed me. \nDrinks, I got the spicy tequila based drink and I loved it! Its a new dining establishment for my friends and I, I like the atmosphere, the waiters, bartenders the pretentious douches you know the pac heights crowd..i kid i kid.", "author": "Cristelle J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-27", "description": "Ate dinner here on Friday before a San Francisco Chamber Orchestra performance up the road at Calvary Presbyterian Church, so convenience as much as anything steered us into Palmer's. I was immediately reminded of the movie Goodfellas, or really any of the Italian mobster flicks I've seen that feature comfortable hideaway-type restaurants replete with plush leather banquettes and penguin-draperied waiters with their hair slicked back. Oh, and bebop-era jazz bubbling away. Palmer's was just such a place, and therefore already worthy of 3 stars: provided the food didn't suck, and it didn't. \nMy lovely date had Palmer's Burger, prepared exactly as ordered: medium rare; and tasted delicious. The special of the day that I ordered, the swordfish, was fine though not particularly special. A little dry, truth be told. I drank a glass of the Sartori pinot noir, which tasted a little like the bottle had been improperly stored in the sunlight. My girl had a Steigl Goldbrau, which is a terrific tasting Austrian beer. \nThere was a fun convivial crowd blowing that night, which made an average meal quite enjoyable.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "have a delicious Mussel dish for their happy hour, must try! their meatballs are below average though. great service at the bar, good place to watch a game as well", "author": "Roy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "A friendly, civilized place. The barfood menu rocks & the bartenders take pride in their craft. \n\nThe joint is usually jumpin' but I've rarely had to wait for a comfortable corner or a seat at the bar. A perfect place to meet for cocktails after work.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "Great food and staff. I loved the deviled eggs and pulled pork sliders!", "author": "Susie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-27", "description": "This is a great place for a cocktail.  I really liked the bar scene.  If you decide to order food, think twice about what you order.\n\nWe had a family dinner at Palmers.  The chef really let me down with the $37 steak.  I ordered it medium/medium rare.  It arrived overcooked and this seems to be a repeated complaint in the reviews.   \n\nInstead of sending it back to the kitchen, I decided to eat it because I was very hungry.  I also thought it was the nice thing to do and I thought that the manager would take note of this in the final bill (I made sure management knew about the situation).  I was so disappointed when I saw that they took only $5.00 off our bill ($167.00).\n\nWhen you pay $37 for a steak, it should be cooked to your liking.  \n\nThe kale salad was pretty good.  My fellow diners generally liked the food, though my daughter complained that the trout was rather tasteless in spite of the fact that it was wrapped in bacon.  My mother enjoyed the wedge salad and mussels.  My son enjoyed his burger, though he told me  that one of the cooks was out on his cell phone while my steak was in the kitchen cooking.", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-17", "description": "(from a 10/27 dinner)\nI haven't written a review in YEARS but thought our experience there warranted one.\nSat at a big booth near the bar and ordered drinks and appetizers. I ordered a second glass of wine. Now Palmer's has the wine glasses with lines on them to ensure the bar staff doesn't over pour and they get an even amount out of a bottle of wine. Mixed feelings on it but...Fine. However, we sat there and watched the bartender pouring out my wine from the glass into a tumbler to get to that perfect pour. Spent a bit of time pouring little bit out by little bit...then when he thought he got it to the exact line...chugged the tumbler of extra wine!!! Defeats the whole purpose of it AND heaven forbid you pass along your generous mistake to the customer! Our waitress did get word of my shock from the server and brought over a tiny bit more wine for me, but the damage was done. Wish I could say the food made up for it but the meal was nothing great and the mac and cheese lacked flavor. Really sad to write this review but have given this place a few chances and each time they fall down. Too bad, would love to have a great go-to place in the neighborhood but sadly this is not it.", "author": "Heather P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Palmer's bar and restaurant has excellent customer service. Although the bar is often busy, the waitstaff ate friendly and accommodating. The cocktails are delicious and the appetizers are reasonably priced and bacon-y. Deviled eggs were tasty. Don't order the chocolate dessert, instead go with the cheesecake.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-06", "description": "Worst service ever!! When we sat down at the bar there was hardly anyone else there so we got our drinks quickly. Very overpriced, small drinks that are not even strong. The bar got slightly more crowded, it was a Tuesday night so nothing like a weekend. We asked for our tab at least 6 times. The TWO bartenders on kept looking at us so confused. It took getting angry before one just said umm three drinks $33. I don't think they were entering anyone's orders into the computer which is why they were ignoring our request for the tab. It appeared they were trying to get drinks made then enter them. Very poor customer service and clearly can't handle a tue crowd. Will never go back, plenty of bars in the area that could handle such a simple request.", "author": "Pamela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Nice setting!  I could do without the dead animals staring ahead of themselves.  \n\nI had the burger - fabulous and very high quality!", "author": "Chuckster S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "I recommend this place for the 4-6 happy hour. $7 wine and $6 well. They have small plates for $7 that are quality. The mussels are my personal favorite. Portions are generous. Not your typical bar food. I also like the classic interior. Can get a little crowded.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "Food is good, drinks are good, but service is consistently terrible. Not nearly enough staff at lunch but that's hardly uncommon. Come in for drinks and deal with one of the worst bartenders in the city (the bald guy, I assume he is head bartender) - expect to be ignored for 10-15 minutes at a time while he talks to people, enters receipts into the computer, or does whatever else he does in favor of actually observing his cliental and serving drinks. Advice to management: fire him and take practically anybody else as a replacement. The rest of your staff is great, if stretched a bit thin.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "I came here after doing a bit of shopping and a disgusting lunch, at Chouqet, with friends. We were in need of cold beverages and this place certainly did the trick.       The front of the place was very busy but I was happy to see a back full of open booths. We took advantage of their happy hour specials ordering the sangria, the Brussels sprouts chips, and the onion rings. The sangria was exactly what I needed to tone the bitch down in me. It was made with rose and was not to sweet. The Brussels sprouts were perfect and only2.50$. I personally find them burnt and overpriced at most places. I could have eaten several more orders. The onion rings were done in panko  which is not to my liking at all. My bf liked them, so they were probably good, but I'd prefer batter.                                                It was like 70.$ which felt like a good deal. I wouldn't go out of my way but if I were in the neighborhood around 4 I'd definitely stop by again.", "author": "Corey Jace W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "Just very average. Had the burger which LOOKED great on paper but came out so mediocre. There's so many phenomenal burgers in the city, really sucks to pay $14 for one this sub par. Server was really nice though.", "author": "Alexander J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Palmer's has become my new favorite neighborhood haunt. Great drinks, classy, retro ambiance, and really tasty food. I tried several dishes the other day and was pleasantly surprised - the salmon was flavorful and moist, the potato gratin tasted straight out of Paris, and the fries were crispy and well-spiced with a slight hint of curry. The drinks are also consistently good and thoughtfully made (the bartenders are white-coated mixologist extraordinaires!). They have a nice selection of European beers, as well (I believe the owner is the same Austrian gentleman who runs Leopold's on Polk St?). Overall, Palmer's is a great spot worth checking out on Fillmore St.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "Cool decor, hopping bar do not eat here! The service is atrocious and the food practically inedible.   Limited menu and the wait for a table is no where worth it. Sorry but the management does not have a handle on customer service. Fun area but there are so many other options on Filmore.", "author": "Herb S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-17", "description": "Thoughts for my experience: You are kidding me right?  \n\nBefore I say anything else and describe our (disgusting) experience I must state the good.  The Hostesses and our bartenders were outstanding, OUTSTANDING.   Our amazing hostess saved us from who I am guessing is the owner (obnoxious German(?) guy with the filthy rag hanging out of his pants), She looked mortified about how he carried himself and profusely apologized for his actions which I will get into later.  Our bartenders made an impeccable old fashioned, my favorite.  The bar staff were knowledgeable, fast and skilled.  It truly is a good looking bar.\n\nMy coworker and I have been on a Gastropub kick lately and wanted to check out the new place on Fillmore.  Note: website is under construction and Facebook goes to a German Lingerie company (I will expand later).  So based on yelp I left my Amex card at home (Lame business practice; considering our corporate cards are all Amex) and we took a cab on up the hill.  From the outside the place looks great, but it got creepy the moment we hit the door.  We walked in planning on having a drink or two then dinner, per the norm.  The instant we enter I see this larger fellow charging straight for us wiping his hands on some filthy rag hanging out of his pants, before we can breathe he puts his hand on my coworkers shoulder (the one that was just wiped on the disgusting rag) and shouts in what we both guess is a German accent \"Table for two?\" Normally I would be happy for prompt service however, we did not have a chance to look or breathe before he tried to usher us off, and he almost knocked the hostess down while interrupting her.  Very rude.  \n\nWe steer for the bar after putting our name in for dinner.  The bar has a great selection of elixirs and the drinks are a reasonable price.  After a libation we smile at the hostess and she carts us off to a table.  I sit down and Thomas decides to go wash his hands (still grossed out about the rag), it is during this time that our waiter swings by the table and informs me he is not serving an incomplete party, before I can say a word.  When he is done filling me in on the rules I reply: \"That's nice my guest is in the restroom I know what he would like to ..\" and he walks off in the middle of my sentence.  Did we offend the service gods?  I worked in a restaurant in college so I doubt it.  Thomas returns and so does our waiter, \"Hi my name is Erick, I will be taking care of you tonight.\"  I had told Thomas about the incomplete party bit and we both chuckled, Erick, your authority trip must be a great ride.  Our drinks show up and they are outstanding, we order the chicken and the steak for dinner.  \n\nI have lived in San Francisco since 2003 and I should tell you the city is known for great food and drink.  Palmers, your food is terrible for the level of restaurant you want to be.  If we were in some dive bar it would be fine, but when I want frozen food I will go to a dive bar.  The chicken was rubber dry and tasted like dirt, have your chef season his food.  The steak was a steak, tough and over cooked, I am guessing it was a lower quality beef then you have written on the menu.  The sides with the steak were offensive, both the fries and the greens must have come out of the frozen foods section at Safeway then microwaved to limp mediocrity.  Palmers perhaps use quality ingredients like the other taverns in town, something fresh perhaps.  When our waiter asked we mentioned that the chicken and the steak were tough and both overcooked, he informed us that the chef had studied in France and blah blah, not offering to correct the problem.  I stopped listening, and asked for the check.  I am guessing that Erick does not realize we can hear him when he is speaking next to the computer, because guess what, we did hear you.  Thanks for calling us assholes and mentioning that we know nothing about food.  I have not had an experience like this and I had to think on it for about a week or so before writing this review.  How are you employed is a puzzle I will never solve.\n\nOf course The Chronicles food critic reviews the place the Sunday after we go and his review was spot on, if not a little generous.  The one thing we saw he might be wrong about, my coworker has been living in Sweden and noticed that the name of the restaurant, font and logo are the EXACT same as a German Lingerie company.  It is one of the top searches when you look up PALMERS on FB.  So the little story I read about a family friends place in Canada has to be nonsense.  This place is either owned by a German company that produces (Very Hot) ladies underwear or the owner has zero creativity and just copied everything down to the color of the lettering.  It is somewhat sad.  To see for yourself:  http://www.palmers.at", "author": "Dr I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "Watch out for Eric, he was such an @ss.  I asked him if we could get drink service and he ignored me and I was right next to him! I waited for 2 mins before he even acknowledged me! Rude!! Then after he was done he said he wasn't taking orders when I asked what were you doing and he walked off!!! Right in front me! I had to ask another waitress his name and took a picture for everyone to know who he is. Watch out and go to Harry's!", "author": "MARTIN B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "My husband and I read all these reviews and it was a mixed bag!  Big time!  So we set out to find out for ourselves.  Sunday evening.  We usually do not get the best of anything in a restaurant on a Sunday evening, so this was a real good test for Palmer's.  Delightful surprise!  The drinks, cocktails and wine were great and reasonable!  Service just right and the food as good as we hoped to be and then some!, Creative, tasty, well priced!  So, we are going back, bring friends and recommend this neighborhood gem!", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "So to start it off like six people greeted me and that was really awkward but the hostess was direct and got the ball rolling. The manager or owner seemed really overbearing. our waitress was a really nice blond lady. she was amazing and gave great service. She left us alone and gave us plenty of attention at the same time. prefect balance. The food was out of this world good and my girlfriend was really happy with her cocktails. I tried the old pal she had el diablo. We had the sole fish, flat bread, and pork chop. Damn it was tasty! we will back back. \nI'm surprised by the bad reviews. People in that neighborhood are pretty snobby I guess.", "author": "Jonny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "Had dinner tonight at Palmer's.  The food was excellent!  Atmosphere and staff made the dinner even more enjoyable.  I highly recommend the steak tartar!", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "We just tried their new happy hour specials. A perfect nosh or early meal. We had two of the $5 apps: meatballs and bacon-wrapped prawns, and delicious deviled eggs for $1.50. We also had $7 drinks. I think these prices are good from 4-6 pm. Will definitely be back!", "author": "Eve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Love the food, ambiance, service!!! Very east coast, fun place and everyone is super friendly!", "author": "Crina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "This was my husband and I's first time at Palmers and let me tell you we WILL be coming back! They have two hosts which was different than most places but both young ladies were EXTREMELY friendly and helpful. They made me feel very welcomed. The food was delicious and drinks were great. Our server was lovely and overall we had a wonderful experience. The setting is perfect for a date night or even drinks with a couple of friends. We're looking forward to coming back!", "author": "Susana C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-20", "description": "Service was awful, food was sub par. Not worth your time - better places on Fillmore and in SF.", "author": "Anna E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-05", "description": "We waited 40 minutes for one round of drinks. They messed up the order. Cool looking place but we will never be back.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-22", "description": "I want to like it, but it's really nothing exciting so far.  Went for a drink around 6pm on a Wed or Thurs. Bar was full so asked the bartender if we could sit at a table and order drinks only (mind you the restaurant part was empty), no that was not allowed. You had to order food to sit at a table, fine. Order a beer, friends arrived. We got one seat at the bar and chatted.  Friends were hungry so they asked the bartender for a menu, well apparently you couldn't eat at the bar.  Was just odd...seems like there are to many rules here. These guys own Leipold's and that place is fun, this place, so far is depressing.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "I am happy to have a bar in the neighborhood to meet friends after work. Their beer choices are very good and priced well.  The cocktails looks good nd are priced fairly too.  I tried the brown beer, which was very smooth. The best seats are at the bar and tables close to the windows. They have a food menu, which offers basics like salmon, burger, salad, squash blossoms, and more. I was hoping for a few more veggie choices or sides, so I can have a drink and a snack after work. There is a plasma TV behind the bar for viewing sporting events.  The Clay movie theater is across the street and Alta Park is on Steiner and Clay (1 block away) for a romantic stroll before or after drinks.  To the owners, please include more snacks like cheese and crackers, nuts, veggie sides to have with drinks. I have not try the food yet.", "author": "Vanessa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-19", "description": "It took 2 years to reopen but not worth the wait! Terrible service, mediocre food and filled with rowdy and obnoxious guests. Don't waste your time.", "author": "Ani N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "OK - we are happy!  We are thrilled Palmer's finally opened and I have to say the wait was worth it.  No publicity and they obviously did not need it!  We decided to walk down around 5:15 to see if by chance they were opened and Yay!  They were!\n\nWe sat at the bar and Erin, Brittany and Will were awesome!  So friendly and for just their second night - they opened around 7 last night - service and drinks were great and very reasonably priced.\n\nAt 6:30 we asked for a table and our waiter Trey was on top of everything.  He knew the menu and was able to answer our questions.  \n\nWe split the bean salad with Macorna almonds and it did not disappoint.  Tommy had the Pork Belly and I had the Cornbread Crusted Chicken with these scrumptious little sausage meatballs - pure heaven.\n\nOne of the brother's, Klaus, was warm and welcoming just like his brother Albert who we met at Leopold's a couple weeks ago!\n\nSo Palmers, we are so happy you have opened up and there's a very good chance we will visit you at least once a week.\n\nSharon and Tommy!", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-14", "description": "Nice looking restaurant in general. However, I always considered San Franciscans as compassionate toward animals. I find heads at Palmers sad an not appropriate for the dining room . They ruin your appetite as the stare down on you. They should be removed.\n\nI stopped in for a burger and a beer. Burger ok fries crispy but tasted like a vat of salt. I was tempted to have butterscotch brûlée .... I had it. Don't bother. Scorched, tough, bitter top. Stingy size. For thirty $$ the best part of my experience was my waitress Molly. Sweet and efficient. I wish she could find a job at the Balboa....who's legendary burger is safe from the competition.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "If my other half saw I gave three stars, he'd urge me to bring it down to two, but there were aspects of Palmer's that I really liked on our recent visit.  Spoiler alert: the food was not one of them.\n\nSERVICE: very attentive; the food came out quickly, and we also didn't wait long for our drinks.  Because it's a new restaurant, we were given a survey at the end to help them gauge how well they were doing so far.  I really appreciated the fact that they were open to taking feedback and making Palmer's a long-term success.\n\nDRINKS: The drink selection is great and not *too* outrageously priced.  I'd come back here for drinks if I want a bar option in Pac Heights that isn't Harry's. \n\nFOOD: This is where I don't have a lot of positive things to say, and I was really surprised at the quality of the food given that I've always had great meals at Leopold's (owners' other restaurant).  The food just seemed a notch below everything else at Palmer's; my green beans looked/tasted like they were of the frozen variety, my fries were salted beyond repair, and the steak, while cooked to the correct temperature, didn't seem to be a high-quality cut of meat.\n\nDECOR: I see other reviews think the antlers/animals on the walls are weird, but I think it gives off a cool, Italian-mob-in-a-bar kind of vibe.  I like it.\n\nOTHER PATRONS: meh.  Someone who knew the owner sat next to us and were disgusted to (over)hear that we didn't love our food when we filled out our post-meal survey.  They then proceeded to insult us for a good five minutes, calling us \"ignorant young people\".  That wasn't a direct factor in the score since Palmers didn't choose to plant them next to us, but it certainly didn't help the overall experience.", "author": "Kathleen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "Came here on a weeknight with my boyfriend to grab a few drinks after dinner. It was surprisingly crowded for a Tuesday night, but yet it only took a few minutes for two seats to free up at the  bar.\n\nI'd been drawn to Palmer's after walking by a handful of times and noticing the dark wood, leather booths, and warm lighting. The decor and atmosphere lived up to exactly what I had hoped for, but the drinks fell a little short. The cocktail list was reasonably priced by SF standards ($8.75 for all drinks on their menu), yet the list was a bit weak, lacking a good variety of drinks or anything very unique. I got the Pimm's cup which was fine, but just went for a gin and tonic after. The bar had a great variety of liquors though, so I think they have the potential to expand their list. \n\nI wouldn't go out of my way to come here, but while in the area it made for a nice end to the night.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-27", "description": "Good bartender.  An original Joes wannabe. New York Steak was a breakfast steak. Denny's may be a little better.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "Great drinks at reasonable prices.  As for the food, we have only had appetizers and they were decent and pretty inexpensive.  I used to like to sit at the bar, sip on a drink and peacefully watch a game...but they have now covered up the tv as \"so many bars in SF have tvs, we don't need one\".  Thumbs down for that move.  May come back if in the area, but not as much as I would if they still had that tv!", "author": "Ayrn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "Palmer's is a nice, local bar with a good, casual vibe. Filmore is quiet in the evenings, but Palmer's is one of the more lively places. The wines are nice. It's an SF version of Cheer's.", "author": "Frederick D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "I've missed Long Bar since it closed several years ago and was looking forward to finally trying out the new replacement. Overall the atmosphere is appealing and seating comfortable. However, the service is severely lacking -- our waitress, while pleasant, was consistently slow to return to our table.\n\nAs for the food and drinks: the french fries are terrific, but everything else we tried was mediocre. They have a decent selection of beers, wine, and liquors, but the pours are small.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "As a neighbor, I have been waiting for this space to have a decent bar/restaurant in it for the 7 years I've lived in the area.  Finally!  I love the decor, and am thrilled to have Palmer's in the neighborhood.  \n\nMy fiance and I ate dinner here, both having the burger.  I had a similar experience to the other posts here in that the portions were small.  The burger could have had a better bun, and the patty could have had the same size diameter as the burger (i.e it was small).  So I'm a little worried the food won't live up to the decor, although the former is certainly easier to change.\n\nRegardless I'm going to spend a bunch of time here.", "author": "Kristian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "Ambiance is really cool. They make some ver interesting drinks. Location is great for me, not for from my house. The bar area is a little small, but plenty of seating throughout the place.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "There isn't quite a restaurant like Palmers in the classy and quaint neighborhood of Pacific Heights. Right when you walk in, you notice the upbeat environment and multiple animal head decors on the walls. The dim lighting, detailed architecture, and hip music give it a fancy yet casual modern feel that sets the mood for a perfect dinner. If the people working there aren't enough to make you stay(the customer service is amazing!) then the food sure is. I ordered the famous Palmer burger with a side of Mac and Cheese and was I impressed! The burger was cooked to perfection and the Mac and Cheese was nothing short of the best that I've ever had! I would definitely recommend this restaurant to anyone who wants to have a fun night out with their friends just to grab a drink, or for a nice family dinner with very healthy portions. Last but not least, the prices are unbeatable!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Love this place it is very welcoming and has a great  vibe. The bar is a great place to sit have a drink and eat your meal. The food is tasty the  curry dusty fries are delicious. The drinks are great I love the penicillin. I would definitely  visit this place over and over again.", "author": "Lettisha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-11", "description": "Great addition to the neighborhood. I've been in for cocktails a few times and they don't disappoint. Food is great too. Try the deviled eggs and bone marrow.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Went in the other night with my fiancé. Tried the ribs and tartar as starters and they tasted great. I had the filet mignon and it was cooked to perfection. My fiancé had the trout and he loved it. It is covered with pancetta which gives it a great taste. The service was great and the drinks were really good. Overall a great experience will definitely come back again.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "I'm a bit surprised by the negative reviews. I had a lovely experience. My waiter Eric was totally on top of things even though I was dining solo. Very attentive, timely, responsive, friendly. My sole with potatoes was delicious. The spanish olives in the martinis are amazing, and my new friend Eric brought me an entire toothpick full of them after I polished off the first couple. All in all a good, solid experience. Happy to have this location back in business. \n\nI am bothered by the dead animals on the wall (this is san francisco, people, not Texas... really?) but tried to avoid looking at them.", "author": "jennifer r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "The fifth star is for the best trout preparation ever (and I came from Trout Land before I came from the Cool Grey City of Love, and my trout-loving lover has even deeper exposure to the mountain-farmed fish), which is what got us into the restaurant in the first place.\n\nOur experience actually started in my old neighborhood, on Polk just north of Union, where I wanted to try the replacement for an Italian place that I had liked there.  Leopold's is Austrian, with an impressive beer list, and a group of noisy techies playing mating games at the window table.  My companion's eyes lit upon a trout wrapped in pancetta; it is rare that she passes a trout dish on a restaurant menu. I had  the pappardelle, and we shared a beet and endive salad.  Had I done my Yelp duty then, I would have given Leopold's 5 stars.  Alas, I no longer can.  \n\nSo a few weeks later we were back in the City, and I asked, back to Leopold's whose menu I want to explore further, or (since we were in a pet-friendly motel near the west end of Lombard) take the 22 up and check out the lower-Pacific-Heights restaurants?  Long pause.  The trout sounded good. But, being born to be wild, we went out in search of Adventure, and headed for the best bus line in San Francisco. \n\nThe last place we looked at had the appearance of a youth-oriented meat market, but we are rather pretty for old people and I lack the shame gene, so we dared to approach the entry-way menu.  The first thing my eye saw?  Pancetta-wrapped trout.  In we went.\n\nIt is indeed an attractive, well-designed restaurant with a classic dark-wood look appropriate for the concept.  The animal heads, well, read on.\n\nMy partner's choice being already made, I dug into the menu.  Hey, look, roast-beet salad, the last one we had at Leopold's was awesome.  Wait a minute...pappardelle, with parsnips?  I mean, it was really good at Leopold's, but this is supposed to be a New American place, the other restaurant with the same interesting menu has Austrian heraldry  all over the walls, along with a truly impressive collection of ungulate heads.\n\nSo yes, Palmers is owned by a man who came to San Francisco 20 years ago from Salzburg,  opened in a primo Russian Hill location a few years ago, and now has a hot spot on Fillmore.  Congratulations.\n\nI ended up with the lamb shank, which was just as good as everything else.  Then after Christmas we took my sisters and brother-in-law for a reunion dinner (all of us now from out of town), because my elder sister has as long and deep a love affair with the trout of our home mountains as does my companion.  So more samples were made of the trout (and I got my tastes in), and we got a wide exploration of appetizers (roast marrow!  Yum!) and main courses.  Every single dish was interesting and done well.  The food really is based on the somewhat rural tastes of  Mountain Austria.  I can only imagine what they would do with venison.  That means somewhat less gimcrackery around bizarre high-tech preparations of food ingredients.  At both Leopolds and Palmers, you can recognize what you are eating.  The kitchen celebrates the ingredients, which drives this reviewer to celebrate the kitchen.\n\nThis is one busy place, and new.  I see that Dr. I had a dinner from hell.  It may be that his server recognized a diner from hell.  I can say that the servers were very busy, but I thought handled the press (we were there at prime time on a Friday night) very well.  If Palmer's is not yet at the top of its game, (1) I did not see it, the place was ticking beautifully, and (2) it has only been open a few months, there may still be some glitches which will undoubtedly be identified and worked out.  If it continues on track it is a hit restaurant.  \n\nSo about the trout.\n\nIt is served apparently whole, wrapped in pancetta and pan-fried, with fixin's. Raised on trout that is pan-fried and served whole, with the diner carefully lifting the tail to leave one cooked filet behind then flipping the carcass and repeating (a process that removes most but never all of the skeleton), we approached the fish with care.  The pancette tied everything together:  our at-table filet technique would not work.  So we dove in with a sharp knife, and found:\n\nNo bones.  Flesh still moist, some of it due no doubt to the basting of the surrounding pancetta.  Still no bones.  That was at Leopold's.  What was it about the Palmer's prep that made it slightly better than what I had declared, 6 weeks earlier \"the best trout preparation ever\"? It is the reason I couldn't 5-star Leopold's.  I should have said \"best trout yet,\" then repeated that pronouncement  the next time we had the dish, and then again the time after that.\n\nThis is a not-uncommon preparation for trout in Salzburger Province,  enjoyed by a native of that beautiful mountainous region who has brought his skills, drive, and favorite dishes to a new home in California.  We are lucky to have him.", "author": "Marcus S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-29", "description": "Great decor and beer variety but marginal service. Crowded sitting area for drinks and the waitress seemed annoyed that I was interfering with her work flow. When she asked me to move so she could plug in her iPhone I left. Not a good place to get casual drinks with a group.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-31", "description": "My husband and I were very excited to try the \"new place\" on Fillmore St. Loved the decor,  but lose the dead animal heads...\nSpouse enjoyed the skirt steak, spinach a little too garlicky; on recommendation of bartender, I ordered the burger. I don't mind paying 13$ for a burger, but they don't have mustard???? That's a standard American condiment.  How do you have a kitchen sans mustard?  Curry fries were curiously tasty,service from Maricur excellent.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "The Gnocchi. Little clouds sent straight from heaven and into my mouth. What did I do to deserve this?\n\nWent into the city for a day trip with my family and happened up on this little gem. I loved my experience at Palmer's from the moment I stepped in to the moment I food coma'd. Great vibe, great food (hearty portions!), great classic cocktails, and amazing service! Definitely coming back here next time I'm in the city.\n\nThings you CANNOT pass up: \n    -the gnocchi: best gnocchi I have ever had\n    -the burger: incredibly juicy and well seasoned\n    -the mussels: woooooow that sauce+bread=gold\n\nGood to know that amazing food in the city doesn't have to come in tiny portions/be overpriced.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "2nd best burger in San Francisco.\n\nGood go-to neighborhood spot for a few apps, a burger, and some cocktails with friends. \n\nOnly negative is they don't take Amex.", "author": "Harry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "Service is always great at this place.  Space is awesome, drinks are good.  Food had been lacking in previous experiences, but recently had the mussels and they were some of the best I've had in SF.  The steaks at the bottom of the menu (I'd overlooked them previously) are great, too.  Pair that with a martini and boom goes the dynamite.", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "I was very pleasantly surprised by how far Palmer's has come since first opening.  The beer list is very good (particularly the bottle list if you like Belgian beers) and the wine list has improved as well.  Both the appetizers at the bar & the dinner food were simple and fresh.  My salmon was hot, but not-overcooked, and thank God prepared without a sauce that overwhelmed the course itself.  Our waitress was attentive on a busy night.  You can't beat the owner/host Klaus for conviviality and concern.  I'm very pleased to see this long-vacant spot busy with Palmer's!", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Doug and JD seriously know their bourbons!!! Plus they have a great happy hour from 4-6. Deviled eggs and ribs cannot be missed!!!", "author": "Joanne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Very cool bar/restaurant.  I have been there three times for drinks and each time the clientele were different (one night mostly guys, second time mostly women and third was mostly couples).  Bartenders were knowledgeable and attentive.  Drinks are pricey.  I will avoid for dinner until they refine their food/service based on other reviews.  There are many other food choices in the neighborhood and it is always more enjoyable to have dinner and after dinner drinks at different places.", "author": "Neil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "Classic bar and grill.  Great afternoon and early evening sunshine, given their western exposure.  Fantastic happy hour.  Great neighborhood place, fantastic bar and good service.  Oh, and get this:  the food is fantastic!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "TL;DR good value but service is not 100% there. \n\nPretty good (and apparently pretty new) spot in Pac Heights. Prices are not as inflated as most places are in this neighborhood (8 dollar cocktails, 20 dollar entrees). Wait staff was not very familiar with the menu, which was slightly annoying. Ordered the trout, which was done very well.", "author": "Louis A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Came here for Fathers Day Brunch. We were seated right away. The food was excellent. Three of us ordered the omelette with house fries on the side. The eggs were fluffy and cooked with the barest of crunch on the edge. The potatoes with peppers and onions done just right. I ordered a side of bacon and the serving size was so large I did not finish. Coffee was hot and tasty and the server kept our cups filled.  Another person ordered the burger with avocado and an egg on top and it was huge and that person was very pleased with his meal as well.  The ambience of the place with its retro bar vibe was very nice.", "author": "Katherine D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-01", "description": "I realize it's Halloween and you've been harassed by drunk people all night, but you work in a bar. Put a smile on your face and get over it. I would like to try this place on a regular night and give them a chance but first impression was not positive.", "author": "Jacque Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "Drinks only review.  Love the atmosphere, very lively and feels like a restaurant out of the past.  We sat in a red vinyl booth, open on both sides, and enjoyed a cocktail with friends.  Can't speak to the food but very solid option for a drink.", "author": "Rich L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "I found PALMER just by accident. Had a friend visiting. We had Francine for our server in the bar. She was fabulous. The hostess was also very nice & professional. I was there the Sunday of Presidents' Day weekend. The place was packed. Loved the food. The trout was a culinary delight. Bravo to the chef. Give the place a try. I will be a returning customer!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "Brunch brunch brunch! The service and food is great for brunch!!! Dinner.... Not so much. Very rude cocktail server who seemed irritated she was sat. And the food was very basic.", "author": "Shelly P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "love this place but the service is not great, especially on busy nights they are disorganized. bartender didn't give us the bill. got transferred over to our table and the waitress was very confused. forgot about a drink we ordered which we had to remind her of and came 30 min later. had to call us after about the initial bill that they said wasn't paid. a little more organization and staff would be great!", "author": "Katie E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-23", "description": "Had dinner here. Not vegetarian friendly at all - 2 stars for the food, but 4 stars for amazing cocktails and good service! I love the vibe this place has but will stick to cocktails next time!", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "I tried this restaurant on the recommendation of a friend and loved it from the moment I walked in.  Their choice of music (20's, 30's, 40's) and the gleaming wood bar packed with people were perfect.  Bartenders were all vey friendly and efficient.\n\nDinner was excellent (heirloom tomato salad, shared aged beef, and coconut cake dessert) .  Portions are on the small side but I thought reasonably priced..... And nice not to get portions where I either have to leave half of it behind, or take it home and then never eat it.  The prime rib was exceptional and cooked perfectly.\n\nMy only complaint was the potato bread...... Undercooked and over priced.  If I hadn't ordered this starter I would have given them a 5 star rating!  \n\nAll in all, I am sorry this isn't my local restaurant.", "author": "Marion E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-08", "description": "We had such a great experience at Palmer's Tavern. We started with the Shrimp appetizer, the shrimp were so large they were the size of lobsters. We then had the Trout wrapped in pancetta, which was to die for. I'm a huge fan of trout, and this was by far the best! Our waiter Eric was fantastic, our entire dinner went so smoothly even on a very busy night. After talking with him we learned that he used to wait tables at the Slanted Door, so I'm sure he's accustomed to high volume restaurants. The entire staff was just so wonderful, including the owner, Albert, who stopped by to greet us. We will certainly be going back!", "author": "Debi D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-13", "description": "I want so much to Like this place.  Here's a brief description of my twice experience.  You enter to a great bar/restaurant with a flat screen over the bar showing sports highlights.  Then you look around and listen...it's a sandbox of lonely Pac-Heights \"girls\" that sit at the bar talking smack about their \"friends\" in shrill voices!  If they could hear themselves they would be embarrassed...or I would hope!  Such a sad experience for a great location.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "We went back into Palmers last week and had a great meal.  I heard they made some changes since its early weeks, so I thought I would give a neighborhood joint a second shot.  I was more than pleased with my visit.  My filet mignon and my wife's chicken w/ fries were delicious.  We finished up with the coconut cake, which was sublime.  The drinks were liberal in pour and judicious in price.  Nice to have a good go to place on Fillmore.", "author": "Niall V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "Was very excited for this place to open and the drinks/ambiance did not disappoint. I loved the attention to detail from the sconces,old photographs to the mounted animal heads and swordfish. The jazz was the perfect accompaniment to my classic cocktail. The owner was also very attentive - without me having to ask, he closed the front door to keep me from getting too chilly from the breeze. Cant comment on the food, since I didn't try but I hope they focus on adjusting that based on the reviews below. Super excited that I don't have to go to Harry's anymore!", "author": "Kristin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-25", "description": "Had a delightful bar dinner and would be recommending if I hadn't discovered the next day they had charged me twice, but for a slightly different amount.  Called and spoke to a manager who said she would get back to me after the weekend.  That was a week ago - no call - but they charged me AGAIN the day she was supposed to call.  Three times!  Card has been cancelled and fraud investigation started.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "It was tooooooo noisy.  However it was fun.  Cocktails so so, food so so, just average. Was expecting better quality food, though the salad was excellent.  The wine was excellent too.  Had the special of that night and somehow it missed it by a little. I was actually served old burnt coffee.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-16", "description": "The last thing the Filmore street area needs is a pretentious bar.  Unfortunately, that describes Palmer's all too well. My friends and I have been waiting for months (literally) to try Palmer's.  We live very close and were excited for a new neighborhood watering hole.  Excitement has now turned to extreme disappointment. \n\nHere is my Palmer's story:\n\nThe first thing I notice is that we are the ONLY people under age 35 at this place.  So if you are looking to meet \"young\" individuals, this is not the right place. Upon walking in, I was forced to keep my sunglasses on due to sun rays blazing into the bar.  Apparently blinds were never discussed during the years of renovations.  \n\nThere was ONE table occupied and everyone else was standing in the bar area. After asking the hostess for a table, she rudely (this is a common theme) tells us that you must order food to sit down.  After little discussion, we decide to order an appetizer so that we can sit down at a table.  We inform the hostess that there will be four people total, although only 3 are present.  She, once again, rudely tells us that everyone must be present in order to be sat at a table--we quickly changed our magic number to three and figured our friend could squeeze in when she arrived.  I understand the not-seated-until-entire-party-is-here rule, but this is not Nick's Tacos on a Tuesday night--this is a brand new bar with one table occupied.  Give me a God-damn break!  On our way to the table in the back, I am beyond puzzled as to why this \"tavern\" is so un-accomodating  This hostess must have missed the training day about being polite to customers, in addition to lacking common manners.  \n\nThe menu was less-than impressive, but I was willing to try something in order to avoid getting sunburned inside. After sitting at the table for what seemed like 15 minutes without seeing a server, we decided to leave.  And never come back.", "author": "Susanne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Like everyone else I have been eagerly anticipating the opening of Palmer's Tavern and was disappointed not to be there on the very first night of the soft opening, went the very next night! The atmosphere, service and cocktails are top notch. The only reason I am giving 4 and not 5 stars is the dinner portions seem small. I had the Squash Blossoms (delicious) but the portion seemed more like an appetizer, for a  $17 entree I would like to feel full. A friend had the Hen which was also delicious but the portions were again small for an entree. Can't wait to go back, I know I am going to be a regular i just hope they put a bit more on the plate.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "I brought my family on a whim, but ended up actually really liking the restaurant. I had the sage gnocchi with bolognese sauce and it is now one of my go-to favorites. Our waitress, Molly, gave some solid recommendations on which which appetizers to start off with and the staff as a whole seemed extremely knowledgeable and pleasant. I would highly recommend the flatbread and spicy meatballs. Some of the best I've ever had in the city!", "author": "Grant K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "Twice now I've come in here and the bartender (same one) has been awful to me.  Thought maybe he was having a bad night the first time and let it go (my friend from out of town could not believe how rude and dismissive he was to us both, didn't acknowledge us sitting at the bar for a good 10 minutes even though the place was empty).  I blow it off and go back and SAME THING.  What the hell!?  Be nice dude!!!!   Wake up and BE NICE!!!  This is a BAR and people want to feel welcome at the very least.  Ever seen \"Cheers\" and heard the term \"where everyone knows your name?\"  My god, once was bad but twice!?  Figure it out, you're in the service industry, if you don't like being nice to people ... Then get another job.  There are like NO good bars on Fillmore Street and this place should be a welcome change and exciting place for the neighborhood but I am astounded at my experiences here.  I was so excited when it opened since I live just a couple blocks away and the street really really needs a great bar.  But I will probably never go back again.  BE NICE SO PEOPLE WANT TO COME HERE (jerk!!!!!!).", "author": "Christin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "I love a good cocktail and Palmer's has it dialed in on this front.  The décor is very 1940's with plush red leather booths, animal trophy heads on the walls and lovely vintage looking lighting fixtures... love it!  All the meals I've had are excellent and their curry fries are stellar. They serve them in a tall narrow glass wrapped in paper which keeps them hot for a very long time... how clever is that? Get yourself into Palmer's soon and enjoy a stylish night at a fine dining establishment!", "author": "Deirdre R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-30", "description": "Have only been to Palmers once before. It was on a very busy Friday nite. Only complaint was they couldn't find the peppermill to give us fresh ground pepper. Decided to try it tonite on a Sunday.  I sat down to get a drink while waiting on a friend. 5 minutes went by.  A girl and a guy bartender, no one made eye contact. Finally got a glass of wine. Then my friend came in, she sat there for at least 10 minutes, when she finally got the bartenders attention he bought her drink because she was obviously upset.  Just got worse. We had one appetizer and another drink. We sat there with empty glasses while no one made eye contact once again. We left and went down the street to the Elite where we got good service and food.  No more Palmer's for me. Sorry Long Bar went away.", "author": "Nel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "We had a great dinner.  Food was excellent and service very attentive and knowledgeable.  Enjoyed the ambiance, despite the mounted animal heads on the wall.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "good happy hour w/ some cocktail specials.  i did not like the deviled egg though, b/c it was overcooked.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-19", "description": "We live in the neighborhood and have been anxious to try this spot, since it would be so convenient and also because we could use another great local place.  On the plus side, special cocktails were $8.75 which are a bargain. Also, our waiter was responsive especially when I didn't actually like the cocktail that I ordered.  When our filet arrived done versus medium rare, he also didn't skip a beat to return it.  Portion sizes were actually quite large as well - the flatbread could have worked for 3-4 people. Unfortunately, I would agree with a lot of the other comments - service is not pro-active. Water glasses continued to sit empty even when the tables next to us had their water refilled. Silverware would disappear and we would have to ask for more. The food was also not remarkable - the flatbread was the best part of the meal. The pappardelle with mushrooms was very gummy - which we felt must have meant that it was sitting for a while. The spinach side dish was very runny and had no flavor. The decor was very odd with the deer heads, and some decor reminiscent of the 30s or 40s but the menu didn't quite go and neither did some of the other decor on the walls. All in all, it felt very disjointed. We won't return as there are too many other great restaurants in the city - and even in the 'hood.", "author": "SY K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-06", "description": "Clearly this place is a bar that just happens to serve food.  So I didn't have super high expectations as to the menu.  Being this was my first visit I was unaware that a megaphone was necessary to communicate with others in our party.  EXTREMELY LOUD!  Like 1st row at a rock concert loud.  Not sure why they don't opt for some sound boards strategically placed to cut down on the decimals.  It was a Friday night but really it was totally ridiculously loud. Our server was really nice but didn't mention the specials, I just happen to over hear her  yell to the table next to us they had specials.  I was bummed because the Burrata starter sounded so much better than the salad I ordered.  Our wedge salad arrived shortly and it was truly terrible. Soaked with vinegar dressing and little to no blue cheese which is just weird.  My husband thought it was ok but I couldn't eat it so I ordered the Burrata which was just ok. We had the hamburger which was nicely prepared and the fries were good, but they never did bring us ketchup which would have been nice.  At the end of the day the food was just ok at best.  I will say this we were surprised at how reasonable the price of the bill was.  One of our less expensive dinners in the city to date.  In my opinion if you serve food in this city you better get it right and it better be great. Too much competition. I can't see myself going back for anything else other than an early afternoon quick drink with friends then move on to any number or restaurants in the neighborhood that offer amazing cuisine and allow you to actually hear what others have to say in your party.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "Stopped in the other night, sat at the bar for some drinks and food.  Great tasty drinks served up by the friendly barkeep, Doug who also had perfect food suggestions.  Amazing service, great drinks & food, nice adult atmosphere, will definitely return.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "Loved my first dinner at Palmer's and look forward to many more.   I tried it out with a group of five foodie friends and we all loved it.  The ambiance is romantic, old style SF -- makes a lady want to wear fishnets and a gardenia in her hair and snuggle with a beau in those red leather booths.   My perfect Manhattan was perfect and everyone else loved their house specialty cocktails  -- also high marks for the delicious dry Riesling.  Everything we ate was superb -- standouts were the just right meaty, meaty burger with divine housemade chips, squash blossoms and farro, kobe beef, roast chicken and we all loved the heirloom tomato salad.  Service was sassy and friendly -- just as it should be in a retro tavern.   Can't wait to go back!!!", "author": "Susie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "I haven't been in here in a while and when i did recently i was sad to find that Eric was no longer around. Off to greener pastures i suppose but either way,your mark was left. Gone but not forgotten. This place attracts a Douchy crowd. Not their fault,  it just goes to show the marina is expanding at an incredible rate.  The food was good(better than it needed to be actually), our waitress hot, and the germans were friendly.  Ill be back. for 4 beer or whatever", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "I visited Palmer's this week while back in the Bay Area visiting from southern California.  I loved it!  It really made me miss San Francisco and the fabulous food  scene here.  This place had it all - super cool decor and ambiance, warm welcome from the owners (brothers), attentive staff  and of course, great food and drinks.  Everyone at the table enjoyed their meal - heirloom tomatoes (yum), salmon (double yum), burger, steak and fries - perfect tavern food elevated.  This will be my go-to place whenever I am in town.", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "I went last week with a group of friends and had a great time at this restaurant !  Between us all we ordered and shared a bunch of dishes - butter lettuce w/ heirloom tomatoes, steak tartare, caesar salad, burger, steak frites, halibut to name a few.  Everything was delice !  We were stuffed but found room for their yummy dessert.  The staff were all super friendly and welcoming.  I'll be back next week !", "author": "Siobhan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-05", "description": "Palmer's has a bit of an identity crisis.  Is it an upscale bar with good food or is it an upscale restaurant with a bar area?  It seems they are trying to be the latter, which is a problem, because the food was average-to-bad at a premium price.  My burger was just ok; I expected a lot more for $13  Just down the street you could do a lot better at Harry's or Roam.  My friend got the wagyu beef, which he dared me to try, and it was so rubbery that I couldn't swallow it and had to spit it out.  The atmosphere however was great.  They retained the charm of Long Bar.  They took away a TV or two along with a communal bar stool table which was above the bar area, so it is no longer a good place to watch a sporting event.  I think everyone in Pac Heights was sad to see Long Bar go and are excited to see Palmer's do well.  I just don't see how it will with overpriced, unsatisfactory food in a city like SF, where everyone knows good food.  Honestly, to draw customers from Harry's or Elite Cafe (both a few blocks down on Fillmore), Palmer's is going to have to do a lot better.", "author": "Andrew E."}
