{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "This has been my spot ever since I was a kid. I think back to all the times my grandma would promise that if I came with her to buy verduras and behaved that we would go get pan at La Mexicana. My favorites are the gusano's (worm) they're a sugar coated bread that look kind of like a worm. They're filled with that delicious soft bread goodness! I also think they have good Conchas and butter cookies with raspberry on top. Grab a tray and tongs and load up! \n\nBtw-I'm pretty sure they're cash only. Get there early for the warmest freshest bread, although I believe the bakers bake throughout the morning. Avoid Sunday's as they don't bake that day, so it's slim pickins", "author": "Athena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-11", "description": "3.5 stars\n\nThis was my first visit to Panaderia La Mexicana Bakery and my first visit to a panaderia in the US (prior visits were in Mexico).  I selected three items to try - the concha, the coconut jam roll and a puff pastry topped with chocolate and coconut flakes.  I liked that all were quite fresh and not too sweet.  However, they I found all them them to be a bit bland with no pronounced flavors of cinnamon, vanilla or even butter.  Perhaps I picked the wrong items or perhaps I picked items with similar taste profiles.  Of the three, I liked the concha the most.\n\nThe bakery was nearly empty during my visit on a weekday just before noon.  Trays and tongs are stacked by the register.  None of the products are labeled or have prices listed.  \n\nWhen I presented my items for payment, I was quoted $3.  When I asked if that was for each or for all three items the cashier then told me the total was $5.  Cash only.\n\nParking on 24th was plentiful when I walked in but less available when I left, with more spots open on the side streets.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-24", "description": "Located on 24th in the Mission is Panaderia La Mexicana. I walked in and there was no one present  in the front , I believe they were in the back. \n\nFinally someone came to the front and I grabbed my serving tray and snagged a single piece of Elote which is a mexican sweet bread that looks like a corn stalk.  Only .90 cents a piece which is good\n. \nTaste:\nIt was very underwhelming so that's why I gave it a 2 star rating especially given I've been to more than a few Panaderia's in my lifetime. Felt a little dry and just didn't have that much flavor compared to other Panaderias I've visited.\n\nI like lists what can I say? \nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. \n\nHere is a look at how I rank the SF Bakeries I've visited and I indicated what they're known for or a dish I recommend:\n\nRod's SF Bakery rankings (and what they're known for or what I like). ?) Follow my profile to see my most recent reviews I hope I can be helpful since so many Yelpers have helped me discover new places. \n1 Neighbor Bakehouse=cinammon almond bostock\n2 B Patisserie=Choco Bannana croissant\n3 Zanze's Cheesecake=Regular cheesecake\n4 Ariscault =Croissant\n5 Yasukochis=Coffee Crunch Cake\n6 Chili Pies Baking Co=Pies\n7 Dynamo Donuts=donuts\n8 Golden Gate Bakery=Egg tart\n9 Mr Holmes Bakehouse=Green tea croissant ,Cruffin, \n10 La Luna Cupcakes=cupcakes\n11 Three Babes Bakeshop=pies\n12 Anthony's Cookies=Cookies\n13 New Hollywood Bakery=Egg tart\n14 Dianda's Italian American Pastry=Napoleon , Cannoli\n15 Mission Pies=Banana Cream Pie\n16 Schubert=Swedish Princess cake\n17 Yummy Bakery=egg tarts\n18 Stella Pastry & Café=Cannoli , Tiramisu\n19 Craftsman & Wolves=Rebel within\n20 Bob's Donut & Pastry Shop=any donut \n21 Noe Valley Bakery=dipped cupcake\n22 Café Greco=Cannoli \n23 Kings Bakery=Tres leches cake\n24 Benkyodo Co=mochi\n25 Cupcake cove=cupcakes\n26 Cups and Cakes Bakery=cupcakes\n27 Good Mong Kok Bakery=dim sum\n28 Karas cupcake=cupcakes\n29 Mission Minis=cupcakes\n30 Sift Dessert=cupcakes\n31 Tartine Bakery=lemon tart\n32 Jane The Bakery=matcha twist , cardamom Lattice Bun\n33 Café Madeline=various goods\n34 Panaderia La Mexicana=mexican sweet bread\n35 Hot cookie=Cookies\n36 Les Gourmands Bakery=Croissant\n37 Mee Mee Bakery=Cow ears", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "First time visiting a Mexican Bakery and it's in non other than the \"Little Mexico\" of San Francisco!! (This review is written from the lens of someone who eats Chinese Bakery buns almost everyday).\n\nWalking in, it reminded me of the Chinese bakeries that I visit often. When you walk in, you pick up a tray and tongs to clip your buns. There are no prices list out in the open, nor are there signs to label the buns to describe what kinds of buns they are, but that's part of the surprise of buying the buns!\n\nI went straight for the turtle shaped panaderia bun! (We grabbed two of these) The bun itself was shaped like a turtle, it was a little softer than the buns you have at a Western supermarket, but it was slightly tougher than the traditional Chinese buns. The bottom part of the bun is a little harder too! This bun reminded me of the pineapple bun, but the top portion is thicker, no honey and a little more like a soft cookie compared to the pineapple bun - pretty delicious!!\n\nMy friend got the cinnamon bun looking item. We were both not a big fan of grabbing this item as it tasted like rum and it was a little more moist than a cake. \n\nIn addition, we tried two of the sweet buns with sugar on it and one of the cookies. All together, the cost of 6 items was roughly $8.50, not bad!!! If I lived in this area, I would probably come here often for their buns!", "author": "Kristy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "I love this place. I have to periodically refrain from bread/pan dulce, but when I can eat it, this is my local bakery. I love the quesadillas with sesame seeds, especially the heart-shaped ones. Sort of crunchy on the edges and so moist inside, mmmmm. I love that they don't use too much sugar, pastries aren't overly sweet but flavorful. I really like the cream-filled cuernitos. I can feel my diet slipping... I've been coming here since the early 90s, and when I'm in the mood, they never let me down. One of the family places that are so sadly disappearing in the Mission, this one is really special. So grateful that they are still here, and represent on the holidays.", "author": "Wendy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "I've been coming to this bakery 40+ years. This family owned business takes pride in what they do by providing excellent customer service, maintaining a clean venue and fabulous traditional Pan Mexicano aka Mexican Bread. \nComing to enjoy a treat from here has me doing the happy dance. The consistency in taste and variety of selection makes it hard to chose just a few treats. Buen Provecho", "author": "Dee Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Growing up on this bread I've had the good and the bad of Mexican Pan (bread).  This place makes great pan! I don't live in the area, but every time (pretty much every time I'm in the City) I am in the area I make it a mission to get pan here.  Mind you early AM is best when they just baked it and you have a variety to choose from, but there is a lot of people inside the place all the time. I recommend anything with pineapple. Oh and the coffee is great too because the make it with real cinnamon. Cash Only!", "author": "Oscar I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "Super solid concha at fresh and reasonable prices. You will pay more than the grocery stores nearby but I think the quality is worth it. Show up early and the pan will still be warm. Mmmmmm.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "Welcome to affordable bliss. Standard well made Mexican and Central American breakfast breads and pastries. My standout favorite is the Salvadorean-style quesadilla, a small, sweet, circular, crispy-edged, soft-centered, subtly-cheesy, sesame seed topped, four-bite wonder... that pairs well with a good cup of coffee. Enjoy!", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "If you're ever in this area, go to this Mexican bakery. I have only been once and stumbled upon it when I had a ten-minute wait between bus transfers and my fat ass wanted some baked goods at 9:30 AM. From the bus stop, the store sign was in sight. I checked my phone to see how much time I had and made the right decision by hustlin' into this bakery.\n\nUpon arrival, I was in awe at the shelves of bread. I'm not familiar with Mexican baked goods so I have no idea what most of them are. For n00bs like me, little labels would be great. Without knowing prices, my $5 bill got me at least two items -- the vanilla custard/pudding empanada and the turtle bread. Why? Well, I saw another customer buy the empanada and I chose the turtle bread because it looked cute.\n\nThe verdict: Vanilla pudding empanada was damn tasty. Soft, thick outside and not-too-sweet, jiggly filling. Winner! Turtle bread was essentially a giant dinner roll with the Chinese pineapple bun topping. It tasted good but kinda dry.\n\nCash only!", "author": "Liana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Incredibly fresh and delicious pan dulce. Wide selection, reasonable prices, friendly and efficient staff. If I lived nearby I would be here daily!", "author": "Nina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "Came to this place for some last minute bread for day or the dead which we celebrate. The bread was good and prices were reasonable. The staff was friendly and quick. The only reason I didn't give ot 5 stars was due to parking. There is not a lot of parking available in this area.", "author": "Alexandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "Best bakery EVER! Grew up right around the corner on York street. Growing up we ALWAYS had some pan dulce from this Panaderia in our home.  From the early 80's until now this is hands down the best I have ever had!", "author": "Soraya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "The price is affordable, the girl at the cashier is VERY nice, and the pastries are typically very fresh! If you come in the morning, you'll notice a fairly long line but it goes by really quickly. Everyone comes for their fresh custard pastry and their croissants. \n\nI love their cream donuts when they're fresh. Their chocolate muffin is my go-to, usually. I'm yet to try their cookies but I heard they're good too!", "author": "Raakin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "someone brought these pastries into work...delicious and not too sweet. Definitely the best Mexican pan dulce I've had.", "author": "M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "I love this place and have been coming here since a little girl. Great Mexican fresh bread!", "author": "Sky P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "I randomly stumbled upon this bakery when I was walking to a Dolores Park picnic some years ago.  It feels wrong to show up empty handed, so I walked into this shop, captivated by the smell and racks upon racks of pastries.  One of the pastries that I grabbed was this bread pudding-like thing (I know, very eloquently described).  \n\nThere's no better way to describe what it was like to bite into it except to say that this was one of three SF pastries that caused me to have a come-to-Jesus moment.\n\nCue to this past weekend when I really wanted a friend to experience this come-to-Jesus moment.  I drove all the way to the Mission, parked my car and put money in the meter just to come to this place.  Walked in.  There was no bread pudding.\n\n\"Excuse me, do you have any bread pudding?\"\n\"No, we just sold out\" (oh hell no)\n\"B-b-b-but -- it's my favorite thing here!  I drove all the way out here just for it!  I wanted to bring it to a picnic!\"\n\"Okay, hold on... (he goes to the back and comes out with a piece of bread pudding)  Is this what you wanted?\"\n\"Yes!\"\n\"This is the last piece and I had just removed it from the display case.  Do you still want it?\"\n\"Uh, yeah, I still want it.\" \n\"Tell you what -- I'll give this to you for free so you can take it to your picnic. (hands bag to me)  Enjoy.\"\n\nI tried to buy some other pastries, but he told me it was alright, implying that I didn't have to buy anything just because he gave me a piece of bread pudding, but I insisted I needed to bring more to the picnic.\n\nAs if having that bread pudding wasn't enough to make my day, that experience here put a smile on my face for the rest of the day.\n\nThe pastries may or may not have arrived to the picnic with a chunk missing from every piece :)", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "The Best Bread I've ever Tasted in San Francisco, Very Nice People, freshly made With The ingredients and Worth The Price I Highly Recommend. they also Have a Little bit of everything for Every one you Won't be Disappointed!! Go and Try it Seriously you'll Love it I give it a 5 start Quality Taste !! I would Definitely come back again", "author": "Efrain A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Very cute attendant at the cashier, she helped me pick my pastries by telling me what they were like inside. The place is clean compare to other stores in this city. She was funny bc she was keeping the pigeons off from entering the store.\nI got the chocolate and vanilla pound cake (buttery and dense) as well as a raspberry jam cookie thing. The type of flavor you get from your grand ma baking! I'll come back, and I can tell you I am hard person to please flavor and service wise. Hands down for cheap and good baking goods.\nMuchas gracias :)", "author": "Jules B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "If you're having trouble leveling up with just coffee, one bite of any of their breads will have you going Super Saiyan.\n\nMy favorite is their golden buttery quesadillas, goes well with a cup of cafe de olla.", "author": "Darth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "The best Mexican bakery in the Bay Area. Anything filled with custard are my personal favorites but their sweet bread (Pan Dulce) is famous in the Mission. BTW, the door is handicap friendly!", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "A must stop in San Francisco. The older couple who runs the place are very friendly and their desserts and breads are the best.\n\nI highly recommend stopping here!", "author": "Evan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Getting panned.\n\nTech workers: http://www.sfgate.com/bayarea/article/S-F-tech-companies-civic-image-at-stake-as-5065669.php\n\nLa Mexicana wonders: Pan dulce sprinkled with sugar, donuts sprinkled with sugar, fresh baked bread.....not sprinkled with sugar. Would have been all for it.\n\nThree bucks for the delicious trio. Three bucks to remind ourselves some things about the Mission should never change.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "Best sweet bread in the state of California !!\nI dream about her fresh baked pasties, extremely inexpensive and close to great book stores, while touring the mission you have to stop in !", "author": "Breyan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Always scrumptious  the quesadilla (Salvadorean name for it) is my favorite! My kids love the sprinkle anything lol and my cousin swears by their cookies!! I don't like coming too late in the afternoon cause it feels like I missed all the good stuff, but I still manage to get some deliciousness!! The gusanos & cuernos are also a favorite!!", "author": "LoveAlways J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Bomb bakery! A fantastic traditional panaderia! Consistent, tasty, great customer service and better than some of their not-so-pleasant neighbors.", "author": "CHADWICK B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "I was making my way toward an event and I needed something for dinner when I stumbled upon Panaderia.  Even though it was late in the day (right around 6pm), there were still many items on the shelves.\n\nUnfortunately I don't speak a word of Spanish, so I had some trouble distinguishing what each item was.  The gentleman behind the counter tried to help as best he could and I greatly appreciated it.  \n\nI ended up with a Mexican wedding cookie for only $0.75!  I was amazed at the price for the size and had to hold myself back from purchasing more.  The cookie was simple and delicious.  The only thing I would have changed is the amount of powdered sugar on top (I have a tendency to make a mess...).\n\nI would love to return to Panaderia La Mexicana (with a translator) to try out some of their other traditional items.  The price is right and the people service was great.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-07", "description": "Stale pastries WITH MOLD!! The reviews here were totally misleading. Don't waste your time.", "author": "Catheria S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-11", "description": "I need to come back here with someone who knows the pastries!! I've had Mexican bakery goods before and thought I would be able to figure things out, but nope. There are no signs or labels here whatsoever, and the only guy that was working here (that I could see) didn't look friendly/helpful at all. I picked two pastries that looked like they were custard filled (http://www.yelp.com/biz_photos/o_687zG5kw-GdtVCMN7Z7g?select=7kH8K3iME7-axP9-nHNNbQ#sAXTNDwftX22sdH-iO9pTw, http://www.yelp.com/biz_photos/o_687zG5kw-GdtVCMN7Z7g?select=7kH8K3iME7-axP9-nHNNbQ#nJ4p-R7oVW6r5z0WivzgfQ) and went to the counter to pay. I might've been ripped off since there were also no prices posted, but will never know. I liked the first pastry a lot better than the second, which looked pasty and undercooked, and tasted kind of undercooked. However, there were 20+ different types of baked goods to choose from, so they are not lacking in variety! I would still come back, but only with a Mexican baked goods expert! Parking can be tough in this area, but it's do-able.. and Humphrey Slocombe's is only a couple of blocks away!", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "The best panaderia in the MIssion, for sure. The fresh-out-of-the-oven trays in back are always LOADED with conchas, pan dulce, other sugar-coated hunks of carby amazing I'll never learn the names of. Try the porqueta or raisin bread pudding cake (you'll know it when you see it) with coffee. At $.70 a pop, they're cheaper, fresher, and so much yummier than your Starbucks pastry. \n\nHere, instructions for the faint of heart (or Spanish-less, like me):\n1) Walk in, survey ALL the in-case offerings\n2) Pick up tray and tongs\n3) Enter back area\n4) Pick up anything that looks good. If it is, you'll be delighted. If it's just average (because let's be honest, nothing is BAD in this panaderia), you'll have wasted maybe 3 quarters). \n5) Circle front area again before paying. \n6) Avoid the neck-pain-inducing whip of the head back as you stride out (\"Oh I didn't see that cookie before. Looks good. Should I get it? Argh argh argh.\")\n\nI'll have to come back in the early AM when they open. That would be an ultimate dream sequence...enjoying a pastry, falling back asleep for a few hours, waking up happy.", "author": "Cathy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Best mexican bakery I've been too.  All the regular stuff is a big step up from other places I've been.\nFavorite is something I've only seen there, it is a light cake covered with some sort of cheese topping (I think Parmesan) and then sesame seeds.  This comes individual, a larger rectangle or (best) a large heart.  For $6, the heart-shaped one is desert for 6-7.", "author": "Ric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "This bakery is close to my husband's place of work and is open early.  Driving up at 7 AM I had no trouble parking.  The storefront is adorable, the main entrance is flanked by two window cases neatly filled with pastries.  The interior is well maintained and clean.  I loved the vintage look of the black/white linoleum floor.  \n\nI have been to panaderia or two in the past so I knew the routine --  pick up tongs and tray and serve yourself from the well stocked bakery cases.  My husband was a bit lost with this process so I advised him to just watch the other customers.  We watched and copied a couple who selected warm, just out of the oven, pastries from a baking rack located towards the back of the bakery.  We also selected some from the glass cases.  We filled our tray in no time.  Even though we were clueless about the names of most items, we enjoyed our little morning adventure selecting ones that just looked tasty.  The wonderful smell of fresh baked goods helped us too.  We brought our tray to the cheerful young lady behind the counter and she carefully bagged our 8 or 10 items.  Total price for our large bag of yummy pan dulce ---  $11.40.  Not bad at all.   We'll definitely be back.\n\nOnce we were back in the car we divided our treats.  My husband made a grab for any pastry with crystal sugar, there was a pretzel shaped one, a bowtie, and a cream horn.  My favorite was a turtle looking pastry with raisin eyes.  (I later gave it to a group of seventh graders who dissected it like it was a frog in biology class. They loved it.)", "author": "A O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "Native San Franciscan, grew up in the Mission with wonderful Panaderia's on practically every street corner.  Now many years later I go back and find everything has changed including my favorite Mexican bakeries.  The one place that I can rely on to taste just as I remember is La Mexicana.  It's a great treat to be able to take my kids there and be able to find all my favorites.\n\nAs another reviewer posted, this is a typical Mexican bakery so if that's not what you're looking for don't go here.  But if like me, you LOVE typical Mexican bakeries than this is the place for you.", "author": "Sally R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-02", "description": "I visited around 3pm and they didn't have much of a selection on conchas.  I picked one out anyways.  It turned out to be part stale.  The inside beyond the sugar shell was hard and didn't have much flavor.  I'm guessing this place is only good in the mornings.", "author": "Soo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Good selection of pan dulce and the coffee is great too. Has that canela (cinnamon) flavor and is pretty strong. Save mucho dinero and time here compared to that donut spot just a short block away with the long lines.", "author": "Gunter M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "La Mexicana was sometimes my sole motivation to wake up at 7 during the summer (how atrocious) to make the hour-and-a-half long commute to my volunteer gig at SF General. I also had an opportunity to practice my Spanish, which I just started learning this summer.\n\nI would try a different pastry (or two) every morning accompanied by a cinnamon coffee. Over the course of the summer, I've sampled the quesadilla, conchas, weird dough cinnamon twist, pumpkin and apple empanadas, alligator, turtle, sprinkle cookies, gingerbread pigs, custard thing, cinnamon rolls and coconut jelly rolls made with corn flour, and lemon custard croissant. The sprinkle cookie, conchas and lemon custard croissants are my favorite. A word to the wise: pastries get cheaper in the afternoon!\n\nDon't be afraid to try anything, as I initially was because I thought some things were supposed to be eaten for breakfast and some weren't, and that I'd be hastily judged. I've seen people buying cookies and chocolate chip bread for breakfast. No judgement here, even when I try to converse in my terrible Spanish. The cute old couple will smile and thank you nevertheless!", "author": "Katherine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-14", "description": "Take it from someone who has tried every single pastry on the walk from 24th Street Bart to SFGH that La Mexicana Bakery is by far the best!!\n\nThe folks that work here are really friendly and no matter what you get, it will be dirt cheap and f-ing delicious. I love their cherry pastries, anything with cinnamon, and their Salvadorian quezadillas are amazingly light and fluffy. Sometimes I ask what's in the pastry and other times I just roll the dice, but every time it has been perfect. I also enjoy the cinnamon coffee, though it can be a bit weak.\n\nCash only. When you arrive just pick up a tray with tongs, go crazy picking out pastry and get rung up!", "author": "Kara R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Panaderia La Mexicana just gets better and better as I try more and more panaderias on 24th St. A lot of other places offer their sweets for a lot cheaper, but you get what you pay for when it comes to these pastries and baked goods. Panaderia La Mexicana is always consistent and leaves me wanting more and more. It's no wonder I make it a point to stop in here almost every work day. There's really nothing like a midday pick-me-up from La Mexicana.\n\nAlso, as an added measure of awesomeness, Panaderia La Mexicana is one of the only places that has scored a perfect 100 in the DPH inspections.", "author": "Frank Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "My family has been going to La Mexicana for the past 35+ years.  It has always had the best pan dulce in town.", "author": "Marc C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-06", "description": "Pics in context in blog.\n\nPortion three of my interview day entailed a bus-ride from the VA to San Francisco General - conveniently located in The Mission area of San Francisco - home of Dynamo Donuts. Having heard wonderful things of the bacon-laden option I finished my interview at 4:00, bid my farewells, and changed back into my jogging shoes. Rushing through the streets of The Mission past any number of unique Hispanic, Korean, and Chinese options I finally saw the sign for Dynamo - and the metal awning closing before my very eyes. Stopping the clerk I was informed that they'd been sold out of donuts since \"about 2:00\" and that he'd merely been selling coffee. He invited me to come back the next morning, but alas my schedule didn't allow for such - there is always next time.\n\nAs I was walking away I was somewhat disappointed but plenty excited to proceed to my next stop (Humphry Slocombe) until I was stopped by a well-dressed couple who stated \"Don't worry, their donuts aren't that good - if you want to try something awesome there is this little Mexican pastry shop up the street called Panaderia - go there and get whatever the clerk recommends as fresh baked.\" Having already passed a Mexican Bakery and being admittedly impressed by the display I figured \"Why not?\" and continued along until I found the small shop exactly where they said it would be.\n\nWalking in the door I was instantly struck by the wonderful smell of apples and cinnamon - and the fact that I couldn't read a single word on the wall, menu, or pastry cases! Taking the advice of the couple I asked the clerk \"What's good?\" only to get the response \"What you like?\" Stating I wasn't sure didn't seem to get me anywhere as I once again received \"What you like?\" as a response. Not wanting to drag this on for too long I responded \"Something fresh, with fruit\" and the man smiled and led me to the case where he stated \"Get this, and this.\" Asking what they were (and having it written down so I could remember) I was told a Mexican Wedding Cookie with Guava and an Empanada de Calabaza (pumpkin.) $2.20 cents later I emerged with my prizes and dug in.\n\nFirst opting for the Empanada I must admit I was somewhat skeptical due to its plain appearance - a skepticism that resolved the moment I bit through the flaky crust and tasted the burst of pumpkin-pie-esque flavor. With hints of cinnamon and vanilla the dainty pastry worked excellently and was almost like a hostess fruit pie yet far more tasty. Not too sweet, not too heavy - I probably could've eaten 2-3 if I weren't planning on ice cream and a subsequent dinner.\n\nMy second choice, the Mexican Wedding Cookie, was another wonderful surprise and reminded me of a better version of the Russian Tea Balls my aunt makes each year at Christmas - but with chunks of almond and walnut plus a wonderfully tart compote that tasted of strawberry and cherry at once. Eating as carefully as I could I still managed to end up with about a teaspoon of powdered sugar on my black suit (a fact noted by myself and chuckled at by the cashier at Humphry Slocombe - who additionally noted her love for Panaderia when I attempted to explain myself) but it was absolutely worth it - and the dry cleaning bill!", "author": "Michael U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-11", "description": "WoW these pastries sobered my drunk ass. I went there on a Sunday morning after a long night of drinking and smoking buds. The funny thing is that I was at Pop's dive bar (next door) couple of hours ago. After Pop's, I went to my buddies' flat house 2 blocks away from this bakery to party more. At the end when everybody is passing out or went home, and my friends Raccoon & Ed wanted to get pizza at 4am. \n\nRaccoon asked, \"Hey do you want to chip in for a pizza?\"\n\nI said, \"Man, pizza suck, that shit is overrated sober food. Everytime is pizza this, pizza that even a old cold pizza from a shitty ass parlor. I'm tired of eating that crap. What are we? Teenage Mutant Ninja Turtles? I'll wait until the bakery is open or a taquería is open that serve menudo or breakfast burrito. Something different to get the munchies\".\n\nRaccoon said, \"You're gay\"\n\nI said, \"Pizza is gay just like you\"\n\nSo the guys ended up passing out and I'm the only one who is a awake. I left the house and walked to the bakery. The bright fluorescent light in the window of the bakery was so bright that my eyes were suddenly awaken. The smell of fresh pastries woke me up, and I was also excited to munch. There are some pastries that are shape of alligators and turtles. The cookie melted in my mouth after I took a bite. It was like a food strip club or porn, cause the partries were so damn fine.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "This is the best bread in San Francisco plain and simple not to sweet just the way it has to be", "author": "Hugo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "I've loved this place for 28 years. I think that about covers it.", "author": "Judith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "My mother in law and i we were looking for some Asian bakery  joint in the mission and it was closed, so we bought pastrys in this Panaderia. Good stuff and super reasonable price. The place look like a little bit dirty but is how panaderias in south america look alike, so its more authentic i guess. Next time I'm gonna try the coffee.", "author": "Claudio L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "I was craving something sweet and decided to give this place a try.  I found it on yelp.  I've never had baked goods from a Mexican bakery before and wasn't sure what to expect.  Lets just say, now I've been here four times and I've only discovered this place a week ago!  There aren't any labels on anything so, I normally just grab anything that looks appealing - since yelpers say everything is good.  And the yelpers are absolutely right, everything is yummy here! From, their pastries, to their breads, cookies and muffins, everything is delish!  \n\nJust a warning though, it's easy to go crazy here - can be dangerous for those watching their waistline.  They give you a huge plate and tongs and you can just pile it on!  I have yet to come out of this bakery without a bag full of goodies.  Goodies range from about 75cents to $1.75.  This place is great to grab an inexpensive treat :)", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "I've come to the conclusion that Yelpers are not very adventurous.  C'mon, only 13 reviews for a place this great!  There is more to the city than what's mentioned in the paper/tv or what's considered \"hip\".  Do not be afraid if you don't know what anything is!  Just ask!\n\nFrom the outside, this place looks like nothing special.  From the inside, it still looks like nothing special.  Linoleum flooring.  Fluorescent lighting.  But then you peer in the large cases with shelves of unfamiliar pastries and then your head starts spinning and your mouth starts watering.\n\nThe Mexican pastries here are light and sweet, but not too sugary (like Danishes can often be).  All kinds of options from plain (unadorned) dough pastries to those stuffed with lemon custard, fruit, etc.  I like how the pastry is the perfect balance between baked and moist.  Most of the time they are overdone and very dry.  I didn't even need tea to go with mine.\n\nYes, nothing is labeled.  Just look and guess, or ask if you really want to know.  Pick up a tray, some paper, tongs, and go to town.  I don't know what I get.  But it's all good so far!  Each pastry is a little over $1 and when you get home and put it on a plate you may think it's a lot to have as a small snack and wonder if somehow it grew on the way home.\n\nBike Parking: Designated bike racks around the corner on York St.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-10", "description": "In my opinion Panaderia La Mexicana is a 2 star panaderia.\n\nThis a very small panaderia on 24th street between York and Bryant.  You enter, pick up a tray and tongs, and help yourself.  The panaderia is very clean and appears to be well kept.  There's not much customer service here since you serve yourself but for those that are nitpicky - no one greeted me as I entered and no one asked if I needed help or had any questions despite taking my time deciding what to get.  \n\nI ultimately settled on a slice of pound cake and a Salvadorian quesadilla, and thank goodness that was all I took because I was quite surprised at the price of $2.50!  Perhaps I am cheap, but I'd like to think I just know what fair prices are for pan dulce.  I actually regret not walking away when I heard the price because I didn't think either piece of pan dulce was anything more than average.  I was expecting to pay between $1.50 to $1.75 but not $2.50! \n\nI'm sure someone reading this is thinking how could I give this panaderia 2 stars after only having tried 2 pieces of their pan dulce?  Well - here is how: as a business you have only one opportunity to make a first impression and you should never count on two.  Bake every piece of pan dulce to the best of your ability and offer fair prices.  It's absurd to think a customer will continue to sample your offerings if their initial impression is average and overpriced...especially when you're in a market as saturated as yours is with competition.\n\nPanaderia La Mexicana earns 2 stars for only average pan dulce and extremely high prices.  This panaderia is not worth visiting in my opinion.", "author": "Bánh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "This was my first time at a Mexican bakery so keep that in mind as you read this review.  As a non-Mexican pastry connoisseur, all I could do was trust my taste buds and freshness radar. I have now tried 3 of their pastries and this is my conclusion: DELICIOUS, surprisingly light, subtly sweet (I can't stand anything too too sugary), and very very fresh. \n\nOne of the pastries was the teeeeeensiest bit dry (still very tasty), but I think that may be an indication of how little artery-clogging butter they used. So, thumbs-up.\n\nI loved the sweet little old lady behind the cash register. Very pleasant and smiley. Cheery people rock. I can't wait to come back and try more goodies!", "author": "SfMom O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "So many goodies, and so little time, to pick through all of them.\n\nMy friend who grew up in the mission, loves this place and always takes us here.\n\nCheap and easy!  Like everyone else says...get tongs, grab a tray, and load up, and get rung up.  :-)\n\nBring cash though!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "Wow! Yum... rack after rack of simple sugary and eggy bread all around and cash only; a recipe for perfection. The pastries arent overly sweet which is good, because these are meant to be eaten with a great cup of coffee or milk. The empanadas are great, BTW. \n\nEmpanada tips: \n\nrounded sugar covered = custard filled\ntriangle with ^ cutout = apple\ntriangle shape = pineapple\nrounded (1/2 moon) = pumpkin, not very sweet or spicy\n\nKeeping these pastries can be tricky; the sugar may get sticky, and they don't have preservatives typically so they get stale over two days. Buy them fresh in the morning and enjoy that same day for best results! seriously this place takes advantage of my weak spot - carbs.", "author": "Vittorio L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-12", "description": "Panaderia La Mexicana puts you in a position with an empty tray, a pair of tongs, and walls filled with fresh pastries - a perfect storm to lose all self-control.  \n\nI had no idea what pastries I was piling onto my tray, but my blind trust was rewarded later as each bite into an unknown pastry confirmed its tastiness.  The pastries were super cheap - a little more than a dollar for each, and the older lady who was at the cashier was cheery and polite, despite knowing that I could not speak Spanish.\n\nSnag a couple pastries and pair it with a cup of Philz across the street for your very own hipster, San Francisco breakfast.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-26", "description": "This is a typical Mexican bakery in The Mission. As generalization, all their pastries are baked from the same gritty corn flour. Almost irregardless of the shape and look of the pastries, things taste the same.  It's actually kind of surprising so many diverse looking treats taste the same.\nProtip: Avoid the pastries all together and grab a white flower bread roll.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-26", "description": "3.5 *s\n\nTowards the end of Panaderia row (aka 24th st.) I really like the pan dulce from Mexicana.  I don't mind that they don't bother to label a damn thing as I've enjoyed almost anything I've purchased there.  Grab anything that delights the eyes, a cup of your favorite coffee and life is good.  Here's a helpful link for you if you're unfamiliar with panadeia offerings:  http://www.frugallawstudent.com/wp-content/uploads/2007/06/a822.jpg\n\nI admit that there are some items not found there that exist on the shelves of Victoria and other popular panaderias, Sure, we can quibble about who has the best conchas and sweet empanadas on 24th but hey, that's what Talk if for.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "Such an awesome Mexican bakery!!!! When I went it was a cold day, the place outside looks like nothing compared to the inside. The menu is full of really great things. When I went I got a sugar bun and spicy mexican hot chocolate (really tasty). But unfortunately they were out of empanadas.... which I really wanted to try. I definitely recommend going here. Also the time I went there was some sort of class going on in the back, there was a sign that said \"Sour Flour\" and I believe it might have been a baking class? So if you're interested you should definitely look into that.", "author": "Vishnu B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-13", "description": "Best mexican bakery in the area.\n\nThey also have:\n1) Alligator shaped custard buns\n2) Pineapple crusted turtle buns\n\nWhat more could you want?", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-24", "description": "After discovering that Dynamo Donut was out of donuts I needed something sweet and decided to walk into La Mexicana Bakery. Everything looked delicious (*note I was pretty desperate for something sweet)\n\nDelicious cinnamon sugar cookies, almost tasted like a churro cookie!! For $.75\n\nHad various cakes, cookies & breads. Authentic Mexican bakery (I think, I don't really know what authentic Mexican pastries are supposed to taste like)\n\nWould definitely go back!", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "One of the best places to get sweet Mexican bread (pan mexicano)!! My parents would get their fix of sweet bread only from here, and so do I!  Everything is baked fresh in the morning and I have yet to try a bad one.  It is cash only but it's all pretty cheap!  Also, those bread rolls make for a perfect sandwich and the pastries are a great dessert and breakfast item.  I'll never go any place else!", "author": "Diego M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "these guys just stood there while i got jumped and mugged by ten people. when i asked them to call the police they turned their backs like i wasn't there. thanks guys!", "author": "Corey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-02", "description": "I'll walk the 6 blocks further to this panadería because: they're really friendly, they have great (cinnamon) coffee, they're well-priced, and damn! the pan dulce here is good.", "author": "Molly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "one morning my friend needed to go get some teeth pulled over at Western Dental on Mission. I being the great, fantastic, wonderful friend I am, took her and waited for her to be finished. I took a stroll down 24th and was overcome with the craving for a quesadilla. the pastry kind. I pulled up yelp to read that this place had the best. A mexican bakery? serving up a salvadorian specaility just right? HELL YEAH. And right out of the oven too! It was so good! not overly sweet or buttery, but just right. I also grabbed a ton of other things too, because I  cannot control myself in these situations. Other memorable treats shared between us all at the breakfast table that morning were the pineapple empanada (didn't taste canned, dough was fresh) and the cookies.\ngotta go back!", "author": "Lexie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "Hm.. let's see.\n\nA cinnamony coffee + yummy pastry costs about $2.50 \n\nIf you walked about half a block to Dynamo Donuts, you'd spend about $7 for a coffee and (in my opinion,) an over-thought, underwhelming donut.\n\nI wouldn't call that expensive at all.\nThough, to be fair, I'm not comparing against other Mexican bakeries.\n\nAgree with everyone on the \"tasty\" and \"fresh\" comments. \nsooo good.", "author": "J. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "This is the best and earliest opening pan dulce bakery in San Francisco, but not quite in the whole bay area. They open daily at 430am. I think 5am on Sundays.\n\nAt this time their pan dulce is super fresh. So fresh that you can take it home and leave it in the bread box and it still tastes pretty good after 2 days.\n\nThey have a decent selection. They are very helpful. The only bummer is their prices can be high for most items. They also have the most authentic tasting salvadorean \"quesadilla\" which is more of a cake  with no frosting sweet bread and doesn't have anything to do with cheese and tortillas.", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-08", "description": "What I love about this place is that is call Panaderia La Mexicana but they make the best I mean the BEST Salvadorian quesadilla. If you do know what that is, you should ask them next time you are there.\nThe prices are a little too high for pan dulce but I don't mind paying it because I know is fresh and it hasn't been sitting there for days like other places", "author": "Milton R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-01", "description": "I don't know why I haven't reviewed this bakery before because I've been going there for 15-odd years.\nThis is my favorite Mexican bakery.  As you enter, take a tray and pair of tongs and pick out pastries from the dozens of choices.  There's everything from pan dulce to empanadas to custard buns to little piggies.\nI used to go by about 7a and buy pastries for my staff of 15 for about $22-24 and there was plenty to share with others, too.\nBe sure to check out the pastries that come straight from the ovens in back for the freshest items.", "author": "Philip C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-10", "description": "Maybe I just haven't gotten my head around Mexican bakeries.  Every one I tried has essentially the same offering, and while extremely cheap, nothing seems fresh (even in the morning) and is either overly sweet or way too dense.  While this place has a broader selection of goodies, I found the aforementioned generalizations to hold true.\n\nSuper friendly staff.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "Solid option for a post-lunch sugar craving. One of the staples I always get is the cornbread muffin because it's just so light, fluffy and hey realistically if it has something to do with corn, I know my Mexican people perfected making it.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "Yum, yum, yummy yum yum. Fresh, tasty, and yummy. \nGrab a tray, some tongs, and go to town.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "I'll admit it. Sometimes I am wary of Mexican bakeries because I am so scared I'll pick the wrong thing and hate it. I have many times wasted a $1.50 on a something and all because I am too chicken to ask what it is or what is in it, if its crispy or what. I used to think they were dry and not for me.\n\nSo far here, I'm doing very well. Everything I've plucked from the shelves has been very delicious. One of my favorite things looks like a mini pineapple upside cake with a maraschino cherry half, but its a cake, filled with custard.  Another is the plain old sugar bread. Its soft and not dry.  \nThey also have coffee with cinnamon in it.\n\nI'll soon get over my shyness, I'm here once a week now that I work nearby, and the nice lady at the register lets me call her Tia.", "author": "Cheryl D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "All time fav Mexican panaderia. Delicious custard filled delights! Staff is friendly, too!", "author": "L B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "Um ...................................................... YUM !!!!!!!!!!!!!!!!!!!!!!!!\n\nI am so glad (but unhappy for my waist) that we stumbled in here after breakfast at St. Francis Fountain this morning.  \n\nNone of us had ever been in a Mexican bakery and we unsure what some of the items were.  The woman in store was very eager to help and tell what things were.  \n\nEverything we bought was super yum.  And, nothing tasted like it was loaded with butter or fat.  They were kinda light and a bit dry sprinkled with sugar.  Totally tasty.  A good find to nosh on on a windy, rainy Sunday.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "Been coming here my whole life. This Place has amazing pan dulce (sweet bread). \n\nBeen to other panaderia's and it's sad because La Mexicana has spoiled me. I really can't eat anywhere else.\n \nBeware: This place place will spoil you hearily.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-27", "description": "what i ordered.... cheesecake, mexican style?\n\nthe cake or bread was about the size of a regular pound cake but with an inch of thickness instead. it was good and nothing in common with an american cheesecake, it was more like cornbread in taste and texture then infused with cheddar cheese.\n\nambiance... ok (typical panaderia, pick your own baked good then bring it to the cashier)\nservice... ok\ncost... $", "author": "Gors P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-18", "description": "Absolutely dazzling array of fresh Mexican delights. Felt like I was in a different country. The place seems very authentic and my pastry tasted like it had been freshly brushed with a sugar/butter compote, which was perfect. 95 cents of Heaven. I just wanted SOMETHING to have guava in it. I know it's a San Salvadorean thing, but sometimes you just have to compromise/ go fusion, ya know?", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-11", "description": "Grab a tray and tongs on the counter and load em up!\n\nI love the pan dulce, or mexican sweet bread.. They are so adorable! It's shaped like turtles, rocks, ears, shells, etc.. They're the cutest little things! The cinnamon and sugar dusted concha is excellent with a cup of Mexican hot chocolate. \n\nMuy delicioso!!!", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "Right across the street from La Torta Gorda, this panaderia was the perfect place for some post lunch sweets.\n\nGrab a tray and tongs and select what you want.\nMexican bakeries use use many different types of flours/grains.\nI like the corn flour pastries. Also this pretzel looking wheat flour treat, with the big granules of sugar on top.\nI don't know any of the names, but the lady is very very helpful and sweet.\n\nIt's bright and super clean.", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-03", "description": "I started coming here since my early childhood and they're still off the hook , So take my word for it....these fresh soft pillowy breads and savory cookies are the freshest you're going to get. \n\nYou don't have WiFi or a place to chill while you eat, but the bread is well worth it.\n\nTip: Great Quesadillas(golden soft buttery cakes).", "author": "Ritz R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-17", "description": "Early on Sunday mornings I sometimes make the trek to this panaderia, just for a bag of melt-in-your-mouth Mexican galletas that taste crisp and light and buttery.  Just grab a tray and a pair of tongs, then slide open the display doors and pluck what you want.  I usually go for the powdered sugar-covered galletas, the animal cookies, and a concha or two.\n\nThe Mission's just waking up around that time, and it's cool to be out strolling la corazon, a bag of fresh baked goodies clutched in hand, as all the mercados are rolling out their produce and shop owners are hosing down the sidewalks.\n\nSF Chronicle food writer Tara Duggan had written an evocative article on panaderias and their culinary/cultural significance in the city back in '04.  La Mexicana figured largely in it.\n\nhttp://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2004/04/28/FDG136AE4E1.DTL", "author": "Trina E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-17", "description": "This place has plain muffins which are hard to come by and my husband loves them. I have to admit that it's not something I ever thought existed or would seek to find...but after trying them they are pretty tasty. I like the chocolate chip muffins though :) A pretty simple Mexican bakery with ample, fresh choices.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-14", "description": "We stopped in here for Pan Dulce and were NOT disappointed! Some of the freshest we've ever had! The folks working were incredibly kind and pleasant--especially with our kids yelling for cookies! \nI can't wait to make a return trip for my beloved Pan Dulce. My Abuela would've given this place a big thumbs up as well!", "author": "Jill C R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "This place has been here for a long time.\nNot the nicest looking place but the smells will pull you in.\nAnd the taste, the taste, mmmmmm.\nCan't wait to try more from here.\n\nOne time, after going to dynamo donuts I was so tempted to buy more.", "author": "Po L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "It was awesome to see this place across from the sushi restaurant.  This takes me WAY back to my younger days, I remember the park next to it specifically.  I can recall my mom taking me to the panaderia and then the park to kill time when the two of us had cabin fever in our little apartment.  Anyways we decided to take a peek inside after our sushi meal to get some items to go.  This panaderia hasn't changed much, probably just the prices.  I picked up some delicious pan dulce, there was this soft roll with custard inside so tasty.  I also got a coconut cookie and palmier I can't wait to dig into.  Oh and even for today's prices about 5 items ran me up a grand total of $5.30, beat that at any other bakery!  Oh and they got you covered with a great variety of accompanying drinks like chocolate, strawberry and regular milk.  I love this place and it was great to remember the simple life.", "author": "La C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "The best \"Pan Dulce\" in the mission. Period. a little pricier then the others but worth it! Now, go get  your pan dulce before they run out!", "author": "M R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "Very nice people and yummy baked goods. You get a tray and serve yourself and then they package and pay (if you haven't done this before.) I got a beautiful turtle-shaped bread and a cinnamon sugar roll, both of which were warm and tasty. Would be happy to come back.", "author": "Alissa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-23", "description": "This has been my go to spot when I'm late for work and need a quick cinnamon coffee/pan dulce.  I don't go very often, but it is always fresh. This morning I was disappointed that my pan was not only dry but had a hair in it!  It went straight in the trash.  The bakers should definately be wearing hair nets.  I am disgusted, hungry, and won't be returning anytime soon. :-(", "author": "anne m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-29", "description": "another similar bakery in the mission.  fresh stuff.  couldn't really decide what to get.  tried a lemon croissant roll, which had a nice flaky crust, but wasn't crazy about the lemon cream\nmore things should be labeled.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-09", "description": "AWESOME.\n\nWe ordered our wedding cookies from this bakery and we got rave reviews from our guests! And of course we had to sample their other goods when we came in to make our order.  5 stars!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "I love this place.  It is near my apartment and i actually first went there years ago, but there are many places on Yelp that i haven't reviewed yet, but someday i will catch up.  Not only do they have excellent Mexican pan dulces, but they have this cinnamon coffee (not cheap, but where is coffee cheap today?) and the bakery items are delicious and reasonable.  A big ++ is the hours.  Very early a.m.  like 4:30am, i think and whether you are a late night partier, or just an early riser.  As Martha used to say, \"That's a Real Good Thing.\"", "author": "Kenneth N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-15", "description": "Their bread is DELICIOUS.I have been eating bread from here for 21 years.Yea WOW. Their prices are a little higher but affordable. JUST DONT GO EARLY IN DA MORNING BEFORE 9AM BECAUSE THE LADY PUSHES THE PRICES UP A BIT MORE THAN WHAT THEY ARE A LITTLE LATER. \n\nIt's a good place to go before or after taking the kids to the little mini park beside it, or after cutting your hair at the barber shop beside it. lol", "author": "Maria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-15", "description": "Incredible displays full of delicious baked goods ... from cookies to pastries and bread. It's help yourself and sometimes it's hard to stop. The prices are extremely reasonable here too.", "author": "Doug L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-13", "description": "Best. Pan dulces. Ever. \n\nGet one of those white round things with the red in the center. We're from Texas so we don't know what it's called - our panaderias don't have them - but my god they are delicious. The cakes taste a little lemony, and while incredibly sweet, it was also incredibly delicious.\n\nGreat bargain too - under $10 for pan dulces and sweets for six people.", "author": "Sari C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-07", "description": "Growing up with Chinese bakeries, I've always been intrigued by the wall to wall Mexican bakeries in the Mission.... they seem really similar. The whole tray and tongs situation was refreshingly the same and I had a ball poking around the shelves and seeing alll the pan dulce, cakes and empanadas that Panaderia had to offer. I ended up with a good old sugar twist bread and a concha. Both yummy and for 1.85, a very substantial dessert/snack.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "Love the weird cheesecake thing with sesame seeds on top.  Super Duper Yum!  Glad they are so close to my house.  \n\nBTW the other stuff is good here too.  Coffee's fine and the fact they are open soooooo early is wonderful.", "author": "Aron T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "It's not amazing, but then again, I haven't really found any panaderias that are. Everything always tastes like flour. This is probably the 2nd best one on 24th street, only second to the one between mission and valencia.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-28", "description": "For less than a dollar, you can pick up a pastry that is basically the love child of a jelly doughnut and a pound cake sprinkled with coconut, and if it's not enough to get you through the wait for a table at St. Francis Fountain, well I can't help you any more, fat ass.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "After trying the pastries from different Mexican bakeries in the Mission, this place is my overall favorite to go to for pan dulce.  As you step through the door of the bakery, your senses will be stimulated by the aroma of the fresh baked goods and the large assortment of visually appetizing pan dulce.  Their round, fat conchas are the perfect balance of density and sweet softness.  And then there are the horn-shaped cuernitos, croissant shaped pastries that are cakey and sweet.  And the custard filled pastries are fantastic.  With their wide selection of different pastries, you can try something new on each visit.  I recommend stopping at this bakery, grabbing a pair of tongs and a tray, and loading up on the pastries!", "author": "michele g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-14", "description": "Wow, I'm only the 3rd reviewer?  This place is exactly like walking into a panaderia in mexico, not least because it's a total hole in the wall.  Just an empty room with a counter and some self-serve cases with all the various goodies.  If only they could get a tumbleweed to blow by the front door.  You pretty much can't go wrong here, but try getting some pan dulce if you can't decide.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-30", "description": "This is my reliable \"I need sugar in my mouth now and I don't want it to cost the price of a sandwich\" place. The thing I've always loved about panaderias is this, even if it doesn't taste that great, the pastries are always going to look like the pastries in my dream world. Although La Mexicana actually has less of the colorful and decadent looking masterpieces of other panaderias in the area, the taste leaves me with nothing to complain about. Jellied coconuted sugar bread in my tummy for a buck. Done.", "author": "Hallie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-26", "description": "I have been patronizing this bakery for over 20 years, and I'm only 27 years old.  This place has not changed much, and the bread continues to be great.  Compared to other Mexican bakeries, this bread is the sweetest.  The gusano, a pastry with a custard like bread filling, is probably my favorite at this location, next to the jelly roll with sprinkled with coconut.", "author": "Christina and Jaime F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-05", "description": "The smells coming out of this bakery are enough to make me swoon. We have been going to this bakery since the late 1970s and I am required to bring pig cookies to North Carolina when I visit my sister. I usually stick to the pig cookies, but have recently branched out and tried a roll that tasted just like fresh challah. We polished off all of our goodies in about 5 minutes.", "author": "Jody S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-03", "description": "The men of the Llanos household are forced to fend for themselves during the breakfast hour as mom recuperates at Mills Peninsula Hospital.  (Get well soon!)  Enter Panaderia La Mexicana, a place that my grandmother introduced me years ago.  Don't let the surroundings on 24th St. scare you.  Just get there early, and enjoy any of the dulces in the morning.  I just got back from the bakery (or panaderia), and got some of their delicious apple turnovers, an egg-nog flavored pastry, and some cinnamon rolls.  And the sweet stuff is delightful.  Just in time to have some coffee and some World Cup action.  (Go Germany!)  I told the sweet old lady who individually wrapped each one of my baked goods to bet the farm on Germany.  (As of this writing, Deustchland is ahead of Peron Country) The lines can be long there so get them early.  Great bakery, delightful people, and treats that are sweet.  We shall return.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-23", "description": "This is the best place in the city to get pan de dulce.  I was born in the Mission in 1963 and left the city , not by choice in 1979.  I have been in the contra costa area since then, and I only return to the city to visit family and giants and niner games.  I always stop by the panderia to pick some goodies and on a whime will drive over to pick up some up with my girlfriend.  She is hooked.", "author": "David A."}
