{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "What can I say? I have been coming here to the Spanish restaurant Patio\" and the yearly events by the society for years. Being that I am of Spanish ancestry( my grandparents were from Spain) good Spanish food is always in my line of vision.\n\nTake in the Andalusian courtyard and the ambiance, the chitter chatter of Spanish in the air along with the familiar aromas..all leads to a great event. \n\nThe menu leads the foodie on a basic Spanish adventure. All their plates are great including the Paellas, the tapas( amongst them the patatas, olives, jamon serrano etc) all are wonderful. As I said, I am pretty picky when it comes to my roots( food not hair) and this place is the bomb. Can I say Spanish bomb? Lol- Try it you will like it\" That is my other half of my ancestry coming thru!! ;-) Buen provecho!", "author": "Joey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "It was our first time here and our server lizzeth was incredible and had a bright smile on her face the whole time. I was with my parents. My dad is one of the hardest person to please since he has been in the cooking industry for almost two decades and has been part of many restaurants. However my dad felt satisfied with the food and service and would love to come back.", "author": "Rolando M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "Always looking for new places and cuisines to eat, my daughter recommended this restaurant because she had a delicious experience here once before. We had a few hours to kill on a layover and we decided to have dinner here on a Thursday night. To my surprise it was not crowded at all at 630p, and I'm told reservations are best to have on the weekends, as I'm aware of anywhere in the bay area. \n\nI came a little prepared as I viewed the menu online. It didn't have pricing or specifics, such as if you order paella, it takes a little more time and 2 orders have to be placed. I found this out when viewing the restaurant menu. Therefore, we ordered the grilled salmon,  Bistec AL pastor and fried calamari with garlic and red peppers served with lemon aioli.\n\nThe waitress/ bartender was pleasant enough, albeit a little slow on her timing. Which my daughter had mentioned that service could be slow. She took our orders and I told her my younger daughter and I would share the steak. When she brought out the calamari, it was a meal in itself and I said to the waitress, \" Do you see why now we are sharing the steak?\" She agreed. Haha. My older daughter had the salmon which was a nice portion in itself. The entrees came with soup or salad and house bread as well.\n\nThat was a memorable meal and I cannot wait to go back and sit leisurely and enjoy without looking at the time. The calamari was light and crispy and fragrant with the garlic. Dipped into the aioli made my taste buds scream for joy! I ate about half the appetizer which was sufficient after eating bread, and which I know I should not do, but it was so soft and warm! The steak was tender and flavorful but we only ended up eating half, and the salmon was also cooked perfectly and moist. Also half eaten, not because it wasn't good, but it was a lot if food. Needless to say SIL had good leftovers for lunch since he was not able to join us. \n\nLooking forward to returning!", "author": "Joanne S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "Our close friends who have been coming to this place since it opened brought us here for brunch. They have a nice selection of salads, charcuterie (amazing, by the way), pork chops, paella, breaded fish and more. Everyone is friendly, and it's low-key. The flan is too Spanish for me, I prefer the creamier caramel version, but that's just my preference. The carrot cake was moist, and the cream cheese icing was perfect! I probably ate more dessert than actual food ;)", "author": "Ha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "El Patio is the best place to have the perfect wedding, quinceañeras, and any kind of event. The food is very delicious and the service is wonderful. Sherry the event manager is a sweet heart. She is very helpful and is always interested  and passionate about helping her clients have the best event. I have no complain about el patio as my husband and I got married yesterday at el patio. Your are free to decor a day before (if there is no other event planned on Friday) and come in early on the day of your event. Not many venues have that opportunity for people to decor the day before and day of the event. You also wont feel pressured with the time as they are flexible. My husband and I love el patio !! And thank Sherry for being so wonderful.", "author": "Jenny R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "I was actually looking for the Basque Cultural Center as a place for Jamie W. and me to relax and gorge on a Friday evening after a long work week. As I was brushing my finger on the Yelp app though, I got intrigued by this listing since there were lots of mentions about paella. Since we both loved Barcelona and the street fair paella we had there, I decided to make a reservation even though the hostess forewarned me there would be a wedding party taking up half the room that night. As it turned out, the place felt more like a moose lodge with a huge parking lot, a festive bar, and a cavernous dining room that wasn't too busy when we entered.\n\nWe even noticed how quietly behaved the wedding party was, and I was wondering if they were Amish or something. Anyhow, it turned out to be the kind of casual, family-style place we were looking for since there were no trendy hipsters for miles around. The menu reflected a pretty decent tapas list and a lot of main dishes, but we just had paella on the brain. OK, maybe not just paella since we took advantage of the $22 Carafe of Red Sangria, which yielded about five glasses worth (photo: http://bit.ly/2bObbGx). Nice fruity flavor, not too strong with a hint of cinnamon. As we imbibed that elixir, we went for a daily special appetizer, the $11 Pan-Fried Octopus with Potatoes (photo: http://bit.ly/2cjUlnh). It was pretty good with just the right chew on the 'pus.\n\nWe also got a rather dull bread basket and a fairly generic house salad (photo: http://bit.ly/2bIPABO) to tie us over until the main event, the $45 Paella Valenciana for two, a huge pan of rice, saffron, vegetables, prawns, clams, mussels, squid, chicken, and chorizo (photo: http://bit.ly/2bH4Oud). It was far from the best either of us had, but I was impressed there was some kind of seafood in every bite. We were fairly stuffed, although we were lured into dessert by the evil server came by with an armful of desserts. At least that's my version of the story as we shared a $5 Mocha Mousse, which was probably in the refrigerator too long (photo: http://bit.ly/2bXp3Bu). Uh-oh, here come the wedding toasts. Time to go before the father of the bride starts to play \"Malagueña\" on the ukelele.\n\nFOOD - 3 stars...certainly lots of it, some of it pretty good, a lot of it just OK\nAMBIANCE - 3 stars...just felt like a big lunch room done up for a Spanish festival\nSERVICE - 3.5 stars...pretty attentive at first though appearances dwindled toward the end\nTOTAL - 3 stars...bring your own castanets", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "One of my all time favorite hangs in San Francisco, well off the tourist beaten path. \n\nIf you are looking for excellent Spanish cuisine, with Paella and Tapas to die for, head on over to the Spanish Cultural Center.  Imagine Hemingway sipping \"Sangre Del Toro\" while feasting on Tortilla Espanola while waiting for the Paella.  Best of all, you never have to leave San Francisco and you are treated to one of the rarest commodities in the City of Saint Francis......ample and free parking under the BART tracks. \n\nThis place Rocks!", "author": "Clifton R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "For $18 i could have gotten much better food from my favorite Chinese take out place. The presentation is terrible, the food was bland. I ordered the chicken in garlic and the chicken seemed like scraps; bad quality. The vegetables were probably the only salvageable part of the dish,  if only they gave more than half a fistful.\n\nWhat a disappointment. Waste of money. The only good thing was the wine, which they obviously don't make here.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Probably the best buffet serve for the price.  Lots of selections from fruits, salads, main dish and deserts. Service is good and the best thing for adults who like to drink, bottomless mimosas and wines. Where can you get that for $35.00", "author": "Del I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Delicious food and fun atmosphere. One of my favorite places for Spanish food in San Francisco", "author": "Rosa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Outstanding value for a brunch buffet in the city annnnd with bottomless mimosas! Score! This is a great place for parties We saw several come in and the servers were very accommodating. I'm giving this place 4 stars because the food can be turned up a notch. We'll definitely be back!", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "My employer had the annual winter celebration here in a big banquet room. The 3 course meal was good, the salad looked like it was from the bag. The salmon was good worth the $40 if I paid that much, but the meal was free for employees. One of my coworker's husband said that $40 was a lot for chicken that looked like KFC. \n\nThey were short staffed last night during the event, there was only one woman working the big bar by herself, she was somewhat rude and said that the minimum was $20 to use a card to pay for drinks! I ordered 2 drinks it was $13 then I ordered 2 sodas it was $15 I gave up and just paid cash, being given attitude turned me off.the dinner service was somewhat slow. They should've had 2 people at the bar and more servers to make the event go smoother.", "author": "Alix J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "Hella parking, hella food, and such a great friggin' price. I used to live in the Exelscior and always saw this spot while driving...finally ate dinner here!\n\nIt is known for being a banquet hall, and for dinner patrons, they are super generous with their portions. I ordered with my eyes again, and ended up with enough food for four-five people when it was just two of us.\n\nWait staff was polite and helpful in explaining the menu as well.\n\nWe got the potatoes with aioli, fried calamari, tripe, special appetizer plate with cold meats, olives and cheese (so hard to resist with my lactose intolerance so I sampled a little), and the red snapper with veggies and a side salad. Geezus were the portions huge! Flavors were just okay...but for the price and for how full I am, I am so coming back. All of that for under $65!!!", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Food = great for an evening out. \n\nTabletop (hot) bread with butter and garlic olive oil = addicting, but don't load up too much. \n\nAppetizers/Tapas: \nCold: Pan a la catalana con jamon Serrano (tomato bread topped with Serrano ham and olive olive oil.)  Comes with a garnish of tangy salad with olives.  $10.00. \n\nHot: Albondigas a la castellana (Spanish meatballs in a white wine and tomato sauce.) Delicious, great flavors, and addicting.  You will want to use the bread to soak up the sauce, or just use a spoon and eat it.  $9.00.\n\nEntrees: \nBistec al Pastor (NY steak served with sauteed onions and peppers). Comes with vegetables and potatoes.  Choice of soup or salad, too.  Perfectly cooked steak to order.  $22.50. \n\nPollo al jerez (Chicken in a sherry cream sauce.)  Comes with vegetables and saffron rice.  Choice of soup or salad, too. Tender chicken in an addicting sauce.  $18.50.  \n\nSangria = refreshing and perfect with this meal. $6.00. \n\nDessert = cappuccino cake.  It was rich but not over the top. Beautiful presentation.  $5.00.\n\nService = friendly and attentive.\n\nPrices = moderate. Dinner for two was $77.48 with leftovers.  \n\nSeating = plentiful.  Mostly 4-tops, with a few 8-tops.  They accept reservations by telephone, but it was pretty quiet here at 8 p.m. on a Saturday evening. \n\nYes, they have paella, but there's a 25-minute wait and a minimum order of 2.  So plan accordingly.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-24", "description": "This place is ok. Not the best but it's ok. The food quality could be better instead of being in slumps. The price was average but was not worth my meal. I could have went to my normal to go restaurant place and gotten something more delicious. Overall, this place is ok. But the food definitely needs improvement.", "author": "Brenda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "Patio Español was the perfect place to have my Debut. Just recently over the summer, I had my Debut here and I just wanna Yelp for the reason being that I need to give a shoutout to Ms. SHERRI NASH. She helped out my parents so well and just planned out my venue the way we hoped and expected to look like. Shoutout to Nellie as well who did a fantabulous job on the decor for my party.\nPrices here are pretty pricey but it was worth paying for.\nThe food here is great as well whether during a venue or just casual walk in to sit down and eat. \nThere is ALOT of free Parking.\nThank you thank you thank youuuu for helping organize and make sure everything was perfectly in place.", "author": "Stacey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "I've been on the hunt for good Paella a la Valenciana ever since my trip to central and northern Spain in 2010.  I've tried a couple of places in the city but they didn't suit me quite right.  Enter PER on Father's Day 2018.  Got at the place first thing at opening for their Sunday brunch.  We were greeted by a pleasant older gentleman and 2 young ladies.  After paying for admission, we were led to their elegantly apportioned grand ballroom with the spread of food arranged in a 'T' at the center.  I tried the soup, salad, cold cuts but made sure there was plenty of room for the much anticipated Paella A La Valenciana.  Boy, did I scratch that itch with 2 1/2 bowls of goodness!  It was not quite up to par with what I had in Madrid but by far the best value in this part of the world.  The lady servers are all exceptional and they all came to our table regardless of their designated table assignments and offered unlimited mimosas and whatever else drinks came to our fancy. !\"Diez estrallas\" para ustedes, senoras y senoritas (10 stars for them)!\n\nI skipped a star because I think the $35 price might be a bit steep for the offerings for those that may not be into gorging on Spanish buffet.  BTW, the price included tax but I'm not sure about the gratuity.  I left something extra to show our appreciation for the attentiveness and impeccable service of our lady servers. They were all fantastic.  !Muchisimas gracias a ti senoras por sus atenciones sin limites! Hasta otra!", "author": "Marc F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "So I'm actually totally stoked on this place because it is actually SPANISH, you know, like from Spain.  Not trendy hipster, locally grown, fusion, $15 for 3 pieces of cheese \"spanish\"  (which is actually sooooooo far from SPANISH, have you been to Spain? Then you know what i'm talking about).\n\nBut anyways, let's get down to it. \n\n1. Lots of space.  Sure I went on a Sunday night, which is no Friday or Saturday, but there is plenty of room and our table of 8 had no problem.  It's just always a nice thing when accustomed to San Francisco lines.\n\n2. Did you know that wine can actually be only $15-$20 a bottle?  It's true! And they had multiple options\n\n3. Tapas. We ordered way too many.  The Tortilla Española was legit.  I honestly don't remember all the ones we got.  I also very much enjoyed the Calamari.\n\n4. Paella.  It's good.  We got 4 servings, which was WAY TOO MANY. I think we took half of it home.  Oh well.  Our eyes were bigger than our stomachs.  Also they brought tons of bread so yeah, that filled us up too.  What we definitely did not do was go home hungry.\n\n5. Our waitress spoke to us in Spanish - like Spain spanish.  \n\n6. Really not that bad priced - $400 for 8 people with Wine also we didn't actually eat like half of our Paella and any of the salad? that seems downright decent.  \n\nPlanning to come try the brunch some day.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "The callos are really good, really good!! Sangria was ok.\nThe paella marinera was more like a saffron rice with boiled seafood on top... the tortilla española was very bland...\nI will come back to this place only for the the callos, totally worth it.", "author": "ally s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "I saw true happiness at Patio Espanol! A couple who stole my heart, took center floor, and started moonlighting in their own space, totally oblivious of other guests, and simply, enjoyed their dance together. They looked to be somewhere around in their late 80s! They looked so beautiful together.\n\nI couldn't help myself but feel overwhelmed with joy. It truly is possible to be with someone you truly love, and continue to be \"in-love\" with that same person for years and years. This couple who stole my heart, they've probably been married for many years, and continues to look at each other, as it was their first meeting. I can still see in my mind how beautiful the way they locked into each others eyes!!\n\nPatio Espanol gets a 5 STARZZZZZZ from me. They're service was on point, staff were quick and efficient, and the banquet manager made sure the guests were happy. Even my main course came out piping hot and so did everyone else. Best of all, I love their stage and their  live band. The center floor was already spaced out just for that... dancing!! No tables to be moved, no one had to regroup, all they had to do, was just get their boogie shoes on and have a lot of fun!! \n\nThe icing on the cake is that Patio Espanol has plenty of private and street parking which is unheard of in the city.  \n\nWhen you are looking to celebrate your love, or other occasions, and you are looking for a venue that can host a large group and still be in the heart of the city, try checking Patio Espanol.\n\nI came to Patio Espanol for a 50th Wedding Anniversary Celebration, and came out feeling inspired.\n\nUntil then...Cheers ~ :p", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "I came here years ago I think probably in my twenties or thirties one of my relatives had a party here. so when I came here with my family tonite I'm like oh yeah I remember this place the food we had tonight was phenomenal oh my god the waitress was really nice great service the menu was in Spanish and English but of course I'm the only one that speaks English,lol I don't speak or read Spanish but everybody else did even the younger child,and I'm like oh hell no put my ass to shame. lol They're cracking up at me I ordered of the filet mignon which I was told might come in slices which I'm like okay cool but came in 2 thick pieces was little too pink for me, so I had to send it back cuz sorry I don't like anything moving, came with fresh steamed veggies broccoli summer squash cauliflower which I don't like bell pepper the sauce that came on the filet mignon was really good came with mushrooms and brandy sauce you can taste it.\nIt comes with salad or soup I chose the soup they have homemade garlic soup which I know my Yelp friend Stephanie with a love because she loves garlic, so do I but I was kind of weird so I had had little baby chicken pasta soup that was really good came hot came with some fresh vegetables and came baby pasta and yes I did ate some bread cuz it didn't come with crackers and the bread comes hot with butter oMG yummy tummy. I heard their brunch is phenomenal so you live here you never ate here then come check it out.", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "This review is a bit overdue. We have been coming to Patio for quite a few years and always enjoyed our experience. In our opinion, it's one of those rare finds and hidden gems in San Francisco. Food is always excellent (best paella not to mention a wide variety of tasty tapas to choose from), alongside the unpretentious and relaxed atmosphere, and friendly servers set this place apart from other noisy style over substance kind of joints in the city. The restaurant is spacious with tall ceilings, that means 1) you can get a table on a Saturday night 2) you can actually hear your dinner companion and have a conversation with them (what a concept). An added bonus is there is a parking lot next to the restaurant, so you can just park and walk in, order a sangria and enjoy. What's not to love about it.", "author": "Spiderkitties Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "My family took me here for my birthday on a Thursday evening. The place was empty when we got there for an early dinner though it filled in with obvious regulars around 7pm. We enjoyed the food, the service was really good, and the kids got to explore the menu and try some new things. \n\nAll in all we had a nice dinner at a fair price, close to home and with no wait. We'll be back again and may consider the venue for a party in the future. Thanks!", "author": "Luis A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "I attended an award ceremony/banquet here and it was just ok. Not good, not bad. Large parking lot that wraps around the side of the building. The interior, curtains, bathroom stalls, floors, chairs and table settings are all out dated and the lighting inside is terrible. We were served a nice, thick cut of steak, veggies and potatoes and all were decent.", "author": "Andreea M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "We had dinner for 4 this evening. It's my daughter and mother in law first time. We ordered 2 seafood paella, which was alright. and 2 seafood with chicken and chorizo paella which I though the chicken was dry. Not much of a crust with the rice. Not sure if they used saffron. Not too flavorful. The dish was very very pale color. We had the option of soup or salad. We decided soup. So either garlic soup or garbanzo soup. We chose garbanzo soup with chorizo and it was delicious. Over it was good. We will definitively come back for the seafood paella. If my husband is full & happy, we will be back.", "author": "Wolfie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "My family and I first came to Patio Español years ago.  We all enjoy our dining outings here, but out of the entire family, my mother and I are the loyalist to this restaurant and come the most often.  I figured after all this time...it's time for a review.  \n\nFor Mother's Day this year, I treated my mother to Patio Español's Mothers Day Brunch.  Only my mother and I came and we were certainly pleased! Definitely would return again. \n\nFOOD:  Absolutely delicious.  Forewarning to those in search of the typical breakfast items (eggs/omelettes, bacon, pancakes, sausage, etc.)  They will NOT be found at this venue.  Your in for the treat of their traditional Spanish menu items.  You can start of with soup, salads (green, pasta, seafood, fruit), and appetizers (spanish olives, marinated peppers, smoked salmon or spanish ham on their pan a la catalana, and assortment of spanish cheeses.) As you move on to the main course you may choose from pasta, chicken bread in a crab sauce (delicious and moist), salmon, and of course the star: the Paella.\nYou can finish off with dessert and choose from an assortment of cakes and pair it with a warm cup of coffee.   \n\nThe food was always being refilled as more was served so no ones ever left with out any.\n\nSERVICE: You pay before you enter the dining hall, which was very organized.  If you make a reservation in advance (which I recommend to assure no wait and a table) they seat you promptly.  The hostess and cashiers were very friendly.  The employees who worked the dining hall were very attentive, and offered mimosas, water, coffee and offered us frequent refills.  Also cleared places promptly --not letting them pile up on the table.  Everyone was very friendly.  \n\nAMBIANCE:  The brunch was held in the Salon Picasso which is their largest banquet hall.  Very clean and bright atmosphere.  Table setting was very fun with pink, purple, and yellow napkins --very girly and cute for celebrating moms.  The music seemed traditional Spanish Music which was nice and not terrible loud to the point were you couldn't hold a conversation with the person sitting next to you.  \n\nMy Mother and I were so happy with the overall experience; my mom says she'd like to return next year.  I agree and hopefully we can come back again for brunch before the year ends.  For $38/person...it was a special treat.", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-23", "description": "Food was OKAY.  It wasn't anything super tasty though.  The paella was OKAY.  The torta de cangrejo was OKAY.  Etc. Etc.\n\nThe waitress was cute, but we pretty much had to ask for them to remove dishes from the table, we had to ask for refills, for water, for extra utensils... Pretty much for everything.  And that was the case even as we were the biggest group in the restaurant.   \n\nOverall it was just okay... Nothing special.", "author": "Trisix99 .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "I've been here twice; once with my partner on a week night and last Saturday with a group of 10. During both visits, the staff was attentive, warm, and aware of our needs. They were always bussing our appetizer/main course/ dessert plates and refilling our water and bread basket. We rarely had to ask for anything because of their attentiveness.\n\nAdditionally, the food was great!  I definitely recommend ordering the wild mushroom and the shrimp tapas. Afterwards, drown your bread into the sauce and eat away! The plates are decently priced and portioned, especially if you come with a group and do not mind sharing. \n\nTheir private parking lot can be at capacity on weekends due to events in their banquet hall but I usually park on the main street (Alemany Blvd) in front of Cayuga playground.", "author": "Stef V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "Been there a few times and though reasonable but consistency were not always there.  It more like hit or miss with some dishes.  So, tonight I tried filet mignon with wine and assortment of Tapas with friends.  Well, Big mistake, I asked for medium, it basically comes out well done for the most portion.  The meat was burned and very dry, old and chewy.  There is Nothing Tender about my filet mignon!\n\nOn top of clueless waiters, the dinner experience just turned worst.  Yet, were there efforts to mitigate customers bad experience that just did a nose dive. - No.  It seemed customer service isn't their priority nor does their culinary abilities. \n\nSeriously, I will not order a filet mignon at this restaurant again and perhaps take the business else where.", "author": "Tkd K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Oh yes, I love breakfast. So a breakfast buffet? I'm there, and you don't have to tell me twice. I feel this is more of a restaurant for the family, your pops, mom, kids, etc. Although you can't go wrong with taking a date. The paella is off the hook, I overwhelmed myself with that haha. They of course have different types of food like seafood, chicken , etc. So it depends what they have on the menu that day. Dessert, oh man, dig in dig in. As I said, the environment is homey, which I Like. Take your family to a birthday breakfast here, and spend that quality time", "author": "Santiago E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "I went here with a big group. We all had a great time and loved our meal. The service was great and the portions are a good size.  Bar service and selection is good as well. (sangria is a must)Big parking lot. I wish I known about this place sooner. I can't wait to back.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "I had a craving for paella and this location was close by my boyfriend's house. The restaurant is located in the Spanish cultural center which is kind of unique. There is a restaurant sign on the building so it isn't completely hidden inside. There is ample parking and if the lot is full, I think you can slide by parking in the automotive repair shop lot next door when it's closed. \n\nThe place was surprisingly empty on a Saturday night but the patrons that were there looked like they were regulars. The place gave a very rustic feel and somewhat romantic vibe as well. I do believe our table was a bit cluttered with sugar boxes and too  many wine placards. The place also needs to update its music because we were seriously listening to the same song for a good 15 minutes. Luckily, a party was occurring in the banquet room so we could overhear their music instead.\n\nWe had ordered the paella Valencia which required a 2 order minimum which means 2 servings and it required a 25-30 minute wait. Instead of chowing on bread for 30 minutes, we decided to get calamari with aioli sauce. The calamari was delicious, it was thinly breaded but still crisp. It was not overly oily and was very well done. We did not know that the paella came with a side of soup or salad. We both chose soup, my boyfriend with the white bean soup and myself with the onion soup. The soup came in these rustic mini bowls and was okay.\n\nBy the time the paella came out, we were stuffed. The server divided the portions out of the paella pan for us and it had large portions of meat and seafood. It was very flavorful but we ended taking most of it home.\n\nI would return like to return to try their other items and the staff is wonderful! We had 3 people at our table filling our waters up, taking our dishes away, serving food at the same time. They are very attentive and friendly. The staff makes sure that all your needs are well met.", "author": "Sophia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "A neighborhood treasure!\n\nMy friend chose well when she decided to have her retirement party here. Plenty of parking (shocking in SF), a nice colonial Spanish ambiance, awesome stiff drinks (that was a STIFF caipirinha and cheap at $4) and good food.  We noshed on empanadas, fruits and cheese as appetizers and for the main course, a good sized NY steak with a no frills mushroom sauce.  \n\nI'd definitely come back next time if only to hang out at the bar: the crowd def looks local and you know the place is authentic when everyone was speaking straight up Espanol.  Orale!", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "From the outside, It wasn't clear that it was a restaurant. It was in the Spanish Cultural Center, and they said they have banquets and receptions.  As I drove in, I was a bit hesitant to try it, as it wasn't really in the best neighborhood.  However, parking was easy.\n\nThe food and service was extremely good.  I came in for a Saturday dinner, and was greeted with warm bread. I shared the following:\n\nChorizo Manchego - huge portion, and very tasty.  Their chorizo was very good.\n\nScallops with a creamy wine sauce (it was the special/ I forgot the full name) - Good hearty portion.\n\nPaella Marinera - Mouth watering.  They were very generous with the seafood.  Lots of prawns, mussels, squid, clams, scallops, and saffron (and I've had Paella at fancier places).\n\nCreme brulee and white chocolate - pretty good but not wow. \n\nSangria - good value (5 dollars a glass or 20 dollars for a huge pitcher).\n\nThe waiter was extremely attentive.  Portions were HUGE!!  I think I could have eaten just a tapa if I wanted a light dinner.  We couldn't finish all the food and took a bunch home.  The food was also relatively healthy (lots of fish options), and though I overate, I did not feel overly sluggish.", "author": "Katherine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "A hidden treasure for those who love Spanish cuisine. They have a full menu of tapas and a full menu of entrees. The venue has white-washed walls, Spanish ceramic tiles, and a high, airy ceiling.\n\nThe wine list is very representative of Spain's various regions and quite reasonable. The zarzuela (a Spanish saffron-infused seafood dish like a cioppino) is astonishing. The only criticism is the rice seems pre-fab.\n\nReally worth a try.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Delicious Spanish dishes! The restaurant is located inside the Spanish Cultural Center. The paella is excellent. We had the seafood paella which has clams, mussels, scallops, prawns and fish. Allow 25 minutes for it to be made but it's so worth it. It requires a two person minimum but that wasn't a problem as there were twelve of us all together and four of us ordered the paella. It was perfectly seasoned and there was a lot of seafood. We could not finish all our food so most of us took leftovers home. For a larger groups the restaurant gives complimentary salad, which surprisingly had some asparagus in the romaine greens and cherry tomatoes. We shared appetizers of the calamari, chorizo sausage and mushrooms which were all very good.  The sausage was sautéed with red and green peppers and onions. The appetizers are all tapas (small plates). The mushrooms were cooked in a garlic sauce.  The restaurant interior looks like a Spanish/European courtyard. The music is not too loud and we can hear each their talk.  They play Spanish music and mostly classical guitar songs which goes very well with the place. Service was good and efficient. Polite servers. They have a parking lot which is a huge plus! They also have a large hall in the building that they rent out for events. We almost forgotten about Palio Espanol but are glad we remembered it for this latest meal.", "author": "Lucy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Big place, (free parking, whoooo!) think more of an elks-type community center with a bar and restaurant.\n\nWe came in with reservations Friday 8PM but wouldn't  have needed them. \n\nService was very friendly and helpful, Laura even portioned out the two paellas amongst the four of us, kind of expected to have to do that ourselves.\n\nWe tried the garlic shrimp app and shared both types of paella. Based on the garlic shrimp app alone, we'll return and try as many tapas as we can handle.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Amazing find! True Spanish tapas, delicious recipes, big portions, and very attentive service. I cannot believe after living in the area for over 20 years I just now discovered it.  I will definitely be back to try their paella. This time I just tried different  tapas (6) & desserts and everything was fingerlicking good.  BTW, there was so much food that we had 6 boxes of leftover between the 2 of us.", "author": "Tomcio P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-13", "description": "Horrible customer service. Had a reservation for 16 for my mother in law's birthday and apparently, they did not put it in the books. No sorry and no nothing. I would put a no star if that was possible.", "author": "alfred c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Patio Español is the type of place to take your mom for a birthday dinner.\nFriendly Staff, Calm peaceful beautiful atmosphere \nkid friendly and warm. white table cloth restaurant but without all the snootiness. perfect to help kids learn table manners (multiple forks, cloth napkins, etc) without feeling like all our kid's noises would be disruptive or sneered at.\n\nI felt like I was in Europe at a quaint restaurant in a small village where all the locals go to eat with their families - it so different from most SF restaurants. \n\nOn a cold foggy day, the Paella Marinara (Seafood Paella) hit the spot. \nIt was flavorful, generously adorned with all the shell fish and saffron rice you could imagine in very generous proportions, and cooked just for us (25 minutes wait time for Paella but SO worth it) - served into plates right at our table. \n\nWarm fresh bread, standard salad, and a super garlicky soup (garlic soup) - reminded me of something that would be served at Stinking Rose Restaurant.\n\nServers were very responsive - our water was refilled quickly and our plates were constantly being cleared it seemed within a few minutes of us finishing our dishes. how nice! \n\nI love that on a Friday night we didn't have to wait an hour for a table - we were seated right away. It looks also like a super fun venue space, there was a few events going on that night. \nextra perks for PLENTY of parking in their lot. convenient location off Alemany (right near Pacific Super)\n\ntonite the kid said before going to bed with a big smile -\"I really like that place i want to go back!\"", "author": "Win H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "This review is strictly for their tapas.\n\nI had heard a lot of good things about El Patio Espanol and was excited to try the food. My friends and I weren't hungry enough to order paella (you have to order a minimum of 2 orders...wth) so we decided to order a bunch of tapas. Here's the score:\n\n1. Queso Manchego con Fruta Fresca - You pay like $9 for six thin slices of manchego, three pieces of pineapple and a strawberry. Delicious, but not worth it. (C)\n\n2. Setas Silvestres al Ajillo (mushroom in garlic sauce) - This was delicious! It comes in a very rich garlic and white wine sauce that you can soak your bread in. If it was hotter (temperature wise) when it came out, then it would have been excellent. (A-)\n\n3. Gambas al Ajillo (prawns in garlic sauce) - Yeah, another garlicky dish, but oh so good. Like the mushrooms above, this was in a garlic based sauce laced with sherry. Slight temperature issue again, but overall, very nice. (A-)\n\n4. Torta de Cangrejo (crab cakes) - HOLY SALT! I don't know if it was the coating or the crab meat, but this thing was salty as heck. You get two super crispy and nice sized cakes with a refreshingly acidic side salad to cut the richness. If it wasn't so salty, I would have really loved this dish. (B-)\n\n5. Albondigas a la Castellana (meatballs) - Meh kind of meatballs in a sauce that tasted like it had pureed celery in it. I didn't mind, but one of us could not stand the taste. Forgettable. (C)\n\n6. Tortilla Española (omelette) - Saved the best for last. This dish came out later than the others (we almost forgot about it), but I'm so glad it did because this was the best dish of the night. Fluffy egg encased soft potatoes, red peppers, onions, and a piece of heaven? We all loved this dish and it was the only thing we took home. Bonus points for being piping hot! (A+)", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "The service was excellent.  The food was delicious for what you pay!  The inside looks alot better than the outside.  Good for dates.  The outside can probably use some remodeling/touching up so it looks more like a restaurant though.", "author": "Vance K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "Horrible service and deceptive practices. STAY AWAY!\n\nI usually don't write negative reviews because I know they really hurt small businesses but this was just so bad that I had to share. \n\nOur party got seated fairly quickly but this was the only thing that went right. The service was non-existent. I kept asking for a waitress because the menu stated that it takes 25 minutes for the paella. After asking servers multiple times it took us nearly ONE HOUR BEFORE WE COULD GET OUR ORDER IN. I was willing to give them the benefit of the doubt that maybe it was because they had a full house. No, it was  the same non-sense even after most of the patrons left the restaurant. At this point the restaurant was only half filled and THE WAIT FOR THE PAELLA TOOK MORE THAN 45 MINUTES, which turned into a THREE HOUR LONG MEAL. And the food was not even good! What the hell are these people raving out. The paella was bland. There was a good amount of seafood but it wasn't good seafood. The seafood was NOT FRESH. The scallop was tasteless and rubbery. Actually everything was TASTELESS!!!\n\nBut that was not even the worst part! We asked about the two order minimum that was stated on the menu and the waitress confirmed that we had to order two orders of the paella. So we asked to get the Paella Valenciana and the Paella Marinera (two different kind of seafood paellas). You would think that this would be two orders or if it's not, the waitress would have the courtesy to point out something. It was only when we got the bill that we learned that each order inherently comes with two orders so we actually ordered four orders of the paella. WHAT KIND OF BULLSHIT IS THIS?They should state the actual cost or at least do a better job of explaining this. I'm fine with playing 40 dollars for a large serving of paella IF I knew this ahead of time but THIS WAS A SCAM.", "author": "Donna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "I've been here for two birthday parties and it has been awesome every time.  This is a buffet style brunch with unlimited mimosas.  The selection is not as varied but what they do offer is delicious.  I don't remember a bad tasting dish in the house.  So I would highly recommend this place for birthdays.  They also have interesting history posted up in the hallways if you find you arrive early and want to kill some time.", "author": "John P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-17", "description": "THE WORST TAPAS I'VE EVER HAD!! - is how I would describe this Basque restaurant in Outer Mission. Before I go on to tell you my nightmare experience at this restaurant, you should know that I've been to Spain and had plenty of amazing tapas. \n\nOn a quest to search for a backup venue for an event in 2013 as the Basque Cultural Center in SSF wasn't available, a friend told us about the banquet space at El Patio Espanor. So tonight my family and I went there to check out the space and also taste some food. Little did we know, it was the worst meal we've ever eaten. \n\nWe wanted to taste several tapas so we ordered 4 standard tapas dishes that we had both in Spain and also in other tapas restaurants in town so we can have a benchmark to go with:  \n\nTapas Del Dia - Scallop cooked in garlic, white wine sauce and Serrano jam. Mediocre dish. \n\nGambas Al Ajillo - Shrimps cooked in garlic and tomato sauce. This was ok, the shrimps were good size, but nothing exciting to write home about. \n\nWild Mushrooms with Garlic and wine sauce - this was by far the WORST dish we had. First, the mushroom was wrong. The cook used fresh shitake mushrooms that they probably bought from the Chinese grocery store Pacific Super right next door. It wasn't porcini or even regular boring white button mushroom would have been better. All the mushrooms were drenched in the same garlic white wine sauce, same taste as the scallops and shrimp dishes. Completely weird tasting as shitake mushrooms have a more woody flavor and the texture when cooked in the white, gummy, starchy sauce just gave it a terrible texture. It was disgusting. \n\nTortilla Espanola - when this dish arrived, the server told us is American omelet. Um...hello, was the name this dish Tortilla Espanola? Shouldn't he say is Spanish Omelet instead? Or was he just being snooty and trying to insult our intelligent by telling us is American? \n\nAn entree - Ribeye Steak. This was the only decent dish we had and we had. \n\nNow on to the service - where do I begin? There are no praises for the server. I would have tolerated the bad food in exchanged for superb, friendly service. But in this case, our server was an old, snobbish, unfriendly man whom we caught him on a night when he didn't feel like working so he decided to ruin our evening by giving us lip and attitude. I was the last to arrive to join my dining party. I was never offer water and even after I've placed the food order, he didn't bother to ask me if I would like a glass of wine or something to drink. Obviously he didn't want to do extra work. He didn't bother asking how my dining companion like his steak either. He never once come back to check on us during the meal nor did he offered coffee and desserts. \n\nThe place was dead on a Wednesday night. Only our table of 3 and another table of 2. I should not have ignore my instinct of never eating at a place where food comes to die! I have a strong suspicion that the cook must be Chinese as all the dishes are all covered in starchy sauce just like bad Chinese food in lousy Chinese restaurant. Plus he used shitake mushrooms in a Spanish dish. What do you think? \n\nTo have eaten here was a total waste of my time and money, the food left a bad taste in my mouth and insulted my intelligence and appreciation for gourmet food. I was actually skeptical to write this review for fear of tarnishing my Gourmet Princessa reputation of eating a terrible meal.", "author": "Gourmet Princessa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-09", "description": "My friend and I came here for dinner on Superbowl night and the restaurant was empty. We were the first guests there. Promptly seated at 5. The maître d' allowed us to pick the table and we situated ourselves at the corner of the huge dining room.\n\nI started with a cosmo and my friend dubonair cocktail. We also shared the calamares fritos (fried squid served with lemon and aioli) while checking out the menu. For tapas/appetizer, they do give you a generous portion.\n\nMy friend's Pollo al Jerez (chicken with sherry cream sauce) is an explosion of flavors---the prime reason for his continuous patronage at this restaurant. My Solomillo a la Andaluza (grilled filet mignon sauteed with shitake mushrooms in green peppercorn and brandy sauce) is perfectly cooked to medium rare just as I requested. The sauce is tasty but not overpowering.  We each had a glass of Spanish red to wash down the meal.\n\nWhile we had little room for dessert, we also devoured a cappuccino mousse cake. \n\nNow are you ready for the big surprise: all that food and alcohol for just under $50 per person, so we left the server a fat tip for his attentive and friendly service. I became an instant fan of this hidden jewel of a restaurant. Great food, atmosphere is awesome.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "This has been our Sunday splurge (calorically speaking) for a while now, and I've finally gotten around to writing a review.\n\nMothers' Day brunch, Fathers' Day brunch... this is *the* place to be! \n(they take reservations, btw.) \n\nThe homemade soups never disappoint, their salads & vegetables are fresh... smoked salmon, prepared salads, and fruit... Fantastic. \n\nTheir hot dishes (for brunch) were a-plenty ($30/person, $15 for kids up to 12, not sure what the cutoff is for children..., including tax and tip.) - Prime rib, pork ribs, sole with champagne/mushroom sauce, pasta with meatballs, paella valenciana, and one other dish I can't remember right now.... \n\nSpecial brunch hours were 11-2 today, we arrived at 11:30 and surprisingly there was no wait. Seating for the brunch was in the ballroom, spacious and you kind of feel like you're in a wedding banquet. Usual seating is in the bright dining room, which I love. \n\nMimosas were flowing and the service was great, desserts made my day (I had 1/3 of the amazing cheesecake, I was being *good*) and once I hit my goal weight (7-8 lbs from now,) we will be back to celebrate!!!", "author": "Sf Momm Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "There are folks who might want to reconsider dining here. If you have chemical sensitivity, the restaurant had a very strong smell of bleach, especially the restroom.  And for vegetarians, th vegetable paella is made with chicken stock and if you request that it be made vegetarian they use water, not a vegetable stock, which leaves the dish without any taste.  The positive aspects of dining here are the size of the portions, the service and the olives are excellent.  The flan was also completely bland.  But there is free parking.", "author": "Jerry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Best paelle marinera  for me , Ive been to I believe most if not all Spanish restaurants, in the S,F bay area and to some around the globe, So far, also the Flan is grubbing with some brandy and coffee.", "author": "Carmelo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "All around good experience. From the parking, drinks, food and service. Really enjoyed the paella and tapas. This place is becoming a mainstay for us. Consistently good food at a fair price!", "author": "Dan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-06", "description": "Cute, seated right away but they were out of a lot and failed to put 1 of our two entree orders into the kitchen. When our meal finally arrived the waitress gave my husband salmon saying she didn't order his pork through the kitchen so she hoped salmon was ok. It was really dry, came of as a \"make it work/serve them whatever\" sort of plate. The correct order, mine, looked and tasted nice but I was taking my husband to dinner, it was very sad that he was given such a sad wasted salmon. Granted we were not charged for the salmon but I didn't take my husband out to dinner to save money. It could have just been a bad night I guess but there were only 5 other tables with guests...", "author": "Kira H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "There's a bit of waiting going on here, but it's definitely worth it.\n\nDuring their Sunday brunch, the doors open sort around 11:30-ish... as the crowd gathers in the waiting area, you know that you're waiting for something good.\n\nOthers have described the rotating brunch menu well, but even just with the salad items, smoked salmon on toast and that paella, you'll have enjoyed a filling meal.  \n\nAnd desserts!  Every single one was a hit - the light and airy cheesecake, the subtly sweet chocolate cake and the creamy flan.\n\n\nFor dinner, the flavors are bolder and much more.  The appetizers are saltier and sweeter, brinier and vinegary-er.  And the paella (again)!  The wait (30+ minutes) should be spent enjoying the appetizers, but once it gets there, you realize you have a long way to go before you're done.  It seemed like me and my friend continuously went back for more scoopfuls of paella, without being able to make a dent into that delicious mound of rice and seafood.  You don't need an appetite to eat it - you need a hole in your stomach that can't be filled.\n\n\nFor the rest:  the service is hard-working and polite, but they aim to stay out of your way.  The decor invokes the idea of being in an outdoor church patio.  The tables are a bit cramped, but you easily get lost in your own conversations.\n\nYou spend a bit of time waiting here, but in the end you realized you didn't want to be anywhere anyway.", "author": "Don B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "My Family has been coming here for years. Tonight we seen Joaquin again...he had retired but was back working again. The food is always delicious, the sauces are out of this world. The service is top notch and very attentive. There is plenty of parking but we live just around the corner so it's good for us to walk off all that delicious food", "author": "Jaime V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Such a jewel of a find on a Saturday night! Craving paella and only usually finding them in Peruvian restaurants. I love Peruvian food especially since there's an abundance of good ones here but just thought we wanted to try a Spanish restaurant this time. Patio Espanola popped up on my Yelp list at the first search for \"paella\".  Minimum paella order is 2 but because we wanted to explore the tapas menu and didn't want to wind up with leftovers we paid an extra $6 charge to order 1. Not a problem because the paella valenciana was so worth it. It was flavorful and packed with seafood and chicken. Cooked perfectly. We devoured it and actually found the 1 order to be just enough. The order came with a bowl of sopa de ajo (garlic soup) that was delicious as well with it's rustic flavor and perfect temperature. We had 3 tapas. Our fave was the chorizo manchego so flavorful we started to clean up the bottom of the serving dish with bread so as not to waste the flavors of the chorizo oil and onions/peppers combined. Also had the variety of olives and the pan de Jamon Serrano. Sounds like a lot of food but I thought the tapas servings were perfectly sized for 2 (maybe even 3 but we are big eaters) and we had just enough room to squeeze in a tangy, tasty passionfruit mousse cake. I'd like to add that the restaurant had a nice charming ambience. High ceiling with exposed beams, lots of pictures and wrought-iron displays. Yes it is part of the Spanish cultural center.", "author": "Melinda V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "Just had yet-another meal at 'El Patio Espanol', a wonderful, authentic 'slice of Old Spain', on Alemany Blvd., here in San Francisco...\n\nWonderful food, including a 'stellar' Paella, beautiful 'Tapas' dishes, delicious, if dangerously-good Sangria, and incredibly warm, friendly service, huge portions, fine ingredients, including Chorizo imported from Spain, and generous amounts of expensive Saffron in their Paella, and other delicious dishes...The prices are quite reasonable as well, particularly compared with the 'Hipster'-type Paella places here in the Mission...\n\n'El Patio Espanol' is a 'hidden gem', around for many years, as part of the Spanish Cultural Center, and even some folks in the immediate neighborhood don't know about it, but once they happen upon it, they're back again-and-again, as we have been, (we were told about it by friends who've known about it for years, and we finally 'discovered' it ourselves a couple of months ago).\n\nIf you're looking for a comfortable, relaxed space, a fantastic, authentic Spanish menu, and wait-staff that are both informative and super-friendly, with good prices, this is your place...Eat there once, and I am willing to bet you'l be back as often as we've been...'El Patio Espanol' is the 'real-deal' in a town with WAY too many overpriced, clip-joints' catering to the tourist trade...I can't say enough good things about it...ME GUSTO MUCHO", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Love this place, great Spanish food, reasonable priced. The servers are wonderful and the dinning hall is down to earth.", "author": "Curly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "This place has awesome food. Definitely give it a try. I've been here twice and the staff has always been attentive and nice.", "author": "Anabel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Decided to stop here on the way home..what a pleasant surprise. We had the white wine chicken, the garlic chicken, and the sea food medley. Everything was very good. The garlic soup was good! It's a bit pricey but worth the stop. Will be sure to come again.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "It might not be best Spanish food in town, but to me, it is the best Spanish restaurant in town.  It has the feel of an unpretentious restaurant of Spain.  And it is the only place where you will find old timers form Spain always willing to share their war stories.", "author": "Wilko S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Have been to Patio Espanol for dinner with large groups of ten or more many times and everyone always has a good time. Bar service is slow depending on whether they have a large event in the hall. Last night we had 10 people and started with sautéed mushrooms and calamari and both were excellent. I ordered sautéed shrimp tapa with rice on side and mixed it together to form garlic deliciousness. They brought a yummy flan to share for the birthday boy. We brought our own wine ($10 corkage) and drank a lot, dinner cost was $45/head total which is reasonable. I like the charm of the interior, like a Spanish courtyard. Parking always good but it's out of the way which is why it's not more crowded. We'll be back.", "author": "Michelle O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "Pretty good food at a great price.   Service is always consistently good too.  Been here a few times and will definately come back again.  I ordered take out once, it's best if you eat there.", "author": "Suz L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "NOTE: This review is only about their Sunday Buffet only.\n\nBeen coming to El Patio Español for years for their Sunday buffet, which has all sorts of delicious dishes from Spain.  This restaurant can be a bit pricey, however, if you love paella, fish, pasta, and all types of meats, you may enjoy this restaurant. \nThe food is not spicy, but it can be on the oily/salty side. They use a  lot of cream/oil on their meats/fish dishes.  \n\nOne note of caution, their buffet has different types of food each time you go there, but they always have paella, olives, a cold seafood patter, fruits, and bread. I've eaten different types of fish, lamb, pork, steak, fox tails, and chicken. Most of the meats are sauteed, are soft, and juicy. \n\nIf you are a picky eater who doesn't like surprises, I don't recommend going there for Sunday buffet. Go to the dinner, where you can order off a menu and know what your getting. \n\nI really like their selection fruits and salads. Their trays are always filled with watermelon, pineapple, oranges, etc.  Each time you go there, they will have different types of Spanish soups, all which are delicious and interesting to try.  \nI've had tomato and white bean soups which have been delicious!\n\nFor those who are dieting, going to a buffet with delicious seafood, meats, paella, and desserts, you will overeat! I usually skip dinner when I go there!\nThe desserts are one of the best!  Love and their flan, cheesecakes, and other surprising/tantalizing desserts.\n\nThe downside of this restaurant is there mediocre service.  The wait staff are not very attentive, and many cases, you need to have flag them down if you want a drink.  While this appears to be an ongoing issue for years, it has gotten better, but not by leaps and bounds.\n\nRemember to keep an open mind when going to the Sunday buffet. Enjoy!", "author": "Jes V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-28", "description": "A must try!\n\nA little hidden gem in the Excelsior District. You would never notice it unless you knew it was there. The restaurant is actually part of the Spanish Cultural center and it is often used as an event space to cater large events including weddings. Apparently the King of Spain was in attendance at the center's inauguration. The architecture and ambience is geared toward creating a antique Spanish feel. Theres red roof tiles and stucco walls. Not too sure if they were authentic, but it gets the job done in creating the atmosphere. \n\nTheres a full bar there and plenty of seating. Its never really busy because I don't think too many people know about this place. I think it makes most if its money from larger banquets and events through the cultural center. When I came, our party was seated immediately and we had a waitress that was working her first shift. The people working there did not seem to be fluent in English (not sure if that was just part of the motif). But they knew enough to get through the menu. Our waitress was very nice and spent most of her time with us because there was no one really else there. Our table ordered some tapas and I split the Paella with someone. The food is undeniably delicious. Everything came out fresh, flavorful, and distinct. I'm not sure how to cook paella properly, but I heard its quite a process. The paella valencia here was soooo good. \n\nIt's sort of a fancy dining experience so everything is a little expensive. But I'd say its one of the places that is worth it.\n\nIt'd be a great place to get some food and wine and catch up with old friends. The feel of the place makes you want to sit and eat and chat the night away.\n\n-pricey but worth it\n-always pretty empty\n-some of the waiters are from spain\n-great atmosphere \n-its literally right next to BART so its pretty loud when it goes by***\n\nTry the housemade sangria!!", "author": "Arthur C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-12", "description": "I have been here two times already for Sunday brunch. \n\nThey do 24$ brunch with bottomless mimosas. Which is actually a really good deal. \nThe customer service was slow and not very attentive. You gotta tell them every single time you need some liquid on your glass because they barely keep an eye on your drinks. Besides that, nothing to complain. \nThe food was good. I definitively recommend the paella (delicious) and the salmon. However, I think they can do way better Spanish buffet. \nThe atmosphere is like old Spain. Mostly all the customers are old people. It seems to be created for them. I think that's why it is cheap and not very busy. \n\nFinally, the location is kinda far from everywhere. Although, I would go more often if they have more variety of good food like their paella and a better background music.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-08", "description": "We had a party of 4 with two persons ordering their paella marinera and two persons ordering their filet mignon entre.  We had their calamari appetizer which are good sized portions for $9.50 to feed all of us.  It was decent.  Their paella was average; but good sized as well.  We had to bring some back home.  As for the filet mignons, it was very strange.  The meat came in two pieces on our plates.  My guest thought that one piece was very tough and inedible.  One of my pieces was burnt and seemed like some end piece of some other cut of meat.  Similarly with my guest's piece.  The main piece of meat was delicious though but it seemed like the regular filet was cut in half.  The vegetable were fresh and expertly cooked and their potatoes were excellent.  However, I gave them two stars because of the filet mignon described.  Service was fine.  There are nice photographs of Spain on the wall.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Outstanding food, family friendly, beautiful architecture and excellent service.  A no brainer for Sunday brunch", "author": "joanne g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "I just don't trust a place that charge my card twice! For something that I didn't know or consumed!!", "author": "Joaquin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-04", "description": "Still no croquetas.  I know they are very time consuming to make but as far as I'm concerned, not having croquetas in a Spanish restaurant is like not having Spaghetti Carbonara in an Italian restaurant or no pepperoni at a pizzeria.\n\nThankfully, they still had calamari frito y gambas al ajillo.", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "Had dinner here last Sunday 9/23/12 and overall had a pretty good experience.  The reason I am giving this restaurant a 5 star rating is solely for it's food.  Service wasn't too bad either. \n\nPro's:\n- Food just melts in your mouth! Every dish I tried was well portioned and perfectly cooked!\n- Service from our waitress was good.  Although manager seemed to talk to every table except for ours (maybe he knew who had been sitting at the other 4 tables??) \nCons:  \n- Location \n- Ambiance. Nothing to it, nor the decor. \n- Expected a little more from their sangria's (since the food was so good)\nPlace could sure use a make over.  I entered hoping to find a live atmosphere but instead seen a boring decor with really cheap seats and tables.  Defiantly worth going at least once just to try their awesome plates.", "author": "Javier V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Good food I recommended this place I thy paella valenciana  the was good. And also the crema Barcelona really good", "author": "Rigoberto O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "Great food ,  shitty location.  I love the paella  even though it takes hella long cook.    I gave it four stars based on this bomb ass dish!", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "I like this place because it never gets busy. You can hold parties here too. Everything I order here is pretty tasty. Their lamb entree was so delicious. Every time I come here I always get the paella. It is pricey but it's worth it, so flavorful. Another plus: easy to find parking :D", "author": "Pam Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "I love this place! It is so well rounded. I used to come here often. I don't get many opportunities to eat here ever since I moved to the east bay, but when I do, it's always great!\nMy favorite has always been the paella. It is DELICIOUS!\nThe atmosphere is great, along with the service. This is a really good spot to have a group dinner with friends and family, have some wine, and reminisce  with some good conversation. You can take your time during and after your meal here. I highly recommend this place.", "author": "Jose C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Enjoyed a great meal with my wife and a friend.  Food was great.  The paella Valencia was enjoyed by my dinner partners.  I tried the garlic soup which was great.  Service was good and the surroundings pleasant.  Room was large but not noisy.  You will not be disappointed.", "author": "Hank Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-18", "description": "My husband and I just came from having dinner at the Patio Espanol. In my opinion, this was the lousiest Spanish food I have ever tasted - actually it was tasteless. My Dad (RIP) was a member of the Union Espanola de California since its inception on Alemany St. He would have complained about the service - which today was super slow - mind you, we were the second table to be served and we waited about 1 hour for our food.\n\nSpeaking of the food, I ordered Garlic Soup - which was watered down. This I returned and then I ordered the soup of the day Asparagus Soup which again was watered down - I returned this one too. This 2 soups should have been thicker.  My husband ordered a salad which off course you can't get it wrong.  My main entree was Bacalao a la Vizcaina - Basque style cod fish.  The cod should have been saltier then what it was.  I think the cook soaked it too long.  I actually had to add salt to a salty fish.  I could not eat this lousy meal and thankfully, the water did not charge us for this and the soda. My husband had a lamb and shrimp combo platter which was just OK.\n\nI expressed my opinion to the manager and I told him that the cook should be fired.  I told him the soups were too watered down.  He got a little defensive and said that his soup tasted very good.  I spoke to the other manager who understood the concept of having a saltier cod  fish.\n\nA Spanish restaurant should have Spanish staff.  The cook should be a chef from Spain and not Central America).  The waiters should also be from Spain and not people that do not understand what the real Spanish (from Spain) culture is.  The facility manager or Caterer should be a Spanish Lady not a caucasian woman that does not even speak any Spanish and has never been to Spain.  It is a pity that the Patio Espanol seems to be going down the drain.", "author": "Lalo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "With 30 minutes to go before the Niners' kick-off on Football Sunday, what am I doing here?\n\nMy wife laid out a guilt trip on me so I had to comply; otherwise, I may have been in the doghouse. We celebrated my Dad's 80th birthday here last year so she wanted to return for the food. I like this place, and it's almost like a hidden treasure within the city. We came here because of their wonderful buffet.\n\nAs you walk in, you instantly get transformed into a patio somewhere in the Spanish countryside. This place is spacious as they also have a Banquet room. (My cousin also held her wedding reception here about 12 years ago.) They have pictures of Spanish towns, Bull Fighters and scenery all over the wall which adds to the nice ambiance. They have a full bar inside and the dining area has high ceilings with plenty of natural lights coming in, complete with tiled roof and wood beams similar to Spanish Colonial architecture. To put it bluntly: it's a beautiful room.\n\nThe Hostess is nice and they have friendly servers, although they lacked a bit of knowledge on some of the food and wine. But, they were attentive and filled up your empty glasses while doing it with a smile. The napkins were colored red and yellow, similar to the Spanish flag which I thought was a cute added touch.\n\nThe buffet spread was awesome. Although some where hit or miss, mostly where hits. They offered a soup, cold food, hot food and desserts. For the cold food section, they had all kinds of salads and they even have a seafood salad. It consisted of shrimps, diced octopus and veggies with some type of oil and vinegar dressing. Wow, this was amazing and they ingredients were fresh. They also had Jamon Serrano cut thinly and I gobbled them up. Smoked Salmon, topped with capers on top of sourdough bread was tasty. Dried Spanish Chorizo made into an Empanada surely was delicious. But I kept going back for the Jamon Serrano.\n\nFor the hot food section, I started with Spanish Omelet with chopped sausages, bell peppers, onions and other good stuff and it was fluffy, soft and sublime. Penne Pasta with Pesto sauce (or Triple P) was also good. They had Lamb Stew which I found it to be tough and breaded fish were the only two dishes I didn't enjoy. Then their version of Paella, complete with chorizo, clams, shrimps, shellfish and a hint of saffron was superb. Although I prefer mine to be spicier, this one was a pure hit for me.\n\nFor dessert, they offered flan, chocolate cake, carrot cake and rice porridge with a drizzle of cinnamon. The flan was excellent as it had just the right amount of sweetness to it. The rice porridge was also airy and surprisingly light. Usually, porridge is heavy and syrupy but not this one. The cinnamon gave it some nice additional flavor without overpowering the porridge. We passed on the cakes since we were both stuffed.\n\nAfter finishing, I looked at my watch and it was half past one and saw the TV in the bar just in time to see J.T. O'sullivan getting sacked. But, we ended up winning the game in OT against Seattle. So, it made the trip to a quaint, countryside in Spain more enjoyable on a Football Sunday.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "Generous portions. Paella and rack of lamb are great.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-10", "description": "Mother's Day Brunch. Limited menu selection \n\nI had Zarzuela (Safron base, fish stew) was very good. The lamb chops were nice, and good temperature. The Prime Rib was ordered Medium and came out a little overdone, the Whiskey peppercorn sauce was very good (Old Hungry Hunter restaurant recipe) this apparently made up for the overdone Prime Rib. The Filet was two overdone Hockey Pucks. Our table shared a bottle of wine, a reasonably priced Merlot, and user friendly enough to go with our variety of selections. We also ordered the Calamari appetizer, it was good, and a Garlic sauce Shrimp or Gambas Al Ajillo. The Gambas is the traditional Tapa' and was very tasty although it did not come out hot enough (temperature wise) \n\nThe Entree's came with a soup or salad choice, and the Zarzuela dish came with a side of veggies and saffron rice. I ordered the Potato Leek soup, it was not as thick in consistency as I would have expected, but flavorful with chunks of yukon gold potato.  We tried three deserts - A typical flan, which was not as sweet as I would have liked, a Pyramid shaped white chocoloate coated cheesecake, with some raspeberry jam in its core. This I enjoyed particularly and finally a Tiramisu. I didn't try it but it looked nice.\n\nAll in all a good experience, an enjoyable evening with decent to good food for the most part.. ( Barring the Overdone Filet and Prime Rib) Three out of the five dishes for our table were well executed.\n\n Despite being Mother's Day (The busiest day of the year for most restaurants) this place was not too full, we were seated immidiately despite being a few minutes late past our reservation time.", "author": "Gabriel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-01", "description": "This is a review for Sunday Brunch only.   25$ person pay at door (tax included).\n\nGot there at 11:25 and I was the first person to dig into the Paella which was just ok.  The shrimps were already over cooked a bit.   Fair amount of mussels and clams.  I didn't see much sausage, and I'd avoid the fish.\n\nWhen we went their was a Mahi Mahi dish separate and I'd suggest putting that into the Paella (I'm pretty sure it was Mahi in the Paella, but it was way over done compared to the Mahi sitting by itself in the bin. )\n\nAll in all the freshness of the paella was about as you'd expect from a buffet ... oh and we thought it was a bit bland.  \n\nThe other main dishes were also just ok - there was a chicken breast in artichoke sauce, a roasted pork dish which was a bit dry, and a pesto ravioli.  Oh and the cold shrimp salad was probably the best dish - we tried everything. Deserts were good.\n\nOne thing I'd recommend is to dress up a bit - almost everyone in there looked like they just came from church - I felt like a dope in a t-shirt and shorts.   The place really filled up by 12:30, so I'd recommend getting there at 11:30.\n\nThe service was much better than expected and the wait staff filled us up non-stop on the mimosas, and they had no problem giving the wifey a glass of wine while she still had a mimosa. \n\nWe checked out the banquet rooms and I'd say this would be a great place to host a wedding - I wouldn't count on the food being spectacular, but it would be good place to have a non-Chinese food banquet, and they're close to the freeway which would be great for people coming in from all directions.  And there is a good sized parking lot (free).\n\nWould I go back ? Hmm if I was really starving on a Sunday morning & didn't want breakfast.  Or if I needed somewhere to take a group for Sunday brunch, (but get a reservation.)", "author": "A D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Dinner on a Sunday night. Paella (seafood). was outstanding.  The combination of taste and different textures of the seafood , rice and vegetables made this a splendid dish.  The amount of seafood was crazy.  The plate had more seafood than rice.  It was great great great\n\nWe had sangria to accompany the meal.  It was good as well.  At the end, we had flan.  It was made in house and was a tremendous way to end dinner", "author": "Bill L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-12", "description": "My wife and I just had our wedding reception here this past weekend and it could not have been any better. The entire staff was amazing, I would name every single one of the waitstaff if I could but I don't have the time. Sherri was great to work with from the time we first met back in January at the start of planning, and she found new ways to amaze us throughout with her professionalism\nAnd courtesy. Under her watchful eye, everything, I mean everything at the reception from start to finish ran on time and smoothly, and she \nworked perfectly in sync with our DJ/MC to ensure everything was on target. The food was amazing and I cant count how many times I've already been told it was by far the best food they've ever had at a wedding. Thanks Sherri and everyone at Patio Espanol for making our day so great", "author": "Nick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "The neighborhood and the Pacific Super next to this fine dining could throw you off for a minute.  But don't be fooled.\n\nFor regular dining experience, the tables are nicely set with that old spanish feel to it.   They really worked on the decorating details.  It added to the ambiance, to that romantic setting.  We ordered paella and a chicken dish and it was really good.  I really liked it and I've always wanted to come back.\n\nA dear friend of mine held their wedding reception here just recently.  I have to say, the lady coordinator was really nice.  Not only was she especially accommodating to the bride and groom, she made sure the entire bridal party was taken cared off.  She offered her office for our purses and to rest while as we waited to be introduced.  She even took the effort to get us our drinks once we arrived at the place.  Now that was really sweet.  Thru out the night she was there serving hors d' oeuvre, getting wet floors cleaned up, giving instructions or just answering questions.  She really did a good job.  And she was all composed and smiles.  The bride and groom was indeed very happy with her.\n\nThe reception was at the Salon Picasso.  I just love what they did to the place.  It was early afternoon, but they made the place feel very intimate and romantic.  With low lighting and candles on the tables.  There was a big dance floor where we all danced the afternoon and evening away.  The salon had a full bar, a stage and accommodated set up for the DJ.  Just perfect for a wedding venue.\n\nThe food they served was just incredibly delicious.  I had the Grilled Filet Mignon Sautéed with Garlic, Mushrooms, Peppers and Tomatoes in a Sherry Wine Sauce.  I really enjoyed it,  I finished my plate for once which was a surprise...\n\nThis place should definitely be a choice for any big event.  If I will ever have one, I'd keep them in mind.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-14", "description": "This place was ok. Not good, not great. The waitress was either very inexperienced or this just isn't a good job for her. There is better paella to be had in SF.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "This review is for their brunch.\n\nThe last time I was here was 15 years ago with my parents and I remember we absolutely loved their brunch... I am not sure what happened but today it just didn't it work for me. :(\n\nThe paella looked more *steamed* and almost like Peruvian style Arroz con Mariscos.  Also, the flavour of the bits of meat in there didn't taste right.\n\nI had been looking forward to this for weeks so at $24/person made sure to eat a couple plates of paella, but when I got home I didn't feel well for hours. I also found out my friend started feeling unwell towards the end of her meal, too.\n\nDisappointing to say the least, but perhaps it's because cooking paella for the masses can be challenging (i.e., there's no way to get the coveted sofrito during brunch).  Maybe dinner is better, but don't think I can recommend for brunch again.", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-03", "description": "This place is the \"Spanish Cultural Center of SF?\" That's what their  brochure says! Apparently King Juan Carlos I attended the opening 2 decades ago so that must mean something, right? \n\nMany people think this place is just a banquet facility (which it is and does just fine) However, there is also a restaurant and bar on the premises. \n\nThe ONLY thing I order when I dine here is the PAELLA VALENCIA!!! Es muy excellente!!  The rice (the foundation of paella)  is perfectly prepared...tender bits of saffron heaven and so much seafood/chicken/linguiza that King Juan Carlos would surely give it a double thumbs up if here dining there! \n\nThe sangria (served in these unique pitchers) is just a-ok but not the best I've every sampled (that would be in Ibiza,but that's another story for another time) so usually I opt for something from the bar and they make the drinks really strong, God bless 'em!) \n\nThe dinner salad was huge (enough for 2) and the sourdough bread they serve is great too! \n\nHave never sampled the desserts yet (always too full from dinner) but my friend ordered the flan and declared it dee-lish! \n\nPerhaps next time i will try some other stuff on the menu...then again, I've been saying that for years!! \n\nMe gusta la paella...y tu?!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "Patio español us a great restaurant. Goodman Food,  Great People. Every time my family come to patio español we have a great time.", "author": "Aurora R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-04", "description": "When I was younger, we used to come here quite often for weddings and various family parties.  I always thought the food was really good and different from the kind of dishes I grew up on and used to eat all the time.  \n\nLast year on Mother's Day, my family decided to go here for Sunday Brunch.  I was excited because it's been a good 10+ years since I've been there.  Good thing we made reservations, it was a little crowded but we were able to get walk right in, get seated and hit the buffet station. I can't remember all the dishes but they had a mix of tapas and about 4 entrees (including my all time faves; Paella, Sauteed Prawns, Wild Mushrooms, Fish in a cream sauce).  On top of that was a decent array of apps, other salads and desserts.  They're missing crab on their menu but all-in-all, this place is not too bad for an AYCE Spanish Buffet of $24.", "author": "Resa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "We have not been here in years and will definitely return. We arrived around 6pm when it was still light out and the ambiance created by the 30 foot ceilings, skylights and Spanish decor was a delight transporting you to another time. We ordered several tapas: mushrooms, shrimp, meatballs all in delicious sauces. We also had an excellent appetizer of Manchego cheese, olives, sausage, and prosciutto. The paella Valenciana was excellent as was the Zarzualla. We also enjoyed a great bottle of Spanish wine - Marques de Riscal reasonably priced at $30. I would have given it 5 stars but the salad was a little soggy and wilted with too much dressing. Our waitress was charming and provided excellent service as did all the supporting staff.", "author": "VC m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "The 4 of us had lunch here last Sunday. Easy parking and was immediately seated.  The menu was fairly exotic but we ordered what we knew.....paella Valenciana. The waitress was not Spanish and was a little vague about the menu.  But the paella was quite tasty and a bit pricey, as is everywhere else.\n\nThe room had a big outdoorsy feel with Spanish walls and big murals. I'd probably go back to check out the rest of the menu. Seems like a good place to have a party as there was a loud one going on in the banquet room next door.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "I've been coming to this restaurant for literally 20 years and it's been consistently excellent. It's such a hidden gem, tucked under the BART track and the 280 south freeway. My family always requests the same waiter, Joaquin, who is attentive and a wonderful host. It's a great place to have a birthday party because it's easy for folks to park and it's not hard to get a reservation. i love the fried calamari, champinones al ajillo (mushrooms in a delicious garlic sauce you can sop up with your bread), paella (well worth the wait!), and the sangria is yummy. Don't want to eat a full meal? Order tapas and sangria and sit at the \"bar\" and listen to the old-timers chatting in Castilian Spanish.", "author": "Cristina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-17", "description": "Came here for brunch yesterday after church and the place was \"aight\" as far as the buffet lunch.\n\nBottomless mimosas are included in your brunch, but I still think for the food offered, the price at $25/person was a little too steep.\n\nThe food they had at the buffet:\n\nseafood paella - pretty good\nroast beef w/ some sort ofc creamy gravy\npoached salmon\nbbq chicken wings\nsalami\nsome sort of bruschetta - pretty good\nmeat empananadas\nassortment of salads, macaroni salad, fruit salad\nfresh fruits\ncheeses, olives\n\ndessert : \n\nflan\ncarrot cake\nrice pudding\nfruit\n\nover all it was just okay, their regular menu wasn't available til 3pm so next time I'd like to check it out.", "author": "Jade B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "Its so cute sherri called me today to wish me a happy anniversary i thought that was so nice of her. 1 year ago we got married here and i will be there sunday for brunch i have to the food is so great and i can not forget about the staff im so excited. thank you all for making my day we love you....", "author": "angelina h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "My paella was good, the presenatation was beautiful.  My friends grill shrimp was AMAZING!!  Our dessert was the best creme brulee either of us have ever had in our lives. The service was performed by a nice young man from Spain and he was great.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "So glad my friend brought me here, the food was delicious, the service was warm and the sangria was always flowing.\n\nLet's go down the list of yummies I had last night:\n\n1 pitcher of Sangria, yes, only order this by the pitcher because you will kick yourself after your glass is empty.  \n\nCold tapas...\npotatoes with aioli - your traditional potatoe salad, very good, well flavored, looks like that gave us the full 10 pound bag of potato, excellent!\n\nDry Chorizo - a very generous plate of dry chorizo and olives, the saltyness of the olives and the full flavor sliced sausage was a great combo\n\nmarinated anchovies - OMG, perfectly tangy and oh so good, i recommend using it as a spread on your bread\n\nNow for the hot stuff:\ncalamari - just order it, it's a staple at every table.  perfectly seasoned and fried served with a huge plate of mayo.  \n\nmussels and clams - it's ok, i'm not a huge tomato sauce person, but definitely fresh seafood\n\ncrab cakes - seriously, tapas at El Patio is not tapas anywhere else, the cakes were very crabby and HUGE.  you can't go wrong with ordering this, comes with a fresh salad to help keep the grease down.\n\nThis would be a great place for large parties because the portions are sooooo big and more than enough to share with a big group.  The flavors are perfectly paired on every dish and the service was just immpecable.  let's just say my glass was NEVER empty.  \n\nCan't wait to bring my family back to try this place!", "author": "Ames K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-26", "description": "Highly recommended by this hot biology professor in his 50s--think, a more filled-out, buff, Mexican George Clooney---.... Patio Espanol was the destination for the close family and friends of my lovely friend who just earned her bachelor of science in Cell and Molecular Biology at SFSU.  \n\nYou wouldn't think much of this place at first, since it sits next to Pacific Super on Brotherhood Way, adjacent to the BART tracks, in a not-so-accessible part of San Francisco, but it definitely is a gem of a find.  This restaurant is also housed in the Union Espanola de California--the Spanish Cultural Center.  Patio Espanola literally looks like a beautiful patio, with gorgeous ironwork decor, light fixtures, resin wooden artwork, fountains, and very high ceilings.  It's a great space to even hold private parties (I believe they cater to those requests too).  \n\nThey offer a tremendous and fantastic selection of Spanish tapas (hot and cold), including: mussels/clams in wine/garlic tomato cream sauce, SERRANO HAM, manchego cheese with pineapple, calamari, chorizos, delicious albondigas (meatballs), and plenty more!\nI need to come back here to try the crabcakes, fried monkfish, tripe, and whatever else we didn't order last night.\n\nOn top of tapas, they serve PAELLA (both the Valenciana and Marinera variety), and other entrees.  I had the steak.\n\nMay I tell you more about the steak?  Okay---it was perfectly medium rare and served with a glorious... GLORIOUS.... mushroom and brandy wine reduction... it.was.EXCELLENT..... that I kept eating it PAST my satiation point, until a pregnant woman stopped me because she knew  how much I had already complained to her that I was getting HECKA FULL (from the tapas, the bread, and SANGRIA from before).\n\nTheir fabulous sangria is STRONG and marinated with a perfect mixture of flavors that really enhanced the flavors of everything I ate.  I started getting so relaxed after half a glass or so.  It has apples and oranges, and I believe they also infused the sangria with cardamom--which was a GREAT touch and complimented my steak well.  The cardamom element of the sangria would've helped it pair well with chicken too (i know, i know... red with red, white with white, but i tried it with my friend's chicken dish and it was nice).\n\nI will definitely come back here for the great food, great service, and the hope to run into that hot biology professor again.\n\n( | )", "author": "Grace M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-08", "description": "Mother's Day 2011.. I have gone here before about 4 yrs. ago for mother's day with my in-laws. This year I took my aunts, siblings and my own mom. Last time we had the buffet in thier courtyard setting..very beautiful, this time it was full packed and we ended up in the  Salón Picasso banquet room (largest).. It seemed more like a family wedding reception hall type of setting than the enchanting Spanish style influenced surrounding. The food was just ok, a bit steep for the price you pay and I must say the buffet in Reno is comparable. I  still love the Paella Valenciana is superb here, it's the liveliest dish I last had and still is, the rest is just ok or mediocre.. I would say the bottomless mimosa is a plus to it's price. Will I come back?.. I would have to call and make sure I book for the courtyard, otherwise..i'm not getting what I pay for.", "author": "Ateh M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-23", "description": "I would rate this restaurant 2 stars. Service was slow and make sure to bring your patience if you decided to dine in here or else you will get heart attack for controlling your temper.  We waited 1 hr just to get our order and we waited another 1 hr for the food to be served. Were not happy with our dine in experience here. Hope they improve their service next time.", "author": "Arnel N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-03", "description": "This was probably the worst tapas experience I've ever had.  And expensive, at that!  The only star is for our waiter, who was very sweet.\nBut, just don't eat here.  The tapas are flavorless--tortilla was literally just egg scambled with potato in it--no spices, no onion, no garlic....terrible.  The patatas alioli had no spice, just mayo.  And don't even get me started on the gambas al ajillo--they were not al ajillo-they were in a broth and overcooked. The worst part of all is that they charge $10 per tapa, so you end up paying close to $100000 for crap.  I can't believe this place is that the Spanish Cultural Center....the staff must all go someplace else to eat.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-25", "description": "Ehh, this place is a disappointment. I was invited here for a special occasion. The place can accommodate large groups, so that's a positive. Everything else needs improvement. \n\nThe waiters were slow and didn't get the orders right. The didn't pour the sangria and wine, didn't bring the bread out in a timely manner, and never checked if anyone needed anything. \n\nThe food; from appetizers to the main course i though was pretty bland. The calamari was ok but they serve it with mayo as the dipping sauce.  I had the paella which was bland and the seafood tasted like it had been sitting around and they just added it on top of the rice when it was done. Those that ordered steak couldn't chew it since it was so hard. \n\nThe place was busy overall so I'm\"m not sure if they cater to locals to that area.", "author": "Frida C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-25", "description": "Oh my goodness!  Eating here was like walking into my grandma's house and having her make me dinner.  This is a down home, old school, DELICIOUS and authentic Spanish restaurant.   \n\nLet me be so bold as to claim that they serve the best paella I've had in fifteen years -- since Grandma died.  What a treat!\n\nMy biggest complaint is the location, however I also think it's a distinguishing factor from all the hipster tapas joints in the Mish. Plus, it's convenient since I live in the same crappy neighborhood.  The interior is very old fashioned but simply charming.  A+ for perfect service from hunky Spanish waiters.  Can't complain about that!\n\nThe restaurant is part of the Spanish Cultural Center which was dedicated personally by King Juan Carlos of Spain in 1987.  Imagine that, real royalty in the OMI!\n\nThe bar, a cute little bodeguita, was filled with old timers, shooting the shit over wine, in Castillian Spanish -- more throwbacks to my grandparents.  \"Miguel,\" the volunteer on duty gave us a quick tour of the building and promised that next time we visit, we'll have a drink together.  He thought perhaps he knew my grandparents in the 70's.\n\nI left with a tear in my eye, a bag full of leftovers, and a smile on my face.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "Delicioso! Excellent food, well prepared and presented. Pleasant atmosphere. I will return again for sure.", "author": "Laurie Anne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-01", "description": "My friend and her family celebrate birthdays, anniversaries and other special occasions at El Patio Espanol.  The food is set out like a buffet all you can eat. Everytime I come here, I'm beyond full, the feeling you get when you want to unbotton your pants and change into sweats. The paella is good, there's this creamy mushroom dish with a tender beef that melts in your mouth. cheeses, olives, fruit salad. The desserts are okay. \r\n\r\nNice place overall.", "author": "Glu C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-08", "description": "Patio Espanol is the choice for the high school senior lunches.  Yeah it's a big venue and probably pretty cheap place for broke 18 year olds.  I've only been here once and I never came back cuz I found a ladybug in my salad (which caused a lot of screaming at the table from my tablemates).  Uh no thanks.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-27", "description": "Though also a restaurant, I can only review their banquet function while here for a recently attended wedding and reception.  The banquet menu wasn't reflective much on the Spanish cuisine that's offered in their restaurant, and instead, featured more simple dishes, like pasta and salad.  Several rooms are available for rent, depending on the number of guests.  \n\nOn Alemany underneath the BART tracks, it isn't in the greatest area.  But there is parking.  Still, it seems to serve better as a place to reserve for large gatherings rather than to dine in on the fly.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-31", "description": "\"The restaurant is part of the Spanish Cultural Center which was dedicated personally by King Juan Carlos of Spain in 1987. \"\n\nMy family has been eating at this hidden gem of a restaurant...\nfor years...\nwe tend to eat here ...for almost every family celebration...\n\nIf you are looking for a place with charm and romantic atmosphere...\nyou are not going to find it here ... sorry \nWe go for the food .. !!!\n\nThe Gambas al Ajio.... \nChorizo  and Albondigas are the Standard Tapas\nthat my family order as a Constant Rule .....\nas well as the Pitcher of SANGRIA!!!", "author": "Aldo V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-02", "description": "Simple  some of the worst food I have ever eaten in my life.\n I picked this place going by my past experinces 10 years ago.\n Shame on me and please forgive me my 5 friends and sister for the\n horrible food.   We all went for Sunday brunch buffet wine and mimosas .  I guess if your a big drinker and can get drunk enough\nyou won't mind the nasty food. All for 22.00 per person.\nThe food all tasted old, dry , fishy  like  leftover wedding banquet\nfood. The hot food was cool to cold nothing had any taste of spices\n(bland and tastless.)   The only good thing was the service and a few of the desserts.  There are so many wonderful other places to go for\nsunday brunch in the mission and all of the city for 22.00 dollars a\nperson . Why would anyone waste there time on this place...\n\nUPDATE ( This place has been given the bill h. award as  ( DRUM ROLL PLEASE  DUM DA DA DUM )   THE WORST DINING EXPERIENCE OF 2007 !!!!!!!!!", "author": "Bill H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-17", "description": "I visited Patio Español (correct spelling) for a dinner with my girlfriend. I made a reservation and we got seated right away. I ordered an Estrella Galicia, almejas y mejillones and bacalao a la vizcaína. The waiter was really nice. The atmosphere was nice, reminding me of the time I spent in Andalucía a few years ago. I am not really sure this place cooks true Spanish or even Basque food. The almejas y mejillones were drowned in a red sauce with too much garlic. I doubt the food is like that in Spain or the Basque area (somebody correct me if I'm wrong). Also, the mussels were small and practically tasteless. The bacalao a la vizcaína really let me down. The texture of the fish was not up to my standards of what I call good cooking. Also, the sauce that came with it was not amazing. I wonder if Bizcaia truly cooks the bacalao like that. At the end of the night I told the waiter that I didn't like the bacalao. She listened to me, took the plates away and didn't give me a hint she either understood, she cared or she was going to tell the manager that the food was mediocre. After this visit, I can only give two stars to Patio Español. The food is relatively expensive. I don't know how this place can have 4 stars. It might be nice to replace the name of the business with an ñ since ñ is not a fancy n but a true different letter just like l and ll.", "author": "X. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-31", "description": "I like this place. It's got a good vibe to it - as it's the cultural center for San Francisco's more-substantial-than-you-think Spanish community, it's been decorated with care and attention to detail (and it's pretty cool that Juan Carlos inaugurated it). The dining room itself is rather breathtaking. Likewise because it's a meeting place for the Spanish community, it's affordable since they need to cater to people with diverse incomes. Also, because it's in an out of the way neighborhood (though not all that seedy - the area around has low crime) it's refreshingly free of any of the poisons that can annoy the average, cranky native San Franciscan - out-of-towners, yuppies, or hipsters. Simply, it's old school. \n\nThe bar is handsome and a wide array of wines are served, all of them good. The service has usually been pretty good. Now, to the most important part..\n\nThe food is not outstanding, but very good - a B/B+. What gets it a little extra are two things:\n\n1) They've usually got a regionally diverse group of tapas. I'd imagine this is because it's a cultural center - the Catalans, Galicians, Aragonese, Andalucians, etc all have a representative dish. \n\n2) They have several very good entrees (also regionally representative). Too many Spanish restaurants pretty much serve tapas (which are awesome, but are really just bar snacks in Spain) and paella. You'd think the Spanish just ate paella every day. Not this place! The medallions of lamb (cordero manchego) is particularly note worthy.\n\nIt's not the best Spanish food you'll ever eat, but it's probably got one of the best menus of any place in San Francisco in terms of representing the breathtaking diversity of Spanish food. That it does this while being affordable, and whole-heartedly embracing the culture of traditional Spain is pretty sweet.", "author": "Flynn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "Like everyone has mentioned before, the paella is a great dish. We ordered the paella valenciana for two. The portion for two was huge - more than enough for two people. And the amount of seafood... wow! If you do decide order the paella, order it as soon as possible since it may take a while. \n\nAs for the restaurant itself, the atmosphere is friendly but a little dated. There were two large parties going on - one was a wedding with extremely loud music. The patio area is a nice lit place to enjoy a quiet dinner for two, or more since they can easily handle large groups.\n\nI am looking forward to my next trip to El Patio Espanol. The other entrees looked good as well... and the desserts too! :)", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "I've enjoyed El Patio Espanol for years. My Dad is from Spain, so he likes to eat here when he comes to visit.\n\nFrom dinner for two to my graduation dinner for 20 a few years back, El Patio never disappoints with tasty quality food and attentive service.", "author": "Harley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-09", "description": "The first couple of times I drove by this place, my friend told me it was a funeral home, so I was pleasantly surprised to find such an authentic Spanish restaurant housed inside this nondescript building.\n\nTheir bread is very fresh and the sangria is good, although a little too fruity for my taste. As for the food...\n\nSopa de Ajo Aragonesa - Their very garlic-y soup really lived up to its namesake so don't expect to be making out with anyone afterwards, but YUM!\n\nSetas Silvestres al Ajillo - Mushrooms in some type of wine/garlic sauce. The sauce was out of this world. Try dipping your bread in it once you've cleaned the plate of mushrooms.\n\nCalamares Fritos - The calamari didn't really stand out, but it was good nontheless.\n\nDaily Special! Catfish croquettas - OMG soooo good. Orgasmically so quite frankly. The catfish was very fresh and the croquetta came out nice and light. Not overfried like other places tend to do.\n\nPaella Valenciana - The portions were huge so bring along an empty stomach; they also give you a LOT of seafood. [Note: You have to order at least 2 portions of the same paella so it comes to roughly 44USD minimum, but between 6 of us, there was just the right amount of food]\n\nSolomillo a la Andaluza - You can't really go wrong with Filet Mignon, but it was a tad more medium than rare for my personal taste.\n\nDaily Special! Leg of Lamb - They have specific family dinner options for every night of the week. We happened to drop by on a Thursday and got to try their lamb. Fabulous and tender. The meat fell right off the bones!\n\nThe service was great, very friendly and they honestly wanted to make you enjoy your food. They also catered to some of our more picky eaters by tweaking the dishes! I'm definitely coming back here soon!", "author": "Michele L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-11", "description": "I came here for a private party and dinner was okay but the service was bad!  When you have to ask for horseradish three times from your waiter and never getting it, I'd say the service was bad!  He kept saying that he was gonna get it.  We got tired of asking and expecting it so we ended up bringing our meat home!  I'm sure in the actual restaurant, they get what they ask for but that's unfortunate because people who have parties there will bring in more future business by referral of their experiences there.  This is one place I will not recommend for parties to anyone!", "author": "A D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "I had my 25th birthday party here a couple years ago, and was so grateful, because I decided on a \"big\" (by my standards) party kind of at the last minute and was worried I wouldn't be able to find a place that could fit my large family, provide a dance floor, and also take care of the menu.\n\nSince I had never planned a big event this way, I thought it would be harder, especially with the time constraint.  But Sherri, the events manager, presented me with all my options, and I was able to just pick and choose what I wanted, as long as it fit within the safety regulations of their facility.  \n\nWe rented the Salon El Greco, the second largest room, and our buffet consisted of a large veggie tray, mixed green salad, potato salad, pasta primavera, rolls and butter, Pollo al Jerez, and Grilled Mahi Mahi - all yummy!  \n\nFor a last minute party like that, it went really well.  And as a bonus there's ample parking.  We were a small party compared to the other one in the big banquet room, but we were enjoying ourselves so much we didn't even hear BART passing above us.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-14", "description": "We just celebrated my mother in law's birthday here and I honestly could not find a single fault with the meal.\n\nWe started off with the Croquettas de Pollo and the Morcilla followed by the scallops in cream sauce, boquerones, garlic soup and lamb chops with prawns (as well as a jug of Sangria). All that came to about $80 believe it or not. We also had a dessert of Amaretto Cream pie which was heavenly (and even managed to convince me to have some more food).", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "This was a nice, quiet little place.  The service was great and the food was delicious.  Only tried a couple tapas and the paella.  I haven't had very many paella dishes to compare, but it was hearty, nice flavor and pretty generous, though a bit pricey.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "I've been to this place twice. the first being with my family for their wonderful brunch and the second for school (spanish class) who taught us the inner works of the paella.\n\nBoth times I was satisfied. Their Paella is totally rocking. It tastes soooooooo good. It's pretty much a food orgasm. Their buffet was very spanish and complete. It was really good. But really, their stand out dish here is Paella, so if you want to taste authentic spanish paella, come to El Patio and you'll be coming back for more", "author": "Gabe R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-08", "description": "I thought that I would be the first to review this place. But since I'm not, I will tell you all how wonderful it is!\nMy aunt took my self, my boyfriend and other family members here. We were a little skeptical, I admit; but it truly was amazing. \n\nAuthentic and wonderful tapas, healthy food, as well as other types.  I could sit there for hours just eating, absorbing the wonderful Spanish/Basque style cuisine and atmosphere.\n\nI would recommend this place as the best Sunday brunch!", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "it's between 3 and 4, decided to round up. the food was good (tapas, and wine) BUT it was very salty. setting was beautiful but it was a little awkward because at 9pm we were the only party left. they didn't kick us out, it was just a little strange. overall the restaurant was really empty in the middle of the week. I do want to come back and try the buffet.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-06-15", "description": "way out in the deep excelsior lies this giant industrial looking restaurant. I had passed it several times in the past month and on one occasion stopped and looked in grabbed a menu and vowed to return.\r\n\r\nit was like the idea of Spanish food in the 1960's era and not in a good way. there is nothing to recommend this place and yet what an appealing idea this place is.  \r\nfounded by the union espanol there should be more love in the kitchen and more pride in the presentation...\r\n\r\n\r\nWell, what a disappointment! just simply awful! over priced tapas and entrees, let them know! it would be great to see a place like this turn itself around from the shadow of blue haired Spanish cuisine to the rightful place Spain is enjoying in the rest of the world in celebration of its fabulous cuisine.", "author": "Ricote F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-15", "description": "A absolutely fantastic find - definitely a place I would recommend to anyone that wants a different take on a Sunday brunch.\n\nWent there with my family this morning and the food was exceptionally good...incredible tasting, and had plenty of options to choose from.  I myself had a bit of everything...seviche, mahi mahi, clams, basil pasta...grant it, I'm totally blanking out on everything that was there.  I think it was all the mimosas.  All in all, great place to eat and highly recommended!", "author": "Brandon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "What can I say?  I just love Spanish food.  I have had it done incorrectly before but Patio Espanol did not disappoint.\n\nEach dish was excellently made.  The sauces were rich and flavorful and contained good portions for tapas-style dishes.  Thankfully, we went as a small group and were able to try most of the tapas dishes.  I loved the spicy chorizo dish and the crab cakes the best.  \n\nThe only drawback is the occasional rumble of the Bart train that occasionally flies behind the restaurant.", "author": "Jimmie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "We've passed by here many times and finally thought about it while deciding where to eat last night, and were glad we did!  Very tasty food, good service and nice atmosphere made for a very nice dinner.  The medallions of lamb and the garlic soup were the standouts, but everything was somewhere between pretty good and delicious.  There were only 2 of us so we decided to skip on the paella so we could try a variety of other dishes; but it looked delicious...next time!", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "Pretty dang good Sunday brunch.  Many items offered, paella of course and lots of yummy desserts.  The service is hit or miss and they can sometimes be a wait.  My family really enjoys it and it makes a great outing to enjoy good Spanish food.  They have plenty of parking and its easy to find right off the freeway.\nOh and if you're looking for an event venue this is an option, I've seen their setup for weddings, pretty nice but I've heard its on the pricey side.", "author": "La C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-10", "description": "I was unaware that El Patio Espanol is in fact a restaurant. In all outward appearances it cam across as a slightly less depressing cultural center of sorts and I was gladly feel the conquistador roots in me.\nI came for my grandfathers induction into the Balboa High School athletics hall of fame ceremony. It seemed appropriate.\nI dunno if the restaurant prepared the meal but it wasn't that great and not vegan. Everything was very ordinary.\nThe ceremony and the people attending was by far the best part of the evening.", "author": "JAYCE B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "Its got Fantastic Food! lots of space! Fits lots of people inside and has great service!", "author": "amy b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-22", "description": "I couldn't wait to get to a computer to write this review.  While everything is super fresh in my mind from last night's dinner.\nSO, yesterday was my birthday & my boss from work had recommended the great sangria & paella at this particular restaurant.\nI was really wanting this cuisine since it's one of my favorites when I go back home to NJ. \nBesides one other table seated at around 8:30pm & my party of 14, the restaurant was empty. 1 waiter and some other workers floating around the area. My waiter, gathering from what I read on the receipt, I could call his name out, but I won't do it here. But what horrible service man!\nIt was my birthday and he was rushing us to order, pretty rude about many things, and basically lied about the portions of paella to make upsells on the check. HIs attitude was not very friendly, customer service lacked in all areas, though the food did come out in a timely manner.\nPaella & Sangria were still very tasty. Fish in the paella was SUPER dry.\nNot sure if I will return.", "author": "DayDay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-12", "description": "We came here for the Sunday brunch-- party of 16. The paella wasn't that great. It was a bit on the salty side and it wasn't very flavorful. The artichoke salad was nice.. all the vegetables were drenched in olive oil. The olives were so salty. Salmon was nice and tender. Cheesecake and the flan had some weird smell to it. The octopus salad was a bit on the rotten side.. I liked the smoked salmon on the bread and the garbanzo bean soup. Everybody had to go 'number 2' when we came home...except for me that is. Great service but a bit overpriced at $25pp.", "author": "Colleen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-08", "description": "If you are a person that look for a place to go with your partner to have a good diner forget this place. Number one you have to wait a hr to order food, then another to get the food, after one more hr to get the bill. I really dislike it.  I dont recommend this place to anybody.!!!", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-17", "description": "AVOID!  The food was good but the service was TERRIBLE. The waiter with a bald head and strong European accent was extremely rude to us. I was a returning customer with a party of 16 people and the waiter was totally unready, inexperienced and unwilling to serve a larger group. The attitude was totally unfriendly, kind of similar to the unfriendly attitude you sometimes encounter in Europe.  I was there to spend money and I didn't need that kind of attitude.  The time we spent waiting for our food was extremely long too.  We as a group managed to have a good time despite the bad service.  Frankly, they just lost another customer...actually 16 customers!", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-11", "description": "Best tapas I've had outside Catalunya! The crab cakes and shrimp were magnificent. Definitely worth a trip out to the outer rim (beyond Castro)! Portion sizes are generous, as tapas are meant to be appetizers and not full meals.", "author": "Hasan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "We just had our wedding here and had a great experience. Sherri is an awesome coordinator and makes sure everything goes smoothly. The food was delicious and Sangria was my favorite. They were very accommodating to any needs we had. We had a problem with our flowers that decided to show up at 1:30am the night before and they came and opened the place for us in the middle of the night. Highly recommended.", "author": "antonio o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "This restaurant is within walking distance from my house so I thought I should give it a try after reading several favorable reviews.  The first two tapas we ordered - Setas Silvestres (Wild mushrooms) and the Almejas y Mejillones (Clams and Mussels) were superb - plenty of sumptuous, garlicky, sauce to dip your delightful warm and crusty bread into.   Then the patatas alioli and garlic soup arrived causing the meal to plummet into utter doldrums.  The alioli didn't even have a whisper of garlic and the soup had more oil than piquant flavor.  If we had stuck with the first two dishes it would have been a 4.5 star experience.  Alas, the 1 star dishes that followed brought the whole experience down.", "author": "L B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-01", "description": "best brunch ever.  a mere 20 bucks delivers all you can drink wine, mimosas, coffee, oj, soda and a fantastic buffet including paella, lamb, salmon, pasta, fruits, cheeses, mussels, lox, shrimp, salad, garbanzo soup, flan, cheesecake, chocolate mousse cake and still more stuff i can't even remember. 5 of us ate here today until we were blinded by the numbness in our bloated bellies. ewwww/awwww.\n\nand we didn't have to circle the block 2700 times for a parking spot.", "author": "Joanna R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-12", "description": "Odd.  That's the word I'll use to sum up my experience for service, dining and location.  We stopped by impromptu,  because we were cold and hungry and in the neighborhood.\n\nThe restaurant is located on Alemany Boulevard, next to an Asian supermarket, which is where we came from when we decided to take a chance and have a bite.  After reading a few Yelp! reviews, I felt it was worth the effort.\n\nThe price point is high for the quality of food, but I suppose they make up for lack of quality in quantity.  \n\nWe ordered the following items:\n\nSpanish Soup- The soup tasted diluted and the flavors weren't integrated.  I could taste two things-- water and probably paprika, because it was a little spicy.\n\nFried Calamari - The calamari was fresh, but it needed a little salt.  Your standard fried calamari. \n\nSauteed Murcilla - The sausage was sliced and served with vegetables and potatoes.  I don't eat blood sausage, so I can't comment.\n\nPan Tomate with Jamon - This bread dish is typically served with fresh tomato and garlic.  Often times, if not always, the bread is toasted.  The bread came fresh with some sort of tomato paste. \n\nThe service was slow and our server was a little cheesy.  He referred to water as H2O and checked in on us at odd moments, then completely disappeared when we really wanted to get the bill paid and just get the hell out of there.  He also couldn't recommend a wine to the table next to us, because he told them he \"didn't drink wine.\"  \n\nIf you're going to work a dinner service (when wine is usually involved) at least learn enough about wine to know what to recommend to pair with paella.  It's not like the restaurant has a large list...\n\nDespite the food and the service, people seemed to be coming in.  From where, I have no idea, and I couldn't tell you why either.  I suppose it's convenient for anyone that lives in the neighborhood and decent enough to eat.  \n\nI just won't be back myself.", "author": "Anna V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-24", "description": "Great paella, I have had it on a couple of occasions, it reminds me of actually being on the beaches of valencia and torrevieja and having a fresh seafood platter. The brunches are typical spanish tapas, but the selection is overall good. The service is good and you can typically get a good seat if you go there as not too many people know about it. Overall a great place to bring someone who wants to taste a good paella!...and some jamon serrano!", "author": "Sebastian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-19", "description": "Wow, Patio Espanol, is one of the best restaurant I've ate in. We had our Daughters 15th b-day their. and her Graduation party. It was the Bomb. Ms. Sherri Nash, The Events Manager is the best I've seen, every detail was taken care of. Thats why we keep coming back to have our familys party !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The Food is always Very good, along with the service !!!!!!!!!!!!!!!!!!!!!!!!! Very Happy place to be with Family and Friends !!!!!!!!!!!!!!!!!. Looking foward to have our next event their. Can't wait.\n\nGary P.", "author": "Gary P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-12", "description": "We came here with another couple who recommends this place based on their experience.  The restaurant looks nice enough from the outside.  Although, we didn't have reservations, we were seated right away.  As you enter, there is a bar area to the right.  Once inside in hall, you'll notice how airy and spacious this place is.  With the faux terra cotta tile roof and white walls, you'll feel as if you've been transported to another place.  This establishment serves dinners, buffets, and banquets have a separate room for hosting special events.\n\nWe hankered down with a bottle of red wine and starters; balsamic sauted portabellas and fried calamari with lemon and alioli.  The portabellas were absolutely flavorsome.  Given our two orders of paella were going to take 25 minutes to cook, we waited 15 minutes after our starters were finished and have not gotten our orders of soup and salads.  We inquired our waitress about it where she admits the items were forgotten.  Instead, she said our dinner was almost ready thus she'll comp. our desserts.  Since, one of the orders is for rare prime rib, she couldn't hold up the orders to bring us the soup and salads.  Well, we could have eaten the items on the side with dinner.  While we were chatting away and waiting for our dinner, I noticed the waiter at the next table being very attentive to a large party all the while wondering what happened to our waitress.  When the prime rib arrived, the meat recipient inquired where the bone was as he wanted it for his dog.  The waitress said she'll give it to us before we leave.  My paella was okay; a bit wet and mushy for me.  It was laden with shrimp, mussels, clams, chicken, and chorizo.  We were given a choice of desserts for which we chose flan, cheese cake, and chocolate cake.  Our leftover orders were wrapped to go and packed in one bag by the waitress.  We inquired for another bag since the leftovers were for two different households.  The waitress told us whose item was on top in the bag.  Well, she got that wrong after we took a peek at the boxes in the bag.  When we got home we realized that the waitress has forgotten to give us our prime rib bone.  I think we just got a bad waitress that evening.\n\nThere is plenty of enclosed parking at this restaurant's lot.", "author": "Nanette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "i have been coming here since i was a kid for special occasion such as weddings receptions to regular dinners. This is hands down the best paella in the bay area IMHO. This is not just my saying but you will see the awards that state this. The decor makes you feel like you are dinning in a Spanish villa back in the home country. The bar is great and i love the old school way of service. Their presentation is always on point. I have never had a bad experience in the many years that i have been dinning here.", "author": "Alfredo N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-01", "description": "I loved the food.  The atmosphere is very romantic and our server was great!  I had the lamb which just melted in my mouth...oh so good!  The garbanzo soup was also very delicious.  It is a bit over priced but it is great for a special occasion!", "author": "Erica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "The food here Is delicious, especially the paella! The building itself and the atmosphere is calming relaxing and unique. The wait staff have always been wonderful and fun. I think of coming back here each time I am back in SF", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-15", "description": "Really excellent experience. An elegant, spacious interior completely at odds with the seediness of the neighborhood, with formally-dressed waiters - although it's casual dress for patrons. Although it's open to the public, it appears to function as sort of club for the City's Spanish community. We started  with a wonderful Spanish garlic soup seasoned with paprika and swimming with hunks of melting pork fat - heavenly. Then a selection of tapas including croquettes de bacalao and a fluffy tortilla, then paella valenciana with fresh shellfish and chorizo, finishing with beautifully-made and presented desserts incluing an excellent tiramisu - all washed down with fine Spanish wine. HIGHLY recommended - I'll be going back next time I'm in San Francisco.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "Sangria red and white both good but in this case red is the way to go and quite refreshing and only $5. Calamari appetizer was quite good and a healthy portion and served with aioli and lemon. Cold potato appetizer was nothing special and would pass. Gambas al Ajillo (Garlic shrimp) plate was good and included nice saffron rice. Now the main \"objective\" of course  was the Paella Valencia. It was loaded with tender chunks of chicken and seafood along with chorisso. Most definitely tasty although not the best paella I have had, but great for USA standards!!!. The restaurant interior is almost like a Spanish courtyard and has a nice feel and experience. The restaurant customer service was excellent although we did have to ask for our water to be \"topped off\" and for the check at the end (both minor details.) Restaurant staff were very pleasant, attentive and friendly. Overall a fun and delish experience!!! Only negative factor is the Bart train that runs by shaking the building about every 20 minutes.", "author": "Trev D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "Excellent Sunday brunches in pleasant surroundings. Lavish buffet with a wide variety of Spanish foods. Champagne and wine are included in the tab which is very reasonable. I always feel so Spanish when I'm there!", "author": "MARGARITA V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-25", "description": "Just ordered take-out tonight for a birthday celebration. We've never ordered take out from here but dining in sometimes isn't an option with a toddler to attend to.  Since we live only about 15 minutes away, the meal was just as good as if we had dined-in (saving us on tip). \n\nI haven't been here for a few years but  had a craving for their meatballs and paella.  I thought we'd also try something new and ordered the monkfish tapas as well.  Unfortunately, they forgot to include the order in my take out box and I didn't realize it until I got home.  I counted the number of boxes before I left the restaurant only to discover one of the boxes contained a bunch of individual servings of butter for the bread!  I called them and informed them.  The worker told me they still had my order there and tried to find me after I left.  They didn't offer to refund me but did say they would credit me the next time.  Since I wanted an excuse to go back, I agreed on it.\n\nThe paella was wonderful as expected (comes with soup or salad).  They usually require a minimum of 2 orders of paella but the lady who took my order today let me order just 1 order (approx $22 per order but can easily feed 2 people).  The meatballs appetizer was to die for!  They gave us a about a loaf and a half of sourdough bread with our order which was perfect for sopping up the meatball sauce.  We also ordered crabcakes which were good but definitely not the best I've had.\n\nI took off a star for the missing fish and for the slow service  (may have been due to the large event in their \"ballroom\" ).  Even though I called my order in advance, I still had to wait 30 minutes for my order.  \n\nPrices aren't cheap but not too bad for a special occasion.  Our bill came to $54 after tax (includes the charge for the missing fish).", "author": "Mary T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-26", "description": "I totally concur about the overpriced dishes. I only ate here once. BUT... here's what I like about El Patio Espanol, it is a great place to rent for large parties. I will warn that it can be very costly depending on the rooms you want. From wedding receptions to debuts and Christenings- I've been to many parties here for so many years. Plus parking is convenient.", "author": "Leroid D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "I like go there for sunday's brunch however its not the typical one because it is more like a fulfilling lunch type, unlimited great mimosas, paella, deserts, and other spanish food", "author": "Karina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "I've written about eight reviews for this site....and this is the first five star rating I've given.  \n\nThe five stars are not based on ambiance (it was cool but not transformative), service (competent but not exceptional), or cleanliness (clean but not sparkling).\n\nThe great rating is based entirely on the paella.  We had the Marinera and could eat it everyday....breakfast (put some huevos in there!), lunch, and dinner.  The seafood was ample and ocean fresh.  The portion was massive and cheap.  The seasoning was expert.\n\nI'll be going back to this place for life.", "author": "MIchael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "My roommates and I had dinner here last night. They had both eaten here before and had raved about the paella. We ordered the paella marinera for two and it was plenty for all three of us. The salad that comes with it (or soup) was very fresh and had a tasty dressing.  Our waiter brought us some warm crusty bread which we dipped into the delicious garlic-infused olive oil which is on all the tables. We had a bottle of  Salmon Creek Chardonnay and, for $18, it was well worth it. When the waiter brought our paella to the table he professionally served it up onto three large plates. It was full of shrimp, clams, mussels, calamari, white fish, and scallops served on a bed of beautiful saffon rice. This was the best paella I have had in SF since La Roca closed. We each ordered a different dessert and each was very good. My choice was a white chocolate pyramid with cheesecake and fresh blackberry inside. The plate and presentation of all the desserts was beautiful. Each of our desserts had a large strawberry on the side that had been cut to look like a flower. The service was as good as it gets and our waiter couldn't have been more professional and efficient. He shook each of our hands before we left and extended his hope that we would come again. Great food and not a big price!", "author": "Charles A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-10", "description": "I've never ordered anything here except for the Seafood Paella which I think is the best I've ever had.", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-07", "description": "Had the paella which was nice and large. My mom and I couldn't finish it.\nMy daughters had steak which was suprisingly exelllent. Next  time I am coming with my husband for the chops and cocktails. \nThey have one item on the kids menu, but will split certain main entrees to accomodate. \nNice large parking lot,  don't have to sit close to other customers, great for large groups,  and water glass was always filled.", "author": "Sharon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "Our friends were here in San Francisco and suggested that we dine at El Patio Espanol.  We were somewhat concerned that it was located \"on Alemany, under the BART tracks, in the Excelsior.\"  No need WHATSOEVER to be concerned - the restaurant was marvelous, the service was exceptional and the food could not have been better.  We ordered their Garlic Soup, the recommended Spanish wine and tapas all around.  Everything was exceptional - the soup was first rate, the wine pleasant and interesting and the various tapas were each a masterpiece.  We couldn't resist dessert, which lived up to expectations.  Altogether a wonderful experience; it will be a new regular restaurant!  Can't believe we've lived here, what 40 years, and never knew about this place!  Five stars, highly recommended.", "author": "Charlene R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-29", "description": "It was OK, but not great. The food was too salty and the veggies were overcooked. The atmosphere was lacking, it was very loud and echo-y and too brightly lit. Overall, it was mediocre quality that was overpriced. But on a positive note, the sangria was yummy.", "author": "K M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-26", "description": "I go to this place primarily for the Paella.  It's done really well and  in the authentic spanish style.   They also have a delicious Garbanzo bean soup, Gambas al Ajillo and Creme Brulee.  On Sunday they have a brunch which is very yummy -- although I find that the Paella dries up after staying on the Chaffing dish a long time.  It is best when it its prepared and eaten right away.  The decor and ambiance of the place is okay and they have lots of room for bigger celebrations. There is lots of parking for everyone.", "author": "Regina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-21", "description": "not bad, not bad at all. cool bar and nice decor. the food is ok (yummy paella) but some wait staff are utterly Philistine. this is a good place for wedding receptions and banquets and funeral lunches. warning: do not venture across Alemany, you may never be seen again !!!!!!", "author": "Prima D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "We come here when we miss Madrid or Barcelona. Minus the overpowering taste and smell of Jamon Iberico,  this place comes close. The food's always good but service can be iffy at times.", "author": "AndyBoy V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-24", "description": "I recently went to Patio Espanol for an event in the main banquet room,  My three experiences at El Patio Espanol were great, this time however it wasn't the case.     The saying, you get what you paid for truely is experienced here, when you go cheap with your food.   The meat item served to me and my family was complete fatty, flavorous meat.  The salmon portion was have been off the kids menu becuause it was so small.  Lastly, theres no service there.   No dispresct but, many of the banquet servers lack basic english skills.  You have to be belingual, to get some service.", "author": "JERRY B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "sometimes you can't find a bartender.i have been going to the patio for years and years. i remember my first time there but thats another story. my freinds belong to the club,my other freind wanted to buy it. i have known the ins and outs of the place,the lives and secrets of the workers and members and custemers.i don't have time to write a book. the patio as i know it now...very good menu,not bad sunday brunch,bar,ok.facilities good. service personell and loving.many events available to the public.we where never throwen out of there yet and believe me when i say that most of our group should have been thrown out and not only where not thrown out but allowed back in with open arms.", "author": "OSEPH E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "One of the best places in the Bay area to go for Spanish food.  Love the food!  From appetizers to tapas to main course meals to dessert.  I love them all.  The sangria is really good as well.  Prices are very reasonable.  I usually go for dinner but I wish they were open for lunch as well.   It is not in the best area of town but parking has never been a problem.", "author": "Anna S."}
