{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "It's a bit tucked away, but once you find it, it's a great time. I love bars in SF that are a bit larger that aren't too crowded. Sometimes bars can be great, but if they're too crowded, it can just be uncomfortable to move about or even to just find a table. This place has a nice big menu with a large selection of beer and cocktails as well. The wine is probably also nice, but I haven't ordered that here. The inside is pretty large (second floor advantage probably), with a cool pub-y feel. \n\n(I don't know if this happens every Tuesday, but there was a 30-45 min long fire alarm drill/check that continued to interrupt our evening in intervals. It was not ideal, but we tried to ignore it best we could)\n\nAmbiance: 5/5\nFood and beer: 4/5\nService: 4/5\nOverall Experience: 5/5", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-14", "description": "If you work in one of the embarcaderos this place would be really convenient for a quick bite ( they actually had a lot of to go orders).\n\nPersonally I thought the atmosphere was depressing and the food pretty mediocre.\n\nThe best part was the wonderful hostess at the front....she just had this shining star quality that made you happy. Our waitress was cool too.", "author": "David G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "Ahhhh, where to begin.\n\nFirst off, the waitress only brought water for half the table. After getting all orders, the burgers were brought out first. No condiments and the fries were cold. We ended up waiting until she brought out the rest of the food to wave her down so we could get ketchup and mustard. By this time the food was palatable.\n\nThe group had 2 people that needed to leave early so they requested those to get boxes up. Both orders were forgotten and then brought 10 minutes later not in to go boxes. And one was missing French fries. \n\nMost likely won't be returning. Horrible service. Nothing special for food. I guess the location is good?", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "After freezing our butts off nearby at a St Patrick's Day block party, my girlfriends and I needed food. I yelped spots within two blocks and found Patriot House. My group of three arrived on Friday, March 16th around 6:30pm. Since it was St Patty's Day (well, for at least for me anyways since that was the day I was celebrating), the place was packed. Thankfully, the nice hostess managed to find three seats on the left side of the bar as we were about to try and squish into a tiny table for two.\n\n*Totchos: Tator tots, melted jack and cheddar, tomato salsa, guacamole, habanero ranch, green onions ($10)\n*Potato Skins: Cheddar, green onions, sour cream, no bacon ($10)\n*Beer Battered Onion Rings: served with spicy ketchup ($7)\n*Deviled Eggs: Pickles and chives ($7)\n*Corned Beef Quesadilla: jack & cheddar, habanero ranch, no corned beef ($15)\n*Fries\n*Stella Artois ($8) x3\n*Irish Coffee: Tullamore Dew, Coffee, no Cream ($12)\n*Jameson Irish Whiskey Shot ($10) x2\n*Bonterra Cabernet Sauvignon ($9 glass) x2\n\nWe were here for a good three plus hours, so I know we had way more drinks than what is listed above. (This was what was on our receipt.) A couple nice gentleman ended up getting us rounds, so I don't know how many we ended up having. I just know I was the jameson girl, so I sipped on a irish coffee and shots all night long. The food itself was really nothing to write home about. Just your average bar food. But I could only try the deviled eggs and potato skins as I'm not eating deep fried foods at the moment. Later on, I was still hungry, so we got the quesadilla. My gfs weren't eating meat, so we got it without the beef. Not sure if they put extra cheese in it because of that, but I quesadilla was tasty. Ooey, gooey, and comforting. They have a special patriot house hot sauce, so make sure to ask for that if you want your food with some kick.\n\nNot sure if it was because of St Patty's Day, but the atmosphere here was so much fun! From the bartenders to the other patrons there, we had a great time talking to everyone. I think all of the bartenders that night were Irish, so I got to enjoy their accents. There's something cute and sexy about an Irish accent.\n\nGreat spot to celebrate a St Patrick's Day! I'm glad my handy yelp app suggested it!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Not sure about all the haters who write those 1 and 2 star reviews - this place had one GREAT Fried chicken sandwich on a brioche roll. Better than The Bird or The organic Coup. Not on the Bakesale Betty par - but as good as I have had in a long while.\n\nUnfortunately I split the sammy with another gal - I won't make that mistake next time.\n\nLooks like they have a decent happy hour too - so will look forward to trying that.  I would LOVE to try the short rib quesadilla - WHY IS THAT NOT ON THE LUNCH MENU?????\n\nLoved our little Irish waitress (maybe an owner, it says that 3 Irish gals own the place)", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Patriot House in SF was amazing! Highly recommend it! This is one of the many bars that the one and only Jon Taffer from Bar Rescue rescued back in 2015. One of the best drinks and burgers I've ever had. Taffer, you did an amazing job at helping the managers save this bar and bringing out the best in them! Their bar is still amazing & going strong! I had the honor of meeting the niece of one of the managers and gave positive feedback (she made our drinks!) if you're ever in SF, give this bar a try! You won't regret it  The staff is very polite, friendly, & amazing at making anyone feel welcome!", "author": "Erika A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "** i like the owner**\n\nThe drinks are kind of ok, happy hour (ends 6pm) may be around $8ish and other speciality cocktails $10. \nI recommend the beer :-) \n\nfor eats I recommend\n- deviled eggs (cones with 3 for happy hour and 4 for s regular order)\n- buffalo wings\n- fries and mashers \n- Sliders \n\nThe meh:\n\nThe server (the owners niece) said they were out of deviled eggs. When our group expanded an hour later, the newcomers ordered deviled eggs and voilá... now they had them smh \n\nAlso my cocktails were kind of watered down and the Boston tea party drink was basically a lemon drop", "author": "Mariana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "Was dead when I was there and got a surly waitress which sucks. Food was decent, the fish tacos were all right. The sliders were juicy, squirted out when I bit into it which is the way it should be.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "Great service!  I had the Ruben and my Boyfriend had the Pot Roast. Both were very good.  I had their onion rings instead of fry's and they were great!", "author": "Holly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "I had the california sandwich, it was pretty good. Was not a big fan of the potato chips, they were too oily. The restaurant is hard to find, make sure to take the escalators up to the third floor of plaza. The restaurant is dimly lit, could use more natural sunlight. The staff was super friendly and they have plenty of seating. I like the location of the restaurant, the view outside is pretty awesome.", "author": "Maria N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "Tasty pot roast sandwich but sometimes it's sloppy.\n\nPleasant staff.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "We had fish tacos, tot - chos, chicken wings during happy hour. \nAll the bar bites are $5.95. \nWe asked the tot extra well done, it was very good. \nThe fish tacos was okay good. \nChicken wings is pretty good. \nThe cocktail- well gin ($8)was very good.", "author": "Meichelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Never have to wait! I get their MealPal specials and it's always ready when I arrive.", "author": "Dan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Tucked away little gem. I stumbled upon this spot when EVERY other happy hour spot on Market street was packed. Patriot House still has a crowd, but at least you can get a seat and have some breathing room. My friend and I got seated immediately and we ordered our drinks and tater tots soon after. \n\nI got the Moscow Mule (cuz your girl likes them mules) and it came in the cutest lil mule cup ever (great for me cuz I'm a light drinker, but if you're a heavy weight, you might need more ammo...). My drink was great, it packed a punch and I love how strong the ginger taste was. And don't even get me started on their tater tots. Sooo guuud. It was crispy and smothered with toppings (extra cheese please). The portion was pretty large too; my friend and I ate a little more than half before calling it a night.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "I am updating my initial review from 7 months ago. Since December I've visited this restaurant a handful of times and the service has greatly improved. I frequent this place weekly and I have to admit, they have the most delicious buffalo wings and deviled eggs in town!", "author": "Lexy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Good spot for happy hour, the wings was good. We loved it, so the drinks. My gf love their cocktails. \nThe space actually pretty big, there are a few groups of people were playing majiang at the other side of the room which was very interested.", "author": "Kent Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Awesome bar hidden in the middle of the Embarcadero plazas. I've been working in FiDi for almost 2 years and I can't believe I never stumbled upon this place. \n\nThe place is cool since it's the top floor of a plaza so you get a great view of the city/sun if you opt to sit outside. I came here with a group of coworkers after work and we made it just in time for happy hour which is until 6. During HH we got appetizers (smashed potatoes, tots, and buffalo wings) at $6 a plate which fed our table of 6. All were tasty and paired well with the pitchers we got! \n\nOur waitress was also super friendly and always made sure that we had everything we wanted/cleaned the table frequently. Will definitely be coming here again because they have a ton of TVs to watch games as well/Trivia night!", "author": "Keizzel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "This is one of the only non pretentious places to drink in the area.  The best part of this place is that it doesn't feel like it's in San Francisco.  It feels like a suburban bar from any city in America.  If you're visiting San Francisco from somewhere else and looking for a place that feels like home this might be the closest you'll find in the FiDi area.", "author": "Kenneth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Food was good, service was excellent! Michael, worked both the bar and tables, and was very entertaining... was super funny and had our group cracking up. \n\nThe kitchen closes early, so keep that in mind. Otherwise, everyone enjoyed their order. We had a group of 8... ordering burgers, salads, sandwiches, quesadillas, and their seafood stew. \n\nWe'd recommend it!", "author": "Gavin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "A wonderful bar and restaurant in the Embarcadero run by four sisters. I am in every other Monday for a business lunch. Try the hamburger. It's a killer. The chicken Caesar is also excellent. \n\nThe only thing stopping  patriot house from getting five stars is the price. It's a little high, but I would assume Embarcadero rent is also pretty high.", "author": "Danny S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-21", "description": "We stopped here for our monthly group happy hour. The joke was on me, though, for showing up at 6 - which is exactly when Happy Hour ends. Remember the good ol' days, when the purpose of Happy Hour was to lure working folks in to throw back a couple of beers on a regular basis? How am I going to merrily skip down the road to alcoholism if I don't get out of work early enough for discounted yet still overpriced draft beers? Guess I have to quit my job. \n\nRegular-price draft beers are $6.50 a pint - that said, the Drake's Hef was really, really good. The purportedly \"hand-cut fries\" ($5) more closely resemble Mc-D's, and probably came out of a similar bag. They come with a side of ranch and ketchup, and generally made me kind of hate myself. I'd pass on these in the future. \n\nThe redeemer of the evening were the Nachos ($8, no meat) - the cheese sauce was strange, but the house-made hot sauce was a great add. The size was big enough to share reasonably between two people. If I ever find myself here again, I'll definitely stick to those. \n\nOur server was incredibly harried - she seemed to be the only person serving and bussing the entire restaurant, and I have no idea why. We had to flag her down for pretty much everything - beers, food, the other person's food, the check - because she kept dashing off after we'd only gotten two words out of our mouths. The last straw was our asking her to take a quick picture of the group - I've met people who clean up roadkill who seem to enjoy their work more. \n\nThe decor was pretty dingy, and there was what appeared to be orphaned toddler who kept running up to our table. She was barefoot and rolling around on the carpet underneath the bar. It was all very bizarre. I've heard this place was on Bar Rescue - I don't know what that is, but someone really needs to bust out the defibrillator on this place. \n\nOn to the next!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "i come here once in a while with coworkers after a long week..fun vibe and laid back\n\nyesterday i came in 45 minutes to pick up my meal pal...i was very late so i was half expecting them to turn me away (meal pal states that if you are late picking up your food they might toss it)\n\ninstead of giving me my cold sandwich they made a new one for me, i thought that was super nice!  I felt bad because THEY kept apologizing but it was my fault i was so late picking it up.\n\nanyway...thanks ladies!  much appreciated!", "author": "Ripley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "I am absolutely in love with this Restaurant the staff are amazing and super friendly! My two waitresses Lauren and Jan were absolutely stars and so accommodating! The food is so delicious and it is situated in a lovely location in Embarcadero!", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-17", "description": "Back in the day, I was a regular at the Holding Company. Two years later, I stopped in to what is now called, Patriot House. The store looks the same, with changes to art work on the wall. I had heard the show, \"Bar Rescue,\" came to redo the place. Patriot House need to ask for a refund. In essence the same bar since 1974.\n\nThe bartender was very nice and helpful. The shots are fare, not a long pour, not a short pour. I had the Fish Tacos, which smelled fishy, but were OK. The store was kinda empty, odd for 6:00PM. Hipsters on mobile phones replaced the old \"Cheers\" crowd.\n\nMaybe I'm just mistful of the bye gone days of the Holding Company, but if in the neighborhood, I might not stop in again.", "author": "David N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-13", "description": "I stopped here for lunch on a Thursday a little after noon. We were seated promptly. The restaurant seating was fairly full. I liked the look of the place as well as the atmosphere, but our dining experience left a lot to be desired.\n\nI ordered the Louisiana Purchase entree, my friend the Crispy Chicken sandwich. When our plates were brought out, the chicken sandwich was very under cooked. And this was after quite a long wait from ordering to presentation. We alerted our waitress and she said she would have another one prepared ASAP. The next sandwich brought out, we figured would be well done, cooked extra long to ensure the same didn't happen. Guess what? Under cooked again.\n\nThe waitress was very apologetic and couldn't have been nicer. My friend eventually ordered something else to go, seeing as how I had already finished my meal and it was time to head back to work.\n\nI want to like this place, but it was not a very good first experience. However, everyone has a bad day from time to time, so I'm sure I'll give it another try in the future.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "sole complaint? terrible service even when they're slow and quiet. was also told we could pay as we go with a group of 18 and was told we couldn't. as a result, i had to make up $84 because my so-called friends are cheap bitches", "author": "Torrpedo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "I had lunch here yesterday. The interior is a nice sports bar/pub feel. Many tv's with sports but it was not noisy, so easy to hold conversations.\nI ordered the fish and chips and they were sufficient, nothing special. The best part was the coleslaw which was exceptional.\nAll in all a decent lunch with good service.", "author": "Micheal M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Amazing food. Try the cheeseburger! VERY BEST salt and vinegar chips ever!\n\nMarissa and Danielle were superb bartenders! Give them promotions!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "came here for lunch with my team on a thursday afternnoon.  Got in before 12 noon and it was pretty empty, but as we left at about 1pm, it was pretty crowded.\n\nCalled ahead for reservation of 11 people and was seated right away.   the place is kind of run down, looks like they havent updated anything in awhile.  Food for 11 people kind of took awhile and my fries came out cold, but burger was really good.  \n\nFood: salmon on salmon cesar salad came out a little raw, they gladly took it back and redid it.  One of the fish and chips had a chicken nugget piece in it - found at end of meal - they redid the whole meal\n\nGreat service hospitality and they have trivia night on wednesdays at 6(?).  I would definitely come back", "author": "Acilegna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "We had a very good late lunch here at 3:00. Place was pretty empty except for a couple of guys watching soccer. Food and service were both good. Atmosphere good too. Dark and woody with lots of tvs. \n\nI had the pot roast. It was tender and delicious. Served over mashed potatoes and spinach. \n\nMy 20 year old son had a burger and fries and enjoyed them both. My brother had the deviled eggs and fish tacos. For dessert we shared a piece of carrot cake with a scoop of vanilla ice cream. It was $60 for all three of us with one beer. I will eat here again.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Went here a few days ago for drinks and lunch with the girls, have to say excellent service and wonderful food--was greated straight away by the host, and shown to our table-- she was great! Ordered the crispy chicken sandwich, it was super tasty!! Me and my friends had a fantastic time must say best place to go in the financial district --really good vibes ! Also our server was Lauren i think? She was really funny and helpful!! Pretty too !!", "author": "Linda M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-02", "description": "I ordered a burger with fries. The burger was well seasoned and cooked just right. However, the fries were extremely soggy and quite a few pieces were just raw potato. When I reached the bottom of the metal cup holding the fries, I found that they did not drain the fries of oil and the entire bottom centimeter of the cup had floating golden oil. \n\nThis restaurant not only has a lack of attention in the kitchen, but also toward their customers. The service is the worst! The restaurant was not very busy on this Friday just after 7pm. We stood at the front for a while before anyone even noticed and finally seated us. After we sat we were still 5 minutes within happy hour, but because our server did not come to our table until after 7, he would not honor the specials. Aside from that, it took over 30 minutes for our food to be prepared. Our server did not come to our table once during our meal to ask if we needed anything or if we were enjoying our meal. \n\nThis is my second time visiting this restaurant. The first was during lunch on a weekday. At that time they also took forever to prepare the food and had the same situation with a different waiter. If I had a meeting after lunch I definitely would have been late.\n\nMy overall impression of this place is pretty lousy. Although the burger tasted good, everything else was bad. Maybe only go here if you're taking something to go? It's just not worth the wait, and I won't be back.", "author": "Zahra H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "my rating is about the service.  since i was never served to try the bar or food.  walked in and sat myself (per the sign) in front of the bar, but not at the bar.  waited about 8 minutes and watched 3 waitresses/bartenders never make eye contact or come near me.  maybe i had to sit at the bar??  so i walked out.  and won't be coming back.", "author": "Karen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Just happened by this place, I was in SF for my wife's seminar, so I had the day to myself and went for a walk, got thirsty found the patriot house. Checked reviews good and bad, I need to judge for myself, so I went in, best chance I took in a while. Great service and cold beer, I had the patriot cheeseburger for lunch, was fantastic. Thanks for a great time girls", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Firstly, some of the food specific reviews here seem overly critical. Just saying...\n\nSecondly, I've been eating here since the bar/restaurant makeover and I've never had a bad meal. All of their staples have been spot on, and their specials are always changing - never bad, always good. Their house made hot sauce in AMAZING!!!\n\nThirdly, their service is always top notch. I find all of the bartenders, waitresses, and hostesses to be friendly and fast. If anything, the bartenders will be a touch sarcastic and poke a bit of fun at you, which is exactly what you want out of a bartender. Have some fun with it people!!!\n\nIf I was going to offer one piece of criticism, it is simply this: You can't purchase their house made hot sauce to go. Hopefully one day they are licensed to sell this stuff. It's fantastic!", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-09", "description": "3 1/2* Patriot House\nIrish gastropub\nPavilion level of Embarcadero 2\nNote: Friday is Mexican night (in remembrance of the San Patricio Brigade)\nLots of good beers on tap\nThe tater tot nachos were killers; couldn't stop inhaling them\nThe fish tacos were small, but delish\nNice cobb salad\nYummy desserts e.g., apple pie a la mode\nFriendly service by Jan\nReasonable prices", "author": "Rosquete B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "After seeing this episode on Bar Rescue had to make my way into San Francisco today to try a Taft Crowd Pleaser and a Corn Beef Reuben. Greeted my Natalie Browne I was blown away with this Re-Branding. The previous bar Holding Company was old school and the implemented change brought a whole new light to this business.\n\nCocktails were on point. Food was delicious. My significant other got the Patty Melt, I got the Corn Beef Reuben and we swapped a half for a half...Delicious. Incredible flavor, texture, juicy and yummy.\n\nWe got grade A service. We moved to the bar after lunch and were treated amazing by Camille the AM bartender. We had a great time. Oh the Kale Salad. Highly recommended. Thank you Patriot House.", "author": "Ahna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "In San Fran for a meeting and stopped in for some appetizers. Food and service were great. Atmosphere is excellent. Met the owner and she's terrific. If you're looking for a cool Irish pub feel with great service this is the place. I will definitely be back.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-25", "description": "Came here for a quick bite and some brews after working until 9pm on a Friday.\n\nWalked in and it was surprisingly practically empty. Despite this, still took us 20 minutes to get an order of burgers sliders and cheese fries.- which the pattys were so unbelievably small it should have only taken 5 minutes to cook! The fries were over fried as well. Highly disappointed.\n\nWhile waiting for the food, looked up to the tv to see infomercials playing. What kind of bar does this? Politely asked a server to change the channel which he kindly did.  \n\nAlso took about 10 minutes to get new beers even though we were one of 5 tables. Not sure what our server was doing, esp since there were about 3 servers on the floor (not including the bartenders). \n\nWill not be back that's for sure.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "The place looks amazing, but it was fairly difficult to find. No signs anywhere. It's above a Pizza Orgasmico.\n\nThe signature cocktails were good, but pricy. OK, I understand, Bar Rescue jacked up the prices a bit. They were out of the burger.\n\nThe sliders though were way too small. Unacceptable to have 2 sliders and no condiments on them that I could remember. \n\nThe wings were good, it's pretty hard to screw up wings. They had a choice in hotness level.\n\nThe wait staff was pretty friendly. I think I may come back. They have a lot of TVs and a private bar area in the back that you could rent out. I'm never really around this area though.\n\nThe Bar rescue episode just aired last night. I think their systems have been implemented because I didn't have any issues.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "JULES!  You have the special magical touch of a true Leprechaun who is gifted with making the BEST margarita around!  Will be back for more, especially with the homegrown habareño kick!  We shall return!", "author": "VINCE P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "I'm a Yankee Doodle Dandy\nA Yankee Doodle, do or die\nA real live nephew of my Uncle Sam\nBorn on the Fourth of July\nI've got a Yankee Doodle sweetheart\nShe's my Yankee Doodle joy\nYankee Doodle came to London\nJust to ride the ponies\nI am the Yankee Doodle Boy...\n\nWait a second, let me finish my tap dance and light up my red, white & blue sparklers. OK, now get me a chair 'cause my dogs are tired from all that tap dancing (...I was good, wasn't I?). Did you know the Holding Company had been in the same space on the third floor of Two Embarcadero Center for over forty years? I've been coming here off-and-on for at least thirty of them since it was THE place to get a burger and a beer during the Reagan years when I would come here with fellow lemmings working for slave wages at an ad agency. And you thought \"12 Years a Slave\" was rough going? I won't show you the lashes to my ego. Anyhow, the original owner finally retired last year selling to four young Irish lasses, the Brown sisters from Dublin.\n\nI don't think they're a Riverdance troupe, but they could be, bonny lasses that they are and also hard-working. Jamie W. and I tried the Holding Company under their management, and they definitely made improvements to the menu. Now I see they've rebranded themselves thanks to a Spike TV program called \"Bar Rescue\". We tried it tonight, and the refresh appears to be working, at least during Happy Hour as it was packed. The food menu doesn't look hugely changed except the presidential names (photo: http://bit.ly/18abQQz). Cute touch but I felt like I was taking an exam and I wasn't passing. Except gas maybe. I tried going healthy and did pretty well. I started with their vegetarian soup, the $6.95 Millard Fillmore's Minestrone.\n\nIt was stocked full of goodness - kidney beans, died tomatoes, zucchini, a little pasta. Some haphazard croutons with Parmesan were thrown on top (photo: http://bit.ly/1CzEplY). Decent no-frills soup. Just wish it was a little thicker from stewing in the pot. I followed that up with the $10.95 John Quincy Adams' Peacefield Farm Salad, which was quite a good kale salad with radishes, endive, cucumbers, cherry tomatoes, tarragon and vinaigrette (photo: http://bit.ly/1t9Z7GG). It was fresh and not too lacquered though I think I may ask for the dressing on the side next time. Jamie went more for pub grub and ordered the $10.95 The Patriot's Original Pizza with Pepperoni and Italian Sausage on top for an extra $2 (photo: http://bit.ly/1zFwpQq).\n\nWhat can I say? It was bar pizza. No complaints but not an artful creation either. He also had the $7.95 Nachos which sadly had no President associated with it. Richard Nixon comes to mind though. Tricky Dick. It was a plate of tortilla chips with black beans and cheese sauce which just had to be Cheez Whiz, c'mon (photo: http://bit.ly/1xNAHja). Jamie was asked if he wanted meat on it but understandably perturbed to find out on the check that it was $3 extra. Divulge upfront please. Our Diet Pepsi's were refilled without provocation though, so there was joy to be found there. But I have to say even with the Presidential portraits and American flags, it really didn't feel that different in the space. The wrap-around bar, the dark woods, the mirrored panels and the significant douche factor were all present and accounted for.\n\nFOOD - 3 stars...pub grub was still middling though the kale salad was a nice addition with a fresh taste\nAMBIANCE - 3 stars...still feels like the Holding Company, which is fine with me since I didn't have complaints before\nSERVICE - 3.5 stars...pretty good and attentive despite the extra meat gaffe on the nachos\nTOTAL - 3 stars...and I'm proud to be an American where at least I know I'm free...hey wait, are we in Philly? Boston maybe?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "Pretty decent bar and grill. It's a bigger bar in kind of a mall setting, so the space isn't amazing, but there are a fair number of decent beers on tap and the cheese burger and fries were pretty good. Prices were reasonable and the bartenders were nice.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "I wish I had a chance to talk about the food or the drinks but I never got that far. Sat at the bar for 10 minutes on opening day of College Football and it took that long to even see the bartender. She took about 4 orders before mine, which was appropriate because they had all been waiting well before me. When she finally got to me I asked for a menu and a water (super hot out). She gave me the menu then disappeared again. I waited another 10 damned minutes and gave up and walked out. Slow. Rude. Understaffed and unacceptable. I went back to my hotel restaurant/bar and paid twice as much for my food and drink but was much happier since I got what I wanted.", "author": "Stephen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "I heard about Patriot House from the Bar Rescue episode but I've never had a chance to come here.  One day after work, all of the local bars were all full.  \n\nWhen we got here, the place was full but not too full.  There was some seating inside and there were plenty of TV's everywhere to watch the games that were playing that night.  Ironically, a bunch of Dartmouth alums were watching a Dartmouth college football game that was playing on the other side of the bar.  It got pretty loud over there.\n\nWe each ordered their $7 special strawberry margaritas, fresh strawberries as our waitress promised, not made from syrup.  By the time it got to us, I tasted it and it was definitely not syrupy.  It also wasn't that sweet but they did use real strawberries.  We also got an order of sweet potato fries which were fried and cooked decently.\n\nAfter two rounds of drinks and watching the first quarter of the Warriors game, we closed out our bill and headed out.  Overall a great experience here during Friday happy hour and will come back if I felt like walking from SOMA to here.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Very good service. Seems to have a good happy hour scene and very roomy. They could have a better local craft beer menu. Fish tacos done well. Spicy wings are spicy. Also enjoyed the creme brûlée bread pudding. All my dinner guests seemed happy with their meals too.", "author": "Bernadette W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "Patriot house was a very gracious host to a Paintnite event (10/3/15) that turned quite disastrous toward the end. \n\nFirst I will say, if you are looking for a good sports bar on the inside, then this is a great place to come. My friend and I ordered the special of 5 dollor Mimosas and some garlic fries which were pretty tasty.  If your a woman who enjoys the company of single men, then you will definitely get hit on there.\n\nBack to the other side of this story....If you are sitting on the patio, which typically can get very windy and cold. Then add a painting event to it with 25+ people, then this is not the spot you want to be in. I'm talking broken glass every where, furniture flying, teeth chattering , tornado/hurricane style winds came upon us. Needless to say paintnite had to be rescheduled!\n\nAll in all funny experience to share...but I won't be coming back to sit on the patio.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "I've been coming here almost weekly for lunch for a month or so. Today I got a RAW turkey burger. Normally I wouldn't be so crucial on food prep, but ordering a turkey burger I would expect a cool to be competent enough to cook it throughly. I will no longer be recommending this place to anyone, get your act together.", "author": "Jared G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "we are big fans of Bar Rescue, so while visiting for work, my wife and I made sure to stop bye. \n\nThe atmosphere was lively, it was the week of St. Patty's which made it super busy.\nService was okay, we waiting quite a bit for our drinks after we ordered (one draught beer and one Jon Taffer mixed drink).\n\nAfter we got our drinks it was probably 20 minutes since we were checked on again, I don't care to go back, but had to try it since it was on the show.", "author": "Evan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Awesome location right by the Embarcadero and our super weekend parking garage ($7all day Golden Gateway Garage) so it was easy to find and will be easy to keep coming back !!\nWe came especially for a late lunch/happy hour because we had seen it on one of our favorite shows Bar Rescue and it looked great !! We were not disappointed ! We even got to meet & be served by an Owner, Danielle who we saw on the show ! \nWe ordered the special cocktail of the day which was a delicious bourbon version of a Moscow Mule.  Yummy !!!  Everything sounded so good but we decided on the BLT. A classic and our fave sandwich . It was very good.  The fries were sooooo good, even the ranch dressing was better than the average !! There are several things we are looking forward to coming back\nto try !! (Happy hour smashed taters - mmmm)", "author": "Adenna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Really great pint of Guinness, poured slowly by Brian in time honored fashion, two stages.\nLovely pub, surprisingly huge and expensively laid out decor and furniture, like a fancy city center Dublin bar.\nIll be back", "author": "Paula M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-25", "description": "Well Bar Rescue, you have managed to mess up yet another decent bar. Patriot House, formerly known as Holding Company, is a sad excuse for a bar in the Financial District. A patriot house theme is probably the worst theme you could pick for this neighborhood - the FiDi is swarming with young professionals looking for unique experiences, not a bar filled with old men in a dingy setting. Okay, so lets get started...\n\nFirst off, WHY ON EARTH WOULD YOU TAKE FLAT SCREENS OUT OF A BAR?!  Stupid. Not to add, you replaced what used to be a flat screen with a picture of George Washington or some other old person no one wants to look at. Stupid. \n\nSecond, bring back the old menu with the old recipes. I used to order the nachos weekly. They were large and had real cheese. That is, until the remodel. Now they are the same price with less food and FAKE CHEESE. Nasty.\n\nThird, seriously get rid of that UGLY 1776 sign. It seriously burns into your retinas after being around it for more than a half hour. By the end happy hour, I had the worst headache because of that sign. \n\nFourth, if you are going to remodel, for god's sake at least change the faulty lighting in the corner by the bar. The flickering light is not acceptable for a newly remodeled location.\n\nFifth, where did the wait staff go? It took forever to get a drink. Maybe they were short staffed on the days I went, or maybe the Bar Rescue media attention increased traffic, but that shouldn't be an excuse to wait 20 minutes for a drink. I'm waving money in front of you and you're not taking it. \n\nSixth, get rid of those stupid barrel tables. Have you tried sitting at them? As a lady, it is very awkward. Especially if you are in a dress. Do you straddle the table? Do you turn to one side, and if so, how do you avoid ignoring the person sitting on the side to which you are not turned? Not a smart move. \n\nOkay, I could go on for a while, but I will save my time for better things (like looking for a new bar). \n\nUnfortunately, the Holding Company used to by my weekly hump day (Wednesday) happy hour location. I am currently looking for a new bar as Patriot House renovation has been disasterous.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-20", "description": "This pub was pretty spacious!!! It was pretty empty on a Friday around 4 . They had a decent happy hour menu with various selections. I really enjoyed their quesadilla and chicken wings. \n\nOther than that a great place for a large group. 3.5 stars .", "author": "Nhung T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-27", "description": "FIDI LUNCH HOUR\n\nCame here for lunch and the place had people but was not packed at all. Usual lunch crowd: FIDI business men. Seat your self service. Upon seating the service was kind of slow. At some point I felt forgotten. The table next to me saw me constantly looking over my shoulder to see where i can get service and once the waitress arrived at their table they were generous to say \"she would like to order something\" (thanks strangers for noticing). The dinner menu looks more enticing than the lunch menu. Lunch menu has selection but nothing caught my eye. On yelp this place is categorized as \"gastropub\" but there was nothing gastropub about the place. Subtract the \"gastro\" as it was just typical American pub food. At the end of my meal I had waited about 15-20 minutes to get my bill. Again... Forgotten. I had to get up and search for someone to tab me out.  After mentioning the wait they subtracted 50% off my bill for the inconvenience. That was kind of the manager and I respect that. \n\nThe food.\n\n1/2 SANDWICH AND SOUP - Friday's I can't eat me for religious catholic reasons so It was basically the turkey sandwich minus the turkey and in replacement was avocado. Typical sandwich. Ordered the minestrone soup, that was delicious. It was cup sizes and wish I had more. Very tasty and packed with vegetables. That small flavorful cup of soup was the highlight of my lunch. \n\nWill I be back? Maybe.\n\nUntil the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "I stopped in for happy hour for a late lunch and a cold beverage.  I was actually looking for the Holding Company which was the original name of the business. \nThe original owners retired and sold the business to a family of Irish sisters who struggled at first.  During the transition time the business suffered.\n\nThe restaurant/bar is located in the heart of the financial district of San Francisco.  The bar is located in one of the business complexs. So don't feel like you're lost. Just ask one of the local businesses and they will point you in the right direction.  The sisters reached out to a leading bar owner and restaurateur who has a show called Bar Rescue. \nI must say that the Irish sisters who have really turned the place around.  The bar service , new name, new menu items and remodel is a total hit.\n\nThe bar is one of the most beautiful bars I have seen in a long time.  If you're from out of town and looking for a great bar with an interesting twist, great beverages then make the trip. The deviled eggs are excellent.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "I believe this place used to be Holding Company (best guess) so was surprised when they closed shop and Patriot House took over.\n\nThe layout appears to be the same as before with no real changes to decor but the menu was entirely revamped. \n\nI decided to go for a very standard burger just to see how they would do. In a nutshell, the burger needed more salt and fell flat. Fries were good and was pleased with them. \n\nOverall Thoughts\n\nI might come back to check out HH in the future but for a burger I rather go to Super Duper.", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Jan O' Leary was outstanding! Even during st pattys day she made our happy hour fantastic while every other bar was overpacked. Great views, food and drinks. I would recommend this spot to anyone looking for a cool place to hand in SF for drinks and a view of downtown!", "author": "Yiorgo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-20", "description": "Came here for a Warriors game on a Thursday and it was absolutely jam packed at 5:30pm (game was at 6) - not surprising. What was surprising was the stark contrast between the different waitresses serving people. Some of them were absolutely amazing - friendly, attentive (as one can be when serving 50 people at once) and had a smile on their faces the whole time. Others were visibly frazzled and looked like teenagers at their first after school jobs.\n\nAnyway, we ordered a bunch of drinks and food, and the drinks always came out in a timely fashion. The food came at staggered times, which was disappointing for the person who ordered 45 minutes before everyone else and got her food later. I got a cobb salad which was pretty good, friends got fish tacos and chicken sandwiches which were pretty good as well. Overall, a good place to go to watch games - just try to avoid on the busiest nights.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Came in for a quick lunch, sat at the bar and ordered the half turkey breast sando with side chili and a Racer 5. Really good, also came with chopped onions and delightful cranberry dressing. Waitress with the brogue was friendly and attentive and I was back at my desk within the hour. Will stop back when it's happy hour. Shouldn't be surprised to pay $6.50 for a draught beer in SF but it gets me every time.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "I had my 30th Birthday party here last night, all I can say is that it was amazing night. The staff our phenomenal the bar tender was beyond amazing and the owner Danielle is a fantastic host no task is to big or two small. So if your looking for a venue for your party the patriot house is perfect venue. And if your around that way on Saturday night pop in and see the bartender he perfect cocktails and is great company with few laughs. All in all I would highly recommend here", "author": "Madel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "I've been here a few times. Honestly, the food and service can be better; I have yet to eat a meal that blows my mind and the waitresses could use some training. I only come here because of the convenience - I work in the building. \n\nIf you can pass and go somewhere else, I'd suggest you do so.", "author": "Stacy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Love this place! Staff are attentive and friendly. Food is always consistent and I recommend going for a \"Special\" of the day if you're here for lunch. On the menu I love the crispy chicken sandwich and the turkey burger. My two favorites! Their salads are never boring either. Great place to watch a game with all the tv's  they have.", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "Very disappointing. We came here on a Saturday afternoon, which is clearly not a busy time for them. The restaurant was virtually empty. After seating ourselves, we were able to order a drink. Everyone in our party of four ordered cold sandwiches. Literally an hour later we were still waiting for our food, and the waitress never once came by to let us know what the situation was. We ended up paying for our beers and leaving and will not be back.", "author": "Claire P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Great staff (Jules, Brian, Mattie, Amy and the 4 Sistas of course), eats w daily specials (please bring back those Nasty Nachos!), TVs, ambiance and regulars!!!", "author": "Cheny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Great  bar with great food! The bison burger is amazing! Danielle is the best go on THURSDAY!", "author": "Corey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "My food has been good every time I've gone. Sometimes after 1 the service can be a bit slow, but I always get service with a smile.", "author": "Nae F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "Came here one night during the weekday to meet up with friends for a quick dinner before hanging out afterwards. The place is not its own restaurant on the streets of San Francisco, meaning it is located inside a business plaza on the 3rd floor. The building itself doesn't have a directory and being my first time there it took me awhile to find it. After finding the place, you will be surprised how busy it can get! Since it is located within a business building, you can expect to find a lot of people from work afterwards hanging around, so it can get busy. If you are looking for a quiet place to eat, avoid this place because it louder than most. There is a large bar and plenty of seating which as I said before can get full quickly. Because of this the service can be rather slow and you will often have to get the attention of staff instead of them paying attention to you. The place is pretty nice, mainly a bar themed typed of place and semi vintage feeling. Would I come back? I would if I was invited again but let's just say I am in no wish to come back from my own personal desire.", "author": "Anne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Reasonable prices,  friendly staff,  good fish tacos.  What's not to love?\n\nI am very happy I came here for a quick bite and a drink after a long day.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Enjoyed The Mixed Grill of swordfish, chicken apple sausage and Kentucky Buck before a work event with colleagues. A great place for after work conversations, food and beverages. We will be back!", "author": "Ernestine A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-28", "description": "This place was near my hotel, so I stopped in for a beer and food.  Got a breakfast dish that was good, and one of my favorite IPAs. Lots of games on tv which was good.  Staff was ok.\nOverall just an ok experience.", "author": "Paul P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Came here with a large group from work.  Perfect bar setting with very good bar food options.  I called ahead to see if they would be able to seat us (was during the baseball playoffs).  Not only did they say they had room, unbeknownst to me, they went ahead and reserved tables for our large group without me even asking.\n\nWe mostly had burgers and appetizers.  They were all outstanding.  Nice servers, too.\n\nI'd go back", "author": "Marc F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-30", "description": "Feels like you're in downtown DC. Nice Irish servers. Kind of uninspired. But comfortable, in a soulless corporate way. Very generous pours on the wine.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Great array of beers... excellent staff! They will find any game you want!!! Good vibes... great little drinking hole.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-14", "description": "Don't come here if you're hungry.\n\nIt's a nice looking bar and location is fantastic.  I came for lunch as I work close by.  Ordered the fish stew as the waitress recommended that.  It came, presentation was nice, but portions were small.   It really was just 2-3 small pieces of fish, and 7 small mussels, and three thin slices of bread.  The broth was watery but tasty.  Polished through that in less than 10 min.  \n\nWaitress asked if I'd like anything else.  Unfortunately they only have appetizers during happy hour and I didn't feel like ordering another full entree or wait till happy hour.\n\nSo I paid the bill and picked up a sandwich on the way back to my office.  \n\nKinda of a fail on the restaurants part if it's customer has to pick up more food after sitting down for a full meal at their establishment.\n\nEDIT: To be fair....as I was walking out, I noticed their sandwiches and such did look to have good portions.  Lesson: don't order the stew if you are hungry.", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "They make rum & coke with Flor de Caña Extra Seco - didn't even have to ask!!! That's a 5 start in my book", "author": "Rosa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "We were staying at the Hyatt Embarcadero looking for a good local pub place and saw the reviews and pics, which made us give Patriot House a try. We were there on Labor Day 2015 at 8:30 pm and we were the only ones there. If your a tourist this place is not easy to find. It is on the third floor of the Embarcadero mall with not much signage. We sat at the bar, which has a nice ambiance and talked to Nicolette our waitress who was very nice. The food was not bad, the service was great and the ambiance for being in a financial district was very nice.", "author": "Larry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "5 stars for customer service! \n\nThe ladies who run the floor of Patriot house always welcome you with a smile, make sure your glass is never empty and check up on you plenty during your visit. Monica rocks! \n\nI came here before Bar Rescue and I've definitely been back plenty post Bar Rescue.  The new addition of hella TV's make watching sporting events even that much better!\n\nSt. Patty's day was a blast - obvy. \n\nWork happy hours is always a blast, especially since this place is so spacious. \n\nTONS OF BEER on TAP = one happy girl.\n\nSweet Potato Tator Tots are a must every visit.\n\nThank you for always showing us a good time each time we come to drop some dolla billz on delicious, hoppy, craft beer.\n\nForever grateful,\nA beer and tot lover. \n\nPS. The prices rock!", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "great crunchy thick chips and cheese sauce for the nachos.\ncouldve been better without the lettuce, beans and instead added more guac.\n\ni will pass on the fish tacos, the salmon was a tad stiff and the tortilla was not doubled up so it just fell apart on your hand.\n\nservice was quite prompt for being game night. beer is beer here, nothing too special. but they do have some microbrews.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "I was bummed when the former occupant of this space left but after lunch today I can't even remember that place's name. I had a terrific lunch - the patty melt. Juicy, tasty, hot with great cole slaw on the side. I should have taken a picture but I ate too fast and forgot!!!  Along with the tasty food, the staff was super friendly and attentive (especially bartender Jewels).  They clearly work their butts off during the busy lunch shift.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Stopped in for a quick drink. I got the Sunday Whiskey, it was good. My friend got the Grant's Elixir, it was on the sweet side but still yummy. I loved the decor and the place was surprisingly bigger than I expected. I'd definitely come back, good place to watch sports.", "author": "Jaime C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "I am so happy to have found this place...Great customer service, wonderful \"clubby\" decor and amazing prices.\n\nThey are trying hard to serve vegetarians and vegans and deserve high marks for offering several items for us.  \n\nThank you Patriot House.\n\nThis place is a hidden gem.", "author": "Greg T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "My first time in San Francisco and I love it!  The waitress is from Ireland and she's as sweet as can be!  Had a Strawberry Habari Margarita and I have to say. .it was bomb.com!", "author": "Eydie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "An absolute pleasure working with Natalie on setting up a happy hour for 80+ guests! They were so easy to work with and extremely accomodating. Reasonable prices, yummy bar snacks and beer selection and very casual. Highly recommend doing your next happy hour here or just coming by and watching the game!", "author": "Angela Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Went here a while back just to see what John T. did to this place.   Came here for hh and this place is pretty huge.   TVs at the bar was a nice entertainment as the football game was on.  Tried the sliders and devils egg and they were good.   Server was nice and friendly, drinks came quick for as busy as they were so I give this place a thumbs up.  Looking forward to revisiting this place again and see to see they can maintain it.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Came in here last Friday to watch some March Madness. New owners must be doing something right the place was packed. Thankfully they had a TV outside on the patio. Score! \n\nService was swift and food was good. I had the mexican special: roasted half chicken pibil, wrapped in a banana leaf with achiote chili paste and rice. Pretty sophisticated sounding, but you can't go wrong with their Mexican themed specials on Fridays (I've had the carnitas many times). \n\nBottom line is that the grub hit the spot, folks are super friendly and prices are decent for FiDi.", "author": "Boe D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-04", "description": "This place is gloomy and over priced. Food is very basic and beer taste flat. Much better places to eat in downtown SF.", "author": "Sugi s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Highly recomended!\n\nI am a huge Bar rescue fan, (seen every episode) and was super excited to check this place out!\n\nWas very happy great drinks, did not try the food but looked really good seeing what other people ordered\n\nNot a suit and tie guy (probably the normal crowd) but felt at home highly recommended!", "author": "Jason L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "Great place for happy hours after work or drinks late at night.", "author": "Jane Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "I visited with three of the four sisters (Natalie, Danielle, and Marissa Browne) just yesterday and had such a delightful time. They were so engaging and kind, I felt like I knew them my whole life plus the service, food, and atmosphere were outstanding. If you find yourself at the Embarcadero Center 2, look them up. You won't be disappointed!", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Just love this place. The service is friendly, they are very relaxed, and there is a good variety of much better than average pub fare.  A plus is that the patio is dog friendly, so you can bring your pooch and feed them little tidbits of turkey from your lunch plate.\n\nThe half sandwich half soup is a great deal, and I've also had the patty melt. The fries are hot and crispy. Also try the sliders. Very tasty.", "author": "Martin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "I have to dock a star based on their lack of clear directions to where the restaurant actually -is-. I was looking for it specifically and still had to wander around the shopping centre a bit before I figured out where it is. That being said -- nice sunny patio, good food & food portions, and a nice selection of beers. I'll go there again when I'm looking for a quieter patio downtown!", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-03", "description": "I so wanted to like this place given the name and that I consider myself a patriot and am named after a Founding Father. But the decor is just so-so, and the food is mediocre at best (sweet potato tater tots were not that flavorful and served with a runny habanero ranch dressing that was not that habanero-ey; the Thomas Jefferson deviled eggs were equally uninspired).  \n\nOn the plus side, our waitress was nice and the service was good. \n\nNothing 'revolutionary' about this place. \n\nOverall: meh.", "author": "Jefferson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "Patriot House is located in a weird place that's kind of hard to find. It's on the rooftop area and tucked away in a corner. It's very patriotic on the inside with a bunch of US president portraits on the wall. They have a rotating special menu that seems to change daily and a regular menu also.\n\n== Food ==\n\nThe grilled chicken was really nicely done. There wasn't any other flavor to it except chicken, but it was very juicy. The portions are just right.\n\n== Overall ==\n\nA bit pricy but it's a good place. Happy hour items looks a lot more fun than their regular menu.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "I'll make this short and sweet:  Great, unique, creative food ideas that are executed well and burst with flavor.  Comfy environment that is clean and relaxing and (if you're on the patio) scenic.  Friendly and fun servers and staff that seem like they've been your friend for 12 years.  Prices about average for this type of place in this area.\n\nDefinitely a go to for lunch or happy hour or if you have family in from out of town.", "author": "John B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-10", "description": "This is traditional Chili's-Applebees-TGIF-Elephant Bar kinda food, better than some and worse than others. We had (literally) every appetizer they had, and I had a Reuben, which was sub-par for many reasons. The fries are bad, doughy and limp, the Mac and Cheese is great, the potato skins awful, the rings awful, the quesadillas ok, the nachos ok, you get the idea.\n\nService was really good, so come here for a beer and VERY predictable and uneven bar food.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Tried their signature cocktails: Taft's Crowd Pleaser, Madison Squeeze, Grant's Elixer.  4 out of 5.  Our group liked Taft's Crowd Pleaser best (nutmeg adds a twist to the flavor, but yums still), I was more partial to the Madison Squeeze (citrus-y but pretty, tasty).  Would order again.\n\nBurger sliders were about a thumbs-worth of burger meat served with sweet rolls (assuming Hawaiian bread).  The burger meat was actually yums.  Will probably order the burger next time.\n\nReuben: toasted bread, decent portion of meat and kraut.  Solid sandwich.  Don't expect Katz or Tommy's Joint style, but more on par with diner-style hot sandwiches. Our group subbed out fries for Sweet potato tots - good portion- and another had the fries.  Fries on their own were tough to eat since it seems like actual potatoes were used (not sure about the actual potatoes part).  Think In and Out fries but maybe two to three times the thickness of the cuts of fries.  Apply condiments - ask for housemade hot sauce - to fries.\n\nFish tacos were decent.  Not much else to say\n\nMac and cheese was good, gooey, bacon-y. \n\nLocation: take Embarcadero building 2 escalators to the top, turn right.  We arrived near closing so the place was pretty empty, but the exterior location had a nice view of the skyline.  Picture spot.\n\nWould go again for some solid and decent American food.", "author": "Vivial S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "Alright so we decided to check out the bar rescue spot. Being a local in SF for 8 years...I gotta say I was pretty disappointed overall. \n\nLet's start with the positives. The sweet potato tots were really good, and so was the spicy ranch. The drink prices weren't too high. The crowd was fun. Cool patio. \n\nNegatives: The young man who waited on us sold us the shots with fire. He said ya we will light the shots on fire. So we were all stoked. He brought the shots to our table and  we were like \"hey dude where is the lighter?\" He informed us that they flame up the shots only at the bar. Sucked. DONT SELL US THAT WAY!! Invite us to the bar to watch at minimum!!!! \n\nThe young man waiter had a horrible attitude. Man it's either management treats you like crap or get a new job! LOOK PEOPLE IN THE EYE!!!!!! It's rude not to. \n\nThe burger was average at best. Side salad was just a few leaves, nothing spectacular by any means. \n\nThere was also a 24-28 year attractive female server who must hate all women. Like a rude little cat. \n\nThe bathroom missed the remodel. That needs to be completely redone. Gross. \n\nPlease change your attitudes. I'm not going back for at least 6 months. Remember, things roll down hill. I would think management are still recovering drill sergeants.", "author": "Tom R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "Love the new changes the place looks amazing.. Came in for lunch on Friday and tried the Mexican special it was delish and such a large portion, my date had the house club he was also impressed we had a late lunch and hung around for happy hour $5 shot special can't go wrong for the financial district!", "author": "Fiona R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "Worst place in hell.  Food is mediocre and the service is ridiculous.  We had to wait 15 minutes for water.  Forget the cheeseburgers.  Damn!  Leave that to the Germans!  Lol!  Will NOT be back!  Ugh!", "author": "Blossssom M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "The Bartender was really friendly, she gave us free samples to try of the beers and some fish tacos on the house . We are just in town for the weekend, but I would return on future trips to SF. It was a Saturday afternoon though and the place was empty. It's upstairs in a mall in the financial district where a lot of the shops are closed. Some lively music would help.", "author": "Brenda G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "On the third floor, it is ok looking bar.  Came here on Sat lunch time and it is pretty slow and empty.  Location issues, no door traffic.   Weekdays probably very different.  \n\nGot a burger.  For $14 it was pretty lacking.", "author": "Jim T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "All around seriously the best bar/restaurant I've been too!! Great customer service amazing bartenders and waitress! Thank you Marissa for being amazing!!", "author": "Karissa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Pretty fast service and an above average Reuben sandwich. See other reviews bitching about high prices but what do you expect in San Francisco where your supes add health surcharges, fair wage minimums and all sort of privilege to do business in SF taxes. Guess who pays?", "author": "Tom R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-01", "description": "Food is alright.  Just usual, typical bar food.  I asked for water and the waiter told me to get it and pointed it at the bar in the back.", "author": "Joane B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-14", "description": "We walked into the bar and there was no hostess to greet us so we waited until the bartender did. We asked to be outside and he had to check with the manager to see if the patio was open.  They ended up seating us outside but it was definitely not what we expected. The food on their menu online wasnt being offered so we had limited choices and I'm a picky eater  so I asked if I could just do a cheese quesadilla and my boyfriend had the \"tachos\" (tater tot nachos). The food came out pretty quick but was not good at all.  I only ate one of my four pieces of my quesadilla and how do you even mess up a quesadilla? Our server never asked us how the food was and when came out and asked if we wanted boxes I told her no thanks I didn't care for mine and she went to grab the check.  She charged me $16 ( which was the price for the chicken quesadilla) ridiculous!! Especially because I didn't even like it and wasn't offered something else which I probably would not even have wanted to try. Let's just say we definitely will not be back here and I don't recommend it to anyone who wants good food and service.", "author": "Shelli L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-21", "description": "This place is a solid three stars. It's not a bad place to go to grab a drink near the embarcadero center or to watch a game, but it doesn't stand out either. In general the food is okay, but not great. The nachos are average, the wings are average, and the pizza is average. I wouldn't come here if you're looking to enjoy a meal. You will probably be disappointed. Come to Patriot House if you are looking to go to happy hour or watch a game after work.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Delicious food (Veggie burger with Guacamole is my go-to for lunch) and good beer selection. Jules is always a welcome bundle of energy behind the bar just waiting to make your stay as fun and carefree as possible! All around great spot!", "author": "Suzie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "I always have a great time here during lunch and after work and it's super convenient being in the Embarcadero just across the street from my office. Great food and drinks. Special shout out to Jewels! Always fun banter when she's behind the bar.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Great bar! Great sevice! Great food. Highly recommended. Jewels is awesome! Definitely come in and see her. Btw they carry my favorite shot as well, Galliano :)", "author": "Nav S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-13", "description": "This is the old 'the holding company' and nothing much has changed except the name including the existing old decor. New large screen tvs are a nice addition though. Also, the new additions to the menu are also tasty - get the fish stew and mixed grill.\n\nA colleague and I indicated we were sharing the aforementioned dishes and they graciously brought them out already proportioned into separate bowls/plates.\n\nBTW The sausage in the mixed grill is SPICY in a good way but suprising nonetheless; this coming from a self-proclaimed high tolerance for heat so those with molder appetites be warned.", "author": "Noah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Great bar/restaurant in the embarcadero center. Savory food, drinks and professional and friendly staff. On my recent visit the bartender, Jules, served me and a colleague. She could not be more knowledgeable and accommodating. I will definitely be back!", "author": "Jason E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Great food great service and atmosphere! So busy for happy hour and big parties! Def stop by for a tasty cocktail if your in the FiDi", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-30", "description": "Just had the chicken wings. They were good and the drummies were large. But there were only 5 in an order. Nice wait staff, overall a good experience.", "author": "Miche T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-29", "description": "I don't understand why the food here is so bad. It isn't even complicated stuff. BLTs, burgers, chicken sandwiches, salads. Its just above home cooking and yet, it tastes terrible. They are not even trying to do anything fancy like having a \"house aioli\" or \"artisan pickles\" or the usual stuff you see now on pub food. It's basically just crappy food that is probably prepared elsewhere and warmed here. \n\nBeer selection is good and they have a lot of TVs for sports. Thus, they earn some stars. Otherwise, if you are hungry, eat at Oasis Grill, then come drink here.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Have been here once or twice on fridays after work...always super service. We had a good size group a couple weeks ago and our server (Jan) was great, she made sure no one had an empty drink and we had great laugh at her slagging our Irish co -worker. Food came out promptly and was delicious....we will definitely be back soon for some more Friday fun!!!", "author": "sam k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-21", "description": "Wife had a chicken salad. The chicken was dry. The salad balsamic was flavorless. I had the California chicken sandwich, it was good but the house chips were stale. Mom had the shrimp, it was overcooked. Won't go back to this place.", "author": "Brice D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "This is by far one of my favorite places down town. The food is so fresh and the cocktails are on point. I come here for happy hour/ dinner regularly and the staff here ROCK! They are all so attentive and can recommend some great things from the menu. I had some friends from out of town come here with me and they can not get over this place and will not shut up about the baby back ribs and the service. I love coming here because I know for sure that I'm going to have a good time and prices are really reasonable too. 5 stars", "author": "Mike D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-06", "description": "Slow service and it was better when it was the holding company.  I understand that it was SB50 which they should have planned for more staff.  On a brighter note, after waiting 2 hours for totCho's they were really good.", "author": "Deborah V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-21", "description": "Waited 45 minutes for bland food with no salt. Service is terrible, was told the food was 5 min out 4 times. No one in my party enjoyed their food and we were all very dissatisfied with this restaurant.", "author": "Vineet J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "This review is for our server Amy from the Patriot House and the experience in general.  Our party was very well serviced during the after work rush. The bar bites were great, the wine drinkers were happy and we appreciated the beer selection. There was a Warriors game on and the place was packed wall to wall with people.  We had a party of 20 people and Amy was dazzling with her attentiveness and excellent service.  It was a very busy atmosphere. Amy even remembered our food modifications to the wings - extra crispy with the wing sauce on the side. Our company was hosting the gathering.  For us to receive excellent service from the chosen venue makes a world of difference with our clients in attendance.  Thank-you to Amy, her busser and the excellent Patriot House team. We will be back.", "author": "nino l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Fun. Good vibe and relaxed pub/family atmosphere.  Food was good not great but is a pub. Don't come here expecting 5star-that's not what they're shooting for nor should you. Definitely a revisit when staying at the nearby Hyatt Regency.  Watch the Bar Rescue episode before coming to get background on this place.", "author": "R S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "The food here is average at best, I ordered a half turkey sandwich and soup and there was hardly any meat, so I asked for more.. The meat seemed just like sandwich meet and the bread was just normal slice bread.  Overall nothing special...", "author": "Umar M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Great service, great burger, decent beer selection. Nice to have a proper pub to go to.", "author": "Clarence D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Great place to watch all the games. TVs everywhere! Just brought the kids for lunch after visiting Super Bowl 50 city. Caught the Warriors on the big screen, kids enjoyed their burgers and Mac and cheese. Myself and wife had the awesome wings, and pizza. Overall a great find, and decent prices for the financial district. Oh and great fast service.", "author": "Alan O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-21", "description": "Different name but same menu and same general reaction: eh, pass.  I know that Patriot House had a recent revamp, but from what I could tell, it looks like they switched out green coloring for maroon, put up a few giant TVs, and changed their theme to be more patriotic.  The last time I was here (when it was still Holding Company), I had their grilled chicken breast with rice, salsa, and vegetables.  Lo and behold, the exact dish survived the culling but of course, it's really nothing out of the ordinary.  The burgers still seem to be the popular item of choice amongst lunchers here, and I was told that it tastes just about the same as before. Since work picked up the tab here, I can't really say whether or not it was reasonable, but with so many other options in the area, this probably won't be the first place I'd offer up when there's a per diem.   Happy hour seems like a good option here when there's a big game going on, but other than that, I can't see another opportunity to return.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Wow! We really enjoyed our experience here. My Wife and I came to SF for our Anniversary and wanted to try this place after seeing it on \"Bar Rescue\". We tried 3 different appetizers which were all very good and our drinks were made very well also. The Waitress was very attentive and was working especially hard to make sure we were satisfied. The day was topped off when we were able to meet 2 of the Sisters that own this place and whom we recognized from being on the show. They very kindly took a picture with us and took time to speak with us. Thank you for the nice experience and we would definitely come back here again.", "author": "Tj L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "It's tucked away and can be difficult to find, but it's worth it!  The prices are very reasonable for San Francisco and the food is very flavorful - even their grilled chicken.  Try the sweet potato tater tots as an appetizer - definitely a treat.  And don't let the name or the decor fool you - they don't ask your political affiliation when you enter the restaurant - all are welcome.  Our food was ready in no time - even before we had finished our appetizers!  The portions were generous too.", "author": "Jim O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "I haven't been here since it changed to Patriot House. Met a former coworker for lunch here because it was where we would go a couple years ago. Sadly, the menu is pretty much the same with higher prices but the food is really sub part. I ordered Reuben sandwich with fries and diet coke. The drink was flat, sent it back for glass of house white wine. Got the smallest wine glass ever with warm flat white wine. $7.50 for 3 ozs. The pastrami on the sandwich was dried out and didn't smell very fresh. Only ate a bite. The French fries were OK though.  My friend had half turkey sandwich. Nothing special, just white bread, Turkey, mayo and lettuce. Her side salad was a couple large leafs of lettuce with dressing drizzled over carrot slices. Sure wasn't worth  $38 for lunch. Next time I will just order a cold bottle of beer and French fries.", "author": "Dawn H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-18", "description": "I wish I could give this place a zero star review. They charge $10 for a shot of Jameson here. Bar Rescue was not enough. They also charged me and my colleagues full price for beers during happy hour. The excuse: \"Sorry, we forgot to switch our computers over from the artificially inflated prices that we charged everyone yesterday for St. Paddy's Day.\" Never again. Hopefully they make a show called Bar Resurrection. This place is bound to fail.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Went here to watch UFC 189. It's placed in a kind of business center which is closed at night, so not exactly the most cozy area. This was probably also the reason why there weren't that many people there, but the beers were decently prized ($6) and the staff was nice.", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-18", "description": "Good drinks, lousy food. Ordered their chicken sandwich which had raw chicken. Salad--  don't even get me started. Disappointing thing, I saw the episode of bar rescue and noticed one of the \"part owners\" there during lunch on Monday 4/6 when I sent back the raw chicken and she didn't even come up to apologize. Take some responsibly as owners especially, when it's been publicized on national television and patrons know who you are.", "author": "Faud H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "We had a corporate dinner and I have to say I was completely impressed.  From the very attentive service (from cocktails all the way through the end) to the food.  Everything was spot on.  I would recommend for any big event and the prices are very responsible especially when comparing to the other choices in the area.\n\nAs far as dinner, I had a NY Steak and it was tasty and cooked the way I requested.  Granted it is not a high end steak house, but with that said, it was good and everyone who ordered said the same thing.\n\nWay to go!", "author": "Gary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "I had a good experience. I was solo and had a couple beers and fish tacos. The staff was friendly and assertive. See you next time.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Came here for Happy Hour after work, and it was an enjoyable experience. The service was great, and so were the chicken wings.", "author": "Tina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "been here twice.. and its been empty. i dont know why there food is good and my boyfriend likes the beer. the staff is so nice to us. it is hidden place but its great", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Great food, great service and a new look! Patriot House is a staple for Happy Hour in FiDi. Great for any game or a bite to eat!", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "Stopped in after bar rescue episode. Bar is beautiful and beer is cold. Woman behind bar was so friendly and nice.", "author": "Todd A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Loving the new Bar Rescue look! I had been here a few times for after work drinks and being a big Taffer fan I was obviously dying to check it out post-Rescue (not that it needed rescuing IMO). Landed in there for Happy Hour with a few colleagues and we sampled some of the new cocktails and bar bites; Grant's Elixir and the Smash Potatos are definite keepers. I've always loved the Philly Cheesesteak Spring Rolls so was relieved to see that they had kept them on the new menu! Delicious as always! Overall it's got the same vibe as before, same friendly servers, food is up to par and the cocktail menu has improved so it's a win in my book.", "author": "Emer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Great food and phenomenal staff members. My gf and I each ordered a sandwich of a Patty Melt and a Reuben sandwich. We also ordered a Kale Salad with the scent of anicet smell tasted delicious too as well.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "Nachos were life changing and the potato skins were pretty good.  Service was on point and the drinks were pretty good.  With all he options in San Fran I'd like to branch out a bit more.  However, I would come back if I found myself in the vicinity without and alternate plan.", "author": "Eli S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-12", "description": "Staff was friendly and I think this place trying to improve but they struggle to get it right. There were multiple mistakes on our bill (double charged the tip and charged us for something I didn't order). Also, when we first sat down we ordered a couple shots and a Budweiser. We received only two of the three shots and they brought me a bud light rather than a Budweiser. There were multiple moments of confusion...\n\nSeriously though... The people are very nice. It just takes more than nice people to run a good bar. \n\nLastly, why is there cheese \"sauce\" on the nachos? If I wanted cheese sauce, I'd go to the ballpark. Put some real cheese on it.", "author": "Rob W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "What a great transformation. Loving the new menu items. The smashed potatoes were delicious and the sea food stew was scrumptious. The decor is really warm, inviting and sophisticated and I received great service for the server who looked after our table.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Calling what they serve food would be a compliment. It took an hour to get the food and three dishes were uneatable.", "author": "T P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-13", "description": "The food was fine, and the ambience was old pub feel. The kids could eat comfortably and we could grab a drink.", "author": "Stacy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "We're visiting San Francisco and had to visit the Patriot House after Bar Rescue. Stopped in for a drink... Had the Taft's Crowd Pleaser and Grant's Elixir. Both were AWESOME! Only had an snack but the Thomas Jefferson's Monticello Deviled Eggs were the BEST deviled eggs I'd ever had. The Staff was very friendly, warm and even got a picture with Danielle, who was lovely! Will recommend this place to everyone.", "author": "Nancy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "I saw this restaurant on an episode of Bar Rescue and was excited to see it was near I was staying while visiting SF. We checked it out and the food was amazing! We got the Fish Tacos, Onion Rings, and Nachos. All were delicious! I would recommend this place to everyone!", "author": "Heather H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Love this place for drinks after work I always order the chicken nachos with extra cheese sauce. All the servers are very friendly especially Fiona and Jen", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "Awesome food, and the irish vibe is very encouraging when your out drinking", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Great weekend in San Francisco made even better at the patriot house!  Great service. Great food. So much fun.", "author": "Terri W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "This place can be hard to get to. The outside is easy to find, but the restaurant is hard. The food is american bar food. We ordered minestrone soup, cheese pizza and chicken quesadilla. 2 of 3 were good. The cheese pizza was bland. The atmosphere was old and dark. There were a bunch of tv's, but the volume was only piped from on program. The staff was lacking. It could of been where we sat. The price was pretty good.", "author": "Cory M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Say what you want, great drinks, cold beer, and killer grub. Cant beat it for places near a bart terminal. Great fish tacos, awesome sliders and chill place to have a great cold drink.", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Love the changes! Super friendly staff, good eats and good libations! Met 2 of the 4 Irish Ladies I heard about, Marisa and Danielle. They're awesome! Made me feel right at home! Great spot for watching games. Not too bar like. Will be back very soon.", "author": "Paul M."}
