{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Yes I m giving this one a 5 star rating. Because parking in SF is hella hard and annoying..I need my coffee and I dont want to circle the block umpteen amounts of times..I'm already bitchy cause I dont have a coffee yet and probably had to.get up hella early 2 go work for some assholes. So my coffee should not be difficult.\n\nI need it strong and need it in hand as quickly as possible.\n\nPlus my coffee was FREE today...ahhh Latte", "author": "Kim R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "Just tried to get a cup of coffee to-go and the workers refused to open the door. I get that it's almost closing time on Friday, but it would have taken 60-90 seconds.\n\nFiled a formal complaint with corporate, will post results. Took me longer to file that complaint (less than 5 mins) than it would have taken to poor a drip coffee.", "author": "Sean E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "Don't order the iced matcha latte if you really enjoy the flavor of matcha. The Peet's recipe calls for one scoop of matcha powder, which to me is not enough. \nDisappointed.\nUnlike some other coffee vendors, Peet's did not offer to make the drink to my satisfaction", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-07", "description": "Redeemed my free welcome beverage and got a large iced matcha green tea. Asked them to make it with soy milk (repeated it twice to make sure). Halfway through my drink, my stomach was definitely telling me they used regular milk which sucks bc I told them TWICE to use soy milk. I rarely drink dairy products so for them to use regular milk really messed up my stomach. Also, their matcha lattes are super weak. Not enough matcha, drink tastes watered down / not enough flavor.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "I tried purchasing four $5 gift cards (to give away as gifts), using a $20 Peet's gift card. The employee said the store wouldn't allow me to do that because it's a new \"company policy.\"  No manager was available to help. Really guys?!?! Are you serious?! \nI know we live in a jacked up world, and lots of shady stuff happening, but are you concerned about $5 cards now?! For real? I guess we will no longer patronize this establishment AND we'll be sharing with others. \n#VeryPoorTaste \nOh, I forgot to mention, when I asked to talk to manager, he didn't have the leadership guts to talk to me, but instead, had the sweet barista try explaining things to me. Lol. Come on San Su, you have my number. You could've at least been a leader and called back. That's why they pay YOU to be the manager.\n\nUPDATE: Peet's wouldn't allow me to purchase $5 gift cards with my $20 gift card, so I simply transferred them to my Peets App, and then went to store and purchased my cards. SMH. (I cleared my $100 balance, in $5 gift cards... will give them to homeless people in front of this store). \nPeet's district manager should do a better job training employees and store managers on how to use better common sense and customer service. This was a super simple issue, with a super simple solution. San Su didn't have either OR even the guts as a manager to talk to me directly. #NeverComingBackToThisPeets", "author": "JonJon W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "Shitty coffee.  I drink Peet's al the time near my work. It is always good.  I ordered Long shot with condensed milk over ice like Vietnamese coffee.  The girl doesn't how to make it.  Taste like shit. And I want to exchange to regular ice coffee and it tastes like water and no fresh flavor of coffee at all.  And they didn't even refund back the different.  Terrible coffee here.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-07", "description": "Well this is the second time this happen in this month were I was using a app called good2go for restroom nice luxury restroom for partner drivers to use and once again when it my turn to use restroom I did and the manager of the store turn around and open the door with the key when o told them someone inside also I don't have to because the system shows someone in restroom and it have sensor inside I was once again violated when using this app I don't feel comfortable or safe to use this app restroom period and will file complaint and and damages the k you but this app isn't for me or anyone when it comes to safety and privacy the CEO of the company told me that their not suppose to open door unless emergency with the key but they did and the restroom was so nasty I had to clean seat before using it and low on bathroom essentials and no soap. It good app to use or pay for .", "author": "Dominick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "This peets is super fast. There is a mix of different populations at this location. Waited all day to get my birthday drink and they did not disappoint, possibly the frothiest almond milk matcha latte I ever had! Thanks peets. Easy parking out front if that's your thing", "author": "Coco J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "I've always been a fan of Peet's coffee, like for 20 years, but they've just surpassed my expectations by a mile.  Finally they have solved the restroom problem with a cool new app.  No more lines, my phone was the key, I didn't have to ask anyone for it. Brilliant Peet's!  Thank you.", "author": "SF T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Located at the Potrero Center, I stopped by to get a coffee after getting some lunch across the way. The store was not busy and I was able to walk right up to the counter to place my order.  I did notice that there were plenty of seating available had I decided to chill out at the store. \n\nMy order was promptly filled and I was on my way.  This looks like a nice Peet's to sit and enjoy your coffee after some shopping the Center.", "author": "Al L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-19", "description": "A very good place for stale pastries and them giving you the wrong order. They give you caffeinated decaf, etc. Recommended.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Friendly, helpful staff!! Delicious cold brew options. Everyone is so nice and the place is clean and efficient. Thank you!", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-15", "description": "I have fond memories of Peet's from my years in California. Back then, I knew I could count on a good cup and polite service. \n\nAt this location, the coffee was decent (not great), but the service was lousy. While I was still deciding, the woman behind the counter was impatient. There was no line behind me. I then ordered my coffee and remembered after I ordered to ask for a dairy alternative. She begrudgingly offered their potions and then apologized to her colleague for needing to step into his space to secure some coconut milk. I was so irritated that I don't recall if she thanked me for my business. Plenty of other options in Denver. I don't need to darken this door again!", "author": "Ben L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "Ate at togos- and the bathroom was \"out of order\". Went to Safeway, same. Ross- no bathroom. Finally tried peets and asked if I could use the bathroom cuz togos was out of order. Got attitude right away and was told store policy requires me to buy something to use their bathroom. I've worked at Starbucks before, and I think it doesn't take much compassion to tell someone \"sure\" when they've walked all over looking for a bathroom after they alreaf paid somewhere thinking the bathroom would work\n\n Thus center sucks. The people at peets were rude and the attitude was totally uncalled for. \n\nAgain- policy is one thing but I can bet those workers break policy and just didn't give a shit as they smirked and talked with such an attitude.", "author": "Apryl S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "After shopping from Vitamin Shoppe and Safeway, my husband and I decided to drop by at Peets to buy some drinks. We sat in the coffee shop for a while and once done, I decided to go to the rest room before we drive all the way to Burlingame.\n\nWhen I was in the line, an African American girl approached me and said I have to buy something in order for me to use the bathroom. I said to her that I already did and I just need to use the bathroom before heading out. She asked me, \"What did you buy?\" I said, \"I ordered mango infusion cold drink.\" Then this time she walked away. She came back and said, \"Can you go to the cashier? I told her, \"Why don't you ask my husband \"(who was still sitting and waiting for me) \"He has the receipt.\" \n\nMy husband wanted to use the rest room as well. The Barista said to my husband, \"I don't know you, I know her.\" Then the cashier approached the Barista and said, \"I know the guy, he ordered the drinks\".  My husband showed the receipt, then the Barista gave as a paper with a code. Out of disgust, I told my husband, \"Let's just go and not just use the rest room at all. NO APOLOGIES AT ALL. What a TERRIBLE experience. Really bad experience here. \n\nI understand that the area is a bit rough, but you should not do this with your customers, because if you do, the customers will never return.\n\nI experiences a positive response from Starbucks which is located at Church Street in San Francisco just beside Safeway, which is also a little rough area, but I never encountered this type of bad customer service. They welcome everyone.", "author": "Violy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "Coffee was not good at all. Terrible taste and after taste. I'm not very picky with my coffee, but I couldn't even finish a small it was so bad! Not worth the $3!", "author": "Ariana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "This is the only Peet's in San Francisco that consistently makes my drink the way I like it. All the others rush the process and it ends up tasting that way. \n\nIn addition, the staff are very nice and have the rather thankless job of dealing with a fair number of mentally troubled customers every single day. I admire their consistent dedication to quality in the face of this particular emotional grind.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "This place is horrible the people who work here are rude and disrespectful especially the Asian guy who makes the drinks thanks to them i will continue to go to Starbucks I've sold all my gift cards since I use to love peets I would get them bt now since a few experiences here have ruined peets coffee for me forever", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Staff are super nice and always have a smile. Quick service too compared to a few other peets in the city. Probably my fav location (:", "author": "Ariana H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-13", "description": "Pretty sure the cashier was high\nI ordered a cafe au laite and the barista just poured cold milk into a hot coffee while continuing to sweep the floor (it's suppose to be steamed milk)\n\nNot particularly impressed by this branch.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "I don't have the words to describe what a******s these people are. I need to use the restroom and they refused to let me because it's \"customers only\". I told them it was an emergency and they still refused, and the employee actually said they didn't care if I went on myself. Karma ain't no joke....", "author": "Ihsan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Always friendly service and consistently perfect drinks made every time I go to this location. I order cappuccinos so I appreciate that I actually get a well made cappuccino and not a latte. Can't say the same for the other location close by. The cafe area can use some up keep though. Tons of crumbs on the tables and floor. Have to self bus tables before sitting down.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Cashier was super nice, transaction was fast and easy. Environment was clean and spacious.", "author": "Eleni T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-21", "description": "Walked in and didn't receive any help for 10 minutes. I just stood by registers. The service was awful and so was the coffee. This was my first time ever trying Peet's coffee but I'm glad the first experience was bad. Will never go to Peet's ever. Glad Starbucks and Philz has it covered. Peet's step up your game.", "author": "Sahil S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "Coffee is top quality, or course. Service from servers stinks. Guy yesterday essentially tossed my ground coffee to me across the counter. No eye contact. I'm counting this more to employees being demoralized by management, rather than having a bad day.", "author": "lance l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-06", "description": "there are so many coffee places in the city it befuddles me as to how this shitty peets survives. ive come here a couple of times since i work over in potrero and 1. they oversweeten their PSLs and 2. their iced green tea comes with some fake ass peach taste. pass...", "author": "Fiona T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "It's Pumpkin Season at Peet's, so I came here in search of something pumpkinny yet not too sweet. Although I often bring my own home brewed Pete's Coffee, I had a little time before work and decided to treat myself. \n\nI ordered the Pumpkin Chai Latte with Low Fat Milk. It was glorious and had me bragging to everyone at work about my Chai. Like a Kid.\n\nCause I got a chai, I got a chai, it's made with pumpkin, my pumpkin chaiiiii.....  ;P", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "The baristas were really nice. It was okay though their internet connection was pretty slow and the outlet is right on the window which was very hot at that time.", "author": "Kat P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-19", "description": "Tried to like it but their coffee is not that good and their prices are premium. They have the same price as Philz coffee but their quality is not there. I ordered iced coffee and it got a weird taste to it. I also noticed the iced coffee was sitting outside the fridge in room temperature. Also, if you order iced coffee without saying light ice, you will get 75% ice in the cup. Go figure. Lastly, thus place is full of homeless people that use it as a lounge. The area it's in is not the greatest so that's why.", "author": "U L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "This Is so funny that today's all coffee has no lids, wonder if I just come here for a coffee and have to drive back to work, no lid means coffee gonna spill on my car. And more, a coffee shop has no cup lids, next time would that be no cups ?!", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "Peet's i seldom go to but may since their coffee policy is more lenient. meaning they do have a  (different) coffee of the day. today's was \"holy blend\" which i misheard to be \"house blend\".\n\ni asked can i have \"dickinson\" instead?  to my surprise, the cashier said \"yes. it will take a few minutes\". \n\nbrew: \"dickison\" (2)\n-same price as the regular. so cool!\n-dickison smooth yet very bold flavor, definitely a dark roast\n4.5 stars\n\ndrips:\n-not familiar with peet's setup, seems more informal \nnot rigid like starbux.-\n-brew ready within minutes. am now a fan\n-may check in sometimes to check out brew of the day.....", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "I love love love this Peet's. I would give it 5 stars if it were a little bigger (with more of the big tables). Either way, I still frequent this place at least once a week to study. Like I mentioned, there is only one big table so I have to kind of linger around at one of the smaller tables until it clears up so I can post up here for a few hours and get homework done. \n\nOther than that, this Peet's is great. They have a delicious chai tea latte and iced caramel coffees. \n\nThe baristas are always on duty sweeping and cleaning the place even when there are lots of people in line. They are also very friendly and apologetic when your order takes a bit to make. They once wrote sorry on my latte and gave me 4 tickets for free coffee in the future because I was waiting for a bit. A really nice gesture!\n\nLove this place (but please get some more big tables!)", "author": "Vidya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Been coming here every Sunday for over 10 years. Love the staff, they always have  good personality, even at 6 in the morning. Thanks Peets staff. I always get the white mocha, it is the best all around.", "author": "Vickie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "After a solid morning workout, I needed something refreshing to kickstart my day. I had a Peet's gift card burning a hole in my pocket and was glad there was one located upstairs in the center.\n\nI ordered a small passion iced tea to compare it to Starbucks and also enjoy some Internet usage outside at their dog-friendly tables too. Their tea was actually a bit punchier than Starbucks and reminded me of a cactus cooler or something. I actually liked it more than the stuff I normally get but unfortunately I don't think they've got a generous refill program.\n\nThis Peet's could have been cleaner but the service was decent. I like that they've got so many tables outside and folks like to lounge outside with their dogs. The weather outside has been stunning lately and Peet's passion iced tea is some good stuff while getting out of the heat. Go get some!\n\nFood: 8/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "They got my hot apple cider tea wrong. Came back and they were happy to give me replacement tea. They were courteous and apologized for mixup. Thumbs up in my book.", "author": "Benny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Shout out to the employees at this Peet's location! \n\nYou guys deal with angry, rude people all day long yet you still greet me with a smile and hello every time I come in. \n\nYou guys are really nice. Keep up the positive attitudes because people who care, and know how hard it is to work in food service, notice!", "author": "Luba P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "First, Peets does beans beautifully in general and here at this Peets, several of the employees, who are unfailingly gracious, welcoming and responsive, have been here for YEARS.  And, just as you'd expect, they are clearly proud to talk about their varieties of beans and what you might like to try if you already prefer certain characteristics of another bean. \n\nAs someone else has noted in a review, customers here have um *variable* manners but somehow this team stays personable and engaging.\n\nShout out to you! And to your beans. Yum.", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "530am coffee run?!? Yes I take that as a yes. Me and my dad decided to go for some early morning fishing and decided to stop by to keep up with our caffeine addiction. We both just ordered two medium coffees to get our day started. \n\nEven at 5:30am, I was blown away by how friendly the staff were. There were only 2 people working and there was a line of 4 by the time I finished with my order. They were fast with making their coffee and it tasted very good. Both my dad and I agreed that their regular coffee tasted better than Starbucks. \n\nI felt that they deserved to be recognized for their sense of urgency in the morning and how friendly their service were. I know at 5 in the morning I would be cranky but I was simply just blown away. \n\nThank you Peets and I will definitely stop by more often.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-14", "description": "I go to this Peet's when I'm in Potrero Center or the surrounding area for errands. The coffee is pretty good. I always get the iced coffee and a lemon scone. Let me tell you, that scone is puh-retty good. So I'm quite happy with the value I'm getting. \n\nThis place has friendly service, free wifi, and ample outdoor seating. If they had more electric outlets, I wouldn't mind coming here to get a bit of writing done. Overall, a good and convenient place to get your coffee fix in between errands.", "author": "Racquel N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-08", "description": "Great coffee but it took 20 minutes to get a latte. Slowest Peets in town.  That was today, another day a homeless man blocked my exit.", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Peers has almond milk yay! The Saturday crew of women working were so nice and friendly, fast and deserve raises and to make more than min wage.", "author": "Bernadette B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "Their latte is really good IMO. Foot traffic is a constant, but there's not much of a wait as these guys work quick. An extra star since definitely will return more often, what with the 24hrF right there as well.\n\nWhile roomy inside, the layout is \"busy\", with chairs and tables at both ends of the cafe and a high counter overlooking the shopping center's parking lot (http://www.yelp.com/biz_photos/za4AJqDJEA-2adi51qtARQ?select=BEhlg-OaDOXtQf5HVCUptQ). Walking to the restroom takes you through a seating area, which was not inviting, again IMO. Sitting outside on the metal benches or chairs could be an option if it's sunny outside.\n\nGood location to have - in the Potrero Center. There are two doors, one leading straight to the register, the other is to a seating area (http://www.yelp.com/biz_photos/za4AJqDJEA-2adi51qtARQ?select=JK1Oi3f_txWK1iRyQTnQPg).", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "Afternoon coffee fix! Large iced coffee w lots of Soymilk & Honey - nice break from Starbucks & Classier music/service here!\n\nI like the Mayan Cocoa Drink cos it has some kick.\n\ni also like that the Baristas dont shout and scream at you when they have your drink ready like they do at Starbucks.\n\nSome of their coffees have a sour flavour - perhaps their dark roasts and i dont like that v much. Only sometimes will I go to Peets! Id go more often if they had a Rewards Programme or Gold Card sort of Reward for rewarding customers such as SB but of course in their own way.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "I always feel like Peet's can provide, no matter how weird my coffee bean request. Typically I ask for half calf, which means mixing whatever special offering of the month they have with one other their decaf editions. Everything turns out well from order, to grind type, to the coffee I brew at home. \n\nThey also make my favorite chai.", "author": "Roger B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "The barista is not really friendly. When I asked for the Wifi pass, they said that the Wifi is not working. I don't know if it was true or they just didn't want customers to stay long during the rush hours.", "author": "Duong N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-07", "description": "First let me start by saying Peet's Coffee is my favorite. Their beans are phenomenal. This being said anybody that brews expresso at home has a basic gauge of how much expresso goes in a shot. I found lately that there is a great inconsistency on the quality of expresso or should I say amount of expresso going into a cup of coffee. I don't know if this boils down to training or not watching the machines properly. However when you watch them pour the expresso into  your cup and you see that it is about half of what normally goes in at other Peet's  coffee locations you know you're in for a lousy cup of coffee. You then have the choice to either suck it up and drink it or speak up and say something about it, in which case you may end up looking like a bit of a prima donna. However when you're paying $4 for a cup of coffee you should get what you want. Peet's either needs to spend more time training their baristas so that they make it consistent cup of coffee or risk losing customers. I don't know if I'm the only one who feels this way or there are others out there that have the same experience but it's gotten to the point where I can walk into a Peet's and look at the barista and remember if they made a lousy cup of coffee. I end up going to another location. More time and effort on my part but when a cup of coffee starts your day its gotta be right. I'm writing this review because today the lousy cup of coffee happened between me and my wife both cups were terrible a waste of $8 neither one of us could drink it this left me feeling like I should have spoken up but then when you go in there again are they going to give you that look like oh no here comes that problem customer.  I guess that's what happens when you don't get up early enough to make your own coffee. you pay the price. The price is apparently $8.  Anyway enough of my rant.", "author": "Cyrus R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Love Peets, and today was my first visit to Potrero Hill location. Afternoon coffee and snack, yum!  But best was the staff who were friendly and professional, from the gal who took my order (and gave me the code for the restroom), to the barista, to the gentleman who helped other customers as I sipped away at my cappuccino. Friendly AND competent service is such a rare thing these days no matter the price point, so I appreciate the folks at Peets even more! Made the coffee taste that much better!", "author": "Janine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-12", "description": "Still enjoy the coffee, but I find it funny how the other Peets locations don't have the smoker issue. Sloat, Fell & Broderick ,Fillmore, Stonestown, San Bruno/Mollystones and the ones that do the people at the very least smoke 3 car lengths (Not width) away, Geary,So city/grand ave. Have not tried West portal yet and I can only imagine the downtown locations where the stress level,nicotine and caffeine consumption are bountiful. Hey I was a smoker too, maybe just a more conscience of my surrounding one.", "author": "Tee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "So thankful this place is around, they are quick and efficient and I am not a coffee snob by any means but their coffee always taste rich and bold and made right!", "author": "Myra H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-07", "description": "Worst experience I have had at a Petes... i ordered a large iced white extra sweet (more white choc). He calls my name for the order and there is a small, so i tell him i ordered a large... the guy gets annoyed at me? Why? Idk his mistake takes my drink poors it in a large cups adds more ice and throws another shot in there. Ive worked coffee and there isnt the same amount of white chocolate in a large as there is in a small.  So i asked him if he was going to add the white chocolate he said he did... i just watched the guy make the drink he didn't. So now im annoyed and instead pf saying ill add more he tells me to try it.... so i try it and proceed to tell him that its not sweet... again he gets mad at me. Then with attitude hands it back and says well now there's 5 pumps... ummm thanks. Worst experience i have ever encountered in a coffee shop.", "author": "Chante M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "I don't like the area, but this place is definitely \na 5 star all the way to the top.. They have remodeled the place recently!!!!\nThe employees always  greet you  with a smile no matter what!\n\"you know I know\", I learned that smile is worth a thousand words\"\nwe can't  have a perfect day  everyday but I smile should be there. I felt that Peet's\nTrain their employees  better then( Starbucks- I think they are too good for their job, I can't see in their face...) I always check my on my IPhone  for the nearest Peet's .\nIf you ask the Peet's employees to change your order or \"add this take that\"will help you right the way.. This place is has been serving and keep it consistent  for 15 years.\n If you buy a pounds of Coffee they even offer\nyou a small taste of fresh coffee:) \nXxxIlove Peet's coffee..", "author": "Pedro D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-04", "description": "Asked for latte, got a cappuccino. (to go cup so i couldn't tell, and no time to fix).\n\nweak.", "author": "Tyrone B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "I love Peet's and this place is a a gem in the white bread country of a mall.  the folks who work here are pretty friendly and offer great customer service.", "author": "Princess P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "standard peets. nice people, very clean, good coffee.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "I'm a Starbucks person since I'm addicted to their Chai & Green Tea Lattes, but I have to say that the staff there is fantastic! They're always friendly and greets you with a smile. I've come here on several occasions and not once were they rude or unfriendly towards me.\n\nTheir banana nut bread and ham/cheese croissants are SO good! I just wish I liked their lattes more...", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "Great place to come study, though I do wish the tables were larger. Located in Potrero Hill next to the Safeway, which makes it an easy one shop stop. Very large parking structure so you'll never spend more than 5 minutes looking for parking.", "author": "Krish P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "Peet's coffee...what can I say, I'm a freakin addict! LOL. \n\nThis review is for the coffee shop. I must say that the employees at Peet's are wonderful. I've never had a bad experience. I'm always greeted with a smile and they remember what my usual order is. I love great customer service. \n\nThe only thing that I do not like about this store is the bathroom. I think if they  periodically checked in, cleaned, and restocked throughout the day it wouldn't be so bad.", "author": "E C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-19", "description": "After a quarter century of devotion, a few years ago I had to file for divorce. That's right; I was lured away by a new, sexy, and yes (Don't hate me) younger coffee roaster. And not just one. Seriously, there is sooo much good coffee in the bay area (Blue Bottle, Bicycle, Ritual, to name just a few), why blow your hard-earned on bilge? \n\nPeet's lost its mojo long ago. Bitter, over-roasted beans, and bad graphics all drove me into the cups of others.", "author": "Josephine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-03", "description": "This is a nice place to run in and grab your favorite espresso drink after running errands at Safeway or the bank.\n\nI am not rating the coffee, as Peet's is a chain and you should expect consistent coffee here.\n\nLocation is very convenient, so my rating is just on the store - there aren't too many tables to sit at in here, and because of the small footprint of the store, you are constantly close to the noise of the machines and chatter of the people waiting in line. If you expect to get some recreational reading done, this store's not for you.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "It's the Vanilla Latte that keeps me coming back, like a mistreated dog who *knows* that there are better, kinder masters but here the scraps are difficult to stay away from... AND I can do my shopping at Safeway, lifting my nose in the air as I walk by their in-house Starbucks, my Peet's cup held high like a banner of defiance.\nOh, Vanilla Latte, you are deliciously cruel, making me return time after time and making the bitterness of the beans almost tolerable...", "author": "kSea f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "I love this particular Peet's. One of the staff always calls me by name; another recognizes me and has a running conversation with me. The staff do a great job of working together to keep the lines moving whenever the store becomes crowded. The fact that there is lots of seating is an added bonus!", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "I have been coming to this Peet's Coffee from time to time. I always like their friendly staff, lots windows, outdoor seating option, and good coffee.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "I appreciate getting a coffee drink the way i request it, and time and again the one on 16th does just that-", "author": "Diana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-05", "description": "20 minute wait for a to-go carry out container of coffee!! Ridiculous !  I was later told to call in my order next time. There sure won't be a next time. This would never happen at Starbucks.  \n\nI put my order in , and the lady ended up helping the next twenty people (3 different waves of people passed).  It wasn't untill I got fed up and asked for a refund that I was presented with the filled container.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-04", "description": "Got a nice big cup of dark roasted coffee to go here.  After flying in from the east coast - caffeine levels were dangerously low. We pulled in - got the dark roast - added cream and one Splenda and I was good to go.\n\nThe coffee was incredibly rich, robust, full-flavored, and delicious! Best cup of coffee I've had in a long time and way better than Starbucks!\n\nLots of seating in here to hang out with friends, or chill with a laptop!", "author": "Neal E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "Despite some inconsistencies in service and shortages of baked goods - the coffee is consistently excellent!", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "I've been here several times and I feel so welcome. The staff never ever give me attitude like the staff at the Ferry building location do. \n\nOne of the staff even asked me if I was a Yelper since I had a button on my bag. I said, \"Yes, yes I am!\" I don't often review the chains, unless I'm really impressed, in love with the food or hooked on the coffee of course. I decided to give this location a review since it's local and they are always so nice.\n\nPeet's is so much more affordable and decent priced. I am addicted. Thank you Peet.", "author": "Lorrie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "FREE coffee for a WHOLE week for the CUSTOMER OF THE WEEK?!! i want to be customer of the week! \n\ni have to say, Peet's Coffee on 16th ave is one of the best. even though there are plenty of choices if you are craving for something to drink. ie. Jamba Juice (next door) & safeway (starbucks) but Peet's is always the best choice for something warm or cold. \n\nFast, efficient and friendly service especially one of their workers name Peter who makes the best coffee. thank you!", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-29", "description": "I've been drinking Peets for years. It all happened when I first worked at a Peets during high school and learned all about coffee. Let me tell you, you pay for QUALITY with Peets. Although when I worked at Peets, they didn't carry the syrups and caramel and all that junk but I guess competition with Starbucks has grown. Even they do make flavored coffees like Starbucks, it doesn't taste like sugar. It doesn't distract from the actual flavor of the coffee itself. The staff knows what they're doing and can answer almost any question you throw at them about their coffees and teas (this is due to the training they receive and I would know first-hand)\n\nThe location of this Peets attracts a wide variety of customers. It's not full of yuppies like the Laurel Village location (blech..the one I worked at) thank goodness...Customers here are pretty friendly as well. I appreciate it when other customers are not grumpy just because they haven't had their caffeine fix yet.\n\nI waitress at a restaurant across the street from the plaza this Peets is located in and let me tell you, I would not be able to carry out my all day and night shifts without the excellent barristas of Peets (especially this tall Asian guy named Peter. He makes excellent drinks and always remembers that I want low fat milk and no whipped cream WOOHOO!) The staff here is always friendly, they almost always have smiles on their faces, and I will continue being a loyal patron!", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "The morning crew is awesome! John and Peter are super cool. This is the best Peet's!", "author": "tina M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-19", "description": "It pains me to give a Peet's location a mediocre review, but they served stale and solid citrus bread and forgot one of three coffee drinks.  On top of that, the restroom was unpleasant and poorly stocked (e.g., empty soap dispenser).  I have to give them credit, though, for replacing the citrus bread and providing the missing coffee drink without a fuss.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "Ain't nothing better than a cup of drip coffee from Peet's!!  \n\n- BOLD\n- Flavorful\n- GOOD, VERY GOOD!\n\nSometimes they have different types of house drip coffee and they are all good.", "author": "Kenneth Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-06", "description": "Might have good strong coffee but if your like me you drink a lot so you'll have to use the rest room but don't do it there shit all over the place red stuff around the ring not a good place to have an emegency", "author": "Todd B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "Thank you Peet's for giving me such a BIG list of teas to choose from!  I am on my 8th day of NO coffee, and Starbucks teas are pretty lame, in my opinion.  \n\nYesterday I tried the Jasmine Fancy.  It was pretty good.  Today I tried the Gunpowder Organic, which tastes like a mix of hay and dirt....but it's fun to try different ones anyway.\n\nI'll probably be back tomorrow...tea update to come!", "author": "Anna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "Boy has this place gone downhill!!\n\nPeet's used to be the gold standard for customer service.  Not here.  Went for coffee Labor Day afternoon - staff was surly and distracted, disorganized, made us wait a long time.  Not good enough, Peet's.  Shame on you.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Despite its shopping center location, this store manages to usually be a relaxing and comfortable place to sip a cup of tea or coffee, and to read a book or do some writing. The soundtrack of classical music typically playing is an element I've come to greatly enjoy, even though sometimes merely as a background distraction. I can sympathize that some of the employees occasionally get fed up enough with it to change to modern music, but whenever they do I usually end up leaving the store. There are far too many other cafes where the barista is allowed to program the music, and the music is terrible. But that's a digression.\nThis store has a generous number of indoor tables available, and even more outdoors. The staff are very efficient about keeping the line to the registers short, and several appear to enjoy their jobs enough to have stuck around for quite a while. It's pleasant to see familiar faces. Beyond that, this store upholds Peet's quality in teas and coffees, so I'll continue coming.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "This is a pretty spacious Peet's with a good amount of indoor and outdoor seating. The staff was  very friendly, and the latte came out perfectly balanced- not too milky, not too much bite.  If you're in the area and want a quick coffee break, this is a good choice.", "author": "Sonia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Really? Can you go wrong with peers? Crap just went wrong. Well greatest chain coffee shop.", "author": "Tiger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "Just a note to the management from your typical type A personality.  The locked door on the West side of the building losing you some business.  I and about 15 others in the past 10 minutes have tried to open it.  Ope, there's another one.  And she is confused on how to get in the store.  This is really annoying me.  Get it right!!", "author": "Nick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "I go to Pete's all over California and I love them. However, I can't say the same about this one. I have specialty order which every other Pete's I have been to fills cheerfully and kindly. (And I go to a Pete's almost every day) This place charges me a third more for it. And the manager is rude. \nI gave them several tries because other than the manager the staff is nice. Don't go here. There are too many great independent coffee shops in the Mission.", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-16", "description": "On those rare hot San Francisco days when all you can think about is iced coffee, it's great to see that places like Peets offer yelp check-in deals! My iced coffee craving was satisfied on a budget! :)", "author": "Karina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "Can't believe this location is not on here... so... I shall add it. I have been here a few times. I am not a coffee drinker, but my coffee crazy friends swear that Peet's is where it's at if you are going to do a chain. So... I walk in here from time to time to have some of their coffee or tea with more than just coffee... I know... I am defacing the pureness of the coffee. But hey, the drinks are really good. The coffee is of great quality, the teas are great too. And the service at this location is good too. I have had some of the folks there craft drinks for me with a twist and their have always been good. I remember having one where a bit of coconut rum would have been heavenly, but then I suppose I was not at a bar... oops! LOL \n\n5 stars for you Peet's in Potrero Hill. :)", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-20", "description": "The Best Peet's I have ever gone to.  Extremely friendly staff-always.\nFast Service and they always have what I want.  \n\nPeet's headquarters should use this branch as a training center-I get frustrated at so many other Peet's as I always recall the outstanding-fast service that I get here-please Keep it Up...", "author": "Capra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "I've been to many Peets in the city but this is the only one that stands out to me. While the other Peets near Bed Bath & Beyond made me fall in love with the Iced Caramel Latte but the excessive wait time for my friend's drink makes me never want to go back there. The cashier in this Peet's was friendly and comfortable to talk to and the drink was done in a timely manner (within 5mins of ordering) and taste like it's suppose to. If I ever go to the Potrero area I will definitely drop by again.", "author": "Annie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-08", "description": "This place gets my order wrong at least 30% of the time. Their coffee is burnt-tasting and terrible. I asked for a decaf coffee today. I definitely did NOT receive decaf, because now I am in my office shaking uncontrollably and just vomited in the bathroom. Thanks a lot.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "It's got parking, the line goes fast, the workers are always chipper but not annoyingly so. The coffee is better than Starbucks, and they don't use annoying terms like venti, but instead keep it real with regular named sizes like 'large.'\n\nIt's not a bad place to sit outside, have a cup of coffee, read a book, and amp up for a workout at the gym downstairs.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "I love this place!!\n\nIt does get VERY crowded in the mornings, especially on weekends, but I usually am lucky enough just to miss the rush.  \n\nOne time, my order was taken, and I was waiting about 20 minutes.  It was very busy, but there hadn't been that many people in front of me.  Finally I go up to the counter and ask how much longer for my order?  They realized that my order had been skipped over and apologized profusely!! Not only did I get a refund, but the manager (who is a total sweetie) gave me three complimentary coupons!!  \n\nI don't know about the rest of ya'll, but nothing makes my day better than freebies!!", "author": "Marley E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-14", "description": "The coffee culture is lost on me.\n\nLet us start by discussing the fact that I don't really drink coffee - not in the traditional sense. I remember there always being a pot of coffee brewing at my grandparent's house. They drank it at all hours of the day. With breakfast, lunch and dinner -  \"It's after 6, let's switch to decaf!\" It grossed me out. They were also chain smokers, so what did they know? \n\nThen, when I was in high School/college the coffee culture hit America. Starbucks became a household name. On every corner you could get a decaf, soy, no foam, Brazilian-roasted, caramel mocha chocalata - WITH ROOM (What the hell? Room for what?) There were no less than 20 coffee shops within a 5 minute walk from my dorm room and all my mates seemed to spend countless hours at them sipping one coffee they paid 99 cents for. How does this business model work?!?!?!?!\n\nWell, it just never gelled for me. Why would I want to spend hours in a strange place working? Too many distractions thank you. GO HOME! DON'T YOU PEOPLE HAVE HOMES!\n\nBut just lately, I have started dipping a toe into the world of the magic beans. Every morning before work, I stop at Peet's coffee and order a iced latte (Order an iced latte in Italy and you're gonna get milk over ice). It's good, it's not too strong and it gets my lazy ass going.\n\nPeet's has good coffee (so I'm told) but the way they run this place seems wrong. They have 2 cash registers going all the time. The line moves VERY quickly. BUT BUT BUT BUT they almost always only one barista. SO that means you have to wait FOREVER for your coffee. It just doesn't seem efficient. Why the rush to get everyone through the line just to have them clump up waiting for their drink?  And I do mean clump - there is no room in this place. \n\n\"Can I get a pretentious, hipster, organic, free-trade Peet's Coffee - WITH ROOM?\"\n\n3 stars.", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "I like Petes but this location seems to have really high turnover in the staff.  I go there almost every week and hardly ever see the same barista twice, which takes away from any neighborhood feeling the place might have.", "author": "Joyce J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-09", "description": "COFFEE!!!!!!!!!!!\n\nThe staff here are really cool and super nice.\n\nI came here recently to get lots o coffee to go for an event and they had everything ready in like 10 minutes.", "author": "A P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-09", "description": "Maybe if you are already shopping here and in a rush try this Peet's.\nThe employees don't understand coffee and have to resort to asking their manager how to properly brew French Press. Hint: French press should not be left warm sitting in it's pot for much more than 10 mins. The screen does not prevent overextraction and bitterness. It's a liquid, duh!\nThe water passes thru the screen at the bottom... HELLO.\nhttp://whatscookingamerica.net/Beverage/FrenchPress.htm\nInstead try the Coffee Bar (1890 Bryant Street). The closest decent Peet's with parking is at 555 9th St", "author": "Kirk W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-14", "description": "I don't come to this Peet's very often (out of the way) but it's OK.  I've always gotten good service.  They recently remodeled and the bathroom is very nice.  They also put in more tables, I think.  I remember going in last week and seeing this little pod of about 9 tables, three rows deep, all with people seated at them.  I don't know how the people managed to get to their seats, they were really crammed in there!\n\nThis Peet's is in a mall that has a parking garage underneath, and outdoor surface parking on the Peet's level.  It seems to be always sunny, and there are always lots of little street sparrows hustling for crumbs.  There's lots of outside seating.  They keep the Peet's pretty clean, even though it's heavily trafficked. You're basically a few feet from the parking lot if you sit outside, but I find it pleasant enough.  There are large planters that serve as physical and visual barriers.  It's not as upscale as many Peet's in \"better\" neighborhoods but I like a little local blue collar flavor as an antidote to all the yuppies who patronize the other Peet's.\n\nBe warned however, when you sit outside, the ground actually bounces with the traffic coming and going.  Yes, BOUNCES.  I don't know why - I hope it is part of intentional design, to diffuse stress.  However without knowing for sure, I would prefer not to be there in the next earthquake!\n\nThis would be a four star review except for my experience today.  I got an iced mocha.  That's like a hot mocha except (a) it's over ice and (b) they don't steam the milk, they pour it directly into the cup from the milk carton/jug.  I have gotten many iced mochas, hot mochas and mocha freddos from Peet's over the years, hundreds in fact, and they have all been fine, except this one.  First sip, it tasted \"different.\"  But not enough that I went back in.  So I drove off.  A couple of miles away, I took another sip and realized what I was tasting was spoiled milk. I sniffed the mocha and it even smelled like spoiled milk.  So I stopped in at another Peet's and they said they'd call Potrero Hill to let them know, and they made me another mocha, which I appreciated.\n\nThe thing is, Peet's does VERY high volume with their espresso drinks, so I would expect them to go through a half-gallon jug of milk in less than a half hour.  How does milk spoil when it goes pretty much directly from refrigerator to drinks?  Not good.", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "Ice cold coffee, ice cold a/c, what more can you ask for after a great workout!  This location is nice because its right by the gym, there is free parking (in SF!) and they were quick.  Yay Peet's!!", "author": "La C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-27", "description": "I'm almost back to my normal work existence and my commute to work is also normalizing. I used to go to this Peet's when *$ didn't have parking. I didn't really care to go here because when leaving, I have to make a left on 16th to get on Potrero. I also didn't like the drivers and the occasionally full parking lot. \n\nBut I think I'm going to risk daily accidents on 16th to get my Peet's Coffee. The service is wonderfully refreshing! The coffee is perfect. And I love the banana bread. MMmmmmmmmmmmm............  It's moist. It's nutty. It has a perfectly browned crust.", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-05", "description": "So it's almost a year later and I thought I'd review this Peet's again!\nMy original comments about the service still stand. It's really some of the best customer service I've EVER experienced, and I experience it EVERYTIME I GO TO THIS PEET'S, NO JOKE.\n\nI come here in the morning for a thermos full of coffee. The staff is always so nice and they have excellent customer service. \nAt this point I don't even have to tell them what I would like, they just grab my thermos and fill it up! Seriously, Peet's beats Starbucks by a million times... And I'd say this is the best Peet's I've been to in SF...\n\nOH: and the Scottish Breakfast looseleaf tea is delicious. I go through a ton of this stuff....", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-26", "description": "The acceptable, no, exceptional face of corporate coffee.\n\nThis is my local Peet's and lives up to the high standard (we won't talk about the ones at SFO).  First off, their espresso machines are manual and not autobotic ones.  Secondly, you know the date that your coffee was roasted and it only has to cross the Bay Bridge from Berkeley to find its way into your cup.\n\nI get coffee from here almost daily and I'm disappointed that I have not been chosen as their \"customer of the week\" as I do believe I embody the Peet's spirit (whatever that is), oh maybe that is why I didn't win.  Anyway, I'm not bitter and neither is the coffee.\n\nMy only criticism of Peet's is that they vary the bean they use to pull espresso and some of them are frankly not suitable for the method.  I believe a good espresso blend should be stuck with as the extraction process does not lend itself to the fruitier coffee types.\n\nThe staff here are really nice and they even remember my name, I've never had that in a Charbucks!", "author": "Tony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-16", "description": "Peet's stop #4.\n\nThis Peet's is essentially the museum cafe for the San Francisco Museum of Suburbia, AKA the Potrero Center.  Seriously, I can't think of a better example of a strip-mall in the city: they've got Ross, McDonald's, Blockbuster, even a Boston Market.  So as you can imagine, Peet's is the only place I'm likely to review here (I have been shopping at Old Navy, but...nah).\n\nAnyway, not only does this Peet's front onto a parking lot, from the street it looks like it's actually part of Safeway.  But no, it's a real stand-alone Peet's, and a decently designed one at that.  There was a surprising amount of neighborhood-y chit-chat and bustle going on inside, too.  Plus, kudos for having a patio out front, carved out from the parking lot thanks to some potted plants.  In true strip-mall fashion, it's shared with Jamba Juice, Noah's, and...Radio Shack.\n\nI decided it was time to test out Peet's Chai Latte.  The result?  They got the basics right by not overdoing the chai flavor or the sugar.  But my quest for the perfect chai latte is still unfulfilled.  \n\nAlso, this was my first morning getting caught in the rain on my bike, so bonus points to Peet's for getting the sun to come out while I finished my latte.  And I was even able to see my bike from the window, and ward off all the would-be bike thieves (whoever they are) with my paranoid glare.  White-haired old Asian guy, I'm looking at you.  And you, lady with the baby stroller: keep walking...keep walking.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-24", "description": "I love Peets's, but the customer service on Sunday sucks big Time! \nI said big TIME! \nIf you want to repeat your order 4 times till they understand what you want and then to get your LARGE decaf cappuccino - only one shot decaf coffee-  after 15 minutes, then go there on Sunday!\n\nThe place was empty and the queen at the coffee machine was pouring the milk foam by spoon for 15 minutes!!!!!!!!!!!!\n\nI don't like mean customer service and this was my experience! \nSo sad.", "author": "P.H. D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-27", "description": "Not as good as other locations. Bathroom smelled like the tenderloin and made me lose my appetite, and was plain and cheerless. Took 20 minutes to get the internet to work, restarting my computer multiple times. I never have problems other places. Walls were beat up and needing paint in numerous spots. No outlets for laptops. I asked for 'a little' whipped cream and it was practically overflowing. I had to wipe most of it off because the amount was ridiculous. The staff were nice enough though.", "author": "Heart T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "I think that Peet's is the 2nd best cup of coffee that I have had here in the bay area/SF.  The first being Blue Bottle however I thicken that BB is overpriced and you won't ever see me spending almost 4 bucks on a small cup of Joe, unless I am at the farmers market in which case I am already in a kind of a spendy mood.\n\nThis location is the Potrero Center location with a Safeway a Togo's and a Ross.  There also always seems to be some colorful characters hanging out around that shopping center.  This is the Peet's that I usually go to on the weekends when I either A) am on my way somewhere or B) I don't have any coffee at the house.\n\nI will agree with another reviewer who said that the employees can be a little... distant, however I don't care.  It's Peet's they hire stoners, no big deal.", "author": "Anthony Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-28", "description": "Everything ends, and so did my love affair with Peet's on 16th, in the Potrero Hill Mall, next to Safeway.  I'd been a regular for 15 years, sometimes twice a day. Most of the staff called me by name. But everything changed after they remodeled. Suddenly my friends were gone (Muse!), replaced by servers who could care less about me. I always order the same thing, but they never remember. Gone was their policy of giving a free cup of drip, if you were made to wait for more than a minute for it. Now they ditch you for the guy who's ordering beans. It's not unusual to find 5 staffers behind the counter, and only one person taking drink orders. Give up, and walk over to Starbucks in Safeway. The atmosphere in Peet's is, frankly, tense. The tables are often dirty, or filled with cranky senior citizens, who never leave! Worse, today one of them argued with me over a seat at the window. So sad. Escape to Four Barrel Coffee on Valencia, talk about tasty! There's usually no waiting for a pour over, and if you're gong to pay top dollar for a cup of drip, you might as well have it hand crafted. Enjoy!", "author": "John Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "The place where everyone knows my name...\n\nI have to say I love going into this Peet's Coffee for the excellent customer service and ambiance.   As soon as I walk in the door one of the staff starts making my favorite non fat latte before I even order (gives me the warm fuzzies).  They know me better than I know myself.\n\nThe staff took the time to really educate me on real organic coffee, french roast, and different kinds of coffee.  They made me a true coffee snob.  I am on a mission to educate the rest of the world.", "author": "Heidi M. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "well, what can I say.  I v'e gone to the dark side, dark roast side that it.\n\nPeet's coffee is so rich, full bodied, and after drinking it for 2 years now, makes Starbucks taste like piss.\n\nI am ruined for life,  thanks Peet's.", "author": "Ken p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-15", "description": "of all the coffee shops i've tried this is the first coffee place i didn't order a coffee at, because it's really hot outside and i know one day ill try their coffee when the sun is not shinning outside.\n\nanywho,\ni tried the mango tea frodo. i love it.\nit was blended mango iced tea with whipped cream.\nthis place has a separate side for orders to go\nand\na side to order coffee for at home use.\n\nit wasn't crowded when i went, service was good and it was clean.\nit also has a nice outside seating area for sunny days to come.\n\nill be trying the house blend iced tea...it sounded really good.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-23", "description": "Not rating Pete's coffee but Potrero location. I used to go there everyday but now I try to just buy beans on the weekend. Overall the customer service is not good here. There are a few nice friendly people who work here but generally it's not the case. \n\n\nThe proper procedure for buying beans at this location is a mystery, One would think that you would go to the Bean counter and buy beans but often they tell you to other counter, then back.\n\nToday guy asked me at coffee counter what I wanted, i ordered and paid for coffee beans and coffee, told me pick them up at other counter. Guy at other counter said he didn't have beans need to talk to manager. I go back to first counter to talk to manager but she told me to wait , i took a seat and waited 'til she was done. I went back (coffee counter) to clear the transaction. While she was doing this the guy at the other counter said \"tell him I have enough for 1/2 lb\".  i'm 12' from him. \n\nI don't understand the bean/order/counter swap relay system or it's benefit and since I left without beans. I left pretty annoyed. Not sure i'm entirely clear why the situation annoyed me. I think it was probably cause the Coffee Bean guy referred to me in the 3rd person rather than deal with the issue and the fact that the manager just scowled when i talked to her first.  If this was isolated incident I would certainly be more forgiving but some version of this plays out about 1/2 the time I go there. It's made worse by the attitude of some of the people working there. \n\n1/23/2011", "author": "D R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-04", "description": "sweetie, please do not pour your issues into my cup of joe.\n\nhere ye' here ye'\nthe rotten bean in the bunch resides here.\nhow is it each and every time I have been to this establishment each and every time I have been disappointed.\n\nunless a firm reminder to, \"give me my drink on the blender...\"  is spoken, staff will circle confused while performing tasks that are never brought to completion.\n\ni have concluded to never frequent this place ever again.  too many opportunities to be disappointed.\n\nwhy? this is not tolerated.\ni'd rather give a near seattle-based joint business - never this place again.\n\npassing this place while shopping at the other shops is not going to be a pleasure, but why deal with the pain??? \na shame.", "author": "Benjamin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "I drank starbucks for years, until I tasted a Peet's white chocolate mocha!! The staff is pretty friendly and the location is nice. I recommend peet's over starbucks anyday now.", "author": "Y-vee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-18", "description": "I like Peet's coffee no matter what.  They are always strong and tasty.  But this Peet's also have really good service.  The baristas seems friendlier than other locations.  I asked for an ice coffee with little ice and they were happy to do it.  He even asked if it was the right amount of ice... i had asked for less ice...", "author": "Janet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "4.5 stars\n\nI like Peet's more than Starbucks (there's a branch in the Safeway next door). Starbucks doesn't have cold decaf coffee for iced coffee- they'll give you a song and dance about putting the hot decaf over ice.\n\nPeet's only keeps coffee for 30 mins and then tosses it. They also have cold decaf for iced coffee.\n\nThe servers here have always been super nice. On my last visit I dropped my iced coffee. They were nice about cleaning it up and replaced it, which was absolutely sweet.\n\nThere's indoor and outdoor seating. Indoors there's a little nook separated by a half wall to give you a little peace from the ordering line. It was VERY noisy when the barstools filled up and the coffee grinding was going on. The chairs aren't very comfortable.", "author": "KD D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-27", "description": "I LOVE THIS PEETS LOCATION: The people here are awesome!! Not only do they remember their client's names, they remember the drink as well - I literally would just have to pay and i'm done.", "author": "Oliver A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "I went to Peet's coffee shop today and the service was alright, but I think they can improve on making their customers feel more welcomed.", "author": "melissa g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-17", "description": "All Peet's are superior!!!  So, it's not really fair to just review this one.  But, really I just can't go through all of the Peet's that I have been to in the City.  I am just getting too old for all of that.  Since this is the one I go to the most; they get ALL THE LOVE!\n\nSeriously, I am all choked up here trying to express my love for Peet's with mere words.\n\nI ADORE CONSISTENCY!  I NEVER worry about the quality of my beverage or service at Peet's because it is always stellar!\n\nThey make the BEST soy lattes (special thanks to the guy at the California street location who leaves and espresso sunshine in my beverage EVERY time).\n\nThe Jasmine Lime Tea Cooler is just the BEST!\n\nEven the VEGAN SCONES are good and I am the biggest meat eater EVER!\n\nService at Peet's (even the locations downtown with long lines and pushy, impatient customers) is always quick and with a smile.\n\nThanks Peet's!  I appreciate you...all of you!", "author": "Karla F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-11", "description": "this place stinks. \n\nthe coffee is fine, but the place has a horrible setup. they are also slow and unorganized. personally I'd  take the starbucks in safeway over this place, which is sad since i usually like peet's coffee. \n\nBut not this one. Sorry Peet.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-25", "description": "i want to like peet's coffee, but there's just something off about their espresso drinks as well as their 'freddos' or whatever they call them...\ni can honestly say i don't think i've ever had a satisfying beverage from peet's and would just come here if i was thirsty and jamba juice next door had a long line...\nthe condiment bar is always filthy", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-16", "description": "I used to go to the Peet's in my office building on 2nd and Mission and then my new job allows me the comfort of this Peet's...which I must say is hands down better. The line at the SOMA shop was always long until I was about to fade. The staff, while friendly wasn't as amazing at the Potrero Hill barristas. I was shocked one day while ordering my tea and they guy asked me if I wanted it steeped or something, I wasn't listening and I just said...no it's to go thanks. Then he made my loose leaf tea but removed the leaves before he gave it to me. Perhaps it was because they had the time to actually make an impeccable cup of tea, but color me impressed. When I got my tea and was stumped by the lack of leaves he motioned to me and said that they typically brew the tea in a pot and steep it until it's ready then they transfer it to a to go cup. WOW! \nTry the Russian Caravan if you are a hard core caffeine freak who doesn't do coffee, it's as close as you can get.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "Nice folks, efficient service, the usual excellent coffee and beans.  It's not a place you'd really want to hang out, due to its strip mall location and somewhat sterile Peet-ish decor, but it's a great place to grab a cuppa while you're on an errand day.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-14", "description": "'excuse me, but could you add more water to this?'\n\ncigarette butts-roasted grounds- tastin rude ass axis of evil coffee.....\n\ndefinately not for a delicate flower(weak ass) like myself.", "author": "sHoo o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-25", "description": "I love going to Peet's in the morning especially before work! I use to be a Starbucks fan, But I guess I've been drinking coffee from there for 2 long, that it doesn't work anymore. But anyways Peets have stronger coffee and excellent service. The only thing I would say is that it sometimes takes too long. I guess because they make each one fresh! But I still go there every morning!", "author": "Renee Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "One of the few Peet's where you can park relatively effortlessly to get your coffee. There is even underground parking at this shopping center.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-27", "description": "This one is in my work hood!  Easy parking and friendly staff.   Much better than the Starbucks down the street.  Would highly recommend. But not the Peet's you want to go to to sit outside and enjoy San Francisco.  It is next to a Safeway in a business \"park\".", "author": "Jen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-19", "description": "What happened to having a little pride in what you do? Trying to be the best at what you do? They couldn't even make my iced soy chai right. I'm really picky about my coffee because I use to be a barista.....and I was a damn good one. Hence me having high standards for coffee and tea. I've been to this location before and had a decent cup of coffee but they really disappointed me today.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-09", "description": "Agree with Christopher about the SF Starbuck's thing. I arranged to meet someone at this location, but later realized there are only a few tables inside. Fortunately, it wasn't raining and there is plenty of outdoor seating on the scenic Safeway parking lot. (PS If you sit outside you will think that it is about to be an earthquake, but will realize that is just another special feature of the parking garage.)", "author": "Amy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-23", "description": "I briefly worked a block away and would stop at this Peet's every morning for a hot caffeinated beverage. They get bonus points for being open extra early (6am) and all the employees are friendly.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "I love Peet's in general, but I'm very partial to this particular location. First, it's close to my house so it's convenient to fuel up my caffeine before my hour long commute down to San Jose for work. The staff is great. Many of the customers (especially me) have one eye open and are surly in the early hours, but the staff here is unmoved and still presents a happy face regardless of the bedhead displayed by the customers. In particular, Marie (my favorite barrista) is always smiley, happy and a true joy at a ridiculous hour. These folks get high props from me. Keep up the good work.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-24", "description": "Why go to Starbucks when you can have Peet's?  Everything is better at Peet's.  The coffee is far tastier and if you have a question about the coffee itself the staff can actually answer you.  Unlike Starbucks, they don't keep their baked goods in a refrigerated case so the items actually taste like they're supposed to.  If the parking lot here was less of a zoo I would definitely get here more often.  I'd give anything for the Starbucks near my office to morph into a Peet's.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-25", "description": "Still hittin' Pete's when I run errands at Potrero Center.  And the baristas there are still slow, stoned, and friendly.  Yay Pete's.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "Its one of the reason's my smile is so big before waking up?  Is it because of my job? My job is okay and its a great blessing, but its my morning stop this Peets store that deserves the credit. Even though we get free coffee at work , Peets wont miss me? Heck no! My desire fore a good cup of coffee is too strong. I have my usual black coffee filled to the top. My favorite blends include is the Major Dickens blend( bold full of flavor) and Ethopian ( taste a lil like tea and coffee in one).    Praise God for this Peets located on 16the avenue.  My addition for Peets started during my previous employment with them at their downtown location. At that time Peets seemed was way too strong. Starbucks use to be my soure of coffee even while working at Peets. After a while It didnt' make sense to buy starbucks wihle working at Peets. That's the reason for my addiction. The deep delicious roastedness is amazing.\n.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-06", "description": "The Land of 1000 Leaks.  The cups, that is.  The coffee is better than Starbucks, but why is it I can't walk out of the parking lot with a cup of Peet's to-go, without it running all down my fingers?  Never mind trying to carry it in the car - fuggetaboudit!  I don't have this problem at Starbucks or Tully's - only Peet's.  I think the caps are the wrong sizes for the cups.  On the other hand, it's a good place to buy whole bean coffee.  As relatively mass-market whole beans go, Peet's is about the best.", "author": "Tim T."}
