{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Amazing! Fish was excellent, tartar sauce was amazing! would come back! Also some really good prices for the food quantity!", "author": "Russel R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "Gross! Resist the urge to come here, even if you're craving fish and chips. I don't care if you're drunk at midnight on Polk --don't go.  \n\nRazor-thin fillets of [fish type=?] in a bland tempura batter fried in oil that isn't the right temperature so you bite in and hot grease dribbles out. Not crispy: mushy.\n\nChips that are piping hot but rubbery--no crisp at all.  \n\nWhen you get a case of dirty grease cramps from this place, don't come cryin' to me because you've been warned.\n\nAnd the owners? They don't speak a lick of English, even from their own menu. This is not a chipper; this is a cash-only money laundering operation that involves Chinese indentured servitude.  Look it up.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "I like authentic hole in the walls but the fish burned my mouth it was so hot. Then I got a bad stomach ache and diarrea, which smelled so bad it was hard not to throw up. \nFood poisoning and stomach virus are usually the only things to make it come out at both ends. So I would say this place is one notch ahead.\nIn all fairness it's possible something else made me sick. I did have a milk shake at super duper burger too.", "author": "Rabbit A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "OK, the caveat, this place doesn't compare with Fish n Chips in Blighty, but - it's good enough, and the price is right. \nTakeaway chips  ...  homemade chip sandwich - melted marg dripping down your wrist ... Authentic chippies are a rarity here, why not do the supportive thing?", "author": "Hugh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "It's a total dive hole in the wall. But they fry your fish and chips fresh when you order. I really like that. I suppose this place gets hoping with a late night bar crowd but I usually go there for lunch and it's empty with no wait to order. \n\nBare bones. Expect no frills. But if you like fish and chips this is the place. Very reasonable prices.", "author": "Tim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "Always pass by, first time trying despite the mixed review.  $13 for 3 fish&rings + $3 slaw\n\n- Fish was juicy and tender, batter is light and airy \n- Rings were housemade (same batter), must add salt \n- Avoid the homemade cole slaw, diced cabbage & carrots w/ heavy coating of miracle whip", "author": "Dav K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Couldn't come to San Fran without getting some fish and chips. Found some mixed reviews on this one so I thought that I have to try it for myself.\nIt's a nondescript little cafe, with absolutely no airs or graces. The menu is up on the wall and as simple as day. Food is cooked right in front of you in a sizzling deep fryer.\nAll I can say is it was gorgeous, plain, simple and just like fish and chips from my home.  Lots of salt and vinegar and Bobs your uncle.  It cost $6.50 for 2 fish and a healthy dose of chips and an extra 25 cents for some tartar, tomato sauce was free.\nGreat place, good food, I'd definitely go back with friends.\nI gave it four stars because it has room to improve, just like everywhere else", "author": "Tony S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-26", "description": "The prices are pretty reasonable. It was $8 for 2 large pieces of battered fish and onion rings. Nots the batter is tempura-esque and they batter the onion rings in the same manner. The first few bites were really good but after a while it just tasted like the oil they fried the food in. My roomate and I felt pretty gross afterwards and had to walk it off. If I were to order again I'd probably get the fries and fish rather than the onion rings because I feel like the similar way they were battered made the dish an overkill.", "author": "Kalani R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Whenever I have a craving for fish n' chips, I ALWAYS come here. I've been patronizing this place for years. I always order the same: two piece fish n' chips with clams. I much prefer beer battered fish over the cornmeal type breading. My only call out with this place is that they seem to take the fish out of the fryer a tad too soon, as the batter could stand to get a little more color. Also, they charge .25 for tartar sauce.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "Divey but satisfies the craving. Onion rings taste good but may not feel great after 1 hr.", "author": "Urmila J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-01", "description": "My friend was craving fish and chips so we Yelped and decided to try this place.  My first impression upon entering was the heavy smell and feeling of grease and grime.  We had an order of the fish and chips & and an order of the fish and onion rings.  I understand that the items are all deep fried....but all the items, from the fish, fries and the onion rings were all extremely greasy and pretty flavorless.  I bit into the fish and expected to be wowed with flavor but could not find it.  The ratio of fish and batter was way off...75% batter and 25% fish.  It was a thin piece of fish surrounded by greasy batter.  Bring your own extra napkins as you are only given the number of napkins that are in your party.  It was used to absorb the grease on my food, and we were left with greasy hands when we finished our meal.  \n\nWe wasted $14 and left feeling still hungry, unsatisfied, and oily.  I will be looking elsewhere to satisfy my fish and chips craving.  I will not be returning to this place and cannot recommend it.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Very reasonable prices. Very simple place. Chips were very good and fish batter was also good. Eat as soon as you get it, else the batter will become soggy (which is true for all deep-fried foods).", "author": "Jay C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-26", "description": "Asked for chips well done. Soggy. No flavor. Fish: meh. Greasy. Service: poor. Silly, but the worst part was that the fish and chips didn't come with tartar sauce. They charged 25 cents for a tiny container. I can see charging for extra, but not including one with the $9 greasy fish and soggy chips? I won't be back.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "No frills: simple yet tasty fish and chips. I came in around 4:30pm on a Friday and it was empty. Ordered a 3pc and took a seat. A little while later had some fresh fried food in front of me. Was very hot (temperature-wise) and stayed nice and toasty as I slowly picked my way through. Tartar sauce is $0.25 extra but seems homemade so I'm okay with it.", "author": "Faith C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "I came here today because I was craving fish and chips. I generally support the mom and pop hole in the wall types of places, but this place had the tinest pieces of fish with really thick batter and everything was unseasoned, I initially ordered the combo plate, which has fish, fried oysters and shrimp, onion rings and fries. I do not recommend this place, no matter how long it has been open.", "author": "Adrian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Update!!\nThey now accept cash AND cards!! \n\nThis place has been here for more than 40 years and it is by far the GREATEST Fish & Chips I've ever eaten! This Yelp review should have been written 3 years ago but I've been busy and kept pushing to next day until today after I had some Piccadilly Fish & Chips, I HAD to write one :D It is a regular battered fish/vegetables fried in their fryer and no sadly they do not carry beer batters! I can't complain about their food because their fishes and vegetables is straight FRESH and it is amazingly delicious! You guys should try the mushrooms or the zucchinis because those are the juiciest! Mmm.. Yummy! Almost forgot about their scallops and oysters but they no longer carry oysters for temporary! Oh and Don't forget to salt and vinegar em' up! You gots to have it original styled English food especially if you want to eat Fish & Chips! I can no longer order Fish & Chips from other restaurants! Piccadilly, you have taken my breath away (:\nOn a side note, they have fried chicken too! Sometimes they have wings and sometimes they have the whole 4 pieces set which I love the most when it comes down to chicken. It is honey battered and the crisp on that is so unbelievable! Can't forget about their homemade Tar Tar sauce! Yes they charge 25cents for one just like how any other San Francisco CORPORATE Mc Donald's charge for their sauce! I mean I don't mind paying for a family owned restaurant but Mc Donald's?! I'll save that for their review. Hehe. It's really cheap people, I can NEVER understand people when they complain about how expensive it is but people it really isn't AND it is by far the CHEAPEST Fish & Chips joint! \nLast of all, parking is NOT easy over here! I mean c'mon it's Polk street! Try not to leave any valuables in the car because whoever will break into your car and your windows will be smashed! \n\nOh one more thing! They're CASH only!\n\nP.S.\nI honestly don't understand how people given such low ratings on this joint!! First of all, if you want a fine dine cuisine service and atmosphere, then goto a fine dine cuisine. This place is like any other family owned joints that you give service to yourself! It's SELF-SERVICE! How can you people be so disrespectful of this such lovely Fish & Chips restaurants because it doesn't suit your criteria?!", "author": "Isaac K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "This is a place that locals have always loved growing up in this neighborhood. Mom & pop shop with affordable prices. Their lightly battered fish is so delicious with their tartar sauce. One of the last standing businesses on Polk street that has been here for many years. Everything else on Polk is new and caters to a different crowd than it once did.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "As a British ex-pat brought up on this, I can say this is the closest Fish & Chips in the Bay Area to the great British staple. Better in some regards since they cook everything to order rather than have them stacked in the warming case above the fryer. I get home a couple of times a year and Piccadilly rates with all but the very best I've had. They have a authentic, classic 1950's fryer from Cardiff, Wales which only makes everything better. They will serve the \"scraps\" from the fryer (loose bits of crispy batter that come off the fish and are strained out of the oil into a scraps tray) if you ask for them. Adding these to your chips is the best since it combines the nice fluffy chips with a real crunch. Plenty of salt & vinegar and you have Fish & Chips worthy of the best classic fish bar in old London Town (or preferably further north). They do other things as well (as long as they are fried) but the F&C is the best!", "author": "Rob R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "This place is a mom and pop restaurant. We are surrounded with a lot of new pricy restaurants so it's nice to know that these restaurants still exist in the city. Basic menu and cash only.\n\nMy boyfriend and I ordered fish and chips and it was delicious! So simple but really good. \n\nI'll definitely come here again!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "I've been coming to this place for almost 20 years with my family. The fish is tasty and fresh as well as the chips. I finally come back after awhile and they take cards now. Yayyyy. Super excited about this!!! This is the only fish n chips that's legit in the city and family owned.", "author": "Roberta N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-28", "description": "Dirty little place with no atmosphere, no charm, no frills. Handwritten signs warning of a charge for tartar sauce. Really? You're going to charge for it? \n\nThe fish was OK, that was it. Unflavorful, boring batter. The fries were undercooked. It was a horrible experience. The only good thing I can say about it was that the woman who worked there, who was sitting in the back, said thanks as I left.", "author": "Penguin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "This was my childhood! My dad would take me here every now and then after school when I was still attending Redding Elementary (just around the corner:)). It's great to be able to revisit and reminisce in the flavors of present past and think about just how much my city's changed. One thing I'm definitely glad about is that this place hasn't changed a bit - still the same old fryer, cheap prices and of course, the same, amazingly delicious fish wrapped in newspaper. I love getting the 2 piece fish with chips to split with one other and I'll lather my fish with vinegar. The fish is always the perfect crispy goodness and balanced with really soft (not stringy or dry), buttery white fish. Of course, all of this goes perfectly with their standard wedge style fries aka chips :). \n\nThis place is quite the hole in the wall with very little fuss or decor. It's the place to go for a quick bite or to grab to go! :) Definitely recommend -- and if you're just feeling a snack, they serve their fried stuff a la carte for great prices too (1-piece fish at $3) - oh and they have a selection of other fried seafood and food as well! :)", "author": "Purnima G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "This place is the bomb! I don't know why it took me so long to try it out. There's never anyone there, so come give these guys some business! The owner is super friendly and nice and it's delicious!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-10", "description": "Been here way before the change in ownership. This is a no frills type of place w/ decent food. The fish is soft and flakey and they have quite a few combos to choose from. Prices haven't gone up too much. Still good and cheap eats.\n\n** The crab and chips used to be made w/ imitation crab but they changed it to crab cakes now instead. **", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-18", "description": "Sadly Piccadilly DIDN'T stand the test of time.  A once a vibrant little mom-and-pop restaurant serving quality comfort food in a blue-collar neighborhood next to a still standing elementary school today is no longer.  The original owners have long passed and their descendants took over.  I gather ownership changed again as a recent visit made it brutally evident. \n\nSummary: detestable food, service, and facilities.  Its a shack masquerading as a restaurant thats barely staying afloat.  If you don't want to serve quality food within cleanly facilities with a smile and can barely speak English, then why are you independently operating a restaurant in the U.S.?  Wouldn't be surprised to see their makeshift \"Cash Only\" sign replaced with a 'For Lease' sign come December.\n\nOne night, I brought my friend.  First, I tried to greet the folks behind the counter with a 'Hello' and handshake.  The woman/wife glared at me with horror as though I were ripe with disease.  I politely backed off as it was clear she didn't want to hear about my childhood visits.  She and her husband immediately snarled, \"No English! No English!\"  Fine.  We then eyeballed the fading menu.  We got the 2-piece fish and chips and an order of onion rings.  Now a vegetarian, I asked if they fried their meats separately from their veggies.  The man barked \"Fries here! Fish here! Onions here!\", firmly pointing to each deep-fryer.  Thanks for clarifying, Mr. Manners. I paid nearly $14 for it all.  As we waited for our food, we noted the restaurant's disgusting condition. \n\nThe floor and tables were greasy and dirty.  The closet of a restroom was dirty, tagged with graffiti, and dilapidated.  I had to feel my way to the light switch!  The smell of rotting grease filled the air.  Do they empty and clean their fryers?  Upon serving our food, their body language was stiff as they looked reluctant to serve us, the only patrons present.  Each piece of fish was next to the veggies.  To be safe, I asked the man to identify and confirm.  He barked \"This fish! This onion rings! This fries!\"  Even so, I clearly could tell otherwise.  My omnivorous friend was able to confirm my suspicions and told me the opposite.  When we both took a bite, the food was flavorless.  \n\nMy intuitions screamed louder every minute we remained.  Ultimately, I insisted we spare our stomachs, kidneys, and the night!  Although I wasted $14, I valued our friendship and wellbeing more.  I thanked the owner while telling him he could keep my money.  He snarled something in his native tongue as we headed for the door.  He should be thankful we didn't demand a refund.", "author": "Honest J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "I was just passing by and thought I would grab some \"chips\", fries for my American friends for the drive home. Place looks and feels like an authentic British chippy. Chips we great, would have preferred if cooked just a couple minutes longer but loved then none the less. Got the salt and vinegar to finish them off AND they are served in news paper as they should be.\nNext time when not driving will try the fish as well. \nNot much of a place to eat in but you can. Price is right as well, $3 for chips and they are real chips not the skinny French fry thing you often get.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-19", "description": "Pretty sure got food poisoning from here.  Also, everything except the fried oysters (the combo comes w/ three) was mediocre to really bad, especially the fried clams that were like rubber and basically inedible.  Fries and onion rings were standard issue tasteless frozen, fish was chewy, not tender.  I almost knew when eating this food it was not going to sit well w/ me.  Think probably they just keep using the same frying oil all day (or week???) and of course its going to be cross contaminated w/ everything they put in it.  Also, not a place to go if you want take-out in a hurry as they make every order one at a time and you will have a significant wait.  Since they don't have to-go boxes, be prepared for a newspaper wrapped presentation as well - authentic yes, tidy and sanitary no.", "author": "Rose B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "There is an assortment of food to eat on Polk Street, so while walking with my buddy we saw Piccadilly Fish & Chips and thought huh we should try it out. Our logic was out of all the places we walked by this one looked ghetto as fuck BUT it was open; so for a food joint in SF to look grungy and still be open they had to be doing something right.\n\nThe owner has been there for 53 years which solidified he knew what he was doing.\n\nFood wise the fish was cooked thoroughly and it had a nice crisp too it. The edges had more batter than fish but it was tasty. The fries were homemade as evident by the boxes of potatoes in the backroom.\n\nFresh out of the batter we salted the fish and chips and added a bit of Malt vinegar and some ketchup. It didn't bother me that we had to pay $.25 for tartar sauce because a 2 piece fish and chip was $6.80 which in itself isn't expensive at all.\n\nWill definitely come by again!", "author": "Stephen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-16", "description": "The fish is about 80% batter and ~ tasteless/frozen, quite possibly not Cod as others have noted but likely Tilapia.\nThe Frys are 'solid' - \nI wonder how often the owner/operator changes the fat in the fryer.\nHe's a cheery guy who has to deal with his fair share of nuisances coming in and out all the time you're there, but that shouldn't impact food quality etc. Cash only, and average-disappointing.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "Classic fish and chips. All food is made to order. I'm not sure if they take phone orders or not. \nIt's a small dicey kind of place. The food is good and fresh. They wrap it in newspaper. So make sure if you want it salted you tell them before it's wrapped up. \n\nCash Only\n\nParking is very difficult to find but I come here often and usually get a spot about a block away.\n\nThe owner cooks everything himself. Tartar sauce is 25cent extra.", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-07", "description": "If you like your fish and chips crispy and toasty Brown this is not the place. I don't think they had the oil turned up high enough. I won't be back.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-27", "description": "This is the worst fish & Chips I've had in a long time...\n\n-soggy and chewy batter\n-huge uncooked fries\n-you have to pay extra for tartar sauce\n-rude service\n-boring place with no character, no music, bland like the food.\n\nIf your specialty is fish & chips you better make sure you do it good: you need fresh cod, good crispy batter and decent fries.  This place had none of the above.  Big disappointment.", "author": "Monkey B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "Where's da fish? Somehow this place has mastered how to make the batter puff up big time around thin slivers of fish. We ordered the three piece fish and chips and on all three pieces, batter to fish ratio was more than 3:1. Fish was previously frozen, soft, and mushy. Also ordered fried oysters... poor value for the tiny size! Very disappointed.", "author": "Harry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "Place sucks. Over priced and the food was whack... McDonald's filet o fish was better... feel bad for the older couple trying to run it but it needs to be better for the business to keep up...", "author": "Dong H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Love this place, closest I can get to U.K. style Fish and Chips (or a Fish Supper as we say in Scotland).   Always freshly made so you know what you're getting, visit this place pretty much every time I'm in San Francisco for work...", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I went to this place tonight and I must say the fish and fries are yummy. It's slightly under seasoned but really good! The batter reminds me of tempura. It was light and crispy!! The cook is friendly and inviting! I'm definitely coming back!!", "author": "Yip J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "We made our first visit to Piccadilly this evening for an inexpensive, take-home dinner.  We both got two pieces of fish and chips.  And we asked for and were given little containers of malt vinegar.\nWe both agreed that the fish & chips were very good.  The fish was moist and the coating was crisp and not greasy.\nWe had a couple of quibbles.  It appeared that they used tilapia instead of the traditional cod.  And the thick-cut chips should have been more crisp.\nBut we will return.  Next time, I want to try the fried oysters with onion rings!", "author": "Philip C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-18", "description": "I love fish and chips, so maybe I had very high expectations, but I was very disappointed with the food here. The prices are great, and the owner is very nice, but the food fell flat. I do appreciate the fact that your food is made to order. No soggy food here. \n\nI tried the fish with onion rings, but the batter was way too thick. My food was also very bland. Even with the malt vinegar and ketchup, my food lacked flavor.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-12", "description": "Reasons To Avoid:\n\n1.)  I ordered the fried clams and onion rings.  The portion of clams was about the size a five year old could hold in one hand and consisted of 4 normal sized clams and the rest were tiny pieces of salty fried breaded...bread crumbs?\n2.)  The onion rings were soggy and under cooked, cold in the middle and the batter was \"white\" and flavorless.  How does a place featuring fried food screw up onion rings?\n3:)  They charged an additional 25 cents for tarter sauce (the container was about the size of a quarter).  Just plain cheap and ridiculous!\n4.)  The table I sat down at to eat was completely covered in a disgusting sticky substance.  This filthy layer of stickiness also covered the chair and the wall next to the table.  GROSS!\n\nIf you crave under cooked, flavorless fried food in a dining room that is dirtier than a truck stop restroom then this place is for you!  Otherwise, don't waste your money.", "author": "R.J. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-26", "description": "My buddy was getting his car cleaned after a friend yacked all over the interior so I decided to roll with and grab a bite while the job was getting done.  We wanted something really quick and simple and spotted a fish and chips joint about a block away.  I love fish and chips!\n\nWell, we obviously ordered their signature dish, which took about 10 minutes to fry up fresh in their big fryers.  Flavor-wise, I must admit they were a bit bland, and even with with salt and vinegar, it was kind of plain.  I was surprised that they weren't served with tartar sauce but found out later they have a great homemade version.  Why wasn't it offered in the basket?!\n\nThis is a no-frills establishment and it's just a single man working there.  Prices and service were so-so, but the lack of communication regarding sauces was a let down.  There are better fish and chips joints in the area so I'll try those first before coming back.\n\nFood: 6/10\n\nService: 5/10\n\nPrice: $$\n\nAtmosphere: 5/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-16", "description": "Under seasoned is how I would describe the food here. We got fish and chips, clams and mushrooms. The clams were the best part and I watched him pull then out of a boxed freezer package so they really can't be attributed to the restaurant. The mushrooms and fish were in the same batter, sort of halfway to pancake in thickness, slightly underdone, greasy and completely flavorless. The fries (chips) were also lacking any salt. The one star is given back for them being friendly and cooking everything made to order, which makes me think they are somewhat trying to do the right thing. \n\nWe are in this neighborhood daily and will not be returning, especially with the Kasa Indian food right next door.", "author": "Arshia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "GOT A CRAVING FOR FISH & CHIPS TODAY !  \n\nIt has been years since I have been to Piccadilly Fish & Chips, though back in the day it was always after having several rounds of drinks, & shots.\n\nToday though it was for Lunch ! \n\nWhat I love about Piccadilly is that the food is always prepared, and cooked to order , so i get to see the cook dredge each onion, and piece of fish , Yea I got an order of Fish with Onion Rings ,For me its Onion Rings over Fries every time.  \n\nIt was cool to just watch how careful , and meticulous the cook was at each stage of the preparation to prevent against cross contamination, and how he went back to the refrigerator for each order that needed to be prepared.\n\nThis was a To Go Order , so upon placing my freshly fried foods onto the paper  he then neatly folded the paper into a convenient package , and yes I got the Tarter Sauce , because I am not going to blink an eye at .25 , this is the same cost for a handful of minutes via a parking meter , or a public dryer , so for me it would be silly to skip on this finishing touch to the meal !\n\nAfter a short drive back to the office cafe, and grabbing a Sweet Ice Tea , I unwrapped my bounty and dove into Decadent Batter Dipped Onion Rings , and then my 3 pieces of Perfectly Cooked Batter Dipped Fish making sure to add a touch of the Sauce with each bite ,, \n\nIt was so so good , and an easy recommend for a lunch that cost less then $10-", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "One of the best Fish & Chips places I have been to in SF! And as a born and raised Brit I don't say that lightly. Down to earth place (very simple) incredibly affordable and brilliant service!!\nThe cod is brilliant and the chips are true English fat chips!!", "author": "Jalpa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-07", "description": "Overall it was okay. I don't know what these people are doing and I don't think they know either.\n\nThe fries were too greasy and undercooked. I felt like I was eating two tons of crunchy fried batter with a little pocket of wet greasy fish inside and a hint of cinnamon. I am not joking. Cinnamon. \n\nMy girlfriend got the Scallops and chips. The scallops were fishy tasting and scallops are not supposed to be fishy at all. She says she would give it another try. \n\nIt is a while later now and I experienced stomach cramps and loose stools. I don't think I will be going back. \n\nThe frying grease is most likely at too low of a temperature or too old. At a low temperature it does not burn as fast and you can use it to fry more meals but, it causes the issues I discussed. Soggy fries and soggy fish in a crunchy batter.", "author": "Morgan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "Have come here twice during \"open hours\" only to find them closed. Today it's 7:30 p.m. on a Wednesday and they are closed. WTF???", "author": "Hakim A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-30", "description": "Honestly I feel for the owners but their food is overpriced and terrible, super greasy the fish was way too oily. The fries were terribly cooked. I won't be returning to this place ever. No ac", "author": "Pala V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "This place is & always has been a favorite of mine. I don't live in the city anymore, but I try to come here every chance I get. It's a place that hasn't changed in a neighborhood that has drastically changed. They still serve your fish & chips old school style- wrapped in newspaper!", "author": "heather r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-19", "description": "While fish and chips can be found in many restaurants around the city, so far only 2 shops specialize on British-style fish and chips (wrapped in newspaper for to go orders, seasoned with salt and malt vinegar). http://media3.px.yelpcdn.com/bphoto/l80LT6GNlEvYL6r64qd8NQ/l This Piccadilly Fish & Chips http://media2.px.yelpcdn.com/bphoto/Pxv1WxEdoVF8lrWq3Os1aw/l on Polk, and Old Chelsea on Larkin street.\n\nIn the past I'd have said that the food at OC was better than PFC, but nowadays OC is usually understaffed (often running orders to nearby Edinburgh Castle Pub) so quality is not consistent. Both stores are related somehow because prices and menu options are identical, but they were owned by different Korean families (Kim's PFC & Kang's OC). Perhaps both families are related? don't know.\n\nSuper friendly Mr. Kim was no longer here on my latest visit. In September of this year Mr. Kim transferred ownership of PFC to the Kang brothers, owners of OC. They are currently remodeling the kitchen area inside.\n\nHours: 11am-11pm daily. Cash only.\nEvery table has salt and malt vinegar, if u want tartar sauce just ask at the counter.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "The place is kinda dingy and run down, but the fish and chips are awesome and the staff are friendly. I love this little hole in the wall shop.", "author": "Da V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-15", "description": "I had the fish and chips at this establishment it was OK you definitely didn't have the feel of generations at sea and the food spelled that out but it was adequate.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-10", "description": "My boyfriend is British, and we were craving some proper chips from a Fish & Chip shop, so we popped in here. He had been once before quite awhile ago, and remembered it being alright. \n\nThe place was empty. We ordered some chips to share. We saw a decent/average amount of chips go into the fryer, but then after a few minutes, another customer walked in and ordered some fish and chips, but they didn't put any more chips into the fryer!\nSo, I'm not sure what happened, but all I can say is for $3, our portion of chips was RIDICULOUSLY small. I mean, there were only about  8 fries. It was pathetic and we were upset.  He asked if we wanted them salted and malted, and when I walked over to get our order my jaw dropped at the tiny portion. We think the other customer got our other half of the chips, since no more were added to the fryer for his order. It was incredibly lame. The chips were merely average as well, and they seemed under fried. They were kinda mushy and gummy. I was not impressed by any means. \n\nI will not be coming back. \n\n1 star for having a Fish & Chip shop in SF, but come on? How are you going to charge so much? I wish I would have opened my big mouth and said \"that's it!?!\" instead of just being bitter and angry here on Yelp.\n\nCash Only.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Dude used his hands to grab and dip the chicken and pretty sure he just\" washed his hands\" with water.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-11", "description": "Got the vibes like from Kitchen Nightmares. Bland fish bland breading bland fries. Worst of all, it was all soft and not at all crispy. Not even a slice of lemon to help at all. Sorry. Can't recommend and won't be back.", "author": "Hill E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-01", "description": "It's okay, not great. Came for lunch yesterday.\n\nThey have the coolest cash register because it's so old.\n\nOrdered:\n-Combination (1 piece of fish, 2 prawns, 3 oysters, onion rings, & chips) http://www.yelp.com/biz_photos/haF3hGlqzeLYmNJ-0cq5yA?select=3RoLzVZApBAaiXP4fQ32nA I think this was a little under $10\n-2 pieces of fish with chips for $6 something...\n\nIf you order out, they'll ask if you want salt & vinegar & if you want it, they'll mix it in with your fried goods. We said we wanted it, I'm not\nsure if it made it taste better...actually, I think I prefer it without it.\n\nFor 2 people, it was a lot of food.\n\nFish & onion rings were a bit too oily. The oysters, chips & prawns were really good. The oysters had to be the best. Chips were nice & thick. Prawns were nice & crunchy.\n\nBF said it was much much better last time, this time it was just okay. I will probably venture out again and I hope it's a lot better next time. Maybe they'll get a higher rating from me next time. These weren't the best fish n chips I've had, had better in New Zealand. I'm sure there's a better place around here in the Bay Area, I'll have to find it. I guess that's my next quest.\n\nNot bad for about $16.50\n\nParking wasn't too bad. Lots of meter parking. Parked a block away in the residential area, I think so free parking. I think it was on Larkin, which is a block parallel to Polk St.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Fried food deliciousness in the best way! Fish, clams, and chips are my personal favorites. Everything was nice and crispy. The guy (chef, cashier, waiter, etc.) was super nice and friendly. \n\nI hate to say it, but with rents skyrocketing around the city, and a ton of places on Polk going out of business and moving, I'm not sure how much longer this old school spot will be here. Get some old school crispy deliciousness while you can!", "author": "Mirabella Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-02", "description": "I was in the mood for fish and chips (obviously) and was referred by a local. The inside is very minimal: few tables and chairs, eco friendly waste baskets, and a deep fryer. What more could you need? Apparently more than Piccadilly had to offer. :/  I ordered two fish with chips ($6.80, CASH ONLY) and waited ten minutes. The fish was greasy and heavily battered and the fries tasted frozen -- it was a big disappointment. If my two options were Piccadilly or Long John Silver's, I'd choose the latter! Also, why are Yelpers raving about the homemade tartar sauce!? It tasted funky.. and not in a \"funky-fresh\" good sorta way.\n\nPositive:\nPiccadilly wraps their fish and/or chips in newspaper. It definitely gives their food the personality its lacking.", "author": "Jennae H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-12", "description": "Made to order fried fish and onion rings. Add salt and malted vinger to them and taste pretty good.  Good price.  They have chicken, other seafood and fried desserts too.", "author": "Yue Wing C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "I agree with another,  who wrote that the chips taste frozen.   I ate one and left the rest.   The fish,  however is excellent.   Add some malt vinegar and Crystal, for the win!   I wouldn't bother with the tartar sauce if you're on the fence.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "This place is the best for reasonable and delicious Fish & Chips.\n\nAlways have a good and filling meal when I come here.\n\nService is prompt and friendly.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "The small one man shops have to be good if they lasted so long.  Seems this guys knows what he's doing.  Had the Fish and the Oyster with chips.  I would not say it was the best, but good for the price.  My husband and I want to try the crab (which is formed like mini crab cakes when we return).", "author": "Daphnie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-05", "description": "This place is truly awful. Just disgusting.\nI left my plate of fish n chips 3/4 uneaten.\nI have never had worse food.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "I had been wanting to try Piccadilly Fish & Chips for quite a while. What a disappointment. \n\nI ordered the 2-piece fish and chips, $6.80. Everything looked great, fresh fish dipped in batter and fried as you you ordered. Nothing sitting under heat lamps. After a short wait my order was up, looking great and served piping hot. A few splashes of malt vinegar and on to my first bite. Hot and crispy and perfectly cooked, but bland...very bland. Zero seasoning, zero salt on fries, not good. \n\nPortion size was very fair, pricing excellent, but it could make up the the lack of seasoning. I doubt I'll be back.", "author": "Dave J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Everybody please support this spot. I don't order fish and chips at most places because the fact is most places don't do it right! Picadilly does. I had to pieces of perfect fish and crispy chips.  Issac the young man who will be the owner one day was really cool.  He is proud of his family business and was exceptional in serving me! He told me about the 75 year history of the place and how his family took over many decades ago. Come on people this place is  a SF treasure.  Don't be afraid fried  food gets a bad rap but good food is good food. I plan to return to try other items soon.", "author": "Jose O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "We love this place!  Cash Only!\n\nThis place is such a go-to in the neighborhood.  The food is wrapped in newspaper, and the tartar sauce is made in small batches!  So it's totally worth the extra $.25.\n\nWe get fried oysters, multiple orders at a time. lol  Right out of the fryer, it gets hit with sea salt and if you like, with vinegar.", "author": "Isa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "I really like this place,  the owner is really nice and courteous and the fish is pretty good not the greatest but the best in this area.   \n\nGo with the onion rings instead of the fries though is my only recommendation.\n\nOh yeah and it's cash only,  always a minus in my book.", "author": "Carlos M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "This is a hiding gem! If you're looking for a good F&C place pretty close to what you would have in England, this is it! .What good about this place is the quality of the fish, its cod, good cod not pollock (that cheaper cod replacement fish) & the price! This is still very reasonable $$$ for the great quality fish. If you're in the mood for F&C, this is it! The inside isn't anything fancy and sign on the out side might throw you off but this is SF, the best place here look like this. Once you meet the owner, you'll understand none of that matters. Make sure to say hi, nicest guy in the world! He's the only  one that works there!", "author": "J M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-10", "description": "Charging for tartar sauce?! This is fish n chips, dude! Just raise your prices! It was also looking dirty and sorely needed ventilation. How this place is still in business is beyond me.", "author": "Cameron E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-13", "description": "I don't even know where to start. My first impression of the place was \"this place looks like a fucking laundry mat\". My friend and I walked in and it was COMPLETELY EMPTY. Like most reviews said, the fries were soggy and the fish was horrible. I understand it's cheap, but food shouldn't be this bad. Right off the bat, you can tell it wasn't deep fried enough. All you taste from the fish was old oil and batter. They charge 25 cents for tarter sauce, but the guy was nice enough to give it to us for free. I guess it's because we were the only customers for that month. Also, the sauce tasted like soap and Cole slaw put together. Yuck . Please save your money and invest it in food that is considered edible.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "Great place for lunch and a snack I highly recommend coming here. Their fish and chips is something I crave for and look forward to every time I go there. The owner is very friendly and everything's cooked fresh to order. Best fish and chips in San Francisco. Look forward to coming again.", "author": "Clayton L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-13", "description": "Had the 2pc fish and chips with a corn dog. Food was decent. Mom & pop were friendly. Overall A-OK!", "author": "Stephen Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-21", "description": "I've never been to Picadilly aka Frozen \"Vandekamps\" where the type of fish is unknown and the fries were frozen right b4 putting them in old grease & prior to that some potatoes were sitting in a bucket next to some trash..prices are lower online..never again!!! Remember the fish is prolly \"Boxed\" from FoodCo or the $1 store", "author": "Crystal B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-16", "description": "been an alltime favorite of mine for fish and chips for years....until now. they changed ownership and the place went down the toilet. horrible fish-no crispy coating like before. fries tasted like they come from a freezer case. the last owners used REAL potatoes!!!!!!. i will never go there again.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "When the elderly gentleman is working the fryer it is a joy to walk into the restaurant.  He always seems to be happy and genuinely welcomes all of the patrons as soon as they open the door.\n\nIt's a pretty basic set up.  There is an overhead menu (http://www.yelp.com/biz_photos/haF3hGlqzeLYmNJ-0cq5yA?select=7HDhwAft71dZpuahpp0VPA) that you order from, and I've noticed most people do take out.  I've always had my food there on one of the sturdy wooden chairs and wobbly wooden tables.  The restaurant has updated copies of the daily Examiner or the latest SF Weekly to keep patrons informed while they wait for their food.\n\nFor tonight's visit I had a 3 piece fish with chips (http://www.yelp.com/biz_photos/haF3hGlqzeLYmNJ-0cq5yA?select=lA-mFqLiaNIfdI-MA2Dm3Q).  When dining at the restaurant you have the option of adding your own salt and malt vinegar whereas for take out they'll actually add it for you before wrapping your order with a clean sheet of white paper with newspaper on the outside.  Tartar sauce is available upon request as it is usually stored inside the refrigerator.\n\nI decided to have my meal without the added salt, vinegar or tartar sauce for a change.  The fish is very good.  The choice filets of white fish are thick and firm and the crispy batter has just a tad of seasoning in it to keep it from tasting bland.  The chips or fries (because that's what they are) could be improved because no matter how long they sit in the fryer the outsides never seem to be crispy enough.  These are fat fries with lots of meat in the middle, but often I tend to taste the oil instead of the actual potato.\n\nIf you're not certain what you'd like to try Piccadilly offers a combination platter also.  The combination includes one piece of fish, two pieces of shrimp, three oysters and four onion rings all served over a layer of fries (http://www.yelp.com/biz_photos/haF3hGlqzeLYmNJ-0cq5yA?select=3p7MjyVby4e8IwjXltHA1g).  All of the seafood and the fresh rings of white onion are dipped in the same batter and put into the fryer.  While I enjoyed the flattened, butterflied shrimps and the mini oysters the hot, creamy onions just didn't seem to taste right when matched with the batter.\n\nI love the fried mushrooms too.  Friendly service.  Open until 11 PM on most nights.  Pay before you eat or after.  Cash only.  Maybe 3.5 stars but I've rounded up this time because the old guy's smile is infectious.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-21", "description": "First  and last time I will ever go there. The food was greasy and no seasoning. Undercooked and why should I have to pay for tartar sauce", "author": "Diangela D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-01", "description": "I really wanted to give this place a good review, but I'm afraid I can't. I ordered the 2 piece fish + onion rings.  You can't beat the prices, the ingredients were fresh, and it was made to order, super piping hot.  As for the batter, it reminded me of tempura batter.  Unfortunately what I got wasn't golden brown, light and crunchy, it was a sad pale yellow, heavy and mushy.  The flavor was way too bland (and I tend to not like salty), so I bought some of the homemade tartar sauce, which tasted great.  Maybe I will give it another chance to see if my first experience was an 'off day'.  I give it a 2 and 1/2 stars.", "author": "Lawree S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-14", "description": "I have one thing to say about 250 undercooked fries and the nasty ass atmosphere it sucks take me to come into the 2015 and putting decorations up that are nice looking paint the plates fix the ceiling get rid of tired ass coolers do something to make it look inviting and learn how to make french fries and fish everything else is OK but that fish you need to make sure that it's golden brown and not half ass to cook fish", "author": "Rick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "You're a greasy time Piccadilly Fish & Chips.\nI wouldn't have it any other way.\nI had a cola and and some deep fried potatoes and fish for a dinner I did not plan on and while it wasn't what I wanted it was something that made me think about life. The vinegar, ketchup, the tartar sauce, what do these things mean metaphorically?\nWhat are people thinking when they stare at me stuffing my face in the window seat?\nWhy wasn't i drinking beer?\nWhy The hell was I on Polk Street?\nWould I go back to Seattle for another visit?\nHow much sunscreen should I pack when I head to the dessert for a couple days?\nDoes my conga drumming make me a tool?\nDo fish and chips really have any flavor?\nShould I learn to operate a forklift?\n(feel free to answer these questions)\nThe employees were pleasant and made me feel welcome.\nI left a better man.", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-15", "description": "The people here are super sweet. I mean, I practically wanted to hug the nice man who took our order and gave us our food. Lovely, lovely man.\n\nSadly, the batter on the fish didn't quite do it for me. I guess I'm more of a beer batter kinda gal. Still, it satisfied my fish and chip craving and left me with enough room for dessert. Woo hoo!", "author": "Loli L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-30", "description": "Time to try a different Fish & Chips.\n\nThis is not the owners who cared about their business.", "author": "BigJohnS F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "They make their fish and chips onsite and it is the freshest I've ever had. I think they could fry anything up and it would taste good. I'm going to bring them a snickers bar, a twinkie the next time I go to test this theory out. \n\nP.S Eat it there otherwise it WILL get soggy and thus unappealing.", "author": "Norris T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-26", "description": "So disappointing. I wanted crispy fried fish and oysters with golden fries. Out of oysters:-/  Then the fish was fried in oil that was not hot enough, rendering the batter not thoroughly cooked and heavy-gummy.  As well the oil tasted old, not quite rancid but having absorbed too much oders. The shrimp were the frozen boxed kind, probably already breaded.  The fries might have been handcut however the oil temp being too low assured they were not cooked enough and bland.  The homemade coleslaw was a mixture of cabbage and some butter lettuce and had an overly sweet dressing with no balance of vinegar.  As my husband says, alors la, c'etait degueulasse. What a waste of $21.\nOh and we were sick for 2 days till it was completely out of our system!", "author": "Holly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Mmm, if you're looking for that Friday night feast I'd say this is the place to look! As many meals, this should be eaten on the spot - fresh & delicious! \nA con was that they closed before the time on yelp but was generous enough to make us the last meal of the day!", "author": "Nathaniel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-28", "description": "As a Brit I've been looking for decent fish n chips since moving here 2.5 years ago, and Ive tried a few places, and I have to say this is the best so far - hence the 5 stars. Its not as good as fish n chips 'back home', but it is damn near close. The chips are proper chips not fries, and the fish was really nice with crispy batter. Would have been nice to have one whole big piece of fish as opposed to the three smaller pieces.\nIt was even wrapped in newspaper and came with malt vinegar and salt.\n\nWill definitely go back again when I want a taste of home.\n\nI can't comment on the service or interior of the shop as I sat outside in the car waiting, but I know they did cook the fish fresh.", "author": "sarah s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "My husband and I went here the other day. My hubby is from England, and I've had my fair share of fish and chips across the pond and here. This is a small shop, and doesn't look very exciting. However, the fish and chips were really, really fresh. They hand-dip their fish here, and cut their own fries. The fish looked smaller than some places, but there was a lot of fish in there, instead of being all breading at the end to make the pieces look bigger. The fish-to-batter ratio was excellent! Everything was fried, of course, but not too greasy, and the food tasted fresh. Slap on a lot of salt and vinegar, and we were in Fish and Chip heaven. We both can truthfully say that we've never had better fish and chips that on that day. We few...we happy few...we band of fish and chips brothers...", "author": "Kimi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "This place is legit. hand battered fish that is lightly browned and cooked to perfection. this is a must eat! Oh and they only use fresh oil in their deep fryer!", "author": "Lawrence C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-04", "description": "Really want to like the food but it's terrible. Same nasty burnt grease from eons ago not at even close to cooking temperature, yet in goes my order. As it comes out ten minutes later, directly into the service container dripping grease from the basket all over. A single order of thick cut fries (chips) should take no effort. Here totally it was.", "author": "cereal y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "Stumbled on this accidentally (i.e. looking for proper food after a cupcake tasting competition -- long story ...) and was suitably confused and impressed in equal measure.\n\nAs a Brit who has lived here for a long time, I was really not expecting to find a place in the Bay Area that has the whole \"chippy\" thing down - i.e. none of the overpriced,  healthy nonsense you find in SF British/Irish pubs - but rather the heart attack inducing massively fried, gargantuan portioned, wrapped in newspaper and swimming in vinegar version that usually accompanies a night out drinking in the UK.  \n\nThey even nailed it with the decor, and the not entirely clean appearance of the place. It doesn't have union jacks and pictures of the queen everywhere, it just looks like your average random fish and chip place.   \n\nI'm not sure why it's here, but I like it.  I would give it five stars if they somehow added Chips & Cheese, Chips & Curry Sauce to their menu.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-03", "description": "Fish wasn't crispy at all. Literally only had one container of ketchup to pass between customers.", "author": "Alec B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-01", "description": "Food = good. It's fish and chips, requires a bit of grease but the flavor is good, breading isn't too heavy, and 'chips' are real potatoes!  Gotta ask for their tartar sauce.  Maybe I'll try their onion rings next time....\n\nService = non-existent.  Polite, nice but not exactly friendly.   Oh, and for whatever reason, this is the routine... order, wait for food, then you pay.  And it's cash only folks. Drinks are the fridge, help yourself too.  \nThis neighborhood leaves a lot to be desired but there is always good food around! ;)", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "Slammin, slammin and more slammin ^_~ not to mention beautiful people who run the place. I will always visit for the homey feel.", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "I  had the 3 piece fish and chips.  It was perfect sized for dinner.  The fish tasted like cod and was just like the fish at Mr. Fish and Chips.  It was very good for cod.  The fries were also pretty good.  It was nice watching the lady peeling potatoes for the next customer.  I'd rate them higher except Mari ordered the fried chicken and the center was cold on the first piece she tried.  Frying it again resulted in some dry chicken.  The cook offered his apologies and tried to make it right be giving her a couple extra drumettes.  I tried a drumette and it was pretty good.", "author": "Soo H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-05", "description": "Food was ok -- but the place needs to be cleaner. The windows need cleaning, plus the store front. More people will come if all of this area (Polk) street was cleaned up.\n\nLess bums and druggies in the area would be nice.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-28", "description": "Okay, I remember walking around  the former fishing village of Howth, Ireland with my ex boyfriend and there was something so grand about sitting on a bench on the stonewall pier, with the sea breeze blowing through my hair while munching on fried fish and chips drenched with malt vinegar and seasoning flakes in a little disposable basket and waxed paper.  Well, Piccadilly Fish & Chips isn't exactly the same, but the meal isn't that shabby either.  \n\nThe no frills establishment (with health code rating of 85 - see the wall) is absolutely what to expect of a hole in the wall fried fishery in the tendernob.  The menu is pretty self-explanatory and posted on the wall over the fryers.  The fish and fries are fried while you wait and delivered to you wrapped in newspaper.  \n\nThey accept CASH ONLY.  I would recommend dining OUT b/c there is very limited seating and honestly, it really is a HOLE in the wall. \n\nThere is tartar sauce, salt and malt vinegar...simple, simple, simple...it's fried fish (aiyah, my arteries must be hating ME today)\n\nEnough said!", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "Love this place.  Owner is super sweet and they batter and fry your fish right in front of you.  Try the combo to get a taste of it all. Have him salt it for you when he asks because there isn't any in the batter. Tartar sauce is yummy...and I like a side of coleslaw with it.", "author": "Patti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "Ok, first the confession... I am English, even more a proper northerner\n\nFish and Chips is a Friday ritual in my part of the world... a chippy tea is what Fridays were made for!\n\nSo onto the review, well it is never going to be as good as any seaside town in England, or any chippy in England for that matter, but on foreign soil this place is pretty good.\n\nWe shared the three piece fish and chips with salt and malt vinegar (very important in the world of fish and chips) meal between 3 people, admittedly we were not massively hungry but it was a large portion it would feed 2 people comfortably.\n\nRecommended I will be visiting again!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "I was really needing fish and chips.  I was in the neighborhood, so I went in.  The guy working there was really nice and friendly.  I really wish the food was as nice as the guy.  The fish was ok.  I got 3 smallish pieces of fish and a decent amount of fries.  The batter was very light and was not oily.  I like a heavier, more British-style of fish and chips.  It wasn't bad, but I just wanted something more.", "author": "Funk G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-31", "description": "Have gone here over the years, and although the staff there are very friendly, the food is just average. Having eaten Fish and Chips all over the U.S. and the U.K., it leaves much to be desired. I did take out and ate the food with a friend at the street outdoor park near the Quetzal, and was sadly disappointed. They also charge 25 cents for each container of tarter sauce, which also was a disappointment, although I do realize that costs of food is rising, still I have never been charged anywhere for a condiment. Word of advice, when you do take out, and you finally open the paper package, the steam from the food takes the crispiness out of the fish and makes the french fries soggy. I also think they should \"double fry\" the fries for a better \"chip\"...Just saying..", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-23", "description": "I am an sf native and have wanted to try this place for quite a while. \nThe fish was the most nasty breaded mess..I told the guy I'm sorry but wanted my $ back..it was that horrible.  I was shocked and surprised. He was upset and rude but you know what I love fish,  and amazed these people are still in business. . The most flavor less food on planet earth", "author": "Athena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-12", "description": "Niece and I landed here before we head out to the East Bay to watch the Warrior's play @ Oracle Arena. (Yes, she was wearing the appropriate gears).\n\nWalking in to this small takeout place with few seats, the sweet Korean family noticed us walking in with our colorful Warrior's apparel. And with the continuous frying action on the fryers, our clothes did indeed smell like a fried fish. You can easily tell that the food fried here are fresh.\n\nWe split an order of the 3 pieces English-style fish in a basket. The $7.50 meal had 3 pieces of fish fried with halibuts and a large batch of fries. The piping-hot fishes and fries were very fresh and complimented very well with the tartar sauce and the sour malt vinegar. We also bought a can soda for $1.00 each. \n\nNiece bumped into one of her friends and orders her food to go. After her friend and I were formally introduced, I saw that all meals taken to go are wrapped in a newspaper. And believe it or not, it was the comic-section from the San Francisco Chronicle. As they were chatting, I was reading the Peanut's comic on her wrapped food, where Snoopy was sleeping in the same bed with Charlie Brown. Later, CB kicked Snoopy out, because of the dog's loud snoring. Then, CB gave Snoopy another chance. And it was CB's turn to loudly snore. Finally, CB was sleeping on top of Snoopy's dog-house. What a cute way for a fish meal wrapped up!\n\nAlthough the fried fish was a little bit greasy but tasty, the hard-working Koreans ladies were very nice, despite being on busy Polk St. This place is a cash-only place.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "BLIMEY! ...Ahre we back near me flat in Kensington? I miss my mum's black pudding 'n just good old bangers 'n mash, mate. But I found me some ace fish 'n chips 'ere in the colonies and...\n\nOK, I'll stop ...since this place doesn't look anything like a London pub...it's just a non-descript place in Polk Gulch right next to the newly relocated Tajine, my favorite bargain Moroccan eatery. But if you're jonesing for some authentic fish and chips, this is probably the place to go in SF.\n\nFor $5.90, I had two good-sized pieces of fish with chips. The fish was a bit bland, but the crusty covering was really crunchy. It went well with the homemade cole slaw that they stock in the fridge. All sorts walk into the place, but you can count on the incredibly courteous Chinese couple to treat everyone equally. And I found that more refreshing than the food.\n\nSo gov'nor, if the weather is a bit parky and you fancy some pub grub, Picadilly doesn't quite take the biscuit, but it's worth dodgin' the wankers on Polk for. \n\nFOOD - 3.5 stars...hearty portions of fish and chips made on the spot\nAMBIANCE - 3 stars...glorified lunchroom\nSERVICE - 4.5 stars...a really nice owner goes a long way\nTOTAL - 4 stars...where else in SF can you get such bargain-priced, homemade fish 'n chips?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "A traditional fish & chips place, awesome food - and a great place to people watch. My favorite thing is to put both the malt vinegar and the delicious tartar sauce on my chips. The tartar sauce does cost extra, but it's well worth it. Your meal is wrapped in newspaper for a more authentic feel. It's cash only - so be sure to hit the ATM before you dine.", "author": "Paul R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "All you need to know is that this is the BEST place for Fish and Chips. 'Nuff said. (This place got a TWO thumbs up from an old friend from England. She prefers this place to any other she's been to away from her country. Fish and Chips are one of her favorite treats.)\n\nAnother one of my go to places that has not changed....20+ years is it? The taste here has been the same as I remembered it. This place stands out from other places I have ordered fish and chips from. Is it because they use peanut oil?\n\nIf you're thinking \"this guy is nuts!! Camelot (Pacifica, CA) is THE place for Fish and Chips!!\" then you might be (sorta) right...Camelot is (or was) a good spot. I used to frequent Camelot often, but the last time I went there (about half a year ago) I was disappointed. Something about the fish was off...taste was not there maybe? (What I do like about Camelot is that they have Cock 'N Bull ginger soda) \n\nWhen going here, don't expect a nice place serving beer battered Fish and Chips. This is a classic hole-in-the-wall/greasy spoon type of place. Don't expect healthy anything here...it's a FISH and Chips joint people!....everything here on the menu is mostly fried. Also, parking can be tough in this area. (If driving, you should probably call in your order, and have someone with you run in to pick up your order while your car is parked in somewhere you probably shouldn't park.)\n\nWhat I like to do: order a three piece fish and chips with extra malt vinegar and salt for pick-up (maybe an order of fried mushrooms also), go to a nearby market and pick up a good ginger ale, and head to Crissy Field for a picnic. Enjoy! =)", "author": "Paolo V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-24", "description": "This was a great place some years ago but today is simply quiet awful.\nLots of grease and more grease - and tiny amounts of fish. Do yourself a favour and go somewhere else.", "author": "Robin O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-20", "description": "This place changed, and not for the good... thumbs WAY down.  Such a bummer when good places go bad.", "author": "J B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-26", "description": "Exploring Polk Street, I made a mental note to try this place since I do love a good batch of Fish & Chip.  Walking in, I was a bit disappointed.  It's a depressing looking restaurant and the bathroom was pretty scary.  You go through a dark hall (no idea where the light switch was) and then the bathroom was pitch dark.  Had to feel the wall for the switch.  Turn the lights on!  The customers would appreciate it.  It's a cash only place and they wrap your fish in newspaper.  The fish was good, but pretty small portion for the price.  The place felt a bit grimy and sticky - probably from all of the frying all day.  I'll think I'll pass next time.", "author": "Neville B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "I haven't lived in San Francisco for 15 years, but when I did, this place was a Friday night favourite. Do they still wrap up the fish in newspaper when you get it to go?\n\nI remember the couple who owned the place as being very friendly. Glad to see they're still in business with all the changes/rent increases that happen.", "author": "The B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-12", "description": "Wow, I hadn't been to Piccadilly in over ten years.  I go in tonight and order a combo to go -- get all the way home -- and it is the complete wrong order.  I return and they reluctantly prepare a combo -- in apparent wonder that I might be a bit irritated.  Then I get home and the entire order is only half-cooked.  Fail.  You should never have to have a bad meal in San Francisco.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-08", "description": "I read about Picadilly Fish & Chips in Patricia Unterman's San Francisco Food Lover's Guide and I am so glad I did! Usually not a fan of Fish & Chips, I must say that this little hole in the wall was greasy... but in a good way. :) \r\n\r\nPicadilly's also serves a variety of other fried seafood items as well as friend chicken. However, I would recommend the original Fish & Chips along with tarter sauce(have to ask for this) and malt vinegar. Mmm. Hits the spot. \r\n\r\n**Cash only", "author": "CHERiE Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-13", "description": "I called in for an order of fish and chips last night. The first three pieces of fish were great and the fries were great. I ordered the five piece, what was I thinking that was a lot of fish. Two of the pieces were under cooked and had to throw them out.\n\nI would revisit, because the person working there was friendly, and the fish was great. Just will need to ask them to be sure to cook all of the fish all the way through.", "author": "Dean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "Surprisingly top notch fish and chips in the Loin.\nNeighborhood is not the most desirable with random crazies wandering in, but it's a bare-bones, not-fancy greasy joint making better than you'd expect London-style newspaper wrapped fish and chips.\nYup, pretty darn good, heart-stopping goodness.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "This Fish & Chips place is been my childhhood place to eat.. The owner knows me and my parents and they are very friendly, it's too bad over the years he know me I never got to know his name...\n\nJust recently it was sold to new ownership but same quality food never changes.. They do have another location on Larkin near Geary Street..\n\nGreat Fish and Chips!!", "author": "RICHARD W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-13", "description": "Maybe they should have t-shirts \"I survived Picadilly Fish & Chips.\" Capturing the sense of adventure, and risk, that eating the food here likely entails might make an otherwise dismal dining experience marginally more enjoyable.\n\nI did enjoy being hand-served tartar sauce out of a beer pitcher by the proprietors of this fascinatingly still in business establishment.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "I love this place. The owners are so nice. Especially when my little bro is starving and this is the only place he will go on Polk Street. My only question is:\n\nWhere's the tartar sauce???", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-29", "description": "A proper chippy.  A real hole in the wall run by foreigners (by that I mean non-white people).  Actually, better than most I've been to in the UK (though nothing can beat Cornwall).  Much cleaner and better food for a start.  \n\nYou would think that fish and chips are all the same.  But if you think that, you're wrong.  This place gives you fish pieces instead of a whole fish fillet (a bit odd) but they are perfectly battered and fried.  I hate it when the batter is really bland and soggy and just falls off the fish.  The fries are real cut potato fries.  I was especially pleased to see none of that ketchup or tartar sauce on the counter, just salt and vinegar.\n\nMy only complaint is that the fish is a little bland.  I may have to try the squid next time (which is definitely not authentic for a chip shop).\n\nThis place only takes cash.  It's over $6 for 2 pieces of fish and a handful of chips.  I was a little taken aback by the price and the small quantity of food but it was more than enough for me but probably not enough for a big guy.\n\nIf you get it to go, yes, they will wrap it into paper for you all proper like.\n\nBike Parking: designated bike racks just a couple of doors down on Polk.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-20", "description": "Place is not the fanciest but common,  its a fish and chips joint.\nI had a craving so I hunted this place down after a recommendation.\nVictor and I shared a \"Five Piece and Chips\" ($15) but when the cook saw there was two of us, he threw in an extra piece. Fish was tender and flakey, chips were done to perfection.  I was a little surprised that they didn't offer lemon wedges on the side but the malt vinegar did just fine.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "Great variety of seafoods, all of which are battered and deep fried. They got a guy taking orders and one frying it up. Korean operators have been running this place for decades, very nice people. The place is very old school, looks like it hasn't changed since 1970's.\n\nSeafood here is good and relatively fresh. Everything is cooked-to-order. Food is cheap (for seafood) and simple; nothing fancy here with your food coming out in newspaper. The fish is really tasty and done really well. The breading for the oysters were a little thick and the clams were chewy form being over cooked but overall pretty good experience.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-05", "description": "Just had the two-piece fish & chips.  It was as expected - pretty consistent with all the other times.  I used to love this place in my younger days, but I think my taste buds now prefer a lighter and more crispier batter.  The fish are good-size pieces with moist cod fish.  I do agree with another review about the oil needing to be hotter for crispier results.  Their batter is a little thicker and a tad chewy at times.   I do like the chips a lot.  I just like the taste of fresh potatoes.  I always add a little malt vinegar, salt, pepper, and ask for some tarter sauce.  They are not very generous about giving lots of tarter sauce or napkins.  So I usually ask again.  They also open late!!", "author": "Alvin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "Best Fish and Chips I've had in the city. My girlfriend and I were on Polk looking for a place to eat and we didn't feel like burgers or the thousands of Thai restaurants in SF. So I used the monocle mode on my yelp app and saw this place.\n\nWhen we entered there was no one in there so we were skeptical. But holy crap it was good. The prices are nice and low and the gentleman that runs the business is very friendly. By the time we had sat down there were four more groups ordering food.\n\nCover it all with vinegar and it's awesome! It may not be Fish and Ships from over seas but I have to give five stars to this place just for being so nice, cheap, and having great food.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "Guilty pleasure! Get your battered and deep fried fish, onions and mushroom fix here. Make sure that you eat there because the batter gets soggy and the heat from the wrapped food steams the already fried food. no fun. \n\nI shouldn't be eating this stuff but no one seems to stop me when i walk in. I give it a low-4", "author": "Michael G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-19", "description": "piccadilly fish & chip is next to a boarded up breakfast joint at the corner of pine & polk.  the shop looks aged with white/cream overtones and the only anemities are generic  wooden table and  chairs. the tv is tuned to korean soaps.\n\ntypical fish & chip menu,: oysters, onion righs,, clams, chickens, fries, prawns.......\n\nsampling:\n2 piece fish & chip (6.40) no tax, cash only\n-2 piece of fish had crispy batter but the fish was bland. flaky and watery. the fish was falling apart when i bit it. the fish wasn't crisp.\n-fries not so crisp, and insides mushy. oil not hot enought?\n\nleftovers:\n-cash only\n-fish wrapped in korean newspaper, not an english one,\n-very fast, friendly service\n-fish ready in 10 minutes, beating my meter's 15 minutes.\n-meter maid's standing by.\n-remembered chelsa's was better but they use pollock, cod? used here.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "This place has been my childhood fav since I was in 3rd grade, it was litterly behind my elementary school and still standing after all these years....it was a great mom and pop shop for thick fries and salty malt fish. \n\nCame back recently taste us still the same quality but now the kids and grandkids are running it. Since I always had the fish and chips I decided to try the fried oysters too, not bad but can give you the feeling of too much to handle after a couple pieces....still the fish n chips are delicious!", "author": "Linh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "I used to come here all the time when I was a kid going to Redding elementary around the corner. \n\nThey wrap your food up in news paper. It's greasy and seeps through the brown paper bag before you get home. Isn't that great?!? The peices are a good size. The fries are the big chunky steak fries. I always feel like I'm going to have a heart attack everytime I open the bag, but my stomch tells me it's worth it and I dig in. \n\nThe sweet little Korean ladies that work there (own it?) are so nice. After years of not coming here, my friend and I come back over a decade later and they still remember us! \n\nNote: I never eat in because of the \"characters\" that come in. I guess even crack heads and junkies need their fish and chips fix too. The fix after the fix.", "author": "Jeanette P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-01", "description": "Fish and Chips the way it's supposed to be. Not contrived and fancy, just casual and delicious.\n\nMy British friends always tell me that this is their first choice in \"real\" FIsh & chips that they'd find back in the UK. They put their fish in the newspaper and fry them in large fryers. The fish tastes great and their fries are wonderfully crispy. \n\nDon't let the Chinese couple running this place fool you.......they definitely know what they're doing. In fact, they're probably the least authentic thing about this place.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-02", "description": "If I could I would have chosen 2.5 stars, because the gentleman cooking was very nice and they made the fish and chips to order.  With that being said, and this may be because we took them to go (we traveled may 10 minutes away), but when we opened them up the chips were hard and not that amazing, the fries were soggy.  The chicken wings were good though, maybe a little salty for my taste, but good.  The food was probably not that great because when the man cooking finished he walked out to use the phone for 10 minutes and then came back wrapped the food.  Oh, the kicker for this lack luster trip was when we wanted to add some fried zucchini to our order (there was sone sitting there) he said it was for someone else and didn't offer to cook more.  I honestly would have preferred LJS.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-23", "description": "Well, look what happens.  I post on Yelp that they are closed and now they are open.  Am I that powerful?  Anyway, I grabbed two pieces of fish and some chips earlier this evening.  The fish was quite tasty.  I liked how it was both crisp and pliable.  The chips were less than stellar.  Really thick cut and not quite so fried.  And there seemed to be skimpy on the portion of the chips.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-02", "description": "A decent place to get fish and chips.  I went last night for perhaps the 20th time in my life.  I should have asked for mine extra-crispy because my fish and chips were a little undercooked.  I was too hungry to wait though.  Still good though and the staff is nice.  Excellent place to go when you're drunk.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "Now and then, this fatty gets a craving for some fish and chips and when I want it, I WANT IT! Mmm..the sound of oil bubbling, the smell of fried golden crispy batter...it couldn't be better! \n\nPiccadilly is a mom and pop owned SF joint in the Tendernob. Friendly service, lots of grease, fried and battered to perfection, they serve up oysters, calamari, cod, chips, onion rings, mushrooms, etc. All with everyone's favorite 3 Monks Malt Vinegar and if you request it (and you should!) their tartar sauce. The atmosphere is a wee bit on the \"loiny\" side, but the tables are clean, the fish is fresh, and you couldn't ask for nicer service. I wouldn't say it's the best of the best, but darn good for a little neighborhood hole in the wall. If you get it to go, it even comes wrapped up in a newspaper.\n\nSometimes, you just want to say YES to fried goodness!", "author": "Kira R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-25", "description": "I was in the mood for some fish and chips and decided to give this place a try. The restaurant has plenty of seating but i opted to get take out. \n\nI went with the 3 fish & chips combo ($8.90). They seasoned it with some salt & malt vinegar before wrapping it up to go. \n\nThe fish was fried with a nice golden crust. The batter was flavorful but did not overpower the flavor of the fish. The fries were thick cut and weren't as crispy as the fish.", "author": "Phong D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-14", "description": "In one word GROSS!  The OIL the fish and onion rings was cooked in was SO OLD that the coating did not get a fried golden brown color, it was totally WHITE and the fish was limp!  This place use to have good food years ago but now is a TOTAL DUMP and smells and looks like it!!  I will NEVER go back to this place ever!", "author": "San Francisco D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "I've been hitting this place steadily over the past 10 years. \nIts Fish & Chips folks not a 4 star restaurant & let me tell you its the best option in SF & not the only.\nI'd have given them 5 stars if they opened a little later so I could get my grease fix after a few drinks.\nI've had fish & chips in Ireland & the UK & this is the closest you'll get here, as far as regular street shops go, not to be confused with Bar/Pub food as they add beer to the batter & its just different compared to this.\nI recommend it.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-06", "description": "The prices here are so great (hecka cheap) for the food they pile on  your tray.\n\nFaithy, Hope, and Grace each had the combination plate:\n1 fish, 2 shrimp, 3 oysters, onion rings and chips.... for $9.90!\n\nThe Korean couple who ran this joint were hecka cute.  The man was in charge of frying, and the woman with ringing up the orders and getting the food from the back storage.  She first calculates your total on a calculator, shows it to you, collects your money.... then punches the total on an old school cash register.... \n\nThe food is made to order, so it's HOT when it comes out... each table has its own bottle of malt vinegar and a shaker of salt.  If you want tartar sauce, they will come out with a bucket and scoop you up some on your tray.  I like this because it eliminates the plastic waste (other places would have those little condiment cups).\n\n\noh dang..... LOVE the chips... the oysters were hecka good.  The fish and shrimp was not bland.  None were drowning in batter.  We finished our meal properly with carbonated beverages in aluminum cans.\n\nDefinitely would come back here... One of the better (if not best) fish n' chips hole in the wall joint in San Francisco.\n\n( | )\n\nP.S..... the lady is not mean... she just looks like that.", "author": "Grace M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-25", "description": "I am truly sorry to the owner of this store for having to rate them so low. Let me preface this review by saying that while I am working, I always try to find local restaurants to dine at during my lunch. Today was no exception, but in hindsight, I wish it was. The price wasn't very reasonable for the portions delivered. The batter used added no flavor or texture to the food. The fish was bland and only made more bland by the batter that was added. Salt and vinegar did nothing to improve the flavor by any means. The onion rings were not fresh, and again, after being bettered with a bland coating, were rendered almost inedible. I only decided to write this review because of the level of discomfort I am experiencing in my stomach at the moment. I feel dizzy, a little nauseous, and the worst part is my work day is not even half over. I take pity on the poor soul that has to come after me into the restroom after this meal rears its ugly head.\n\nLiving in San Francisco has given me a wide array of foods to choose from, and this is not up to the standards.\n\nFor a comparison, I'd rather have a McDonald's Fillet-o-Fish sandwich then dine here again.", "author": "Graham U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "Authentic fish and chips. This place is not for everyone if you cannot handle a lot of grease. The batter soaks up all the grease which makes it super flavorful but super duper greasy. The fish is delish! They apparently import their cod fish from Ireland. Don't forget to try their homemade tartar sauce. It is a MUST. The fried mushrooms are also excellent.\n\nIf your stomach can handle the grease, stop by Piccadilly.", "author": "David W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "fish and chips place run by a korean family? how did this business come about? the whole family was there when i was eating. they were very genial and laid-back, which i liked.\n\nthe fish and the chips i got were a little underfried but that's ok because i didn't expect too much from this place. but you have to ask for their homemade tartar sauce.", "author": "Te R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-03", "description": "If I could give this place 3.5 stars.  This place is ok and it satisfied my monthly craving for something greasy.  The items are made to order, so your order is piping hot when you get it.  I got the sampler with fish, onion rings, fries, oysters and shrimp.  The shrimp was a bit salty, but the rest of the stuff was just right.  The shrimp and oysters have a tight breaded and fried, whereas the onion rings and fish were dipped in a batter.  After getting halfway through this stuff, I couldn't eat anymore batter, not because it tasted bad, but because I'm on a diet.  I suppose stripping off the batter from 1/2 of the fish and onion rings qualifies this to be low/reduced fat.\n\nI couldn't eat here more than once a month, but that's just me. This is everything I expected ... no more and no less.", "author": "Rod C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "I've generally found that fish and chips are simply fish and chips, whether they're served in a restaurant with white tablecloths and fancy decor, or a simple casual joint like this one. \n\nActually, cross that. The fish and chips here beats most. Yes, they're just fish and chips, but they use cod, not pollock, which has a much better texture and flavor. Also, their cod isn't frozen, unfrozen and refrozen multiple times along the supply chain, the way many other joints' are. \n\nIn addition to classic fish and chips (with a good dose of malt vinegar, if you like it that way - which I do), they also have other items like zucchini, squid, onion rings and chicken. \n\nThe joint has been with the same (extended) Korean family for a while - believe the part of the family that's running it today is also the family that used to run a Scottish pub, Edinburgh Castle, back in the 90s.", "author": "Jay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-30", "description": "After a long day of craving fish and chips at work, what better place to go than Piccadilly on Polk. This place has been here for quite a while. I remember back in the day when my friend's bands would play Kimo's, we'd always come by beforehand to indulge in some fish and chips made by the Korean family that still owns it to this day. I must say that during these downtrodden days of the failing economy, even the size of the fish at this joint has been affected. Regardless, the place still has some primo grub. \n\nI had a 2 piece fish and chips and a side of 'shroomage. It was, as we say in Tagalog, PANALO! (For you non-speakers, it means WINNER!)", "author": "Ivan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-05", "description": "Two pieces of fish with a bunch of fries for $6.40, made on the spot, so you have to wait. Place is totally stark, with bright fluorescent lights and very minimal decors (not white leather couch minimalist decor, but as in nothing but a couple of chairs and a bottle of malt vinegar on the table minimal decor.) \n\nThe Korean couple that runs the place looks like genuine nice people who don't forget to chat and joke with each other while working the frier. \n\nFries plus ketchup plus malt vinegar brings this unbelievable great flavor. Fish pieces are not bad either. \n\nThe fact that the light is so bright makes you feel a little tired and dazed, which is kinda perfect if you want to reminisce about your drunken youth and the blurry days in London.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-28", "description": "I ate here three times last week and you won't hear me complain about a thing. \n\nNow of course this place is not located in the heart of London were all you fish and chip aficionados have had what you consider the best. Yea, yea..Been there, done that. I do think the best F&C you can find in balmy old London is out in South Reslip. \n\nPicadilly's does a good job and you won't be disappointed. \n\nGive it a try after quaffing about a gallon of ale across the street.", "author": "Wayne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "Hard work out + 3 Gin and Tonics = Feeling good and slightly mellow\n\nFeeling nice and slightly mellow + Fish and Chips  drowned in vinegar + sweet and friendly owners = Big smiles, happy and all right with the world\n\nNothing wrong with either of those equations!", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-17", "description": "One of your friends had a near death experience, and he tells the goddamn story all the time. At bars and lounges he captivates his audience with his harrowing tale of overcoming death, and how he now sees life in a different, more beautiful light. Men call him an inspiration and women give him their phone numbers.This usually leaves you sitting alone in the corner because everyone constantly gathers around him, and really, who wants to hang out with someone who hasn't had a near death experience?\n\n\"Never again!\" you shout as you barge through the door of Piccadilly Fish and Chips. Todays the day you decide to change all that. Yep, that's right, today's the day you start on a mission to give yourself a heart attack. \"As soon as I survive that\", you think to yourself, \"I'll have my own goddamn near death story, and all the fame and fortune I deserve!\"\n\nSlap a $20 down on the counter and say \"I want all the fish and chips you can give me!\"\n\nIn about three minutes, you'll have an nine piece fish and chip plate handed to you. Don't forget to ask for the tartar sauce, because they keep it in a pitcher behind the counter. Point to the spot on your plate that you want the tartar, and the lady behind the counter will slop it on. Tell the lady \"More\" five times. That should give you the proper amount of tartar.\n\nThe fish, although fresh and crispy, will be lacking a bit on the flavor side. You'll ponder that for a moment, then realize that you got a lot of goddamn fish to eat. Even though you'll be stuffed by the fifth fish, don't give up. If there's one thing you've learned from watching all those Will Smith movies, it's to never give up. The fish will be so greasy that you won't even have to chew that last four pieces, and you can just let them slide down your throat.\n\nGo here for lunch and get the nine piece fish and chips until you have a heart attack. It should take about three weeks. When it happens, it's gonna hurt. Oh it's gonna hurt like hell. The pain, however terrible, pales in comparison to the knowledge that for the rest of your life you'll be able tell one kick ass story about the time you almost died. A smile will creep across your face as you use the last of your strength and dial 911. Now fight to live goddammit, fight!", "author": "Dave G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "When it comes to making me happy I am not an overly complicated person. It really doesn't take much to get me in good spirits. I like simple things, like a carefully brewed cup of coffee, pumpkin ice cream from Mitchell's, fish and chips.....\r\n\r\nMMMM......Fish and Chips, I don't always crave it but when I do, I hit up Picadilly's on Polk. Yeah the food is greasy but come on-it's fish and chips. It's deep fried and golden and crispy good. Although they have other seafood and veggie options, all deep-fried of course, I go with the standard 3 piece with fries. Some fish with malt vinegar and beer, sometimes that is all I need. Like I said it's easy get an ear to ear grin out of me.", "author": "X marks the spot .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-13", "description": "Dry your eyes mates Picadilly is OPEN. After being closed for several months due to fire (I'm thinking grease fire, just a wild guess) they've opened their doors again sporting new floors, fresh paint and hell, I think they even changed the oil in the fryer.\n\nI don't eat much fish 'n chips because while I like the idea of it, I KNOW that I'm going to feel like shit immediately afterward. I'd like to say that this place is different but, no, I still feel like shit. That's alright though because sometimes you've just got to satisfy a grease craving.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-25", "description": "While the fish portion is superior to the chips portion, I have to say I enjoyed my meal overall.  The fact that the fish is hand-dipped upon ordering adds to the experience. Although the setting is nothing to write home about with clean but plain counter service, the family that runs it is very friendly and will not cut corners. A small piece of fish? You'll probably end up with two of them to make up for the inadequate size and to ensure you are properly full.\n\nHrm...now why is it that the above statement sounds a little X-rated?", "author": "Audrey J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-06", "description": "It isn't the best, but then again, exactly who or what can you compare it to. It's not like there's fish n chips places all over SF - unlike tacquerias. Actually, at one time (when I was a kid), there were quite a few of them in the Richmond and Sunset. But that was in the early 80's when I was in highschool. (Yup, local guy here).\n\nI have to say, when I do crave it - and I mean I have to really crave it, I go here. Liverpool Lil's has great fish n chip, but that place is more of a sit down place and if I remember right, it's 15 bucks. That's not right.", "author": "Ted P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "There are only a handful of Fish & Chips places here in SF that I'm aware of and Piccadilly Fish & Chips was one of those places that I passed by many times but didn't dare go in not knowing whether I'll get sick eating there or not. \n\nGlad to announce that I finally ate there and am alive and well. My tummy was very happy after having their 2 piece Fish & Chips with a side order of fried clams. The fish was really light and perfectly battered...went great with the carefully-monitored tartar sauce that they'd reluctantly give you when asked. Though I find the chips were not crispy as I'd like them. Despite that, I have been back a couple of times and kept ordering the same 2-piece fish and chips and forgot to try their onion rings. I'll definitely have to try their 2-piece fish with onion rings next time! \n\nGreat people working hard behind the counter. It's a nice hole in the wall to either dine in with eclectic folks or take it to go...great either way.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "I woke up on my floor.  Confused.  I had no clue what time it was or how long I had been out.\n\nBefore I moved I looked at my surroundings: nothing unfamiliar.  I think I left the television on.  And some grease-stained newspaper strewn about my table.\n\nA mayonnaisy substance on my fingers and face.  \n\nI got up and poured a glass of water in hopes it would do something about my headache and lingering nausea.  \n\nAs I sat in a haze, memories started coming; only pieces.\n\nA white room.  A deep fryer the size of my car.  A chinese woman.\n\nI don't remem-  Oh....  Oh God...   Oh NO!    \n\nI've been Brain-Raped by Fish & Chips again!!", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-01", "description": "I may not know too much about the fish, because I don't do the surf much.  But I did try the chicken, chips, onion rings and the mushrooms.\n\nI think that everything, except the chips are fried in the same oil, and who knows when it was changed last.  They all might have the same coating too.  Everything is coated heavy in salt.\n\nSeveral kinds of fish are available, from scallops to crab, to squid.  Prices range from about $7 for two pieces of fish with chips or onion rings to $11 for 5 or 6 pieces with chips.  \n\nI think this place is much cleaner than the last time I was here.  Your To-Go container is newspaper, and by the time you get to where you are going, you'll be lucky the oil has not soaked through.  All in all, some of the best fries I've had, but over salted.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-26", "description": "Not sure how I'm supposed to feel about this place.\n\nI stumbled in last night after the Elite event across the street at O'reilly's Holy Grail. I needed something to bond with the Guiness in my innards. Fish and chips seemed the logical choice in every way\n\nYou wouldn't necessarily expect a couple of middle aged Asian ladies to be frying up fish and chips around midnight on a Wednesday, but this being San Francisco, you wouldn't necessarily not expect it either.\n\nThe fish was good, chips could have used a little more frying.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-28", "description": "Just like the chippy back home, innit.\n\nThey need to learn how to fry up some Mars bars.\n\nPip pip.", "author": "Adrian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-17", "description": "Somehow the sign caught my attention and got me craving for some fish and chips, which is rare because I'm not a fish and chip person.  Actually, I'm not much into fried food except fried chicken.  \n\nAnyway, I think this place has been here a long time.  Hubby said it used to be H&S way back when, I recall a H&S on Polk but I thought it was closer toward Sacramento/Clay.  The place is bigger than I expected or remembered, specifically the seating to the side.  Seeing the two Korean ladies was also a surprise.  The older one manned the fryer and the younger one was the cashier.  \n\nWe got the 2 piece with onion rings for under $7.  I was tempted to try the 9 pieces of squid for $2.75.  It took a while because they fried to order.  Hubby said the younger woman insisted on putting the vinegar and salt for him even though he asked a few times to do it himself.  I told him that's called service.\n \nIt was piping hot, burning hot!  The fish was flaky but after a few bites, it was already too much fried food (oil) for me.  I didn't care for the batter on the onion rings - it was a bit lumpy and soft - but the onion itself was sweet.  We didn't know about the tartar sauce, it may have been better with it...actually, I would have loved some BBQ sauce.  I know, I'm a bit strange but I love BBQ sauce on all fried food.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-18", "description": "ahhh salt and vinegar on mine any day..........\n\nDon't know why, but we keep missing this place when we try to find it, but now we have, I am coming back. The Korean ladies behind the counter were sweet- after a few gestures exchanged, we figured we could help ourselves to seats and the drinks fridge while we waited for our 2 portions of fish and chips.\n\nWhy is it so hard to find whole fillets of battered deep fried fish in the Bay Area? I have been hunting high and low near the british pubs for a slice of battered goodness to be disapointed by some fish steak  sitting in grease. I have to say though, despite the fish fillets were small, I was a very satisfied person when I left this place. The food was fried to order so it was hot, crispy, and not greasy   It felt like a chippy from back home (it had a proper fryer unit), all we needed here were 'pukka' pies, gherkins and saveloys.... hmmmm... \n\nother things on the menu were fried chicken, onion rings, fried prawns, scallops and oysters. One day I am going starve myself and have the $9.90 special- one pc fish, 2 shrimp and 3 oysters with chips...... (or was it onion rings with that?) heck ,all this with a great range of sodas to wash it all down....\n\nbe careful- the only food not fried is the colesaw (lots of mayo, but freshly homemade), so dont come here if you trying to lose weight!", "author": "Sushi Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "This place is only two blocks away from my place so I'll come here whenever I find myself getting trashed on polk street. \n\nLet's be clear about one thing. This isn't a place to go for fine dining. It's sort of like Chinatown meets dive bar that serves fish and chips. \n\nNow that we have that out of the way, I can tell you that the fish here is super good. The frying job on these things are perfect. Crispy on the outside and the fish inside is cooked well enough to where it's still moist.", "author": "Trung V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "Yeah.....fish and chips.. Fish and chips....fries.....no.....they're called chips dummy. This is the spot. Oh hell yeah...just thinking about that deep fried goodness, smothered in ketchup and tartar, makes me wanna run naked through the Tenderloin, which I wouldn't recommend. \nI did ask the little old asian lady how old the deep frier is in that joint. Anybody wanna guess? Longer than most of you yelpers and your fams have spent on the West Coast. The reason those fish and chips taste so damn good is because that frier is over 80 years old....boo yow!!!", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-18", "description": "Yeah .... they are open again....\n\nBambi recommends the 3 piece with chips and extra vinegar...", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-06", "description": "Food was greasy and bland. Looked good but tasted so so. Cash only here.", "author": "Dan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-10", "description": "Here's an analogy:\n\nmalt vinegar stench : deep-fried anything guy \n                            :: \ncigarette smoke : smoker\n\nYeah, they smell sickly-sweet, a little bit caustic, and you know they're going to affect you adversely, but they also make you want to damage your health with them. \n\nPiccadilly Fish & Chips stinks from half a block away, in exactly that way.  Peek inside and it you'll notice that it looks like the kind of place where you shouldn't be -- spotty fluorescent lights, splochy wallpaper, a general sense that it could use some electrical work (not to mention a cleaning).  \n\nBut fried food tastes great, and they do a decent job of it.  \n\nThis is not a sober food.", "author": "Phil K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "They had some GIGANTIC fryolators at this place.  The \"chef\" at my fraternity house would have been proud!\n\nThe fried oysters were fry-o-licious and the fried imitation crab was also fry-tastic.  I mean seriously, who needs their imitation crab with healthy ingredients like seaweed, rice cucumber and avacado?\n\nThe restaurant is really ugly inside, but I couldn't say I cared much at half-past-drunk-o'clock.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-21", "description": "Baccarat taste with a Dixie cup budget?  Fear not, weary diner.  This joint has risen from the ashes (closed by a fire for a while) to again regale you with flaky white fish battered to perfection.  Maybe they were able to save some of their magic oil from the flames.  Everything tastes the same as before.  The original patina'd interior of course is gone (fresh paint will do that), but you'll still leave feeling like a greasy Gorton's fisherman, and the wee bit of malt vinegar clinging to your lips on the way home reminds you that all is good in the universe.\n\nWould give if 5 stars if they improved the lighting - damn folks, if the space shuttle can see your fish fry from Mars, then it's time to dim the damn lights.  It's not as if deep-frying requires it, and besides - everyone looks just a little bit better when not being bathed in 728 fluorescents.", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-01", "description": "Ok, there are not too many places we won't go back to when there are fries and grease on the menu. This however is an exception. \n\nWe decided to have a bit of a variety and try the fish and chips and the clams and onion rings. I have never had anything this greasy, Ok, maybe once but this definitely ranks up there. A full quart of 10W30 in every piece of fish. Amazing. There must have been an issue with the temperature of the fat .... it just got soaked into the food.\n\nThe fish was greasy and tasteless, the fries were not fully cooked, there was a minimum amount of clams but ... yes there is a but ... the onion rings were not bad at all. So, if all you want is a side of onion rings give the place a chance. If you want more ... keep on walking!", "author": "The A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-09", "description": "Things we got:\n\nFish: Very Good\nChips: Good\nChicken: Awful\n\nSo on fish alone, I would have given this place 4 stars.  If you factor in the chicken, and the place itself, 3 stars is maybe pushing it.  I really liked the crispiness of the fish with the malt vinegar and tartar sauce.  I thought the flavors were all very good.  As for the chicken...let's just say it was horrible.  The pieces were small and extremely overcooked.  The chicken was dry and the batter lacked flavor (maybe because it was burnt).  \n\nI would go back, but only for the fish and chips.  I do think however that there are better options.", "author": "Gary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "great fish and chips, u can order from the pud around the corner and get them delivered to the table, use lots of salt", "author": "Simon W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-24", "description": "Fuck ya I've experienced better...AT OLD CHELSEA!\nYa ya ya, I realize that these two are exactly the same.  When Old Chelsea is closed, they put up a sign that says, \"We're open!  At Piccadilly\".\nSo yes, it's almost exactly the same.\nBut for some reason, the food at Old Chelsea is WAY WAY WAY better, even though they have a lower rating.\n- The onion rings are PERFECTLY fried at Old Chelsea; not so much at Piccadilly.\n- The old adorable men at Old Chelsea throw in extra FISH; not so much at Piccadilly.\nAll in all, Old Chelsea is the place for me.  I go there about 4 times a week, and I have no shame in that.\nLong live grease!", "author": "Meh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-02", "description": "If you ever get a craving for fish and chips- this one's for you :-)\n1- star for the mom and pop atmosphere-- i think they need help busing the tables...\n2-star cracker crispy batter and moist steamy cod inside \n3-thick cut crunchy french fries\n4- Get the combo plate yummy oysters too\nSomebody pass the malt vinegar and tabasco please ;-)\nMinus the one star for being too close to my yoga place... cuz im always hungry when I get out...", "author": "Arissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "Not bad considering they still don't give you the whole fish...why don't they do that here?!? Seriously, it's the land of gluttony, you would think they would start using the whole fish like they do in the UK instead of \"pieces\". Anyway, it's pretty damn greasy and tastes good, which gives it the 4 stars right there. The prices are decent -- exactly the same as The Old Chelsea -- but probably the best fish to the chips I've had in San Francisco. \n\nWhat else can I say? It's fish and chips done well with loads of vinegar and salt. Yuummmm.", "author": "Ali L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-15", "description": "Last Friday, after a late night movie at the Lumiere, my friends and I decided to grab a bite to eat on Polk. So we checked out Piccadilly's since it was open and not busy. We grabbed more than a bite. \n\nWow, I really love their Oysters, Chicken, and Fish & Chips. No it wasn't all for me, we shared. Aside from the fresh good meat inside, their batter is delicious and I think they deep fry twice for extra crispiness. The elder couple that run the joint were very friendly and accommodating. I don't hang out at Polk St. often, but I'll be back to try their other items. \n\nBring your friends, but don't bring your doctor. Oh, and why are there 2 listings for Piccadilly's?", "author": "Leroid D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-05", "description": "While I would love to give this place 3.5 stars I can't round up to four stars.  See, once upon a time, I was given the ultimate luxury of living within walking distance of the BEST fish n' chips I've EVER had.  I mean the kind wrapped in newspaper, tangy with vinegar and salt and hot and fishy and deliciously chippy.  Nothing will ever compare and goddamn the closing of Lou's in Martinez.  \nThat being said, I thought that the fish n' chips served up here were okay.  I was freezing, I wanted something filling before hitting the gym and I didn't want to spend a lot of money.  An order of 2 piece fish and chips plus a bottled water came to $7.40.  I had to wait a bit for the food but that means that it wasn't sitting around either.  Only one person working but she was sweet and it was nice and quiet for me and my fried goodness.  Best of all, I have a nice base for tonight's drinking!", "author": "Jill D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-20", "description": "It is in my 'hood and it hits the spot when I need a late-night, greasy food fix.  It does take awhile to get your order though, or maybe it feels that way when it is the last stop on the TL Drink Train.  \n\nI will not comment on the taste because I have never had the fish and chips when I haven't had a few drinks beforehand so my judgement could be off.  Besides, I drench my order in a gallon of vinegar anyway (East Coast Bay City!), so my taste buds are probably pickled.", "author": "MakeUp M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "Funny, for year's I passed by this place and never really stopped to smell the fish..but I'm glad that I did. From my understanding this restaurant has been here for ages..They have a \"Yelp\" decal on the window..sweet. So here it is. \nAny case I give them 4 star's. Fast, hot, and tasty food. The two ladies that run the counter are quiet but they do smile a lot. It's better than talking too much rite? \nThe place is not fancy, just good , decent food. \nNo crowd when I went there so there is room to sit or even take it to go. \nCa$h only folks!", "author": "Smooth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-27", "description": "After I had dinner at Cafe Gratitude the other night, I felt good - really good - the next day.  Just so healthy and, like, clean.  So where did I have dinner the following night?  Well, the obvious follow-up: Picadilly Fish & Chips, of course!  I love fish & chips so I've been wanting to try this place for a while, and had the perfect opportunity after the Yelp event at O'Reilly's.  \n\nI got the 2 piece fish & chips to go - it's not really a cozy place to hang out & linger.  I was totally charmed by how they wrap it up in newspaper.  Hey, just like they do in England! (or at least from what I've seen on movies.  I've really gotta get myself to London someday soon).  By the time I got them home 20 minutes later, they were a tiny bit soggy, but still really good.  \n\nI'll give the food three and a half stars, the atmosphere two and a half, but the people working there were so nice that I'll bump it up to four stars.", "author": "DD B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "Was in the area and wanted some fried clam.  The people were very friendly.  I would give it a 5, but they only accept cash. \n\nFood =good\nservice =good", "author": "Roger A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "If you're going to clog your arteries with something, this is the stuff that's worthwhile.   Yes, they're open again!!!!!  \n\nThey not only have fish and chips, but oysters, chicken, shrimp, zucchini, mushrooms, and a bunch of other deep-fry-able, heart-stopping  munchies.\n\nTheir new layout is, well, pretty much the same as their old layout - just with less grease caked on to everything.  Parking is usually decent within a block or two radius, if you want to run in and pick something up.  Be forewarned though, your car will smell scrumptious for a while during your trip home.  \n\nThe food is just as good, if not better than before.  Or maybe I just lucked out and got full sized pieces of fish instead of smaller pieces of fish.  That said, I think I'm done with fried food for at least a month or so.\n\nBTW - This is NOT where Edinburgh Castle gets their fish & chips - they get it from Old Chelsea (around the corner from them).", "author": "T C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "Okay this place simply hands down has the best fish and chip in San Francisco. The prices are very good the only down side is this place is small. So small you might walk by and miss it. This place is a hidden gem.", "author": "Sean V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-22", "description": "These are pretty authentic English style fish and chips.  Greasy and mushy and filling.  Definitely better with booze.  They don't mess around with Tempura batter or fresh fish or whatever silly SF foodie trend people are calling fish and chips.  The fish, like the fish you get at English shops, is frozen.  The oil has probably been there since they had to change it after the place burned down a year ago.  Its ok.  It still tastes real good. \nThe Old Chelsea, the chip shop which delivers to the Edinborough Castle, is in the same neighborhood and nearly identical except, one shop has better fish, and the other shop has better chips and I can never remember which is which until I have them in front of me.", "author": "Flemm F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-06", "description": "Who goes to get fish and chips and doesn't expect a lot of grease?  It's FRIED for gods sake!!  So, don't be surprised if you leave feeling greasy and fat-full.    \n\nThe food is every thing you'd expect from a hole-in-the-wall counter run by one guy who is working his butt off.  Based on that, and the price (3 pieces with chips = approx 9 dollars), its not half bad.   The food was hot, it was fried (go figure), comes wrapped in newspaper, and it comes with home made tarter on the side.   \n\nThis isn't SF-snob food; there's nothing healthy or \"light\" about it.  But, based on the number of Brits standing at the counter, and the line of folks out the door, it appears that some people are still okay with that.", "author": "Val K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-02", "description": "Definitely some of the best fish and chips I have ever had, fried to steaming hot crunchy perfection right when you order it.  The clams are my favorite, and the shrimp is good too!!\n\nThe service is great as well, the owner is a sweet man who even gave us a whole bottle of malt vinegar when we ordered $50 worth of food (what? it was for 8 people!).  The newspapers wrapped around the food are a nice touch.  It's kind of a small place if you plan on eating inside, but it's well worth it if you want to gobble up your food right then and there.", "author": "Nicole z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-16", "description": "I really wanted to like this place but all I can say is meh. The batter tasted plain, the fries sucked (soggy, bland and tasted like cardboard) and the homemade tartar sauce was a little too sweet for my liking.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "Person working was ultra nice. Very very nice.\nI probably should've asked for tartar sauce instead of sticking it out with the vinegar. \nThe fish was yummy. It is yes of course done fresh. However I'm not too stuck with its pricing.\nThe chips were not crispy enough, but the taste was good.\nAtmosphere is ok, a little quaint area. Not very attractive, but I like it, represents what it serves.\nWould go again if pockets were feeling up to it", "author": "Winè C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "Certainly not the best fish and chips I've had, especially being from Toronto where Chippy's spoiled me. Having said that, this joint is quite good for SF - fish and chips joints are few and far between on the left coast, and this place did the trick. Not too expensive, friendly staff, and they had malt vinegar readily available. The fish is definitely frozen, but pretty good quality. Chips weren't fresh cut, but not bad. I'd go back if I was in the neighborhood.", "author": "Scott J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "fish and chips.  exactly what they are called is exactly what you should order.\n\nsure they do squid, oysters, clams, chicken, mushrooms, onions, and zuchinni.\n\nthis place is obviously a fried food joint so expect it to be oily.  i'm sorry no offense to anyone but when you hear fish and chips expect it to be oily no matter what you order.  its deep fried.  you shouldn't expect a dried out fish in batter without oil in it.\n\nokay with that out of the way.  the one thing i love to have with my fish is MY CHIPS.  on the way home which is on mount davidson a long way from here.  I open the fish and chips and eat the fries while i drive.  they are covered in salt and vinegar and its perfect.  i love the lingering taste of a little vinegar and the salt.  i usually hate salt but this is perfect for this place.\n\ni go to only so many places for Rock COD fish n chips and this is one of them.  get the veggies deep fried too.  they taste great.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-16", "description": "Ghetto little hole in wall. Everything tastes good fried right? Wrong...super greasy fries and the fish is nothing special. The two little Korean ladies are super cute though.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-24", "description": "I worked in a fish and chip shop for 4 years as a teenager (ahh those days of getting 2 quid an hour! ), so i feel reasonably qualified to comment on this place =)\n\nThey've got a proper fryer (from Cardiff apparently!) which is a good start. And I have to say that the chips are pretty authentic and very tasty. Their the correct large size, slightly crispy on the outside, soft on the inside and not too much grease - great with vinegar of course! It's a shame they don't get much traffic as it means they have to fry the chips each time you order rather than real \"fast food\".\n\nThe fish is a let-down though. I've never had good fish and chips in the US and I wonder if it's just because they don't (can't?) use fresh fish. It always seems to be very small pieces of fish that have been frozen. When they are fried, the texture is just completely off, with an unfortunate reconstituted feel. Inedible unfortunately.\n\nWith this fish problem, it would be great if they could add some easier staples to the menu like battered sausages and spam fritters. These are tasty, traditional items that anyone can cook.\n\nSo 3 stars for the quality chips, not a place to get a meal, rather to grab a bag of chips after a few pints. Oh, love the korean folk music they sometimes play too =)", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-20", "description": "I tried them for the first time sometime ago and I was pleasantly surprise. Inexpensive, fried food perfect to start a night where burning calories is inevitable.\n********************************\n16AUG07\nNow I know better!  My favorite Fish & Chips in the city!!!\nA little wait, but  the fresh food is totally worth it!", "author": "Yamil A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-12", "description": "Be sure to ask about the cod cups in the white freezer, it'll completely change your experience and your standards!", "author": "Ben G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-17", "description": "I can still remember the incredibly large single piece of perfectly battered Cod sitting on a golden mountain of lightly salted finger-sized cut chips served on an oval shaped platter measured from finger-tip to elbow. It was like slow motion when my eyes widened larger then dinner plates as I stepped towards quick dining heaven. Joseph Malin got the right thought when he started it in 1860 in London, England.\n\nWith that said, you wonder why I put up 2 stars. Well my description was of when I was in England last year, and if I was straight breaded-out I'd take a trip back to the country side of Coventry.\n\nMaybe I shouldn't compare the food from across the globe by the inventors taking years at a time to perfect it, or maybe I should. I did consider that, but i decided to base my rating solely on Piccadilly.\n\nThe fish was overly battered for the size of the fish. It came in a few small pieces and was rather bland. It was dry, no flakey moisture here. The chips were frozen from a bag. No personality in the business either, just off white paint on the walls with scattered tables with vineger bottles on them. 1 star for food, location, and vibe, another for the nice lady.", "author": "riz l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-13", "description": "I had the worst meal at this place.  Uncooked batter, cold fish, poorly cooked.  I left the entire plate of food for 2 people, which wasn't cheap.  I would never come back to this place.  You should be closed down.  There are too many other places in San Fran to eat at.  Just thinking about this place makes me ill.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-04", "description": "I really wanted to love this place.....but alas its not in the cards :(  \nFirst of all I'm Australian and its tradition to eat fish and chips almost weekly. I have lived in San Francisco for almost 10 years and only been here one time before. I had just returned from an amazing Summer trip home and had a craving for some great Fish and chips. From what I remembered it was OK. I had a bad feeling from the moment I tried to order. The elderly gentleman did not speak English. I had to show him my fingers so he understood how many pieces I wanted. When he placed the fish in the oil it didn't even sizzle. I knew with the oil not being hot enough they were going to soak up all the grease :( And they did. Whats worse was there was hardly any fish in the batter! Maybe a couple of bites! While the fish was cooking I wondered when are they going to put the chips on? Another man came to help and took out pre made chips from a warming tray. WHAT? I asked him...so you dont make the chips fresh? I asked him could you make the chips fresh for me? But he didn't speak English either. They looked greasy, soggy and cold. I was already depressed thinking about them. What a disappointment. The bundles of chips were tepid at best. After driving home I then had to re heat them in my toaster over. I will definitely not be visiting here again. Its not rocket science to cook fish and chips. Use hot oil and cook each order fresh and you are sure to get repeat customers. This place could have been a gold mine if they did a better job. The next day I got our deep fryer out of storage and made amazing fish and chips!", "author": "Melody M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-21", "description": "This is a no hype type of restaurant, a definite hole-in-the-wall. The owner is Chinese, so don't expect a British pub. The fish and chips are OK. It has a crispy batter and the fish is flaky. The only thing bad I have to say is that it is extremely oily...especially the onion rings. It feels like drinking a cup of oil every time you bite into the onion rings. The chips were nothing spectacular. Overall, an average experience.", "author": "Jun W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-23", "description": "I had an interview my hubby was driving me to in the city, and we actually ended up parking a block away from this place. We originally read the reviews and wanted to try it before so we decided to just eat there that day since we had already found parking. The place is owned by an Asian older couple who are very nice and polite. It's a small place and the portions are decent. We decided to split an order of fish and chips since we were short on cash to get two orders (BTW, it's a cash only place so make sure to stop at an ATM beforehand.) The fish was battered a little on the heavier side and the tartar sauce tasted like it was mostly mayo than actual tartar. I don't think this was the best fish and chips we had but it was OK, though we still prefer the one at the SF Fish & Company in the ferry building. The prices were not too high either and overall it was just \"OK\" for me.", "author": "Petra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-01", "description": "It's in a seedy part of Frisco... hole in a wall place on Polk... i wasn't expecting much, but maybe enough to hold it's own match to the old skool London Fish N Chips in the city back in the day... they had a walk- up revolving window food dispenser... he-he... \nthe owner was super nice: \"EAT EAT first then pay later\" .. got the cod fillet and chips, the hubs had fish w/ fried mushroom... they need to change their oil more often... i can taste the remnants of all things fried from what may have been two weeks ago... i drenched my meal w/ the malt vinegar and dipped it in their homemade tartar, which was delish... when i asked for it, the owner came w/ a pitcher filled of the cholesterol goodness and plopped it down on the side of my tray... \ni would recommend getting it to go, so much of the oil would be sucked up by the wax and newspaper it's wrapped in... but it's fish and chips and cheap eats... if you want to eat BAD this place is all GOOD... \nI may go back for some more fish and make room for a corn dog...", "author": "Aga O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-31", "description": "the fish & chips here is pretty good qualty, I would highly recommend Picadilly, not much seating inside but this place is kept nice and clean.\nthe service is quick too! when you have a craving for some good old fish & chips this is the place to go!\n\nI ordered two piece fish with onion rings and the owner even added some extra fries, they are nice people.", "author": "Mr Bolo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "When I first walked into the restaurant I was a bit worried that the food wasn't going to be that great. The small hole-in-the-wall type  restaurant had a sort of ghetto look to it, however the food was anything but!\n\nThe fish was perfectly fried! Crispy on the outside, no uncooked batter and juicy on the inside! \n\nI can't wait to go back to SF!", "author": "Erin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-05", "description": "Mediocre deep fried fish, and chips that might have been in the freezer a bit too long.  Comes neatly wrapped in old newspaper.  Pretty bare bones but all the grease goes well if you've had some alcohol.  Also try it before alcohol; thats what I did the first time I came here, right before the Elite event at O'Reilly's.  \n\nAnd don't let the name fool you; there are no reminiscences of Old York.   Maybe the fryer is from there?  And the forty something year old Korean ladies who cold pass for twenty something? Go figure....", "author": "Summit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-08", "description": "Piccadilly is BACK! \n\nIt may be my imagination, but it was even better than before. I missed this place so much!", "author": "Darren M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "I guess things have changed a bit... I've eated at this plac on alomost every visit to San Francisco for the last 20 years.  I think the ownership/management may have changed, as there used to be a couple asian ladies (same ones) every previous trip and this time there was a couple asian guys I'd never seen before.\n\nThey were nice enough, but the fish wasn't as good.  The pieces seemed smaller and were cooked in the fryer a bit too long... not enough to burn, but got that extra hard at the ends dark crust that's right before burning.\n\nI asked for some tarter sauce and instead of pouring it out of a pitcher inside the refridgerator as had been the past practice, I was give one-(1) very, very small plastic container the wasn't even filled.  It was enough for only one of my 3 pieces. Kinda felt like if I asked for another, I'd be charged for it. Anyways, I ate the middle out of each of my fish pieces (didn't get any chips) and left.\n\nSad to say... it was not a memorable visit...", "author": "Gregory S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "Pretty damn good fish and chip without the jet lag. Its an old school restaurant. You can tell by  fryer that's behind the counter and the cash register that doesn't use electricity. There's about half a dozen little tables and I wouldn't consider this a first date restaurant. The fish and chip was awesome! Some say it was greasy but I thought the opposite. C'mon, its fish and chip! The corn dog was pretty good if you can make room for it.\n\nA couple friends from Scotland tried it out and they can vouch for it being fairly authentic.", "author": "Gilbert D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-04", "description": "My parents are here visiting and Dad wants fish and chips. But I don't want to take him to Pier 39 or the Wharf. Where to go? Hubby quickly punches in \"fish and chips\" in his iPhone and up pops this place. Cool! \n\nThe verdict? Again another place I have to say just OK. Even with all the malt vinegar and tartar sauce smothering my fish, I still couldn't taste much of anything except the batter.  It is also twelve hours since we ate there and boy my stomach (and my hips and my thighs) are hating me for all the  oil! But as far as fish and chips places go, I would go back again if the craving strikes - or if Dad wants to re-visit this truly San Francisco experience:)", "author": "Melani A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "English fish and Chips? Maybe...but not to my liking! Service was friendly enough, but lots of translation issues. Owner of shop is Asian, and talking to him you realize he doesn't always really hear what you're saying. We ordered 4-piece fish and chips, which we asked to be wrapped in newspaper. Instead served on regular paper basket. Malt vinegar was Californian...c'mon folks, at least the vinegar should be the real English stuff. Fish tasted authentic enough, but batter was heavy and tasted undercooked on inside. Chips tasted like bigger versions of American french fries. Sorry but I like the soggy, English kind drenched in Vinegar and grease. Overall I would say I was disappointed!", "author": "Tara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-11", "description": "I was surprised how good the fish and chips were at this place!  It's a small hole in the wall but clean place, and the owners are really friendly.  The fish is surprisingly light and buttery and the batter nice and light and crispy.  The fries/chips are cut chunky fries style.  I would advise extra vinegar with your salt and vinegar.  It's good with the regular amount of vinegar they put in but it's even better if you ask for extra vinegar.  \n\nIf you do take out, just remember, all this fried get soft and soggy eventually.  It was still nice and crispy 10, minutes after, likely anything longer than 15-20 minutes will be a less crispy and light tasting fish n chips.  Ps, the fish stays crispy longer than the chips.\n\nI really like this place.  I'll be coming back.  Five stars for what it is. Fish n Chips.", "author": "Animal K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-04", "description": "I recently moved from New Orleans where surprisingly there are no fish and chips. That's left me craving them for the past couple years with no satisfaction. I stumbled upon the reviews here and figured I'd run out to try it out. A friend came to town to visit and we headed over. \n\nThe experience is great. We took pictures as the lady battered and fried our fish in that huge fryer. The fish was far too greasy for my taste, but the fries...those were amazing. I'll definitely head back for the fries. Maybe I'll stop and grab a burger on the way.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-13", "description": "I love fish and chips... I mean I really love them. Perhaps I should say I love good,traditional fish and chips, which this was not.\n\nIf you are longing for traditional crispy battered fish, I would not suggest coming here. \n\nThe fish and the fries reminded or the stuff you find in the frozen section of the grocery store. I take that back, I love the cod in the blue box from TJ's which is way better than this..\n\nPoint for being withing walking distance of work (though I won't go back for the fish or the chips). Point for nice people working there.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "So simple so good, \nSwimming in Malt Vinegar, \nWrapped in Daily News.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "I have no idea what these people are talking about but this place is really really good it has the best fish and chips in the world omg!!!!! You need to check this out! no doubt it'll be perfect. I can't wait to come back. :)", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "Definitely my favorite fish & chips in the city.  I've tried the fancy places, but I keep running into weird pieces of fish--too hard, too bony, \"off\" taste.  At Piccadilly, the fish is always consistently good, not too thick, super crispy and greasy just as fish & chips should be.  I don't know about their tartar sauce because I am a malt vinegar person all the way, and at Piccadilly you never have to ask for malt vinegar; it's all over the tables.  Get some Coke to cut the grease.  The workers are friendly and the counter service works.  It's sparse, the neighborhood is spotty, and the place has no character to speak of, but the food is what I'm after.  I'd recommend getting your order to go for two reasons:  first, you get newspaper that way, and second, the place is pretty grungy and I sometimes get grossed out while eating there if I look around too much.", "author": "Lorelei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "I found it funny that the woman on the phone asked me when I was going to be there to pick up the fish and chips... but it made sense when I got there... I was five minutes late but they pulled the fish right out of the fryer! \n\nI loved the way she wrapped it up in newspaper (a very british trademark) \n\nThe fish like others pointed out was a tad bit greasy for my liking... however it was fresh... so that alone gets four stars \n\nyou do have to request tarter sauce... but I'm not a fan of it... she put the salt and vinegar on for me... it was the right amount too... \n\nmy favorite so far", "author": "Peta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-17", "description": "Being a true Englishman there are times when I crave a serving of Fish & Chips. When I do, the only place I think of is Piccadilly on Polk Street.\nI have been going there to satisfy my craving for more years than I dare to count and always I am totally satisfied.\nWhen I go there, the only thing on my mind is Fish & Chips  - nothing else matters or warrants criticism.", "author": "Harold G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-07", "description": "OMFG.  So good.  Reminds me of Fish and Chips in the UK.  Really good.  Go here.", "author": "Fiid W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-01", "description": "You know what's great?\n\nFish & Chips\n\nThese are served by sweet little Asian ladies who fry up your fish & chips made to order. You can get 2 pieces of fish and chips for under $7. Ask for tartar sauce if you want it.", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-28", "description": "This little hole in the wall , \"mom and pop\" restaurant is a nice little place for a quick food filler. The price is cheap, with 2 pieces of fish and chips for $6. The place is all ran by one fridge, and a giant deep fryer. It's a very small little place with about 3  tables and sets of chairs around them. There is a counter area on the side, and a giant fridge with all the drinks for you to grab. The prices aren't bad at all, but boy ol boy is the food greasy. \n\nThey give you the food in a piece of wax paper then wrap it in newspaper, then put it in a brown paper bag to take out. When I opened the bag, it was a grease filled eating, but to my surprise, everything was still VERY crispy. I don't know the procedures behind what they did, but it was delicious. The woman was very nice, and also gave me 3 pieces of fish for the price of 2. With the price and the friendly service, I could oversee the small area. I give a 3 1/2, but with that extra fish, it pushes me to a 4.", "author": "Copernicus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "Piccadilly is our absolute favorite fish & chippery in the Bay Area. My wife and I are both Australians, so our taste's will not be the same as Yanks, but similar to Brits. Though I have to say our American friends are very keen on Piccadilly too; we drive from the east bay to SF just for lunch here, and would often go to Leland Tea around the corner afterwards for tea and chocolate chip scones.\n\nThe fish & chips here are beautiful and light. Fish is not too greasy, with a crunchy light golden batter. Pieces aren't huge so you have at least 2 with a relatively small serve of chips. The chips are the star of the show. Very thick, moist and just a little crunch.\n\nFried mushrooms are also a winner here.\n\nThe shop is family owned (at least for several decades now). Very very friendly people.\n\nLove it!", "author": "Benjamin R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-13", "description": "I thought \"chip\" was British for \"french fry\" but after eating at Piccadilly I think \"chip\" must be British for \"leaden strip of matter, purportedly  potato but tasting of compressed cardboard\".  I have never had a heavier, more tasteless french fry in my life.  The fish itself is okay if you eat it there, but who wants to do that?  I love fried fish but it's just so much better if I fry it myself at home.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "This place is great for what it is, a deep fried food shack. They have greasy made to order food such as chicken, fish, corn dogs and shrimp plus really addictive fries! The fries and fish are splashed with malt vinegar before they are wrapped and everything is tasty. Because it is made to order the service is a tad bit slow. My major complaint is their hours. It blows my mind they don't stay open late night. I can't even fathom the amount of business they lose out on with the Polk Street bar hoppers.", "author": "jen w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "i walked by a dozen time before i noticed picca,.. thinking it was another vietnamese cafe/sandwich shop. nope it a sweet korean couple cooking up a british fav. this is a no frills, no plates, plastic forks, pay when  you leave ...local eatary. \n\ni had two pieces of fish with chips for about $6-7. it came in a basket and i ate it with my hand until i finally got up to ask for a fork. The nice old man showed me basket of forks sitting on the counter..hmm optional i guess. my deep fried lunch was definitely greasy, but this isnt a complaint, i dont mind... i expected it to be oily. what i was surprised at was the lack of seasoning... the no frilly part. i expected it to be salted (like all american food..maybe English food  too ) and throat irritating... but it was perfect for my taste... plus great fries!\n\ni sat there listening to a man praising the owners for their delicious oysters/clams (even though the owner admitted it was frozen not fresh.) the couple even let people change their order after they placed it...how NICE! \n\nat the end of your meal dont'  be a dine-n-ditch jerk. the couple doesnt hand out bills so just walk up to the counter and pay. they're so trusting!", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-12", "description": "If you don't eat anything deep fried, then steer clear of this place...... you won't allow this four star rating to stand. The service has increased dramatically since reopening and they actually clean thier fryers now too! Tasty grea5y seafood. The fries /onion rings are good too, though I wish they had more options to mix/match platters. Coleslaw was aite. I will definately come back.", "author": "Eugene G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "A fish & chips craving came over me one recent Sunday afternoon. I journeyed from Portrero Hill to this area because I recalled a few fish & chips places dotting Polk St. Piccadilly leaped out at me what with its yellow signage and diagonal word placement. Parking was not difficult to find. Inside, it looked to be a popular spot. There was a family and a couple guys already seated and one man waiting for his to go food. I squeezed past them and waited to place my order. It took them a while to bring me the three piece fish and chips; I would have preferred it to come out a lot sooner. After I seated myself, a few others came in and got their food before me. Nonetheless, I was happy with the fish fry. I love me some fish & chips now and then. The End.", "author": "Evelyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-10", "description": "So after the rave reviews and Xochitl P. recommending this place, I finally checked it out. Got the three parts fish, one part fries thingie. All good, not too greasy comfort food. My fish tasted kinda neutral, though. I'm not sure whether that's supposed to be, but I recall having fish & chips in England that tasted slightly different. Will have to do a repeat visit to find out the truth. Because it's out there.", "author": "Roland A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-10", "description": "This is a great place for fish and chips if you like to eat deep fried globs of flour and frozen bits of what may have once been fish. \n\nI think it's the worst meal I've ever eaten in SF. But if I don't get sick tonight I'll promise not to tell anybody how below-average it was and we'll call it even. \n\nNaaah. Better spread the word.", "author": "richard l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "I like this place for the once every two or three month Fish & Chips Craving, lets face it if deep fried food was not bad for you i would eat here more often.  their combo plate is great 10 bucks and you get plenty of variety.  The Owners are very nice people.  Their Shrimp & clams are so GOOD!", "author": "Eric G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-19", "description": "How come only obscenely nice, cool, and funny people work at fish and chips places? Anyway, these guys rock. Go to Hemlock and get yer grub on at Piccadilly. There's nothin' better to sop up that delicious beer than fluffy fish.", "author": "Blake E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-12", "description": "Really good fish and chips.  Not the best atmosphere - truth be told, the place is kind of skank - but I haven't found better fish and chips in SF thus far.  The owners are really nice and definitely give some hands-on service.  The food is prepped to order so there is some waiting involved but nothing over the top.  I will definitely be back, for the food not the atmosphere.", "author": "prior O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-23", "description": "um yeah...where's the fish\n\nthis place was disgusting. \n\nshould have eaten at chai-yo across the street\n\nmaybe then i wouldn't have felt the need to follow up my meal with a hot shower.\n\nheavy greasy poorly fried ickyness\n\nonion rings weren't bad\n\nand the restroom was something out of a gritty drama involving street kids and methamphetamines", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "It is what it is. Well done Fish & chips, reasonable price. It's not a lot of things, but it is a decent lunch and I'll be going back the next time I'm in the mood for it. My girlfriend had the battered shrimp which was good as well. I was most impressed by the fries. I generally don't like thick-cut fries b/c they never seem to be cooked well, but amazingly these were. Crispy outside, cooked through, and barely greasy. It's fish and chips and a no frills place so it's hard to say much more about it, more than I'll be heading back before too long for more.", "author": "Ross M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "This is one of the last true fish and chips joints in San Francisco.  With it being one of the only options I'd have to say it's pretty good.  Fries are nice and thick.  You also have a choice of onion rings which they batter themselves.  The shrimp is pretty good and so is the squid.  They serve your order on sheet of waxed paper then wrapped in newspaper.  The Korean couple that runs the place is really nice.  Food is cooked to order and there's a good amount of seating.  Parking maybe rough at times and the neighborhood isn't that great.  Cash only so come prepared.", "author": "Terrence L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-31", "description": "This is the real deal, if somewhat bare-bones. Some of the best chips in the city. A little more upscale but pretty damn good too is Taylor's Refresher in the Ferry Building.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-04", "description": "If you want fish n chips, but don't wanna have to cross the pond for the real deal... Piccadilly Fish & Chips is the place to go.  Recommended by my buddy from the UK, the first time there, this Irish dude came in placed a humongo order, and couldn't stop raving about the authenticity.  Having  been there a few times now, I can totally attest to the food and its quality.  Also the folks that own the place and really sweet people and always happy to see you ;)  No hesitation on my part to recommend this family owned business.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-26", "description": "i FINALLY gave this place a try last saturday. i was craving something good and hearty to eat while i watched the montreal canadiens hockey game (fuck yeah, i subscribe to the NHL center ice package!). so i got the 3-piece fish and chips combo. \n\noverall, i thought the fish and chips were good and it passed my test - as far as fish and chips go, BUT i do have a couple of small complaints:\n\n1) the cook was having a coughing fit while she was cooking my food ... although, she turned her head as she was couhing, it was still rather troubling for me to see her hacking up a lung while she was in the midst of preparing my food.\n\n2) the grease had this sort of donut taste to it. so my fish kinda tasted like a donut. maybe they use a sweeter oil? who knows.\n\ni like their fish and chips better than most places in the city, so i'll probably return here when i have the craving.", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-14", "description": "So greasy, but soooo good! I'm so glad to hear that this place has reopened its doors. My only complaint is that they don't give you nearly enough napkins and the tables were always a bit sticky. Nevertheless, I know I'll be dropping by sometime in the near future...armed with a roll of paper towels and wearing stretchy waistband pants!", "author": "Nathalie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-10", "description": "I might rate the fish and chips at Wilde Oscar's better but this kicks the Old Chelsea/Edinburgh Castle connection to the curb.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-08", "description": "I hate to give anyone just 1 star, but, I must say... yikes!  The fish was nasty and the fries were just ok.  No ranch?  I ate 2 bites of the fish and tossed it.  AND I LOVE FISH AND CHIPS!!!  At least the soda was good.", "author": "Noneya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "Yum. Traditional fish and chips. Don't be deterred by the ambiance and general decor. They more than make up for it with the fried oysters.", "author": "Stefanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-30", "description": "About as authentic as you can get...or so I hear...except for the fact that in Ireland, they don't even use the piece of filmy white paper - just the newspaper!!  These fried goodies taste great going down, but if you've got a weak stomach, watch out.  These puppies are double dipped in at vat of hot greese!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "I have literally been going to Piccadilly for years - I think its the same two little Asian ladies that defy the aging process still working there. Usually some pretty interesting entertainment from the passersby, too.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-17", "description": "These Korean Ladies Keep it real, good service and good Fish and Chips.", "author": "erik e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-01", "description": "This is where Edinburgh Castle gets the fish & chips. It's some of the best in town. Yum!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-27", "description": "If you are in the mood for fish and chips, it doesn't get much better than this. The atmosphere kind of blows, but the service is friendly. And the fries - the fries!!! - they are some of the yummiest I've had. Crispy on the outside, but the inside has this mashed-potatoe consistency that is just glorious. MMM. But don't even think about putting ketchup on anything here. That malt vinegar is as essential to the fish and the chips as mustard is to a hot dog.", "author": "Sahra H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "I've been going here for 2 or 3 years now and i love it every time    Crispy on the outside and Moist on the inside.  2 pc with fryes 6.50ish.  Soda extra.  I wish they had reqular tap water instead of having to buy bottle water.   The owners are great, sweet couple.   I always try to sit next to the window and watch all the women walk by from the yoga studio...   One time I asked for some tartar sauce and ketchup.  She came out and scooped it out of a big tupperware.  I would of like to have a bar with condiments so I wouldnt have to bother to ask for another scoop.. Other than that  excellent seating, food and quick service.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-08", "description": "Ghetto place? Yes.  Run by two Koreans serving up English style fish & chips? Questionable. (Unless owners have changed.) But the end result is some really good and well done fish & chips.   I go home happy after eating there.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-08", "description": "Definitely not the best fish and chips that I've eaten.  In fact, I prefer the fish and chips at The Pig and Whistle on Geary or at the Wooden Nickel in Watsonville.\n\nThe real problem, I believe, is the oil.  It seems to be of poor quality and leaves a very oily aftertaste.  I liked the batter and the taste of the fish, I just didn't like the taste of the oil.  I ordered my fish with onion rings, which were OK--freshly battered, not a real crisp batter, but a soft barely crispy batter.  Again, the taste of the oil spoiled any good impression I had.\n\nI'll try Old Chelsea next time.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "deeeelicious fish and chips. perfect texture and taste, made even better with vinegar and same salt (as already noted).\n\nthe nicest cutest old korean lady behind the counter will total your bill on a huge calculator and show you the total. and if you order to go, it will be wrapped in newspaper, just like ye olde country.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "not bad.  if you're hungering for fish and chips, this is your place.\n\nits definitely made fresh.  you see the guy dip the fish into the batter and throw it into the vat of wondrously hot oil.  same with the fries.  not the cleanest place, not in the best area, but then again, most fish n chips joints aren't in good areas - similar to good fried chicken (applies to most chicken places except for honey kettle's in LA).  the older man who was cooking was really nice, and very friendly.\n\ndefinitely the joint for fish n chips and probably most things fried, obviously not much else.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "Been going to this place for over 20 years,but I had not been in a long time. It was still just as good! Crispy, a little greasy, lots of malt vinegar!! Great thick chips", "author": "ruby b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-10", "description": "i love this place, its a great fish & chips place in the city.  they also own another place several blocks away in between polk & larkin Old Chelsea.  the fish & chips here rock.  the fish is always golden & crispy, not too cakey, tender & flaky on the inside, the fries are thick.  best eaten with tons of malt vinegar & a touch of salt.  \n\nif you are undecided or wishing for some variety you can always order the combo plate which has oysters, shrimp, fish & chips.  either way you go you will not be disappointed, their food is good & you leave full.  \n\ntake out is available, they wrap their stuff up in newspaper just like in europe to seal in the flavors.  be forewarned, if you get take out your car will smell like delicious fish & chips for abit.  \n\npicadilly on polk returned from the ashes after sustaining a fire.  the sister store old chelsea is currently under rennovation but only opens after 4pm.  the decor in the picadilly is simple standard fare & the decor in the old chelsea is a bit retro & sterile, old funky 70's floral designed chairs & white washed walls.  \n\nthey only take cash so make sure you hit the atm before going.  \nstreet parking is not too bad at either location.  if you are in the area craving fried food you need to try this little gem.", "author": "larry s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-07", "description": "This place is nasty now.  It use to be good.  This is the last time i'll be visiting this place.  The oil was old and probably should of been changed.  The fish got smaller and still looked huge thanks to all the batter used.  If you like greasy tasting food cooked in old oil.  This is the place for you.", "author": "KandM L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-17", "description": "I eat here at least once every couple of weeks...the people who work here are always nice and courteous. I always get the 3 piece with chips and onion rings...and add cole slaw...there's other things to order like oysters,crab and prawns...they also have chicken,which is out of place and i don't really know if they cook it in the same oil as the fish...but the main thing is the fish and chips...add some salt and malt vinegar and you have a very filling meal...no beer,only soda and juices", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "Authentic Australian-style fish&chips.  The best I've tasted in the U.S.  The chips are nice and thick, and remind me just of the type of chips I used to get from the local fish&chip shops back home.", "author": "Juliet R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "Hands down the yummiest fish and chips with a ton of salt and vinegar place. The people who makes these goodies are always nice and place is kept pretty clean.", "author": "Diane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-10", "description": "Great Fish & Chips, and fried chicken too. Friendly service at great prices. If you love excellent and greasy Fish & Chips, go to Piccadilly. Don't forget to ask for the tartar sauce.", "author": "Ronnie Ray H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-02", "description": "My friend both got sick within hours after eating here... the ladies were very nice and the serving size was good, but definitely not worth the intestinal agony.  \n\nAlso, you have to request tartar sauce or they won't volunteer it.", "author": "Robb M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "The place does one thing. It fries the shit outta stuff. I don't know who was expecting a gourmet meal here. The fries are the bomb, the fish a tad greasy and they WRAP IT IN A NEWSPAPER. Don't go for the locale, the ambiance or the luxurious seating. Go for old fashioned battered and fried cod and thick, crispy steak fries. If you are feeling lavish try the scallops(add salt).", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-14", "description": "two thumbs down for the poor batter and crappy french fries!!!! there's way, way, way better places to get your fish and chips and i've been to three establishment that this place won't measure up at all.", "author": "Nelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-10", "description": "Surprisingly good fish & chips.  The older guy that owns it is awesome. He often gives you 3 pieces of fish when you order 2! You can't argue with that. Cheap and cheerful.", "author": "Gazza B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-21", "description": "After reading the reviews below, I had to check to make sure I had the right place.  How anyone could give this place more than two stars is inexplicable to me.  The fish was nasty -- it was chewy and still cold in spots.  The batter was greasy.  And the best part of all: when I asked for a fork, I was shown a try of recycled plastic forks on the counter, which had supposedly been washed but there were chunks of food on at least one of them.  I almost called the Board of Health.  Avoid this place at all costs.  Seriously.", "author": "william e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-31", "description": "After spending some time at S.N.O.B., my friend and I decided it was a little late to run over to Pacific Fresh.  Luckily a brief look out the storefront I noticed Piccadilly across the way.  since I'd heard this was a good place for Fish & Chips, and we were thinking of having that anyways, it was the perfect opportune to try it out.  Now I don't know what it looked like before the burned down, but it really wasn't an eyecatcher.  It seemed pretty bare, except for the giant fryers behind the counter.  While the menu seemed very lengthy with various seafood options, we settled on a 5-piece fish and chips meal with a side of onion rings.  Someone wasn't kidding about the grease.  While it was tasty, I definitely felt like a few zits were ready to form.  I'm pretty sure it was grease oozing out of the fish and onion rings.  A little too much for me....grease that is.  I prefer H.Salt Esq. Fish & Chips, where it's not as greasy IMO.", "author": "JeFF T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "I'm sure my other review explained it all.  Basically, this was the best fish and chips place out there in the city, but now I'm not sure how I feel about it.  I came by today with my father (like old times) and to our surprise, there was an unfamiliar face working behind the counter.  But this couldn't be.  I mean, the Piccadilly I knew had an elderly Korean couple working there, the sweetest people who enjoyed what they did at the shop.  We'd walk in, and we would always be greeted by the couple with warm smiles on their faces.  My favorite item on the menu?  Oyster and chips...with lots of malt vinegar...and a root beer on the side.  But then I realized that the outside of the shop did look a bit updated, the menu had slight changes (which showed that they no longer serve/cook deep fried squid), the root beer bottles in the fridge were replaced by canned soda, and the old cash register that never worked (but made a cute prop) was gone.  While I was waiting for my order, a sweet older woman came by and asked the man, \"Do you remember me?  I always sit over there (pointing towards the window seating area). And I always order the squid and the chips.\"  Now you see, the original owners would most of the time remember their customers. The old man was confused, and barely spoke english.  I felt bad on both ends.  Even when I got my order, the size was much smaller.  The oysters were tiny, but still really tasty.  And some of the chips didn't taste fully cooked.  Despite my slight disappointment in my visit/order today, I still think Piccadilly is the best out there.  And I'm really going to miss that sweet old couple who made my visits quite special.  I only hope for the best for the new Piccadilly!", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Ran into this Piccadilly Fish & chips randomly a saturday afternoon... and it was one great day. I am a big fan of fish and chips, not just any fish & chips, but the tranditional fish & chips. Lived in london for a little while and got addicted ever since. Haven't been able to find any thing even close in the state. Then when I walked in Piccadilly, I knew I was in luck. vingear and salt on every table... thick-cut chips and fish were cooked to order. Fish was juicy and tender, chips were fresh and flavorful. I can't wait to go back!!", "author": "MM G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "This is my favorite fish n chips in the city.  They are soooo good, don't expect any frills though.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-11", "description": "the sweet old Korean couple makes my order fresh and tasty, it just reminded me of New Zealand ... .. .", "author": "Flora H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-03-07", "description": "if you ever have cravings for fried foods, they fry just about everything here. yay malt vinegar!", "author": "Lijia X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-03", "description": "Pretty simple -- fish and chips or fish and onion rings. I'm not a big fan of fish and chips but I thought I would give this place a try. It might be good if you are into ye olde fish and chips but I don't think I will be visiting this place again.", "author": "Salil A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "for sure this is not the best fish & chips in existence, but i have a weakness for this place for several reasons. \n* extremely nice folks running the place\n* kickass vintage fish fryer \n* they always seem to hook you up with more than you ordered\n* very unpretentious & centrally located", "author": "Galen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-20", "description": "love this place. been going here since i was a young buck.", "author": "Avery H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-19", "description": "Came in once a long time ago.  Got a large piece of fried batter that had eaten a tiny piece of fish.  Cut it open to eat the fish and left the body of batter.  Tasted like old, brown, frying oil.", "author": "e g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "good place, salty, vinegar with the right sweet and salt. and ok owners./", "author": "Leigh McInnis Lee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-29", "description": "Piccadilly Fish & Chips has ruined me insofar as the fish and chips are so good I will accept no substitute (even though I have subsequently tried the fish and chips at other restaurants numbering in the double digits). The experience starts with the location, in the night life hub of Polk Gulch (don't accept the euphemistic other name that is used for that area!). After playing a live punk show in the nearby Kimo's bar, nothing is more satisfying then walking into Piccadilly later in the evening and smelling the aroma of delicious oil in the air, and viewing the spectacular sight of the imported (and aesthetically pleasing) English deep fryers. The star of the show is the fresh cod and potatoes used for the fish and chips, and this is what I would recommend one to order. The price is fantastic for the quality, and the rapidity of the cuisine creation is delightful. The fish and chips come finely wrapped in the newsprint of that week. The savory odor of the oil, breading, and fish is further drawn out when the vinegar is applied to the ensemble. The wonderful vinegar smell flies upward to the nose, causing a Pavlovian generation of saliva and awakening the taste buds for the pleasure that is about to ensue. The fish itself absolutely does not taste fishy, which is the first major reason that I find these fish and chips superior. The second is the quality and taste of the breading (who's ingredients and method of preparation remain a mystery to me). The potatoes are just of the right thickness and flavor to counterbalance the lightness and intransigence of the fish. My ideal accompaniment to the meal is a chilled can of Diet Coke, and for me the best way to enjoy any freshly deep fried food is when it is so hot that it must be washed down with cool liquids of some kind to avoid burning the mouth and tongue. The memory of the taste of the fish and smell of the aroma of the oils will haunt you for hours after leaving, reminding you of the multitude of delights that you just experienced.", "author": "Benjamin V."}
