{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "This is my second time coming for breakfast here. Both times I've had the Damn Cup of coffee and the French Toast. Oh man, the French toast! Bits of dark chocolate that melt slowly... so good! The coffee is very nice as well. \n\nI plan to return here for the same order every time I'm in the area!", "author": "Josh L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-09", "description": "Not sure what's been going on recently, but I've been super unlucky and have been finding random things in my food.\n\nToday was a rubber band in the potatoes from Picnic.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "Wow this place is really good. Picnic on Third serves comfort-style food crafted in unique ways.\n\nThere's good news and great news depending on how you dine here. If you are one of the many MealPal patrons that frequent this place, the 20 meal plan gets you a very healthy portion of a protein (usually chicken) and a side for less than six dollars! If you just order the standard meals, you'll get two large sides of you choice plus the protein and personally I find this option to be way too much food. Those people who complain that the MealPal portions are too small are clearly used to eating at Chipotle or something for lunch because it's more than enough.\n\nI've had a bunch of different dishes here. I think my favorites have been chicken that has featured a mustard dressing of some sort but honestly all of them have been really good. They have plenty of great veggies every day but personally I'm partial to their broccoli and brussle sprouts.\n\nWhat's not to like? The space is pretty plain. You're not going to want to hang out here and chill out. Recently with Mealpal they switched from \"veggie of your choice\" to a pre-ordained option which is kind of a bummer because a lot of us have dietary restrictions where we were relying on Picnic for veggie options, and now they often have rice a couple of times a week (not to mention root veggies like carrots) which can be off limits for some people.\n\nAll in all, a great place for breakfast and particularly lunch. Recommended!", "author": "Matt M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "I hate to give this place 3 stars because food is it's really excellent most of the time but I find their portions to be all over the map. Most of the veggies are overcooked. Meat is always perfect. \n\nIf you go in as a regular customer you get a huge massive portion so much you can barely finish it. \n\nIf you do Meal Pal you get portion leaving you hungry for a second lunch! so unless you're on a diet, they are skimping on the food. Sad.\n\nAdditionally the ladies that give out the food are not happy, never smile don't really great you. Very poor customer service.", "author": "Elizabeth J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-12", "description": "Stepped out the Mercedes, walked in for what we thought would be a great first meal of the day but were greeted with disappointment. Nothing else to say except came here during business hours and we were told they are CLOSED! Long story short, it definitely wasn't a picnic.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "I love that they have a changing meal. The food tastes very homemade and the meat is very tender. The options are very healthy and the staff is friendly.", "author": "Lucy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Charming place overall. A lovely ambiance and I loved the yogurt and granola dish sweetened with homemade apple butter. This place is full of cuteness. \n\nMy only minor complaint so far is that the tea service is about normal for SF/America, which is to say, not that great. Nice selection of fancy-looking tea (Lavender Earl Grey!), but the little spoons at the tea service station are too short for the tall mugs, and there's no dish provided to deposit the used tea bag, for those of us that don't want tea to steep forever. An option for a pot of tea would be lovely for communal tea. Like I said, this is all minor and par for the course for American tea service, but given how cute this place, I think some sort of dainty, well-thought tea service might be a nice addition, perhaps?\n\nBathrooms: Only one single-occupancy unisex restroom, but spacious, clean, and functional.", "author": "Jimmy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-09", "description": "I've been here twice so far (disclaimer: for lunch, not brunch). I enjoy the aesthetic, and there's always table space to sit down (I work in the area and have had two lunch meetings here).\n\nPicnic on Third does combination plates- pork, chicken, and vegetables, in addition to offering items a la carte. I went for the veggie option. The service was quick and efficient, as others have mentioned.\n\nOne hiccup: I paid for a komboucha and was told they ran out by a staff member. I decided to wait it out while they refilled it, but was then told the pipe was frozen by another staff person. I was offered a coffee in exchange, which is definitely not the cost of a komboucha.\n\nNo, it's not a $20 difference, but the cost of the overall experience doesn't leave me wanting more. But- if you find yourself in looking for a business lunch, this could be the right situation.", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "First time here! I was on my way to work, and decided to stop by for breakfast. I had \"just a damn breakfast\". It came with eggs, chicken sausage, and potatoes. The food was great, and I will be coming back here again!", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "The braised beef plate was excellent! So was the agua fresca and cold brew coffee. Everything tasted so fresh and delicious. I can't wait to go, again.", "author": "R S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "3.5 stars. \n\nI like this concept of this place. I really want to like the actual place. But after a few times I find myself having a bit of a mixed reaction. \n\nFirst, let's describe this place a little. They serve a menu from one cuisine daily, so you something a little different every day. They have a few proteins to choose from, and there's always a vegetarian option. There are also special drinks, desserts, or something to snack on that you can buy. The restaurant is small, and you order first before finding a seat. \n\nEverything they have sounds good on paper, especially if you are diverse tastes. It will always be interesting. \n\nMy main gripes? Both times I went, there was a little something off with my dish. I usually get one of the main compositions (meat or vegetarian), and I remember a little bitter taste or a little weird flavour in the dish. Not sure if I munched on a bit of a spice pod or a burnt bit - but it stuck, and sorta made the dish much less perfect than it would have been. \n\nPlus, the dishes are a bit pricey! I realize this is in the city, but I don't work for a fancy start up and so dishing $14 for a normal plate of food seems a bit much. There are way better deals in this part of town. \n\nHowever, the \"one cuisine a day\" concept kept me coming back. Guess I'm still intrigued by surprises!", "author": "Alice C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-25", "description": "I had an egg sandwich 2 weeks ago to go, the English muffin was either old, moldy, or something else bc it tasted like a bums a**hole. Quality control kids!", "author": "Penguin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Picnic on Third is one of my favorite places to think in the morning. Their mornings are usually not too busy and their loose leaf tea hits the spot in the morning. Aesthetically minimalist and nice open wooden counters allow people to digest without clutter.\n\nThey're menu is ever-changing and I personally think that people would have polar opinions as their dishes normally have strong flavor profiles. This taste makes them unique, but also can be a bit too strong at times. I've tried a few dishes from time to time and their meats and vegetables tend to be either starkly salty or have strong bites of acidity.", "author": "Dion L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-10", "description": "The quality of the food is fine but considering the price their plates generally leave something to be desired.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-14", "description": "TLDR - Low-key, casual place with delicious, healthy compositions and reasonable prices\n\nCame here for Sunday brunch and really enjoyed the food, especially given prices for all the dishes were $15 or less, which is hard to come by for brunch in SF. But sadly, they're no longer offering weekend brunch! I don't work around the area so unfortunately probably won't get a chance to return anytime soon.\n\nI really liked the vibe of the place. Small, quaint, lots of light, casual, laid-back atmosphere. The menu isn't very big, which makes ordering easy, and the food is pretty simple but still delicious. And pretty healthy, well-balanced options overall.\n\n* OVERNIGHT CHILE BRAISED PORK ($13) - 4/5\n[poached eggs, cheddar grits, braised collards]\nI'm usually not a fan of Southern-influenced dishes like grits and collard greens, but I actually really enjoyed this. The pork was tender and flavorful; the eggs were nicely soft-boiled with a runny yolk; the grits were creamy and buttery, but not at all heavy; and the greens were tender and not overly sour. The chile salt on the eggs was a nice touch too.\n\n* CORNED BEEF HASH ($12.50) - 3.5/5\n[fried eggs, fingerlings, brussels, horseradish]\nSo they actually ran out of corned beef when we came and said they would substitute with a pork instead. Little did we know that pork actually just meant some simple bacon, not pulled pork like I was expecting. Had I known that, I would've asked them to use the chile braised pork instead. I think without the corned beef, this dish was pretty lackluster. The only saving grace was the brussels sprouts, which were delicately crispy and buttery.\n\n* STEEL CUT OATMEAL ($5)\nServed with some sort of sweet jam and nut butter. I'm not really an oatmeal person but I did like the jam and nut butter.\n\n* HOUSE YOGURT & GRANOLA ($5)\nI wasn't expecting much from yogurt and granola, but the yogurt was surprisingly good. Thick and not too tangy. Good granola too.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-08", "description": "A cozy, casual neighborhood venue that offers entrees that are inspired by home cooking and are rotated every day.\n\nI've visited at least three times over the years, and from personal observation, the best time to come here is probably during lunch. Although it gets quite busy here at this time, everything is also being pumped out reasonably freshly. If you get here earlier in the day, there might be some limited breakfast offerings. If you get here late in the afternoon, they might have already sold out of a lot of items, or they might be reheating things from earlier in the day. \n\nEntrees do indeed feel like honest-to-goodness home cooking, although they can be a tad spendy for what you get. In any case, it's a nice place to pop into if you're already in the neighborhood and aren't pressed for time.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Yummm! Nice, clean lunch spot with a good amount of seating! Super cute ambiance and I like how they give you a display of food plated to help you make your choice. Display really doesn't do the food justice though...cuz there is so much variety and flavor packed into each plate, and it was deceiving.\n\nI ordered the chicken plate with a nice salad and sweet potato gratin. The chicken was tender, though there were some dry bits. The salad was super clean..with not too much dressing! And the sweet potato gratin was fricking amazinggggg!!!\n\nOne thing I would not recommend is the Vietnamese iced coffee....wayyyy too much milk and cream! I had 1 shot of espresso and I'm pretty sure the rest was cream! Eeks!\n\nAside from that, it was soo delicious and definitely a nice spot to meet up a friend for lunch or even as a go-to option. Come early though, it gets super packed during the weekdays... I've seen the line go out the door! Will have to come try it for breakfast on of these days!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Love this restaurant and their daily changing menu with one veggie option and two meet options. I've been here for lunch at least ten times and never ever have I had a dish I didn't like. Its a surprise every time what will be on the menu. With tip the lunch ends up being around $16 which i think its a little bit pricey for a lunch but it's definitely worth it. The food feels very fresh, healthy and homemade. It's a great restaurant for vegetarians.", "author": "Xi-Er D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "You straight up will not find a better breakfast in SF than their corned beef hash. It has real chunks of juicy corned beef (not from a can) with perfectly crispy taters, Brussels sprouts, and topped with gorgeously fried eggs. It makes me so happy.", "author": "Molly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "This place is on point.  Great concept and execution.  Well worth the night out for this cleaver experience on a date or with a large group.", "author": "Dan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Wow! This place had all my dreams come true.\n\nThey combined serious culinary capabilities, with good ingredients, and left out the white table cloths and pretentiousness.\n\nYour order at the counter, get a number and they bring the food to you when it is ready. The location is not in the best place, however, it was convenient for us.\n\nWe came here for brunch and everything we had was FREAKING AMAZING.\n\nCoffee, pastries, eggs, everything!\n\nThey made this amazing gluten free blueberry muffin that was to die for.\n\nThe egg dish was perfectly executed from how the veggies were not overcooked to the perfect egg.\n\nWe will definitely be back! They exceeded my expectations.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Had lunch here with my wife today and it was like a picnic indoors!\n\nWe had the lemon chicken, beef moussaka, and curry soup. Everything was delicious, but I especially liked the moussaka as it was flavorful and went well with the brown rice. It was comfort food to me. I couldn't believe I was eating brown rice as it was so soft and tasty!\nThe side of salad that came with it too was fresh and had the right amount of dressing, oil, and nuts. \n\nThe place has a hipster-rustic theme which was inviting. I noticed there was also a full menu to get your coffee fix as well. The staff was friendly.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-19", "description": "I came here a little after 11AM on a Tuesday with my sister. The place was empty - literally no customers - and the woman behind the counter just looked at us blankly when we walked in. When I asked for a menu, she said it was on the chalkboard and gestured to the wall behind us. (I should clarify, she wasn't being rude per se but just very lackadaisical and seemed zoned out, which is whatever.) \n\nThey basically had three options: chicken, pork or vegetarian, with sides of asparagus, slaw, or rice (you pick 2 sides). I ordered the pork with asparagus and slaw after another employee told us you could substitute the sides. The pork was cooked well and was super tasty and hot, but there was a ton of fat. The asparagus was limp and room temperature and the slaw was weirdly oily.  My sister went with the vegetarian option which was literally one deviled egg, with like...probably two cups of rice and asparagus. I felt bad that her meal looked so unappetizing.. the deviled egg portion (seriously one egg?!) was a joke, on top of a huge mound of rice with some limp asparagus. Little dinner rolls were included which was nice but the rolls are clearly pre-packaged (similar to Hawaiian rolls, but with salt on top).\n\nThe total came to $27 before tip ($14 for the pork, $13 for the vegetarian) \n\nBecause this place is close and other reviewers have glowing reviews, I'll probably give them another shot, but as it stands the combination of extremely mediocre service and somewhat half-assed food, for now it's a 2/5.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Strong emphasis on real, in processed ingredients. Natural motif through restaurant. \"Real meals,\" like pork shoulder, smoked chicken, fresh salads, breakfast sandwiches, lentils.\n\nAdditionally: they do NOT want you pay with cash; AND they expect you to Bus your own table - keep that in mind when calculating your tip.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "It was ok, came here on a work lunch I did not have any choice in. The menu rotates and tries hard to be healthy but comes off kinda blah and depressing feeling. Their rice was very good, fluffy and enjoyable and kinda saved the meal for me. The chicken was meh and the salad was not great. I would not come back, but at least the quality of the ingredients were good even though the prep left a lot to be desired.", "author": "Baby J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "This cute spot has redeemed SF brunches in my eyes. \n\nI love it to pieces. I wish there was a 6th star to give. \n\nMy friend and I ordered the bacon (side dish), paleo muffin (yam, almond flour, and pecans), but the entrees were the showstoppers at brunch! They rotate the menus pretty often but if you can catch their corn cake jalapeno pancakes ORDER them! They were so savory, light, and fluffy. I loved the curled pieces of toasted (bacon?) on top and the cheddar cheese baked inside. \n\nThe polenta, slow braised pork dish was also PHENOMENAL. I could lick that plate clean. \n\nService was speedy, quick, and the ambiance is really casual, cute, and friendly. It doesn't get too packed and it is the most underrated place in the city. \n\nGreat prices too. $12-15 per entree, $5 per side. So good.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "I am still digesting my lunch from this place, so I will give you the nuts and bolts in list form:\n\nFood:  The food was not good, it was great.  Given the comparable options nearby, this place clearly stands out.  This was my first visit, and we came at lunch to order the \"Chicken Composition\"; that consisted of BBQ Pulled Chicken, Late Summer Heirloom Tomato & Cucumber Salad, Roasted Sweet Potato with Brown Butter and a side of house-made pickles.  \n\nService:  When we arrived at 12:15p or so, the line was out the door, but moved quickly.  Once we reached the counter to order, you could see why the line moved quickly - very efficient staff.\n\nExperience:  Although the line was a couple dozen deep, we were able to get a table to chow down.  The portions were generous and did not leave me wanting a \"lil' bit mo\".  \n\nI strongly recommend this place if you have the time to sit down and enjoy a well prepared fast-casual meal at a decent price.", "author": "Kendall B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "It's often not top of mind for brunch but Picnic on Third is an overlooked spot for a low key weekend brunch. \n\nOn weekday, it feeds a SoMa workers with a daily rotating menu than span cuisines from around the world. It started opening for weekend brunch this year and there are some tasty items on the menu. Begin by sharing a couple of their baked goods like the apple walnut bread for something sweet. For breakfast mains, I really enjoyed the two potato hash. It's surprisingly light and delicate for a traditionally heavy breakfast dish. A mix of regular and sweet potatoes is fried with crispy lardons, Brussels sprouts, and topped off with a fried egg. A delightfully unctuous herb aioli brings it all together -  a nice balance of texture and sweet and savory flavors. \n\nWashed down with mimosas, we enjoyed our relaxing weekend brunch. It wasn't crowded when we were here and found a table right away. I've heard that they now do bottomless mimosas which makes it even more a reason to return to this hidden gem for weekend boozy brunch.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "This review is for the coffee, since I have not yet had the pleasure of eating here. 5 stars for the most delicious latte I've had in a long time! \n\nI was in the mood for something cold, so I ordered the Iced Vietnamese Latte. Thankfully, this drink is not as sweet as Vietnamese lattes at most cafes, so drinking the entire thing is both possible and enjoyable :) Extra points for the egg yolk available for mix in. I had never tried this before, and the yolk added a heavenly layer of  creaminess to the drink. A must try!\n\nThe place itself is cute and cozy, and located just a few blocks from my office in SoMa. I'll definitely be back for lunch sometime soon.", "author": "Yasmin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "What a cute place! And for a restaurant in SoMa, it's surprisingly NOT closed on Sundays. My boyfriend and I came here to meet up with some friends. We arrived and seated ourselves. It was apparent that we needed to order at the front counter whether we wanted food and/or beverages. They were in no rush to see us leave, despite the fact that we were waiting for 30 minutes before our friends came.\n\nEverything on the menu sounded so tasty. I decided on the Corned Beef Hash because it contained fried eggs, fingerlings, Brussel sprouts, and horseradish. How does that NOT sound amazing?! Our food came in a timely manner, and it was phenomenal. The potatoes were a little dry, but I like the mix of textures and flavors. Would highly recommend this dish, though I believe the menu changes frequently.\n\nI like the vibe of this place, and the name says it all. It does feel like a picnic with friends, or it could be a picnic with strangers if you're seated at the larger communal table. It's a spacious restaurant with friendly service. It's a very \"take care of yourself\" type of place, contributing to the casual and laid-back atmosphere. I can imagine that lunch gets busy during the week, but it was pretty empty when we went on the weekend. I'd love to come back to try some of their other menu items!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Found this cute neighborhood breakfast/brunch spot through GILT city!\n\nIt's small and quaint inside and could be easy to pass by if you're not paying close attention.\n\nFood is delicious, portions are a bit minimal but it's nice so you don't leave overly stuffed and the food is quality.\n\nThe menu looks as if it changes daily but I'll upload the pictures of what we got: braised pork and farmer scramble.\n\nThe yogurt granola side is DELICIOUS - get that and share it!", "author": "Anastacia W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "What? No more Espresso! I get that Baristas and Espresso machines are a finicky lot, but to toss them both out? Too rash I say. A cup of regular joe is just too harsh to start the day!", "author": "Stephen I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "Based on the picnic concept espoused here, there's probably a right time to come to this place and alternatively a not-so-right time. Given their 7AM-7PM business hours, I'm guessing 6PM is not the best time to try the menu. It's not that anything is cooked improperly, but most of the food appears to be made earlier in the day and stored in containers (photo: http://bit.ly/1POnHlq). I wasn't aware of the concept behind this SoMa spot until I walked in and asked about the menu. It's a nice-looking space, a bit country kitchenish with an urban vibe. I decided to try the $8 Braised Beef Short Ribs but was told they don't heat up anything.\n\nUh OK, I guess I'll grab a plate and pour it on there myself. It was a generous portion for sure, with about seven thick slices of beef with gravy (photo: http://bit.ly/1P2p56F). It was high quality and pretty tasty, but oh how I wish it could have been warmed up. I also went for a couple of sides, the $4 Roasted Broccoli and the $4 Grilled Eggplant with Lemon & Oregano. Once again, they were good portions for the price, but eating them cold just wasn't doing it for me. I ended up packing most of it and bringing it home to nuke on my own. Perhaps I should have come with the mindset that this was a takeout spot to avoid a dining disappointment.\n\nFOOD - 3 stars...obviously well made but alas, stored in a container\nAMBIANCE - 3.5 stars...comforting sport to go with the comfort food\nSERVICE - 2.5 stars...gee, don't let the door hit ya on the way out\nTOTAL - 3 stars...guess I should have brought my own picnic basket", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "This wonderful Mission-esque Marina-esque location feels a bit out of place, but based on the skyrocketing rent in San Francisco, I suspect they were happy to open the doors anywhere they could. \n\nI absolutely love (when it's effective and execution is right) the down home, laid back, charming crunchy granola concept. This place, for me at least, is crunchy in a good way.\n\nI've never ordered poached eggs. Not once. I've seen them on Food Network, I've heard great things about what I am missing and on this day, it happened. I saw \"slow cooked pork\" on the menu and quickly ordered it. As I sat at the table, staring out the window at the world passing by, I saw the menu posted on the front window. From the inside out, I could see the item I ordered and poached eggs were coming my way in a matter of moments. My immediate thought was, it's not too late. I can run back to the lovely gal at the counter and tell her that I'm scared of runny yolks. I could run so fast there and back that she's focus more so on my energy than my request. I realized shortly thereafter that this was the day. The day to try what everyone has been so fascinated with. \n\nThe dish was flavorful, the pork was tender, the soft polenta was delicious and I sliced through the poached eggs, one at a time, and mixed the pork, sauce, polenta and yolks together. Pretty darn good. Pretty darn good, but runny yolks, as I anticipated all these years, just isn't my thing. \n\nI pulled up the website when I got home to learn more about this wonderful restaurant and the ever changing menu, created by different chefs each night, seems intriguing. I will be back this Sunday for more. In fact, I do a sports podcast a few blocks from here every Sunday and I told my crew that we should meet here before the show to grub and prepare for the show. I wanted to try the coffee on my first visit, but I literally had 2 large Philz shortly before I arrived so I will checkout the caffeine this weekend for sure.", "author": "Hector G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "You may scoff at the prices, but in an area where all you can get are mostly sandwiches, salads, and wraps, a nicely plated warm meal is extremely welcome.\n\nHere's how it works: You peek at the menu outside to see if there's something tasty to your liking. 99% of the time, there's two meat and one vegetarian option, although what you get is a mix and match of several dishes that mix to create a 'composition.'\n\nPros: Their slow cooked meats are usually pretty amazin'... that kind of fall-off-the-bone goodness. They're usually accompanied with some roasted veggies and a complimentary house-made sauce that they offer at checkout.\n\nCons: The lines usually run out of the door. Price can put off those who think a $15+ lunch is ridiculous.\n\nAll in all, convenience and quality delivered in a streamlined kind of  way -- for those of us who don't have food catered in the office everyday, this is an obvious 2nd best option (but in no way is that a bad thing).", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "Just had lunch for the first time here. Food is really good but the portions are incredible small. I paid $15 for a pork stew that I need a second one of if I plan to be full. Again - delicious food but slightly larger portions would be better to sustain until dinner. Also the house rmusic is ok but does not really present for relaxing atmosphere while trying to relax.", "author": "Wes B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I went to picnic on third for MealPal lunch today. It is chicken with a side and I picked the roasted veggies. Both are super delicious. I am trying to eat healthy and the combination is just perfect (minimal calories). Chicken is juicy chicken breast and roasted veggies has a hint of curry but not heavy sauces. Definitely will come back again.", "author": "Suki C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-17", "description": "Nice design. Limited brunch menu. Cute way to display your croissant (with a cazuelita, which is more associated to Spanish tapas or creme brulee). Located at a corner of SoMa that seems to be having always some sort of construction, its clean design and the signs outside displaying the menu will caught your attention. Is a cute place for breakfast but not convincing enough for something else. Pleasant atmosphere.", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "TL;DR - Ok food, high prices, weird service. \n\nOk, I'm all about paying more for food if the quality is there. But.... its really not.\n\nThe idea is kinda cool, you know, a changing daily menu. However, the quality is pretty similar to Lemonade (at like 2-3x the price)\n\nThere is no table bussing or anything. You get your food in a cafeteria style kind of line. One plate lunch was over $17 (w/ tip) Wtf? The portions were not what I would expect for that price tag. The mac salad was kinda water-y. The slaw was bland. Only the pork was kind of flavorful (but overly salty). \n\nYes, I'm pulled in by the cute concept, but I can't be ok with paying that price for just an ok lunch. \n\nFun to check out once, definitely won't be back.", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "Rude barista and closes before the stated closing time of 5pm. They stop serving food apparently by 2:30. Go somewhere else if you want a drink or food for happy hour. Here's what happened: Came in at 4:25pm- sign in the door said closes at 5pm. I was just looking for a quick glass of wine (happy hour would be nice) while I waited for a friend. The woman who served me seemed irritated I was there and before I even ordered, she promptly informed me they were only serving \"water, iced tea and maybe tea. Food closed at 2:30.\". I asked \"do you have wine?\" The barista seemed annoyed at this and needed to check if wine was still available... I should have gone somewhere else at that point. $8 for a glass of rosé and $7 for a can of beer. No thanks!!", "author": "Erin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "I had the pleasure of coming here on a Sunday afternoon for lunch. I chose to eat the two-hash which has potato totters with a lightly fried egg, brussel sprouts, green onion and bacon bits. Even though it was a light lunch, it was super delicious it felt pretty healthy compared to most other lunches I've had in the city. Everything was lightly fried or baked\n\nI really liked how everything blended together very well in the dish, they put a lot of thought of which ingredients to put, how much to put and even plated it fairly well. I really enjoyed this meal because it tasted so good together and I'll definitely be back again.\n\nMy friend got the pancakes and they were really filling but delicious. They had this cranberry-maple syrup sauce with real cranberries and pancakes that were made fresh with a unique batter that resulted in a nice thick pancake. You could feel the coarseness of the pancake as you eat it, like it breaks down into chunks, it's hard to explain but it makes it feel like you're eating authentic pancakes.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Nice people who take your order, fresh quality food, what more can one want.  Nicely decorated like some barnyard farmer's place, beautiful spice rack wall, wooden table.  Had the grits and eggs and brussel sprouts.   Steelcut oatmeal with strawberry butter?  My favorite is the fresh fruit bowl. Portions will leave you full and satisfied.  Very casual,  order, pay, take a number, place on your table and food arrives shortly.  Unfortunately,  brunch on Saturdays and sundays between 10 to 2 pm,  is quite limited time.  Plenty of parking and free parking on sundays.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-06", "description": "I feel like I'm one bad meal away from not coming to this place. Today they served lemon chicken, and not only was the portion small (1 piece of chicken + 1 piece of skin), but almost inedible because it was hard, dry, and greasy. \n\nThis place has a good concept-- home cooked dishes with daily rotation-- but like the food of an inexperienced home cook, the dishes are hit or miss, and most of the time, miss.", "author": "Apple M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Wow! Was not expecting this little spot on third to have such delicious and high quality food but it was fantastic!\n\nThe staff was warm and friendly and even though the place was pretty packed, our food was brought out quickly. The actually food was amazing. I got the smoked salmon and eggs and it came with a good portion of smoked salmon and perfectly scrambled eggs.\n\nThe place is small and quaint but perfect for a casual Saturday brunch. Oh, didn't have them but there's bottomless mimosas for $14!\n\nDefinitely my new go-to brunch spot!", "author": "Loryn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "This place is super cute! It's kind of tucked away but once you find it, you'll be glad you did.\n\nThey don't have much choices for anything, but my friends and I shared a charcuterie and cheese platter and I was pleased. I used a gilt city coupon so it was totally worth it... although I think I'll come back even without a coupon :)", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-21", "description": "I love the concept. Home-cooked food, fusion, chef creations. It's an incredibly popular lunch place in SOMA, and most everyone I know loves this place. \n\nExcept me. \n\nI've been here about four times so far, and the menu's always changing. But I've never been blown away by the food--in fact, I've always been slightly disappointed in my order. One time, it was a curry; another time, it was some type of poultry (which was overcooked). Today, I opted for the pastrami creation, which came with green beans sauteed with slice almonds and a latke. The pastrami wasn't great. The green beans were...uninspiring would be the best word, I guess, as much as food can be inspiring or not. There were several I ate that made me suspect these were canned, but I highly doubt they are. The latkes were overfried and hard as a rock on the outside. \n\n$15 and I left most of my food on the plate. I don't really know what to say about this place... I just wish the food tasted better.", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "During lunch time, Picnic is like a simplified version of Lemonade. There are a only a couple of combinations possible and for that reason, I prefer Lemonade. My lunch rating for Picnic would be 3 stars.\n\nBrunch is a whole other story. My friend and I were looking for a spot near both of us and she suggested Picnic. I was a little hesitant due to my prior lunch experience but Picnic's brunch truly blew it out of the water. This is a hidden gem that doesn't require you to get up before the crack of dawn and wait for hours in line to get served.\n\nThe brunch menu is small but each item is well thought out and executed. I ordered the cornmeal cheddar pancakes, which sounded interesting and tasted amazing. It was a feast for the eyes and the belly. The pancake batter was light and fluffy. The prosciutto and green onions added the right savory flavors to balance the dish. It was definitely an unique dish I haven't seen elsewhere. For $12, it was an excellent bargain and the portion size was deceivingly large. I would not hesitate to go back to Picnic for brunch.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "$20.20 for a muffin and lunch. My lunch was cold and the chicken was very dry. The muffin was delicious, but not $5 delicious. If you're made of money this is the place for you. If you like warm food, go elsewhere.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "I'm glad I got a Gilt deal that helped me discover this cute little spot! It was $25 for 2 coffees/juices, 2 starters, and 2 entrees (which would've cost about $35).\n\nNo wait around 10:30am on the Sunday after Thanksgiving. You order at the counter and seat yourself. Our food came out very quickly. The servers were really chill and nice. \n\n* Homemade chai ($4.50) - 2.5 stars\nQuite watery, a bit lacking in flavor.\n\n* Persimmon spice bread ($2.50) - 3.5 stars\nVery nice, you can definitely taste the cinnamon-y spice. Dense texture, a tad on the dry side, and the nuts go really well. \n\n* Brown sugar bacon ($5) - 4 stars\nVery delicious. Thick pieces, nice balance of the sweet and the savory.\n\n* Two-potato hash (bacon lardons, brussels sprouts, herb aioli & fried eggs. $12.50) - 4 stars\nMy boyfriend wasn't a fan, but this was nice and light, just what I was looking for. The potatoes were a tad dry, but they had good flavor. \n\n* Overnight chile pork & soft polenta (collard greens, sous vide poached eggs. $13) - 4 stars\nA bit heavy for me. I didn't like the collard greens, but I never like collard greens. It added a sour flavor. My boyfriend really liked this, and the eggs were just perfect. Polenta was fantastic.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "I really, really, really wanted to like this place but the food just wasn't good.\n\nI was excited to try this place after reading the reviews and seeing that it was inspired by Pok Pok. I was even more excited after I walked in and smelled the wonderful smells and talked to the staff, who were all energetic and competent.\n\nThere's a couple of issues with the food:\n\n1) Lukewarm. The food wasn't hot, it wasn't even warm. There is only so much ability for food that isn't hot to be tasty.\n\n2) Flavor. I got the chicken, my husband got the pork. We've had tons of fish sauce / larb dishes. This ranked in the bottom 20%. The chicken wings didn't have enough meet and there wasn't enough sauce. \n\n3) Under salted.\n\n4) Chai was just like foam. It barely tasted of a tea.\n\nThis place has all the makings of something wonderful. Maybe they were having an off meal. But we were underwhelmed and wish that we had gone elsewhere for lunch.", "author": "Lilly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Wowww! My co-workers told me about this place, first I was skeptical because I don't usually like Fusion dishes, but I became the biggest fan of Picnic!! \n\nEverything I've tried here really impressed me, they change menu everyday, 3 options everyday and one is vegetarian. I have yet to find a restaurant like this and they really does every dish very well, and really creative, you can't find dishes like that anywhere in one small restaurant. Not only the food taste good, it is usually relatively healthy, and the presentation is great, you can tell they really put alot of effort and heart to make those dishes.\n\nThe drinks are also very good, they change it up everyday too, that's why I have been here almost 3-4 days a week and haven't been tired of it.\n\nThe serving size though, is on the small side for the price ( about $15 for a lunch plate ), but I don't really mind because the food are phenomenal. \n\nThe people work here are very friendly and work fast as well, on a busy weekday lunch the line could get long but usually move very fast.\n\nI subscribed to their newsletter to see what they have for the week! lol big fan here!", "author": "Kassi O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Love this place. \n\nThey make the \"plat du jour\" concept of a delicious home cooked tasting entree and side set work. Maybe you're not sure what you're going to get but you're pretty sure it's going to be good. \n\nThere are enough options that you're not boxed into a today's special that is your worst nightmare but few enough that you don't really have to make any real ordering decisions. \n\nStyle is \"home-cooked\" and mixed ethnicity. I've had Asian style eggplant and slow cooked chicken; cous cous and Thai green curry with beef. So don't expect anything specific!\n\nLine is usually out the door but moves quickly. \n\nOnly real drawback? It's kind of expensive. Lunch runs about $15 with no beverage.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Good food, menus rotating everyday, 3 different choices most of the time. \n\nMeat and vegetarian options, and multiple sides to swap.\n\nI would say that the price is a bit high, but I am not sure of their costs so hard to tell.\n\nFood is of quality though, and I love that they have kimchi or other to-go options to complement the meal or take home.", "author": "Bruno P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Loving this place! I've only had breakfast here - specifically only the breakfast sandwich (with bacon). At $5 for something this delicious, it's too a good of a deal for me to try other things on the menu. However, what I've seen on other plates looks equally as attractive. Coffee is  as well.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "Cool concept, great decor. I'd need to go a few times to see if the flavor is better in other dishes but while everything I had was cooked well, it lacked flavor. What kind of mustard chicken doesn't taste like mustard? Loved their paleo dessert options. I had the carrot muffin and it was bomb for a gluten free desert!", "author": "Taylor F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "I was in the city for another convention and looking for a quick breakfast and a tasty adult beverage to start the day off well. Well... I happened upon this little gem of a coffee shop that just happened to serve awesome breakfast sandwiches AND had a nice assortment of local microbrews! So my morning was off to a nice start. \n   I asked and was quickly answered by the attentive staff what the draft beer selection was and got a great recommendation for the breakfast sandwich. I went with a light field (or something like that) IPA and a breakfast sandwich. The IPA was delicious as one could imagine and the breakfast sandwich hit the spot like a cannon!\n   The sandwich was a egg/cheese blend cooked perfectly but shaped a bit too perfectly  (looked like a McDonald's egg). It was topped with yummy bacon and served between two halves of an English muffin, YUM! Just the right sized bite to file my big day in the city.\n   If I lived in the city this could surely be a favorite spot for me, give them a try!", "author": "Mark F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "High quality, rotating food menu served in a cafeteria-like setting. Weird? Nah, not really. Think of your Chipotles or tech company cafes, but, well, nicer.\n\nThe day I went, they were serving up a slightly Thai-themed menu, where I ordered a lemongrass pork shoulder for my main, and bok choy and papaya salad for my sides. Great flavors all around, but the pork was far too salty for my tastes, and there was not a grain of rice to be had, which was unfortunate, to say the least.\n\nAnd while the prices are definitely on the higher side, I can see myself possibly coming back if I were in the area, just to check out a different menu. Given that I work all the way in FiDi, it's unlikely to happen anytime soon though!\n\n***Accessibility Info***\n\nVenue - A midsize venue, with pretty spacious/open seating. That said, the tables are a bit on the smaller / more narrow side, so wheelchairs may have trouble scooting themselves between the legs of the tables. **Edit** The owner of Picnic messaged me and pointed out that they actually have reserved wheelchair tables, which I'm pretty sure I made the mistake of NOT sitting at. So, bear in mind that while the two tops may be too narrow, there should be otherwise accessible tables.\n\nBathroom - Didn't try them, so no comment.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-15", "description": "I really wanted to like this place! The lil smiling squid on the cup is so cute! The decor is so chic and rustic without looking dingy. The concept is so simple. I rooted for you POT, I really did. So much so that during heated office debates about you, I defended your honor, despite never crossing your threshold.\n\nSadly, today that changed and I wonder if I should have just left it an idea. As I mentioned, the votes were not in on lunch, so I thought I'd give the breakfast a try. Had an almond milk latte, and while delicious and beautiful, it was pretty lukewarm. As for the sandwich (option for bacon: yes please!), as you can see from my picture it's 90% egg, and the other 10% bread/ bacon. Some people might like that extra egg but this thing was a beast, and i had to give up halfway through. I wondered: is the vegetarian version just one big egg puck? Unfortunately for me my tummy ached for the rest of the day: grumble grumble.\n\nService was quick and friendly. They have cute lil snacks for sale as well. Sorry Picnic, it's not a match for me. I'll still root for you from the sidelines.", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Granola was good and side of scrambled eggs was good. Good prices. Cute place. Service is as good. Will definitely be back.", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "I had heard great things about this place so my friend and I decided to try it out for lunch one day. \n\nI ordered the sampler plate with a little bit of everything, LOVE that they have this option so i could try a little bit of everything. \n\nThe food was tasty (mac and cheese, kale salad, green beans) but everything was mushy and the kale salad had a little too much dressing. Not totally sure if I'll be back.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Having recently returned home to SF, I noticed this place on the new businesses list no more than a few blocks away from home. With good reviews and an interesting menu I decided to stop by here for lunch today.\n\nThe interior is nice and new, with lots of seating and a full coffee bar. The service here was especially friendly and helpful with one member immediately coming up to me to explain the menu and tell me about the business as soon as I walked in the door.\n\nThe menu here seems to change ever day with the two owners also being the chefs. Each day they choose a different theme (like chinese, southern, indian, etc.) Your options consist of three plates, two of which are meat and one is vegetarian, but you have the option to get any of the items ala carte. There are also pastries from a couple of different bakeries around town.\n\nToday's theme was indian and I tried the Masala Roasted Chicken, the Lamb Curry and the Ginger Cauliflower, all ala carte. Both the chicken and the lamb were both pretty good. The cauliflower was not so great. \n\nAn issue that comes to mind while ordering and eating is that all of the dishes are simply sitting out in bowls and served from there. Perhaps this is because the business is new, but everything would be very much improved if they were kept under warming lights or some other way to keep it all heated up.\n\nOverall, I liked Picnic on Third a lot and I look forward to returning here to try foods from the different themes that the chefs come up with. I also like their location and the feel of their shop. I'd definitely say that \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "I searched for Paleo on yelp.  This was a little out-of-the-way, but the menu seems interesting. I'm glad I went a few block out of my way.   Great food, healthy, and good service. I have the pork shoulder and grilled cabbage. Both were excellent", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Little pricey, but what isn't in San Francisco? This place is good for brunch and has some yummy dishes! We got the corned beef hash and (I forgot the name) some kind of pulled pork with poached eggs on top. Also got the Vietnamese iced coffee that had the egg yolk mixed into it! I think its an option to add the egg, but do it! It makes the coffee so frothy and creamy.", "author": "Larissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "FAST and friendly service! healthy food! easy to get a table! i'm coming back again 2 days in a row. this is a huge win in my book. \n\nYes you will pay a little extra (~$13), but you're treating your body right. That's worth it. This is located on the same block as garaje, right near the freeway underpass. They have beer and wine if that suits your fancy.\n\nThe menu changes every day so be sure to check the website for what's upcoming. Today I ate the most tender chicken, smashed potatoes, and radicchio.", "author": "Kailey O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-07", "description": "Very cute concept (and website design, for that matter), but unfortunately, the picnic we picked up was incredibly salty, the meat was dry, and in general just devoid of flavor. The boy brought their specials of the day to my office for an afternoon lunch, and while it was a wonderful gesture, we were both left very, very thirsty. We shared:\n~GROUND PORK w/WHEAT NOODLES\n~SEARED CHICKEN w/SAUTEED WATER SPINACH\n\nI agree with the comment from Alice S. - this food reminds me of home-cooking in a less-than-positive way.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "Picnic on Third is the way lunch ought to be: simple, delicious, nourishing and easy. You'll stand in line for a bit but don't worry because it moves fast. And because they make only a couple of mains and a few sides each day (all of which are ready when you arrive) you'll be eating your lunch in no time.\n\nEvery day the menu is inspired by a theme (hot summer nights) or a different place in the world (Hokkaido, Japan). On the day I came to Picnic, I had Harissa roasted beef, warm yellow potatoes and cucumber tomato and red onion salad with preserved lemon. It was one of the best lunches I've had in SoMa in quite a while.\n\nI can't wait to return!\n\nNotes:\n- Cookies are good\n- They have freshly squeezed grapefruit juice\n- You can mix and match the mains and sides", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Picnic on Third is my new favorite spot! It's my first time visiting San Francisco. I always like to try new places but when I ate here yesterday, I knew I had to come back! There is no need to try a new place when you've found one like this where the food is amazing, homemade, and where the menu options change daily! The staff is friendly and genuine, which makes the whole experience very pleasant. Thank you for this experience, I hope to come back to SF on a trip again soon and come enjoy more of Picnic on Third!", "author": "Tatyana M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "The brunch menu is very limited and the combinations don't work if you're vegetarian, as we are. I love Brussel sprouts, but with the bitterness of them with egg and potatoes, the combo didn't work.\n\nThe pancakes with cheddar cheese and scallions didn't work either.\n\nAgain, they may work better with the meat additions, but be warned if you are a vegetarian, the combos just don't work.\n\nEveryone there is super nice and the space is ok, nothing special, but with the location and us not being wowed, we won't return.", "author": "Ernest M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Awesome concept and fantastic, imaginative staple fare! Be prepared for a line when you visit Picnic at noontime, but know it moves fast! Order tasty twists on down-home favorites a la carte or as a full plate lunch. Grab a seat and tuck in, or get yours to go and head to South Park. Always a winner.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Solid lunch option if you are in the SOMA area. Today a group of four of us came for brunch and we all ordered 4 different things which was coincidentally how many different brekkie entrees they had. \n\nSides: Yogurt with granola and side of fruit-fruit was really sweet, seasonal, good portions. Granola tasted very high quality-house made\n\nDrinks: Grapefruit juice-fresh squeezed; iced latte-very good\n\nEntrees: The hubs had the potato scramble hash with bacon, I had the pulled pork and polenta. Both were a little heavy handed on the salt if it was just a little less salty it would have been really good.\n\nThe ambience is nice, a little neighborhood cafe, not a lot of room for large groups though with the exception of one table that could squeeze in about 8, all the other tables are for 2-4 max.", "author": "Betty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "ALL THE NOMS. No. Seriously. All of them. \n\nEvery single time I walk in here, which is on average one to two times a week for lunch, I think to myself \"this is the most underrated place in the area -- if not the entire city.\" \n\nThe food is hands down phenomenal. Every damn thing I've had here. Amazingly delicious. And for the SAME price as my standard do-it-yourself salad at Whole Foods. For the portion and the flavor, they could charge twice as much. Hell, I'd pay twice as much.\n\nIn the meantime, I'll give it 5 stars and still call it the most underrated restaurant in the city.", "author": "Meredith O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "tl;dr High-quality ingredients prepared in a not-that-interesting way.\n\nThe line at HRD was too long, so decided to give this a try. I got the $13 vegetarian combination. Quantity was good, and it was a good mix of ingredients, but some of the texture was too mushy for me. Flavor on the bland side. There were salt shakers on the tables but I didn't see any pepper, and I'm a pepper kind of person. (I could have gotten chimichurri sauce but it's hard to un-do sauce once you've done it if you don't like it.)\n\nThey appear to be card-only. They use Square, which I don't like because they sent me my signature through email, which isn't necessarily secure, so I usually try to pay cash with Square vendors. Also, Square's default tips choices are No, 15%, 20%, and 25%, which is high (I'm not going to no-tip) for a place where you order, pay, and pick up your order at the counter and bus your own table. Sure, I could have done the Custom Tip option, but I was already not happy with having to use Square and wanted to end the interaction as quickly as possible.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Such a great place to eat.  I work in the area and the restaurant is a standout.  Great friendly staff. Menu changes daily, always a hit the food is fantastic. Varied by countries or type of food.  They do know how to cook and great food.", "author": "M Jake M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Came in to try the breakfast sandwich one morning and I'm now a regular morning customer here!\n\nGreat little cafe for doing work. South Park is around the corner but this place opens early and has free wifi. Usually there's just a little foot traffic coming in and out to get coffee but no one ever sits down.\n\nThey have an UNBELIEVABLE breakfast sandwich (get it with bacon) for $5 and they serve contraband coffee (another one of my favorite cafes). The staff is always extra chipper in the morning, the place is clean and the music is great.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "The food was pretty good. I just got a lunch to go (sausage). Definitely prepared after I ordered it and didn't taste like it had been sitting under a sun lamp. \n\nI would probably eat here again, although probably not every day. \n\nIt does have a nice atmosphere and it is good for lunch. Definitely quieter in the late afternoon, say 3-4pm. Good for getting stuff done.", "author": "Elliot L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "I wish I could fit Picnic on Third into my kitchen. This is where I want to be on a Sunday morning. Coffee, various parts of pork cooked in different ways, all covered with eggs...is everything I need to prepare me for Monday.\n\nMinus 1 star for location, it should be closer to my house.. Parking is a hit or miss.", "author": "kim w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Good food but super slow.  The ready to go stuff you get right away, i.e. Muffins, breads, yogurt etc... but the main dishes that need cooking take a long time.", "author": "Chi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Lovely new restaurant in SoMA! It is a bit on the pricier side (lunch can be around $14+) and the portions are a bit small but the food is delicious and I love that the menu changes everyday! I came here for lunch with a coworker when the menu was Filipino food (chicken and pork belly adobo). I couldn't decide on what to get so I ended up doing half half. So glad that they let you do half half for those people who have a hard time making up their mind! I have no regrets on either. The pork belly and chicken were both tender and cooked in amazing adobo sauce. For my sides, I decided to get rice and eggs (if you chose eggs they give you 2 hard boiled eggs). Both were yummy. I was tempted to get the mango salsa they offered at the end, but everything was a la cart and I'm trying to save for a wedding so I decided to hold back. I just might go crazy one day and pile everything on! \n\nThe place was pretty packed during lunch so it can be hard to find a seat but my coworker and I got lucky and were able to grab the last available table. Someone helps with pouring water and utensils are available at the table. \n\nOverall, good dining experience and I would come back but it would have to be when I allow myself to splurge on lunch every now and then. Btw - although the portions are small, I only ate half my meal and when I had the other half for lunch the next day, it was even more delicious! Haha...", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Great concept, great food, great coffee! SOMA has really exploded and in its wake a culinary scene has emerged! Picnic on Third is one of the noteworthy. It's a concept that is so obviously great that you wonder why it didn't happen sooner. It is a literal picnic on 3rd Street. The seating is counter, communal, or tables for two and the menu changes daily with three inspired \"Chef Compositions\" which is a selection of an entree, (options are usually a choice of beef, chicken, seafood, or vegetarian) with choices of sides. There's also the option to order a la carte to mix and match.\n\nThe menu follows a different theme each day. I came in on a day the menu was South Korea inspired. Since I usually opt for the veggie I got the Gochujang Roasted Tofu, which came with vermicelli noodles with green onion and bean sprouts, daikon with water spinach, cucumber and carrot salad, and house made kim chi. I've looked at the menus since and saw a Spanish inspired menu as well as a menu inspired by \"German Immigrants in 19th century New York.\" Oh the the brilliance of gourmet cuisine in a quick service setting. The possibilities are endless.", "author": "Clare B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-27", "description": "They forgot to mention their full price lattes come in half sizes if you ask for less ice. Who knew ice added so much space", "author": "Eva Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "It's tough to quickly and simply define why I love Picnic so much, other than to say that it's a combination of factors both tangible and intangible that just add up to magic. \n\nOn the tangible side:\n- A delightfully creative and diverse menu that changes every day, with 3 entree options that cut across cuisines--often on the same plate\n- Superb parfait with housemade granola and unique housemade jams\n- Solid breakfast sandwich\n- Great coffee--especially the cold brew\n- Excellent beer options for later\n\nIntangibles:\n- Laidback atmosphere--this despite the flocks of startup folks (myself included) that swarm the place at lunch\n- Fantastic staff--within a few visits, they'll know your name, how you take your coffee, and what you'll probably order for lunch. I love these people. \n- Real commitment to re-use--everything they make seems to turn into a kind of pickle you've never encountered before, or a great to-go option\n\nMy only caveat is that, due to the rotating menu, it's not a win every day. But tomorrow ... tomorrow will be great. \n\nGive it a shot, really.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "LOVE picnic. I come here several times a week for lunch but never get bored of the food since the menu changes daily. Their food is made with love, and the staff are just genuinely good, nice people. \n\nHighlights:\n1) I still dream about their ox tail. If you're lucky and come in on a day when it's on the menu, DON'T THINK and just freaking get it. And order an extra one to go. It's seriously that good, and such a deal for the price.\n2) Leigh's sourdough chocolate chip cookies are crack. If you see them on the cookie display, just get it. They sell out quick.\n3) Also, their almond croissants.\n4) The vegetarian options are legit. I'm not vegetarian (per above comment re: oxtail dreams), but sometimes will opt for their veg option b/c it looks so yummy. \n\nFinally, Chefs Natalia and Leigh are wonderful humans. We hosted a fundraiser event here and Natalia & Leigh are seriously the best. This is a great place to do private events. Thank you so much for everything!", "author": "suzanne l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Great spot for a weekday breakfast when you want to pretend it's actually the weekend and you're at a sumptuous brunch with loved ones. I also find their lunch to be generously portioned, I'd just suggest checking the website in advance to see what the daily specials are as the menu is pretty streamlined.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I've come to Picnic on Third for Sunday brunch, lunches, and happy hours.  I always find something delicious and nutritious to eat, and always walk away stuffed!  \n\nTheir lunch concepts are so well thought out and I love that the menu changes every day, it seems like they never run out of new ideas!  I look forward to their weekly newsletters so even when I can't make it out for lunch, I can spy on their menu for my own cooking inspiration.\n\nYou can tell the owners are passionate about this concept and their food, and it shows in every dish they serve. 5 stars all day, every day", "author": "Katie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Came here for a soft opening and immediately fell in love. High quality delicious food that nails excellence without being pretentious. Meals are served as plates: choose your protein and a few sides. 1 main + 2 sides runs ~$12, well worth it for the quality. There were only 2 main dishes and about 5 sides to choose from when I was there and they say that they rotate them daily, which I really like because it simplifies choosing (great for an indecisive person like me!), is really fast, and you know that you're getting something with fresh ingredients being prepared with lots of TLC. Also means that you can keep going back without having to sacrifice food variety!\n\nThey have both takeout and seating options. Friendly laid back vibe and cool decor. I hear they made the tables themselves out of butcher blocks & pipes (neat!)\n\nAnd the coffee - oh the coffee! - possibly the best latte I've ever had. I think they're using ritual coffee and must have some special high quality milk as it was perfection in both flavor and creamy mouthfeel. I will be back.\n\nEdit: Coffee update - it's actually Contraband Coffee & Halfwit out of Chicago", "author": "Alissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "This place is awesome. I don't give reviews often, but Picnic deserves it.\n\nI work in the area and am always somewhat frustrated by the limited healthy options. Yeah, I could trek to whole foods for a salad or the paleo bar, but I feel like I'm paying for more than its worth sometimes. After stopping by on opening day today, I'm thrilled to say Picnic delivers the goods, and is a welcome addition to the neighborhood. \n\nA needed departure from the fru-fru bistro fare in South Park, where a small salad costs a fortune, this place features simple but nourishing food. Choose your delicious meat, select your seasonal veggies, and sit down for a tasty meal in a chill environment. \n\nWhat more could you ask for?", "author": "Bryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "My husband saw this place near his work and we decided to try it. Boy am I glad we did. Fresh, authentic and fullllll of flavor!!! I had the chicken meatballs over grains, baba ganoush and a date chutney. Sooooo good.\nThe decor inside is beautiful. The kitchen looks like a large kitchen you would see in someone's home. The staff is very friendly. A must on your list.", "author": "claire m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Offering healthy, upscale cuisine in a café setting, Picnic on Third is a welcome addition to South Beach.\n\nWith a menu that changes daily, Picnic on Third is a new go-to lunch spot. One day uber-tender chicken, creamy smashed potatoes, and radicchio; another day super-succulent lamb, two-cous salad, and roasted eggplant. What's not to love?\n\nThe concept is simple: each day Picnic on Third offers two delicious entrees and three interesting sides. You pick an entree and whichever two sides pique your interest, plunk down $13, and enjoy. Of course, there are the requisite espresso drinks and pour-over coffee for caffeine lovers as wells as beer and wine for the imbibers.\n\nEverything is available for dine-in or take out, but, with the high quality of the food, you really shouldn't put it in a (compostable) box.\n\nThe fast, friendly service makes you want to return. Servers are upbeat, with just enough snarkiness to be funny.\n\nWord to the wise:  leave your greenbacks at home--Picnic on Third is credit only. At least for now. Until they see their bill from Square. Ouch.\n\nSOMA dwellers run; do not walk. Picnic on Third delivers tasty, reasonably priced, healthy food in a warm, casual setting.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "Everything you need from an SF lunch spot -\n\nHealthy portions\nAmazing quality and taste\nVaried menu\nVery quick for either a sit down or to go \nGreat ambience \nBooze!", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "This is by far my favorite lunch spot in San Francisco. New menu items every day, super fun and friendly staff, everything tastes incredible (no really, the masterminds behind this place deserve recognition for creating great dishes that are healthy and tasteful)\n\nAlso, the price is perfect - especially when you take into account the quality of the ingredients (everything is fresh and nutritional)\n\nBoom! Go check it out for yourself - you'll be glad you did! :)", "author": "William W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "They have several types of premade combinations platters to choose from, which they call chef's compositions. I chose the veg one and it did not disappoint. The vegetables were diverse and were nicely seasoned. Overall, this was a healthy lunch option.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Just tried their latte - was good! The service is nice and accommodated some customizations graciously. They have good seating, and have some nice options for lunch.", "author": "Gul G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "excellent brunch venue. enjoyed the overnight braised pork with poached egg on polenta. and a glass of house red. \n\nthe staff is friendly and thoroughly answered my questions.  \n\nwill definitely return on my next trip to the city.", "author": "Rob T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "ALSO, if you are looking for a totally delicious lunch for your office, they can do that too! Finding reasonably priced, quality lunches that delivers to FiDi for an office of 20 foodies is sometimes a pain, but I'll def be ordering from Picnic again. \n\nOur staff lunch was a hit with everyone, and they were so impressed with the daily menu change concept. It's really hard to do a variety of types of food very well, but they do it!", "author": "Adele A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "I could not love this place more!!! Why? Too many reasons to list. I'll try though:\n1) The most amazing and friendly staff, for real, super great service \n2) The food is SO good, everything on the menu, delicious \n3) The best vegetarian options in town\n4) Damn good beer on draft (perfect chill spot to snag one before heading to a game at AT&T)\n5) Seriously good coffee and baristas that know what they are doing \n\nHow do I know all of this? I work next store. Lucky me. I've had every meal there, and honesty will be sad when I'm not located right next to this spot.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "We came in on a Sunday morning for coffee and were presently surprised by the healthy, fresh breakfast items: homemade yogurt and granola, salmon and egg scramble, and fresh seasonal fruit (pomegranate!). The decor is chic, but rustic and the staff is friendly and mellow.", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Love, love, love this place.   We've been 4-5 times this Giants baseball season coming in on BART and usually arrive before they start serving lunch at 11:00. No worries, a great cup of pour over coffee while we wait.  Their food is healthy, fresh, creative and varied. We leave feeling comfortable, and satisfied that we've eaten well.  The concept is different, no set menu but always 3 protein options, and 4 sides.  Today we had lentils, green bean salad with a tapenade dressing, romaine salad with fennel and a delicious tomato and eggplant gratin. They always have an extra which is typically a sauce.  Today was a Salsa verde style sauce with roasted almonds.  Delicious - all of it.  Didn't have them today but their sourdough chocolate chip cookies are to die for!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Best lunch ever, best customer service ever. \n\nTheir cold brew with almond milk. Holy amazingness, I have dreams about it. \n\nAlso, the best almond croissant I've ever had (flaky, moist, not overly sweet). \n\nMenu changes daily, and is guaranteed fresh and inventive, with quality ingredients. The line moves super fast (they're pros) so even at rush hour it's still a quick, healthy, delicious option. I can't get enough of it. Thank you to the whole team for keeping me caffienated, fed, and laughing! :)", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "This review is only for their coffee and espresso drinks. Came by on a Sun early afternoon and the place was very very quiet. Our drinks were quickly made and we were on our way. My $2.75 cup of coffee was just average. The ambiance of the place was cute, especially the spice wall. Looks like most of the great reviews are for their food, which we did not try. The food menu I briefly looked at had only a few choices and they didn't seem to be very healthy. One thing that bothered me a bit was seeing jugs of juices left sitting out uncovered - not sure if these were going to be discarded or served to customers. Oh and not a big deal but they don't accept ca$h.", "author": "Yin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Great food and ambiance for Soma. It's tucked away behind the freeway and the place is either chef's choice or build your own à la carte meal. I ended up going à la carte until my à la carte became what the chef had recommended (basically all of the veggie options on one plate). The meal was Israeli/Mediterranean themed (I believe they change every day) and I love love loved my Israeli couscous (little pearls of goodness in your mouth!). The kale sale was also really good and I usually do not opt for kale or salad! One thing that was a bit weird was their \"baba ganoush\". Normally, baba ganoush is a creamy eggplant dip (similar to the consistency of hummus). Theirs, on the other hand, was more like softly boiled eggplant. Still good, but the description threw me off.\n\nI'd definitely come back here again to try some of their other themed meals :).", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "One of my issues with working at an office in SOMA (South Park) is the seemingly lack of lunch options, compared to the FiDi. I got tired of my routine of Chipotle/Freshroll in the Metron and the generally-flavorless Whole Foods SOMA hot bar so decided to try Picnic on Third. I must say - this is a really solid spot. The food is varied as the menu changes everyday so all cuisines seem to be equally represented. The flavors are also very unique and interesting - MUCH better than Whole Foods.\n\nThe thing that I like the most about Picnic is that you can order (veggie) sides for $3. So, whether you are very hungry or just a little hungry you can get the appropriate amount of food. I've found their sides to be decently large so two sides for a total of $6 is a good deal in my book. This is actually one place where it pays to be vegetarian/vegan. I'm always irked when restaurants charge the same for veggie/tofu dishes as meat - clearly meat is more expensive!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Probably the best meat loaf I've ever eaten... soooo perfectly moist, and with a burst of flavor! \nThe dessert chocolate chip cookie did not dissapoint either. \nBRAVO Leigh and Co!\nCan't wait to go back and taste other items on their menu ;-)", "author": "Kicka W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "This is the second time I've hosted a small gathering of friends at Picnic, once was lunch time and another was a happy hour time. Amazing, delicious food; thoughtful menus that make for fun combinations of flavors. The first time there was a bit of a Moroccan theme (a tagine, maybe?). At happy hour your food options are limited to charcuterie-type items, but they also have food from the lunch service packaged to-go for you to take away for dinner. The food they had to go was a few (really reasonably priced) items from an Asian-inspired lunch service that looked really delicious. We opted for that (so good) and the servers were nice enough to warm it up and bring it to us at a table. Great wine choices. Can't wait to come back to try out their brunch some day soon.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Fantastic fresh food. Limited menu, super seasonal. Gets packed at lunch. Easy to get things to go, and line moves pretty smoothly. Service is extremely friendly.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Way overpriced for what it is. I want to love this place and this was my second time trying it for lunch. I left barely remembering the food and still annoyed by the receipt, $19 for the veg lunch and a hot green tea! To wait in line while they scoop food from a pot onto your plate, seat yourself, then clean up after yourself does not justify $19. Plus the veg option is simply all the side dishes put together. There isn't an actual hot vegetation daily dish. I like the location and service is nice, but not going back. Much better high quality options nearby, ie Darwin on Ritch St.", "author": "LM H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-31", "description": "Got a breakfast sandwich. $5, okay...\n\nBut dang it's pretty small.\n\nAnd it's burned?\n\nAnd it's stuck to the material it was wrapped in?!\n\nWish I had discovered this before I got to work, would've asked for a refund. Waste.", "author": "Cameron H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "I'm a fan! I love that you can choose your own sides with the main dish. It almost feels like I'm at a cafeteria but the food is way better and higher quality. The service is also superb. \n\nWhen I came here, I told the guy that it was my first time here and he made it super simple for me to 'make my own picnic'. They were serving miso grazed chicken and a variety of side dishes. As a suggestion, the chicken is served with rice and some green beans. I was trying to be good so I skipped the rice and swapped it with an Asian cole slaw. They also recommended that I put some fish flakes on my cole slaw, and I'm glad I did because it mixed with the flavors really well. They also have some chili aioli that is the bomb. You can put as much as you want in your plate.\n\nThe menu changed day to day for lunch and dinner. I suggest checking it out on the website before you go in. And don't be afraid to ask for suggestions. They're super nice here.\n\nYou can also sit here or take your food to go. The ambience is really nice even though it's located on a busy street like 3rd.\n\nAlso, it's card only here. No cash!", "author": "Liezel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-13", "description": "Love the place but coffee is luke warm!!!\n\nI love this place great addition to our neighborhood, it looks clean, the food is awesome the people are super friendly.\n\nBut: the coffee is cold. Ordered a latte this morning and when I finally took it over to my table it was quite cold. I think the tin cups they use don't keep the heat well, it's not the first time that this has happened. Hopefully they get new cups soon and heat the milk more. Awesome place otherwise - but coffee needs to be hot!!!", "author": "Hugh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "Picnic is extremely homey, with its decor of distressed wood, ceramic cups and chalkboard signs.  Unfortunately, the food reminds me of home too. For those of us whose mothers could not cook, picnic brings back reminders of leathery overlooked meats, over seasoned main courses supplemented by under seasoned side dishes.  I have come here numerous times with various coworkers and taste many valiant attempts at fancy recipes yielding very whatever tasting results. Forgetting to blanch the greens, not tenderizing the meat, not using enough spices...  These are all mistakes I expect to taste at home, not in a restaurant that changes well over $17 for lunch and a drink.  To top it off, the food was served room cold.  It reminds me perfectly of coming home late and half-microwaving leftovers for dinner, very homey.\n\nThree coworkers and I came here for lunch, and not a single person cleared their main entree.  One person awkwardly claimed they were full, but I pointed out that the food was awful.  We all laughed and went to garaje next door for burgers.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-01", "description": "I think I'm in love with the concept more than anything else. First of all, \"Picnic on Third,\" what a sweet and whimsical name, especially with South Park so close. \n\nWith a plethora of lunch options catering to the tech crowd, I have to say the food scene in that area of 3rd Street is really difficult- there's Darwin, HRD, and Garaje all within walking distance! Picnic on Third's concept is fun, hipster, and very trendy. Their menus rotate every day and is always inspired by a global cuisine, which is really fun to just read about on their website You can pick any of their combinations - there's always at least one vegetarian option, or choose an entree and sides a la carte.\n\nThe cost is one of the bigger issues. While you can get a whole plate full of food, it will run you a good $14, which isn't really a good value for just lunch. Secondly, I think the food is really hit and miss depending on which cuisine/day you choose. I came to try Filipino food with adobo and I found it mostly bland. I got a lot of rice, which made me fairly full, but I didn't think it warranted a $14 price tag. \n\nIt's really a pity because the space is fun, bright, and communal feeling, with lots of tables picnic-style. On the upside the people who work there seem passionate about the food, and you can get lots of sauces for free. Haven't tried the coffee but they do have a cafe option with pastries and coffee. They also serve breakfast sandwiches now!", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Came for lunch when they were serving Chicken Adobo with greens on fried rice. ($10.95 ish). As you get your plate, you could have chosen to add extra sides like a tea simmered hard boiled egg (+$2 or 3) or mango salsa ($3). The mango salsa went really well with the adobo, cutting through the fat and salt in a good way. Once you pay, you find an empty seat. Utensils are available at every table. Seating is slightly limited and better for parties of 2.\n\nChicken itself was tender and easily tore apart with the fork. Rice was lightly fried to just have a nice crisp edge which was rather tasty.\n\nAs other yelpers have mentioned, it's a bit on the pricier side but it reminds me of homecooking with strong flavors that makes you want more.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Great staff. Awesome food. Delicious drinks. Cute place. What else could a girl want?", "author": "Briceyda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-17", "description": "Been there twice, both times I liked how the food tasted, but it was cold. The sides are just sitting there at room temperature when they serve it. Why do you do this? We're not talking about a salad -- Brussel sprouts and squash are usually served hot. Way to waste otherwise tasty food.", "author": "Clément G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "My very favorite lunch spot in SOMA. Always fresh and delicious. Amazing produce, tasty meats, and incredible use of spices and seasonings. I love that each day the menu changes, so returning regularly is totally enjoyable!", "author": "Erin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Great for those who are looking for a hearty healthy meal! I was expecting some of the food to be a little more flavorful but overall awesome experience!", "author": "Keanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Great food. Great prices. Great overall value.  Fruit isn't organic, but eh get the side of bacon instead. For $5 you get 5 pieces of brown sugar baked bacon. Uh, yum!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "OMG this place & the folks there are awesome.  I got the Flank Steak and I have enough left for at least 3 more meal creations.  If you are have a special picnic I suggest you try Picnic. Fresh food, delicious plate combinations. The Pickles are homemade and I plan to pick up more. I cannot say how much I love this place.", "author": "Karolyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "Awesome lunch spot that never gets old because they rotate the menu daily, which gives a very home cooked taste to the food.  Today I ate here for the fifth time and will be back continually.  Nowhere else in the neighborhood gets me satisfied but still feeling light and healthy like this place.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "What's great about SF. You walk anywhere and find SPOTS to eat that are really good. Like this one on the way to the Giants game. Funky food. Just like the town.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-05", "description": "The most memorable part of this place is the very friendly and passionate staff. Every person seemed genuinely excited about the food they were serving, which was refreshing.\n\nThe food was very savory, and the entree with two sides was filling. There weren't very many options for entrees, one vegetarian and two regular ones, but they were all quiet good. The downside it is was overpriced. $13 for an entree with sides. The food is all already cooked, coming from large serving bowls. This made the steep price seem even steeper, considering for the same price you could have a cooked-to-order meal.\n\nOn the upside they serve alcohol, and had the Le Merle saison on tap, which is fantastic.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Great food and low key concept.  Salmon platter w/goat cheese is great.  The daily specials are fantastic.  The pork w/rice was the best pork I've eaten.", "author": "Alf O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Incredibly fresh food, creatively crafted with love. I can't get enough of this place, and go there as often as humanly possible.", "author": "Jen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Good solid lunch plate options, though pricey, probably on par with everything around this neighborhood. Like their changing menu everyday and relaxed cafeteria style. They even have cut up limes at the self-serve water station. Not too much pastry options but offers paleo-muffins the few times I visited. After lunch, they change to afternoon menu, such as cheese plates, etc.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Don't let the line scare you away. \"It moves quickly.\" I was assured, and sure enough, it did. So the line is due to the menu of fresh ingredients which changes daily. The day I was there, all items were Mexican inspired, with a chicken, pork, and vegetarian choice. The line moves quickly because the food choices are limited to three plated dishes each day. You can deviate from the set choices, or you can add a la carte items. They will also box your choice nicely if you are one of those local high-tech workers who barely has enough time to grab lunch. They only take credit/debit cards, so they have swiping down. Within a few minutes of getting in line, you're sure to have your food.\n\nThe portion size was good for lunch. Since the menu changes daily, critiquing the individual items doesn't seem productive. What I will say is that in my group of six, all three offerings were covered, and all three got rave reviews.\n\nThe ambience is trendy and friendly. Since we got there near the end of lunch, a few of us went back after lunch for desserts. They don't make the pastries there, but have a high-quality local baker who supplies them daily - all were yummy. We also had well-made coffee.\n\nThere seem to be a number of places popping up in this neighborhood, but Picnic on Third has a great model. Somewhere in-between cafeteria service and high-quality sit down food. Seems to me to be a great recipe for success.", "author": "MaryFran L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Went there for brunch and really appreciated the food. \nThey prepared two exquisite combinations of ingredients: slow cooked pork with polenta, and smoke salmon scramble with asparagus. \nWe could taste the freshness of the ingredients.", "author": "Theo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Small but well chosen menu (which will change every day), of simply DELICIOUS food ... \n\nI was very skeptical about roasted okra -- that is not my favorite vegetable and it can be a slimy mess -- but it was really great.  \n\nEverything was perfectly seasoned; perfectly cooked.  We will definitely be back.\n\nOH -- bring your credit/debit card -- looks like they don't take cash at all.", "author": "Jaina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "This place is alright.\n\nI've been here a bunch of times, and I've really wanted to like it, but I just can't say that I've had anything I thought was delicious. \n\nTo be fair, I've also never had anything I would say is bad. My usual criticism is that things are boring and lack flavor. The meals I've eaten here have looked/sounded much better than they ended up tasting. \n\nBottom line, it's a convenient spot if you're in SoMa, and I'll still check it out when the menu looks good, but never my first choice.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "I dropped into Picnic on Third for the first time today while visiting my mother in the city. I've been dying to try it out since I first heard about it, but never had a chance to make my way up to the city until now. I was not the least bit disappointed or unsatisfied. I came in hungry and left full. An old friend and classmate I went to school with just opened Picnic on Third with a friend of hers, but let it be known that I don't let this bias influence my opinion. Anyone who knows me knows I'm highly opinionated and I don't mince my words.\n\nI'm not a self-described \"foodie\" by most people's definition, although I like to think I am, so I'll jump straight to the point.\n\nThe menu changes daily and is centered around a theme, with a few different compositions available to satisfy the vegetable, meat, and seafood lovers. And we're not talking generic crap like a plate of spaghetti and marinara sauce or a bowl of chicken pho that you can get at any corner joint. It's true homestyle food that I'm sure would win over any gourmand. It's like the stuff your mother made for you at home, but with pizzazz, originality, and restaurant quality.\n\nThe staff is super friendly and always willing to help. The dining area and kitchen are super clean and spotless, even with how busy it can be during lunch. The environment is unique; somewhere between old American and 19th-century European ambiance, with neutral colors tastefully done and old-fashioned long-filament lights on the walls. I dig it. \n\nOnly credit / debit cards are accepted. While I'm sure this may inconvenience some people, it's the opposite for me. I almost never carry cash, and San Francisco is riddled with restaurants that would rather shut down and file for chapter 7 than take your credit card, so this is a nice change.\n\nI've been a type 1 diabetic since I was 19, so I drink tons of water. One of my biggest complaints with some restaurants is they don't refill my water very much or at all (though, to be fair, I'm like a camel for the aforementioned reason, so I'm usually lenient about this). But here, several carafes of fresh water sit on a table with a box of cups and a bowl of lemon slices so you can serve yourself as much as you want. A-okay with me!\n\nBut perhaps my biggest rave about Picnic on Third was its ability to take three foods I normally cannot stand - cornbread, chard, and carrots - and turn them into something delicious and enjoyable enough for me to return for seconds (provided I have enough of an appetite). I'll definitely return soon with friends. Places like this make me wish I lived much closer to San Francisco. It's a very refreshing change from all the Vietnamese, Mexican, Chinese, and sandwich restaurants that seemingly make up 90% of the Bay Area's dining establishments. But most importantly, it's original and delicious.", "author": "Niels M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-18", "description": "Disappointing.  Had both lemon chicken and veggie lunch plates.  Only chicken was warm, all else cold including a filo dough type pizza bread and chunky fries that would have tasted far better warmed.  Presume their strategy is to stick to a rigid menu and serve it up quick.  Success on that mark.\n\nHummus did not include pita bread with which to scoop it up.   Portions are child sized.  2 dishes,  1 cider, tip,  =  almost $40.  Eating on tin plates for lunch, this is too expensive for such meager servings.", "author": "C R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-18", "description": "As already stated, the food is good and ambiance is nice, but it's overpriced, especially compared to similar restaurants nearby (Darwin, various spots in South Park, HRD). I paid 7 dollars for three meatballs? 3 dollars for a scoop of some cold veggies that have been sitting out for 2 hours?\n\nA tough one, I want to like this place and go more often, but as others have said, it's just across the 'overpriced' threshold that you're left wishing for a bit more (either in quality of fresh food, or realistically, larger portion sizes). If they came down to 10-11$ meals, they'd have 5 stars from everyone.\n\nSimply put-- its hard to justify paying 13 or 14$ for glorified buffet food (nothing is prepped per order).", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "We're so excited this place is open. A reliable Gluten Free and Paleo friendly spot close to our house is just what we've always wanted (seriously). The food is good and reasonably priced and portioned, and you can order items a la cart (choose your protein, choose your veg). I've only picked up dinner, but I guess they do a good lunch/happy hour scene. \nWish they were open later, so we could eat here more. Spoke with the kitchen staff for awhile when I was in and they assured there'd be no hidden gluten, and they even use Gluten Free Tamari (instead of Soy Sauce). \nAlso, while I was there I dropped and spilled my Bok Choy and they gave me a new one, so that alone has earned a returning customer. In fact, I wonder what the menu is tomorrow...", "author": "Brooke R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Picnic on Third is a great addition to the neighborhood's lunch options! I stopped by for their soft opening and enjoyed friendly service, delicious espresso, fresh ingredients with a rotating menu, and all at a reasonable price. Love the camping/picnic themed plates and cups, and the chocolate cookie with a sea salt center was to die for. \n\nWill definitely be back!", "author": "Tory F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Decided to go here for brunch on a Sunday morning at 11. Came in and there were only a few people. We ordered the two egg hash (4/5) and the scramble (3/5) with ingredients that change. Today's special ingredients were avocado, salmon, and asparagus. I wasn't that impressed with the scramble since it was basically scrambled eggs topped with a couple pieces of salmon and some asparagus. I wish it had come with toast or something to make the meal a little more substantial. Positive was that the salmon was fresh and did not taste fishy at all. The two egg hash was a lot better. Loved the shredded roasted Brussel sprouts and aoili that came on the potatoes. Also got the fruit bowl and their iced Vietnamese coffee special with a grand total of $40. The Vietnamese iced coffee didn't have the depth of authentic iced coffee and tasted more creamy like blended coffee ice cream. Good, but just not what I was expecting. Overall, a good place with quality ingredients, smaller than normal brunch portions, and downtown upscale pricing.", "author": "Katy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "Such a great concept and the food is always good. I couldn't decide between the two entrees one day and they made a great suggestion - want one of each? This place is like a high end cafeteria. Food is great, service is great. It's a small location, though, so you can find yourself without a seat. To-go is an excellent option.", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "Very unique homemade chai in this city! Creamy, lightly spicy, not overly sweet, kinda reminds me of pumpkin and fall. :) Staff are very friendly and welcoming. Apparently they've been open for a little over 3 months now, and their menu changes often to whatever the chef is so inspired to make. I definitely wanna stop by for a proper meal here one day. They also have an impressive array of spices on their wall (that do actually get used!).", "author": "Linus W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Awesome concept - simple and elegant. Great service. The day I went, the pork was very salty. I am hoping to return to try some more dishes.", "author": "Howe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "HAVE I SERIOUSLY NOT REVIEWED THIS. \n\nWhen I went, they served me Egyptian-themed \"pomegranate braised beef, mashed babaganoush with paprika oil, dukkah-crusted pumpkin wedges, and date chutney\". I wanted to cry with how perfect the food was. It's a bit expensive, but oh my god, the food.... insanely good. \n\nPlus it changes all the time, you'll never be bored!", "author": "JoAnn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "Cute new place near work. I'm not much of a coffee drinker, but my coworker brought in a cup that had the most adorable awkward-looking octopus on it...I had to come in after seeing that. I'm here for the chai tea lattes. I've had it both hot and cold and it's excellent either way. I still prefer the one at TwoFish, but this is slightly closer and the food looks extra-tasty. I may stop by again for lunch if it isn't too busy. \n\nThe problem with some cafes is that they have a small space and then fill it up too quickly...and since it's like a cafe, people don't...leave. For hours. Because they're talking. No lack of stars against that, of course; I just wonder about things like that sometimes.\n\nAnyway, the chai tea latte is excellent. I don't know much about coffee, but boy, it smelled good, and they seem to have a different coffee blend daily. Good place for grabbing some caffeine during the workday!", "author": "Robbin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "OK, this might sound weird, but I mean it in the best possible way: Picnic feels like a high end cafeteria (think eating at Google or Facebook or Square). It's very fast, relatively cheap and absolutely yummy. I really like that you only have a few options so you don't have to think, just point to one of the compositions of the day. All of their meals are healthy AND filling, what more can you ask for, really? The staff is very friendly and they bus the tables. \n\nI only have a couple of minor grips with it: it's quite loud and their extras (desserts, to-go jars of soup, etc.) are SO expensive, which has stopped me from getting them, so I don't know, maybe they are worth it?", "author": "Mathilde P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-10", "description": "Thought I would give this place a try. Decent food, not great, but edible. Is it worth my 18 dollars for a plate? NO. Will I return? Only if It's the only place open in the area and I was really hungry.", "author": "Eduardo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "Stopped here for lunch during a conference break...definitely worthwhile! Fresh, ever-changing menu made with high-quality, fresh ingredients. \n\nI had a delicious house made sausage with shaved fennel salad and roasted broccolini with Brussels sprouts. Apps, lunch, drinks for four was ~$80 with tip.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Delicious eggs and french toast! Expensive, but the food is quality and the ambience is cute.", "author": "Carissa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-05", "description": "This place is right near my office, so I find myself going in to keep my weekly lunchtime routine exciting. Each time I finish my lunch, I ask myself why I go back. The food is good, but way overpriced. I look at my carton (and I'm no greedy glutton) and remark at how little it all is. $7 for 3 chicken thighs? $3 for a scoop of bok choy? come on. \n\nAlso, a side note: the people who work there act like they know everyone who walks in the door, which bothers me. I appreciate friendliness, but there is a fine line between friendly and over-assuming.", "author": "Hadley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "I cannot explain how much I love this place on a simple Yelp review.  \n\nFirst off, the vibe itself is amazing.  Perfect first date place or to hangout with a friend you haven't seen in a while.  The decorations/interior design is aweome.  I stared around for like 5 minutes. \n\nSecond off, staff is chill and friendly, not awkward and trying to oversell stuff.  I love their shirts.  \n\nThird, the food is great - tastes like mom-cooked meal but a tad better because it's clearly unique recipies to whatever genius is behind the cooking.  10/10, bomb.com.  Glad they're here.  ^_^", "author": "Justin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "Great food with fresh ingredients; tastes home made and genuine, mostly inspired by Italian recipes.\nMenu is small - three compositions are served for lunch - but extremely high quality. You can make your own composition using the same ingredients if you like.\nThe location is great and the place is newly remodeled, warm and cozy.\nA bit on the pricey side for lunch (about $15), but feels like a treat and a nice break from the other places around South Park.", "author": "Cosimo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-27", "description": "The staff are very friendly and courteous. But the kitchen does not seem very clean. And the food was mediocre. Sorta like overpriced cafeteria. I'm sorry to leave a bad review, but I dropped 50 dollars for very little food and a bit grossed out.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Love Picnic on Thrid!  Food is always fresh, delicious, and easy for all your dietary challenged friends.  YUM!", "author": "Nathan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "Great healthy lunch, underrated and always easy to get a seat brunch. Nice proprietors. 5 star.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "I ate at picnic this Friday on the second day of the soft opening.  I had lamb with hummus and chard (you get to build your own meal from multiple choices: $6 for a main, $3 for side) so $12 for my whole meal which I thought was totally reasonable.  For reference - the same amount of food from the whole foods hot bar would have been around $15.\n\nThe lamb was awesomely savory and the hummus had whole chick peas in it which I thought was a nice touch.  The chard was great as well and I also got to taste some of my girlfriends choices (roasted chicken and cous cous) which was excellent - really crispy skin on the chicken which I appreciated.\n\nThe space is very clean and bright and has a relaxing atmosphere even when crowded, so I can definitely see myself spending my lunches here.\n\nThe menu changes daily so the experience is new every time. And I will definitely be back.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "If you need a root vegetable fix this is your place. Extremely well prepared meats and vegetable is a classic country style. You always get a great selection and the portions are great if you don't want to fall asleep after lunch or you have a variety of people wanting very different sized portions.\n\nThey have just enough selection each day to keep everyone in a large group lunch happy, but also they do everything to perfection, so the menu is appropriately limited. The day to day variety is incredibly so go early and often.\n\nThey also have a lovely selection of wine and beer to round everything out.", "author": "Geoff L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "I'm officially obsessed with this place.  Everything is super fresh and flavorful.  Menu changes daily with great options that are made of real food.  And their breakfast sandwich with bacon and house sauce is to die for.  Don't miss the strawberry lime agua fresca!", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "We have been trying to make it out to picnic on third since they opened their doors. Walking in soaked from the rain, we were greeted and told the day's menu, to our surprise everything was amazing. The tongue was so tender and full of flavor, the chicken had a nice hint of ginger and I had a hard time trying to control myself from getting seconds. \nBoth of our meals were amazing, I wish they would do breakfast, lunch and dinner!", "author": "Sasan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Very friendly service and delicious food. I got the roasted pork with corn pudding. The portion was huge! Definitely going back again!", "author": "Fiona J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "I like how they run this place. Their nice, presentation feels comforting, and they clean up after you.  Sausage and gravy needed salt, biscuit would seem to be better with jam and greens left not much of a memory. I would try this place again in hope I got WoWed from something but a third time I'll keep it pushing.", "author": "Hilary J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "My boyfriend and I tried this place for the first time because we bought a gilt city coupon for a couple glasses of wine and a cheese plate. \n\nWe got there around lunch and the girl working told us they don't usually do the cheese plates until later in the day but she would go get someone and she was sure they could get one together for us (It was unfortunate because the deal I bought never said anything about hours but I think thats more Gilt City's mistake) The manager/supervisor came right over and brought us up to the front and got us each our drinks and said she would get the cheese plate together right away - which she did. \n\nThe staff here were very friendly and polite and made an awkward situation much better. We will definitely be back to try their lunch!", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "fantastic variety of fresh, somewhat healthy options. you can mix and match a protein with sides. interesting condiments too. the menu changes frequently but I'm not sure if is daily or weekly, I haven't been here more than once in a week. and the staff is super friendly which make the experience really nice. there aren't many tables inside, maybe a dozen, but it seems most people like to order to-go so I haven't had any problem getting a seat. definitely one of the better fresh-food places in SoMa", "author": "Bob U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Love Picnic! Great food with a kind staff. I send all my friends their way with great results. \n\nIf you happen to be there for breakfast don't hesitate to try the pork and polenta!!!", "author": "Julia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Awesome food made by awesome people. We used Picnic to cater a lunch meeting in the office. All the big wigs were in attendance and they loved the food and service!", "author": "Benjamin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-21", "description": "Picnic started off strong, but lately the chef has been taking risks that maybe aren't paying off too well. What started as great, slow-cooked, simple comfort food with a gourmet twist has now become a grab-bag of attempts at random ethnic cuisine. Don't get me wrong, I love ethnic cuisine as much as anyone, but when I have Indian or Korean food, I want it to taste like Indian or Korean food, not a bland, one-note facsimile of it. San Francisco has plenty of authentic options, so there's not really a need for an \"okay\" copy.\n\nWhat made this place shine in the beginning was tender, slow-cooked meals that you just couldn't get anywhere else. Who else in the city offers slow-braised beef or pork that's been going for hours and falls off the bone?\n\nYou've only been open three months--please don't lose your way already.\n\nPlus, as others have said, the prices are a bit mad. I get it--premium ingredients demand a premium price. But maybe offer a smaller portion or something? I'm not saying the food's not good when they're having a good day, it's just that walking into a place and being served like you're on a lunch line doesn't really strike me as a premium experience.\n\nBut I guess they have to pay for those marble countertops somehow.", "author": "Will G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "Came here for brunch with the gilt deal. Really good creative brunch items (although the pork polenta dish was a bit salty). Disappointed in the mimosas which came in a pretty small carafe and tasted like mostly OJ. Would skip mimosas here!  Also unimpressed with the Vietnamese iced coffee which was very milk heavy.", "author": "Mana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Had been eyeing this place with its cute interior for a while and finally stopped in today to give it a try.\nI'm one of those people that has an extremely hard time choosing a dish, so I love the concept of this place for making it easy on me. They offer limited options (2 non veg dishes and one veg) with a menu that changes daily. I was actually a bit surprised about the menu, as I had expected lighter fare and today's choices were pretty hearty comfort dishes. May not be like this every day though, I'll have to go back and see what else they feature on their menu. \nI went for the turkey meatloaf and chose a side of green beans and Brussels sprouts. They also offer combination meals that come with a protein, a starch and a veggie. The food tasted like a home cooked meal, which is a nice change from standard lunch fare in SOMA. The cozy interior and homey foods will have me coming back for more.", "author": "Christina Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Splendid lunch.  Simple customer flow,  nice  personnel,  very good food and fair pricing.  Win.", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "I LOVE this restaurant!  I went twice while I was in San Fran visiting some friends and both times I had an A+ experience.  The food is amazingly yummy.  The staff is friendly and helpful.  The decor is casual and cozy.  \n\nWe went for lunch one day and then again for Sunday brunch.  Both meals were impressive.  Fresh ingredients, superbly seasoned.  And the food came out promptly.  \n\nFor brunch, the best French toast I've ever had.  At first I was scared by the small menu, but truly everything looked so good I couldn't decide.  Luckily, I was with a big group and we all shared so I was able to try everything!  \n\nSide note:  the coffee is spectacular.  \n\nHighly recommended!!!", "author": "Valary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Yummmmy. Tried all the brunch options and they were all great! Now convinced that all scrambles require breadcrumbs for texture. And it may be hard to do bad bacon but their bacon is on another level of carmelized deliciousness. Super cute vibe, too!", "author": "Lou B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "Food that tastes home cooked, healthy, and savory-- from Ethiopia, India, Peru, and who knows where next? I love eating at P-on-3, especially at the big communal table. Off-peak hours, you can work here too. Appreciate the gluten free treats and the unusual vegetable sides. Nothing they serve is conventional, but it's all delicious.", "author": "tony a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Best kept brunch secret in soma! The French toast was amazing! Friendly staff. I am going back", "author": "mehdi s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Excellent brunch spot.  Seems like the menu changes often; the two potato hash and prosciutto pancakes were delicious and among the best brunch items I've had in the city.  The French toast and cornmeal were nothing special, but the first two items made up for it.", "author": "Josh Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Came here for brunch and it was more than I could've asked for. Our party got one of each: pancakes, scramble, Brussels sprout hash, chili braised pork. Everything was five stars. And the bacon was, wait for it, the best I've ever had. Ever.", "author": "Jonathan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "LOVE that they're open on the weekends.  Nice staff.  Always smells so tasty when I'm walking by.", "author": "S. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "What a breath of fresh air! Not only does the menu change every day but you actually get to see the options before you order. I don't have to imagine a dish from a description and hope that it's what I want.\n\nThe portion sizes were generous, ingredients fresh, and flavors balanced - what's not to like about this place?", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "This is a great addition to the area. It's a tad pricey, but huge portions. The line moves very quickly, and the food is excellent. They are totally set up for takeout at lunch. The menu changes daily. \n\nThey are going to totally take all of my lunch money.", "author": "robert h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "I've been working in the city for about 1.5 months now and previously was surviving on my favorite deli for lunch everyday. But wow have I been missing out by not exploring around a little more. I found out about picnic by eavesdropping in the office and after my co-workers lavished about it I had to try it myself. I got the chicken as the main dish and a side salad for about 11 dollars. For such a big hunk of chicken it was cooked to perfection. They season it well and the meat is tender but juicy. The menu changes each day so I am excited to see what else they have to offer.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Do you find yourself eating the same dish every time you go out for lunch? Not an option at Picnic. Their menu is hyper seasonal (changes daily) and that means you're always trying something new.", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "They have a different cuisine and menu everyday, but on this particular day, I went in at 11:30am for a quick lunch catch up with a friend. Oaxacan was on the menu, I ordered the crispy pork belly with a side salad and rice. Of all the places I've ordered pork belly, Picnic on Third took it beyond expectations by a longshot. Crispy, flavorful, but not too obnoxious on the spices. You could still taste all of the natural flavors. Salad and seasoned rice was on point as well. Will definitely come back!", "author": "Catherine U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Great spot- highly recommend. The cornmeal/polenta pancakes are unique & deelish. Casual & nice atmosohere.", "author": "Julie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Loved this place! Came in on NY Day and had brunch. Was lucky enough to experience the Leigh's pancakes AND they have the best bacon! It's great, tasty, fresh food. Jesse, one of the owners, waited on us. I highly recommend and we will definitely be frequenting this little gem!", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Great new spot for lunch or take home dinner.  I'm gluten free and this place is totally safe and delicious.  Fresh, whole food is in abundance!  The owner Natalia is delightful and the venue design is extremely friendly.  Pick up dinner and wine to make a splendid evening.  I had a cheese platter, charcuterie plate and lentil soup with friends last night.  All was beautifully presented and super tasty.  Their selection of mustards is really awesome.  Loved the lentil soup too.  Enjoyed a glass of the Chardonnay then Pinot Grigio - both super yummy.  I would highly recommend this place to anyone!", "author": "Charlotte W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "What a great place to grab a great bite to eat, sip a delicate cup of espresso, and enjoy the company of friends.  The dishes are unique, fresh, and oh so good.  The aroma from the espresso machine sent my senses tingling.  My espresso drink was rich with flavor and a delight to drink.  The food is enough to bring you back but the espresso was a deal sealer.  The vibrant atmosphere and incredible service completed the dinning experience for me.  This one is a keeper.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "This place is super awesome! It's just got that vibe inside that you want to be there. Excellent staff, amazing food. Considering how much food costs in the city, their prices are quite reasonable (especially for the quality you're getting). I'm definitely going back to check out how the menu changes!", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Food was delicious! Chose the braised beef combination plate off the menu -- Really tender meat, tasty veggies, and excellent portions. Leigh topped the plate with pickled radish (optional) which was a nice touch. Also enjoyed the chai latte. Most of all, loved the vibe of the place. \n\nWill definitely come back for more! (I only wish they were open on weekends too).", "author": "Doreen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "The staff alone is 5-stars - energetic, happy, friendly.\n\nThe food was delicious and healthy. I had three sides ($3 each): the roasted eggplant, carrot and radish slaw, and hummus. Oh, also got a pumpkin paleo muffin ($4). Yeah, I know. Don't judge.\n\nThe price is reasonable for the area. No, I'm not in the business of having $13 lunches everyday but one could just order a side or two, or a main ($7), and be comfortably sated, or augment it with home-brought stuff. It's hard to stick to, say, one side when there's so much deliciousness in front of you, but you probably are more disciplined than I (hello, pumpkin muffin!).", "author": "JT W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Today was my first time visiting Picnic on Third, but it certainly won't be my last.\n\nWhen I came in today I was greeted by a one of the friend;y staff, who unbeknownst to me was one of the 2 chef/owners.  When you come in Picnic on Third you will be have a choice of three different meals.  All of the ingredients are seasonal and the menu changes every day.  If you want to know in advance what they are serving that day you should consult their website.  I came in today to try their Duck Confit, which was amazing.  Great flavor with wonderfully delicious crunchy skin sprinkled on top. I had the duck with the Vege Plate, as I couldn't just settle for only trying 2 sides as the normal plate with just 2 sides.    \n\nI look forward to coming back here again soon.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "I wish I had just one word but I don't. Here's a few: perfection, delicious, healthy, devine, amazing, clean and really freaking yummy!!!! Come here and eat... If you don't I'll find you ;-)", "author": "Rich K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "You're basically paying 30-40% more for this than for Sprig, which delivers the exact same meal to your door.  Food is high quality and nice assortment of sauces.  Most expensive lunch I've had in the city in a long time for fast casual.  Quick and efficient table cleanup.  Line was a little long, but hey, it's popular.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "This is our second time to stop for meal on the way to a Giants game. If they continue to impress us we will keep coming back. The menu is limited & constantly changing...but so far very happy with the selections, the quality and the price. Beer selection is nice too. Very clean...simple...and if you are running late they will pack it as a picnic to go...thumbs up!", "author": "Ginny B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-10", "description": "One star just for the sneaky way they force you to pay a tip. In fact, they don't accept cash and at checkout, their tablet software will be prompting you to giant tip boxes right over your signature. The lowest you can go tapping those boxes is 10%, of course you can manage to go 0% but additional taps are required: go custom, then use the numeric pad.\n\n- use of peer pressure to force you to tip: social engineering 101\n\nAmerica: takeout food should not be tipped (or if it should, I urge you to start tipping cashiers at Safeway). It doesn't matter whether you can afford or not, doing so risks establishing a standard (in addition to being an insult to our intelligence) and above all, it embarrasses people who can't afford.", "author": "Ho N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "Popped in here for lunch after seeing that their daily dishes were Mediterranean inspired and I was totally blown away. \n\nThe lamb meatballs were super tender, roasted potatoes were crispy on the outside and fluffy in the middle, and the roasted red pepper hummus was to die for. \n\nRun, don't walk, to this place!!!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Stopped in on my way to work, was warmly greeted by the owner of the shop. Got a delicious and not too-sweet chai that was recommended as well as a granola to go. Price is what you'd expect from a SoMa establishment, and the food was good.", "author": "Morgan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-28", "description": "Food is decent but overpriced.  I had the veggie plate and it was good, fresh, and well cooked.  I would come back for lunch if only it was a bit less expensive.  The cafe has a comfortable, trendy ambiance and not too crowded at lunch time.  It would make a nice place to meet someone for coffee and light food.", "author": "Ryan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "This place is a hidden gem.  Being a chef, I must say the food was wonderful.  The cuisine blends perfectly with its name.  The food is well seasoned and they truly perfected each dish they serve.  I will most definitely be back! Good job Picnic on 3rd! This is my new favorite spot.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Enjoyed a great beer and wine selection here for a happy hour with friends. Food is spectacular and fast.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "good ambience and very sweet people. when our order seemed to have gotten lost, they apologized profusely and gave us complimentary sides of brown sugar bacon and French toast!", "author": "Allison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "This place is amazing.  I've tried their lunch, brunch and happy hour and it was all excellent!", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Fantastic Lunch Spot in SOMA. Always has fresh food, new menu every day with great dishes. Had the Zh'atar Chicken Wings with Kholrabi Cucumber Salad and Bulgar Feta Salad today ($13 total so not the cheapest, but not expensive for quality food) . Very refreshing tasty meal and filling. Will be back next week, and the week after, and the week after...", "author": "Will P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-08", "description": "Came in to duck the rain and get a hot cup of coffee... the counter staff couldn't even be bothered to serve me a $4.50 cup of drip coffee... Pastries and grab and go breakfast items are lacking on multiple visits. Sure I could order breakfast from the menu. That's great that everything \"home made\"... but honestly I'd rather just make it at home and save my self the insults of a \"can't be bothered staff\" and overpriced fare. I even tried to pay with a $20 and was asked to pay with a credit card cause they are trying to avoid taking in a \"bunch\" of cash. Seriously, if you can't break a $20 during breakfast time on a work week when everyone should be popping in to order stuff... means you don't have enough money in the cash drawer due to lack of business. An inconvenience to the customer doesn't make your shop special... just makes you snobby! Not even a thank you have a good day when I left. I won't be back...", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "So good. I love the quality and freshness of the food here.  The menu changes every day, and each menu offers a variety of inspired dish themes, which I also love as a concept.  If you work in SOMA or South Park, it's fairly easy to walk to. \n\nI've only come her for lunch, but I plan on checking out breakfast soon.  Last time I came was in December 2014, but I recommend getting there early.  It's a great place for casual meetings over lunch, and a popular place for lunch in general, so I recommend getting there early. \n\nLooking forward to going back there soon!", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "This is basically the replacement for your Google/Facebook/Billion dollar startup cafeteria with high end balanced lunch cuisine. There's only 3 options that are usually vegetarian, chicken, and pork, but it changes every day and it's always good with some very creative sauces and side dishes that change all the time. You could come here pretty much every day and not get bored for quite some time.", "author": "Curt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "Great food and excellent service!  Stopped in for a quick bite mid morning - had the salmon snack, sandwich and amazing Aztec spice tea - all was wonderful, fresh and tasty!  Will definitely be back!", "author": "Heather M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "Super-fresh, delicious, creative daily menu. Ambiance is bright and cheerful with a community feel. Great place for a lunch meeting.  Also a nice spot to hunker down and do a little work (probably best during non-peak hours).", "author": "Carolyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "This place is absolutely incredible and amazing . I couldn't say much that other people haven't already said, but the food is of such high quality and it's consistently delicious , unique , and FRESH! The tip is : TRY EVERYTHING! You will not be disappointed. It's hard to find legit healthy food in the city at a good price , well folks, here it is!!! Bon apetit! And many thanks to the picnic staff for providing this gem to the city. We need you and my tummy is elated ! Xx", "author": "Kel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-24", "description": "I was taking to picnic on third for lunch by a co-woker and love it , Very rustic,  hearty,  comfort food and the service was above and beyond A++ ....  But your  mushroom risotto was just a tasteless heavey stodge  and come from a giant rice cooker , But apart from the risotto everything else was top notch ,  No More risotto please ,", "author": "Toby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Excellent fresh food for as little as seven dollars. Quick service and everything is available for take out. I had the wonderful braised lamb. Never had better.\n\nGreat and fast service. The staff was professional and friendly.\n\nIf you like bread or a roll with your entree, bring some- they do not offer it.\n\nI truly great place for lunch or dinner.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Nothing but positive things to say about this place!  Not only is their good AMAZING, it is healthy, affordable and absolutely delicious, but the friendly staff always make our lunch experience that much better.  Our company uses them for daily lunch catering and we couldn't be more pleased.  The unique, daily changing  menu offers a variety of satisfying food.  Looking for a healthy & appetizing place to eat? Look no further, you've found a great place!", "author": "Meghan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "DUDE.\n\nThis place is some of the freshest, most interesting food in the area! Yeah, ok, Pizza is right around the corner. Don't get me wrong, I love pizza.\n\nBut Picnic on Third is fresh, local, and welcoming. I got into a conversation with the woman behind the counter, and it turns out that the 2 owners are award-winning San Francisco chefs! They met at Chez Panisse (OMG - so good), and decided to open their own place.\n\nI had the braised beef and brussel sprouts. Everything was delicious, and so cheap for what you get!\n\nWill definitely be coming back. Don't miss this place!", "author": "Hannah H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-19", "description": "Not good for vegetarians. \nIn today s day and age and that too in progressive sfo ..... Why only one unimaginative veg option\nCold and dry too\nFor $14 lol. What a world. Lol.", "author": "Helper P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "I had the breakfast sandwich that was unique and very good. Also had the ice coffee with almond milk which I recommend. Cool atmosphere and nice staff!", "author": "Sam H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "This review is about the overall experience in addition to the food. We ordered the two potato hash and the braised pork. The portions are very small. Being a super slow eater, I was able to finish my meal within 15 minutes, that's petty rare. The potato hash was pretty good especially the potatoes were cooked to perfection. The braised pork was tender but not very flavorful. What made us decide to never come back to this place is the noise level. We sat by a large group of people who were yelling and obnoxiously loud throughout their meal which made this brunch experience very unpleasant. If you're looking for a relatively quiet eating place, then this place may not be the best choice.", "author": "Lulu J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "It's a bit pretentious and pricey, but the ingredients seem high quality and fresh, it is nice to not have to choose from too many options, and the changing menus add variety to the experience.", "author": "Lorem I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "Good breakfast sandwich.  Not amazing, but did the trick.  So did the cappuccino.  Disappointed that it didn't have wireless.  I was there for a meeting - and the person was late.  Would have been nice to do some work while I was waiting.  I would try for lunch, but wouldn't go back for another breakfast meeting.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-10", "description": "The chicken was undercook with blood in the middle. I had stomachache for the rest of the day. Do not recommend it at all...", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "I don't usually write reviews but I wanted to call this place out because it's awesome. The sides are fresh and tasty, the duck was arguably the best I've ever had, and the coffee was great... oh and it was lunch! I expect that kinda food at a nice dinner spot (which this place prob is as well). \n\nI also love that the menu changes. I used to work in the area and the local offerings can get pretty stale, but not here. I will definitely be back. \n\nps. love the whole layout of the place.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Wow.  I had been steering clear as coworkers had said the food was fresh and good, but the price was a little high (my takeout lunch today was $14.50).  But man was it good.  Today was an Indian menu, I had a chicken dish with basmati rice and sauteed chard.  It was super fresh and delicious.  I'm a big home cook and it felt just like something I'd cook at home.  I will definitely be back.  The staff is super friendly as well.", "author": "Brad K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-12", "description": "It is bit hard to rate this restaurant as there are a lot of interesting and good things about it but was underwhelmed by the food itself.\nDécor - great. I liked the simple set up, tin plates, the water jars, pickle and spice jars, even the entrance way, with the tin lids nailed on the wall...\nIngredients - obviously high quality and fresh. Nothing looked wilted or cheap - they even had slices of lime next to the water fountain...\nAmbiance and service - great. Personnel is polite and obliging, music has the right volume, entertaining without being obnoxious...in one word, very tasteful.\nFood and pricing - food is good but did bot blow me away. Pricey - and I do understand that given the quality of ingredients the price is justified. However, at the end of the day, the patron is under the impression that food was overpriced, and I read this in other reviews. Reason is not that you are over the budget - reason is that simply there is a disconnect between what you get and what you pay...\nI hope however that the concept can survive because I do understand it is a challenging experience - food quality, SF prices and I did not mention the fact that menu is changing daily which certainly adds another layer of difficulty....\nAgain, I hope that this concept will survive...", "author": "VIORICA C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "Delicious, reasonably priced lunch. You know how you have that one friend who is a bomb cook and you always jump at the opportunity to eat over? That's what they're serving here. Simple and well executed. I had braised lamb, hummus and roast eggplant. Buddy had roast chicken, carrot salad and couscous. $12 each for big full plates. You can mix and match mains and sides, and there are plenty of veg and gf options. A+ would eat again.", "author": "maggie g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Picnic on Third is the perfect lunch spot for the neighborhood. The food is superb and a refreshing mix that separates it from the other lunch joints in the area. The menu is gorgeous and made with love and care that is not usually found in the \"power lunch\" outfits nearby. Picnic sets a new standard for fresh, thoughtful and delicious lunches done right. Definitely check this place out!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Wow, my first meal at Picnic on Third was truly a delight! No amount of descriptions & sneak previews could have prepared my senses for what lay in store today. As I walked in, my sight was captivated by the upscale yet welcoming design & decorum of the space. Before I could consciously appreciate the ambiance, my sense of smell was uplifted by the plethora of aromae which only furthered my hunger. This led to the best part, as I chose my side dishes of farro verde and roasted winter squash and my main dish of crispy confit duck leg with fig compote. With \"just a damn cup of coffee\" to wash it all down, I sat at one of the homemade tables to enjoy one of the best meals I've had in quite some time. The food was gourmet in quality, taste, preparation, & presentation, lacking just the small portions & inflated prices one expects to accompany such fine fare (my whole lunch was under $15). The staff was friendly & helpful, explaining the nuisances of their cuisine and providing prompt & efficient service when needed. But in the end, the best part was by far the food. Once I began to dine, I lost all awareness except for the plate in front of me. The meal was nutritionally well-balanced and downright tasty to say the least. As I left, I had to loosen my belt & was left stunned by both the quality & quantity of my rather thrifty lunchscapade. I can't wait for my next picnic... on Third.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "I'm a fan! We were walking to the train station on New Year's day and it felt like a desolate wasteland. No people, no cars. Emptiness. All of a sudden, we noticed a door open as we passed this establishment on 3rd. I didn't even check yelp for any reviews, we just went in. And we're so glad we did! It was warm, it was bustling, it smelled amazing! We were seated and told our server our train departure time, and we were accommodated graciously. Delicious food, creative choices, helpful staff.  We loved the plates and cups they use and asked where they got them. I immediately ordered some as soon as I got home. We will definitely be back. Thank you Picnic on Third, for allowing us to feast Thursday morning, instead of grabbing a coffee and pastry from just a coffee shop!", "author": "Robin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "AWESOME and unusual, healthy dishes.  I stopped by last night just before closing time.  I had a delicious butternut squash soup with a \"water spinach salad\" and pork and white bean stew.  All were perfectly flavored, fresh, and memorable.  And the pear tart for dessert was a nice bonus.  Good, friendly service and comfortable, pleasant decor.  I'll be back (both to take out and to eat in.)", "author": "Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "Delicious food and great concept! In addition to the rotating menu they have a refridgerated case full off homemade soups, picked things, kimchi, and other yummy goodies that you can buy to take home! Love it, I will be back!", "author": "April M."}
