{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "This pizza place is right next door to my work office and it is legit the only pizza place I will go to for lunch, whenever I visit the office.\n\nWorking in LDAC has it's perks - such a company paid lunches at the LDAC cafeteria, but the one thing that the cafeteria cannot beat is delicious Pizza from Pizzeria Avellino. \n\n5/5 Stars for HUGE Slices\n5/5 Stars for their quickness from ordering to getting the slice in your hand and in your stomach\n5/5 Stars for the service. They are super friendly and very quick on their feet\n\nEvery slice is unique and full of flavor; and their crust is charred perfectly!\n\nWant a quick bite? or craving pizza? This place is a MUST! Depending on the time, there is plenty of parking on the street, they also have a small lot next to their shop - that houses like 5 cars.\n\n5 Stars for sure! Only a few pizza places gets me worked up and this one is it", "author": "-Johnson- N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-31", "description": "\"New Owner? Who Dis??\"\n\nGrowing up in the Suburbs, I'm well versed in pizza. You know, Pizza Hut, Little Caesar's, Round Table. All that good stuff. Hey, it may not be the best, but at least it's always consistent.\n\nThis place on the other hand, you never know what you're going to get. Sometimes you'll get a super friendly dude serving up a fresh slice, other times you'll wonder why you came here in the first place.\n\nWith the new owners they're trying to implement some innovations like pizza sitting on the front counter. Speeds things up a bit if you want a quick slice, but you can also order a custom slice if you want a fresh one.\n\nThere are also wings and salads sold here. But my favorite thing is the Sicilian style pizza. However that's a bit inconsistent too. Sometimes it's an inch high sometimes maybe triple that (???).\n\nThe prices are a bit on the high side approaching about $30 for a whole pizza. Definitely not a 5-5-5 kind of place, but there really aren't too many other pizza options in the immediate area. \n\nOverall if you want pizza it's either this Delarosa....and they know it! Alas my weakness is pizza so I'll be back again and again.\n\nProtip: Bring cash. Otherwise you'll pay a ~4% additional charge", "author": "Joel L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "Man. I hate to do this but, the new ownership has really ruined this place by skimping on quality ingredients and Avellino has officially lost its \"soul\". The new owners are looking at the bottom line more than putting out a good NY slice and it makes me sadder than ever. \n\nFor the better part of a decade I enjoyed the delicious nyc styled pizza but, those days are gone. The slice and pizza you find today is uninspired, clunky and cheese heavy. Honestly, round table would crush this place in a blind tasting...I know, sad. \n\nAnyway, someone had to say it because the collective 4 stars aren't an accurate representation of what's coming out of the kitchen today. :(", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-28", "description": "We ordered one large and one medium pizza and an arugula salad. In my opinion, the salad was the best part. The pickled onions and roasted tomatoes paired well with the balsamic vinegarette they had, which was extra tangy and super flavorful. I used the whole container, but would probably opt for just half next time!\n\nSadly, the pizza disappointed. Ultimately, you can't go too wrong with pizza, they give you good portion size for the price. A medium here is like a large elsewhere. Plus, service is quick because the pizza is thin-crusted. \n\nHowever, the chicken on the pizza was dry and flavorless, sauce unseasoned, and crust unremarkable. Our other pizza (forgot its name, but it had arugula and sausage) was way too greasy. If you're looking for a quick bite to eat and are craving pizza you can come here--but don't expect it to blow you away.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Omg.  Pizza by the slice. 50 a topping. Made to order and cook's fast. They bring it to table.verry friendly. Delicious toppings awesome cheese. Fluffy crust. I haven't yelped anything in awhile. But for this place I had that good.", "author": "Debbie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "Came here after House of Air because it was close and so glad we did.  The pizza is delicious!!! Ordered a large Brooklyn Italian and Large Cheese/Pepperoni.  Pizza is so light that we ordered another \"round\" of pizza.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Ordered the meatball sandwich and the Caprese sandwich. The meatballs were just okay. It had a very interesting flavor. The Caprese sandwich was also just okay. The service was not friendly. But the place was very crowded. It is a cute very small restaurant but I do not think I would return for either sandwich. \nBoth came with lays potato chips.", "author": "Nellie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "3.5 STARS\n\nFor dinner, the roommate wanted pizza. I gave him a couple options and he picked Pizzeria Avellino. We place a delivery order on the way home via DoorDash on Monday, February 26th at 5:36pm. Our order arrived at 6:40pm. We live in Outer Richmond.\n\n*The Lombard Special: Pepperoni, Italian sausage, mushrooms, no black olives, sub Jalapenos ($22 for Medium 15\")\n*Blistered Shishito Peppers: Tossed in olive oil and sea salt over lemon aioli ($6)\n*Meatballs: Pork and beef meatballs, marinara, parmesan, crostini ($7)\n\nI like thin crust pizza, so this was more my style. The pizza was pretty big circumference wise for a medium. Managed to feed both of us for this one meal. (I had two slices and the roomie had the rest.) The crust was soft, but also had a nice chew. A good amount of cheese and toppings as well. I adore shishito peppers, so I enjoyed these. Could have used a little more seasoning, but the lemon aioli helped. The portion was pretty hefty as this was the one dish we couldn't finish. I thought the meatballs were pretty standard. Though one wasn't quite a whole meatball. It almost looked like someone had a bite taken out of it? I know that wasn't the case, but I did notice one was smaller than the rest. I do love my meat and sauce, so this fulfilled that craving.\n\nEven though the roommate just prefers to order from a particular chain pizza restaurant, I like trying new spots. Not necessarily on my list of go-tos for pizza delivery, but I'm glad I tried them out.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "New owners from back in April. When we got there the cheese pizza looked like it had been sitting there since 1496. When we asked when it came out of the oven the guy just said \"I don't know.\" We decided to leave it just didn't feel like the old place - definitely not a New York feel anymore.", "author": "Dennis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Had the most amazing experience tonight at this small pizza place.   My sister and brother and his wife and I were all out late looking for a late nite pizza , drove by and looked closed , chairs up and stuff.   We decides to check if any leftovers.   Walked in meet Handsome Jacob!     And Wow was he nice!    He had some slices still and even though closed offer to heat up and sell to us.   OMG....   the taste...  the crust.... the freshness......and the service........  The Stuart's are coming back.", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "Son and I were looking for something to eat for lunch. We walked off the Presidio and found Pizzeria Avellino. The restaurant is an older place and its is small. They do offer some outside seating which is helpful. We ordered two slices of cheese pizza and one slice of a combo plus two sodas. The cost of this came to $19. At first I was shocked but then realized NY slice means huge. When the pizza came I was kind of disappointed. It appears they took a cheese pizza and placed some toppings on it and sent it back through the oven. I could be wrong but the veggies seemed too fresh for going through a 500 degree oven. I also felt the sauce was meh. All in all I felt the experience was meh.", "author": "Don P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Good for a NY slice!\n\nThis is the best version of NY slice style pizza that I've found in San Francisco. Probably better than most of the Tony Slice House locations. \n\nThere are many decent Italian style wood fired pizza places around town. And, also lots of thin, crispy crust artisanal, local California ingredient type places. But, the neighborhood-type NYC places have been lacking.  I don't know Chicago-style well enough, but there seem to be enough of those as well. \n\nThe pizzas are good here; either by the pie or by the slice. Go for something simple with fewer ingredients. They also have some good appetizers that go well with beer; try the padron peppers. They have now also added some outdoor tables in the parking lot area -- great for when the weather is cooperating and it's not too cold and windy. \n\nNext time you are tempted to order a chain pizza, or visit a NY themed place, go here instead.", "author": "Jice E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "This is a hole in the wall at the end of Lombard St, by the Presidio.  It's usually quiet with no wait, unlike most places in SF.  It's ain't too fancy--basically a enlarged pizza stand with indoor and outdoor seating.  The place is small and we love visiting when it's sunny, after hiking walking around the park nearby or running the Lyon St. stairs.  The people that work there are nice and super chillllll....\n\nPizzas are great and they have bottomless mimosas on Sundays.  Both good things after a late Saturday night.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "I am sad to say that this is definitely not NYC pizza.  It is not even close to the worst that I have had in NYC and I grew up there!  Yes, the crust is thin, but not chewy and way underdone.  Also, the people working there don't seem happy to be there.  Will not be going back.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I had a team lunch here after going to the escape room. The staff was super helpful with pre-ordering the food so that once we arrived the pies were ready. All pizza and salads were fresh and delicious! \n\nWe sat outside in the patio as it was a nice day out and we got to enjoy the presidio across the street.", "author": "Carter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "This could have been a 5 star but the dough was undercooked. No crunch. Pale bottom.\nThis could be the first time ever where i could say there was too much cheese. Great quality, sauce, size.", "author": "Scotty L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "This is small cosy restaurant in San Francisco which serves one of the best pizzas. We had a custom made pizza with garlic spinach and onions. I loved the flavor of the soft slightly roasted garlic with other toppings. The pizza was delicious and the service was quick too.", "author": "Bhawna J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "Hidden charge disguised as a discount!\n\nCalled to order 3 pizzas.  They gave me a price. \nPicked the pizzas up, they charged my card - Looked at the receipt - it was a few dollars more than the price they had told me on the phone.  \n\nLooking closer I notice an extra charge called something like \"pay with cash discount\".\n\nYou heard that right - an extra charge called a discount.  Meaning - if I had paid with cash, I would have gotten a discount but instead I got an extra charge.  Ridiculous.  \n\nRather than disputing the charge, I decided not to do business with them again.  Why do business with someone who has hidden charges?\n\nThe guy behind the counter was very friendly.\n\nThe pizza was OK.", "author": "mike s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "NYC friends visiting loved it.\n We had friends visiting us from NYC via Denver. They said it was closest thing they've had to NY pizza outside of NY! I think one of them teared up @ the Bodega pics on the wall. (aww) I teared up a little from the garlic dust on the napkin holders (aww) I got the Lombard slice & a Chicken Pesto slice & a blood orange Pellegrino for $13.50 & that's not bad for SF. Slices big enough I couldn't finish the 2nd slice. It was a little greasy but very very tasty. Definitely worth the cheat day lol", "author": "Leana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "These guys are the best. I live in the neighborhood so I've had my fair share of slices here. Both the Sicilian and the NY style are good, but I'm probably more partial to the NY style. :) \nPizza slices are made to order, (no weird sitting in a circular warmer wondering how long it's been there). And you can pick your toppings at 50 cents each. Always have a \"slice of the day\" they feature. They also have a new great selection of beers. Great outdoor patio for a sunny day or if you have a furry friend!! Thanks Pizzeria Avellino for providing the Presidio with such good pizza.", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "If you're looking for a quick cheap slice that just gets the job done, this is your spot. The time for them to flash cook the slices is pretty short, but that leaves a lot of the fresher ingredients coming out pretty raw (Nothing like some raw garlic). I tried a pepperoni and Italian sausage and can't rave about the quality or taste of the ingredients. There's a nice patio at back that's actually pretty nice to enjoy and beer and a slice. We all have that time we want to chill with a greasy slice and a beer- during those times... this place does the trick.", "author": "Jessen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "If you don't like this pizza, we cannot be friends. I've had a lot of excellent (East coast) pizza during the bay area's pizza renaissance. If this isn't a contender for the best East coast pizza of them all, tell me what is and I will tell you why you are wrong.\n\nThis pie achieves the golden ratio; each bite is a madeleine (as in Proustian) moment.", "author": "Brski B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Excellent meatball sub.  Toasted, homemade meatballs.  Yum.  Great slices of think and thin crust. Slice of the day specials.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "I got the pizza by the slice! Deep dish is $5/slice and the thin crust is $4/slice. Each topping costs 50 cents. And there are a lot of toppings to choose from! \n\nSmall and comfy atmosphere inside, but there are also a lot of tables outside with a view of the park entrance. \n\nThe deep dishes were filling and you'll probably get a food coma afterwards. 2 slices is definitely enough to satiate the largest of appetites :)", "author": "Leo W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "You' think finding a great pizza-by-the-slice spot in San Francisco would be easy. Actually, it's surprisingly hard, at least when it comes to a quality slice cooked just right with all the right toppings. Pizzeria Avellino has become my new reference point as one of the best fast-casual pizza joints in the city by the bay. \n\nI was killing time waiting for my friend and needed an answer to my hunger pangs. Pizzeria Avellino was the first and closest thing to pop up on my Yelp map, so rather than spend half an hour debating and comparing it to other possibilities, I figured \"Why not?\" I ordered a slice, which was big enough to be two slices anywhere else with my usual favorite toppings: pepproni, mushrooms, tomatoes, onions, olives and bell peppers. It came out quick and I sat by the window enjoying each bite with a sprinkle from my own private condiment rack. \n\nIt wasn't the nicest of days when I came in but the picnic table around the corner next to the Presidio seem like a grand place to eat lunch on a rare sunny SF day. I'll note that for my return visit.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "I like their pizza and delivery was usually fast.  Last time however, pizza was almost an hour late and, of course, cold by the time it arrived.  I told Grubhub all about it but they did nothing.  Wanted to like this place but hard to order delivery from there now.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "Pizza was good, but then the kitchen started blasting hip hop music with lots of N-word and cussing.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Excellent pizza at a very good price. Place was spare and simple but the amazing pie that we were served transported us to pizza paradise!", "author": "Victor F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Hmm 10$ for their famous sausage sandwich was pretty good. But for 7$ you can get a good sandwich at safeway.  Inside can get hot. But right around the corner is a nice park. Maybe the pizzas are better. Not sure if theres a bathroom. Theres a bathroom at starbucks across the street", "author": "jerrell m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Authentic NY style pizza at its best. And the guy on the phone that took my order was super busy taking orders and he was extremely polite. \nWay to go guys! I really appreciate it.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "We were super excited to try their breakfast pizza and bottomless mimosas. Unfortunately, they don't offer either anymore. Not a huge deal if the guy behind the counter would have cared about the customer.  When we asked for their breakfast pizza and mimosas, he simply said \"yeah, our site is outdated.\" No concern that we came there for that or even an attempt to remedy the situation. With so many competitors with great customer service, I see no reason to return.", "author": "Kasey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Definitely a great pizza, we added our own topping\nBasil, red onion, meatballs, jalapeños, black olives. \nEverything was so delicious, that crust man was awesome, very good flavor awesome chill spot", "author": "Gilbert N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "I saw that they had chicken wings on the menu so I figure to tried it out and asked for them to  be cook more well done and they came out not cooked and were soggy... avellino should be ashamed... first and last I will order these soggy ass wings", "author": "Chanthasone K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "This is the best pizza in SF. For sure! Like a great sauce to bread to cheese to toppings ratio. Anyway, check them out. They deserve your business! \n\nA few of my favorites are meat lovers pizza.\nHowever I judge most pizza places on their pepperoni pizza. So check it out!", "author": "Chad I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "Great pizza!  Tasty, crisp crust and delicious sauce and toppings.  My favorite is Italian sausage and mushroom.  The sausage is spicy with a little heat -- perfect.\n\nI've only ordered delivery.  The over the phone customer service is friendly and very efficient.  Delivery is great.  My pizza arrives hot before or on the specified time.", "author": "Donna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "\"Does it sound like I'm ordering a pizza?\" -- Die Hard (1988)\n\nThe family and I were on our way to The Palace of Fine Arts to take on an escape room and we needed dinner beforehand. Thanks to my fellow Yelpers, I found PA and it was on the way and had a great rating. First negative was the lack of parking - luckily we found a couple of spaces on the streets somewhat close by, but even that was a challenge.\n\nThere is not much on the way of seating inside, but we were lucky and were there at an early enough time that we found a spot for all six of us. We all ordered individual slices (a family of 6 and of course we all have different tastes). Most of us ordered 2 slices each, but they were huge NY-style slices and some of us could have probably split a second slice between us.\n\nThey have a great variety of toppings and that certainly made it tought for me to decide on what I wanted for my slices. I opted for Pepperoni, garlic and black olives and an Arugula and Italian sausage. I had wanted bacon, but they happened to be out, so I opted for sausage. Both were great - I would classify the crust as a bit doughy, but delicious. There was a good amount of sauce and cheese without being greasy. I was quite happy with the slices and would definitely come back again.\n\nThey have free ice water on tap with cups, so if you are not a soda drinking, like myself, it was perfect. We were in and out in a short amount of time and to our escape room in plenty of time to meet the rest of our party. This place is not fancy and I love that - staff was friendly and I would recommend PA if you enjoy NY slices. A definite place to return to.", "author": "Lindy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "This place is a tiny sit down restaurant on the street corner. They have pretty good New York style pizza for a reasonable price. I actually thought it was a bit more expensive than other New York style pizza places in SF (i.e. The Pizza Shop in the Mission). Their cheese pizzas are $4 while is more expensive than some other types places I've had and 50 cents for each topping. I've digressed, the pizza itself had a crispy crust and had the right amount of cheese and tomato sauce that made it just right.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Pizzeria Avellino is a solid pizza spot. Close to my apartment with big, delicious slices. I also love their garlic bread. More important than the pizza flavor, they have quality and kind people working there. The other night, I dove into Avellino's when a crazy guy started following me. Even though they were closing up for the night after a long day of working, they waiting for my ride to come. The cherry on top was they gave me a slice of pizza for free. In a city where storefronts​ change constantly, Avellino's proves to be a business that cares about the community and always serves delicious pizza. SUPPORT THE GOOD GUYS AND EAT PIZZA!", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "I really don't like pizza and what's sad is I like this pizza. I stop by here from time to time before I catch my bus and today seemed like a good time to do it. Well, somebody screwed up and lost my order. I missed my bus twice when the kid working the counter came to me and asked what I ordered. I told him and he returned about five minutes later to tell me the chef lost my order. No apology, no refund, nothing. Not given a time frame or a solution to correct their error, I let him know this caused me to miss my bus twice and I wasn't going to miss my bus a 3rd time. It's not rocket science and it shouldn't take 45 plus minutes to make 1 slice of pepperoni pizza. I told him to give my slice away because I wasn't missing a 3rd bus. Again, no apology but he happily kept my money and probably never gave my slice away. The management will be hearing from me on my next commute home.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-05", "description": "Super disappointed. I was really looking forward to trying this place as they talk a big talk about real NYC pizza. However, this is pizza is super bland. To me, tomato sauce and crust make a pizza and both of these are super bland here. Sauce more sweet than spicy and crust pretty flavorless. I was really hoping this would satiate my thin crust NY-style pizza craving but alas is was very below average.", "author": "Jim T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "This place is the best New York pizza in SF. I stop here on my way to work all the time. The last time I was there the guy taking my order told me \"it was Under new ownership\" They did not only improve the pizza but made the place look very welcoming. The thin crust and the love they put into the pizza is like no other. Stop by and try pizza Avellino and you won't be disappointed", "author": "Fady A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "This is hands down the top spot for a slice in SF - way better than Arinell in my opinion. The slices are thin with the perfect crunch, and the cheese/sauce balance is on point. \n\nParking is actually not too bad around the corner, and service is quick so you won't be waiting too long anyways. Highly recommended if you're in the area!", "author": "Akshay V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "I have been a customer of Pizza Avellino for years.  I often have my pizza delivered to my home.  Tonight I called to place my order and was treated very poorly.  The man that answered the phone was not only rude to me but hung up on me.  He asked me for my phone number..which I gave him..he apparently didn't understand me and said\"that's not how it works\" with a sarcastic tone.  I don't appreciate being spoken to like that when I'm placing a food order!  I started to tell him and he hung up.  I'm appalled..needless to say I will take my business elsewhere.  There's plenty of pizza restaurants in the Marina.  And quite frankly their pizza isn't that good!", "author": "Cathy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Never disappointed, today was so good, one huge slice was not enough.  Today I ordered a mushroom slice that was pretty ex eptional. Prices are pretty reasonable as well.", "author": "Monica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Legit East Coast thin slice pizza. Delicious and I love that they give you the option to buy by the slice", "author": "Mary M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "I love getting NY style pizza by the slice, and my go-to place is Arinell in Berkeley and in the Mission. However, Avellino makes excellent NY slices - very similar to Arinell, but with a bit more cheese, slightly doughier crust, and just a touch more sauce. The custom slices actually come out a bit better than Arinell - I usually get a sausage slice, and it's very satisfying.\n\nThe crust is thin and slightly crispy, and folds perfectly down the center so you can fold your pizza in half and eat it. The cheese blends perfectly with the sauce and the slices are heated up nice and hot enough to burn the roof of your mouth.", "author": "Allen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Very good pizza. Easy parking and very fast service. I work from home and like to get out for lunch when possible. but when I get out, it must be fast,  no screwing around.  this pizzeria fits the profile. will be back soon to try the chicken park sandwich, which is supposed to be great. \n\nI am craving pizza now...LOL", "author": "Allan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Wasn't sure what to expect, the place didn't look the most appealing from outside through the windows. Glad we went in. Ordered meatball sub and some pizza and it didn't disappoint. We were a little disappointed the deep dish was sold out, but I can only imagine it is because it is so popular. Great divey place near our hotel (Inn at Golden Gate).", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Delicious pizzas!! I had the Lombard and it didn't disappoint! Generous slices and nice thin crust with fresh toppings. Caprese salad was just sliced mozzarella and sliced tomatoes which was very simple and small but still delicious with a basil pesto on the side. Definitely recommend this place. Great NY vibe and photos on the wall with a nice local vibe.", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Good NY style pie at a decent SF price, outdoor patio is awesome when the weather is right", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "We stopped by here upon visiting for the weekend. Sadly was not impressed. The customer service is lacking, the tables were filthy with trash, the pizza was dripping with grease and lacked flavor. \n\nWe were really hoping based on other reviews it would be great authentic NY pizza and it was unfortunately not.", "author": "Janaye J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "It's a must try pizzeria place here in Presidio in my opinion.  We first stumble upon this place on an accident looking for another restaurant that had already closed down (we didn't know), we were so hungry and tired after walking uphills and downhills exploring  San Francisco and admiring the beauty of Palace of Fine Arts.  There are other mom and pop stores nearby but I could not lift a foot anymore, Pizzeria Avellino conveniently sits in the corner of Lombard and Lyon Street, and is close to bus stops.  I'm glad we tried this place!  Its been my fave pizza place here in SF so far, and been coming here whenever I visit the city.   It's a great place for a taste of NY pizza, it's the closest to it that I have tried.  \n\nI lalalalalalove it!", "author": "Freida G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Another 5 star for my dear, Avellino. Thank you for existing amongst some shitty excuses for pizza places in SF. I heart you. Why do you have to be SO FREAKIN' FAR FROM ME?", "author": "Priti K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-29", "description": "Took my nephew there yesterday, a Saturday afternoon. We were celebrating his 9th birthday. I ordered a medium thin crust with full pineapple, half bacon (for my nephew), and half jalapeño (I'm a vegetarian). We sat outside, the sun was shining on us in just right way, and 15 or so minutes later our pizza arrives! It's full pineapple, half bacon, and half pepperoni. When it's dropped off, I repeat my order and add in that I haven't had meat in years. The incorrect half was taken back inside, the pepperoni slices removed, and cold jalapeños are placed on top. I asked if they removed the pepperoni and just put jalapeños on, because bits of cheese were missing as well, and it had looked \"picked on\". My assumption was confirmed, and I had to explain that just because the meat was removed doesn't make this half a vegetarian half. The grease and remnants of the pepperoni were still present. I walked inside, leaving my nephew to enjoy his half, which he devoured! I asked for a half refund, although I was extremely hungry, at this point I would have picked up a salad or a smoothie from some other location. One of the chefs suggested that instead of a refund they would put pineapple and jalapeños on top of pre-made cheese slices. I was quite hungry so I agreed. Back outside I went to be with my nephew, and about 3-5 minutes later my pizza arrives. It was no where near as appealing as my nephews', for on his everything was baked together, all golden brown, but mine was simply placed on top. So when I went to take a bite, most of the pineapple and jalapeños fell off, and the toppings were cold... We we not checked on after that, and I couldn't help but to be disappointed. But I ate a slice of this cold pizza just to have something in my stomach. I went inside to get a to go box for my nephew and I and let Jacob, at the front counter, know that half of our experience had been delightful and the other half quite disappointing. He apologized and brought me a glass of red wine. That was appreciated. I still recommend this pizza place, just have them repeat back your order before paying $25+ for a pizza.", "author": "Miia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Went in for a slice today before work..Slices of the day were great with friendly service from the chefs. Cant wait to go back!!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Yummy yummy yummy! We were hungry, and the more touristy areas were busy last night. My brother found this place online. Simple, greasy and yummy pepperoni pizza! Reminded us of being little kids, eating pizza for one of the first times. The crust was special, with just the right amount of black on the bottom for flavor (not burnt). We will be back, although the ride to get here is very long. Just loved the location and food. BF said meatball sub was also good! Thanks for making yummy food in a nice little neighborhood. How cool that we visited the Palace of Fine Arts nearby right after eating pizza at night. Gorgeous neighborhood and yummy food...an authentic SF experience!! Thanks", "author": "Marty C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-02", "description": "The pizza are really good but $5 for a slice of cheese... \n\nIt's not worth it.  Unless you're starving to death you can find cheaper for as good.", "author": "Théo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Wow!  Can't believe I didn't find this place sooner.  If you're looking for a solid NY slice, I don't know of a better place in SF.  Crispy crust and wonderful ingredients.  Can't wait to try out the rest of the menu (the meatballs looked delicious and the Chicken Pesto Pizza sounded amazing as well).", "author": "Tyler B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Really is like a New York slice in San Francisco! I can even fold it to eat it, which makes me love it even more. Always super friendly and a great outdoor patio. Have to grab a slice here whenever I'm in the neighborhood!", "author": "Chris O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Stumbled upon Avellino while walking around the Pac Heights neighborhood.  Wasn't searching for pizza but just a quick bite to eat.  PA is a no frills, straight down to business NY style pizzeria.  It's a small space with table seating for about 20 and bar seating against the wall for about another 6 people.  There are some picnic tables outside as well.  The menu is simple - pizza by the pie or by the slice and a few salad and pasta choices.  \n\nI've always been a fan of thin crust and NY pizza, so I didn't think we could go wrong here.  Other half and I walked in for a late lunch.  There was only another family of 8 dining in there.  Got to the counter and ordered a slice each.  The slices start at $3.70 for cheese only and each topping is $0.50.  I went with one of my favorites - mushroom.  Other half got bacon and pepperoni.  Serve yourself water dispenser and pick up your own utensils were by the chalk board menu wall.  \n\nWithin minutes, our slices were brought out piping hot to our table.  The slices were huge and more than enough to satisfy our appetites.  I liked that the mushrooms were thickly sliced.  The pizza was simple yet just what the doctor ordered.  Nice crunchy thin crust with basic marinara and cheese.  Happy to find this place and would stop by again if I was in the neighborhood.  Service was fine.  Great neighborhood spot!", "author": "Liv A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "What a little treat that I was so fortunate to stumble upon.  It is a hidden treasure and was so happy that I have finally found my go to Pizza Spot in San Francisco.  Living in New York, I never thought that I would ever find slices made to order with the same quality that I had on the east coast.  I had nothing to lose, so I placed my order.  From the first to the last bite I felt like I was back home.  Atmosphere is awesome with a little patio outside so that my best friend(my dog) can come with me and enjoy what I think is the best New York pizza here in San Fran.  Highly recommend this place if you wanted to sit down or just to grab on the go! You won't be disappointed.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Awesome little pizza place walking distance from Travelodge.  We are here on vacation touring San Francisco and we wanted a good pizza without having to drive so we walked here and the pizza was excellent!  I would definitely come back here often if I lived in the area!", "author": "Elias B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "It's been years since I've had NY style pizza by the slice and this place hit the spot. The price is right... $4 for a cheese slice plus $0.50 per topping. The slices are huge and 1 is plenty for a meal. They're generous with the toppings and service is fast and friendly. I just wish they were open later as we came back from a concert at 1am and had another craving!", "author": "Suzanne Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "I was heading up to the Presidio and needed is quick bite. My nose led me here to this non descript pizza point. It had a patio and the pizza smelled great. I had ordered the daily special and it was only $5.00. It was called the Sicilian special and it was Ginormous. I wanted a beer but they didn't have any, but the gentleman suggested that I can go to the liquor store next door and grab a cold one and bring it back. The place is small but I noticed a lot of patrons got their orders to go.  I also noticed that one of their Special pizza had Ham, Jalapeños, and Pineapples!! That is definitely on my bucket list and I must go back there to try it.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Pizzeria Avellino is one of my top 5 favorite pizza joints in the Bay Area.  I grew up in NY/NJ for 20 years and Avellino's is the closest I've found to traditional NY style pizza.  Nice, chewy crust, and the optimal ratio of crust-sauce-cheese.  This is the nostalgic slice for you if you're longing for NY style. My go-to is the large cheese pie, but their meatball sub and chopped salad are great too.  Online ordering for pickup and delivery is convenient, and there's a small seating area inside.  You can also walk right across the street to the Presidio and enjoy your slice on a picnic bench.", "author": "Jules P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "Our 1 star review is not necessarily based on the quality of the Pizza, this rating is based on the service. We ordered a cheese pizza and a Lombard pizza with extra meatballs through Eat24. The order came pretty quickly but the Lombard pizza had been substituted with a simple one topping cheese and Meatball pizza (no extra meatballs). The driver offered to bring the right one and we agreed, but that order never arrived. We called 10 minutes before they closed to see where the hell it was. But they said the ovens were off and it was too late. The defensive and argumentative employee on the phone claimed they tried to call us several times, but they were calling Eat24 not our number, even though our phone number was clearly shown on the emailed receipt. We did not enjoying getting either the wrong pizza (Nine bucks cheaper than the one we wanted) and the rude argumentative employee on the phone. Do not order delivery from these people if you want the right order, their customer service sucks! Not ordering from this place again!", "author": "Darin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-13", "description": "The pizza looked delicious and tasted ok when we ate it.. But a few hours after my boyfriend and I were so thirsty and felt dehydrated! I don't know what they put in their pizzas but the after effect of eating it really put me off from this place.\nI don't know if there was MSG or just a crap ton of salt, but I  definitely will not go back to figure it out.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "One of the best NY style pizza in the city! You can make your own and add toppings even if it's just for a slice, which is a great option. The ingredients were super fresh and made our lunch such a treat!", "author": "Prashanth V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Visiting from San Diego & we stayed at the Travelodge next door. What a treat! Stumbled by this gem when we were headed to Presidio Park to use the bathroom at Starbucks.\nStayed in SF for 4 nights (had an early fancy shmancy dinner in Chinatown) and STILL ate some Avellino's Pizza this night too. We were never disappointed. Even had the last piece of Sicilian Style Deep Dish slice. NOT the Chicago style deep dish either. \nThe guys who worked there were really cool & engaged in conversation. TV wqas always on. Either watching the Giants or South Park. Which was really cool! LOL\nI always thought the prices were fair. And I just noticed how one of the other photos for this business had a sign that said Thank You Veterans! Free Cheese Slice w/ valid Military ID. How awesome is that?! I love our military heroes & am a proud daughter of a sailor. And I love ANY business that supports our military.\nI highly recommend Pizzeria Avellino!", "author": "Joanne P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Traveling from San Diego and found this place on Google.  So glad we did. Some of the best tasting pizza I've ever had. \n\nThank you.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Great pizza. Good price. Small, neighborhood spot with a nice vibe.", "author": "Stefanie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Oh. My. God.\n\n     This place has seriously delicious pizza. We're on vaca from Temecula, ca. And didn't REALLY know where to eat. This place is awesome! Off the beaten path. Service is incredible. Such friendly people and an outside patio that is warm and inviting. We are having a nice vacation. We'll go back to some places when we return. \n\nWe will definitely come back here!", "author": "Donald L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Really good cheap pizza by the slice. They've got pizza of the day (two topping meat and a vegetarian option) and a couple of salad options... Less than $4 for a big slice? OK! I stopped in to eat (was recommended) before meeting a friend and touring Industrial Lighting and Magic, which is literally across the street. They have seats inside and outside. Outside seating is nice for when it's sunny and warm. \n\nYou can also customize your own pizza, which is typically the case with most places.\n\nQuick service. Polite too. Beats any fast food joint any day.", "author": "Alanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "I lived in New York City for many years before moving to SF and I can say this is excellent pizza that tastes just like a New York slice. I'm only docking 1 star for the price, which is definitely a significant premium to any slice place in New York I've ever been to", "author": "Nitesh Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Place is way better than I thought. I am a New Yorker so I have some standards for pizza. These guys did a great job will definitely grab a slice here again.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Pizza was great! Had the sweet heat -pineapple, bacon and jalepenos. Also got a large cheese. The med and large are almost the same size. Our group sat outside and enjoyed beers and sunshine! Good vibes at this place.", "author": "Cierra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "I live in the neighborhood and value Avellino as a true New York style pie. In fact, if they were open right now I would grab a slice.", "author": "S B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Great pizza SF, slices are huge which I didn't know or I'd have just paid per slice not bought a whole pizza, but it was still delish! We were starving after 6 hours of nonstop driving so this pizza hit the spot. I got simple pepperoni and my friend got cheese & her daughter got a meatball sub. I tasted everything as I must always & it was all yummy, although I'd like the pizza crust a little crunchy but that's just my preference.\n\nI took away one star because the guy at the counter was not friendly at all. He wasn't rude but clearly not approachable either. Maybe he didn't like that we were tourists? A smile would do him some good.", "author": "Lachelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Great pizza, friendly staff. We ordered 30 pizzas from them for a holiday party, and everyone loved their pizza. Professional staff, quality pizza, and very well priced.", "author": "A B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-29", "description": "It's a small spot in SF with a quaint atmosphere and a generally comfortable environment. However, the pizza is bland. Most of the flavor came from just average pepperoni and the pizza itself was incredibly greasy to the point where I found it unsettling. Additionally, the presentation was lackluster and looked less appetizing than a fast food pizza (which would probably taste better too). Overall, this tasteless, greasy mess is definitely not worth the price and I wouldn't recommend this place to anyone.", "author": "Luigi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Solid ny style pizza, way better than all the other local pizza joints like orgasmica and marina pizza.", "author": "auclair k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Hotties serving bomb pizza. The boys are sweet and the pizza is sooo delicious, definitely better than anything on the warf!", "author": "Angel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-10", "description": "++++++++++++++++++++++++++++++++++++++\n  IMPORTANT - UNDER NEW OWNERSHIP\n++++++++++++++++++++++++++++++++++++++\nUgh. I feel sad and betrayed. Why? Because I just lost my favorite NY-style slice pizza joint in San Francisco. Avellino seems to have been sold to, let's just say, non-NYers. The former owners appear to have stripped this place right down to the paint, and along with it, its NY soul. Gone is the NY-inspired pizza. Gone is all the cool NY-inspired art and especially photographs. Gone is the long NY-style counter with shakers of oregano, chili flakes, and parmesan cheese. Even the menus above the cash register are gone, replaced with hand-written paper signs haphazardly taped to the wall. I don't know who the new owners are and I don't know why they believe they know how to tap into the NY pizza getstalt, but I can say that my most recent (and now, last ever) slice was overheated and burnt, with too much cheese and too little flavor. Sad.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "Good za! Value pricing! Limited seating but a great locale at Lombard gate. Try it and become a fan.", "author": "Oscar C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "This place is the best pizza in SF and it's not even close. Stands up the the best in New York for sure.", "author": "Garrett F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Always delicious thin crust pizza and courteous service! It's hard to get pizza like this in sf.", "author": "V J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "This place is solid and dependable and good. The people that mark it lower probably are from the Marina and think, \"It really doesn't have enough TVs.\" Or \"The women that come here aren't as hot as the Bus Stop.\" They should stick with Paxti's and not crowd up the place for people with real tastes.\n\nAlso - the people are super cool, I'm sure the ones that think otherwise want to be fawned over by a waiter. It's pizza. Hand held. Take it and eat it and that's it.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Great local fav! Went in for a slice of classic NY style thin and ended up with that and the Sicilian square cut deep dish on special. Will absolutely be back for more of both!", "author": "Kristen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Great food!! The customer service was spot on as well! My dance group (~20 people) stopped in to eat something quick and they were more than helpful to accommodate.", "author": "Candace A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "5 stars for the pizza, 1 for the service. \nThis is legit the only NY style pizza I've found in SF. Big slices, perfect cheese/sauce ratio, everything your looking for. However, the service or lack there of is atrocious! Every time we call for a delivery, they don't have anyone available to bring it to us. When we go to pick it up they tell us it will be ready in 20 min, but it takes 40. Lastly, tonight @ 9:35pm I came by to get a few slices and the gentleman working told me all they have available are salads and sandwiches. No more pizza. What?! You're a pizza place that serves slices...on top of that, the guys working were staking chairs on tables. They clearly didn't want to work anymore. Do the owners know about this behavior?! I'd love a response...", "author": "Crystal I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "New Yorker here. Born and raised.\n\n'X' out of your browser and close your laptop. If you're on your phone, stop scrolling down and hit 'get directions.' In other words, go here. \n\nThis is the closest to a NY slice we've found in the city. All the other pizza spots are just noise. Why?\n\nThe texture of the cheese = on point. \nThe consistency and texture of the dough = nailed it.\nThe flavor and amount of tomato sauce on our pie = just perfect.\nThe SMELL of the place when you walk in = unreal. Close your eyes and you'll feel like you're in NYC.\nThe guys behind the counter = awesome.\n\nAND, as a bonus: YOU CAN FOLD THE PIZZAS TO CAPTURE ALL THE GREASE.\n\nI really wish I didn't live in Potrero Hill... it's so far from Avellino. But I guess that's also a good thing, otherwise I'd be here every single day.", "author": "Tik P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "My new favorite pizza place in the Marina. I've eaten a lot of pizza, and at every location in the Marina and Cow Hollow, and this is now a winner for the NY style set. Consistent quality and quick preparation.", "author": "Matthew v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "The ambiance was great staff was super cool. The garlic cheesy bread was super awesome but the pizza was just ok.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "For a pepperoni pizza overflowing with pools of oil, I was pleasantly surprised when I took a bite out of the heart-attack-inducing, artery clogging critter. It was bigger than my head for $4. I soaked through 3 full sheets of napkins, and it was still leaking! Fortunately for it, it was mighty tasty so I finished it entirely and felt full for hours.\n\nThe menu was...different. I'm not a huge pizza fan, so the only time I'll have it is if I'm feeling lazy and it's a Pizza Hut/Domino's kind of day; Pizzeria Avellino offers something homelier, and it felt like the real deal. Extensive and creative menu (http://pizzeriaavellino.com/menus.htm). The slice of the day when we visited sounded like a breakfast burrito...on a pizza crust! My friend really loved hers even though her palette was confused by the combination at first. Mine was equally and confusingly good as well. Thin, crunchy crust. Flavorful sauce. The pepperonis were small, but they were delicious (flavor and texture was on point; crisped up on the edges) and the ratio was perfect. Cheese was melty, gooey, and stretchy.\n\nThe cashiers were friendly! Space was limited though, but it wasn't busy that Saturday morning. The benches were littered with bits and pieces of food, so it was a little unnerving to sit there; I also noticed the covers on the tables had leftover sauce on them because it ended up on my white sleeves. So if you dine here, be careful where you sit and be ready to enjoy some real good pizza! \n\nWe were recommended this joint by our inn's check-in clerk, and so it seems like a good local spot to grab a quick bite to eat.", "author": "Ivy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Great pizza period! And you can go next door to Golden gate market and buy beer and wine and bring it in with you while you enjoy your pizza!! Outstanding!", "author": "Juicy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-20", "description": "Ordered the Medium Lombard pizza and can say with thriving confidence that it was one of the worst pizzas I have ever had - stale crust, stale pepperoni and sausage. I lived half my life in Chicago so I know a thing or two about pizza but this was just pitiful. Maybe they were having a bad day but that's my only point of reference. Definitely not eating here, ordering or recommending this place to anyone!", "author": "Kabir S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Finally solved the delivery issue! I can't wait to get Avellino when the craving hits!", "author": "Kim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-25", "description": "If you want to charge $0.25 for a carry out box for slices that's fine, I'm ok with it, really! But don't put up a sign saying you are doing it to discourage use and save the environment! If I buy 2 slices to go I need a box, that's just the way it is. Just build the cost into the price don't blame a lame attempt to save the planet as your reasoning. I understand you pay for the box and I'm fine with paying for it too!\n\nThe pizza was good although every time I was there they only had cheese but would add whatever topping you wanted upon reheating. That never works as the topping just fall off.", "author": "Randy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Best slice I have found in nearly the entire city of San Francisco.", "author": "Slob M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Yummy pizza by the slice option. They have a cute little outdoor seating area that is gated off of the sidewalk. Quick service and good prices.", "author": "KF B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "It's great pizza by slice and definitely worth the 15 minute trip. I dig the casual atmosphere and the service is alway quick a attentive.", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Love the pizza and I come from a family that has owned a pizzeria in LA since 64.\nOnly concern is the young lady behind the counter need to put her hair back.\nLong hair and pizza don't mix...health dept violation.", "author": "Hip P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Boyfriend got two cheese slices and I ordered 2 slices of pepperoni. A little greasy but it was absolutely delicious. Staff was friendly and brought out the pizza for me since we were eating outside with our dog. A little bit pricey but was delicious. Inside it was small and quaint pretty clean as well.", "author": "Christine V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-26", "description": "Your basic corner neighborhood pizza joint. They make the greasy fold over NY style slices -and though I would have normally said yuck, yuck not for me, I gobbled ever delicious bite.\n\nDecent basic Caesar to accompany. No wine (though it's offered they were out of all whites) and a decent beer selection.\n\nThe dining area is small with picnic benches outside for warmer times.\n\nAll in all a decent pizza joint and worth a stop if you live or hotel in the neighborhood - we took ours to go but the place was decent enough to hang out.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "For starts I have been sick all day after eating their meatball sandwich so, working in the food industry myself, I assume the food was mishandled in some sort of way-not clean hands or leaving out being refrigerated too long.\n\nOver priced, for a 5 inch sub it was 10 dollars. It was mediocre, no bad, but just not worth 10 dollars. 6 at best. \n\nThe staff was friendly but took a long time to actually get my food given that knows 1 of 3 customers.\n\nWon't be going back.", "author": "Gabriela F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "The pizza here was really great and seeing as how I was paying a visit to the Palace of Fine Arts it was a great little find. The pizzas are a bit larger than other pizza places so the cashier made sure it was alright before putting the order in. The cheese bread was also really interesting because it was just a small pizza with cheese on it. It was definitely fun to eat though.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Just got delivery from here via PrimeNow Restaurants - AWESOME. I haven't even finished my first piece and decided to write this review. It only took 45 and the pizza is literally perfect. New favorite.", "author": "Neeti C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "The best pizza I had here in SF since I move 6 months ago. And I tried a lot of different place. They really deserve a better grade specially for a specially cheap price. Will come again for sure !!\n\nPlus there are really nice.", "author": "Angélique Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-22", "description": "I'm torn when it comes to this review. I've always enjoyed the pizza huge and cheesy with crunchy crust just how I like. But. The service. Wow. I'm not sure who the boss is since he's never around but the employees are left to \"run\" the business however they want which leads to a complete lack of concern for the customer. I have 2 options basically: 1) come when the chubby guy who makes awesome pizza is there and deal with the awful service or 2) come when the other guy is there and get /ok/ service but terrible square-shaped pizza. It's a weird catch-22. \n\nMight as well get a sandwich next door. :/", "author": "Ligia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-24", "description": "A trip to the city has us looking for a late bite close to where we were stressing in the marina district. Within walking distance we find this great little hidden gem. A small out of the way pizzeria at the end of Lombard St. with true thin crust new york  style pizza. \n\nCounter service only to order and for to go. Order, grab a seat and a beer or glass of wine. Fresh, hot and traditional style pizzeria. \n\nGreat Giants baseball memorabilia and an electric mix of 1970's album covers cover the walls make for interesting decor and viewing while you dine and drink. \n\nYou can order by the slice or a whole pie, and this cool little joint also offers a Sunday brunch pizza.\n\nPersonable friendly service and cheap pizza, with a few beer and wine selections available. Well worth the stop.\n\n00003", "author": "Ray F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "nice tourist trap they got there...I ordered a slice of Italian sausage/black olives and they sure came from a can, no flavors at $5!\nthe only good part was the A/C outlet to charge my phone.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-14", "description": "Things seem to be moving in the right direction.  Pizza is absolutely the best NY Pizza in SF and they finally seem to have a delivery driver, as the last 3 times we have called, there haven't been any issues", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Walked the Golden Gate Bridge and built up an appetite. \nAte here with my teenage boys. They loved it.\nFriendly service as well.", "author": "Craig F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-26", "description": "Three stars is somewhat ironic, because it was either tasty (4 stars) or weirdly crappy (2 stars).  I think the rating overall is just too high, and probably reflects this is the only pizza option on the presidio side of Lombard/Richardson", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Great service and great pizza! Perfect neighborhood pizzeria! The Lombard was delicious! They were very accommodating and allowed us to grab a beer next door to enjoy with our pizza!", "author": "Dacy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "This little corner spot offers pizza by the slice which is so hard to find in SF! The pizza starts out as a basic thin crust cheese (you can also choose the deep dish sicilian variety) and then you specify any number of toppings (selection includes pepperoni, fresh tomatoes, arugula, mushrooms.). The slice is topped with your choice of toppings and then quick-fired in the oven so that it's piping hot. It's called out or brought to you. Each slice is large (just under/about the size of a paper plate) and will ring in at about $3.50 + pay per topping.\n\nIt's not quite like NY dollar pizza (the cheap slices off the street), which have a flexible crust that you can fold over -- this one has a very crisp bottom. Each slice is also fired to order until bubbling hot, unlike in NY where the pizzas are sitting out all day and reheated for a quick minute. Lastly the edge crust is full and risen, whereas in New York it tends to be flat and bready. In any case, this pizza is still very delicious in its own right. :) Sauce is flavorful, crust is crispy on the bottom with a good chew, and the cheese is a modest amount -- a perfect ratio.\n\nThere's a small amount of seating inside (~20 seats plus wall area with bar stools) and some picnic tables and benches outside as well.\n\nOverall excellent and one of my favorite thin crust slices in SF!", "author": "Jennie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-31", "description": "Recently ate here after a walk around the Palace of Fine Arts. Pizza was sub par to say the least. Here comes the fun part... my father and I both had food poisoning the same night after we came home. I don't know what they're doing at this pizza joint, but eat here at your own risk. I would give it a half star to no stars if it was an option.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Great pizza and cheese bread!  You can special order each slice of pizza!  The crust is perfect...just slightly crisp on the bottom,\nNot too thick, tasty and generally awesome!  The garlic cheese bread was delicious also. Can't wait to go back. Friendly service, great neighborhood atmosphere and terrific food!", "author": "G M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "Surprised they don't have higher ratings! Delicious NY style pizza! \nAfter coming back from NY, I was depressed because of the shortage of NY pizza here. One day I came across Avellino's and was overjoyed. \n\nThey also do pizza by the slice! Super convenient. \nTheres a bench outside so you can drink a beer and bring your pup.", "author": "Dee N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "I've been here a few times. The breakfast pizza is delicious. I think the veggie is better than the one with meat. It has much more flavor. I also tried the Nutella dessert for breakfast...whoops. But so tasty. No regrets. I want to try and see if I can make that at home as a little treat! \n\nAlso one mimosa is $8 or bottomless mimosas for $8...pretty easy choice!", "author": "F T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "Oh pizza. I love pizza. I would eat it everyday if I could, but it's unhealthy. This place is a simple pizza place located in the Marina near the Presidio. I got mushroom. The crust is good and sturdy. It was a pizza recipe without frills and I would eat it again. Good service.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Real New York pizza. If you have always wanted to try pizza from nyc or miss it from back home, go here. The guys are from ny. A little pricy at $4/slice but worth it.", "author": "caleb d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "I couldn't be happier. I came in for something healthy-ish and got an AWESOME chopped salad with bacon, olives and mozzarella. It was a good sized bowl that filled me up (I'm 6'3\" and about 245lbs). Plus it's BYOB! LOVE IT!  I've been in for pizza too and that's a good call too. Well done!", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Pizza is great! Parking is hard to find, but it's SF so that's expected. The service is terrible though!!! They are awkward, and not friendly.", "author": "JC C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "So delicious. The pizza here is great, albeit very greasy...but that just adds to the flavor :) I come here fairly regularly for lunch, and the staff is always friendly and the service is great. I've never ordered a whole pizza, but the individual slices come pretty quickly and are huge! I've also been here for brunch on the weekends, and their $8 bottomless mimosas are fantastic.\n\nIt is always VERY hot in there - do just be aware that you may want to sit outside on a warm day!", "author": "Aly G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "Their quality has gone down the tubes or burnt up in the oven.  Worst meal I've had.  Pizza was raw in places and burnt in others.  The sanitation is disgusting.  We could not eat 80% of our meal because we watched them rinse used dishes and silverware with no soap and give it for people to use.", "author": "MA C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Great dance floor! Fantastic pizza and wonderful service, too.", "author": "Emma C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-12", "description": "As a Chicagoan, I believe in the Church of Thick Cheese and Robust Sauce.  As a visitor to San Francisco, it's gonna be hard for me to convert to thin, virtually sauce-less pizza.\n\nPizzeria Avellino is a tiny little restaurant with a limited menu.  You can either get slices or an entire pie, but don't expect to order small, medium or large.  They come in one size, depending on the style you get.\n\nI took a shot at the formaggio (four-cheese) napolitana style.  I sampled the first slice without alteration.  It was... good-ish.  It had such a slight flavor that as I continued chewing through the pie, I found myself dousing it with increasing amounts of powdered garlic, parmesan and red pepper.  I was disappointed by the lack of any substantial sauce.  It tasted less like pizza and more like flatbread with a thin cheese layer.\n\nAs I ate it, I couldn't help but thinking this was the kind of pizza girls would love.  It's light, it's not terribly flavorful.  It's the pizza equivalent of salad.  Maybe you'd hit this kind of place for lunch, but not to satisfy a monstrous hunger.\n\nTwo things were a bit odd about the restaurant...\n\n1) As I walked in, they were playing Rage Against The Machine over the speakers.  Awesome, sure, but it didn't quite fit their aesthetic.\n\n2) I asked for a cup of ice water.  \"We don't have ice,\" the guy said, \"but the water will be cold.\"  Ooookay?\n\nPerhaps their NY style pizza would be more up my alley.  I didn't hate Pizzeria Avellino, but I didn't love it, either.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "I came to Pizzeria Avellino just to grab a quick meal to go in a place that actually had a bathroom! (Many nearby stores and restaurants pointed me this way when I asked for their bathrooms.) \n\nI was willing to pay just to use the bathroom, but I also got a yummy meatball sub too! The prices may seem high, but the portions are quite filling. I expressed my concern over how much cheese would be in the sub since I'm not the hugest fan, and they seemed to accommodate my request. The house-made meatballs were indeed a highlight for me, so I'm glad they recommended that. They also had outlets in the restaurant and ample seating. My only issue was that my friend and I waited way longer than anticipated for our orders...", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-03", "description": "This place is a joke. I called and ordered a large pineapple for pick up. I repeated pineapple multiple times, and even made sure the Pizzeria Avellino representative said pineapple back.\n\nI arrive to pick up my pizza, and they made me a pepperoni! Honestly, how could someone be SO stupid, that they can't even get a simple order right? Large pineapple. Two words.\n\nI won't be coming here ever again.", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-25", "description": "We had a medium cheese pizza and it was pretty tasty. My guy is from the east coast and is very picky about his pizza, but he seemed to enjoy it. Not a lot of seating indoors, and no fountain drinks. Pricing was ok- $23 for our pizza, two waters and a bottled iced tea.\n\nThey seemed pretty busy with people ordering by the slice, so probably a good place to stop for a quick lunch", "author": "Angelica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "This is an entirely decent pizza slice - thin crust, tangy sauce, not too much cheese, not expensive.  \nI'd give it a fifth star is the crust had a bit more chewiness and not just crunch.", "author": "Jaina S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "This pizza is not very good. I like the spices they use, but it was soggy, and the sauce tastes way too sweet. I would go elsewhere if you want something good to sink your teeth into, because the pizza is also pretty thin.", "author": "Evanthia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Awesome Pizza, awesome service! We are definitely coming back!!! We ordered a large pizza and ended up wanting more (due to a bigger appetite than realized).", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "The pizza is pretty good and the slices are really big. The only reason they aren't getting 5 stars is because I found a hair on my food.", "author": "Alejandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Small hole in the wall restaurant with great pizza by the slices! Fast, efficient service! Place to sit outside too! Right by Presidio, and close to UHS", "author": "TK L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "Longtime customers addressing the owner Gil about your employee David (working evening on 6/25) about his lack of attention, dishonesty, and disrespect towards your customers. TWO times in one week called in a to-go pie and showed up with no pie made/order not put in. What bothers me even more than being inconvenienced is that David tried to cover up for his errors by saying it would just be a few more minutes - a total insult when can see the pizza being prepared from scratch. The first time we swallowed it and brushed it off, giving David the benefit of the doubt because I get it, we all have bad days and things happen.  But to repeat it in a matter of days and for David to just throw his hands up and act like he doesn't give a damn about people or the business is just not right. Why work a job you don't like? Also I am leaving this review because David didn't provide me with any info to get in touch. There were also a few other issues with how the situation was addressed that I can discuss with you if you care to get in touch.", "author": "Kay A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "Absolutely THE WORST PIZZA I ever ate! Soggy in the middle. Hard as burnt wood on the outside. Un-eatable!! \nWhen we asked him for a fork, he took one from the used utensils pile, quickly rinsed it in water, and gave it to us.\nAt least he could have wiped it under his arm pit! \nTOTALLY GROSS!!", "author": "Rich K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Awesome good pizza for $4?!  Heck yeah!!   Plus really cool vintage signs and Killer classic rock music playing.  They don't serve beer but let us get some tall boys from the liquor store next door n bring it in; even gave us a bottle opener.  Thanks guys!  This place is cool, divey & chill.", "author": "Jaye V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Perfect! Stopped in after a 7 mile walk. Totally hit the spot!  I want more!!", "author": "S. Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-28", "description": "I grew up and raised a family in New York.  I know a thing or two about NY style pizza.  We ordered two slices.  They were disappointing.  \n\nFirst, the technique of pizza making:  The crust was very unevenly formed with the center of the pie paper thin.  It was so extremely thin that it could not hold itself up even with my hand propping it under the wax paper.  Eating this poorly formed pizza was an embarrassingly untidy chore.  The pizza maker was obviously a newbie and was not properly trained.  \n\nSecond, the pizza itself was lacking in flavor.  The crust was unlike NY pizza which has crispy outer skin with pleasantly chewy bread inside.  This pizza bread was just chewy.  The tomato sauce was flavorless and bland.  The cheese was reasonably good though.  The oregano on the table I sprinkled on the pizza was flavorless.  It was likely very old.\n\nThis place tries to be NY style pizza, but it fails.", "author": "Robert W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "My family and I were spending the day in the city and this place happened to be the closest place we could find (we were starving). It's a little cramped inside but the pizza is SO GOOD. It was the highlight of my day!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "As a new yorker that has lived in LA and now SF this is by far the closest to proper NYC pizza I have ever had! I work right across from here and you best believe I go there at least once a week.", "author": "Jesse F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "This is my favorite spot for Sunday brunch. Mimosas and breakfast pizzas are available only on Saturdays and Sundays.  $8 bottomless mimosas (use to be $5..DARN..but still a good deal)! Amazing breakfast pizzas ($20 for M and $25 for XL). A tiny TV, maybe 19''? but we were able to watch the entire niners game. \n\nThere's a parking lot for a few cars but street parking is easily found too. \n\nOnly wish the bathroom was more easily accessible. You have to go through the cashier to the back of the kitchen and the cashier has to keep opening the door to let you back there (or you can crawl under the gate). I felt a little annoying since I had to go every few minutes since my small bladder runs like a faucet with bottomless mimosas.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-22", "description": "This place is really convenient to the Presidio and a decent joint when you're craving a slice. Great crust, and pretty good sauce - not a fan of their sausage or pepperoni, or any of their toppings in general. There are much better slices in the city but this place is decent in a pinch.", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "Authentic NY style or not, I have no idea. The pizza was okay- very decent, but nothing so amazing or different that I'd be raving to my friends about it. \n\nThe good news is that it's cheap - $24 for an extra large that may very well be the biggest pizza I've ever seen. They also have free delivery. \n\nThe guy forgot our salad, and on his return trip, he threw in a bottle of Coke. Nice gesture, even though I don't drink soda.... \n\nSomething weird- the phone number on their receipt actually connects to the wax museum at Fisherman's Wharf. That led to a very confusing conversation!", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "New Yorkers, get a delicious slice of pizza, fold it, and walk thru the Presidio. Forgettaboutit!", "author": "Peter H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "Pretty much the real deal here. The crust is almost a little too thin around the edges but still a very good, authentic NY style slice. I will definitely be back for a slice with homemade meatballs.  Didn't try them this time as I always try out a new pizzeria with a plain slice. It passed the test for sure.", "author": "Jess G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "The pizza slices were large and filling. Great taste! The best were the blistered shishito peppers with lemon aioli!", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "Former New Yorker couple approved : D\n\nMy husband is the kind of guy that prefers NY style pizza over Italian style (and obviously over Pizza Hut, etc but that's a duh).  He is also the kind of guy that spent the first two years of college feeding on slices of pizza and ice cream in NY.  Lol.  I think I can technically claim that he is a pizza ho.\n\nOn the contrary, I like NY style pizzas okay, but prefer Italian style.  NY pizzas are tricky for me, as it can often involve fake cheese, lots of grease, and OD on salt.  So I'm pretty fussy when it comes to this type of pizza.\n\nWell, who would've thought we'd find a pizza joint that actually serves pretty authentic NY style pizza AND we actually both like, in San Francisco?  We totally beat the odds with Pizzeria Avellino.\n\nWe had a coupon that we bought from one of those online local 1-day deal type websites.  We ordered a medium Lombard Combo pizza with caesar salad, 1 beer and 1 Java tea... the bill came out to be $30... with the coupon I had, we effectively only paid $15. Cha - ching! : D\n\nThe Lombard Combo pizza was a perfect amount of tomato sauce and cheese topped with pepperoni, sausage, mushrooms and black olives, on a think, crispy crust.  Served up piping hot.  We dined-in so we ate it at the freshest condition; ) Not super greasy like some American pizzas can be.  That and the crispyness won some points from me.\n\nThe staff there was friendly and cool, although they kinda forgot our ceasar salad and I had to ask for it.  It looked like they just pulled it out from their fridge where they keep all their bottled drinks, though, so now that I think about it I don't know if I was supposed to get it myself?  Then again I would still have to get the croutons and dressing from them.  Anyway, caesar was VERY cheesy.  basically loads of shaved cheese on top of lettuce, plus croutons and rich caesar  dressing.  I liked it but it was so rich, after half the pizza, I was already ODing on salt and couldn't finish up the salad alone.  Good thing my husband prefers to be less healthy lol! as he helped finish up the salad too.  \n\nWe also like that they are open until 10pm.  I tend to take evening dance classes in the city and often don't get out until 9pm, so finding places we can swing by after 9 in the city is very key and much appreciated.  Definitely wouldn't mind coming back the next time my hubby has a pizza craving! (which is pretty much every week haha)", "author": "Sascha O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "Pizzeria Avellino was my first foray into NYC style thin crust pizza. We ordered an XL Lombard Special and on half subbed bell pepper for olives, no problem. This turned out to be a good choice in size because it gives you 8 huge slices and my friend and I ate 3 each. Also had a good porter beer with the pie. After ordering we checked out the British bar next door and it was old fashioned but decent. It had the game on but on mute. I'm partial to this pizza place because my cousin works there but it's a good place to check on the edge of the Marina there near the Presidio.\n\nThe decor is cool, loads of 70s-80s album covers on the walls, Giants championship gear, old SF stuff, clean and interesting design.\n\nLooking at the menu, I look forward to giving the meatball sub a try and some of their hot sandwiches. I'm sure the salad is good too.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "5 close friends and I decided not to lose a great parking space at the Palace of Fine Arts and walked toward the Presidio. Tried to get in to a local place that refused to seat us (\"sorry, no reservation, can't seat you\") and walked around the corner to find this gem.\n\nGREAT thin crust pizza! We had the veggie and the lombard combo. Thin, crispy crust with just the right amount of sauce and toppings. I don't usually eat pizza any more but I was SO glad I made the exception! FANTASTIC.\n\n2 sizes: Medium and Extra Large. The medium is more like a large and the extra large was too much for 4 ravenous pizza eaters! even the leftovers were yummy.\n\nGood service even when the place got full with a line that stretched out the door.\n\nBig props to Pizzeria Avellino for having Palo Alto Fire Fighters Pepper Sauce on every table (my current favorite pepper sauce). It was a treat to find it there (awesome sauce AND all proceeds go to Charity!).\n\nSoooooo, if you find yourself starving in or near the Presidio or you are a thin crust Pizza lover, head to Pizzeria Avellino...I can't imagine you will be disappointed.", "author": "Gary O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-30", "description": "It's been a while since I've had a pizza from a place other than Costco. I walked down this neighborhood and it smelled pretty good from the outside so I thought I would give it a try.\n\nI ordered a slice of pepperoni and a slice of sausage pizza. Both were around $4 per slice, but unfortunately neither slice really impressed me. The cheese and sauce were good, but the meat toppings felt like they were just thrown on top after the pizza had already been cooked. Most of the crust was pretty good, but on one of the slices it was slightly burnt. The slices are really large though, so at least you get your money's worth quantity wise.\n\nThe service is decent though, and at least I got to watch part of the Giants game while trying the pizza. I guess one more plus is that there is outdoor seating if you want to enjoy pizza outside on a nice day.", "author": "Allen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "I've only had one order so far. Four stars for taste--solid thin crust, good sauce/cheese ratio. They also delivered pretty quickly and the pizza was still nice and hot.\n\nThe only reason I'm taking a star off is because the order experience. I had to tell the guy three separate times what my order was, and it took forever for him to get it. Then, when I did, the pie that I asked for half-mushroom half-sausage was all sausage and half mushroom.\n\nLet's see what happens when I order next time.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "Walking around on a Sunday morning with a hungry child (are they ever truly hungry?) is never a pleasant thing, but they had just the thing to ward off the coming gremlins - Breakfast Pizza! and it was so good I got one to go for the rest of the tribe. Had the leftovers the next morning as well, double eats! (the Bottomless mimosas caught my eye too, alas,I didn't have time to enjoy even one).", "author": "Gavin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "Pizzeria Avellino is like Arinell without the attitude. Really solid New York style pizza - I ordered a medium pepperoni and it's enough food for at least 3 meals plus a couple of late night drunkie slices.\n\nThe restaurant itself is on the small side but is kid friendly and they have a great happy hour deal on beer ($2!!) and slices. Plus everyone working there was über friendly. I used my Fresh Guide coupon to save some money on my pie and to try a new place...thanks to that Avellino will have a repeat customer!", "author": "phil h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-04", "description": "After a night of drinking, came here for a slice of pizza. It was large but greasy and just okay (~$4.50 a slice).", "author": "Siv L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "We had the pleasure of eating here on our last visit to San Francisco - We were staying nearby on Lombard and walked UPHILL for a couple of blocks and this place and it was just great - It was truly one of the best dinners we had in a city of great dinners for us. We had a pepperoni, sausage, mushroom and onion pizza - we got the medium and between us we killed it- it was that good - and the guy at the counter was a Chargers fan to boot - If I ever go back to San Francisco I will surely go back - Thanks for the great dinner", "author": "Vic c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-01", "description": "I went for a long run and ended here. I was starving, and was glad that Avallino sold pizza by the slice. I did not have to wait more than 4 minutes for my pizza. The slice was HUGE. The crust was really great thin Napoli style. The toppings were slightly underdone, as if they were added half way through the cooking process. There is really great outdoor seating, and it's adjacent to the Presidio for your viewing pleasure. The staff is really great.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "We went here on a whim because all the other restaurants we found here on yelp were either non existent or shut down and I'm so glad we did! I got the caprese panini and the chopped salad, my boyfriend ordered the meatball sandwich and we were so impressed! Reasonably priced and completely delicious. Food didn't take much time at all and it was some of the best I've had in SF. Definitely wanna go back and try out those slices. They looked amazing!", "author": "Alicia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "I'm not going into detail other than to say:\n\nAuthentic NYC Pizza (period)  \n\nAnd I actually lived in NYC for 15 years and ate a slice a day - so this ain't coming from a gal who thinks Noahs serves authentic bagels, Noah's rolls maybe - \"bagels\" - not a chance.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-25", "description": "Great place for kids.  I couldn't believe the bottomless mimosas were $5 with my own pitcher.  Pizza brunch is amazing, and their pizzas are made fresh - super tasty!  Free WiFi = bonus!!!  We love the cozy atmosphere.  If it wasn't so cold in the city, we would have dined outside.  The restroom is clean and staff are friendly.  The owner cautioned me about the huge pizza oven when walking by.  Decent wine selections for a neat pizzeria/cafe!  Sodas are sold by the bottle or can.   I'm coming back with the family.  Parking is available for customers, bingo!", "author": "Christine R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-22", "description": "We walked over after attending the SF Hip Hop Dance Fest at the Palace of Fine Arts, just 2 blocks away. My son and I like thin crust pizza, so this pizzeria fits that category. \n\nThe three of us only tried 4 slices, so I can comment on how a whole pie would be, but we had the following thin-crust slices:\n\n* cheese for my son\n* veggie special of the day (peppers and olives) for me\n* meat special of the day (sausage and pepperoni) for husband\n* mushroom for husband and me to share\n\nMy son was very happy with his cheese pizza. He's picky, so that was a success. My husband and I weren't blown away with our pizza. It was just okay.\n\nThey added the toppings before reheating our slices. The peppers on my pizza had a smoky flavor, so I pulled most of them off (not being a fan of smoky flavors). My veggie slice could've been slightly hotter. The mushrooms were just so-so; I found myself comparing them to Speederia in San Carlos (I prefer their thin-crust mushroom pizza). Speederia's toppings are already on each pizza, as opposed to adding toppings before reheating slices like they do here.\n\nWe had some root beer. They have no ice (strange), but a good variety of beverages.\n\nService was friendly. The interior is small, clean, and inviting. The décor is a few steps above your average pizza joint. The posted health inspection report is 96, a very respectable score. Kudos!\n\nThe pizza wasn't remarkable, but it tasted fresh and the ambiance was pleasant. They don't appear to make my favorite pizza (margharita with tomatoes and fresh basil) - oh well. It was convenient, inexpensive, and quick.\n\nSicilian deep-dish pizza is available by the slice.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Delicious pizza. The crust was really good and you can call them to have it delivered. Our piazza was veggie with basil, mushrooms, olives, green peppers, and cheese. We almost ate it all because it was so good! We got the smaller of the two sizes offered.", "author": "Martha N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "Great NY style pizza that you can customize by the slice. Would definitely come back. :) I didn't catch the owner's name, but he was really nice and so was the service. He has these cute photos on the wall to remind him of NY.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-22", "description": "FOOD:\n1.) Pepperoni pizza = pretty good\n\n\nSERVICE:\nNice friendly service. They gave a cardboard box even tho it was just a slice.\n\n\nATMOSPHERE:\nCute small place, with outdoor seating as well\n\n7.9", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Good pizza. Try the meatball sandwich too.", "author": "Shane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "Pizza bagel.\n\nConfident they'd say no when asking if I could get an egg white and marina sauce bagel for breakfast.\n\nConfident saying they're awesome for doing it and doing it well. Delicious.\n\nWiFi available while you sip caffeinated drinks like a large and inexpensive americano.\n\nMakes up for the so so first experience. This one was just so so good.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-08", "description": "I really wanted to like this place, since it;s small, sincere, and informal.  But, no salad available.  The xlarge pizza is just enough for three people (we had four), so we ordered a couple pieces of sicilian (more like a focaccio, if you as me). \nThe whole pie was thin and crispy, just right in my view, but the sauce, cheese and toppings were just ok.  We had the lombard, and it didn't seem really memorable, even with anchovies.  \n\nI'd come back for happy hour, where there is cheaper cheese pizza and beer.... but for the price, it's a little high for what you get", "author": "Gary Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-28", "description": "My friend and I got some pepperoni slices to go from this place yesterday. The service was fast and friendly and since we got the pizza to-go we were given a decent size pizza box (rather than the small to go packages you sometimes get at other pizza places). They were sold out of some of their pizza options when I first arrived but I guess they were in the process of making more and this meant a 30 minute wait for their prosciutto and sausage options.\n\nThe pizza was good but a little on the greasy side. I found myself leaning a lot to avoid the greasy dripping on my clothes. All in all I'll be back here when I'm craving some pizza and want a nearby option. To be fair I need to try one of their freshly made pizza options and eat it in the restaurant rather than getting it to go.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "I don't write a review, whether good or bad, very often and only do so when I feel it is warranted and I have actually something to say about certain stores, restaurants or repair shops and their service, food or quality of workmanship, for example, and not just for the sake of 'yelping' or blabbing about something that has nothing or very little to do with the place that's being reviewed. However, today is one of those days where I feel a review is in order. \n\nHad to take my mother to the doc's office this morning and afterwards we stopped at Avellino for a couple of slices. She's a pizza connoisseur and definitely knows a great NY-style pie when she sees it. Anyway, she had the veggie slice of the day, a mushroom/red onion and I had a plain cheese and a sausage slice. \n\nI have had my fair share of NY-style pizza here in the City and Avellino is hands down the best in SF. The crust was light, airy and had a nice crunch to it without being chewy. The slices were foldable and the tip had a flop to it that NYC slices are known for, which leads me to believe that the dough might have a bit of oil in it. The flavor of the crust was balanced, with a slight hint of salt. My guess is that it is a low-hydration dough, maybe around 59%-60% with no sugar. Well, at least I wasn't able to detect any sweetness in the crust whatsoever. I think it's just flour, water, salt, yeast and a touch of oil, maybe around 1% or so. And since they use whole milk mozzarella from Wisconsin, my bet is that it comes from the Grande Cheese Company.\n\nThe cheese/sauce ratio was perfectly balanced, with the sauce having a slightly sweet undertone, and the sausage had a nice fennel flavor without the fennel being overpowering. My mother was blown away. She just loved every bite of the slice and kept mumbling about what a perfect crust it is.\n\nI've been to Avellino three times now and they never disappoint. Much better than over-hyped and over-priced Amici's, Tony's or Arinell's. Service is always friendly and accommodating. The only other place that rivals Avellino is Marcello's on Castro Street.\n\nAvellino is always great and I'll be back for more when the pizza craving comes back in the future. Everything in moderation, though.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-18", "description": "A nice cosy place. The pizza was nice and yummy . New york style the kind I like.  I think it was a min of 10 bux for credit cards.\n\nOverall , love the pizzas. Will come here again.", "author": "Archie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "The pizza is delicious.  I just get annoyed because sometimes they accidentally leave their phone off the hook.  ANNOYING.  I want to order and pick up so I don't have to wait with my kids and the phone is off the hook.  I could not get through on Halloween and can't get through tonight.  LOVE THE PIZZA.  Just wish they'd pick up the phone!!!", "author": "Nettie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "If this place wasn't so far out of the way, it would be a lot more popular.  Solid pizza, NYC-style.  Do not come here if you're looking for healthy options.  Unlike most sf pizza joints, Avellino has cheese pizza at the ready, then they throw toppings on after you order.  \n\nTry their breakfast pizzas on the weekends!  They also have bottomless mimosas for only $5!  There's also a TV inside showing sports most times.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Crust is a little burnt and its a little too oily but my dad and I enjoy coming here for lunch every so often when we're in the area", "author": "Rodney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "The staff is very friendly. For $3.50/ slice I'm not complaining at all! Very large portions. I would recommend this place for a quick bite to eat.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "I've read that this place took on a former employee of Arinell Pizza in the Mission- that'd explain a lot, as the pizza here is very similar to what you'd find at Arinell. That is a good thing. Legit NY pizza with traditional toppings (no West Coast bastardizations like Pineapple, as far as I could tell.) \n\nLocated across the street from the Lombard entrance to the Presidio.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "I call Pizzeria Avellino all the time for delivery and It's always fast and fresh. The pies are really good too, maybe a little higher priced than I'd like to pay, but no where near the grilling I get if I go to some other joints. \n\nIt's a staple in my local delivery diet.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "My husband is from NY and he is pretty picky when it comes to pizza but he liked this place too!\n\nThey sell pizza by the slice too but we ordered a medium pie with just pepperonis. It took about 25 min for them to bake but it came out piping hot and the pizza was delicious, just like the ones you can pick up in one of those good&quick pizza places in NYC.\n\nThings we didn't like about this place were the size of the restaurant (Super tiny -Only 3 tables) and the parking situation (street parking/hard to find a park spot). Probably best to avoid the peak hours (dinner/lunch time).", "author": "Mai K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-09", "description": "Unimpressed.\n\nI like thin crust pizza, really, I do.  And the crust was good.  Unfortunately that was the only good thing about our dinner.  \n\nService is slow.  \n\nSalads seem to be made too far in advance, then stocked in the beverage fridge.  Our \"green salad\" lettuce was wet, over-chilled/frozen.  \n\nPizza toppings were generous in amount, but with insufficient cheese.  Even on the cheese pizza.  The \"slice of the day\" was sliced (canned) black olives & chopped grape tomaotes just sprinkled onto a pre-baked piece of cheese pizza with nothing on top to bind them on.  Odd.  \n\nAnd the pie options were unimaginative.", "author": "Laura K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Was in here today and it seemed like it's undergoing a change in decor. Possibly personnel also? Not sure if that's a good or bad thing, but this place is consistent if nothing else. I've bumped them up a star from my previous review.", "author": "aaron f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "Great little hideaway spot. The meatball subs are to die for!!!", "author": "Sandra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "This place is not only great, but easy on your wallets. The price range for a slice is around $3-4 and a combo for about $5. \n\nCan't beat that, right?\n \nThe taste may be a little bland at first, but sprinkle a little Parmesan cheese or garlic powder to give it that burst of flavor. Good customer service is hard to find, but you can surely find it here. They are so friendly and make you feel so welcomed that you want to come back again.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-19", "description": "Unremarkable and disappointing.\n\nI bought the Living Social deal ($15 for $30 credit) and thought I would give this place a whirl last night based on some of the very good reviews.\n\nPrice:  high\nService: slow\nQuality:  unremarkable, needs more cheese\nPortions:  good\n\nThe service was so poor that I had to bus the table clean in order for us to sit down.  There were about 3 other couples in the restaurant.  The pizza was very weak on cheese.  I think they needed to at least double the amount.  Yes, it is thin-crust, but the lack of cheese made the pizza taste way too doughy.  Plus, the plastic disposable water cups added that extra bit annoyance to make me not want to come back.\n\nI don't know what some of the reviewers of this place are thinking.  Cybelle's and Gaspare's are far better, plus it is on the pricey end, especially for the little you get.", "author": "Dan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "This 3.5 stars rating is bullshit!  If you like your pizza thin, with a crispy yet doughy crust, if you like your tomato sauce sweet and fresh and if you like your toppings amazing you might wanna go here.", "author": "Sebastian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-29", "description": "So it's 12:05 on a Sunday night and I just saw a pizza get delivered to my neighbor. I tried to order a pizza last night, Saturday, at 9:15pm, and you said you could not deliver at that time, I ordered from another vendor. How much business are you losing?", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-10", "description": "Very inexpensive. Especially for San Francisco. The pizza itself was decent, nothing amazing but nothing awful. Really it comes down to the money. You get alot for your money here and it's quite filling. The cashier wasn't the friendliest and was a bit slow at completing my order.", "author": "Bibiano L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-04", "description": "Okay, so I came to this place mainly because I was in the area, and had little money to spend. The prices of this place are decent, but still a bit high. The portions aren't too big at all (for a slice), BUT the pizza is AWESOME! The pepperoni is really weird because they are tiny little ones spread sporadically around the pizza, and one slice definitely WOULD NOT  fill you up. \n\nI love cheap and awesome pizza, but Pizzeria Avellino is not cheap, but it is awesome pizza. The area is pretty expensive in general, but should pizza ever be expensive?...I mean, it's pizza.\n\nPizzeria Avellino is delicious, but more like a $$ price rating. If you want to get your money's worth, get a whole pie.", "author": "Angelo C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-26", "description": "Hands down the \"worst\" pizza I have ever had.  Frozen Red Baron Pizza is 10x more better!!!\n\nSo a quaint like corner pizzeria.  But other than the decor it all goes downhill.\n\nThe staff are handicapped... (not really but act like it).  They cannot take an order if their lives depended on it.\n\nSo my order was very simple.  Wanted a combo pizza with no olives, red onions and peppers added.\n\nWhat I got was a pizza riddled with olives, no peppers, and probably the equivalent of 2 whole onions thrown on it.....\n\nI don't recommend \"anyone\" go to this place.  Even with a discount coupon...\n\nOk fawkin drunk as a skunk and smoked some kush.  This fawkin pizza is the shyitt!!!!", "author": "Rigs R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "I was on my way to the bank from work and wanted to get a bite to eat.  Liverpool Lil's was sounding good, but I didn't have the 30 minutes to wait for food.  Pizzeria Avellino was right up my alley,\n\nI walked down the long hallway of a restaurant and took a peek at the menu board.  \n\nI settled for a pepperoni pizza.  Oh and they sell 'em by the slice.  The \"cook\" pulled out an already prepped cheese slice and dealt pepperoni slices on top and tossed it in the oven.\n\nI plopped down $3.85 and realized...I still had money left to stop by Starbucks for an iced coffee.\n\nThanks Pizzeria Avellino for comin' to the neighborhood!  I'll be seeing you soon.", "author": "Rochelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "I'm currently yummin' down a XL cheese pizza with mushrooms. Yes ... I know what you might be thinking ... FATTY. Well, it's not just me, well ... maybe it is ... but can you blame me? Seriously this crispy, warm, savory pie is one to remember. I've had REALLLY good pizza. Pizza that won't make you \"orgasmica\" (they suck) but will make your toes curl. This pie is just short of that, but for 24$ what can you expect?\n\nI'd recommend a whole pie, the -by the slice- pieces seem to be less than desirable because of their \"not so fresh\" nature. \n\nI ordered take-out, the guys were cool enough to bring it out to me after I paid because I was double parked in an illegal zone. I love the \"I understand SF parking\" look I got from the guy who offered. \n\nOverall, 5 for 5, they could use a little more ambiance, and a little less 64 signs highlighting their daily special / pizza by the slice price / whatever deal they have going.\n\nFYI: They said 20 minutes, it was more like 32, so just show up a little later than they tell you for pickup. No worries, I got a few necessary phone calls in.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-13", "description": "There aren't too many places in San Francisco where you can get an honest thin crust New York style pizza. Pizzeria Avellino happens to be one of them, and it's sort of like my personal Arinell (http://www.yelp.com/biz/arinell-pizza-san-francisco#hrid:CfLFUNZvx7A2bhw0JOw11A) to the north. \n\nThey also do a mean deep dish Sicilian style, which is hard to find in the city as well, so respect to that. My recommendation is to order a whole pie or wait for some fresh slices, order a glass of pinot and enjoy. Even better, go at happy hour where they have some good deals going on. \n\nI'm not sure of the exact relation to Italy but Avellino is a town in Southern Italy, as research professes (http://en.wikipedia.org/wiki/Avellino).", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-20", "description": "My favorite San Francisco \"fast food\" is a slice of cheese pizza and coke in a can. Not the healthiest choice, but great when I've forgotten to eat lunch and am in the midst of a blood-sugar crash. Pizzeria Avellino is my current favorite go-to spot. The crust is thin with just the right crunchy crispiness without being hard. The sauce is really good and the cheese is nice and salty. The slices are pretty big, too. I get in and out of this place quickly, which helps because I'm constantly rushing during work hours. Pizza Avellino has ruined me from  being able to grab a quick slice anywhere else.", "author": "Robynne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "If you're familiar with Famous Joe's on Carmine at Bleecker, but stuck in San Francisco, give it a try out.\n\nPizzeria Avellino makes a great New York-style pizza pie, perfect thin crust -- best to stick to sausage, pepperoni, or straight up cheese.  Since it opened about 6 months ago, we've been regulars.  \n\nSome of the order-taking dudes may be a bit off, but the pie maker / manager / owner? is usually there keeping relative order and making some excellent pizza.  Among the best you can find NY-style in the city.\n\nBest certainly to consider a full pie, as a quick slice is bit steep.  If you can't eat the entire pie hot -- it's best served cold for breakfast the next day.  \n\nWe generally get it to go, with convenient parking / double-parking available -- but on a quiet weekend afternoon, it's not bad to sit and watch SportsCenter and listen to Pink Floyd or some 80s power rock.  Journey 'Don't Stop Believing' was playing the last time I visited -- that's worth a visit on its own, in my view.", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "No frills, but great slices. A great option in the neighborhood. Love the bell peppers and black olives.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-22", "description": "My wife and I walk our doggies over at the lawn across from the old Letterman/ New Lucas Arts building, and, seeing as I was born in NY (moved here when I was 3, folks are from Astoria and Flushing, and I lived on W47th and 9th for 5 years in the mid-80's) and my wife is from New York originally? We saw the sign and thought we'd see how their pies were. \nWow. And not in a good way.\n I'm not a kid anymore, I'm 49. I was a punk rocker, a bike messenger,sang in a band called 'Ik Nak Fu' and grew up here in SF, and am not some kind of bitter Republican tool who doesn't care for dippy, monosyllabic, downright stupid and rude service staff. Avellino could have the most wonderful goddamn pizza on the planet (and it's NOT very good-inconsistent, made w/ little attention to balance or integrity for establishing and maintaining standard, decent flavors/seasoning/quality ingredients-it's really sucks-like red painted dough addled cardboard) and I would never step foot in it again. I tell anyone who asks to avoid the place like the plague, and that it was one of the most awful restaurant experiences in my entire life. If there is a god in heaven, the fool who owns it and staffs it with the most staggeringly complete collection of cretins and outright, really trying to be world class assholes will lose enough customers and be forced to go out of business and shut the door forever, ASAP. I'm serious-the little pimple headed shithead who grudgingly sneered at us and somehow found the strength to tell us that there was no menu, only the sandwich boards, after which he went back to ignoring us, the phone, the other customers, and his job description, something that he was VERY adept at- acting like a little shitheaded bitch. I really felt like vaulting the counter and smashing his  teeth down his arrogant throat, his attitude was so poor and his disdain for us so obvious. Hands down the worst trained staff I have EVER seen or dealt with-I read the reviews saying how wonderful this truly awful shithole is for 'families and kids'? Apparently penned by people who lack a set of standards that most sane people possess? Because this restaurant is the most egregious example of ignoring the importance of hiring good staff and training them to represent your business to the public in a positive way I have ever experienced-and I worked in the Food Service industry for over 25 years. Truly astonishing, the level of rudeness and apathy towards those who pay their salaries and pay the rent for this train wreck. The owner is an utter and complete fool for allowing this type of behavior to be the public 'face' for his subpar establishment. Avoid it at all costs! Shamefully amateur customer 'service' at this embarrassment to the good name of hardworking, upfront and positive, high energy New Yorkers everywhere. These phony, posing puds behind the counter? They wouldn't last 5 minutes in Manhattan-no freakin way.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "On trip to San Francisco, we stopped by this pizza joint while visiting the Yoda Statue inside the Presido.  We ordered mushroom, pepperoni and sausage XL for 4 guys.  The slices were cut into big slices and it was just enough to fill us up.  The Pizza was had great thin crust and flavor.  The location is small with outdoor seating and no restrooms.  Definitely worth a stop if you are in the area.", "author": "Teddy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-28", "description": "It was a busy day, but seriously? Ordered a sandwich...my friend order the same sandwich after me...he got his. When i finally went up to ask about my food, they inform me they are out of ingredients!  Really...you could not have told me that when you realized you didn't have any more meatballs? Basicially, idiots are working there.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "Great pizza, cool little setting, quick delivery if close by. Bottomless mimosas for a good price.", "author": "Guiseppi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "Perfect spot to grab some delicious thin crust, New York style pizza. The slices are cut large just like in New York. The best part is the pizza is not oily and crust is crispy so you don't need to fold the pizza in half to eat it. A much healthier version of NY pizza.\n\nThere are only a couple of pizza options, including pizza of the day special. They make the pizza when you order it, so it comes right out of the oven! We tried the vegetarian and Lombard. There's only two pie sizes available: L and XL. For 6 people we finished off 2 XL. The Lombard pizza is really good. The vegetarian was mediocre.\n\nIt's a small and narrow place. Fortunately it wasn't crowded when we came and was able to secure a table for our group. It seems to be a local favorite spot for many. The staff are really nice and cool.\n\nA bonus is this is only 2 blocks away from the Palace of Fine Arts! It's perfect walking distance to go grab some food before a show.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "By far the best pizza I've had in sf yet and makes me feel like I'm back in manhattan thin and crispy crust....they get pizza", "author": "Alexander E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "Was minding my own biz heading to Liverpool Lils for lunch in Cow Hollow, when I passed by this lil' shop with the same yummy aroma of the pizza that I enjoyed as a kid in NYC in the '70s, wafting up to grab my attention.  A note on the door further confirmed my olfactory instincts when it read \"Pizza by the Slice\"!  I had to stop in.  After having now downed one slice of pepperoni and one of sausage, I can report that these guys nailed it.  All for the reasonable price of $3.70/slice ($3.20/slice for plain).  In speaking to the guy who appears to own the joint, he shared that he actually brought in a 30 year pizza making veteran from Manhattan who both made the pizzas for a while and taught the rest of his crew how to make the real thing.  The goal was excellently achieved.", "author": "P W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-01", "description": "Had another cheese slice, very mediocre. Even with lots of seasoning I couldn't finish it. The crust though is thin, crispy and not wet at all. But the cheese seems really low quality. Curious about the napolatena pies but otherwise I am done with this place. If you want NY style go to Arinell's on Valencia in the Mission. End of story.", "author": "casey c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "My daughter and I went to use a Living Social voucher.  We were very pleased with our experience.\n\nThe restaurant is pretty small and clearly a neighborhood favorite.  There were families with small kids, so it was noisy but not unpleasantly so.\n\nThe pizza is New York style thin crust, lightly sauced.  I tried to show my daughter how to roll a slice, but she refused.\n\nI had the Lombard Combo with pepperoni, sausage, mushrooms and olives.  It was really good, with a perfect balance of ingredients.  My daughter had a simple cheese pizza and loved it.\n\nI will gladly go there again if I am in the neighborhood at a mealtime, discount voucher or not.", "author": "Stuart C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-28", "description": "This is the best sf pizza has to offer. Amazing crust, generous amounts of cheese, great sauce. Big slices. \n\nMy advice. Buy a pie. Pig out on it and eat leftovers the next day. Its great reheated as well. \n\nYou will not have any pizza order regret if you go here.", "author": "Guy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "We have been using Avellinos ever since it opened a few years ago.  We live right nearby and usually just pick up an XL pizza, or sometimes bring the whole family in and eat there.  The pizza is always delicious.  Great crust, great sauce.  \n\nThey are very reliable with our orders and eating there is always a pleasant experience.", "author": "K S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "After nearly four years of dealing with the frustration getting unbelieveably bad pizza in the Oakland area from pizzerias purporting to sell \"New York Pizza\", I was amazed, delighted, and overjoyed to finally find the real deal at Avellino's.\n\nThis is some of the best pizza I have ever had, in NY or elsewhere, and it is the totally authentic, thin, crispy, crusted pizza that I grew up with in Brooklyn.\n\nBest of all, it's walking distance from my office ... Now, to see if they do an eggplant parmigiana!", "author": "Doug L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-30", "description": "Used to like it but the last few times it tasted no better than cardboard!", "author": "Nipul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "I grab a couple of slice-o-the-day's here once or twice a month and they have always been perfectly prepared. Crust is perfect thick/thinness (for me) and the sauce has got that something that most places are lacking. It is really all about the sauce and the crust when it comes to satisfying my pizza craving. I like that they have a nice happy hour deal and the TV always has a game on or ESPN. It's close to work and a nice break from the \"regular\" places on Chestnut. The pepperoni and bacon is a great duo as well as the meatball and whatever. Slices are huge and the one time I bought a large, I had to fend off people on BART trying to stand close to me just to smell the goodness. \nFinally a quality place to eat at that perfect corner location. Sorry LiverpoolLil, but a $13 Burger just can't compete with a slice and a beer for $7or $8. Hope they have continued success!", "author": "Randy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "Yelp app to the rescue! My girlfriend and I were ravenous after spending a few hours at the Renegade Craft Fair. I whipped out my phone, checked my bookmarks on my Yelp app and we were on our way to Pizzeria Avellino. \n\nI went for two generous sized pizza of the day slices. The meaty version and a veggie option with peppers, jalapenos and olives. While the toppings weren't anything super special, I thought the crust was flavorful and crispy and it really made the entire pizza eating experience for me.\n\nThis is a real pizza joint, complete with a loud football game on TV.", "author": "Lee H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-31", "description": "This is a great venue, great location and this city is in dire need of amazing pizza. I just have to remind myself I am not in NY...\n\nThe owner and staff were super friendly and hospitable.\n\nA few things that can be improved:\n\n1. The cheese overpowers the pizza, I did not taste the tomato sauce pop through as you should in a NY slice.\n\n2. Uniformity in \"slice\" construction could be improved. There were thick and thin places in the dough which causes the slice to fall apart while you are eating it. \n\n3. The taste of the dough was very bland. In my opinion the dough is the canvas and should hold up to all ingredients that are put on the pizza. Needs a bit more flavor.\n\nHoping to be pleasantly surprised on my next visit...", "author": "Petra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "It was like eating a pretzel with pizza topping. The sauce is very light. The crust tho....WOW! It is thin, crispy, soft, not chewy at all. For how thin it is I was surprised how well a big slice for $3.95(btw) held a stiff but soft form.", "author": "kristina T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-17", "description": "Never going back to this place again. EVER.\n\nok people the Pizza isn't that special, go try it for yourself and compare it to Amici's or your favorite Pizzeria.  \n\nWITHOUT going into details, i'm just going to relate my experience to this Seinfeld episode \"\"The Soup Nazi \"\"...\"NO SOUP FOR YOU!!\" NOW GET OUT.  This sums it up.  Obviously, the owners that work here, (yes for those who did not know, the owners actually work here, no one at Avellino will tell that because they're all related to one another, and don't want to deal with the a concerned or mistreated customer.  Anyhow, they do not appreciate the fact that we (the customers) coming into this place and giving them business by choosing to eat here instead of going to any of their 100s of competitors across town.  They won't know what a customer's worth until they start loosing tens or hundreds of them... \n\nGood luck going there because you will be humiliated, embarrassed and yelled at even when you're not alone and with a bunch of colleagues from work.\n\nBTW:  Have i mentioned that, nothing special about the pizza here. Actually Amici's pizza tops Avellino and waaayy better.", "author": "Enga G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Being a New Yorker on vacation, I'm always wary of pizzerias that advertise \"New York Style.\" But I was hungry, and the reviews seemed great.  It was absolutely amazing. The slices were big and thin like what I'm used to on Long Island, the cheese was gooey, and best of all, the pizza was greasy. Obviously, pizza is better in New York; but this is by far the best pizza I've ever had outside of the Big Apple.", "author": "TJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-11", "description": "All round good pie; the guys that work there are super nice too.", "author": "Drew V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-27", "description": "They really hit it on the crust: truly delicious!\nBut the toppings are so, so, cheap it's a shame to put so little on a pizza... although at least you can really taste the crust!!!", "author": "Elle H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-22", "description": "I ate a few slices here tonight with \"Must Love Pork\" who also wrote a review.  #1, I am from Brooklyn where the world's best Pizza exists.  #2, I've never sat an establishment and been so amazed at the actions of the staff as I did tonight, so much so that we didn't say a word to each other, no words needed to be spoken.  If you've read the book \"Blink\" by Malcolm Gladwell, you'll know what I mean when I say the moment I walked in within a split second I felt something was wrong.  It was instinctual.  Something didn't feel right, I felt totally unwelcome.  The negative energy from the guy behind the counter was so bad, I had to ask the pizza maker guy if they were still serving pizza, and he said yes.  The pizza maker guy was the 'nice guy' relatively speaking.  The guy who took our order, the punk wearing the beanie, rang me up and seemed liked I was totally inconveniencing him.  But it gets better...\n\nI ALWAYS tip no matter where I go, 10% minimum if the person simply serves me food.  After he ran me up, I had $1.50 of change in my hand, and promptly put it in my pocket.  I reiterate what 'Must Love Pork' wrote.  This same kid was throwing the trays and plates in the back area, totally pissed at the customers who were sitting in there eating.  He was sweeping the floors aggressively near my feet to send me a message.  Then he stood over the restaurant with arms crossed, facing the two tables left, with a scowl on his face, waiting for us to leave.  Holy sh*t, I couldn't believe what I was watching.  Being from NYC I was inclined to confront this child, but it was better to leave him to continue his tantrum.  As I walked out past him, I still expected someone had taught this guy the standard \"Thank you\", but got nothing, not a word.  As I was reeling in even this last omission, I got a big \"Wham\" as the door slammed behind me.  Unbelievable.  I actually laughed it was so astonishing.\n\nI feel better that I didn't say anything, because I know it was purely horrible customer service on his end, I didn't instigate anything, was a display of poor management of employees, despite decent pizza.  I would fire this guy so fast and not think about reprimanding him because it isn't worth the time.  That's an inherent understanding of customer service that he can't be taught.  Send him to a skate board shop to work the back room.\n\nBack to Amici's, or anywhere else!", "author": "Charles G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "We got delivery of Avellino last night and it was quite good.  I like thin crust pizza but may have to try the Sicilian style sometime.  A plus is that it's much cheaper than Amici's.", "author": "Denise G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-24", "description": "Terrible cardboard crust, fresh toppings, and meh cheese.  Not really any great flavors or taste.  Price is not too bad at 3.50/ slice.\n\nNice guys that work there, good music, nice atmosphere.  Just prepared to not be wow'ed by the actually pizza.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Love the pizza here! Reminds me of pizza place back in Boston!  I wish they delivered to SOMA", "author": "Tommy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-23", "description": "\"I SAY GOD DAMN GOD DAMN!\"\n\nMY favorite line in Pulp Fiction when Mia Wallace is doing a line of blow in the bathroom. \n\nPizzeria Avellino is the first true slice of New York Pizza (sorry Arnelle Lovers, this place is better) I have ever had in San Francisco. Thin, tangy and the cheese was perfect. \n\nMark my words this place is going to blowup big. Get there now, get there fast. \n\nSmall, quaint and delicious. Great place for a chill date.\n\nMet the owner, the man is a true pizza lover and it shows. \n\nMy only complaint:\n\nLike another reviewer pointed out, I also think that in a green city like San Fracisco, you gotta go with real plates, silver ware and napkins. Get rid of the paper plates. I know, they don't do it like that in NY, but you are in one of the greenest most progressive cities in the world.", "author": "D M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "Great pizza and specials, plus awesome location right outside the Presidio park. Good service from the guys working there and cool atmosphere overall.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "Today was my first time eating here. The fam and I hung out in the Presidio for quality lazy Sunday time, but we needed quick lunch without having to walk deep into the Marina for it. \n\nCome Pizzeria Avellino. My first impression was this place was pricey; a cheese slice + soda for $4?? I've seen them for $2 in other places. Hubby pointed out we were in such neighborhood. \n\nWell, we ordered a medium Lombard combo. At $17, this was a pleaser! Truly a medium sized pizza, this was worth every bite. Compared to Extreme Pizza, whose large is pretty much a medium to me, this was priced fairly.  Between 2 adults and a toddler, we had plenty to eat. Our second child is just a baby so she didn't have any, but she was happy with her milk. \n\nI can't give this place 5 stars only because there weren't that many options and they don't offer drinks by the pitcher. We recently had pizza at Dino's on Fillmore and I was spoiled by the pitchered drink to drown my pizza down. Avellino's, if you could even just offer a pitchered drink, I'd upgrade this review to 4.5 stars. \n\nOverall, a great pizza for reasonable price! We'll come back again.", "author": "Anio D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "This weekend was my second trip to Pizzeria Avellino, the first time just stopped in to grab a beer ever since I had been waiting to go back and try a slice. Amazing is the only word. I got a slice of sausage, the crust was thin and crispy, the sausage was spicy.....perfection. This pizza is only second to Mack & Mancos at the Jersey Shore in my opinion.", "author": "Heathet B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "I'm originally from the east coast and have had my fair share of slices. This is by far the best pizza I've had since I've moved to the city.\n\nI've ordered from Pizzeria Avellino a couple of times now and it's always been a wonderful experience.  Their delivery is super fast and they put Parmesan and peppers in the box.  \n\nThe staff is awesome!  It was a great place to take my family. When I stopped by after a day out in the Presidio, my daughter was pretty fussy and hungry. The employee who took our order provided my daughter with a coloring book and crayons and turned the TV to cartoons to calm her down. Awesome!\n\nThe pizza is fan-tastic! Always fresh and tasty, they have a great thin crust. The toppings are generous and delicious. I love the Lombard pizza. It's a family favorite.  They also serve coffee in the morning, so I'm gonna stop by for a cappuccino after my run.\n\nOverall, tasty affordable pizza and friendly staff. I will be there again soon!", "author": "Tiffany J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "What an awesome pizza place!  I usually am not a huge fan of pizza, unless it's some fancy deep dish Zachary's or super Berkeley Cheeseboard, but wow, I was super impressed.\n\nIt was a somewhat dry night on Friday, and me and my friends needed some food near Palace of Fine Arts Theater.  We had a few choices, but went for Pizzeria Avellino.  What a perfect choice!\n\nThe service was very nice, the people there were very warm and polite.  There were two families there eating, and a long bar with stools, but not at all crowded on a Friday night.\n\nWe were able to get a table of six people, and our pizza was just fantastic.  Not oily, and didn't just crumble.  The crust was firm enough to hold up and did not need the half fold to eat.\n\nI really liked the sauce and toppings.  I'm a huge fan!  I'm going there again!!  The best NY Pizzas I've had in SF so far!", "author": "Art C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-19", "description": "Okay place, pizza and one beer for $7 damn good but you get what you paid for.  I had pizza that was not cook all the way so I had to send it back but they fix it right.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "Finally!  A yummy and affordable restaurant at this location.  And the pizza is delicious.  I love the hot, crispy, cheesyness that Avellino delivers. I've lived in the Presidio for 6 years now and the previous incarnations at this location have been soooooo blah.  \n\nI especially love the sauce. It's not as heavy as other restaurants, a little tangy, light, just plain delicious.  Not only is it affordable, not heinously expensive, but it's freaking good for thin crust pizza.  I would give it 5 stars, but since I've never had true NY style pizza, I can't make that assessment.  (*hangs head in shame*)\n\nThank you Avellino for moving in!! We Marin-ites neeeded you.", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-22", "description": "Best pizza in the city behind little star, IMO. Great staff, too.", "author": "Dev S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "This is a solid local pizza place with New York style slices and pies. Yum!", "author": "Kate R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "Their pizza is okay if you're stuck in the Presidio.  It's quite authentic as far as cheap New York-style pizza goes, but that's not really a good thing in my book.  They're cheap and friendly and so on but frankly I think their stuff is kind of bland.  Not worth going out of your way for.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-18", "description": "I first stumbled onto Pizzeria Avellino on their Opening Week, crowded and the pizza was awesome. You know how sometimes new places open with great food, then later it sucks, I happened to be in the Marina last weekend and decideed to try it again, to see if it kept up with the quality................Oh Yeah, you can get no better anywhere in the City (My Opinion ;)). The pizza was thin, crispy like no other, the sauce and toppings doesn't overwhelm the best pizza crust around. Add a beer and you're good.\n\nI was fooled I was eating \"pizza\"  from all these other pizza places (thick undercooked dought for crust, thick sauce to mask the crust) all these years.\n\nNo more, there is now real pizza in the City, and it's here at Pizzeria Avellino. I live in Glen Park and there is no hesitation going across town to the best pizza.\n\nAll I've got to say.................\"Try Some Real Pizza!\"", "author": "Francisco M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "This is place is legit New York style pizza! I hear they got their pizza maker from Arinel at 16th and Valencia in the Mission, and if you live in SF you know that's legit NY style as well.  My slice was hot and fast, easy place for lunch.  The employees have always been friendly with me; I've probably been in 4 or 5 times in the past few months cause its next door to my work. Never had any of the issues some other yelpers have had with service. Crust is right on and some of the different combo are money.  bacon garlic is awesome.  the (sliced) meatballs are good too.  I'd start with a classic cheese slice for my first time and move on from there.", "author": "John D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-15", "description": "Another mediocre pizza that makes me wonder why I even bother to try pizza in SF anymore.  After waiting the obligatory hour for delivery I was rewarded with a pie that would have tasted a lot better if they had taken it out of the oven earlier.  The pizza was greasy and the crust dry and hard like a breadstick.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "Avellino, it shows great promise, it does!\n\nIs it NY-style pizza?  Absolutely.  You grab the sail-sized slice off of the paper plate, fold in half, watch the oil drip down the crease, and have all the sights and sounds of Bleecker Street come flooding back into your mind.  \n\nIs it really good NY-style pizza?  Meh.  The crust is fine, but it misses that magical balance of crunch and chew that would make me want to transfer 2 trains and then stand on line (only California hippies stand *in* line) for 15 minutes.  If they reduce the thickness a smidgen and tone down the crunch, I think they've got a pie that would make a New Yorker wicked proud.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-01", "description": "Tried this place out for the first time today to fulfill my extreme hunger resulting from a terrible hangover (thanks halloween!).  I ordered a 'Greco' for pickup.  They were out of pine nuts, so I just got it minus that garnish.  Pizza was on time, but a couple of pieces got squashed in the box that was too small for the pizza.\n\nI liked my pizza.  The crust had a great texture, but a little flavorless.  I think most of the sauce on the pizza was pesto, but there was some red sauce.  The red sauce was way too sweet - they need to add some salt to their marinara!\n\nPizzetta kicks this places ass, but I would definitely consider getting pizza from here again since I live close by.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-17", "description": "Eh. It seems like it's going to be an awesome little hole in the wall, but it's nothing special.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "I lived near NYC for almost 2 years, and fell in love with NY-style pizza.  Grabbed two slices of the daily special (meatlovers) to go. Nice big slices, good authentic crust. Sauce is less than I expected, but the fat slices, crust quality, and liberal toppings density was good.\n\nI shall be back. Welcome, Avellino, to the neighborhood.", "author": "Neil H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-25", "description": "I ordered a new york style pizza to go tonight, for me and my husband, who's coming down with a cold.\n\nIt was, in a word, delightful.  The crust is thin and a little crunchy, not chewy and gross (my pet peeve).  By crust, I'm referring not just to the part on the outside, but the part under the toppings as well.  It was great.  Also, I thought the sauce was just right, the cheese wasn't too greasy, etc, etc.  Why analyze too much? I don't know why it was so good, it just was.\n\nIncidentally, the pizza was huge- a new york style pizza is probably eight of those huge slices, and will feed four hungry people.  Not bad for 20 bucks. \n\nI have a  feeling that the napolitana style will also be fantastic; a whole different culinary experience.  \n\nI'm really psyched this place exists.  It's definitely worth a try!", "author": "Melinda A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-12", "description": "I have to disagree with the NY-ers on this page who said this is legit NY pizza. I totally disagree. The sauce was not sweet, like east coast pizza. i grew up in the EC & know my pizza. This does not compare. Dry crust, un-sweet sauce does not = NY pizza. I am convinced there is no NY pizza in NYC and just have come to grips with it. I get my fill when I am home on the east coast.", "author": "Heather M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-11", "description": "I had a great two slices at avellino the other day while waiting for my friend to get out of work. Everyone there was really nice and i could sit outside at there benches and eat a slice in nice weather.  The Pizza was definitly comparable to east coast pizza as I could find in the city and I will definitly return. I give it 4.5 stars because Im really picky about the pizza I eat. \n\nI just wanted to comment on a previous yelpers remarks and so I sent him a message. Message is below. \n\nThanks Avellino for some good grub. \n\nMr. G.\n\nI just wanted to comment on your remarks about Avellinos. Your obviously a competitor of this place and your attempts to belittle them are quite lame and pathetic. \n\nBusiness is business I know, but i went to Avellinos the other day and was very impressed by both the pizza and the staff. \n\nCongratulations, your another hoighty doighty loser who has spent time in Italy. Were all very impressed. What you dont know is that like every other place in the world, every town has different styles within themselves. If every place in Avellino is the same, I would rather not visit. \n\nWhy dont you just run your own business whatever it may be and let these people make the pizza they have set out to make. ITs damn good to me and I havnt had much good pizza out here yet. ..Including Pizaa Delfino. \n\nOn a side note: Your picture is Awesome...ha ha", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-28", "description": "My first trip to Pizzeria Avellino was during its first week of opening. They had tasty gourmet pizzas and great Italian thin crust but after a few weeks they decided to cater to a simpler pallet. I am glad they are still in biz and I enjoy the place for the convenient location and nice staff.", "author": "Chelsea M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-17", "description": "we used our freshguide coupon here. it was $10 for $20 worth of food and drinks. pretty good deal. i had a couple slices of the sicilian(cheese). not nearly as good as golden boy, but a solid pizza. there was a lot of cheese but the sauce wasn't the most flavorful. $3.50 is a decent price and the bridge of my mouth thanks them for serving it up at the perfect temperature.\n\ni didn't try the ny thin slice, but it didn't look that good. i think the sicilian is probably wayyy better here. happy hour meant $2 beers, which is awesome. so for the $10, we got 3 slices and 4 beers. i can't complain too much :)", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-17", "description": "Very good for just a plain cheese slice. Anything else I've had there I've not been impressed with. Especially their deep dish - not good at all. Definately not my first choice when going out for pizza.", "author": "Charlotte P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "This town is starving for good East Coast pizza. We have lived here for 6 months and finally have found our place. Thin, light and tasty, if you like that this is your place. Be sure to fold when you eat.", "author": "Brett J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "The Pizzeria is amazing. Loved the pizza sauce, a taste of heaven.\nMaking this place a solid number one choice for future pizza lunch and dinners meals.", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-01", "description": "Really good pizza.  Great service.  Neat ambiance.  And they'll have beer & wine in just a few weeks.  What more could you ask for?  We spent time talking with one of the owners (Steve) and he told us he and his business partner had dreamed of starting their own pizza place for years and they were so pumped to finally do it.  They're working day jobs and manning the fort by night.  It's hard not to get fired up by passionate entrepreneurs, good prices, and a really good product.\n\nWe'll definitely be back!", "author": "Collin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "If it is a nice day in San Francisco there isn't a better place to grab a breakfast pizza, bottomless mimosas, and sit right outside the Presidio.  I frequent this place probably a little too much.", "author": "Glenn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "Thank you FRESH GUIDE coupons for introducing me to Pizzeria Avellino! Great NYC style pizza. I am always up for a deal and bought the Fresh Guide deal- you know the $10 for $20 worth of pizza type of deal. LOVE IT! Great place and very friendly! We ordered pizza for take out and OMG amazing. Well I was moving apartments so my mover boys I recruited to help before my actual movers came really enjoyed the pizza- I know we were starving and anything would taste good- but Pizza Avellino really is good!", "author": "Kimberly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-20", "description": "Every New Yorker knows the pizza in SF is terrible. Most of our neighbors don't even know what they are missing.  I have grumbled about it for years.  \nThank goodness for Pizzeria Avellino.  They serve delicious New York style thin crust pizza that you can fold and eat.  At last!  If I close my eyes I almost think I'm having a slice \"in the city that never sleeps\".  Brava!", "author": "A. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "A cool little place tucked into the end of Lombard street.  It's $3.00 for cheese slice which is big and thin, crispy crust and good ration of sauce to cheese (Like more cheese than sauce).  A long thin building with plenty of room to sit and eat in.  Beer and wine.  I snagged the window seat and had a great time.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-04", "description": "I used to work near this pizza place, and I thought it was just ok. Nothing really special about it. Its cool that they sell slices of pizza and they are pretty cheap - so for quick, cheap, ok pizza it was fine. But it wasnt great or nearly as good as any pizza I've had ...and nothing compared to the pizza I had in NYC. Plus if you order anything other than cheese they will just throw on toppings and toss it in the oven to \"warm it up\" when you order a slice..not exactly the best quality", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-13", "description": "I really did want to like this place but it was a no go. It was bland and boring. If you go to Trader Joe's and get their pizza dough I promise you can fix something up at home in 10 minutes that tastes better.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-03", "description": "My hubby is part Italian and from the NY area.  He has always loved a good thin crust pizza; definitely not a fan of deep dish.  I'm not Italian and have only visited the NY area.  I've always loved a tasty pizza; however, I've always leaned towards the thin crust side over the doughy deep dish style pizza.  We're a match made in pizza heaven.  \n\nI was craving pizza one day after watching a television show where the characters were macking on some slices. The hubby and I are always looking for some good NY style pizza so I turned to fellow Yelpers to help us out.  Pizza Avellino popped up first and we scurried on the bus in hopes of filling our tummies with deliciousness.\n\n* Space:  Although there are less than a dozen tables inside, the place is quaint and definitely good for eating a few slices.  Also, there's a TV over the door that can keep you preoccupied while waiting for your food if you're alone or the company you came with isn't entertaining enough.\n* Atmosphere:  The place smells of deliciousness and gives off a homely vibe.  You walk in and immediately can see them making the pies and salads in the back.  \n* Drink: You can get canned or bottled sodas and wine or beer.  Although the wine list isn't extensive, it's a refined list for the size the place.  \n* Eat:  We got a simple medium pepperoni pie.  It was served up piping hot from the oven and had the right ratio of cheese:sauce and a great crispy crust. The pepperoni's were nickel sized (not a big deal, although I like the bigger slices) and there were a good amount on each slice.\n* Service:  The guys greeted us in a friendly manner immediately upon stepping into the place.  They offered suggestions, told us how long it would take for our pie to come out, brought the tableware and pie when it was fresh out of the oven.  \n\nOverall:  I'd say it's well worth your money to get a pie over a slice or two (even if you have to take some home).  Although it was out of the way for us, the ride over was definitely nice on a clear day through the Presidio.  I would definitely make the trek again to try some of their other pies.", "author": "melinda m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-24", "description": "On the verge between unremarkable and meh. The service is fine, and the decor is average and all that, but the pizza is mediocre and overpriced. If it were cheaper, I'd be able to overlook the blandness, and if it were tastier, the price might be acceptable. As it is 4 bucks/slice is a lot. They get a star for convenience, in that they're one of the few places that's convenient and quick for lunch if you work in the presidio (one of the few places for lunch period, really). But yeah. I certainly wouldn't come here if I didn't have to, there are far better pizza places around the city (arinell's on valencia is my personal favorite)", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-27", "description": "well, the name and the positive Yelp's reviews tricked me. I thought this place was managed by Italians but it's not and you can simply understand that by ordering their expensive, bland, flavorless pizza. My husband ordered the whole sausage pie and I ordered a slice of cheese. The owner didn't mention that was way too much pizza for too and charged my husband 2$ for the onions (extra topping). So my husband ended up paying 19$ for 8 slices of pizza...bland flavorless pizza. The only good point is the crust, well cooked and crispy. No flavor nor salt in the tomato sauce and no flavor in the cheese. Won't go back. This place is too expansive and lack of flavors overall !", "author": "Biemme B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-29", "description": "I just tried their new breakfast pizza they started making on the weekends. AWESOME, AWESOME, AWESOME!!!  Eggs, cheese, bacon, sausage, hashbrowns, perfectly cooked crust, I mean thin, crispy but not overcooked. As I understand, they are now doing brunch from 10am to ? on Saturday and Sunday with bottomless mimosa's priced at 5 bucks! I've had their regular New York style pizza and I'd have to say that the B-fast pizza is definately my fave!!!", "author": "Raymond A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-26", "description": "Hi folks,\nI am compelled to update this review. As of late, it seems that ALL of the pizza coming from Avellino is reheated, which is UNCOOL.\n\nA couple of days ago, my neighbor and I ordered a medium pizza. As I mentioned in my original review, pizza by the slice was already cooked and reheated, but ordering a whole pizza guaranteed a fresh pie. This is no longer the case. Our medium pizza was obviously a pizza that had been cooked as a cheese pizza, and then reheated with our desired toppings. It was very evident by the fact that my \"extra cheese\" was a completely different color and state of melt than the original cheese.  In addition, there were also strange bits of sausage, as if cooked sausage had been removed at some point. Again, UNCOOL.\n\nWe brought the pizza back to the store (we discovered this atrocity after we walked home with it). When we confronted the workers, they were saying one thing, then contradicting themselves, about how all of the pizza is half baked, and then toppings are added halfway through the cooking. Of course, this makes no sense -- would you add only cheese, and then add \"extra cheese\" and toppings halfway through the cook cycle? Preposterous. All of the NYC pizzerias I know will cook a pizza, with your desired toppings, from beginning to end when you order an entire pie. We could only surmise that Avellino bakes a lot of cheese pizzas in advance, and then reheats them, which is abominable. Tolerable for slices, but not OK for full pies. This was confirmed by the rack of cooked and now cold pizzas we saw in a rack next to the preparation area. We ordered a pizza at 7pm -- are they cooking these pizzas at 3pm and letting them sit for hours? WTF?\n\nThey agreed to make us a new pizza. When the new pizza came out, it looked exactly the same as the first one (minus the sausage bits). Very disappointing. And it tasted just like it looked -- superficially hot crust, but not hot, melted cheese stretching everywhere, like one would expect from a fresh pizza. Again, a formerly cheese pizza that they had added toppings to and reheated. Shameful!\n\nIn light of this, I am on a pizza boycott from this establishment. They were my favorite place and now I won't even set foot in there. It's a real shame, as I live very close by and was so excited when they opened up, and told all of my friends to come to the Marina for pizza. Now, I feel a responsibility to tell them to take their business elsewhere.\n\nThis is, indeed, a very sad day.\n\nPS - they are also charging $2.75 for a 16oz of coke -- the liquor store next door sells the same for $1.75.", "author": "rachel s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-25", "description": "They changed their menu, and got rid of the proscuitto, 4 cheese, and greco.  All they have in NY style pizza now.  \n\nThis place was awesome when it had the rustic pizzas.  \n\nNow it is just well, avoidable.", "author": "Lexi V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-03", "description": "I was so hopeful....but:\n\nBLAND.  Boring, no flavor.  I have better frozen pizza than this.  Extremely disappointing.  If you've got no other choice, it's edible, but you won't be wowed.", "author": "A H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "I'm not really a pizza lover but since my boss told me to order it for the office for Halloween, I did.  We ordered the regular cheese & sicilian pizza. The sicilian pizza was so good, very cheesy all around and it just melted it in your mouth. I will definitely go back again =)", "author": "Yoshi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "There slices are GREAT.  Thin crust, perfectly done, $3.  The decor is really cute and they play awesome music.  Definitely my new go-to for pizza in the marina.", "author": "Allison C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-18", "description": "I'm from NJ... as close to east coast pizza as you're going to find out here. It's good enough to fill my craving without having to fly back east haha", "author": "Jared A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "Quality, VERY good pizza.  We had the NY-style cheese and the Neapolitan-style greek pizza.  Both were excellent.  \n\nMy only recommendation to the owners would be to use real plates/silverware and consider putting some salads on the menu.\n\nGlad to have you in the neighborhood!", "author": "Emilie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-22", "description": "WOW- Just got back from eating a slice at this place. Walked in at 8:45pm (15 minutes before they closed), and the guy working was CLEARLY not happy that we were there. He was in the middle of his closing duties and while we waited for our pizza, he wanted everyone to know that he had somewhere else to be. Dishes were tossed into the bins carelessly and  it was so loud, I actually couldn't carry on a conversation with my fiance. We sat there quietly and cringed every time dishes and pizza pans slammed against each other. He actually threw his side towel across the room into the cashier station, obviously mad that we walked in right before closing. The icing on the cake was when he stood near our table, WITH HIS ARMS CROSSED and waited until we were so uncomfortable, we had no other choice but to grab our sodas and leave. I walked out pissed off, ahead of my fiance and as we walked out of the door (no \"good-bye, or \"thanks\") HE SLAMMED THE DOOR ON US!!!! Seriously?!?! In this city, where there are a BILLION other places to eat pizza???? We usually go to Amici's but decided to try a new place after a game of bowling in the Presidio. My advice: Go to Amici's, Pizza Orgasmica, Extreme Pizza...Taco Bell...WHEREVER...but DO NOT bother with this place. Even though Taco Bell chicken has more hormones then my birth control pill, I'd be willing to risk the hormonal fluctuation then to actually pay money for someone to piss me off. I work in the food industry and have never encountered such an angry, disrespectful cashier/server. The only time I have experienced such poor customer service in San Francisco is at the DMV.  I wanted to give this place a chance but sadly, not only was I disappointed but I was actually offended. Good luck with your business model, Pizzeria Avellino.", "author": "Must Love P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-07", "description": "Craving pizza on a Sunday afternoon, was heading to Pizzeria Delfina but came here on a whim simply because well, I hadn't been here before.  Plus the reviews on yelp had a lot of five stars.  They've only been open 3 weeks.  They sell pizza by the slice.  Had a mushroom slice ($3.50, I think). Seemed decent.  A good snack, esp. if you find yourself right by the presidio gates.  The tomato sauce could have used a bit more spice/salt--it was a bit bland.  I like escape from NY pizza better, which is slightly thinner crust than this place.  This is a good for a quick, fast bite.", "author": "Caroline I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-03", "description": "Some of the best pizza I've had in SF. Different from its peers, in a good way. Crust is the right combination of crunchy yet doughy. Red sauce is perfect for my taste: a tad bit sweet but tangy, too. Have only actually dined in-house once; we primarily do take-out instead. I'm very glad they've joined the neighborhood!", "author": "Tilden K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-11", "description": "Bought a pizza here and it was so awful that we couldn't even finish it, and I am pretty easy to satisfy with pizza.   There was barely anything on top of the crust, be it sauce, cheese or the supposed four extra $2/each toppings that we paid for.   The slices were very large, and only had about 3 olives, 2 mushrooms, 2 pieces of sausage each.  Couldn't even taste the 4th extra item (garlic).   Skimpy and tasteless.    You're better off buying a frozen pizza at the supermarket.   Go to Toto's, Mr. Pizza Man, North Beach (or anywhere) for better pizza.", "author": "Amhelia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-05", "description": "Awesome pizza!  I stopped by only a few days after the place opened and was surprised at how \"seasoned\" the pizza was.  Great balance of flavor...sauce was mellow with just enough zing, toppings were tasty and well proportioned.  Makes my mouth water as I write this review.  I will be back next chance I get.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-16", "description": "Been meaning to try this place forever and just got around to it this weekend.  Best pizza I've had in SF in a long time that doesn't fall into the fancy pizza category (gialina, A16, delfina, etc).  If you want a really good, super fresh tasting, straight up pizza this is about as good as it gets.", "author": "Eamonn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-30", "description": "Growing up in NYC, I have tasted some of the best pizza. \n\nMoved out here to SF 14 yrs ago  and yes there is some awesome cuisine out here, the pizza sucks!! \n\nThat is till now. This place is the real deal. The sauce, the crust, the feel!! AMAZING!!! \n\nIf you do not find this place amazing, you do not know what pizza is.", "author": "Cow H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "3.5 stars for taste, but upped to 4 because i used my living social coupon and it was such a good deal! one M with red onions, garlic, mushroom and tomato and one XL meat lover for less than $35. five of us ate to gluttony stuffedness and took home a few slices for the next day. cold pizza for breakfast, what could be better?! well, winning the lottery, but not that much else.", "author": "Suana W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-05", "description": "Pure and simple, one of the best slices of NY-style pizza in our fair city.  Sure you can get excellent CA-style personal pizzas at a dozen places, but NY-style?  By the big-a$$ slice?  This is one of maybe only three places I have found that bring me back to NYC and Jersey.", "author": "Sweet B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-23", "description": "Bought the Living Social deal and ordered cheese pizza. No, this is not authentic NYC pizza. I actually kind of feel bad for the people who think it is. The pizza was overcooked - black in spots on the crust which was way too thin and the cheese was scare, and because of it being overcooked the cheese was \"welded\" on -- best way I can describe it. It was like the Domino's Extra Thin Crust, really. It was dry. I wanted the drip, drip, drip of the oil coming off some gooey melted cheese. A fluffy, doughy crust that tears off easily. The sauce had a pretty good flavor so it gets a couple stars for that.", "author": "PudgesGirl P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-16", "description": "Great pizza. I've lived in ny d this is the real deal. You could take a date, or If your solo, fold it and crush it. Either way, check it out.", "author": "mark l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "Good place to get take-out... almost a hole in the wall place (it's narrow but cheery inside), friendly people behind the counter.  I wouldn't travel across the city for it or anything but since I walk by this place a lot, I have been in for a thin crust cheese slice and it's not bad.  This week, I had a Sicilian slice which is a thicker crust pizza (sold by the slice only, I think) and I liked it better than their thin crust pizza.  It was crisp and had a ton of cheese.   I can't point out anything unique-- it's plain jane pizza, but at the same time, there isn't much to complain about.", "author": "Kari L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-05", "description": "As a native New Yorker, I have searched for the best slice in SF for 12+ years.  I'd say I've finally found it.  In addition, the rumor that SF water won't produce NY pizza crust was debunked by the pizza-maker himself (and, of course, his pizza).  \n\nThe space itself is simple, small and clean.  They also deliver.\n\nSpread the word!", "author": "Kingman G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-26", "description": "For a straight out-of-the-box pizza Avellino is the best! I like both the thin crust and siciian. The dough has a nice rounded taste (pun intended!) and the guys in the back are fun to hang out with while you wait. Viva Avellino!", "author": "Felix R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-15", "description": "This place replaced some nasty taco place whose enchiladas tasted microwaved.  Thank goodness it's a decent neighborhood pizza place where I can get a big slice, that's near my house.  It's thin crust, just the right amount of chewy yet crispy, and the workers are always really friendly.  It's not fancy or the best pizza in the city, but it's good enough when you want pizza fast and convenient-- it's better than gross amici's tasteless thin crust.  Their topping choices are standard, and the amount not extremely generous nor sparse.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "So happy to welcome Pizzeria Avellino to the neighborhood!  Despite some first day hiccups, the service couldn't have been nicer, and the pizza was delicious.  Two kinds: New York style and Italian (Neapolitan) with great toppings.  The formaggio is particularly good.  \nLooking forward to seeing beer & wine and a salad on the menu in the near future.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-22", "description": "pizza is OK but they get the one star for FALSE ADVERTISING on their happy hour.  As stated it's $2 for domestic beers.  TWICE now I've ordered domestic beers (once blue moon, the other Gordon Biersch) during happy hour and been charged more than full price.  The first time I let it go.  The 2nd I noticed on my receipt I'd been charged for an import so I complained.  The guy behind the counter said - oh that one's not on happy hour.  When I pointed to the part of the label where my GB said it was made in SAN JOSE, CA for heaven's sake and it doesn't get much more domestic than that he said \"oh that's a micro brew so it costs more.\"  Well you need a new sign and a dictionary apparently Pizzeria Avellino because Domestic and Import have VERY specific meanings which you are not too familiar with.  There are better places close by to spend my money and so that's what I'll be doing - going ELSEWHERE.", "author": "Rebekah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-29", "description": "We are picky about pizza--but THANK GOD Pizza Avellino came along!\nThis is good pizza in SF, and that is not that easy to find, surprisingly. \n\nThese guys know pizza, they do it well, and it has great crust, great sauce and very easy to call ahead and swing by and pickup for our Friday night Pizza runs! We have also eaten here and the outside tables are nice and being at the edge of the Presidio is also a plus. \n\nMake this place a part of your routine, its worth it!", "author": "Krutika P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "This place is great.  If you ask me, what makes a really good pizza is the cheese.  Sauce is one thing, crust is also important, but without good cheese you don't really have pizza.  The cheese here is amazing, just enough gorgonzola to be noticed, but not enough to overpower.  My wife and I really like the rustica style pies, but then again we are from the west coast.  They make enough types of pies that people with a new york bias won't be disappointed.  All are affordable, and slices are available for those who are too timid to get a whole pie.  Seriously, though, if you just get a slice what are you going to eat for breakfast the next morning?\n\nMy three boys love both the new york style and the rustica.  The toppings are really good as well.  Outdoor seating will be great for sunny days, and for a place that has only been open a very short while, it is run well.  Again, though I have to mention the pizza rustica, either four-cheese or prosciutto, are worth selling heirloom jewelry for.  Good thing, though, the prices are low enough so that won't come up.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "Very disappointed that they have changed their menu and no longer make rustic pizzas -such as prosciutto, 4 cheeses, and/or greco  which were my favorites. They seem to be heading in the direction of becoming a generic pizza restaurant and it's a shame. i guess I'll just go to A-16 for my pizza.", "author": "Renzo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-01", "description": "update: beer & wine coming in two weeks.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "This is authentic new york pizza.  I really hope the owner reads this... Don't change the recipe to be west coast style.  People who give this place low marks on pizza just don't know how hard it is to find new york pizza slices and have no clue what new york pizza slices are supposed to be; and these guys have done it.  Good job fellas.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "Amazing thin slice, crunchy crust pizza!  Great service.  Fast.  If ordering a whole pie we usually call it in before heading over.  Nice happy hour price for beers.  Small & cozy pizza joint.  Family friendly.  Our daughter wanted to bring a few friends for her birthday and we called ahead to place the pizza order and they saved a table for us!", "author": "S R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "A welcome addition to the neighborhood. Simple menu that delivers. The NY style pizza was really good. Excellent crust and I can tell they use higher quality ingredients than some places. When they get beer and wine it will be hard to find a better place to go for NY style pizza.", "author": "Robert O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "Definitely a good spot. Our go-to used to be Giorgio's, which is still tasty, but somehow Avellino's thin crust is now the new standard.", "author": "yvonne l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "Finally a pizza by the slice place just outside the Lombard gates! I lived in the Presidio for a few years and the lack of food close by was always an annoyance. The pizza was crispy and perfectly charred on the bottom. My husband and I showed up right at closing time, but they were nice enough to unlock their doors and prepare a slice for us. The mushroom was excellent since it had sauteed mushrooms similar to E'angelos but minus the garlic and butter which would have overpowered the tangy sauce. This place will be even better with some beer on tap and the outdoor seating. I'll miss the french toast at Curbside Too (I've negated the taqueria from memory), but I'm so glad this didn't turn into another overpriced Marina place.", "author": "Luchen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "3 stars for the crispy thin crust, 1 star for replacing the taqueria. I got a slice of cheese and thought it could have used more sauce and cheese. Some of the topping combos looked good, but you have to order a whole pie.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "This is an amazing pizzeria. It has an old italian feel. The pizza crust is thin and the pizza has a flavor of its own. It is a great find in a cute neighborhood with very nice employees. Ralph really takes pride in the pies he produces and my family and I can hardly wait to go back. We drove all the way for colma, ca just to try his pizza and we are hooked.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Came in the other day for a quick bite with a friend after a glorious day at Crissy Field. I loved the Rustic style with proscuitto and fresh arugula. This is as good as any pizza elsewhere in the city. Will definetely be back. Cute place! Salad and beer and wine would make good additions.", "author": "suzanne m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-08", "description": "I finally don't have to cross town to Arinell to get a great slice of pizza.  I'm from NY and an Avellino cheese slice is what I grew up on.  The rustic pizzas are also really good with the pesto giving them a nice flavor kick.  Turns out the pizza chef is from the Bronx and has been making these pies for 30 years.  Let's hope he stays.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-18", "description": "I went here last night and I must say - this is my new favorite pizza place in the city.  They have 2 styles: Napoletena and NY.  I tried them both and they are both delicious.  The Prosciutto Napoletena might just be the best pizza ever made.  Its very similar to Pizzeria da Michele in terms of crust.  For those of you who really know pizza, you know what I'm talking about.", "author": "A M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "I'm a native New Yorker and am NOT a fan of the squishy doughy crust that they use out here at many places.  I also believe that you don't need to drown the thing in cheese, ingredients should be balanced, and the quality of your tomato sauce is important.  I also think that pineapple and ham on a pizza is an abomination... That being said, this place has a solid thin crust pizza.  Not the best in town, but very good.  I ordered an XL Sausage and Mushroom and a Medium Pepperoni and we all agreed that the Pepperoni was better.  The sausage is ok, but Giorgio's uses a better quality sausage, and the mushrooms seemed a little tired and bland. We did the pizza to go and I think that the sheer size of the XL made it a little soggy on the trip home while the medium size retained more crunch.  The pepperoni was spicy and tasty as well.  I too used a coupon but would actually go back and pay full price for their Pepperoni pizza again. I do wish they had more toppings, such as fresh basil.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-05", "description": "this place is amazing. period. \n\nthe guys behind the counter are so nice and welcoming, offering me a slice of  pizza napoletana to try while i paid for my large ny pepperoni pizza to go. i am happy to report each variety was equally delicious. the toppings were so perfectly proportioned, and i felt the love and care that went into it. it is, by far, the best ny pizza in the city. \n\ni moved to san francisco from brooklyn, where i lived for 5 years, and i ate a slice everyday. it seriously was a taste of home. \n\nthanks guys. im hooked.", "author": "Dana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-02", "description": "You have to take your hat off to anyone with the chutzpah to open a restaurant in San Francisco in 2009.  Excellent NY style pizza in a simple place.  Rustic pizzas are pretty darn good also. Wine, beer and salads are coming soon, but it doesn't even matter. This place is all about the slices and pies.", "author": "butt p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "Pizza worth trekking across town for.  Stopped in before a hike in Marin.  I have been looking for a great pizza and location for a long time.  Can't wait to go back soon....maybe they'll have beer by then!", "author": "R H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "Oh man this pizza is good!!!  I had the Prosciutto which is the Italian style and it was amazing.  I wish I had a beer to wash it down but the owners tell me its in the works.  Joel and Steve are the owners and are a great addition to the neighborhood.  Good Luck Gentlemen!  I am a fan.", "author": "Paul R."}
