{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "This has to be one of the smallest Popeyes around. This little eatery was packed with people even in the late afternoon of my visit. A line out the door literally, I was about four outside the door when I got on line. It does move pretty quickly though and the walk up counter service is friendly and efficient. Paid, got my ticket and drink, it really only took a few minutes and my food was ready, hot and fresh and delivered to me.\n\nMenu boards are overhead at the counter, with multiple choices and options. There's a small \"dining\" area along with a few window seats, otherwise most folks get it to go. Which was my intent and plan.\n\nThe food is Popeyes norm, the beans and rice are/were good as was/is the mac n cheese, the spicy chicken nicely fried, moist and tender, and piping hot. The biscuits were good as well, flavorful and tender lightly golden brown. A good option for fast food.\n\nThis little shops location is in a very busy Safeway parking lot with no drive through. So you have to park and walk in, the only downside. \n\n3 Stars it serves its purpose\n\n00591", "author": "Ray F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Ok, got there there was like 5 people in front of me, 25 min later a get to the register and hes now closed.\nI order 4 drumstickscand get home to 4 thighs.....\nTook me an hour to get fast food served wrong", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "Oh man!! This place needs to really be on Undercover Boss. It's managed so bad it's insane. \n\nThey can't be making any money.\n\nSo I came in here on a Sunday at 6:15 and after standing here for a TEN MINUETS I WALKED OUT at 6:25 after not moving.\n\nI highly recommend you do not waste any of your money here.\n\nThe employees didn't acknowledge their lack of incompetence and Popeyes should be ashamed.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-13", "description": "RACIST WORKERS SAID RUDE COMMENTS WHEN THEY FAILED TO GIVE ME MY FOOD AFTER 45 mins passed and all I ordered was boneless wings and fries. I said is my food done now I'm late a worker said very rudely for me to wait I said that's not answering my question then he replied with \"YOUR MAD YOU CAN ONLY TALK ONE LANGUAGE WE TALK 4 HAHA \" and laughed and gave me my money back wasted my whole lunch I called corporate and they gave me a 5$ check to get my food from the same location how does that help i don't know but that worker needs to be fired or suspended ‍", "author": "Denise W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "When:  Wednesday evening around 800pm Super Hungry.\n\n5 people ahead of me with only 1 register open and 1 guy packing up the orders which made me assume that it would take 10-15 for me to order and start tearing it up, BUT NOPE ... it took just about 5-7 min!  You go to KFC or some other Fast Food/Take Out with similar circumstances and trust me, There have been times when I have waited 15-20min with 5 orders before me with only 1 Register and 1 Person packing up the orders. Although she wasn't the friendliest (looked overworked quite frankly speaking), the female cashier up front and the guy packing up the orders were a Super Hero combo saving hungry customers a lot of time.  Food was hot and fresh to say the least and they weren't stingy on the napkins either like some other places I have been.  Shout out to the S.F. Fillmore Popoye's DUO!", "author": "Zoe Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "This place can be scary with aggressive customers and workers that have this FML attitude.  They ID you if you use a credit card kind of place.  The wait is oh so long, but goddamn I think this place is worth it.  I look at KFC is disdain and I get disgruntled if I have to pay high prices for fried chick at hoighty toighty restaurants such as Wayfare Tavern.  This place keeps it real on more levels than one.", "author": "Bailey N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-09", "description": "Don't bother. Popeyes is good, however this franchise is trash. \n\nDo not even consider ordering delivery. You'll wait at least an hour for cold gross food. \n\nI'm sure the dine-in experience is decent but I'll never bother to find out.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Hella cheap lunch deals on Tuesday. \n\nIs it the healthiest food in the world? Most likely not. \nDid I still eat it? Heck yeah! It's fried chicken!\n\nThey were lovely during my exchange of money for a receipt with my order number. Quick, efficient, and friendly.\n\nAfter collecting my receipt, I waited alongside other hungry people. My number was called and then I collected my grub.\n\nHot, spicy, and everything I could ask for in shameless lunchtime indulgence.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-22", "description": "The taste of their chicken is so  so so much better than the ones from KFC. And I like the fact that they have a tuesday special, around $2.50 for two pieces of chicken. I know, it's dirty cheap, and that's why people are lining up to buy their chicken. This ensures every order of Chicken we get is hot & fresh, at least on Tuesday. \n\nHowever, the good part ends here. The one thing I hate about their chicken is, THERE IS A FREAKING AFTER TASTE!! Everytime after I eat their chicken, I feel like I just rainsed my mouth in some chemicals. I don't know if it's antibiotics from the chicken. Came for 3 times and they all have this awful after taste. Anyways, probably won't come back again just cuz of the after taste.", "author": "Judy O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "Nasty asf!!!! Horrible customer service, no where to wash your hands,no restroom and did I mention nasty asf crumbs all over the floor the tables, the chairs health inspection 85 of course I noticed after getting my food.\nIf I could no  the food was horrible the biscuit was the only thing semi good, chicken was fatty and greasy, fries were ok....this is the 1st time I have ever been disappointed eating a Popeyes, but this particular establishment I WILL NEVER AGAIN!!!", "author": "Kenyetta W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "I had a rather large catering order with this location through DoorDash. They called me a couple hours later after my order went through, but did not leave a voicemail. Afraid that there was a problem with order fulfillment, I called them back multiple times (even at different times of day). However, the phone would ring off the hook ten times, set off a high pitched screech, then hang up. The order did deliver successfully, but I still don't understand how no one ever answers the phone. Good luck to anyone wanting to phone in their order. You would be better off going in person if you are close by and want your Popeyes fix from this location.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "Poor customer service. Presented a coupon that was advertised on their website and the guy working the register wouldn't accept it because it wasn't printed out. Will never be back.", "author": "Derek D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-08", "description": "Big disappointment on the 3 pieces of (1 white, 2 dark ) spicy chicken from this place. They were not spicy, but overly or twice/or more times frayed(tough). I did not know chicken wing was considered part of the dark meat selection. Since wings were offered & sold separately. Our chicken pieces( tiny, tiny) were like a child portion. We ordered small coleslaw and 1 biscuit(dry). No drinks and the total was $9.20. \nFortunately we live in SF and can find good honest food 24/7. Addio Popeyes!", "author": "Angel O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-27", "description": "This was the worst experience ever. I went into this location on a quick break and it was an epic failure. When I got to the front of the line and placed my order the cashier told me I needed my i.d. To use my card. She then pointed my attention in the direction of this generic sign that says no id no card no pin. I said ok please keep the order in my I.d. Is in the car right outside the door. I ran and got it in about 30 seconds. When I returned she was already waiting on someone else which I kinda understood so I stood back but in clear view of the cashier. When she finished taking that order she motioned for the lady that was the same ethnicity as her to come forward and she proceeded to take her order as if I wasn't even standing there. I am appalled and I know she saw me I am 6 feet 4 inches tall the lady in front of me was like 5 feet even. I feel totally discriminated against.", "author": "Thomas W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "bought 10 pieces of mixed chicken there and had them for dinner. \n\nwife and I got stomach flu then for the next 4 days. \n\ncannot say they are related for legal reasons but just the coincidence makes me not feeling the urge to return to this place or any Popeyes again.", "author": "Wai C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "I don't care what anyone says, I love Popeyes biscuits and their popcorn shrimp!!! So what if it's filled with trans fat, nor organic, and greasy, it's all kinds of delicious! And sure, it's not the cleanest (but hey, they seem to pass inspection!), but who am I to judge, especially when I'm craving a buttery biscuit!!\n\nI like coming to this location specifically because there's a big parking lot, so I don't have to circle around attempting to find parking. Service is relatively fast, but hey, you get what you pay for!\n\nWord of caution though: if you come late, chances are they may be out of the Mac and cheese or any of their other more popular sides. But otherwise, it's a solid meal at a solid price in my book.\n\nLikes:\n-fast service\n-good options \n\nDislikes:\n-runs out of sides sometimes \n-not the cleanest location", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-19", "description": "Service was ok but the place was so dirty, that after originally intending to sit down and eat there, I decided not to and took my chicken to go instead. All the tables were so covered with scraps of food that fell from other people's mouths that I wondered how often they cleaned them, if ever!", "author": "Pablo J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "I bought a  set meal and  paid 41.00 bucks for tiny 12 little thighs the smallest thighs I've ever seen and 4 breasts for the super bowl party. I've waited 30 mins in line for it. What a rip off.", "author": "jose m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "Went to the Popeyes on Fillmore Street tonight to buy dinner-a take out. What I ordered were the 12 piece spicy fried chicken and two side dishes. When we got home, I counted how many pieces were in the box-there was only 11 pieces in it. I hope the person, who picked my order, did not do this intentionally. I hope it was just a miscount. The next time I go in there again, I will keep my eye on the person, who's doing the picking.", "author": "Ken Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "They supposed to open up 10am but here it is almost 10:15am and their outside smoking cigarettes. Doors still locked!!! What ever happens to customer services. Where is the southern hospitality that comes with this good ole Louisiana cooking!!!!", "author": "Oodles W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-16", "description": "Company wise: food is great. \n\nThis particular store: blows monkey balls. Never more than one person taking orders and others just hanging around talking and laughing. Even if there is a line out the door, still one person taking orders. No one jumps on to help. And then most of the staff have an attitude. They better be lucky people like the food or this store would probably go out of business.", "author": "Princess D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "Good Popeyes chicken but very poor service and the place looks like a dump.  The table/counters are usually not cleaned up and the trash bins piling up.", "author": "Dang H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "I used to love going to Popeye's especially for their Fried Chicken. However, as of recently they are no better than KFC. You can expect the meat to be soggy due to the excess oil that remain. Sometimes the chicken is even over fried and stiff. I don't know what's going on at this place but the service here is not as good as it used to be. I am not planning to come back unless there is a big change, Popeye's Louisiana Kitchen needs to see about what's going on here before losing more customers.", "author": "Rodney T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "So I love Popeyes and I mean LOVE Popeyes Fried Chicken and Mashed Potatoes.  I live pretty close by so I used to go pretty often and didn't mind having to deal with the homeless people asking for money or asking me to buy them something.  I also didn't mind the bad attitude that a lot of the staff had because they had to deal with difficult for no reason customers that don't know how to act right.  I still went because the food was good and even if there was a line, I never had to wait that long because they knew how to get the orders out and keep the lines moving.  But it seems like maybe the place is under new ownership or management because all the usual people that I saw all the time are all gone.  In place of them are a lot of new faces that don't know what the hell they are doing.  I stood in line for about 10 minutes the other day, while the person at the register took order after order, but the guy getting the orders ready (just one guy) didn't really seem to be able to get any orders completed.  Finally after 10 or so people were standing there waiting for their order, the woman as the register started to help complete the orders.  All in all, I spent 10 minutes in line and another 20 minutes waiting for my order to be filled so I could leave.  These is extremely disappointing, I love the food, it was still very very good, but I will not wait that long even for Popeyes amazing fried chicken.  This is not an isolated incident the same thing happened the two times I went before that time.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "Did someone say Popeyes? YES PLEASE!\n\nPopeye's is my #1 spot to go to for some delicious fried chicken!\n\nI was in the mood for some after spending the morning in San Francisco and this location came to mind. Located in the Safeway Fillmore plaza you cannot miss this small local restaurant! \n\nI came in during lunch time and I got there right before the line got extremely long! Thank goodness because after a while they did start to run out of food.\nI asked for a special request of freshly made fried chicken which was a 10 minute wait. I don't mind waiting for freshly cooked chicken (it's definitely worth it). \n\nI ordered:\n~Butterfly shrimp with fries\n~2 Piece chicken with a biscuit \n\nThe cashier lady was so nice but I have to admit she was so slow! They have about 4 different men that prepare the food in the back and although the cashier was slow the food does come out quickly.\n\nMy favorite was the biscuits! OMG, it makes my mouth water just thinking about it! It was so freshly hot and just melted right in my mouth! So damn delicious!\nOne thing that turned me off were the dirty tables. UGH! I couldn't eat at this place even if my life depended on it! I do understand they are busy but they should at least do a check every so often to check the cleanness of the store, right?\n\nI would definitely come and order there good food again especially because they make it so fresh! Hopefully those biscuits don't stick in my head for too long or I'm going to have to make a special visit sooner than I thought! HAHA\n\nPsst...Don't forget to get your receipt back after your Popeyes restaurants are offering a receipt survey for 2 free pieces of chicken and a biscuit with the purchase of any large drink. \n\nOh how I love you Popeyes!", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "The customer service here is pretty terrible. The server rolled her eyes for at least 5 times when I was ordering my food. The food was good though but they really need to improve on their customer service.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-07", "description": "Today I went to Popeyes and bought a combo and a apple pie and when I got home to eat my pie I notice I was eat cardboard paper it was baked in the popeye and I will never eat there again", "author": "Ruthy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "this location is the worst...chicken must have been the size of a pigeon...\ngot two 8 piece \"deals\"...breasts were mostly oily breading, legs were 3\ninches long, wings so small no meat, thighs ok...cold slaw was good...\nbut amount not a serving..\nBiscuits hard and cold...\nsafeway deli has best carry out chicken in san francisco\n\nFriday special: 4 thighs and 4 legs 4 five bucks", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "Popeye's is among my go-to spots for a fast and cheap meal (actually, I go there when I do not have much time and I need to be in and out in 30 minutes or less). Nothing can beat the service I get at this specific location -- way better than any other one I have been to. I love the taste of the Fried Chicken and I often get biscuits and a soft drink to go along with it. I am not a fan of their fries though; they are not crispy enough and often seems to get limber as soon as you take it out of the box. As long as the quality of service remains the same I'll continue eating here, it's too good to go somewhere else.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-24", "description": "Parking is found in the back of the strip mall. There is also no entrance in the front facing the main road, the entrance is located in the back.\n\nI ordered the 9 piece nuggets with bayou buffalo sauce and cajun fries. I would say the nuggets and the cajun fries were amazing! The sauce tasted kind of weird. It reminded me more of a sweet and sour sauce flavor...\n\nVery sketchy area, to be honest...", "author": "Aj C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "When I am in the mood for some fried chicken,it would be Popeye's. This review is for the Fillmore location. \n\nOn Tuesday, they have a special, a thigh and a drumstick for 1.99$... it is now raised to 2.29$...\nI like Popeye's because it is much crispier than KFC... but I don't know if it was because of the oil, I kept burping after each time I ate their chicken! Weird, but it's true! I also like their biscuits. J ordered the sides once, they ate just ok, so I don't get them any more. \n\nThe lady cashier was cheerful, but sometimes it was a younger Asian guy... and he was pretty rude. \n\nParking is horrendous here. The Safeway lot is always full, have to drive around and around till I was lucky enough to see somebody pull out. And street parking in Fillmore is not any better.", "author": "lovetoeat a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "I love Popeyes but this place and the other location has a vermin infestation so I can't eat here without thinking about how they didn't care enough to correct it for months.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "This is the best value and quality fried chicken in SF. Sorry, but where else can you go for quick and good fried chicken? Every KFC in the city is run poorly and the chicken comes soggy. Granted, I come here to get a bucket. That's it. Ok, the sides are the sides (solid, but not the point), but this is Popeye's.\n\nF-R-I-E-D Chicken. Having been to the state of Kentucky (the commercial home of the best food invention ever really), this SF Popeye's is where you need to go. Otherwise go to San Tung and pay twice. Maybe Front Porch for something different.\n\nAlso, parking is just so easy with the giant Safeway parking lot. This location has existed since the dawn of time (grew up in the then projects across from Japantown some fifteen years ago) in this area, so there's just a reason it exists. The area still sucks, but come on you're coming to get fried chicken. This isn't Gary Danko. Calm yourself.", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-04", "description": "This is the filthiest, poorly managed Popeyes I've ever entered. Tuesday night, there's a line that is 35 people deep and one person at the register and two people standing behind the register doing nothing. Corporate management needs to step in and clean this disgusting Popeyes and put the management staff in place that knows how to run the business. I waited 25 min, just to get to the register.", "author": "Russ E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "It was lunch time when I walked by and had felt the need to get something to eat.\n\nSome of the items I ordered were:\n- Cajun Fries (Small)\n- Mashed Potatoes with Cajun Gravy (Small)\n\nThe staff members here are pleasant and friendly. Plus, the service here is actually very good. I am so into visiting Popeyes for fried chicken cravings. They make fried chicken that is tender, delicious and crispy with little to no grease. Overall, good experience here so I am definitely coming in again for fried chicken.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "This location sucks! Dirty AF, the line to order stretches out the door, around the corner and to infinity, they only have 1 counter open and when asked, they refuse to open the other one and the crew just stand around, chatting with each other, laughing and gossiping. I asked for #3, it was ok, but then I asked for BBQ sauce, they said they have to charge me .25cents for a packet of BBQ sauce. WTF??? Where the hell did you heard of a Popeyes charging you .25cents for a packet of BBQ?? The owner must be a stingy AF. Seriously??", "author": "S S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Last Thursday night, I was running late to a show at The Fillmore, so I wanted to have a quick dinner. Popeye's was just a block away from the venue, so I decided to check it out. \n\nPopeye's is definitely my favorite fast food fried chicken place (over KFC and Church's). Popeye's at its freshest is 5 stars. However, many locations can be hit or miss. I happened to have a great experience at this location, but I noticed that other customers were not as happy with their experiences. \n\nI ordered the 5 piece chicken tender dinner (spicy, of course) with fries and a biscuit. They made the chicken tenders to order, and they happened to be making a fresh batch of fries when I placed my order. Needless to say, my meal was outstanding. The chicken strips were crisp and spicy, and the chicken was really juicy. The fries were actually crisp (generally they tend to get soggy after a pretty short amount of time). The buffalo bayou sauce, which is really just Louisiana hot sauce, was the perfect dipping sauce for the chicken. \n\nI do have to take away one star though, because while I was eating my food, several customers tried to order items like cajun rice and jambalaya only to be told that Popeye's was out of them. It was only 7:30, and they stay open until 10, so I would be kind of annoyed if I had wanted to order one of those items. \n\nOverall, I'd recommend this Popeye's location. It's certainly better than Subway or Panda Express.", "author": "Ravi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "It gets two stars due to the food being good. I like Popeyes. It loses stars because this location can use a good steam cleaning inside and outside and the service. The service is mixed. Once you place your order, it's quick. But actually placing your order is a problem. Hella slow and they refuse to open two checkstands when the line goes out the door and only gets bigger.", "author": "Rodney L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-14", "description": "Disgusting fake chicken!\n\nI definitely will not eat there again, ever.\n\nKFC is so much better and tastier.", "author": "Amin K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "Good chicken and sides when there is a sale. But their line system and the store/layout is not good. Too much chaos. Plus Store table, floor, windows, bins...Needs Major Cleaning!\n\nPlus more LIGHTS! Light up the sidewalk and Light up Parking area! So many very thuggish people hanging out right in front of the store selling drugs and other 'things'. Very bad for customers to have to walk through this area just to get food (eat in or take out).\n\nClean, more lights, Call the Police to clean up the very bad element in this area.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-12", "description": "Anytime you have a popeyes and a dialysis clinic in the same mall....its all good.\n\nSeriously this place is aight. Spicy chicken is not that spicy...is not that great for that matter.\n\nFries are so so. \n\nThe real shinning star, so to speak, is the biscuits...and they is aight as well.\n\nPlenty of parking. Plenty of entertaining characters abound around.....\n\nGrab a meal deal and a seat at the davita clinic ( I hope none of you ever have to)....and enjoy.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Pros: Special deal every Tuesdays mild or spicy chicken leg and thigh for $1.99!!! I usually get it every other Tuesday for lunch since its near my work. Chicken are usually right out of the fryer. Tender and crispy chicken!!! Very tasty and flavorful. Sometimes they make a mistake and they add an extra chicken to my order :) Gravy to their mash is delish! They have this jambalaya rice which goes well with the chicken. Oh and yeah don't forget the crispy fries (;\n\nCons: Long lines and place is tiny. They only have like somewhere around 4-8 seats. Staff are usually friendly but most customers are obnoxious, so the staff goes crazy most of the time! Sketchy area with a lot of bums.\n\nIt doesn't stop me from coming here though. I just don't pay attention, mind my own business, buy the chicken and leave as fast as I can lol", "author": "Sharmaine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "Gross nasty place!!!!   Long waits, lines full of ghetto crack heads, understaffed, dirty, dirty, dirty, dirty place, slow and disorganized staff.  I am so over showing up thinking I can put up with all the bs and drama with this place only to give up and get my food at the Safeway next door.  Never again!  For gods sake at least clean the layer of grease, grime and crumbs off this crap hole!!!", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "Never come when they are ready to close. Attitude sucks. \nWe went before close time (after 9:30) and staffs were so impolite.", "author": "Kelvin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "They don't understand the \"biscuits\" portion of their name.  You have to stand out the door of this tiny storefront to wait your turn, and with that kind of customer volume, there's not need to be polite, or try to get your order right.  It helps if you match the ethnicity of the owner/manager for better service.  Seemed a bit racist.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "I wish there was a way to stop people from eating at this location. The entire staff stands around talking, even when there is a long line, while 1 person takes all the orders. The dining area consistently has dirty tables, maybe that's what they're talking about! All I know is, they are now  making $14/hr. to socialize with each other, and ignore their customers! Tuesdays they have a 2 piece deal, and the line is out the door (Arghhh!), Because the franchise owner is a greedy a**, they don't include a biscuit with this \"deal\", like every other Popeye's in states outside of CA would.  Newsflash: 2 pieces of chicken by themselves is NOT a deal! Then, they want you to pay over $1 for a biscuit, and if you want sides, they'll be overpriced and extra too! This is obviously a ripoff. Yet, there are the lemmings, lined up every Tuesday.  I don't know why so many people in SF patronize these restaurants. No matter how f'd up they are!  Look  people who eat at this location, you can walk the few extra feet to Safeway, and get 2 pieces of chicken, for the same price or not much more. And, you can have a choice of rotisserie or fried. The employees, will actually talk to you politely, and without stank attitude. If everyone went there, and Popeyes saw a decline in their profits, they would have to re-think the way they do business.", "author": "Ebony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "The chicken is pretty good!\n\nThey still honor a promotional deal for 11 pieces and nothing else that expired forever ago. That's good too.", "author": "Dog M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "Chicken wings has too much oil. There are too many homeless asking for money while I was waiting in line. This place is very dirty and messy.", "author": "T B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "Got a 2 piece fried chicken meal with a breast and a thigh with mashed potatoes and a biscuit for about $5. I can't beat that! Honestly I used to love kfc until they changed their oil. Now their chicken is bland. But I love popeyes spicy fried chicken. The skin is crispy and has a slight kick. Yum!\n\nOur cashier was super nice and quick so I would have probably given this location 4 stars, but minus 1 star cuz the place is a little sketchy. I felt slightly uncomfortable walking in. Parking is super easy as it's in the safeway shopping center so they almost got the star back. But minus that same star for being out of mac and cheese. Boo!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-27", "description": "Slum in the city.\nWhy lower Fillmore between Geary Blvd and Golden Gate is so freakin' filthy?\nALWAYS FILTHY!\nJesus Christ Sake!\nWell, people here are seem not so care for been filthy. I winder why?\nI guess they don't like to be clean.\n\nAs the S.F, Restaurant's Health Inspection Scores is very important.\nSo why don't we create \"SF Street's Health Inspection Scores\"? \nStockton Street between Vallejo St and Sutter St, include Stockton tunnel, Score should be \"16\" out of 100.\nGrant Ave  between Broadway St and Bush St, Score should be \"37\".\nFillmore St between Geary Blvd and Golden Gate Ave, Score should be \"49\".\nI see a Human Centipede on the bus stop.\n\nAnd, here, between Byington St & Ellis St on Fillmore, Western Addition, on the Fillmore Street side is a ghetto. You'll see many garbage-bins on the street are so full and smell always sour, drunk couple smoking something jaywalking, characters are everywhere ....\nIn the surrounding conditions, coming Popeyes Chicken is a life time experience, but you must act like a transparent, invisible man, don't look around, don't get any eye-contact, just stay still looking at the menu, until your turn.\n\nHoly Popeye's Tuesday fried chicken special! \nEven though weekends, always feel like Tuesday special at Popeye's, WTF?\nIf you like to take a chance, the crowds and environment, it's not a bad deal.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-08", "description": "I threw my food away! The chicken was so tender that I could break even the bones so easily. My mouth tasted like a chemical factory for sometime. \nI should have expected nothing more after looking at the mountain of fried chicken being stacked behind the counter.", "author": "Vydesh R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-15", "description": "This is one of two Popeyes in the area (the other one is on Divs and Hayes) Service OK... Food..OK  Area.. filthy!", "author": "Yummy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-31", "description": "Way understaffed, long long wait, overflowing trash bin. I recommend they fix this soon, cause I don't plan on returning to this location soon. And they were out of sides.", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-28", "description": "This could probably be the worst location out of the 4 Popeye's stores in SF, although it has plenty of foot traffic being next to a Safeway. I think they have problems retaining staff, and the new staff receives poor training.\n\nService at the register was friendly and efficient when I visited, but lately the baggers don't know what they're doing and the kitchen staff needs better training because food preparation and consistency are subpar. This place used to be so much better in the past.\n\nList of mistakes from a recent visit:\n- mac & cheese was VERY watery and overcooked - like baby food,\n- the Cajun dirty rice was not mixed well, with clumps of seasonings,\n- a large order of red beans and rice didn't have enough rice,\n- they forgot a side order of cole slaw but gave me Cajun fries instead,\n- the fried chicken tasted okay, but half of the box was wrong - incorrect chicken pieces from what I had ordered.\n\nThe one nice feature is the free Safeway's large parking lot.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-07", "description": "We saw this lady eating fried chicken and got us wanting some.  When we saw Popeye's, we knew we wanted some.  Having had good experience with Popeye in New Orleans, we were expecting the same - boy, were we wrong!  Luckily, we only got the spicy 2 piece (drumstick and thigh) snack with biscuit at $2.49?   These are the smallest drumstick and thigh we have ever seen!  Maybe they are from a game hen.   After pulling off all the batter and skin, there were probably 2 bits worth of meat. Size aside, it was not spicy and not very good.  I didn't even bother trying the biscuit but hubby did and he said it was not good.\n\nNo more Popeye in SF for me.  If I have any cravings, I'll just have to take care of it when we return to New Orleans.\n\n$5 minimum for credit card purchase.  Operated (owned too?) by Chinese.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-04", "description": "To the guy that just hit puberty with the pimple on his chin. Honey mustard is something that comes with any of the chicken tenders u order. Also, why are there only Asian people working here, this is coming from an Asian person. There should be some diversity. We live in Merica after all and it's a large American franchise. This place makes me want to rip my hair out.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-13", "description": "Not so good when you have a really long wait basically 20 minutes. And then they get your order wrong where you have to go back and get it corrected. On top of all of that they were out of honey and butter for the night. Hopefully this Popeyes location performs better than what I've experienced it tonight!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Yes, I am aware that I am writing a review for Popeye's, don't judge.\n\nI avoided this place for a while, mainly because there's so much good food in SF, but after riding the 24 up and down Divis with people getting on with bags of this nectar from the gods, I had to give it a go. \n\nThe staff is beyond rude - but I would be too if I worked at Popeye's - and I'll put up with a lot of bullshit for reasonably priced fried chicken. The spicy isn't actually spicy at all, but the chicken is moist and the biscuts (oh, the biscuits!!) manage to be sweet and slightly salty all at once (black magic, I say!), and the red beans are rice are fine as well. Top it off with a Hi-C fruit punch, and you've got yourself a Saturday afternoon stroll down diabetes lane - no seriously, there's a dialysis clinic like next door. \n\nENJOY!", "author": "Craig P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-08", "description": "It's crazy how there's 2 chicken joints within a block radius...how do you choose?  KFC or popeye's?  Well, this popeye's location is always super busy....it doesn't matter what time of the day.  I'd like to think that because of that, the chicken is always freshly fried.  \n\nThe people that work there look miserable...although they are quick and efficient.  I guess that's all you need to get in and out within a matter of minutes.  \n\nDon't even bother going on Tuesdays...they have a 2 piece chicken for 1.99 deal...lines out to the streets!  \n\nLove the biscuits...I think they're far better than kfc's...but the chicken war will still be left unsaid.  \n\nOh, and they've got dirty rice...can't beat that!", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "A shout out to the guy working behind the counter one busy Friday afternoon. He had no help behind the counter, one cook, the orders were piling up and he stayed calm, cool and friendly. He remembered people's orders, packed stuff up like a machine, and kept the line moving. He appreciated people's patience. The food was hot when it came.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-18", "description": "I love popeyes always have and hope always will but this location is absolutely horrible! The service is at a snail's pace and the people that work there are just rude. The lady that rung me up was checking her text messages as my credit card slip was being printed and when I asked for ranch dressing another lady told me I could choose between tarter sauce or ranch dressing but not both. Oh, and the shrimp tackle box looks nothing like in the commercials. The shrimp is so puny, I should have taken a picture.\n\nIf it weren't for the free parking, I would never come here. Ugh, why can't they just be a little nicer at this location?", "author": "Betty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Looking for a great date spot? You got it. It's a good test - if your man don't like his chicken fried, then you know what it is. \n\nI recommend crispy strip box with potato wedges and mac n' cheese. The biscuit should also not be overlooked. \n\nThere are fewer Popeyes in the city than Michelin-star rated restaurants: just think about that.", "author": "Denise N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "Stop going here!\n\nThey only hire people of Asian descent and treat any non-asians like dirt.\n\nI\"m Caucasian, and have YET to get an order fulfilled the same as my Asian counterparts.  \n\nTonite I stopped by, again..., and in-line every Asian person got their order fulfilled without incident -- but every other person, Black, White, Etc. was told \"your order will take 20 minutes...\"   This has gone on for YEARS and enough is enough!\n\nThey are racist in employment and service!   \n\nBoycott!!", "author": "D Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "Service was slow, especially for the lunch hour. The chicken was over cooked and tasted funny, like it was on the verge of being spoiled. I visually noticed an all asian staff (No offense to my asian brothers and sisters) which demographically speaking is questionable but not improbable. Can you say......Nepotism? I most likely will not return because the service and quality are not corporates version of SOP.", "author": "Tee D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "They're not only treat non-Asians like shit. They treat everybody like shit!! Horrible service and attitude.", "author": "Tse C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "Pretty standard.  They have chicken.  It's pretty good.  The spicy is better.  Oh, a hot girl worked there once I saw when I walked by.\n\nI think i'm just writing this review cause I don't always review places that aren't life changing...   It's a popeyes...  Should there even be ratings for popeyes...?\n\nAnyways, eat up, be happy!", "author": "Jesse M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "Service was average.  Food was good enough..but seriously - you charge $0.25 per packet of hot sauce or ketchup when we already paid for food?", "author": "Charles H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-05", "description": "The store isn't that spacious but the food is delicious.\nI love Popeyes chicken & will take them over KFC any\nDay ! I usually get 3 wings which come with a biscuit &\norder a red beans & rice on the side. If I'm eating inside\nThe store then I'd get the combo which comes with a \nbiscuit, side & drink. I also enjoy their mashed potatoes &\ngravy, the fries & butterfly shrimp !", "author": "Denisha D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-20", "description": "Food is always fresh because they are a small location that is always busy. But some of their employees are very short with customers and it would be nice if they cleaned their dining area and took out the trash every now and then.", "author": "TJ K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "Haven't eaten Popeye's for over 2 years now and when I had it was only the $5 lunch special.So I was there driving along and remembered I was near a Popeye and that it was Tuesday, so off I went for the $1.29 special. \n\nThe line was taking forever. First a stupid couple asking a million questions then another women doing the same, listening to the woman behind me asking what's making it such a great deal and if it came with a drink. Finally after waiting 30 mins it was my turn. With tax it came out to be $1.40 so I got 2 for $2.80 instead.\n\nI was hungry and when I got to the car I polished off 2 of the drumsticks. They say that everything taste better when one is hungry, guess I wasn't hungry after all. The chicken was more crispy than KFC but tasted much the same.", "author": "M C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-26", "description": "I don't normally (or ever) eat fast food but it was a fat day. I walked in with a large tapioca drink in my hand and the cashier looked like he wanted to kill himself. It was about 8:45pm and it was a ghost town. \n\nI ordered the 3pc chicken strips with mac and cheese, biscuit and drink - but I didn't want the drink cause I had my boba, so he gave me an extra biscuit instead. Turns out they were \"sold out\" of mac and cheese. Cause that happens right? You just sell out of sides at a fast food restaurant -____- then he points to the pictures of all the sides and draws invisible x's on the greens beans and some other side...then circles 3 other ones that were available. \n\nI am dying laughing at his descriptive technique! I went with the mashed potatoes and WOW....biggest let down ever!! It tasted like what I would imagine cat food to taste like. It was like thanksgiving flavored gerber with salt and pepper on top lol \n\nRequested spicy strips and they were nothing of the sort - delicious, but not spicy. The biscuits drizzled with honey were on point.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-29", "description": "It's a goddamned shame that I have to write this because I love Popeyes.  I love it so much that I would eat their red beans and rice out of a horse trough for my last meal on death row.  But I'd rather be the janitor at Power Exchange than go to this location even though it's only a few blocks away from my home.\n\n1.  The store is so trashed that they even have graffiti on the cash register\n2.  The service is SLOW.  When you are 6 people deep in line and it takes a full 35 minutes for you to get one small order there's something wrong\n3.  Last time I went I waited in line for 20 minutes only to find out that they had run out of EVERYTHING except for cole slaw and chicken thighs.  Literally ran out of 90% of the items on their menu by 6pm... \n\nPlaces like this are why stereotypes exist.", "author": "Gabriel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "I just wish there were more in the area!  I love this cajun fried chicken, the cajun rice and corn.\n\nThis location always has a line out the door, but well worth the wait!", "author": "Kenneth G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-09", "description": "I just walked by Popeyes this morning.  It was not open and no one was in there except their resident mouse (or small rat), running all over the place.  Go there at your own risk-be afraid, be very afraid.  I will contact the health department this morning.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-05", "description": "Picture this...January 1, 2012 and the bf wakes up with a pounding headache (between us he drank his body weight in scotch ringing in the new year). When I saw the state he was in...I knew he needed some grease and fried chicken came to mind. Thank goodness this Popeyes is right across the street from our apartment.\n\nStandard Popeyes menu, flavors and pricing. Service was very good, as well. A tad slow with getting the food out, but not too bad.  They have a few tables inside, but this location is more of a carry out location.  \n\nOverall...there's always room for some fried chicken.", "author": "Dru M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "Here on Tuesday special. Out of mash potatoes and out of Cajun rice.!!! No acceptable !!!! It's only 840 pm!!", "author": "Wesley W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "The workers were friendly asian ladies, and the customers were black.  The chicken was nasty...basically fried batter with little bits of chicken somewhere inside.  The mashed potatoes were sloppy, with unusually spicy/nauseating gravy.  The restaurant wasn't filthy, but didn't feel exceptionally clean either.  However, I do appreciate that the lady gave me a wet-wipe afterwards.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-27", "description": "First and last time in Popeyes. Didn't even get to place an order as the staff was so concerned with preparing another order. Nobody in line and I waited 5 minutes with NOT ONE employee even acknowledging I was there. Needless to say I left. Popeyes, try training your employees with even the most basic of customer service skills if you plan to have any future.", "author": "Brian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "I guess I got lucky the time I was here. Location was staffed by all asians, two of them looked like they worked there part time while going to college, the place was super clean, and the chicken was hot, crispy and not drenched in fat; probably the best fast food chicken I've had in a while.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "ooo how i love me a piece of fried chicken from Popeyes! i normally don't come to this location but i stopped by last night because i was in the area and order the 2 piece snack deal that comes with a biscuit. It was good, but not great! i always feel like this specific location rips people off with smaller pieces of chickens compared to other locations. When i order the 2 for 99 cent deal tuesdays i always get bigger pieces elsewhere and i believe they put a limit here on how many you can actually purchase. not saying i'm a big eater that LOVE fried chicken but from time to time i love me a piece of those killer fried chickens. \n\nthe people who work here are fast and nice. i will maybe stop by again if i'm feening for a piece of toxic in my stomach, only if im in the area..", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "This spot is horrible. I went there once and they were out of everything and it was only 4 pm! They are very racist and if you aren't Asian your customer service is terrible. It is in a very bad location in a bad part of town. The man that was in front of me in line had a knife and kept pulling it in and out of his pocket. The food was burnt to the bone.", "author": "Devin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "Forgive me for I have sinned....\n\nSo this is what I have been reduced to...reviewing fast food!  I've been so fortunate to dine in so many incredible places in the past...I guess I'm okay with that.  At least no one can say I'm a snob.\n\nThe weather was so beautiful today that we took a nice long walk down Fillmore in Pac Heights.  All of a sudden, I was really hungry and realized that I had not had lunch yet.  Naturally, my stomach started screaming for the worst possible thing I could have on my diet...Popeye's Tuesday fried chicken special!  Two pieces (no biscuit) for only .99 cents!  When I got there, I could see that a bunch of other people had the same idea.  To say the crowd was 'interesting' would probably be the understatement of the year, but I tried to remain positive so I figured at least it was entertaining.  That soon changed.  \n\nWow, I'm not kidding when I say this place is GHETTO!!!!  Unreal what people will go through to get a killer deal, but honestly, it was in the area, I was hungry, and fortunately, it was really good!  The staff seemed a little more coordinated than the last time I was here too.  On one visit, it was like a bad movie with the workers running around like a comedy of errors.  Things were much better this time although still slow.\n\nNoticed everyone was placing three orders (you can order up to four specials) so I figured why not as it's only three dollars for six pieces.  At that price, I ordered both regular and spicy.  Despite the crazy line and crowds, the chicken was super hot and fresh out of the kitchen when I checked my order (a must at any fast food place before leaving nowadays) so we decided to drive down to the marina green and eat it out there by the yacht club.  Stopped at a couple other places to pick up a few more things to eat and it turned into a really pleasant lunch by the water.\n\nI should be embarassed to admit this, but I was so hungry and I haven't had anything this bad for me (it was so bad that it was good!) in such a long time that I tore through it like a great white shark on a feeding frenzy.  Keep your arms and limbs clear!  \n\nAnyway, my reputation as an epicure may now be in jeopardy after this review, but I am still a happy and satisfied foodie.  As an added plus, I didn't have to eat it in front of my bird.  As I may have mentioned before, I always feel strangely guilty when I eat fried chicken in front of my bird. :)\n\nIt's fast food and on Tuesdays, it's surprisingly cheap and satisfying.  If you're willing to brave the crowds and environment, it's not a bad deal.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "what can you say except that sometimes the heart wants what the heart wants and the heart wants fried chicken?\n\nand not that bougie stuff at $18 for 2 pieces SF restaurants likes to do-- scribblin' designs on your plate with gravy. if you're going to add gravy to my plate it better be the molten lava to my mashed potato volcano. \n\nanyway, so KFC was a bust the last time i went (never again) so of course we had to make our way to good 'ol reliable popeyes. and it was tuesday. 2 pieces for $1.29. there is a consistent line on tuesdays bc of the special. this place is small with about 7 seats and without a doubt, dirty. empty boxes filled with chicken bones and corn cobs sat on the 1 table beside the counter seating the entire hour we were there. but it's so busy that the staff likely doesn't get a second to step from behind the counter to throw away the trash/clean the tables, so i guess i'll give them that.\n\njust take your food to go and enjoy your fried chicken and yummy biscuits.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "I love fried chicken and I love Popeye's, but this location is awful!  Don't get me wrong the food is great, but the clientele is much less than desirable.   It's one of the most ghetto restaurants I've been to.  I gave this place 4 stars anyway for the food, but just be warned, the experience there may not be very good.  Homeless people will ask you for food and others will make some sort of a scene in there (usually involving a threat(s) to the employees).  I applaud the employees who have to deal with this kind of thing on a daily basis.\n\nCan't I just eat my chicken in peace?!?!?", "author": "Ken G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "I haven't had Popeye's Chicken in over 10 years, so this was a very good change of pace.  It's amazing how much juicier the chicken is over KFC... \n\nAnyhoo, even though it was very busy when I got in there, they moved through the line very quickly and gave me my food in only a few minutes after I ordered.  I guess that's a must for \"fast food,\" eh?  \n\nI ordered the 3 Pc dinner + 6 piece nuggets (they gave me 7!)  After my first bite of each... I felt like I was floating in the fatty plains of glutton heaven!\n\n4 Stars for delicious chicken and good line management even considering the circumstances.  I won't be eating here for awhile though...", "author": "Johnson N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-09", "description": "An Afro-american woman accompanied by four children tried to order four orders of the Tuesday 2 for 99cent specials, but was told that there is a \"two per family limit\". Since there was five in her party, did the employee expect one of the kids to just watch the other four eat? I then intervened & offered to let her use one of my \"two per family limit\" so that she'd end up w/ six pieces. I ordered one order for myself. \n\nThe cashier glared at me for assisting the woman & retaliated by making me wait for my order. When the woman (who was dining in store) asked for some kind of plates that the kids could eat off of, she was charged 25 cents each. Another customer also asked for sauce & was levied 25 cents each. Popeyes claims they do not charge for them, so I assume the cashier was pocketing the money.\n\nAnyhow, long after the woman's orders were filled, I asked where mine was. I was told, \"Still waiting!\" After about 15 minutes, I got impatient & asked again. The cashier pulled my order which was sitting on the side (NOT under the heat lamps) & shoved it towards me. It was of course, no longer hot. I confronted her as to why she was playing games. She pretended not to understand then I asked for her name & a contact number. She refused.She openly boasted that that is an independently-owned franchise & that even if I complained, it'll never get to corporate but to the owner, who will side w/ her.\n\nIt turns out she was correct. Although I've called the 877-767-3937 number, I've never been able to speak to anyone to address the problems in this store. Problems plural.\n\nSeveral months before this (when this location did not participate in the Tuesday special & briefly touched on in my original review), a woman physically assaulted another woman in front of her toddler right where the register area was. I was astonished when the employee not only did not care about the safety of the customers (especially the little girl) & refused to even try to ask them to stop, much less call the police. She merely told them to move aside so she can take the next person's order. Making money superceeds public safety?...\n\nI called the police & the woman ran off. The cashier said it was none of my business & refused to give me any information. I called the next day when it was another shift & got a number of supposedly either the owner or the manager. I left several messages & NEVER received a single response. That tells me that this location's ownership/management not only doesn't care about public relations or worse, condones the employees' actions. \n\nOne of the employees put it, \"Your kind will still buy chicken\". Since it's in a predominantly minority area, that comment borders on racism & demonstrates her appalling hubris. She even went as far as to say that most of the customers can't even use computers & the phone line directs most options to the internet. The later which is true. \n\nI strongly recommend AGAINST going to this location, but love Popeye's chicken. I do however, strongly recommend the one on 22nd & Mission. Besides, they do not limit orders, have a restroom, & has free refills.\n\nSanta's Yelper sez: \"Stay away from this location! Go to nearby KFC, Safeway Deli, or the Popeyes on 22nd & Mission!\"", "author": "Tadashi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-01", "description": "post oral surgery and starving because you can't eat anything?  popeye's with mashed potatoes hits the spot.\n\nand go on tuesday, it's like $2.50 for 2 pieces and a side!  that's practically free!\n\neasy parking in the safeway parking lot makes this a much better location then the divisadero street one.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "Boy, when I crave something, I just gotta have it.  Growing up in Brooklyn, I was introduced to this fast food restaurant at an early age.\n\nPopeyes Chicken & Biscuit rocks and makes KFC appear a distant second.\n\nOne bite into the tender chicken, the crispy crust shatters making the start of the marathon.  A mixture of spices that is both savory and pungent makes my mouth water as I write this entry.\n\nFlaky biscuits with the comfort food tones of butter hug the senses.  Trekking along the comfort food path, rice and beans finish the meal.\n\nLocation: there is a parking lot", "author": "Rayfil W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "2Pc Chicken (leg and thigh) for .99 cents on Tuesdays!! WHAT A DEAL! I've been here every Tuesday for the past month and will continue to go. You can choose spicy or mild. Don't forget to ask for the Louisiana hot sauce. Take it home and eat it over some Eggo waffles w/ a beer. Home made chicken & waffles!\n\nTheres always a huge line at all times on Tuesday's but it goes quick. There is a 4 order max per person so I usually order 4. Also, check your order after they give it to you. They've shorted my order 3 times out of 4 already.\n\nIs it Tuesday yet?", "author": "Gary K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "I love ghetto food. Biscuits, mashed pataters n gravy, and friend chicken all make for a solid, inexpensive meal. I come here once a month or so when I'm doing some grocery shopping at Safeway. I know it's not good for me but it's nice to eat some greasy but tasty food every now and then. Highly recommend this place. The cool thing is that you get more options in terms of fried meats. Unlike KFC, you also have some seafood options.\n\nIf it weren't so unhealthy, I'd give it 5 stars. \n\nExpected bill: $6", "author": "Tushar K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-08", "description": "For a quick fix of fatty fried goodness, the chicken biscuit sandwich for $1.50 and a side of small fries works wonders.\n\nThe batter is flavorful and I haven't detected a whole lot of mystery chicken-related material, only meat and batter.  Since KFC went and changed their biscuit recipe, the biscuit at Popeye's wins over KFC's hands down.   The cajun fries are flavorful and have just the right amount of kick.  Red beans and rice aren't bad either.\n\nAs far as complaints about the customers go, once you enter the door it's all about the chicken.  I've never experienced any weirdness here, people are generally very polite and no one has ever been rude.  Since that's all I care about when getting food, I couldn't care less about any extracurricular pharmaceutical sales going down at the plaza or in the parking lot, much less anyone who asks me for money (even if they're standing right outside as this tactic makes it far less likely that I'll give them any).  \n\nThe only reason I'm giving 3 stars as opposed to four is due to the slow service.  For whatever reason, it takes a really long time to get your food at this location.   If I were in a big hurry, I'd probably head to Burger King or even Safeway before getting something here.  However, the wait is usually worth it if you're not on a deadline.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-26", "description": "Husband got food poisoning from this location!  They are unsanitary, dirty, and EXTREMELY rude!  It is so gross inside I am surprised it's hasn't happened before.\n\nI have been to this location several times because I live close by.  Every single time that I have gone, they have messed up my order, and are rude when you correct them.  It's not my fault everyone who works there doesn't understand english.  My last time there I ordered chicken tenders, and they tried to charge me for chicken sandwiches, and when I corrected them, they conveniently stopped understanding english again.  So after 3 minutes of trying to explain, and with a long line behind me, they copped an attitude with me even though it was their mistake.  They made me wait longer for my food than the people who were in line behind me, which is a long time because they are very, very slow!  Of course my food was cold.  I have not gone back to this location since this final straw!\n\nI am a huge fan of Popeyes, and from now on I will go to the one on Divis.", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-06", "description": "hey you! yeah, you! you hungry? DON'T GO HERE. ESPECIALLY ON TUESDAYS. why? BECAUSE THEY WON'T HAVE ANYTHING FOR YOU TO EAT.\n\ntime and time again, my roommates and i (we live across the street, mind you) go here expecting to get us some fried chicken, only to find empty pans with small crumblings and morsels of what our mouths water for every tuesday because of their two piece deal.\n\nand even when there IS chicken left, be sure to have a lot of time on your hands, because you'll be waiting a LONG time before you even get to the register. like think disneyland line long. i am NOT kidding you.\n\nmy advice? cluck your way next door to safeway and get their fried chicken. not as tasty, and this safeway has their own issues (you can read all about them in my review for safeway), but at least you'll be able to get something to satisfy your fried chicken cravings.\n\noh, i forgot, HORRIBLE service. like HORRIBLE.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-02", "description": "I eat popeye's every so often...  \n\nI saw this this spot had a leg and thigh for 99 cents.. and you know it was on!!!\n\nbusy as usual.  \n\nfood was the biz!!", "author": "Roger A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-02", "description": "What would be better for dinner after a nice Dim Sum luncheon with some fellow Yelpers than some greasy fried chicken!  LOL!  This is only my second time trying Popeye's and at this location.  I'd say definitely better than KFC but I like Church's better.  The cajun mash potatoes weren't bad but didn't like their coleslaw much...prefer KFC's coleslaw.  The biscuit was good but I think I like the honey biscuits from Church's better.\n\nAs far as the location...kinda sketchy...noticed a few questionable people hanging around the Safeway parking lot of the complex where this Popeye's was located.  Advice: park close, order quick, hurry home.", "author": "Rick P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-03", "description": "I love the chicken here. \nI love that parking is super easy here.\nI love that I can walk to Jubili for my super healthy desert after my super fatty meal.\n\nI hate the ghetto crowd. The 5 minutes that I stand in the store waiting for my chicken, 3 out of 5 customers that walk in here make a scene. They should just shut up and eat their chicken.", "author": "Ervinna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "Serious props to Popeye's for making some damn tasty chicken.  Screw KFC when Popeye's is near.  \n\nLove to you Popeye's!!!  Not the best chicken I've ever had, but way better than most chains.", "author": "Ke-Bear Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-09", "description": "There isn't much of a restaurant selection in my immediate area, so when I'm in a rush I often have to chose between Burger King, Subway, and Panda Express.  Sad, I know...\n\nAnyway, today I was in a rush and somehow couldn't stand to eat at any of these places again... and then my roommie suggested Popeye's.  Chicken!  Biscuits!  Fast food, but yet, different from the other fast food... so we went for it!\n\nLocated around the corner from Fillmore Street, hidden in Safeway's parking lot, the sidewalk and surrounding area was dirty - but I'm used to that from going grocery shopping there, anyway.  The place itself was clean and not even too sketchy.\n\nService was a little slow, but at least the workers seemed very friendly and relaxed, making sure to get everyone's orders right.  The food was definitely higher quality than regular fast food.  You get a lot of food for a very low price, and it's comfort food - who doesn't love biscuits?!  I especially like the fries - much better than any of its fast food competitors.\n\nAfter finishing the meal, I actually had resolved to give Popeye's 4 stars.  That is a very high rating for a fast food place in my view.  However, a few minutes later I noticed the roof of my mouth was still filmy... how mysterious!  Was it from the juicy crunchy chicken skin, loaded with preservatives?  Perhaps from the chemical \"buttery\" biscuit?  I'm not sure, but it definitely changed my pleasant experience into a slighty disturbing one... a filmy mouth is one thing - I just hope my arteries are still in tact :(", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-03", "description": "Popeye's is the greatest Place on Earth.\nNothing beats the ambiance in this place and the people watching is unmatched.  They give you all the Cajun Sparkle you want if you ask real nice.  \nYes folks Popeye's rules.  I like the mashed potatoes and gravy.\n\nThe last time I was there, someone came in and asked for coffee. They got laughed out of the place by all who were there. Who goes to Popeyes for coffee?! You go there to get a catfish Po' Boy with coleslaw.\n\nIf you have to take a dump you need to go to Safeway.  And you WILL.", "author": "Vanessa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-24", "description": "Sure, its junk food. But as a former fried chicken shop employee... there were just a few things that weren't quite, er, right.\n\nBefore I go into my whiny self... just want to clarify that the meal tasted fine. Just like any other Popeye's. Grease yet fluffy and very satisfying. The fries rock as usual.\n\nMy gripe is with the store - there were 3 staff on, myself plus one other customer in the store... and it still took 5 minutes before someone took my order! This is not fast food.\n\nSecondly... the chicken. It taste good. BUT they didn't clean the chook pieces before frying. There was battered and fried feather on my wing piece. Also the under side of the breast piece was not cleaned so a lot of the gut was still on the piece. Hey it might sound picky - but it was my job to wash, plug left over feathers and remove the gut in my teenage job.\n\nWill I go back? Probably. Just not anytime soon.", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-05", "description": "I love popeye's chickens....to me they're way tastier than KFC.  \n\nBUT....the manager at this location is super ANAL.  I ordered a takeout of one large mash potatoes with gravy and of course their chickens.  The mash are served in a large cup (serves 2 to 3 persons) with about 90% mash and 10% gravy.  I wanted 50% mash potatoes and 50% gravy (their canjun gravy is the best).  The manager said no!  I said I'll pay the extra whatever for my 50/50 order.  She still said no.  HUH?!?!  Ok...fine.\n\nThen i asked for two cups and two fork-spoons for the mash potatoes and gravy. (I'm sharing with my grandpa at a hospice).  She said cups are 15 cents each.  Unbelieveable!?! \n\nThe servers at the Geneva location are much nicer.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-02", "description": "Quick and Tasty\n\nI got the chicken biscuit for 1.40 \nand a small fries\n\nThe fries are soooo tasty. Much better than other fast food joints\n\nI would give it five stars if they wouldve offered my ketchup or other sauces. But I had to go back and ask for some.\nI didnt bother asking for other sauces because those wouldve cost me 25 cents. \n\nOther than that. the food was delicious.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-20", "description": "One of the other reviewers was right.  This location has some CRAZY customers.  We were waiting in line, when one of the other patrons was making disgusting puking noises.  I don't think he really did vomit, but I didn't bother looking.  He was probably just craving attention.  He apologized about causing a mess that the workers there would have to clean up.  I don't think there was a mess, but either way, pretty gross, when I'm about to order my dinner.  This was my first ever visit to a Popeyes, too!  \n\nSurprisingly, they have fish and shrimp on the menu, too.  I ordered the 2 piece spicy chicken and 2 piece fried catfish (I think that's what the fish was) meal, with a side of red beans & rice.  Back at home, we got to enjoy the meal, away from nutzoid customers.  The chicken wasn't super spicy, probably so that anyone could handle the heat.  Both the chicken and the fish were pretty crunchy.  The red beans & rice were good.  I had a taste of the mashed potatoes and gravy, but not enough to determine how good it was.  I think the biscuit was pretty standard, nothing special.\n\nI would go back for more.  This is a different type of bird from KFC.  Definitely isn't as good as Powell's Place.  But when you're desperate for fried chicken to go, there's not much to choose from in SF.", "author": "CE Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "I like popping in here for a quick piece of fried goodness before shopping at Safeway, catching a movie at Sundance Kabuki or just putzing around with a random ex who likey the fried chicken. It's fun to watch people get uptight because Popeye's is technically 'fast food' but it's made to order so they get as antsy as crack addicts looking for the next fix. \nI for one, am delighted that the breast, thigh, leg I am eating hasn't been lying around under a heat lamp just withering away in lonliness.\nHands down better than KFC, but these days I find myself enjoying fried chicken sitting down at a table with a cloth napkin and a glass of wine, go figure.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-23", "description": "There's a Popeye's on Divisadero & it proves a 5-star restaurant compared to this dump and the poor attitude of it's employees! I waited 15 minutes for chicken & asked what the deal was. \"Mo\" the female clerk that rang me up just looked at me clueless, she couldn't even tell me what was going on with my order. Her manager \"Robert\" wasn't much help either. Their attitude was like they hadn't done anything wrong. They just got very defensive. And all the sides they offer, such as the green beans (which has it's own special sign) they were out of! They weren't even busy and yet they managed to screw up my order! This is the kind of establishment that Madea would drive her car through & I hope the staff is replaced soon. I don't know what kind of jobs they should have - but it's not in face-to-face interaction with customers. If you receive bad service, speak up, complain to corporate - ignite change. I know it's just Popeye's but if it is JUST Popeye's how difficult can fast-food fried chicken be? These employees don't need a degree, but they do need basic customer service skills!", "author": "Jules F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-19", "description": "Popeye's has some of the best fried chicken around.  Much better than KFC and on par with Church's.  This location does get its share of weirdos coming in to buy like one wing or a biscuit, but in general the place is safe.  The decor doesn't feel that warm, so prepare to probably want to take your food to go.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "Do I really need to review Popeyes?  I can't resist fried food and fried chicken is ones of the best fried foods around, lol.  I usually only go when they have specials like 2 piece leg and thigh for 99 cents, 8 piece mixed for 4.99, or 10 piece mixed for 9.99.  Their fried chicken is tasty for fast food, but if I had to choose between them and KFC, I'd pick KFC original style anyday.  I think it's because I like the original KFC over Popeye's crispier, but slightly drier chicken.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "Oh, Popeye's ... namesake of the Popeye's Gulch neighborhood of San Francisco (don't you DARE call it 'Nopa'!) ... purveyor of super-cheap two-pieces-for-$1.29 specials on Tuesdays ... provider of awesome cajun rice and rice and beans ... the sole fast food joint which it is acceptable, nay, desirable! to have in my neighborhood ... better than your average fast food, for sure, and the perfect hangover remedy when you're too broke to go to the ribs joint. Popeye's, don't ever change.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "I don't care what all of you say, 4 stars for ultimate junky greasy fake to the max food. Yes it was fulfilling, yes I felt like a pig afterwards, but hey we only live once right? \n\nI think this is my new spot, sorry KFC..I think I found a new love. They had a special of 10 pieces for $9.99 which was a deal, since normally 8 pieces is $11-12. Spicy or regular? Heck yeah, I spiced it up! To my surprise it really wasn't that spicy. They have sides such as mashed potatoes, red beans and rice, fries, and mac & cheese. I decided I had a craving for mac & cheese...fake as can be, but yummy! \n\nService wasn't bad. Walked in, and got help right away. I was thankful since we initially ordered the 8 piece, but he pointed out the 10 piece was cheaper. Yay! \n\nAs for the place itself, probably not the place to eat. I dont even remember there really even being a spot to eat at. Not the cleanliest  or nicest neck of the woods. I suggest take out! \n\nWell 4 peaces later,  I was pretty satisfied & full. Oh, popeyes you now hold a place in my heart for my junk food melt downs!\n\nAND p.s. yes i did say \"4 peaces\"...it was peaceful ok? :)", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "The chicken in this place is delicious. The chicken is not the problem.\nThe location is horrible. If you've never been to this location, near Webster Safeway, don't go. There are usually 1 or 2 smelly beggars right next to the Popeye's entrance. There are also one or two guys across fromt his place who will be selling bootleg DVDs or clothes. Its shady, so be careful when you go.", "author": "Monkey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-14", "description": "BEST CHICKEN EVER!\n\ncatch me here during lunch hr. i'm always the one asking everyone in the office, \"wanna split a bucket of popeye's??\"", "author": "miss b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-12", "description": "In need for some fast, greasy food that's close to home.  Well, sadly, this is it.\n\nI'm not a huge fan of Popeye's, but it fits the bill when you're in a rush.  The people who frequent seem to be a bit shady....man, even the pigeon that was walking around inside fishing for anything was looking rough...(and yes, I did worry about how sanitary it was to have a pigeon in the restaurant...but I tried to push that out of my mind...)", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-31", "description": "Sometimes, you just need some deep-fried crispy breaded chicken bits, cheap and fast.\n\nPopeyes' is one of those places to go for this, maybe also Church's. It tends to be like the busses for the Jerry Springer and Cops Guest Show Convention broke down in front - overfilled with people you wouldn't want to look in the eye. And everything is sticky with chicken grease and spilled condiments. So take your food to go.\n\nUp until now Popeye's was the only place to get good fried chicken around there. But just down the street, a bonafide New Orleans fried chicken joint recently opened... and they've been having a special \"50% off your dinner\" promotion. Perhaps this spells the end for this Popeye's fried stranglehold over the vicinity...", "author": "Clar L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "Oh Popeyes, how I love thee! Sorry it took so long to write a review for you. Ever since moving into the Fillmoe Center I have been a frequent customer at this fine establishment. After a long game of futbol last night, I was way too tired to cook, and paid my good friends a visit just before closing time. The kitchen was shut down and they were only serving the breasts and thighs that were already cooked. The main guy who is here most nights welcomed me and I asked if they were still cooking anything.. he said No, but knows I am a big fan of the #7 combo with the chicken tenders (spicy of course). He asked if I wanted the strips and I gave him confirmation. Other people who came in right after me did not get this offer, they were only given the option of the food that was already made. So I guess you could say I'm kind of a big deal... but seriously that was awesome service, thanks guys!\n\nThe food has always been very fresh and tasty. I usually order the strips, which they cook for you when you order them; unlike the chicken pieces, which are pre-cooked and might be sitting out for a bit. I will say that I was unhappy with an order of the crawfish one time, but let's let bygones be bygones. The mashed potatoes are excellent, along with the cajun fries. I highly recommend asking for some honey and strawberry jam to go along with the biscuit.\n\nThe only request I have is that they offer an online delivery service.. honestly some nights I just don't feel like walking the half-block or so. Keep cooking a mean bird Popeyes, I will see you soon!!", "author": "Gregg K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-24", "description": "I lived near here and came on occasion for some good spicy chicken and red beans and rice.  The food and service was fine.  The one consistent problem I noticed here are crazy customers!   Here is just one example - A lady dining in was yapping away complaining about this and that at the top of her lungs.  After another lady got her order she scolded the complaining lady and told her to shut up and walked out the door.   Then when the guy in front of me ordered, he commended the cashier for working here and having to deal with this kind of stuff every day.  The cashiers eyes just glazed ahead.\n\nUpdate:  So here we are 7 years later.  I've been back a handful of times and it's practically guaranteed something interesting will occur.  My last few visits featured customers arguing with the staff about how they want their food as if this was a restaurant and there's a cook in the back ready to prepare their meals as requested.  Funny stuff and the food is still decent so I'm increasing my review to 3 stars.", "author": "J M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "Grimy dining area, slow service and nasty food. My stale-tasting chicken wings still had feathers in them. The tiny place was also full of thugs and dirty derelicts from Safeway's dangerous  parking lot. No more of that dump for me.", "author": "Pam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-28", "description": "First, I need to apologize to my doctor. Yes, I tell him, I am working on eating better. Yes, I tell him, I'm especially trying to stay away from fatty foods.\n\nMy next pit stop after I walk out the door of his office is just across the Safeway grocery store's parking lot - the only Popeye's Chicken & Biscuits restaurant that is somewhat near downtown (granted, JapanTown is no hop and a jump from downtown - especially with all the characters who ride the MUNI 38 and 38L buses). Sorry doc, but I just cannot resist that once in a blue moon chance to get some of Popeyes crispy, spicy (just mildly) fried chicken and that lovely tasting cajun rice.\n\nThis location has easy parking (thanks to the grocery store parking lot). The help inside is hit or miss - but it isn't about the help at fast food joints for me - not really. They have a bag with the goods in my hands within 5 minutes, and that's what I'm there for.\n\nYou may need to hurdle over a vagrant or dope head while visiting this Popeyes, but the food is well worth it if you enjoy good 'ole southern fried chicken. Yes, it is greasy. Yes, it is about as fatty as it gets. Just remember that this stuff is only meant to be enjoyed once every few months - not daily or even weekly.  I'm glad I don't live near Japantown to test my willpower on that point.\n\n5 - stars totally based on the good tasting food and quick turnaround. Everything else about this location is average or worse.\n\nEnjoy! And definitely give the cajun rice a try!", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-12", "description": "To hell with the Chicken and biscuits! \n\nIt's all about the mashed potatoes. Those luscious lumpy potatoes coupled with nondescript meat based cajun gravy are good enough to make me ignore the fact that there are people blatantly dealing drugs outside of the establishment and the fact that I am always heckled by a homeless person on my way in and out of this location.", "author": "Clarissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "compare to other fast food, this place is great! the spicy crispy chicken is so delicious. the biscuit is also good. easy parking.", "author": "Allentine T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-28", "description": "I love Popeye's Fried Chicken but I agree with another reviewer that this is somehow the worst of the SF locations. Whenever I go there the service seems very slow. In addition, this one has minimal seating.", "author": "H K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-12", "description": "Now, I've frequented the other Popeye's locations numerous times, but I have only been to this one once.  While the location is rather convenient (located in the Geary/Fillmore/Japantown corridor) and parking is ample, I did not have a good experience with the actual product.\n\nThe chicken was not piping hot like at other locations, and seemed to have a more than usual amount of standing grease on the surface (a la KFC).  I found the \"spicy\" rather lacking also.\n\nI have a spot in my heart for fried chicken and if I'm ever in the area and have a craving for it, I might give it another shot, but for now I will just stick to the other locations.", "author": "Warren W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-30", "description": "This location SUCKS...the employees are IDIOTS...\n\nLet me help you morons out -English is my FIRST language.  When you have a sign up saying that for $8 you can purchase 2 large sides & 4 biscuits with ANY meal, know that I know ANY means I can pick a 2 piece combo & order this.  HOWEVER, these IDIOTS try to convince me that you have to order this with one of the large 10+ piece meals...just because you've decided to tape this to a 10 piece chicken meal sign doesn't make it so, Tonto!!!   After a 10 minute argument about the definition of the word \"any\", I say screw it & place the rest of my order; once I get home, I see that they haven't given me my soda or one of my sides.  I went back as usual the following Tuesday, at which time they gave me what they missed on the previous occasion but managed to forget my red beans & rice...wth?!  I again didn't realize this until I got home; I called the store & let them know, & the Filipino manager told me that I could pick it up the next time that I came in.   Fast forward to today - Arthur, the lil Mario Brother-looking so-called manager, tells me that he can't honor my request because he didn't know anything about it...yet ANOTHER phone call to customer service...we'll see what lame azz excuse Henry (I'm assuming the owner?) comes up with for his sorry azz employees this go-around...every time I come here, at least 1 customer has an issue with something they've managed to jack up; say it with me...it's not us, it's YOU!!!\n\nShould you crave Popeye's, go to the one on Divisadero or the Geneva...more expensive, but way less hassle involved with what's supposed to be FAST food...", "author": "Amoura B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-20", "description": "almost 25 minutes to make 2 sandwhiches...service is terrible...nuff said.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "I love those foods that'll give you a heart attack. I always have loved Popeyes and for some reason was really craving it one day. This place did not disappoint since the spicy chicken and cajun fries were fresh and right out of the fryer. Yummy!!! Price was reasonable. And yes, as other people are saying, Take advantage of .99 cent Tuesdays!", "author": "Helen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-13", "description": "thick battered...crispy fried chicken....always best in the shadiest of neghborhoods....panhandler by the door.....check.....popeye's chicken...grubbin' fried chicken....yet...biscuits dry...dirty rice good.....mashed pototoes watery.....coleslaw creamy.....go for the gold...golden fried chicken....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-13", "description": "I wish I could give this place -5,000,000 stars. I paid Popeye's money for some grub, and in turn Popeye's gave me samonella. Awesome.", "author": "Paige C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "for some reason..\ni love fried chicken..\n\ni like this location...\nprobably because i've lived close to here all my life..\nthey're always super nice.. and this place beats the KFC that's like 2 blocks away.. \n\ni have a weakness for deep-fried ANYTHING..", "author": "monica c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-12", "description": "For what it's worth, another data point:  This location refuses to accept coupons:  I went to the Popeyes website to locate the restaurant (sic) and it showed a coupon for a free 2 piece dinner, if you purchased a 3 piece dinner and 2 drinks (yes, I know, don't say it!)... anyway, before placing my order I handed the print to the cashier, she acted as if she couldn't read it and called for the manager(?) who declared \"we don't accept this.\"  What's the point of linking to a coupon *FOR THIS SPECIFIC LOCATION* if they don't accept it?  Will probably go to KFC for my dose of greasy fried chicken skin next time...", "author": "Darrin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-31", "description": "Three stars only because it is fast food, but damn if it is tasty!  If I could choose KFC would lose.  This particular Popeyes has BANGIN mashed taters and gravy.", "author": "Red F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-19", "description": "I love Popeye's, but I hate this location. For some reason there is always something wrong here. Just recently I went to get some lunch and the whole store was almost completely filled with smoke. When I finally placed my order the guy told me that they couldn't cook the mild chicken with the spicy chicken because that was the cause of all the smoke... WTF!!!!! They always screw up with the orders here as well.", "author": "Rommel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-11", "description": "There is a God.  This place makes the BEST fried chicken, despite the fact that it is fast food.  Sure, the area is a little shady, but the easy parking and awesome gravy clearly make up for it.  Minus one star for changing their biscuits from the cone-shaped ones years back which were a lot crispier.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "This place is the shit.  Their chicken is hella good, the staff is cool, and the prices aren't bad at all.  Can someone tell me why some stupid ass restaurants try to sell a 3 piece fried chicken plate for $20+??? Man, f- that.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-11", "description": "Do yourself a favor and go to the Popeye's on Divisadero instead. You'll save yourself a lot of trouble, even if it is harder to find parking. If you feel like some adventure, though, try taking in a coupon and seeing if they understand how it works.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-11", "description": "This is for my fried chicken list. Ok, I admit, I do eat here. I generally scowl upon fast food but sometimes you need a fast fix! No way will I go to KFC. Popeyes is always consistent and yummy and cheap. So, it gets my yelp and addition to my fried chicken list. Sometimes you just need fast food. Keeps you healthy. hehe.", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-03", "description": "Best Red Beans and Rice!!!!  The chicken is ok....way better than mine ...but I am working really hard at that....but the Red Beans and Rice are wonderful! My new comfort food...oh..and the bisquits.", "author": "Nancy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-29", "description": "I love Popeye's Chicken, but this location is shady as hell.  The only good part is the parking lot.  A rarity in San Francisco.  I do love their fried chicken and popcorn shrimp combo though.", "author": "A L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-16", "description": "Can you say 99 cents for a drumstick and thigh?  What a deal!  And the cole slaw is good for $1.69 and the biscuits are 69 cents each.  Two of  us for dinner less than $7....choices are spicy and mild.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-28", "description": "This place is super yummy, though the neighborhood is more on the down/scary side. The price is very reasonable, but the service is pretty bad. It takes forever to get your food, but other than that I advise people who have never tried it before to stop by.", "author": "Marina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "This place is much better than KFC. Too bad spicy was all out and had to wait 10mins for the next batch. This place is really small, there's practically only a few seats. On the day we went there was a long line and boy did we have an experience. The 64 year old grandma behind us was talking really loud with her bluetooth headset. How do I know she is 64? Because she was talking really loud and everyone knew it. When it was her turn to order, she pretty much laid on the counter and had everyone wait until she finished her phone conversation before she ordered. When she ordered, she wanted to sub a thigh for a wing but the worker said she couldnt sub the leg and thigh special. The grandma then slammed her fist on the counter and said I'll pay for this mother f---ing sub. The whole time she was talking really loud and everyone was watching. Funny thing was, the worker was calm and acted like this stuff was normal. She then ordered the worker to take out the thigh and just give her the leg. One word says it all here, \"hood\".", "author": "Norton W."}
