{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Such a fun activity on a Sunday! So much green grass sound to sprawl out and enjoy an afternoon. Transportation here is super easy and accessible with the presidigo buses which operate free on the weekends! \n\nThis is a super family friendly event but can be enjoyed by all ages. There are TONS of food options to choose from so it's definitely something you will want to keep returning to and try a new vendor. I got the vermicelli from the Vietnamese truck at the very end and it was delicious.\n\nAs a vegetarian there are tons of options given the vast array of food trucks available and you will find almost every cuisine as well.", "author": "Rachel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Beautiful location, great food, few lines.\n\nJust a very well run food event.  Will come back.", "author": "Troy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "On Sundays from 11am-4pm, Presidio has an event where food trucks come to serve their delicious food. There is also bars and music arrangements as well. In the same park area, there is the Walt Disney house for those who like to tour. For individuals that like scenery, there is a beautiful view of the bay at the park. Parking is very difficult if you don't arrive early. We had to park outside of the Presidio entrance and walk all the way down to the park itself. There were plenty of hiking and running trails if you wanted to check them out.\n\nLines are numerous for the more popular food trucks such as Hotwings. However, you don't have to buy food from the trucks, you can always bring some picnic food. I saw many families there with their own food, saw one family with KFC! Its a great place for families and kickbacks, as well as, work functions. If you're ever in the city, this place is a must for Sundays.", "author": "Carter D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "What a concept! I'm not sure how long Presidio Picnic has been a thing, but I came for the first time back in April. The sun was shining, a little bit of wind, but it was still a beautiful day for a picnic. \n\nDogs are welcome, it's a great time to just kick it with the homies and grab some seriously good grub. The grass is lined with food trucks from near and far in the bay...I tried Senor Sisig for the very first time (I know, slacking) and Hot Bird fried chicken. The food trucks that share their delicious eats rotate every weekend! So it'd be worth it to visit whenever you can. \n\nParking can be a hassle, lucky you if you snag a free spot. But there are lots where you can pay an hourly fee/all day parking that are just a short walk to the picnic site. \n\nBring a few blankets to sit on, your own dranks, maybe a speaker that has volume strong enough just for your little area. \n\nA few people go around doing a $ polaroid service, which I thought was a nice touch. Because not everyone owns polaroid cameras, so if you are willing to buy one of your group - you'll have a small token of remembrance. \n\nDefinitely check their website to see dates and if there are any special things happening!", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "2018 Presdio Picnic is every Sunday (Mar 18 - Oct 18); Hrs: 11am- 4pm\n \nWhen the sun is out and there are clear blue skies, there's no better way to spend a lazy Sunday afternoon soaking in the sun, picnicking with friends, and scouting out the best food from the widespread selection of food trucks & stands. It's family & dog friendly so bring the whole crew!\n\nShow up early especially if you have a larger group as it can get pretty packed and you don't want to end up sitting next to the food truck where there's a lot of foot traffic. For an open lawn, it's definitely cleaner and nicer to lay on compared to Dolores Park. People bring everything from yoga mats, blankets, camping chairs, Lamzac air loungers, umbrellas, and even tents. There are a few picnic tables but those tend to be taken up rather quickly. While sunny.. it does get a bit breezy from time to time so do bring a light sweater in addition to your shades & lots of sunscreen.\n\nAs for food.. bring some picnic food if you'd like or just go from food truck to food truck trying everything that looks delicious. There's a wide variety of food options enough including wings, ceviche, chowder, acai bowls, baked goods, ice cream and cuisines ranging from Mexican, Vietnamese, Filipino, Korean, Mediterranean, etc. There's something for everyone whether you're craving an elote, want to crack your own coconut juice or get a savory muffin from Craftsman & Wolves. I'm still baffled by how that soft boiled egg is cooked inside of the muffin!\n\nThe portable restrooms located by the parking lot are rather clean.. there were about 5-6 stalls in the ladies room so the wait wasn't too bad. Parking is metered (yes, even on Sunday) so you might be better off grabbing an Uber.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "The best way to spend your Sunday with family and friends on a sunny day in San Francisco! We were visiting from Honolulu and our friends invited us to join them for a day at the Presidio for a food truck picnic. We took a Lyft to the park and were blown away by the number of people sprawled out on the lush green lawn with blankets, towels and chairs. I loved how many families with small children were there enjoying the sunshine and fresh air. \n\nI was impressed by the organization of the event which consisted of food booths, food trucks and multiple cocktail bars on the lawn. A wide array of food choices from Asian to Italian to dessert! Our group shared a pork belly plate lunch, hot chicken sandwich, ice cream and bloody mary's which put the Funday in our Sunday!", "author": "Emi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "A great way to spend your Sunday with friends, family, and significant other! You've got huge crowds of people chilling with their beach blankets, tents, and chairs listening to live music with tons of food options. And did I mention the view? How can you beat the waterfront and bridge view?\n\nParking isn't bad, we parked by the bathrooms for free, but it can be pretty limited. They've got portapotties on the green and is walking distance from actual bathrooms. \n\nIt's probably the best Off the Grid event in regards to size. You've got lots of spaces to claim since it's an open field and there are enough vendors so that the lines aren't ridiculous.", "author": "Patty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "This is by far the best OTG location. How can you beat the world class view as you lounge on the grass all day? I can't imagine a better lazy Sunday in the sun... and even when Karl shows up I can turn that frown upside down with a mango rose. Music, drinks, games, there's something for everyone, including kids and pets. Feel free to bring your own picnic - but it's almost a shame with the likes of Senor Sisig, A16, Del Popolo, Craftsman and Wolves, and the list goes on...", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Went here on a Sunday morning during Fleet Week.  Family had a great time.  Food was good and crowd was very polite.  Blue Angels were awesome too. Would love to go back again.", "author": "Bruce T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "After hosting a dinner party at home for 7 people on Easter Eve, I wasn't going to host another party or cook on Easter. I decided the hubby and I will just spend our Easter at Off the Grid's Presidio Picnic. It was a warm sunny day in San Francisco, so the picnic idea couldn't have been more perfect. We brought our camp chairs and picnic blanket, and parked ourselves on the lawn with an amazing view of the Bay which was dotted with sailboats and kite surfers. \n\nPresidio Picnic is the best OTG event and on Easter the attendance was almost to capacity. That huge lawn was filled with couples, families, and small and large groups of friends. People brought their dogs too. Make sure to bring a hat, and camp or beach chairs or a picnic blanket if you're gonna stay a while. People also brought their own or rented tents for shade from OTG. \n\nThere were lots of great food vendors that day, but we only got food from 4 vendors throughout the 4 hours that we were there.  We started with a plate of fried chicken from the Wing Wing Fried Chicken booth which we shared. Omg that was the best fried chicken I've had in a while! The hubby described it as flawless. All 4 pieces (wing, thigh, drumstick, breast) were moist, flavorful and perfectly seasoned. I was so surprised the breast was moist too. The chicken was crunchy without being heavily breaded. It was actually light. \n\nAn hour later, we each had a plate of the Lechon with rice and salad, and some lumpia from The Jeepney Guy. The lechon skin was crunchy and melt in your mouth goodness. That plate was enough to keep us satiated for a while. For dessert, we shared the Cookies and Cream sundae from Bi-Rite! It was just enough satisfy our sweet tooth. \n\nPresidio Picnic has a bar if you need some libations to go with your food. You can get beer, wine, Bloody Mary, Margaritas and Mimosas. I got a Margarita and it was really good. It's a little pricey at $12 but hey it's convenient. \n\nIf you want to get a good spot on the lawn and parking, get there early! The lawn filled up nicely after noon or so. The fancy port a potties were really clean, and the compost, recycling and trash bins were regularly replaced to prevent overflow. This is a very well run event, so I would definitely come back again for a picnic. I can't think of a better way to relax and people watch on a warm Sunday afternoon!", "author": "Hazel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "We came to Presidio for the first time and it's nice to see people in the park. There's music, kids playing with their dogs and playing mini soccer. There's a lot of food trucks. It's hard to pick one because all of their food  looks good and there's a lot of choices. Finally, I got the korean chicken with kimchi and green onion and my kids got the grilled cheese. Before going here, we went to see the Wood line nearby.", "author": "Judith S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "Been coming here for OTG for a while now. Some food vendors have changed year to year, a few staples like Del Popolo are still around, but it's still pretty much the same. A few dessert options, fried chicken, burritos, fries, meh. Good news is they've added two refreshingly different trucks: Ruru serving fruit/granola bowls and light smoothies, and  Bini's Kitchen with Nepalese momos.\n\nPeople bring their kids, dogs, picnic set-up, or just stroll through like us looking for good eats. Lines get fairly long during peak times, so it's best if you come with a friend or a few to stand in multiple lines then find a spot to gather and feast.\n\nIt's super windy from the offshore winds but it's nice to stroll toward Chrissy Field and the Golden Gate Bridge.", "author": "Lindsey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Cool spot for a picnic on a Sunday! \n\nPros: amazing vibe, good food (Off the grid), picnic, clean restroom\n\nCons: parking, expensive food", "author": "Kenneth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "This is my most favorite Off the Grid event. Imagine... Big open space covered in nice green luscious grass, while being surrounded with tent/truck vendors offering you endless of food choices to enjoy your picnic on a Sunday morning. If that doesn't get you excited, I don't know what will.\n\nMy girlfriend and I went this past Sunday to enjoy some nice sun and good food. Good food and sun there were, but it was windy and cold. That didn't stop us from enjoying what they had to offer for that day.\n\nOk, here's the long list of the food we had that day. We ordered Rice Bowl with Korean BBQ from Bombzies BBQ and yes it was the bomb! We also had the Señor Sisig Burrito and Sisig Nachos from Señor Sisig. I've had them before but for some reason it wasn't as good this time around. Don't get me wrong tho, it was still good. We also went for the Oreo Mini Donuts by Hookt and it'll for sure will get you hooked. That didn't stop us from ordering The Rebel, a couple Valrhona Chocolate Cake Donut, and Vanilla Glazed Donut with Biscotti Crumbs from Craftsman and Wolves. Everything was really good especially the chocolate cake donut. Yes.. Yes.. I know. We ordered a lot. It's hard not to get a lot when you have all these good food around you. I'd eat everything if only it's humanly possible.\n\nIf you haven't experienced Presidio Picnic, you are missing out a lot. You don't want to miss out on the picnic that everybody is talking about, all the awesome food, the activities, and just enjoying the company of others on a picnic day. OH! For dog owners, don't forget to bring them along. There are a lot of dogs with their families who are enjoying this event as well.", "author": "Dennis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "My favorite thing to do on a Sunday afternoon. It's best to get there before 1pm because it gets super crowded after that! \n\nSuch a fun outing every Sunday! Ring your own food and have a picnic or buy from one of the many food trucks, although lines sometimes get long!", "author": "Bethany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Now that the rain is gone and people are ready for some sunshine, we can finally eat and picnic outside!! If you're looking for a family friendly and mellow spot to post up on a Sunday. I've been attending this picnic for many years now and it keeps getting better every year with more amazing food vendors and beverage companies. \n\nMy go to food vendor is wing wings which is serving up some amazing fried chicken and biscuits. They also give you a side of pickles but, I buy an additional side as they are delicious. As far as drinks go, there's a great beverage vendor in the middle of the mall which I think is run by the folks at Rye in the tenderloin. They are mixing up some great cocktails and have affordable beer/wine options if you forget to bring your own. \n\nCome here and see for yourself as it's always a great Sunday!!!", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "The picnic is a great spot to get out and enjoy the weather with friends and family. Sure they've got tons of food trucks but just to come and relax on the grass is fun. \n\nIn fact, I would recommend bringing your own food and drink. Otherwise you may be susceptible to some very long lines at the trucks and bar. The longer the line, the better the food but the longer the wait! \n\nMy thought would be to bring your own food and then go try one thing as most of the serving sizes are small. \n\nThe reason I love this spot is simply because it's a relaxing thing to do outside with folks on a Sunday afternoon. We got there pretty early to grab a spot on the northern side of the lawn. I realize people want to be closer to the food trucks but it gets super crowded around you and we wanted room to spread out. \n\nUltimately your call but I would recommend the grass away from the trucks for more room.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Yes yes yes! We ran into this event on a fluke since we were heading to the Disney museum in the presidio. We were wondering what all these people in the park were doing and we decided to check it out. Low and behold it's a foodie fest! There were tons of booths, vendors of all kinds, and food trucks. \n\nWhat I liked about this area is that everyone is welcomed and its free! People would bring their own chairs, blankets, food, toys, games, umbrella, and anything else to pass the time. There was also music. I definitely felt the love and a spirit of family just walking through the park. No ghettoness/no fights, just a big huge friendly gathering.\n\nI decided to grab lunch at the longest food truck line Senor Sisig. Took 30 mins to get my sisig burrito, and it was worth it!\n\nIf you get a chance to visit, do visit! If you live in the area, you are so lucky!", "author": "Maria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "The Perfect place to have a \"off the grid\" food truck extravaganza.\n\nI found this by total accident walking my dogs here. Hey what are all these cool bright red benches?? Why are all these cool food trucks lining up on Thursday afternoon?? Yeah I'm dense like that.\n\nWelp I have been several times on Thursday evenings and Sunday afternoons and every single time has  been a pure delight: From the BBQ from Cochon Volant, Sam's chowder mobile, and Del Popolo pizza thing a ma giggy.....all excellent btw.\n\nThe vibe is very chill. People tend to be very low key and not too pushy. You can bring your own booze if you want ( well at least we have). \n\nViews of the bay are simply breathtaking. \n\nIf you can find one of the big plastic red couches....use them....they are great.\n\nOnly thing I did not care for were the mixed drinks at the bar in the middle....small minus.\n\nCheck it out on a warm Indian summer day!!!", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "LOVE LOVE LOVE this little gathering. There is nothing better than taking a walk along Chrissy field with your pup and then going around the  corner for a bite to eat at this picnic as you soak in the sunshine and lovely SF vibe. Grab a blanket, a book, your loved ones and chill out!\n\nYou can park for a small fee at the large parking lots adjacent to the lawn. \n\nI'll be taking advantage of this picnic as much as possible until it ends in mid October.", "author": "Susie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Perfect place to spend your Sunday's! Spread out the picnic blanket & bring some games to play after eating. I would definitely check the weather before coming since it can be a hit or miss but the time we went was absolutely perfect: sunny and breezy. The best part besides the food, is getting to dog watch! Haha! So many cute doggies running around! \n\nThere are plenty of food trucks to choose from. Señor Sisig was the truck with the longer line. We got there around 2:45pm and it seemed at that point people have already gotten their food so the lines were significantly shorter. Didn't get to try everything but will definitely come back soon!", "author": "Jasmine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "We came to the OTG Presidio Picinic on a whim, trying to escape the 100 degree weather of Santa Rosa.  It was a beautiful, clear blue day and it might've hit 80 during the peak of the afternoon!  View of the bay was the icing on the cake.\n\nThe grounds were pretty packed with friends, families, pets (including a cute pot bellied pig named Prosciutto) and kids. People were relaxing in lounge chairs, on picnic blankets, or straight on the grass.  Everywhere I looked, people seemed to be enjoying themselves.\n\nThe FOOD TRUCKS.  Oh gosh what a great collection of options.  We walked around before making our decisions and finally decided on a few \"basic\" choices.    Every time I saw someone with a grilled cheese sandwich walk past me, I felt the twinge to try it.  It seems so simple, a nod to childhood, but it sure did appeal. Hubby chose a wood-fired pizza, son tried Senor Sisiig's burrito, and the two of them finished off with some mini donuts.  We planned to try the garlic noodles, the empanadas and the Asian chicken skewers but our stomachs betrayed us.  Next time!   The longest lines were about a 15 minute wait.\n\nThough this seems \"simple\", I found it very nice of OTG to provide a very large water station to fill your bottles.   The water was even cold. Nice!\n\nI LOVED it.  I will be more prepared next time by bringing  a blanket and a couple chairs.  We could've easily stayed longer!", "author": "Heidi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "When people ask me what my favorite culinary experience is in San Francisco, I will often times not mention a restaurant (though Burma Superstar omg so good). Personally, one of my absolute favorite \"food\" things to do in the city is to visit the food trucks at Off The Grid; if I hear from friends that they've never experienced Bay Area OTG before, you bet I'm taking them there the next time I have a chance. \n\nIf you have ever heard of OTG before, Off the Grid is the Bay Area's very own \"food truck\" experience. All throughout the Bay, OTG will have different vendors (trucks) circulating throughout. From Sunnyvale (where I live) to Fremont, there's always trucks during different times of the year. Personally, my favorite Off the Grid has and will always be the one in San Francisco's Fort Mason - basically, for around like most of the year except winter, there's a HUGE block party every Friday near the Marina. There's always at least 15-20 different food vendors with music playing. \n\nRecently, I was able to share my love for OTG with my girlfriend at Presidio's Off the Grid (Presidio Picnic). It was actually my first time here at the Presidio Picnic and so I was pretty stoked. If I'm correct, Presidio Off the Grid is every Sunday during brunch time for most of the year. As the name suggests, this OTG is right at the Presidio (basically a park area next to the Golden Gate Bridge). Unfortunately, parking here can be rough since EVERYONE comes out (be it for the food or just to chill). And doubly bad, SF charges you for parking here. Unlike at Fort Mason, in which you can actually park at the lot or park on the street (weekends free), it's like $1.5 per hour/$8 full day and there's no alternative. Make sure you put that ticket on the dash! Also, I recommend bringing a blanket so you can sit and snuggle. Maybe also be bold and bring a tent. \n\nWhile Fort Mason OTG is all about partying at night with strangers in close quarters, Presidio OTG is definitely the opposite: here, you have a HUGE space to roam around and the atmosphere is much more chill-especially with kids and more doges everywhere. Unfortunately, there's probably half the number of food vendors. I counted around 7-8 really substantial trucks/tents for food, whereas the rest served drinks. BUT, luckily there's always a good turnout for reputable vendors. For example, Senior Sisig (omg, get this please) was there, as well as El Sur (their Empanadas are to die for). We ended up getting a burrito from Sisig (so good) and tater tots from Jackrabbit (not bad for only $5).\n\nThe beautiful thing about Off the Grid (especially the ones in the city) is the community component that gets injected into the food. Everyone knows that the Bay has the best, well-rounded people. But how do you bring them all together? Through food! At every Off the Grid, I always meet the coolest people. The Presidio is definitely no different. It's perfect for all ages. For example, if you are a child, there's little game areas for people to meet. There's even a tent with people teaching you how to bike. There's EVERYTHING!\n\nI have to give Presidio Picnic an \"omg, I'd travel 2 hours for this.\" The experience is well worth it, especially if you are in the city for a day. Sure, there's plenty of amazing restaurants in SF, but there's few that really give you the \"hands on\" adventure that OTG does. If anything, come to Presidio Picnic for the view of the city and the calmness that is basking in the sun on nice grass!\n\nHave fun and prosper, eat well and prosper!", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Best place for a variety of great foods, family and pets. Bring your chairs and doggy bags!", "author": "Narcissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Wow! As out of towners here for the weekend, this was an unexpected surprise. We were on our way to the Disney museum and had no idea this was happening. My favorite experience was when I spontaneously joined the group doing yoga on the lawn. I didn't bring a mat but the teacher was welcoming and offered to loan me a mat, but the grass was soft and the sun was warm and the ocean breeze felt amazing as I stretched & worked my way to yoga bliss. Was impressed with all the different food choices & was sad I only had room to try food from a couple food trucks - I personally had the jeepney guy's lumpia and it was so good! The sangria from the drinks tent was delicious. That view of the water and the bridge is breathtaking. What a great way to spend an afternoon!", "author": "Kezia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "A typical Off the Grid food truck gathering with the chief advantage being its setting on a huge lawn at the Presidio that allows for great scenery. \n\nBecause there's so much open space, the event can accommodate lots of people. There's a reasonable amount of paid parking all around, while getting here via public transit isn't necessarily a chore if you figure your way out via MUNI and the Presidio shuttles. \n\nAll in all, a great way to have an urban picnic of sorts.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "What a fun Easter Sunday!!\nFoodies Heaven!\nArrived at 11:30 am, parking lot is 1/3 full. \nPretty filled up an hour later. \nParking rate is $1.50 per hour or $8 entire day. \n\nBean bag toss in the middle of the lawn area. \nKids loved the game. \nClean restrooms in the Presidio Trust Building (with baby changing station ) and the Officers Club. \nRestrooms at the Walt Disney Museum is for customers only. \n\nGreat selections of variety of food. \nReally enjoyed lechon Pork belly Bao from the Jeepney Guy - plate came with two large bao and a side salad, soooo good!  My daughter enjoyed a grilled cheese sandwich for the Grilled Cheeze Guy - she said it was the best grilled cheese sandwich she's ever had!\n\nPerfect weather, scenic location and fantastic event for the entire family!", "author": "Da Wahine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "What Fun! Glad I tried this outdoors activity this Sunday!\n\nWe came here at about 2pm. Lots of people but we still found a great spot to spread our blanket and chill. We opted for different food options such as baby back ribs from Cochon Volant BBQ, pizza from Del popolo and empanadas (mushroom and spinach) from El Sur food trucks! The ribs weren't that impressive but the rest was fabulous. We also tried the mini donuts at the end which were ok.\n\nOverall a great spot for picnic with family and friends. Very family friendly which is awesome. Strong winds here so come prepared and bring warm clothes :)", "author": "Heliana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Bring a blanket and a jacket and some friends and you're good! Love trying all the food trucks, but I especially love senior sisig and the mango rose for dessert. The views are beautiful and the atmosphere is cheerful and lively!", "author": "Madeline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "I've heard about Karl the fog long before I moved the SF, but seeing it over the Golden gate and white sail boats weaving in and out of it at the presidio park still took my breaths away.\n\nThe picnic is very well organized with lots of food, drink, and event varieties. Sorted trashes in easily accessible locations. I would go there every weekend if the weather permits. \n\nTips:\n1. Bring tent/umbrella/sunscreens. This area is very sunny and white people (such as my husband, love you baby), usually gets burned otherwise. \n2. Pack your own food/drink/snacks. The prices are borderline robbery even for SF. Ex: A small lobster roll is $20\n3. If you go around peak hour (12-3), Do NOT attempt to try your luck with one of the parking lots next to the main parade ground (where the action is), you are not the first or last to think that way and will waste 20 mins trying to follow people going to their cars only to find that they are just grabbing a blanket. Try around YMCA. You have been warned.", "author": "Tata X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "I've been here a few times and it's generally a nice place to hang out with friends. Here's the good & the bad:\n\nGood:\n - when it's nice weather, it's nice to have an open area picnic where you can chill, with a nice view\n - lots of space\n - music, lively ambiance\n - many food options\n\nBad:\n - It's cold & windy AF usually. If it's burning hot in the middle of the city (like today), then coming out here is nice because it's like 10 degrees colder. Always ridiculously windy though.\n - CRAZY prices for food. I'm talking like $8 lemonades, $19 lobster rolls, $6 mango on a stick. Let that sink in. 1 MANGO. For $6. OK.\n - longggggg lines for food.\n\nAll in all if it's good weather, you got time to kill, and you have money to spend, this is a pretty chill place to hang out!", "author": "Betty M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "Although it's been months since I've been back, Off The Grid: Fort Mason is one of my favorite ways to spend a Friday night.  It's a chill and low-key activity after a long week at work, there are lots of vendors and tasty treats to check out, and, perhaps most awesomely, it's great for dates!  Sure, it can get chilly, but who cares?  Just another reason to get cozy with your (potential) cuddle buddy.  ;)\n\nAlong those same lines, much like how OTG: FM is a great way to end the work week, OTG: Presidio Picnic is a terrific way to start the end of the weekend (that is, as terrific as \"starting the end of the weekend\" can be).  Occurring every Sunday during the summer and fall, Presidio Picnic may not be as large as OTG's signature event, but it's just as popular.\n\nIf you're familiar with any of OTG's pods/events, the list of vendors and food trucks might look somewhat familiar.  OTG staples like Curry Up Now and The Chairman may be absent, but the list of eateries is still extensive and varied - Grilled Cheez Guy, Del Popolo (pizza), Little Green Cyclo (Vietnamese), Crème Brulee Cart, El Porteno (empanadas), Nopalito (Mexican), The Whole Beast (BBQ), Reveille Coffee, Sam's Chowder Mobile, La Marcha (Spanish), and Slightly Skewed.  And those are just the ones I can remember!\n\nWhile the food is obviously the biggest draw, what really makes this particular OTG event so awesome is its location.  Posted up on the grassy lawn at the Presidio's Main Post, there's really no other food truck meetup that can compare.  On a warm, sunny day, it's the perfect spot to lay out a blanket, soak up the sun, and take in that gorgeous view of the bay in the distance.  Toss in some delicious eats and drinks and you just might start hearing Maroon 5's \"Sunday Morning\" playing in the background.\n\nAs picturesque as the setting may be though, sadly, Presidio Picnic isn't perfect.  Yeah, it sucks having to pay for parking, but there's always Uber/Lyft/MUNI.  Rather, the real knock is the lack of line control.  Maybe it was just the combination of the gorgeous weather and it being the first Presidio Picnic of the year, but the lines got ridiculously long as the day went on.  Already bad on its own, yet even worse when they started to snake between people's picnic spots, making it tough on everyone (maybe create a buffer zone?).\n\nAll in all, FOUR AND A HALF STARS is about right, but I rounded down (sorry!).  Still, lines aside, Presidio Picnic is an awesome (and free!) way to start your Sunday Funday.  Good food, good times, and plenty of good vibes to go around.  Plus, with the handful of alcohol stands dotting the picnic area, you can get an early start on the drinking to forget that you probably have that deadline for work on Monday!\n\nCHEERS!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Thursday evenings are the best! \n\nIt almost feels like the weekend when you get to have dinner here on Thursday night. Get there right at 5pm. Score a great parking spot but don't forget you need to pay until 6pm. \n\nWe love all the trucks but here are some of my favs: \n\n- wine and beer, large selection and reasonably priced. The wine pour is nice and hefty! \n\n- Deaf pizza truck, perfect sized, fire roasted pizzas. Don't be that guy, read the letters and learn the sign before you get to the window. It's easy! \n\n- The Sweet Truck, cookies! Easy to eat on the go and baked perfectly. My daughter finishes the peanut butter ones before I'm done paying. \n\nWhat to bring: \n- WARM clothes (summer in SF is no joke)\n- Blankets to sit on and for your lap \n- BYOB if that's your thing \n- Frisbee or fun lawn game that doesn't take up too much space \n- Cute and friendly dog if you happen to own one\n- Cute and friendly kid if you happen to own one", "author": "Alison C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "I LOVE Off The Grid events.  I sincerely believe that it's happenings like this that truly make the Bay Area so special! \n\nLast weekend I had several out of town visitors that opted out of the Pride Weekend festivities because they didn't feel like being in large crowds.  I suggested Picnic At the Presidio as something different to show our guests.  It was a huge hit!\n\nThe food trucks and stands are incredible.  There's a wide selection that is sure to please everyone.  For example, while I was waiting for wood-fired pizza I stepped over to the Vietnamese food truck for spring rolls.  When I came back to our picnic area my friend had ordered Indian comfort food for us all.  \n\nRemember to bring a blanket, sunscreen, and BYOB.  There's a picnic bar area for specialty cocktails, wine, and beer.   There isn't much shade, so an umbrella or tent is also encouraged.  \n\nDogs are very welcome, but make sure to keep Fido on a leash.", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Definitely ranks up there in top SF experiences!! The way this event was described to me was basically a \"Bougie Dolores Park\" . People bring tents, picnic blankets, lay bags, wine/coolers, and just chill here.\n\nThe weather was just gorgeous this past weekend and we packed up the dogs for Presidio! It's kind of a trek to get there when you don't have a car, but it's well worth the commute if you intend on spending the entire afternoon there. There was a DJ and it was a bit noisy, but I don't know many people that \"go out for some peace and quiet\" anyway...\n\nA bunch of food options here - almost like a mini Outside Lands! Plus coffee truck, tons of drinks/cocktails, and some good snack items too. We opted for various loaded fries and some arepas! YUM!\n\nAnother plus - People LOVE dogs here! Unfortunately, Mochi loves little children not one bit. TONS and TONS of responsible parents here that have all conditioned their children to ASK FIRST and not to run up screaming with outstretched arms. A+ to all you parents!! Also an A+ event if you're trying to socialize your dog with other dogs or humans!\n\nMinus one star only because it is so incredibly out of the way and difficult to get to...but if you have a car and have good parking juju - this might be the right spot for your Sunday funday!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "This is a cool spot to come on a nice day! I came here during fleet week and it was the perfect spot to relax and watch the blue angels. You get a little view of the GG bridge peaking through and the water. \n\nI appreciated the many good food trucks that provided something for everyone. The cocktails were also a plus :) a great spot to bring a group of friends. \n\nOnly thing I didn't enjoy were the screaming kiddos and parents who were super checked out. A kid came up to my picnic, picked up my purse and threw it at my face.. then proceeded to do it over and over again. I would recommend choosing your picnic spot wisely and *away* from the kids.", "author": "Kelly F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "Cool concept. Decent food. Needs more bathrooms. More organization. Lines were all over the place and confusing.", "author": "Carter Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Great variety of food trucks, coffee, ice cream, etc. And fun music too! It's a great place to come with your friends, family, and especially dogs! The only problem is that there is NO shade. Unless you find a tree off to the side.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Such a great place and location to spend your day outside. I usually come here on a weekend whenever I want to unwind with friends and family. I definitely prefer this place over Dolores Park since there's such a chill vibe and you get a great view of the golden gate bridge and the area is super clean. On a nice sunny day, you can also squeeze in a tanning sesh while you're at it =) There's also plenty of food options as well (legit food trucks) so you'll never get hungry!", "author": "Diane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "Sundays are our fun days and I usually like to go to Dolores Park, but we happened to stumble upon this happening one weekend and were very happy we did! They had a great selection of food trucks, multiple bars scattered throughout the lawn and some really cute spots to sit and hang out. It is FREE to attend, which is awesome, but food and drink prices were a little high for my liking, so BYO snacks if you're the frugal type. \n\nWe were able to ride the bus to the presidio, so parking was no problem and we also got to explore other areas around by foot which was fun. I will definitely be back this summer with my picnic blanket.", "author": "Whitney Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "We love hanging out here. Food is great with different food trucks and vendors to choose from. Parking is hard though...", "author": "Maricar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "If I didn't already live in San Francisco, I would move here after coming to Presidio Picnic on a nice sunny day. Great food. Good people watching. Dogs. Ocean. Bridge.", "author": "Morris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Food trucks were lined up around the perimeter. View of the bay was beautiful. It was windy and cold this past Father'sDay. Recommend blankets for next time.", "author": "Suzette C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Great food truck event offering a variety of eats from pizza to sushi, ice cream vegetarian to bacon options for the carnivore foodies. Excellent for the entire family, day time shindig, groups, girls day out, couples quality time...whatever your vice.\n\nIt's free, open to the public and has the best view in town right off the marina. Seated in the heart of the Presidio where the grass is healthy & green, the skies are beautifully blue and sun shines in abundance. Bring a blanket to lay out, grab a tent for shade or tote your portable folding chair to enjoy the festivities, adult libations & awesome live entertainment in comfort. \n\nCan't beat the grid.\n~Christy", "author": "Christy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "The Presidio is great for picnics! They have an abundance of food trucks and food stands surrounding the park square, plenty of variety to choose from for your picnic snacking while listening to music from a DJ tent. I came here for a birthday party and was super satisfied with a crab roll. Do note that this place gets crowded, especially in the weekends, so come early to pick your spot! Also if you're coming on a particularly sunny day like we did, bring a hat, umbrella or setup a half tent dome to shield from the sun's rays. There are no shade trees surrounding majority of the park, so in peak afternoon on a hot day, it gets pretty hot!", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Hipsters may have ruined food trucks, but at least they can't ruin the Presidio Picnic. Don't get me wrong; I like a lot of things that hipsters like, such as overpriced coffee and claiming I liked bands before they were popular. (I'd like to point out now that I also liked making fun of hipsters before it was popular. And yelp. I was on yelp back when most people were still using zagat). But there was a time when food trucks provided a generous quantity of tasty if unhealthy food cheap. You know, the whole no real overhead discount? At the Presidio Picnic, you won't find a heaping plate of fried food for $5, however. Be prepared to pay $10 for a small bag of tiny zeppole (which horrified my Italian American friend), which could alternatively have bought almost two dozen Krispy Kreme or even three giant (even more hip) Johnny's donuts. \n\nBut still, even if your belly feels a little unsatisfied, you can't beat that view. And this is one of those events that is equally attractive to tech bros (and gals), families with young kids, dog parents, and everyone else who finds a little fog refreshing. Parking is easy, although you do have to pay. \n\nAnd to return to those things that hipsters like: can we please get someone who sells hot coffee there next year? Philz, Blue Bottle, Red Whale, anyone?", "author": "Susan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Enjoyed coming here on a rare sunny 75+ degree day in SF. All my favorite food trucks and tents were there and the atmosphere was great! Definitely very crowded and lots of kids/dogs. This is like the grad school of parks and Dolo is sort of like undergrad. \n\nWe had zeppoles from Girl Friday that were TO DIE FOR! Seriously good! Get the dozen half n half and get the harissa dipping sauce and earl grey chocolate ganache. \n\nNopalito tacos were a solid choice but way too expensive for two tacos.\n\nDel popolo pizzas were delicious and worth every penny. One of the best items at the picnic! \n\nLa Marcha patatas bravas were surprisingly my favorite bite of the day. I only got in their line because it was short and I was hungry but I was pleasantly surprised! \n\nWe had Luciano's ice cream for dessert which was just okay (too sweet). Will try the shave ice at powder next time.\n\nOverall, this is where I plan to be on any given (sunny) Sunday all summer long. Bring your appetite and a picnic blanket. I also brought a bottle of wine on an ice pack because the drinks are really expensive (though they are strong).", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "heard about this a thousand years ago but visited for my first time on fleet week sunday\n\nperfect weather\nand a sick volkswagen beetle & bus convention in the parking lot\nwhat a day\n\ndogs everywhere so i accepted the fact that i'd be stepping in a bunch of hotmess... but it never happened - shoe bottoms stayed spotless. miracle!\n\ninteresting vendor mix with multiple ones that have been in my bookmarks forever\n\nthis otg seemed at a higher avg entree price point than other truckeries\n\nput it this way: in recent weeks i spent...\n$20+ for 3 dishes at eat real festival\n$20 for 2 dishes at otg fort yayson\n$30 for 4 dishes at lumpia palooza\n$39 for 3 dishes at otg presidio\n\nbut what i ate here was slightly \"high end\" in comparison so it's ok\n\nplus there was a ymca woodshop tent for kids. it's always great when non-art festivals randomly have something where people create. i saw a child sawing stuff up get your tim allen on young'n", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "First, let me take a moment to give a shout out to the OTG people that make this awesomeness happen.\n\nThank you very much OTG peeps!\n\nEvery Sunday from April to October, this magic happens.  It looks daunting.  I mean, it can't be easy to execute all of this without a hitch, right?  But somehow you manage to get this party started & rolling smoothly.  What a sleek operation!  Fabulous food trucks all gathered together at the beautiful presidio, complete w a DJ & drinks like Mint Juleps & Singapore Slings...\n\nHow great is this?!\n\nI've never actually met an OTG production I didn't like, but the Picnic at the Presidio holds a special spot in my heart.  \n\nMaybe it's the view of the GG Bridge & the bay?\n\nMaybe it's being surrounded by all the sheer presidioness?\n\nMaybe it's the combination of the sunshine & the manicured lawns?\n\nAnd the view?\n\nI dunno really.\n\nI just know that it's awesome.\n\nDogs & kids galore.  Great food.  There's even coffee for chrisakes.\n\nOn my last visit, here are the goods I made out with...\n\nZucchini Bread.  GF & organic!?\n\nZeppole.  The savory ones.  Bacon, herbs, parmesan.  With the sriracha dipping sauce.  DELICIOUS!\n\nFried chicken from Wing Wings.  SO SO GOOD!  Except for the fact that I think it could have used some salt, I must say this fried chicken is pretty stellar.  My man totally monopolized it.  We got the cole slaw to go w it.  It was fresh & light, w a bit of a spicy kick.  He loved it, but I'm just meh about coleslaw in general.\n\nAn Arnold Palmer to wash it all down with.\n\nSee that?  We got breakfast, lunch, & dinner.\n\nWhat a great addition to summers in San Francisco.\n\nI heart you Picnic at the Presidio.\n\n5 stars all the way.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "I absolutely love Off The Grid. It's set it a beautiful picnic area with a amazing view of the bay for one. The arrangement of food trucks and stands all serve delicious food and it's great sampling a little of the best of each category of the food for all the stands and trucks. I consider going to Off The Grid one of the best things you can do on a Sunday if you got some time and want to eat delicious food.", "author": "John V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I really love Picnic In the Park at Presidio by Off the Grid. It may really be my favorite Off the Grid event. I love it because you're at the beautiful presidio on Main Post Lawn with the most amazing view into the bay. The grass is lush, and so you have PLENTY OF SEATING! Be prepared, bring your towel/blankets and other goodies. There are plenty of vendors and variety to choose from, and a lot of them take credit cards. You can come with a group of people and appease anyone's diets, dislikes or likes. There's coffee, juice and dessert. There is also the bar! Dogs are welcome :) DJ playing music. It's a great place to just chill, hang out and catch up.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "COOL! Nothing like it in the City. This is such a great use of the Presidio space!\n\nCame here on a Sunday afternoon for a picnic with some friends.\n\nPARKING: Arrived around 12pm and there were still several street parking spots left. There is also a parking lot as well. $1.20/hr even on Sundays!\n\nFOOD: There are both food trucks and food tents! Take your pick! Lots of food options and they have a beer/wine bar in the middle of the park.\n\nSPACE: SOOO much space to grab a spot on the lawn and sit. Bring a blanket (the grass can get a little wet) and just lay around and enjoy some good food and company. Several people also bring their dogs too! Very chill space :)\n\nMUSIC: They had a DJ at the Park as well (closer to the Bay side) and the closer you get, the louder it is. Pretty funny to see the 100 ft in front of the DJ was empty. Nobody wants to blow their eardrums out!\n\nIt can get a little windy sometimes and there are definitely people here who bring tents/umbrellas. I believe some days they have a vendor who rents out umbrellas/tents for you to use. Super handy!\n\nWould definitely come back here another weekend - heard Thursdays are pretty fun too!", "author": "Wing L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "Wonderful idea but too cold during the twilight Thursday off the grids. That can't be helped. Wearing a sweater and jacket over it AND a scarf will stil not be enough, and I thought I was prepared!\nSunday off the grid is lovely with music, more people, but you will have to spend more time looking for parking ..which will be father.. And then scramble to look for a seat to sit at. Unless you don't mind the grass. Bring a blanket to sit on!", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "Technically an out-of-tower review...\n\nCause Sacramento is so not the City, but in proximity, it's pretty damn close. I've been drooling over Off the Grid SF Instagram for a long time, but getting to the Presidio on a Sunday just hasn't been in the cards...\n\n...until this past weekend. Luckily, we had brunch and diddle daddle around the City...then got hungry right in the middle of the PP. Thank goodness Yelp has this is a location, so I could get us there properly.\n\nThe parking wasn't awful, but we did find street parking fairly easy. But it looked full everywhere. We had to pay where we parked, but I did see some free parking.\n\nThe thing is, I wasn't amazing by the actually truck/restaurant offerings they had. But I was in awe of the set-up, they had a variety of type of food to try, but it was really the nice, fresh green grass to hang out on that made me happy. Also, their ability to have booze stations was pretty cool (even though we brought our own, tisk tisk)!\n\nThere's a pretty view if you walk a little more towards the water. At the back, you don't quite get the good bay view. Overall, the whole vibe and set-up is pretty cool. \n\nEven the restrooms were nice, well the larger one with three stalls. Inside it was clean and almost resembled a normal bathroom, which was much appreciated on my behalf. I will say be careful on getting there, an entitled jerk in a Porsche might almost run you over and then try to yell at you! But hey, just saying that may or may not happen ;)\n\nKeepin' SF chill, one Sunday at a time...", "author": "Steph G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Turning this underutilized grassy space into a food truck gathering is genius. There's lots of space to lounge on the grass, so bring a towel. Grab some food, get a drink, have a seat, and enjoy the view! Mr. Joy and I just happened to discover Presidio Picnic by chance. We also happened to have blankets at the time, so we checked it out. Unfortunately, it was close to closing time, so there wasn't much we could try. 4PM on a Sunday seems rather early, in my opinion. \nThere were a lot of trucks, so there was a big selection. All the usual names were there, but we just got a few bites from Chotto & Tout Sweet Patisserie, which were okay. I'd return on a warm day, but I'll have to remind myself to arrive earlier.", "author": "Joy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "Great place to come during the weekend! The ambience is awesome: just like a big backyard party with (infinite) delicious food options. There are SO MANY options to eat, one more delicious than the next- almost to the point that you wish you shared the 4 stomachs trait with cows just to try it all! I personally tried the arepas truck. Pretty solid and delicious arepas... and that is a BIG compliment from me considering I am a Venezuelan arepa snob. I also had some caribbean food and it was solid! So so good... According to my husband, they have the best pork sandwiches here too! It's cool because everyone can go their way and choose the food preference, and then reconvene and share the goodness.  \nSome things we would like to try in the future: epic-looking ice-cream sandwiches and fruit cups, fire-oven pizza truck that looked REALLY good, and delicious-looking Peruvian food. \nGreat place to bring kids, dogs, and a big group of friends. The only thing I wish they had is more seating/shaded areas to eat- but if grass/sun doesn't bother you its a nice place to come eat, chill with friends, and enjoy the community vibe of SF. I would recommend you to bring a blanket/tent and water! \nLast but not least, some of the cleanest bathroom stalls you can find in a park are here. Pretty impressed by this!", "author": "Maria B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "PERFECT location for some fresh air, tasty food, and great scenery! Bring a blanket, some shades, to enjoy a day of awesome food and vitamin C! \n\nThere was 15-20 food tents on one side of the lawn and 6-7 food trucks on the other side. There was a great variety of food, from savory to sweet, and from American to Indian or Asian, etc. \n\nThere was a booth for the Three Twins, which is an ice cream brand, and I just had to try it! I got a scoop of MEXICAN CHOCOLATE ($4) in a cone and it was AMAZINGGGG! It had a hint of cinnamon, and the cone also tasted great. The only downside was that it melted pretty fast. I got an extra cup and dumped the entire scoop into it. They take both cash and credit card, so very convenient! \n\nThe view was also breathe taking, since it is right next to the GG Bridge. It is also 10 minute walk away from the Palace of the Fine Arts, which has an amazing view also.", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-07", "description": "Soooo incredibly crowded.  Some of the lines were dozens deep.  Would not come back for the picnic part of this event.  No room to walk through, let alone set down a blanket.  Granted, we did arrive at noon.\n\nI went for the YBike portion of the day, which my kid LOVED.  The YMCA staff was friendly for the most part and provided positive encouragement and tips.  \n\nParking was a bit rough, but found a little non-metered, no time limit area.", "author": "Terence L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "I've lived in the area for several years, so I'm actually a bit ashamed to say that today was my first time at Off the Grid: Picnic at the Presidio. Mostly because it was awesome and clearly I've been missing out!\n\nThere was a DJ playing some good music, tons of food trucks/stands, wine/beer bars, and plenty of sunshine.\n\nNot having been before, I wasn't sure what to expect. Thankfully I brought a blanket and some beers to meet up with my group of friends (ended up being perfect). Chilled for a couple of hours in the sun with a good group of people, good food, good drinks. Couldn't ask for a better end to the perfect SF weekend :)", "author": "Krista S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "This is a great way and place to spend a sunny Sunday afternoon. I would recommend coming early as possible to get good parking and to avoid long food lines. \n\nI got there around 12 and spent 10-15 minutes looking for parking. We paid $6 for all-day parking which isn't bad at all. When we got there, the place was already packed. There are a lot of different food vendors and carts. I would recommend doing a walk through first of all the different food vendors before making a decision. :) \n\nPlaces I tried:\n\n--Sugarfoot Grits: This place had one of the longest lines. I wanted to try the bacon, egg and cheese biscuit sandwich. I waited in line for about 20 minutes. When you place your order, you have to wait even longer for your food. I was kind of disappointed because 1) there is an additional wait time for you and it's pretty long, and 2) the biscuit sandwich was not worth the wait. I thought the biscuit sandwich would be the size of a \"regular\" biscuit...like the ones at KFC, Popeyes, or the Pillsbury store-bought biscuit dough. The sandwich was probably the size of half my palm and it really didn't taste anything special. Would not order this again.\n\nGirl Friday: Tried this place for their lemon ricotta donuts! Half a dozen donuts with a sauce of your choosing for $5. These are sooo delicious. You can't really taste the ricotta, but it was a really good donut. Super fried and the earl grey chocolate ganache with sea salt dipping sauce was amazing.\n\nCreme Brûlée Cart: Yum!! We tried the SF Gold creme brulée. They ran out of the chocolate cookie crumble, which is a topping that comes in the SF Gold, so we replaced it with graham cracker. I like this cart because it's different and the serving size is good. I would definitely try this. You can tell they use real vanilla beans because you can see the black specks in the creme brûlée. \n\nTips:\n--Bring cash so that you can pay easily and get the line moving!\n--Bring a blanket so you can have a picnic on the lawn!\n--Bring an ice box/cooler with cold drinks. I think you can even bring your own alcohol. :O\n--Bring a jacket because it can get windy.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "It may be partly cloudy but you'll get sunburned! Bring some sun screen!! We had a burst of 30 seconds of hot hot sun and I want to say...everyone in our group was pink/red and some even peeled the next day! \n\nLove the view. Love the weather. Love the experience. It gets crowded, so come before the lunch hour or slightly later. Music started towards the middle/end of the event, but it wasn't a big deal. Just wish we had enough time and space in our bellies for all of the food!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-02", "description": "Like what someone said on the Facebook page... 17k attendees but only 10 trucks today...? What...\n\nList of food vendors today:\nDoc's of the Bay (Truck) \nCheese Gone Wild (Truck) \nThe Crab Lab (Trailer)\nEl Sur (Truck)\nKorean Bobcha (Truck)\nJohnny Doughnuts (Truck)\nThe Boneyard (Truck) \nThe Chairman (Truck) \nSAJJ (Truck) \nThe Taco Guys (Truck) \n\nGot there around 6PM and had to park away from the main area. Good thing parking signs said 2HR parking 8AM - 6PM! Walked over to the place and saw many cute tents and people! Sooo San Franciscan haha. My friends & I checked out Korean Bobcha. The wait was about 50 minutes -__-\" We got the Kimchi fries ($8.75) and Bulgogi Burrito ($9.75). The Kimchi fries were DELICIOUS! The Bulgogi Burrito tasted a little funny to me... Maybe because I ate burritos earlier this week that I wasn't feelin' this one, but I still ate it though.\n\nThen we waited about and HOUR at the Falafel Shwarma place called SAJJ. We did see how long the line was and it only got longer as we waited in line - so there must be something great about this truck! I ordered the Falafel in Pita brea ($8)... The wait was so long that my friends and I immediately left the event around 9PM to go get some boba and eat there. I think the coldest made me not want to eat/ move anymore. But I enjoyed the falafel - just not sure if the hour wait was worth it though.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "You really can't go wrong here...a well organized event where vendors with names to uphold serve you the food that you want. The little \"timbits\" are definitely worth getting, they gave us samples of their savory flavour, and that was worth getting in the future.\n\nSometimes the lines can get long at the popular booths/trucks, so definitely bring a friend and divide + conquer. It's also a dog friendly picnic. Possibly because of the location, the garbage was very well organized. Most places accept credit cards through square too so cash isn't mandatory.\n\nOverall I only dock one star because the food made me really thirsty and was quite expensive for a meal.\n\nI'd pair the picnic with a visit to the Walt Disney family museum across the street.", "author": "Alfonso C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "A fun outing on a Sunday! Arrived at around 11:15-11:30 and there was still plenty of parking. I parked by the Presidio Bowling club north of the lawn and paid at the machine for parking, which was $1.50 per hour or $8 all day. \n\nGreat for groups, lots of families and dogs. Lots of people but did not feel over crowded as we sat south of all the food.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Unlike other Off the Grid locations, this is not on cement but a lush lawn of beautiful green and ample parking throughout the Presidio. Would be good to do your homework before you head over as to which places you want to try as there are many food trucks and long lines. Alternatively, the group can separate and each tackle a line with multiple vendors. There is music available via a DJ, but the quality can vary depending on which day you visit. You can bring your own drinks and food, and it is strongly recommended that you bring blankets and chairs.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Best food truck event ever! \n\nToday was my first time attending this event. My bf and I took the free PresidiGo shuttle from Embarcadero Transit Station straight to the event. Despite the mass of people and doggies, the lines were surprising not very long and went by extremely quickly. The food selection was huge and varied, the DJ played catchy music, and the entire lawn was filled with families who were either in tents, sprawled out on blankets, or running around playing games. It's very family-friendly, lively, and relaxing, with a beautiful view overlooking the entire Bay Area.\n\nThe premise kept clean throughout, with event workers educating and helping people sort their trash. Even the porta potties were beyond clean and quite fancy, where each stall was equipped with its own sink and napkin dispenser with a lot of room left to move around in. There were also ones equipped with up to 5 stalls in each trailer. Overall, the event was very well-planned and well-executed. \n\nBut most importantly, the food was to die for. My favorite trucks were The Whole Beast (smoked corn on the cob), Fine and Rare (oyster po boy), and Girl Friday Zeppole (zeppole with vanilla bean creme fraiche dipping sauce). The prices weren't outrageous and the food was definitely gourmet, or at least with unexpected but delicious twists. For people looking to get a little tipsy, there is a alcoholic beverage station in the middle of the lawn. Like I said, this place is family-friendly, good for kids, adults, and pets.  \n\nNote: bring blankets and jackets because the grass might be a little wet and the wind tends to pick up at times and temperature tends to drop, since it's by the water. Also bring cash, because some places are cash only (and trust me, you don't want to miss out on any food).\n\nI will definitely be back to try even more foods.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "This is the Queen/King of Off The Grid events!! I've been to other OTG Events but nothing like this. I've heard a lot about this particular OTG and have wanted to go but never had the chance and once I saw that Sugarfoot Grits was going to be here and it was going to be warm that day, I made time to be here. \n\nThey are located by the Presidio and right across the street from The Walt Disney Museum. Parking in this area was tricky and hard to find so I parked by Crissy Fields and walked (yes it was far, 1.3 miles to be exact). Once I got there I was taken aback, the grassy area where OTG was located was extremely spacious and beautiful. There were TONS of food booths, about 5 food trucks, a bar and a DJ. This seemed like a good festival/party. I walked around to check out all of the food booths even though I knew what I was there to get.\n\nSome of the booths/trucks included Wing Wings, Creme Brûlée Cart, Fins on the Hoof and bubble bar just to name a few. I finally went to Sugarfoot Grits and ordered The Valencia ($10) which is cheese grits, organic greens and local \"crispy\" bacon. It was pure heaven, very much worth the walk and drive. I also went over to Wing Wings and had there fresh made fruit punch, it had a florescent pink color but was delicious, unlike any punch I've ever had. I sat on the grass to eat and drink while listening to the great music. It was so relaxing even though there were many people there.\n\nIf you are a big fan of OTG or just a foodie in general, this is a must and make sure to bring a blanket, football, frisbee or something to have more fun. It's perfect for the whole family to enjoy especially on a nice sunny day and you have a nice view of the Golden Gate Bridge.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "Probably the best way to get your food truck fix, with more food trucks, fewer lines, and often nicer weather than the evening events. The key is to get there early. At 11:20, parking was easy, lines were non-existent, and nothing was sold out. \n\nLots of choices -arepas, goat tacos, sangria, pork belly sliders, ceviche, you name it.", "author": "Greg E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Food trucks with lobster, tacos, burgers, dessert, beer, etc. I love how they have a location for this event that brings people all over on Sundays to enjoy the food and the outdoors. What intrigued me besides attending an Off the Grid event is that it was dog friendly. So my bf and I brought our doggy here for a day of fun and relaxation. Located in Presidio Park, the giant lot in front of the Disney exhibit. I remember in high school I would have competitions here, it brought back memories.\n\nBring a picnic blanket (and a picnic, if you would like) and cash to purchase food ($12-25). I wish the food from the food trucks weren't so expensive. We got a Lobster Roll from one of the trucks (way too pricy for a small roll), delicious burger, Creme brûlée, beer. Yes, they sell alcoholic drinks there!\n\nIt's great for all ages. Bit of music, fun atmosphere. I recommend coming here with a picnic blanket, picnic, drinks, hat, sunglasses, dog (optional). I would love to go more frequently. It was a fun and memorable experience.", "author": "Winnie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "I used to live in Portland so I know a thing or two about food carts and master planned pods. This is nothing like that. This is a free form, hippie dippy love fest of all things food. There are food carts/trucks to be sure and there are also tents. There is a FULL bar in the center of the lawn; there is also an ATM (Good to know!) L and I did this as a recon mission. We weren't sure what we would need to bring and wanted to get the lay of the land. \n\nFirst, bring a blanket and/or chairs. Plan to stay for the day. Everyone is friendly and the event has a laid back carnival atmosphere. No dogs, please. Lots of people very close together and lots of little people running around.\n\nSecond, there will be lines. We saw long wait times for the BBQ place, the wood fired pizza with the coolest truck and the Vietnamese truck. Tag team the food runs. Have someone stay at the blanket while others stand in line. \n\nThe weather was perfect, cool with a slight breeze. A magnificent view of the bridge and hosted on the famous Presidio. Did you know you can rent some of the renovated base housing? If I had the money, I would be all over that. \n\nOh! There is a free shuttle called the PresidiGo Shuttle. They pick up from downtown and bring you to right across the street from the event.", "author": "Snow M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Came here for a family friend's birthday and I had a great time! Plenty of foodtrucks and tents to satisfy your cravings. \n\nThe Paella is definitely a must try,and it's $10 but has meat and shrimps that just mixed so well! \n\nA tip I suggest is to come early. I ended up arriving before 12 noon,so there was still nearby parking which was easy to find. $1.25 per hour, or $7 all day which isn't bad at all. I do recommend to plan ahead and make sure you bring sun block and a small half tent,and blankets that absorb the wet grass if you plan to stay all day.", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "I've been to Off the Grid at the Presidio on Thursdays and Sundays.  OtG on Thursdays is for dinner, and there are bungalows that are first come, first serve.  If you're lucky to snag one, you get offered drink service.  OtG on Sundays doesn't have the bungalows, but there are a lot more food carts available.\n\nIt's a nice place to enjoy the view of the bridge and eat good food among friends.  Be sure to check out the website to see what trucks and carts are available.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Off the grid is a gathering of food trucks and stalls every Sunday at the Presidio from 11-4. Alcohol is available, but everyone was courteous (and if you choose to drink, be considerate of the families around!).\n\nThe vibe's like a very large backyard barbecue. Lots of kids, lots of dogs, a giant stereo playing top 40 and, of course, lots of food. Of course, it's seasoned with San Francisco: there's an outdoor yoga class from 11-12 (with a very friendly instructor) and I was approached by 3 (super sweet!) guys passing out fliers for their startups. And, like anywhere else in SF, parking sucks. Be prepared to muni or walk about a mile for any street parking.\n\nFood is good though! I wasn't impressed by the stalls on the right (which I think are mostly cash only), but I liked the selection of food trucks on the left. I think they change every week, but prices ranged from $9-12 (not bad for SF) and the trucks all took card. Great view of the bay! I can see a fun afternoon grabbing lunch before or after biking across the Golden Gate.", "author": "Varsha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "One of my most favorite things to do on a sunny Sunday in SF.  Great place to chill with a significant other, dog, family, and/or friends.  This spot is especially family friendly in comparison to the one offered in Fort Mason on Fridays (and much larger with more food options as well).  We love to bring our picnic table, chairs, blanket, and a bottle of bubbly with us, and then grab some grub from the food trucks and hang out for the afternoon.  So chill, so fun.\n\nThe only unfortunate thing is it's become increasingly more popular - this year has been the busiest I've seen it.  Just come prepared to have to either get there early or circle the lot stalking people to try to find a parking spot.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "When do you ever just get to hang out at the Presidio right in front of the Walt Disney Museum? Well, I don't - I don't know about you! My cousin hosted her birthday celebration here this past Sunday (9/13/15) and it was a lot of fun. It's the most casual meet up for a birthday anyone could have, and everyone's essentially in charge of whatever they wanna bring/order/eat, etc.\n\nAt this specific on off the grid, I shared all of the items I ordered.\n*I started with Nopalito - and ordered the totopos con chile y picadillo (house made tortilla chips, ground pork, potato, salsa, de arbol, cojita cheese, onion, cilantro and crema ($9) and totally shareable with at least 2-3 other people. This was pretty good! It seemed as if they sprinkled cheddar cheese on the chips, it kind of resembled doritos. \n\n*To wash it all down we went to Cholita Linda and had their agua frescas. The lady at the cashier was super nice and offered to do a mix of the two flavors they have. So she did half mango-passion fruit and half strawberry-lime --- so refreshing! It was a tad too sweet for me so I ended up adding about a fourth of extra water when I had the space ($3.50)\n\n*For dessert we hit up the creme brulee cart - they had the usual vanilla bean, dark chocolate, salted caramel and the chef's special which was bourbon butterscotch and nutella strawberry ($5/each) as well as other specialty flavors and bits and drizzles as additions (+$1). I had the vanilla bean and this was delicious - as expected! My mom had the salted caramel, it was way too rich, we ended up giving it to someone else in our party to enjoy. My friend got the nutella strawberry and she was basically having mouthgasms from first bite to her last - I think it was pretty good too, but I enjoyed the simplicity of the vanilla bean. \n\nMinus one star because I think they could've had more options, but other than that, a very enjoyable experience on one of the last Sundays of Summer.\n\nTips:\n-Bring cash if possible. Although most vendors do accept card, it's easier and faster to pay with cash\n-Bring your pooch! Dogs are definitely welcomed and allowed\n-Bring a blanket to sit on and a tent if possible. \n-Take public transportation or carpool - parking in the lot is $7 all day", "author": "Kathleene E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "I love OTG ever since they started, they're hugely popular now, and their team comes up with awesome ideas on where to go.  We left AT&T park during a day game and headed to the Presidio.  It was first come, first serve, so we grabbed a cabana and situated ourselves.   A vast array of food trucks at this site with breathtaking views all around.  It was Twilight Thursday with a menu of libations.  Simple steps to order if you're in a cabana, simply text your drink order and flag # of the cabana, and a confirmation will be received.  Just sit back and relax, and your drinks will arrive shortly.  \n\nI ordered all the baos from Chairman Bao, pulled pork sandwiches from The Boneyard, angus beef sliders, and a meat pie from The Creme Brulee Cart.  We chillaxed the rest of the evening with bottles of Coca-Cola, and listened to live music.  Family-friendly, lots of people enjoying their picnics on the lawn, and happy pets trying to snatch your food.  For the Yelper complaining about people sitting too close, get there early and seize your territory, what do you expect when you go to a public venue...people?  Don't be anti-social, and \"NO\" OTG is not going to enforce people sitting next to each other enjoying the same view.  The whole experience is about people gathering together as people; otherwise, stay home!  SF is home to the hippies, it's all about love, happiness, and peace - nobody is rude here, sounds like you are.", "author": "Christine R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Pay for parking, $1.20/hr, or get a ticket. Paying for parking on Sunday sucks! \n\nThis is my favorite Off the Grid spot. Unlike their visits to parts of the bay, At the Presidio provides you a huge grass field for you to picnic, not to mention the wonderful view facing the bay and The Rock. \n\nBring a jacket or sweater as it gets pretty chili even during some of the hottest days because of the wind. \n\nVendors surround both sides of the field. To the west side are your food trucks. The east side are the farmers' market and more restaurant based food vendors. \n\nThere were a few farmers' market vendors selling local honey and strawberries on the day that I went but not much. \n\nThe vendors often change so I guess you need to go to OffTheGridSF.com to check what's out during that Sunday. \n\nI love restaurant vendors as they provide, in my opinion, already established quality to the table. I forgot the name of the vendor but I bought some fried chicken at a discounted price right before they were closing and it was pretty good even though it wasn't fresh off the fryer.\n\nSmack dab in the middle of the field are your alcohol stands for beers, wine and mimosas.\n\nA great place to bring a group of friends to enjoy the a picnic out in the sun on a huge field with lots of choices from local food trucks and vendors.", "author": "Stan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "After a great weekend at the Inn at the Presidio, we were in the midst of checking out of our hotel and noticed a large crowd gathering in the grass fields. Overlooking the bay and the Golden Gate Bridge, was this amazing out door food gathering called Off the Grid!\n\nThere were so many different types of food and drink options that caters to everyone! You want BBQ? It was there! Pizza, Asian fusion, Mexican? It was there! Fresh juice, adult beverages, coffee? It was there! The only trouble is there was so many options that what do you choose? My suggestion is to go hungry, spend the entire 5 hours there, and share share share! This might be the only way to try everything.\n\nThere's plenty of parking on the Presidio grounds just make sure you pay the fee otherwise a ticket will be coming. The only main drawback was that there's absolutely no shade. Be prepared and bring some sort of sun shade, similar to what you would bring to the beach.\n\nOne of the great aspects to SF and the bay area is the food! Off the Grid is a great way to try many local food vendors without having to go all over the city. Enjoy the food, the views of the bay, and the excellent people watching :)", "author": "Stan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Perfect way to spend a nice Sunday afternoon. Bring a blanket and sunscreen then roam around to consider your different food options. When we went, I think there were at least 20 different food vendors. I really enjoyed the skewers truck and the grilled cheese stand! We got there just after noon and there was plenty of sitting space on the grass.", "author": "Gloria N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "When the weather is nice, it's the perfect place to grab some friends, bring a picnic blanket and just hang out. There's a HUGE grass area where you can chill and hang out in the sun and there's a decent amount of food trucks and food vendors. The is also a great view of the water as well if you go to one end of the park.\n\nBonus: they sell drinks as well (but you can always bring your own).\n\nOverall, it's a perfect place to have a lazy weekend and just hang out.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Such a fun day. If you have never been to Off the Grid, you are missing out! Food, food, food and drink EVERYWHERE. The DJ was playing great music. There was even a modified CTrain on a flat bed that had been turned into a pizza eatery equipped with a pizza oven! I'm definitely trying it next time. Lots of variety. You can most definitely find something for everyone. Bring your blanket and sun block.  But hurry up because it stops November 1st.", "author": "Debbie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "My new fav discovery in SF. I love Off The Grid Presidio! Bomb cocktails + gourmet food trucks + beautiful bay view = best thing ever. This is such a fun thing to do with your friends or family. Make sure to bring your chairs and blankets! Then you can find a spot in the grass and sit in the sun :)", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "I really enjoy heading into off the grid in the presidio on Sunday's. We (my wife and nearly 2 year old daughter) have been a few times and are slowly becoming seasoned into what to do and bring.\n\nThe basics:\n- Layers - the weather can literally be different from the presidio and the next neighborhood across. We live very close and one time I went without my wife. I came back drenched, cold and miserable. My wife didn't even see a cloud.\n- Sunscreen - if the weather is good it is easy to sit, drink, eat and relax for a little too long in the sun.\n- Time - some of the food trucks (like the pizza one) can have massive lines. Make sure to come that little bit before you are hungry. Although there are still places where you can get a meal straight away.\n- Picnic blanket - there is no seating here, it is a giant chunk of grass. The grass is nice and soft, but it is nicer if you are sitting on something else.\n\nAdvanced:\n- Drinks - even though getting a Bloody Mary from the dude pushing around the cart is nice, paying $18 isn't. Grab some wine, beer or whatever from home. You can always grab something to try when you are there but it isn't super necessary.\n- Wind/sun shelter - what is it with parks without trees/shelter in this city? The wind up here can be pretty strong, plus you are sitting exposed for a long time while picnicking.\n- Sports equipment - there is free rentable stuff at a stall near the entrance. You just have to leave your ID. Things go quickly so make sure to check out what is available when you arrive.", "author": "Tristan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "When you can spend an afternoon hanging out with friends, drinking beer and eating great food -- all without having to do any food prep or setup yourself -- why would you spend a Sunday any other way?\n\nWe had a great group picnic at OTG and got lucky with beautiful weather. It was surprisingly easy for us to find our friends (and a great spot) in the crowd, and it turns out that the OTG team will even rent you comfy lawn chairs and blankets (super useful if you're an out-of-towner.) (PRO TIP: Call ahead to reserve your chairs/blankets, and they'll set it all up for you! $5 per chair or blanket, so for $60 you get a roomy outdoor living circle for a dozen friends + kids in the middle!)\n\nThe food options were great: fried chicken, waffles, coffee, ice cream, delicious pizza -- and yes, there is healthy stuff too, if you have the self-restraint to choose it when you're standing next to the fried chicken place.\n\nA totally delightful way to spend a Sunday!", "author": "Alexandra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "Great sunday funday activity! Depending on the unpredictable SF weather of course. All in all, it's awesome to have good food, good music, good views and last but not least all you need to bring with you is good company! Enjoyed presidio picnic and would recommend to bring your own picnic suppies ie: mats, chairs, tables and/or open tent (considering SF windy/cloudy days).", "author": "Crisgel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "Such a fun time. I've gone twice now, once on a weekend afternoon and once on a Thursday evening. There's some seriously great food trucks here including The Lobsta Truck and An's Noodles (always a favorite). \n\nI would recommend the daytime weekend version because its much warmer than the Thursday evening (we had particularly bad luck since it was foggy that day). \n\nFood is kind of expensive, (Lobster truck more so-- $20 for a lobster roll with extra meat, (that's what she said) and $14 for just a regular lobster roll, burgers from Bacon are ~$9-12). They have a booze truck in the evenings and in the daytime weekend versions they have a booze truck AND a slightly pretentious slow drip, personalized, Peets style coffee station too.\n\nBeautiful views of the bay and the bridge!", "author": "Lai-Nin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Lovely atmosphere. Beautiful surroundings. A lot of food to choose from. The peruvian food truck is especially good.", "author": "Carol K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "I was finally able to attend this event! Can't go wrong with being able to try different food trucks and relaxing on the grass on a nice day! It's not like the usual OTG at Fort Mason. This event has less food trucks. But still a good amount. The lawn they host it next to is pretty big! And parking isn't a big problem since theres parking lots all around the area. I would highly recommend attending one of these picnics while it's still going on! \n\nWhen I went.. I tried 4 different spots. grilled cheese guy, wing wing, go streatery and fins on the hoof! At the Grilled Cheese guy I ordered the Not your average grilled cheese, it was good. They add a little spice to it which makes it good. At wing wing, we ordered the fried chicken...... amazingly good!!!!! It would have to be my favorite out of all the spots I tried. I highly recommend trying the fried chicken there. At go steatery... I ordered the oxtail over grits and the donuts. The oxtail was delicious! They weren't joking about it being \"fall off the bone\" and the donuts were ok. Lastly, I had the soft shell crAb po boy at fins on the hoof. It was delicious!! I would definitely order it again.\n\nOverall it was a great experience! Come prepared! Being picnic blankets.. Chairs.. Etc! Anything that will help you enjoy and be comfortable!", "author": "Jadelann J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "This was a really great place to spend our Sunday afternoon during the 4th of July weekend. It was nice and sunny until later in the afternoon, and there's a huge grassy, overall flat open space for people to sit and have a nice relaxing picnic.\n\nThere was a decent range of food trucks and different types of food, including desserts, Asian food, fried chicken, paella, and Vietnamese food. However, unsurprisingly most of these seemed slightly overpriced and the more popular trucks weren't there. I ended up ordering from the Asian Skewers food truck and I was very satisfied with the food! I got the skewer combo, which comes with 1 chicken skewer, 1 marinated beef, and grilled veggies. The beef was pretty undercooked so it looked like medium rare steak, but I ate all of it and didn't feel any discomfort. The chicken and beef were both super tender, juicy, and well-flavored. \n\nAlso, dogs! They were everywhere at the picnic and I loved that. Overall a laid-back, fun way to spend a lazy Sunday afternoon and get some noms in!", "author": "Kailin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "I missed out on the inaugural run of Off The Grid Picnic at the Presidio so I can't really tell what's changed.  From what I've read, they've added a farmers' market and changed up some of the food vendors.\n\nIt's definitely a departure from all the other OTGs since there are less trucks and more restaurant based vendors, not to mention the farmers' market.  They rotate some of the vendors like the other OTGs and also in some cases they seem to be more pricier than at the other OTGs.\n\nHere are some of the usual vendors:\nFins on the Hoof\nThe Creme Brulee Cart \nThe Whole Beast\nKasa Indian Eatery\nCholita Linda\nEl Porteno,\nNamu Gaji\nWing Wings\nDel Popolo\nHumphry Slocombe\nRosamunde Sausage\nTataki\n\nI was definitely was happy to see Del Popolo there as they're one of my favorite pizzas. Tataki had a nice deal where you can select 2 items from their menu for $8.  And The Whole Beast always has some epic sandwich that's different every week.  They had a smoked turkey sandwich one time that was so good!!\n\nAnd it's just nice to be able to enjoy your food out on the grass with a view of the bay, especially when the weather is good.  This is their 2nd year doing this and I hope they bring this back again next year!!", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "This is a cool idea and a great way to spend a Sunday afternoon. The only drawbacks are the difficulty in finding parking and the huge lines at every food vendor.\n\nOnce past that, there is ample space to claim for yourself and the variety of food is outstanding. After getting your fill, head over to the Disney Museum!", "author": "Gene D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-04", "description": "While I LOVE Presidio Picnic and I think it's the best OTG out there, I think they really need to make some organizational improvements. \n\nJudging by the Facebook event and other promotions they did ahead of the first event of the season this past Sunday, I was shocked to see how unprepared they were for the amount of people who attended. Now I know lines and crowds are a given, but literally everything had almost a 45 minute wait. Since the main attraction is the food, I didn't mind the wait there as much, but these lines also carried over to the bathrooms. They had a little trailer with a total of 2 men's single stall bathrooms, 1 women's single stall, and a women's 3 stall. There was also a handicap private restroom, however, that one was quickly put out of commission. That means there were a total of 5 bathrooms for a crowd which probably reached at least 1,000 people, if not more. Everyone in line, including myself, nearly had an accident as we waited about 45 minutes to finally get to the front of the line. Not only is that ridiculous, but it is clearly a health and safety concern. I asked around to see if there were any other bathroom stations, and was told that these were the only ones. Very poor planning in my opinion. \n\nI'm not sure what sort of restrictions they put on this space, but I really hope they do something throughout the Presidio Picnic season to resolve these issues. If there's a way to spread things out over the entire lawn so the crowds do not all congregate in one tiny area, or at the very least if they can arrange for more restrooms, that would be a great start.", "author": "Jaymie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "I had never imagined anything like what I saw in \"Off the Grid\" at the Presidio. I've seen Off the Grid food trucks quite a few times on Lawrence Expressway in Sunnyvale, but never been there. So, when my friends recommended going to the one in Presidio, I had just imagined a few food trucks in a street corner.\n\nBut it turned out to be like night and day. It was on a HUGE lawn in front of the Walt Disney Museum and there were aplenty of food trucks and ice-cream trucks.\n\nAfter walking around all the food trucks, we got Mediterranean shawarmas. The portions are huge and they were good.\n\nYou can bring your chairs or tents or even bring your own food and sit on the lawn, while enjoying the beautiful SF weather and watching the bay at a distance.\n\nTotally unique experience. I'd definitely come here again when I visit the city another time.", "author": "Anu M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-26", "description": "I like the vibe of this Off the Grid a lot. It's in such a great place and there were a ton of people sitting and enjoying the event. There were a lot more options for food trucks compared to other Off the Grids that I've seen around the Bay Area. There was also a good variety of food trucks- there were Asian, Mediterranean, Indian, Mexican, and American food trucks. \n\nThe food was decent, but pretty pricey. We paid around $7 for a skewer and fries, which were both relatively small servings. \n\nI would recommend going to this Off the Grid, but just be prepared to spend a lot on small portions.", "author": "Arianna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Came here for a friend's 32nd birthday party on Sunday. I live in the East Bay and got there very easily (and very cheaply!) via Bart and the Presidigo Shuttle (free, every half hour from Market and Drumm - right next to Embarcadero Bart). You have to pay for parking. There were lots of people, but it felt a lot calmer and more relaxed than spending the afternoon at Dolores. Wide range of people - good for young adults, families with kids, etc. I greatly enjoyed the garlic noodles from Little Green Cycle and gelato from Luciano's.", "author": "Shoshana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "The kick off of Off the Grid in the Presidio!!!!! It was a beautiful Sunday afternoon. Tents were lined up along the side and food trucks were right across. The alcoholic beverages were served smack in the middle. Many people were laying on the grass so be sure not to step on anyone or any animal!\n\nNot my first rodeo at an Off the Grid event, so I knew the lines were going to be long. Don't let the long lines ruin your experience (4 stars) and bring cash just in case. The vendors at this event was a perfect variation. Just to name a\nfew they had: The Whole Beast, Cholita Linda, Chotto, and Salumeria (sp?). Come early!!! Parking is a little challenging and some tents will run out of items on their menu. \n\nThe lines will definitely discourage you from experiencing many of the vendors; hence, I highly recommend to come with a group and fan out! Haha. This way you can get several things at once and just share. \n\nDefinitely would love to go to some of the vendors actual restaurants when I get a chance. From what I had, the food was amazing.", "author": "Jenna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "By far one of my favorite things about San Francisco. It's just another example of why my heart belongs to San Francisco. \nEvery time I come and visit I make sure to try and  experience the city's culinary scene as much as possible since the city is known for such a diverse food culture. \nThe picnic in the presidio allowed me to try a ton of different foods, on a beautiful summer day in the park overlooking the Golden Gate Bridge! \n\nI was stoked to see Nopalito there. I had just watched their diners drive in and dives episode and my mouth was seriously watering as I was watching the episode on TV! We tried the totopos con Chile which are Tortilla chips, salsa de arbol, cotija cheese, crema and lime. Seriously to die for and very spicy! Reason alone to come back to the city! \n\nThe Creme brûlée cart which had a wide assortment of seriously decadent creme brûlée. We tried 5 different flavors and they were all to die for! The unbirthday cake and the god father were the two winners! The staff working were funny and extremely\nhelpful!\n\nFine and Rare: I tried their oyster po boy which was way to much bread and not enough oysters! But the flavor was amazing and the oysters were fried to perfection. You could see the quality of their ingredients. But for $14.00, my sandwich which was pretty small I don't think I will be rushing back here!\n\nPicnic bar and liberations had a super cute mimosa kit which come with a bottle of champs, two mixers (oj and a strawberry lemonade) in a bucket! Their Mr Pickles Bloody Mary was yummy and full of flavor and came with amazing pickles garnishes! They even offer blanket side service! \n\nMost venders were equipped to take credit\nCards and lines moved pretty quickly. I recommend arriving a little early if your brave enough to drive your own car as parking can be a pain! \n\nYet another thing that San Fran does right! When will Los Angeles learn?!", "author": "Roxy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "This review is for Presidio's Off the Grid Twilight edition on Thursdays.  My kids and I went to our first Off the Grid picnic and got there around 7:30pm, there were lots of Food Trucks to choose from but not as much as I thought, maybe 8 total.  We weren't able to sit at a campfire or have a cabana since we arrived kind of late, I guess you have to get there early for that, they start at 4pm-9pm.  The band that played was good.  The food was good, I had the Shrimp Po Boy and my kids had burger sliders, veggie burger and fries.  Not a lot of options for the vegans like StreatFood Park has.  Veggie burger was good, my daughter said though.  The day we went was a nice light evening since the Warriors were playing their Finals.  Nice place for kids to run around and play catch, listen to music, eat some grub, drink beer and wine, and enjoy the beautiful view of the Bay.", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "A wonderful Sunday gathering.  Come with blankets, jackets, and all else necessary to enjoy your time while here.  A great place to be with loved ones for a relaxed afternoon/evening following a day of adventure in SF or Marin.  \n\nTip: bike in if able, parking can get tricky.  We usually park on the street in the surrounding area and bike in.  If you are feeling a bit more playful, park closer to Golden Gate Park and bike from there after exploring the park.", "author": "Gab R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "I had been meaning to check out OTG Twilight at the Presidio since first hearing about it in April, and finally made it out on a windy Thursday in May.\n\nArriving at 4:50pm, the field was only sparsely filled. If you wanted to nab a cabana or a fire pit, now until maybe 5:15pm would be a good time to do it, as only a few were claimed with people's belongings. No one actually sat in the cabanas or fired up their pits until maybe 5:30 or 6:00. \n\nI was disappointed to see that there were only 8-10 food trucks present; not the entire lineup that was presented online. Of the few, I decided to get Koja (has never failed me), Kokio (who says no to Korean fried chicken?), and Pagan Fired Pizza (friend is obsessed with analyzing peoples' pizzas). OTG is a great place to grab tried-and-true goodies and check out some new ones too. \n\nThe fire pits and the cabanas are a nice touch to the event, but I did not stick around to enjoy either, as it was way too windy. This event is pet friendly, as evidenced by the 5-6 dogs I encountered on the field there. Live music started at around 6:00pm.\n\nOverall, the concept is great, but the food truck lineup was paltry and it was just way too windy that day to enjoy the space and the food. May consider revisiting if I have a large group of friends that wants to check it out and the weather decides to warm up.", "author": "Shirley V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Hidden gem! So basically Off The Grid hosts food picnic events here every Sunday through Fall from 11am-4pm for free(Just pay for your food if you didn't bring any, and for parking). This place is never too crowded (hardly tourists). \n\n\nWords cannot describe how beautiful and awesome the vibes are at this place on Sunday's especially when it's sunny outside. The grass is so green and there's an awesome view of the water, and the sail boats are out! When you're in SF, and it's a beautiful Sunday, this is the PERFECT place to go with a group of friends, family, loved ones,dogs, kids, etc. to have some mimosas or a couple beers, eat away, lay out, take a nap and just chill. It's very family and dog friendly.\n\n\nIts  literally a huge grass field with a bunch of food and alcohol vendors and a bunch of people just vibing on a Sunday. \n\nBYOB! Meaning bring your own blankets to sit on and you can also bring your own brew :) the alcohol there is pretty expensive, but the $10 tequila drink got me on a good one lol. Make sure to bring a jacket because the wind can pick up . \n\nALSO, the food is not like food truck portions, they're actually pretty decent sized! They offer healthy to not so healthy foods.\n\nDid I also mention that there's live music too.", "author": "Hayle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "Can't think of a better way to spend a beautiful sunny day in San Francisco!\n\nI met up with some friends here on a gorgeous Sunday afternoon. The view of the bay was amazing. We brought our picnic blanket and set up near the DJ. I love that there is plenty of parking, which is hard to come by in the city. There is plenty of space for everyone to spread out. It is family friendly and dog friendly. \n\nThere are plenty of food truck options and the best part is that there is a bar! We brought some of our own drinks but I also enjoyed the Bloody Mary and Moscow Mule from the bar.\n\nIn terms of food, you can't go wrong with the fried chicken from Wing Wing's! So good! Watch out for that hot sauce though.\n\nIf you are looking for a low-key way to spend an afternoon in the city then I would highly recommend OTG Presidio Picnic!", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "I am only reserving a star because of my own personal bias, this is a family friendly affair.  To some extent I LOVE that about the location because it is over the sprawling Presidio lawn, food trucks galore, and cocktails in the sun.  What more could one possibly need?  Bring your sun hat, a blanket, and hang out as the day allows.  \n\nMy issue, the rampant crazy children running around like banshees and their parents who do nothing about it.  This has nothing to do with the event itself, the location, or even vendors.  Just be aware, to be in the mood for wild children all around you.  Other than the restless natives, it is a perfect way to spend an afternoon in the sun.\n\nThe food truck options are expansive and to be honest I'm not sure if it changes week to week, so I know when I went everything was covered from various Mexican options, Coffee, BBQ, breakfast, Asian flair, and even GF bakery.  \n\nI love the culture of the event more than any one specific option available.  Bring your blanket, chair or whatever you want to relax in the sun, a book, frisbee, cards, whatever and chill.  Soak up the sun, grab a bite, and enjoy the incredible SF bay view.  It's a good way to remember why we are so lucky here in the North Bay.", "author": "Mandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Love it!  We thought we'd give it a try on Mother's day and we'll definitely be coming back again.  There's tons of great food, spectacular views, and general relaxation.  An awesome time all around.\n\nNotes:\n- The lawn gets crowded right in the middle but there's plenty of space for everyone.  I didn't notice a single person being an asshole which was refreshing.  Nice folks, respectful of eachother,etc.\n\n-  Parking can be a challenge.  If you go in one of the paid lots, it's $7 for the whole day.  I noticed many people cabbing/ubering in as the day went on.  If you live in the city, this is probably a great way to go\n\n- Bring a picnic blanket and chairs so you can relax on the lawn.  It can be a bit of a walk to the food trucks and we saw several people with trays to carry their food.  Not a bad idea.\n\n- Very family friendly, we saw kids from toddler age all the way up to teenagers.\n\n- Dog friendly but your dog has to be on a leash.  All the dog owners seemed to be very responsible with their pets (including us) so that was nice to see\n\n-  We froze our asses off most of the day so it's best to be prepared for all kinds of weather.  You're right on the bay\n\n-  There are two bars but they are very expensive for the amount of hooch you get so plan accordingly.  $10 for a small glass of wine, $5 for beers, and $10 for mixed drinks...not a bargain\n\n-  Our group tried a bunch of different food trucks and it seriously adds up money wise so if you have the space, it's good to pack some essentials like water and snacks for the kids to keep the cost down\n\n-  The crowd is a very good mix of people.  Tons of families, tons of hipsters, and all ethnicities and ages so nobody should worry about feeling out of place.  \n\n- I don't think it would be ideal for disabled people unless they have others who can carry the food, stand in line, etc.  Could be rough for someone to manage if they were in a wheelchair or needed to use a cane.", "author": "Jonathan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "The ultimate Off The Grid event! From brick and mortar restaurants to food trucks you'll find many options to satisfy any food cravings you may have. The cuisine ranges from American, Japanese, Indian. Spanish, Mexican and more! There are designated alcoholic beverage stations too. The event is well organized. Folks simply need to fall in line after they figured out their food preferences. The grilled cheese vendor had the longest line! Restrooms are clean and not too far from the grounds. There are lots of garbage cans around the perimeter to make it really easy for event attendees to keep the lawn clean and tidy.\n\nThe event takes place in front of the Walt Disney Museum. There is a lawn so bring a blanket or a mini tent. There are games for rent too. \n\nGetting there: most folks drive but we like to walk. If you live in SF and love to walk and Uber or Lyft.  I highly recommend it so as not to worry about traffic. The Golden Gate Bridge, Crissy Field and the Presidio trails are close by if you want to add a little hike before or after brunch", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "I went to the Off-the-Grid Food Truck party and it made for an incredible weekend. You get the best view of the ocean and it such a nice place to relax with friends under the sun. I've been hanging out there on sunny weeks and it is so peaceful.", "author": "Izzy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "This is the quintessential Sunday afternoon in San Francisco.  The views are spectacular, with iconic Presidio architecture, the Golden Gate Bridge and Alcatraz, in a rare expanse of open, green space.  \n\nThe food options are incredible, with a wide variety of both artisan and comfort foods.  Add the bar, music, and games, and it's a perfect picnic.  You can rent blankets and tents, and buy mimosa and bloody mary kits.  \n\nSome tips:\nSunscreen - you'll need it. they have it at the information booth if you forget.\nCash - wifi problems mean slow credit card processing.  there is an ATM\nParking - come early, or ride your bike\nKids - come early, it turns more adult as the afternoon progresses\nDogs - the more the better\n\nThis would definitely make my top 10 list of things to do in SF.", "author": "kimberley t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "This is such a fun and relaxing outing, especially on a sunny Sunday afternoon.  I love the open grass area with the view of the bay. There is no shortage of food with all the food trucks and food boothes lined up around the grass area.  There is a nice bar in the center serving beer, wine and various cocktails. And to top it off, there is a DJ playing music.  \n\nIf you are on a tight budget, this is something you should add to your list. You can always bring your own picnic and drinks. I see families there, dogs, big groups of friends gathering, people who find a cozy spot alone to read their books. It's a great place for everybody!  \n\nParking is usually pretty easy but make sure to pay the meter!", "author": "Mel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "I really enjoyed this off the grid event!  The amount of vendors, the grassy area, the DJ playing music and the cool breeze of the coastal area really made this a relaxing event.  Everyone was enjoying themselves out here: couples, friends and family all just having a relaxing and fun time.  If you are looking for an event to hang out, enjoy some awesome food and relax...  THIS IS THE PLACE TO BE!  Just make sure you bring some sunblock... you have been warned :)", "author": "Jose C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "Great off the grid concept because it's a picnic in SF!  Great way to spend a day in the city on a Sunday.  Bring a blanket and relax with the family, your dog, or your friends. But, the food selection wasn't that great in my opinion. \n\n- Del Popolo was the longest line, but it was ok, (3/5 stars) Margarita $11 and Sausage $14.  I don't think it was really worth the wait...\n- GO STREATERY was the best for the oxtail and grits! (4/5 stars) the oxtail was fall-off-the-bone meat, but the grits had too much of a lemon taste, I could only handle a bit of it\n\nThere were also rosamunde sausages (get their rattlesnake sausages!), tataki, namu gaji (korean which i heard wasn't that great), wing wings ($14 for 4 pieces....wtf?!), coffee, ice cream, and of course creme brulee cart.  \n\nOVERALL: nice to spend your lunch on a weekend, but I'd only come back if they had a better selection!", "author": "Raquel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Awesome location when it's sunny out! There's plenty of space to sprawl out or play some frisbee on the lawn. It's a gathering of people (and dogs) of all ages! \n\nThey have both food trucks as well as booths where food vendors without trucks can also sell their goods. Some of the highlights were Tout Patisserie, Wing Wings, The Whole Beast, The Grilled Cheez Guy, and the Crème Brûlée cart. There's also a wine and beer bar, which make this more of an \"adult\" picnic ;) \n\nIf you're going to be there for a few hours, it could be a good idea to bring some shade. Some groups brought these half dome tents that were a good shield against the sun (and wind). \n\nAs you walk closer to the water, you can get a pretty good view of the Golden Gate Bridge. Great place to chill on a lazy Sunday afternoon.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Pros: Super fun. Loads of space even when it's crowded. A million food options. Kid, dog and everything else friendly. \n\nDown sides: Lines are long. Drinks are pricy. Weather in the presidio is weather in the presidio.  \n\nHints: BYO everything - blanket, sun shade / sunscreen, seating, alcohol. Parking isn't super easy, so plan to walk a little bit or get there early.", "author": "who k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-10", "description": "Pretty location with great views of the Bay. However since it's so deep in the Presidio you are basically forced to drive here or catch an uber. Such is the way of San Francisco.\n\nI was a bit disappointed with the vendors here because the food was quite expensive and there weren't that many dessert food trucks. Also the one coffee shop didn't have decaf!", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Off the Grid at the Presidio is always a good time. Great food, reasonable prices, and a picturesque backdrop.", "author": "Alexandra F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "One of the reasons why I love the Bay Area -- it's so easy to head out on a whim to the marina on a sunny day in October and just hang out with a few friends over good food and wine.  Events like this OTG are the perfect complement!  No need to stress about marinating your veggies, filling the ice chest or packing the picnic basket -- just bring your blanket and let the food trucks do the work. Done!\n\nMy fave food trucks: Rosamunde Sausage Grill, Namu Gaji, Cholita Linda and the Creme Brulee Cart. Add to that, there's a good DJ to provide the music, and there's a cabana serving up cocktails and wine.  If you need to sneak in some shopping, there is also a small farmer's market.  If you've got kids, the Walt Disney museum is a few steps away.  But really, the best part is just hanging out and meeting new people who feel just as lucky to live in such a gorgeous city where something like this OTG thrives.  \n\nTip: It only runs on Sundays from April to October, so enjoy it while it lasts!", "author": "Dawne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "I love OTG and whenever I am in SF I must, must go to an OTG somewhere. This location is awesome!!!  Gorgeous views, music, lots of great food, (there are less trucks but still lots of options), and bars!!! woohoo!!  While you are on line for food they wheel around a wagon and will bring you drinks while you wait. Brilliant! Whats better than that???? Bring a blanket, bring your kids, your pets, a frisbee, some games. Its fun for all!!!! Stay the day and relax and enjoy", "author": "Karen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "There are so many things that I can say proudly about San Francisco and I cannot stress how fantastic Off the Grid is to newbies or tourists.  This is something not alot of outta towners know, nothing printed in any tourist catalogs, and certainly not a word of this spoken on those ridiculous double decker buss'.  Simply put, if you really wanna see the city beyond it's commercialism, this is the way to go!  \n\nThe grass area is huge for hundreds of people with pets and families to lay their blankets on the grass, kick off their shoes, put some sunglasses on, and take down a cold one.  You can see people playing little games, tossing Frisbee for their dogs, or taking a nap.   \n\nVenders are located along the side of the grass area.  They have small booths set up next to one another for easy viewing and trucks along the opposite side with their colorful trucks.  A few stands throughout the picnic area that either sell beer, mixed drinks, or game rentals.  \n\nThe place is kept clean since there's constant trash patrol going around emptying bins and picking up debris.  Parking isn't free so prepare to toss a few bucks in the meters (everyday parking permits required).  \n\nMake sure to bring come cash.  But if you forgot, there are a few ATM machines scattered all throughout.", "author": "Lea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "UMMMM, yes.  All things yes.  Sunday Brunch on the lawn with champagne, a blanket, and food trucks?  YES. \n\nI hate being referred to one of those people, but I enjoy everything about Sunday picnics at the presidio.  Food trucks galore, plenty of booze, and people watching.   Sure, you can expect the same food stands, but the trucks rotate. \n\n####Parking: hard to find FREE.  If you don't mind paying 4-5 bucks for the afternoon, there's plenty of options. The parking meters accept credit cards, so don't fret.\n\n####Weather: It's SF. Karl the Fog will inevitable make an appearance or not. Dress accordingly in layers. I have been when it's hot and freezing.  \n\n#####Requirements: Blanket, extra food and or snacks-depending on how much you want to spend-libations, fold up chairs, pillows, baby wipes, and napkins. \n\n#####Food: El Potrero, Nopalito, and the Whole Beast are my personal favorite. I also like the Grilled cheese guys, and the Sugarfoot Grits.  There's something good for all.  \n\n####Drinks: PASS and bring your own.  What a rip off for a bloody mary.  Just say no. \n\nProps for the DJ spinning beats, and Sports Basement for making an appearance.", "author": "Flor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "Was spending my Sunday morning exploring some of the areas in eastern san Francisco when my stomach began to rumble.  My husband I did some research and saw this place.  We were familiar with off the grid but had not been to one yet.  Headed over and got there around noon.  Parking was easy!  The market started at 11 and went to 4 I think the earlier you get there the better.  We had no issues with parking at all.\n\nWalking over to the market it looked sooo big, I was getting more and more exciting.  Live music and a great view add to the ambiance!  I had no idea there would be alcohol options!  That was an exciting surprise!  They had a bubble bar and a regular bar tent.  I enjoyed a delicious sangria at the bubble bar and my husband got a beer.\n\nFrom there we did a round..there were a ton of vendors.  So many to choose from.  Tons of variety.  The trucks change every week so every time you go it will be different.  I cant wait to go back!", "author": "Kate F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Other Off the Grid chains have definitely amazed me, but none of them has been as spectacular as this one. This particular Off The Grid is one that I would definitely recommend people to visit because it's not like the other chains at all. First off, the view is absolutely beautiful and relaxing. You'll find families or friends scattered all over the Presidio lawn with their tents, picnic blankets, dogs (yes, this place is dog-friendly!) and more. You can even catch a glimpse of the Golden Gate Bridge! Your food trucks are lined up in an organized fashion along the sidewalk, making it easy to navigate through and find your desired entree.\n\nFrom seeing signs to looking up the information on their website, Off The Grid at the Presidio is open EVERY Sunday from 11AM - 4PM. We went here for one of my friend's birthdays and it is definitely a nice place to kick back on a sunny day. There is so much space for any party to sit down, but I would suggest bringing a ton of picnic blankets or towels! This OTG pretty much radiates those laid-back, \"kickback\" vibes similar to one of those family barbeques you have in your backyard or similar to a picnic at the famous Mission Dolores Park.\n\nI'm not sure if the food vendors switch every Sunday, but Off The Grid always contains enough variety with each visit. This Off The Grid has way more vendors, and thus food entrees, to choose from out of the rest of the chains. From being a previous fan of many Off The Grid places, my food experience was still over-the-top amazing. First, I went to a booth named \"Chotto\" and ordered Kimchi Fried Rice with Pork Belly and Gyoza. Though the fried rice felt like it was lacking kimchi, it was pretty flavorful rice that kept my stomach happy. The pork belly in the rice dish was excessively fatty, but I mean...it was pretty darn good. The gyoza was very delicious and came with a sweet dipping sauce. I finished all of my food before my friend even received hers, which pretty much gives you a good idea of how food the good is. Lastly, I went to a booth that sold \"Three Twins\" ice cream and I ordered the Mocha Difference. $3.00 for this cup of ice cream isn't a terrible deal in my opinion, but there was nothing spectacular about this ice cream brand. I would probably suggest ordering a different dessert to make your money more worth it, such as the Creme Brulee Cart.\n\nAll in all, I had a great time at Off The Grid in Presidio. I want to warn you that it IS going to be a bit pricey with any vendor that you go to, but the great quality of the food and the fun vibes definitely make it worth your money. My friends and I enjoyed the atmosphere so much that we are debating on coming back next week!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "I have a long commute to get home from San Francisco after work every day, so I don't usually stay in the city after work. When I heard about Twilight at the Presidio, I was intrigued. My friend had coincidentally made plans to go as well, so I thought I would check it out. \n\nTIP: get there at 5pm or earlier to get a tent (up for 4 people) or firering (5+ people), the events gets crowded and these get taken first, obviously.\n\nWhy does the Presidio have to be so far away from the main lines of transport (Bart/Caltrain)? It would be so awesome if Bart was closer...wishful thinking. I looked up Muni routes to get from work to the Presidio and it was going to take OVER AN HOUR (from FiDi). WHAT?! I walked to my friend's office near Embarcadero and requested a Sidecar. He got us there in 30. If you're a Presidio resident, you can take the PresidiGO shuttle for free.\n\nI loved the truck line up when I went: Bacon Bacon (my friend got a delicious breakfast burrito), Little Red Riding Truck (I got the Bratwurst with potatoes and sauerkraut, delicious!!), Casey's Pizzaria, Lobsta Truck, and others. We got dessert at Keep Rolling (Chimney Cake, a Hungarian dessert; the cinnamon one is like a churro) and hot spiced apple cider, A MUST! It was gloomy and windy, so the hot drink was perfect. They have other drinks too. \n\nThe most important stuff:\nOff The Grid at the Presidio + alcohol - DO IT!\nMUST: hot spiced apple cider\nDon't drive...parking is a nightmare. Use a ride share service/Muni/PresidiGO\nGet there early at 5pm if you want a tent or fire ring", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "This was so cool! A huge grassy field, bordered by the Walt Disney museum and a view of the bay with a line of food trucks against the sidewalk. \n\nFire pits and white alcove tents dot the field and a live band plays music on the grass. On a blustery day, it was pretty perfect sitting here around a blazing fire, drinking hot spiced cider and eating amazing steamed buns from the food truck watching the sun set in the distance.", "author": "Jonathan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Love this event! \n\nThe food here is setup via food trucks and tents and always changing. The first time I was here last summer, we got this amazing oxtail and grits dish that was amazingggg and this time some Vietnamese grilled pork vermicelli with egg. YUM!\n\nThis area seems to be always sunny and there is a huge grassy field that everyone sets up camp with their blankets and umbrellas. The atmosphere is amazing and very family friendly! Lots of people bring their toddlers and dogs here to play in the sun. The parents are happily sipping on wine and chatting with each other and kids are running around chasing bubbles or falling over into the green grass.\n\nWhat's not to like here! This is the life :')", "author": "Seliya G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "Second time coming here and loved it, filled with people.\n\nAlthough food and drinks are expensive, you're paying for the view, the crowd, the music, the inability to find parking on a perfect day. But it is definitely worth it!", "author": "Da X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Parking is a little difficult depending what time you come and don't forget to pay! It's not free. Bring a blanket and some chairs because the lawn is super nice to hang out on and they even have some games for people to play with. Many vendors and they change weekly but some are set and stone from what I noticed.", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Picnic @ the presidio is the best out of all of the grid events. Great food selections, shorter lines, less crowded, and most importantly you can sit anywhere you want.", "author": "Martinus S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "So today was my first time here, it was great! There was a big grass area where you can put down blankets or chairs to hang out. One side is lined up with food trucks and the other side was lined with tents (food and other things to buy) & of course a couple of bars, but plently of ppl brought their own. There was a gorgeous view of the ocean as well!\n\nI was so hungry I only scouted around the food trucks (sigh, I should've walked around the whole place, there were so many more choices). \n\n*Fins on Hoof \nChicken and peas poutine 3.5 stars: I popped my poutine cherry here today (tmi???). I had my mind set on the grass fed lamb burger, but someone walked by with the poutine and I just had to change my mind. So this one is chicken pot pie contents poured over a bed of fries, with a kicker,  cheese curds! It was tasty, but I would've liked a lil more saltiness (maybe some bacon?!!!)\n\nThe other locations seem to have a different menu with a whole lotta poutine! I like the idea of poutine and definitely want to try more.", "author": "Thuy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "My favorite off the grid spot. Beautiful view of the water and plenty of luscious grass to lay a blanket down on. Come here early if you even want a chance at securing a lantern tent.  Gets chilly being at the top of the mountain so be sure to bring blankets. I even saw people bring in their own tent (very smart).\n\nIf you don't get a tent, be sure to move your blanket near a firepit. It will help you stay warm and toasty!\n\nPlenty of good food my favorites being the BBQ truck & the root beer float one. I waited in line for each of them for about 30 minutes.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "This is by far the best Off the Grid event. It has most of the same food trucks as the others in SF,  but the setting is extraordinary! There is a beautiful view of boats on the bay.  There are fire pits and cabanas to keep you cozy and warm on chilly evenings.  The whole thing is set on a nice big grassy area with lots of space for kids and adults to play,  dance,  and run around.  \n\nWe all had the Bao buns from The Chairman's.  They were delicious as usual.  My favorite is the crispy tofu on the steamed bun.  The pork belly is also quite tasty.  There are cocktails available but I didn't get one this time since I had to work early in the morning. I'll have to come back to try them out.  \n\nThe band that was playing was called Wild Couch.  Their music was fun and added nicely to the ambiance.  My 2 year old had a great time dancing!\n\nI'll definitely be going back next week to try some cocktails and different foods trucks.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "We've been regulars at Off the Grid in Haight for several years now, but last weekend was the first time we've made it out to this event. We're definitely going to start working this into our weekend routine!\nEverything was basically perfect this past Sunday, with a big assist from mother nature who obliged with a \"hot\" day (scare quotes included b/c it was SF hot, not really hot).\nDespite the crowd, there was ample space for lounging on the luxurious Presidio grass. The view is, of course, ridiculous. And, this being OTG, there was tons of great food to choose from. Lines got a little crazy, but that's to be expected at an event this size, and overall they did a pretty good job of moving people through.\nKudos to the drink stand as well. I was expecting nothing but beers, but they were also putting out some pretty solid mixed drinks (including a very yummy bloody mary). The music was a nice touch, and I liked the fact that it wasn't turned up to an obnoxious level (something that occasionally happens at the Haight OTG, depending on who's manning the music tent). \nDon't know if it was related to this event or not, but there was also a little Shakespeare in the park production going on nearby. We stopped in there for a while, but the toddlers we had in tow quickly lost the finer points of Shakespearean dialogue and strenuously suggested we move on.", "author": "Pat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Had such a great time! Bring a blanket and layers and you're set! We tried so many different foods and enjoyed just sitting on the grass while listening to the music. The trucks all take credit card which is so convenient.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Off the Grid at the Presidio is my favorite location for Off the Grid.  The best parts\n\n-  You get to overlook the Golden Gate Bridge.  So you can cross off seeing the bridge and have a great picnic all in the same day.\n\n-  Cute dogs!  When you're living 2,600 miles away from your dogs, you too will go to the Presidio just to beg dog owners to let you pet their puppies.  Luckily, they oblige.\n\n-  There are a ton of food options here.  It is super pricey, and the lines do get a bit long at the more popular booths.  But it's so relaxed and fun.  Just come with friends to  make the wait less painful.\n\nIf you rely on public transit, this is a harder Off the Grid to find, but it's worth it.", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-06", "description": "This was my first time at Off the Grid: picnic at the presidio. I enjoyed it but I prefer Off the Grid: Fort Mason better. I enjoyed the company of my friends and family, the beautiful scenery along the water, the concept of sunday funday picnic at the park with gourmet food, the weather was a bit windy but I didn't quite enjoy the food as much as I had hoped. \n\nFirst of all, i didn't know this event has more gourmet restaurants than regular food truck that we usually see. I was hoping to get my usuals like curry up now, sisig burrito, chairman bao, or bacon truck... however, they were nowhere to be found. The only familiar one was the creme brulet cart and the whole beast. Well, that was a bit disappointing for me... They also don't have as many food choices as OTG Fort mason. The food here is a bit pricey - 12 dollars for a lobster roll which was gone in 3 bites, 10 dollars for a single grass-fed lamb burger with no sides, 16 dollars for fried chicken (4 pieces)...\n\nThe food we got were pretty good. \n1. The grass fed lamb burger is super juicy - with feta cheese, wild arugula and pickled onions. It was a bit salty but very delicious (It's restaurant quality).\n2. The \"sausage\" pizza - gourmet pizza that was made on the spot (imagine the line...we waited for a decent 30 mins) was pretty popular. 14 dollars for 4 pieces. the dough was extremely soft and thin. good flavor. kind of stingy on the sausages and basil.\n3. Fried chicken - great seasoning, juicy and tender except a bit over priced! 16 dollars for 4 pieces.\n4. lobster roll - delicious but gone too soon... 12 dollars\n5. baby back ribs from the whole beast - tender and great flavor (not sure about the price)\n\nIt is a great space for such a fun event. Personally, I think it's more than enough to add on a live performance of some sort like how fort mason does it. It will add more fun to the ambiance and bring the light out of some \"still-drunk, hungover\" people.\n\nI think there's a lot more room to improve. Will I come here again? Yes. I still had a lot of fun. It is definitely a spot to hang out on sundays. Maybe I'm just very picky, a very spoiled SF citizen! :P", "author": "Mindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Definitely a great way to spend time eating some good food from a wide variety of vendors. Excellent location in the Presidio. The new Walt Disney Museum is right here too. Great place to people watch too.", "author": "Steven K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Do you like food?? Yes, of course you do! That's why you use Yelp! How fun is it to head over to the Presidio, and sample the vast selection of culinary offerings at Off the Grid: Picnic at the Presidio? Very. \n\nI fancied myself trying various offerings, and ended up with just enough room for one thing, and something sweet. \n\nThey had a booth setup with mint juleps, and other alcholic beverages. That MInt Julep $_____ kicked my butt! Very strong, but very tasty. My partner had a _____,  $_____ and it was really gross. It tasted like some food.\n\nI had some fried chicken from ____________ which was $_____, and was so hot, crispy, tender, juicy, and popping out with flavor. Awesome, awesome. \n\nShe got some amazing tacos from __________ which were $_______. \n\nWe managed to get the very last Creme Brulee from \"The Creme Brulee Cart.\" It was the Southern Lady which had Chocolate Pecan Creme Brulee with candied pecans and bourbon drizzle. They did an okay job, and it was freaking delicious, but to be honest, it didn't have the firm custard quality regular Creme Brulee has; it was more like some warm creamy pudding. I have a really hard time complaining about warm, creamy pudding. $5.50\n\nThere was also this one stand with a thing called \"almond crack.\" It was about $8.00 per bag, but very addictive (like crack). It was just some kind of chocolate almond blend. Crazy good. We weren't crazy for their bacon candies. \n\nIt was cloudy and chilly on this day, so bring a good jacket. The place is full of people on blankets having picnics on the grass. Fun times. \n\n\nHappy food trucking!", "author": "Shane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Two words - JUST GO!!  Not the cheapest outing with food and drinks, but we don't live near here so it was an awesome treat - empanadas, barbecue, pizza, donuts, drinks YUM!  Amazing relaxed Sunday afternoon!", "author": "Susan Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-06", "description": "This is for the THURSDAY OTG.\n\nUGH. I wanted to love this so bad - it's such a cool and unique idea. I should've read reviews and gone to the Sunday version, but I thought this Thursday one would be a good relief from work.  \n\nI came here around 6 and the lines were already packed...which I suppose wasn't TOO much of a surprise...except the lines for EVERY SINGLE TRUCK were ridiculously long.  They had ONE area for alcohol, with beers running out by thetime we were halfway through the line. Before 7. Fail. \n\nBy the time we got our beers, it was around 6:45 (I know), and the lines for the food trucks were just out-of-this-world long. Trucks were out of food and we were in line for 30-40 minutes and went maybe 5 steps...there was no way food would last by the time we got to the front.  \n\nLook, I'm ok with long lines, but these lines were horrible.  Such terrible planning - only 10 trucks for 10k+ people who reserved on Facebook?  You've got to be kidding me.  It was obvious you had to be here by 4 PM to reserve a good spot and actually be in a position to get food. Ridiculous!\n\nI'm hoping they have more trucks/alcohol areas next time - I was out in the freezing cold for almost 2 hours and only got 2 beers.", "author": "Steph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "The crown jewel of \"Off the Grid\" events. \n\nThere are lots of vendors... some in trucks, but most in well labeled tents. Unlike Fort Mason, they've got plenty of comfortable space for you and your friends (or family) on the grass. It's a super kid-friendly scene and last Sunday (Mother's Day) there were tons of families out enjoying the sun and food. It's a dog friendly environment as well (so long as your dog can handle crowds). They even had a small farmers market, where I quickly evaporated $40 on chocolate and mixed nuts. Rosamunde was offering a tasty rabbit and rattlesnake sausage and Namu Gaji had a killer roll. One of the better ways I can think of to spend a lazy Sunday.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "It just doesn't get any better than this.  Experiencing Off the Grid: Picnic at the Presidio breathed fresh air back into my life. The experience was so perfect that it surreal. This was very nice to sit in the grass and vibe with the other attendees at the same time as stuffing yourself silly on a perfect August day on the shores of the San Francisco Bay.  \nIt was here that I had my first bloody Mary and here that my boyfriend ordered and subsequently devoured a mini creme brulee made with Gold Grahams cereal. The scenery was stunning and the food vendors plentiful and there was ample space to stretch out.", "author": "Lucretiz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "This was a great way to start off my sunday. Food in the park; a couple beers, and a perfect view. The food venues are in no way basic and offer a variety of exotic and interesting builds. \nI was disappointed about some of the trucks not being here from last year (cuban truck was incomprehendable).\nI do enjoy the location, if you end up getting tired of the sun and no place to sit; there are some great museums lined up and all open. \nThe beer guy with the cart was awesome by the way. \nAll in all, I had fun.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "I absolutely love Picnic on the Presidio.  I have turned many friends and family on to this event and my parents love to drive two hours from their home in Modesto just to meet us for an impromptu picnic by the Bay.  \n As other reviewers have stated: The lines are long.  VERY long.  When it is super busy, we've gotten in the habit of just going somewhere else, because we don't want to deal with the masses.  But, every so often we find the sweet spot of 2:00 p.m. as an arrival time because many of the attendees have already arrived and gotten their food, so the lines tend to be shorter.\n Also, as others have stated, BRING EVERYTHING.  We've gotten this down to a science.  In our garage I house a chest full of Presidio items: Blankets, sunscreen, hats, cups, napkins, plastic utensils, trash bags, hand wipes, etc.  I've ordered nice picnic chairs from Amazon.  I'm now looking into some sort of pop-up tent for shade.  Once you get comfortable, you're set.  \n I came last Sunday (Pride weekend) and the crowd was great.  The DJ was playing awesome 80s-90s music and the crowd was enjoying themselves.  The downside was the massive wind that was so bad we ended up leaving after only an hour there.  :(  But, that isn't Off the Grid's fault and it's just one of those gambles with picnics.  If you can be fluid and expect the unexpected, you'll be fine.\n\n Oh, I'd also recommend you bring cash.  The WiFi/Internet connections there are shaky, at best, and it doesn't help the lines when you're one of those \"I only bring a card\" people and find you suddenly can't pay.  Cash helps the vendors and the people behind you.  Bring cash, people!", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "One of my most favorite productions from OTG. When I heard of the fire pits (I'm a taaaaad bit of a pyro), I about lost my s*!$ in excitement. The vendors and a lovely evening out under the stars, with a group of friends made me nostalgic for childhood camp fires (which I started)... Minus the nasty food inexperienced cooks made in the dark. \nIt's like I'm in the city but, not... I just transported all my friends to the camp fire and tents I loved so much from my childhood Girl Scout days AND brought gourmet chefs with me. \"Baller\" Girl Scout badge -EARNED :p But seriously, go. Wear warm clothes and play \"pretend camping\" in this amazing city with your friends. Bonus- The pups are welcome too (because, who would leave their dog at home for a camping trip?!) :)", "author": "Jen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "The 2013 season for OTG's gourmet picnic on the Presidio Main Post, starts this Sunday April 21 (continues every Sunday, until October 27). See link for the current lineup of vendors. http://offthegridsf.com/picnic\n\nAs mentioned in my previous review, unlike other OTG events the food vendors are mostly restaurants.\n\nNEW this year, the organizers have added a farmers market lineup. So u can enjoy brunch and some shopping too. There are 5 less street food vendors compared to last year, but they've added 15 farmers and artisans - with lots of fruits and veggies, plus artisan cheese, chocolates and baked goods.\n\nFor those who plan to go to the picnic biking, the Sports Basement tent returns again to offer free bike repairs.\n\nAlso, the Presidio Trust is joining the truck lineup with a brand new \"Roving Ranger Truck\", which distributes free educational info (sorry, no food). The inside features a lounge area, with a built-in mini library and a sound system. Very cool!", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "My friends and I went to this event last night, and we had a great time! We'll definitely be back.\n\nLocation/Atmosphere: 5/5. Can't get any better than this location! What an awesome view of the bay, and the Presidio is adorable with all of it's \"wait, are we still in San Francisco?\" charm. The atmosphere is casual and fun; there were people of all ages at this event. We didn't sit at a cabana or fire pit, but brought our own blankets and chairs to sit on. Although maybe next time, we'll come early and try for a fire pit. \n\nService/Lines/Parking: 5/5. Parking was easy, and free. The lines for the food trucks were moving pretty quickly--no complaints there! The event staff were really nice and helpful. The website says \"bring cash\" but all the vendors we went to accepted credit and debit cards as well.\n\nFood Trucks: 3.5/5. Decent selection, but not a lot of vegetarian, vegan, or gf options. I'm surprised, San Francisco! And some of the options that were \"vegetarian\" weren't *technically*--e.g. \"we fry the okra in the same oil that we fry this chicken in!\". Not a huge problem for me, but one of my friends doesn't eat meat, so we had to look around a bit to find her a good option.  Also, we overheard a parent who's child had some sort of fish allergy saying it was hard for her to find something for him to eat. The beer/wine/cocktail tent was great--and had a lot of options. However, the drinks were a bit pricey. $11 for a glass of wine--the selections they were offering were probably around $13/a bottle in the store.  \n\nOverall: I'd definitely go to this again! Next time, we will BYOB. If you're going and have any sort of food restrictions: maybe bring something to eat in case none of the food trucks have anything for you. I'd still recommend going, because the atmosphere is quite fun.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "I looooooove Off the Grid. The concept is great (they organize food trucks markets and select them), people working for OtG are really nice and helpful.\n\nOff the grid: Picnic at the Presidio is taking place every Sunday from 11 AM to 4 PM from April 21 to October 27 on the Main Post Lawn in the Presidio.\n\nThis event is open to everybody: children, dogs, bicycles...\nThey have restaurants tents, food trucks, farmers, 2 bars (mimosas, beers, bloody Marys...), free bocce ball, yoga and games.\n\nMy favorite places are: Go Streatery (Oxtail and Grits: Fall-off-the-bone, braised beef oxtail, gravy over grits, topped with orange zest and chopped parsley), The Whole Beast, Humphry Slocombe (Chocolate Smoked Sea Salt) and Ritual Coffee.\n\nMy recommendations:\n- Come early! The lane in front of pizzeria Del Popolo starts before the truck open its doors!\n- Bring some sunscreen, sunglasses, water and hats! The 1st time I got sunburns. Please be careful if you bring young children! It can be very hot (and it can also be windy).\n- Bring a bag to carry the vegetables, fruits and flowers you are going to buy at the produce market (Blue House Farm have really cute bouquets!).\n- Use the restrooms situated in the Walt Disney Museum. It's more convenient then the porta potties. They are downstairs.\n\nAlso good to know:\n- Most of the vendors accept credit card; but some of them don't (example: El Porteno). So, bring cash or use the ATM machine Off the Grid provides. It's next to the Information tent (near Del Popolo's truck).\n- If you loose something on the ground (ID, keys, sunglasses), ask OtG staff at the Information tent: usually when people find keys and stuffs, they bring them to this tent.\n\nEnjoy! :D", "author": "Chloë O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Headed here for some food of course! We weren't prepared so we didn't have blankets, chairs, tents, nothing. This was a great set up for families and friends to eat & kick it/laid back.\n\nOur favorite food truck is The Lobsta Truck but they weren't going to be here today, Sunday... So we decided to try some new trucks. \n\nI got my first ever egg Benedict, the \"San Fransisco\" from Benefict Arnold's. It had crab, avocado, white pepper and I asked for no green onions. It was AMAZING! Made me wish I got the two eggs instead! It was the best, I killed it so fast I couldn't even savor the flavor, lol.\n\nNext we had teriyaki skewers and fried rice balls from .. I forgot the name of the truck but it was Asian something. The teriyaki chicken skewers was really good. Then my boyfriend got garlic noodles from a Vietnamese truck, he said it was good but the noodles was a little dry.", "author": "Yee W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "During the non-winter days, if my friends from out of town are in San Francisco, I would always bring them to this if they are here on a Sunday. It's a great way to start off the day, and then head to Golden Gate Bridge or Crissy Fields.\n\nMy favorites? Cholita Linda, El Porteño, and the Whole Beast. \n\nReally, you can't go wrong with some good food, a picnic outside on a gorgeous day, and some good music. (And puppies!)", "author": "Joanne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Nice area for picnic and food truck items. Bring your own chairs, tables, and kids. Not too many dogs as I think the dogs would do it on the large lawn area and leave a smell / residue even if owners picked it up. How's that for your picnic blanket and kids running barefoot. Parking is currently $7 / day or $1.20 / hour credit card or coins with no change 24 x 7 except Federal holidays.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Wow, fantastic street food.  Saw them on Triple D and was able to coincide a couple hikes in the Presidio with an Off the Grid fest on a Thursday evening.  Super friendly and fast service.  The \"burger\" sandwich (with grilled beef) was super tasty.  The kamikaze fries with kimchee were amazingly good!  I'm so glad I was able to taste their food!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-27", "description": "So this was my first time at OTG Picnic at Presedio. I've gone to other OTG events, but by far I enjoyed this one the most. It's in a great location in the Presedio. Nice lush green grassy lawn, lots of vendors ( 16 food trucks ) and a farmers market. Parking was pretty easy considering how there was so many people.\nThe crowd is very paid back and friendly. Family's, dogs, children are abundant and great to see. You get a nice family feel. The lines are long for the food but that's to e expected. A wide variety of different foods to choose from. Mexican, Indian, pizza, fried chicken, ox tail, barbecue, creme brûlée the list goes on. That's what makes OTG picnic at Presedio so much fun. The variety of food and laying down on the grass with music playing makes for a great Sunday in the city.", "author": "Roger P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "This is a pretty epic Off the Grid, especially on a nice day. \n\nA good selection of food trucks from Indian, pizza, Korean/Asian fusion, Japanese, southern (? ribs and fried chicken), ice cream and tasty looking sandwiches. Nobody will go hungry at this event. There are a few other stands from chocolate to fresh fruits and vegetables. There are a number of wine and spirits stands - they even pull around wagons filled with mimosa-making ingredients.\n\nThere's plenty of room to spread out on the big lawn in front of the Disney Museum, so bring a picnic blanket.\n\nI've only been on cloudy days, so parking wasn't an issue but I would imagine it would be tougher on sunny days.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "My family and I had an amazing time at Off the Grid: Picnic at the Presidio.  We arrived about 20 minutes prior to opening so we found plenty of parking and there were no lines at the vendors/trucks so it was awesome! \n\nWe didn't bring a picnic blanket but will definitely bring one the next time we visit. \n\nIt was a cold, foggy day in SF but we absolutely LOVED the view of the Bay.  It was beautiful.  \n\nI loved the music they played and it made for a super relaxing fun day.  I've been a lot of the Off the Grid events and this by far was the best and most relaxing. \n There were no long lines and people were super friendly.\n\nI loved that I got to try so many different vendors.  Bring cash too because some vendors don't accept cards.  Highly recommend - especially for families with young kids and dogs. \n\nSuch a great time!", "author": "Christine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "This place is great for families! Dare I call it the \"Adult Dolores Park?\" No smoke, drum circles or miscellaneous blaring music, just a good old-fashioned town picnic with access to great food, desserts, drinks, restrooms and occasionally fun, local vendors. There's a DJ keeping the music consistent and enjoyable, and a nice person by the receptacles to assist with the compost/recycling/trash enigma. Lots of (paid-$4 or$5) parking, easily accessible by muni, and emboldened by the majestic backdrop of the Golden Gate Bridge and San Francisco Bay, this is a perfect place to spend Sunday afternoon with the family!", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Great vibe. I got there late so please dont make that mistake. I was there around 8:40 and din't know the food trucks shutdown at 9pm. Live music, camp fires, beers and amazing truck food make this place AWESOME!", "author": "Hector H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Just went here today for my friends birthday. Awesome time and great food. I had a brisket sandwich and some fried chicken with BBQ sauce #yum! Then I had a couple drinks and kicked back hard. Awesome Sunday!", "author": "Chandler H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-03", "description": "My friends and I ended up going to the first off the grid at presidio. I was really looking forward to it since I have never been in this area. When we got there, I was a bit disappointed. At around 2pm all the lines were extremely long. The average wait time was about 45 minutes to an hour for food. I was really surprised that there weren't more food vendors for the opening. We ended up giving up on the food line and just ate the chips that we brought. I would definitely suggest bringing your own food if you're not trying to wait in line. The restroom line for the portable bathrooms took about an hour. Two of the stalls were broken so a ton of girls were waiting in the guys line. Later we found out that the restroom at Walt Disney museum were open. I definitely suggest taking advantage of that instead of the portable bathroom. Overall the vibe was really nice but the lines were just ridiculous.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "I use to love this: Sunday afternoon, food truck, drinks, sun..\nI went today and paid $12 for a small mimosa in a plastic cup. Not worth it anymore for the drinks, just bring your own and enjoy the sun!", "author": "Alexandre T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "We went here on the fist day of the Picnic. Absolutely loved the setting. Lot of cabanas and fire place. Live band playing, Food trucks parked all over. It was a bright Thursday evening, but very cold weather. Better to get your own blanket and grab a place near the fire place. There was a long queue at all the food trucks. We actually stood in line for two hours just to get burgers. But it was worth the wait. Everyone around was having fun. It will take place every alternate Thursday. I am planning to visit again with more preparation. In fact not a bad idea to get your own drinks and food and sit in the park. If you love dogs, this is your place because lot of people come here with dogs and they too have a lot of fun. The trucks do accept credit card but good to have cash. Ample parking space around.\nReach early to grab a good spot", "author": "Kunal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Great truck, got to try the Kimchi Balls and the Chicken KoJa on a Garlic-Rice-Bun, and the atmosphere especially during sunset is just extraordinary.", "author": "Martin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Various food trucks - I had a great kale salad but unfortunately I do not remember the name of the truck. The rest were so and so, at least from my point of view - no real stands out. Drinks are overpriced and hard to get - continuous line and not a big variety.\nAmbiance and views are great - people are having a good time and that is what it counts!", "author": "VIORICA C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "It's an awesome place to come on a Sunday! It was my first time going to this particular location and I was impressed. The lines weren't bad at all and the vibe was just great. Being able to sit around for a picnic and watching all the cute dogs was relaxing. I don't remember what we got exactly, but the ribs, lobster roll, and creme brulee were delicious! There's a variety of selections, and they even have alcohol or coffee. The event is well organized with both tents and food trucks along both sides.", "author": "Maggie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-02", "description": "The place was great. All the food truck lined up along on one side of the meadow. I thought there may be more than just 8 or so but it was still a good variety. There were mostly food trucks that we had no clue about so it was fun just picking one to line up for. The lines were LONG! at least 40 - 60 minutes wait. Our first stop was a food truck name BobCha. It is this Korean joint that had a mix of the American/Mexican culture. They had rice bowls, fries, tacos, burritos, etc. My friend ordered the bob burrito while I got the kimchi fries. The burrito was not too bad, not that exciting either though. It was basically the korean bulgogi beef plus rice and lettuce but the kimchi fries was DELICIOUS. It had kimchi, bulgogi, their home made hot sauce and melted cheese. It was savory and sweet. The meat + the sauce + the cheese really kicked the night off well. Great starter. Walking around with this big box of fries....people were all \"whoa...that looks good\" IT WAS YUMZZZZ.\n\nToday was a bit windy so it started up kind of chilly already. But whoa...as the night went on and the sun started to set, it just started to get freezing cold. Being in such open space, I would expect Off The Grid to have outside heat stands. I've been to the OTG in Fort Mason and they have live music and heat stands. I had similar expectations for the Twilight tonight but there was none. No heater, no music, and sadly not enough lightings! This is a disappointment because the banner on their website showed a lot of tents and lights and it felt so warm and bright. Really wish there was some music at least. \n\nEventually, we got so cold that we had to leave lol. Definitely an interesting area though. Maybe it is just be but I need Music everywhere lmao. So not having music in this OTG made me feel a bit \"awwwwwwww\" *sad face*", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "There's no way avoiding Off The Grid on Sundays when I work nearby. When I get to work, I see them setting up and by lunch time, I can grab some food. Some vendors are pricier than others but there's definitely food and desserts for everyone's taste.\n\nThe only food truck I've tried that has visited Off The Grid is Del Popolo! Their pizza is delicious but I'm a sucker for pizza. I tried their Margherita pizza and it's awesome for how it's made.\n\nI've tried other food vendors like Grilled Cheez Guy, Firetrail Pizza, Peter's Kettle Corn, and Cochon Volant BBQ. \n\nGrilled Cheez Guy's \"spicy\" grilled cheese sandwich was decent. It wasn't as flavorful as I thought it would be. Firetrail Pizza is similar to Del Popolo where they bake your pizza on the spot. Peter's Kettle Corn's popcorn is delicious if you're into it. I typically choose kettle popcorn over butter popcorn, if you've never tried it--you're crazy. As for Cochon Volant, it's yummy. A friend has tried their BBQ Parfait and enjoyed it. I've tried their BBQ sandwich which I wish I had gotten more of their sauce because it tasted a little dry. They're known for their sauce so it's okay to ask for more BBQ sauce.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "This a great way to spend time outdoors with family or friends on a sunny Sunday afternoon in the city.  Bring a blanket, grab a spot on the green lawn with a spectacular view of the Bay.  Hungry or thirsty? Not to fret, there are over 25 food trucks and local farmers selling delic'sh cuisines from all over the world. If you're feeling lazy and hate standing in lines, they even have folks walking around with bloody mary and mimosas kits to make your day!  It's kid and dog friendly too.", "author": "Zaina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "What's not to love?\nEvery craving can be satisfied! Food you didn't even know you wanted to try is there!\nBeautiful setting. Throw down a blanket, set up some chairs & a perfect day awaits.", "author": "amanda e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "The nicest thing about this place is that there's a booth with a DJ playing music, if a tad too loud enough to awaken the dead at the nearby military cemetery.\nLots of families with little kids hanging on the green grassy lawn. Wait, don't we have a drought?  Why does the Presidio Trust get to water their lawn?\n\nThere is parking available but if you arrive after 12PM, the cars are driving around like sharks, not obeying the \"pedestrians have the right of way\".  A stupid SUV driver tried to run us over twice while we were at the CROSSWALK\" because he was too impatient trying to beat out another car to a parking space.  Even on Sundays, you have to pay for parking there. \n\nThere are not that many food trucks (lined up on one side) vs. restaurant tents (on the other side).  I've noticed that the prices of the food are now more expensive than what you'd pay at a sit down restaurant.  Hubby got Indian cuisine for $9 and it didn't taste that good.  Have had better from the pre-prepared/packaged Indian food in the refrigerated section sold at Costco!\nWe went to the longest line - Green Cyclo.  Still their garlic noodles with Mary's chicken came to $11.  We got 2 of those and an extra order of garlic noodles for Hubby and it came to $28 for a total of $37 to feed 3 of us.  I could have had more food at a local Chinese restaurant with leftovers for lunch the next day.  \n\nThe food at Green Cyclo is always good.  Saw a banh mi sandwich go by and it looked good.  But at $7, and when I boughr Jr. Yelper one of those sandwiches on Irving Street which had more meat in it yesterday for under $5, you feel ripped off.\nAnd, there's no big overhead rental space that these food trucks have to pay.  \nI know it's Mary's chicken and all that but still.... \nI think these food trucks realize that the wealthy hipsters and techies in SF are willing to pay the prices, so they charge as much as the market will bear.  \n\nThe most eye popping pricing was the fried chicken tent serving 8 pieces for $28!!\nI can fry my own TWO whole chickens for that price.  I know some of the local restaurants are hurting from the food trucks and I think if these trucks continue to overprice, I'd rather take my business to the restaurants.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "Located in the Presidio on the Main Post Lawn, this market is at a beautiful location. There's generally a lot of parking since you have to pay everyday except certain holidays: $1.20/hr or $7 for all day. Apparently OTG partnered with the Good Food Awards to add to the truck & tent line-up where they rotate 5-10 Good Food Awards members and winners every couple months through the Presidio Picnic season. There's a DJ for music and even a small tent where you can rent small sports equipment to play (i.e. Frisbees, footballs, soccer balls, etc).\n\nBeen wanting to go to this OTG market since they opened but hadn't had the chance to till this past Sunday. Nice sunny day, I wanted to go to the Yoda Fountain and then trek around the Presidio a bit so we opted to go to lunch here to save time.\n\nVendor Lineup on 10/26/2014\nCholita Linda (Tent)\nChotto (Tent)\nCochon Volant (Tent)\nDel Popolo (Truck)\nEl Porteno (Tent)\nFine and Rare (Tent)\nFins on the Hoof (Truck)\nGo Streatery (Truck)\nGrilled Cheez Guy (Tent)\nKama Food Lab (Tent)\nKasa Indian (Truck)\nLittle Green Cyclo (Truck)\nMendocino Gluten-Free Baking Company (Tent)\nNopalito (Tent)\nNosh This (Tent)\nPeter's Kettle Corn (Tent)\nRosamunde (Tent)\nSAJJ (Truck)\nSugarfoot Grits (Tent)\nSweetdragon Baking Company (Tent)\nThe Creme Brûlée Cart (Tent)\nThree Twins (Tent)\nWing Wings (Tent)\nThe Whole Beast (Tent)\nYerena Farms (Tent)\n\nAlcoholic Drink Tent:\nBeer Kit: 5 bottles of beer\nMimosa Kit: Bottle of Cava, pint of juice (orange or papaya)\nBloody Mary Kit for 5 drinks, jar of artisanal pickles, hot sauce and ice\nPicnic Specialty Drink: Frozen Mimosas\n\nOur Orders:\nSweetdragon Baking Company: ($6/bag) Pumpkin Ale Brittle and Day at the Park Brittle\nThe Whole Beast: Halloween Salad ($5); and Pulled Pork Sandwich ($12)\nCholita Linda: ($8) 2 Fish Tacos\nThe Creme Brûlée Cart: Meow Meow ($5) Vanilla Custard topped with Caramel Drizzle and cookies\n\nWe came fairly late (around 2:30PM) so many of the vendors were sold out. As we were walking around trying to figure out what to eat, we sampled Sweetdragon's Brittle and ended up buying two since we enjoyed them. The Halloween Salad from The Whole Beast was interesting and tasted very healthy. The Pulled Pork Sandwich was topped with a cinnamon slaw which definitely went along the Halloween theme. Cholita Linda's fish tacos were amazing. The fish wasn't overly battered and there was a good ratio of fish to filling. As to the creme brulee, luckily we were sharing because it was super sweet. I could barely finish half!\n\nDefinitely would come back as it's a great way to enjoy the outdoors. Next time, hopefully my BF wakes up earlier.. ^^;;", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "*DJ, Food Trucks, Long lines, Great Views*\n\nProbably my new fave Off the Grid spot.  \n\nBring a blanket and lay in the grass.  Enjoy the views of the bay and partial GG bridge.\n\nParking $1.20 an hour and limited.\n\nDefinitely recommend.", "author": "Rimi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "We went on 6/14/15 with our two boys, age 14 and 6. Our 6 year old had a baseball game that morning so we didn't get there until 2pm. We were still able to find parking and plenty of space to pitch our shade tent. We came from Woodland where it was in the 90's and in our rush to get to the picnic, forgot to pack sweaters/light jackets. It was in the 60's in SF and windy so that took away from the experience.\n\nSince we also got there closer to closing time (which is 4pm), some of the vendors ran out of their popular dishes.  I only had enough time to wait in one line so I went to the Green Cycle and got the vermicelli noodle with beef and the Bahn Mi sandwich with beef. Both items came up to $27 which I though was quite expensive. The beef was a little chewy for a sandwich meat but it was seasoned well.\n\nTips from other Yelp reviewers recommend to bring your own drinks and alcohol to cut back on cost. We packed a small cooler with bottled water, juice boxes, and a couple bottle of wine. \n\nWe will definitely come back another Sunday but come early so that we can try some of the foods that we didn't get to.", "author": "Marissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "ABSOLUTELY BEAUTIFUL LOCATION! 360 degrees just beautiful!\n\nFood was good, even had great coffee.\n\nLarge area for lots of people.\n\nOur 8 month old son and 7 year old dog felt welcome too!\n\nMusic was great.\n\nPrices are reasonable considering it's San Francisco!!\n\nThe grass is well taken care of.\n\nThe walk there from Chrissy field is an easy 10-15 minutes (we cut through starting on Divisadero). \n\nI guess the only thing I'd recommend to make it perfect was to organize the groups of foods together. Or have larger signs indicating what the food items are on the bigger signs above the tents. There is chalk boards everywhere and you have to really look around to see what place serves what. \n\nOverall, this is a GREAT SUNDAY activity! We will definitely visit again!!", "author": "Elease A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "My kind of Sunday funday! Food tents and trucks and a pop up bar all set in the gorgeous presidio is a good time!  Although it tends to get packed later on in the day so its best to get there early unless you want to stand in a 30 minute line for Del Poppolo which is not a good time. There's lots of food choices so you can eat to your hearts consent all day.  I bring my pop up tent and bottle of wine and hang out, it's a nice way to end the weekend especially if you've been out late the night before.", "author": "Katrina E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "What a beautiful day. Bring some lawn chairs (you'll want them, even if you're a teenager), grab your choice of delicious food from among 30 or so food trucks and booths, and sit back and enjoy the view. The weather cooperated today, the dogs were out in full force and so were the babies. It's just a really lovely spot in a world-class location. We stayed for four hours with no cocktails and it didn't seem all that long. Lovely. I'm an hour away but would love to return again and again. I paid $7 for all-day parking a few steps away, although I'm not sure it was actually required since it was Sunday. There were plenty of port-a-potties - no lines. Very convenient.", "author": "Leslie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "Fun family day! Great food! love the gelato truck. It was a bit windy but my son, wife, and dog loves spending  the whole day lounging on the lawn so not a bad Sunday activity. Can't wait to go back next Sunday with a bigger group maybe a sun tent for shade and a stocked cooler", "author": "Matt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "Came here a few weeks back when it was still \"in season\" and it's now one of my new favorite things to do In SF (or will be... come March). \n\nWhen the weather's nice, this is the perfect place to spend a Sunday afternoon. Bring a blanket, find a nice spot on the grass and eat/drink until your stomach physically can't hold more. There's a DJ blasting a good mix of tunes, and it's perfect for people watching, taking your dog out, or just soaking in some vitamin D. \n\nThere's a great mix of vendors, offering a variety of delicious food. Is it any cheaper than your favorite brunch spot? Probably not. But you can't beat the atmosphere, and where else can you eat a BBQ pork sandwich and a fish taco simultaneously? I only wish the vendors offered half portions so I could have tried even more. Also, there's a bar serving beer, wine, frozen mimosas (yes). \n\nMy recommendation? When March rolls around, get your butt to Picnic at the Presidio. You won't regret it.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "One of those SF things that I wish I discovered sooner... I was there yesterday w/some friends enjoying the beautiful Bay view, those frozen mimosas, food trucks, and the air show because it was Fleet Week. On a warm Sunday afternoon, this may be the best SF activity to do.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Date night in the city never got so easy - beautiful scenery, great food, fire pits & cuddly cabanas.  Rotating live music, several food options such as curry, Vietnamese street food, pizza. BBQ, and ice cream though a s'more fixings stand would be a welcome addition - also a movie night could work in this venue.", "author": "Donna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "I finally made it to OTG picnic! I've been meaning to try out the Presidio's Sunday Off the Grid, but I'm often away on the weekends and just hadn't had the chance (plus kept forgetting). But this Sunday I didn't feel like leaving the city, and a few friends and I did an urban hike from the Haight to OTG. \n\nIt was a beautifully sunny day, until we got our food and sat down. Then the clouds/fog rolled in and I was freezing. Of course, on the walk home, the sun was out again. Oh SF.\n\nBut anyway, now on to the important stuff. I really like this Off the Grid simply because there's so many options! There's a few of the usual suspects (ie. food trucks) but then there's also a bunch of tents set up where local restaurants sell their food as well. For example, I got the pork tamales from Nopalito's tent and they were great. When I ordered them, I actually didn't realize there was pork inside (and I don't typically eat pork). But once in my hands, they looked so great I ate them anyway - and wasn't disappointed! I also got an amazing kale salad from The Whole Beast - it had this lovely creamy dressing and was topped with whole peanuts. I usually don't like kale either, but this salad totally changed my opinion! Definitely a day for firsts :)\n\nThe picnic aspect is appealing too. At most OTG locations (like the one near my apartment in the Haight) there isn't enough seating and you end up standing around, trying to hold a drink and eat at the same time, and the venture usually ends with food on the ground or on the shirt. You also end up very cold, because it's in the evening, and we all know that SF is incapable of serving up a balmy night.\n\nBut here, you just bring along your blanket and voila, more seating space than could ever be filled! And sunshine! (Well, if you're lucky). But beware, there is a plethora of small children, strollers and dogs. So if that ain't your thing, watch out. \n\nOh, and they also have a row of port-a-potties which were very clean. Good job OTG!", "author": "Lindsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Great way to spend a Sunday Afternoon. \nClean, Music, lots of food options. \nPlenty of space to lay down a blanket, bring some chairs, lots of people and make a day of it. \nGreat for kids.", "author": "Sabrina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "\"It's like Dolores Park but with tons of kids instead of weed.\"\n-a super handsome man, 2013\n\nSo many great things about it. I'll try to keep it short:\n\nFree parking- I couldn't believe such a thing was possible!\nSuper lushy grass- Wanna find a lush grassy spot? Easy! Try anywhere!\nWould you rather look at boats? Great! Just face the water!\nFeeling like making bloody marys but don't want to go home and get everything you need to make it? - Wait for the little rolling cart people to come by and purchase a bloody mary kit!\n\nI'm not a fancy food truck person but I am super grateful that our friends suggested it for an outing. Excellent picnic spot, perfect opportunity to try something different, and really great family-friendly environment. \n\nWe'll be back.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Very few words,, fin awesome place .. \nafter u stuff ur stomach with food,, u can walk, drink or do wthever u like here or around golden gate,,,\nparking is lill mess,, but if ur patient enough ,, ull find one \n\ndnt forget to bring some shade to put ur face under ,, if ur  dat kind of guy ,, u know wht i mean :)", "author": "C S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "About 9 trucks. But they have cabanas & camp fires to keep you warm. so get here early & there's plenty of parking. $1/hr or $6/all day. Free after 6p.", "author": "Christi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Loved the location, music and there were enough food/drink options without overwhelming you. Had some good pizza, some kind of yummy lemon donut hole things, and a \"girl scout cookie\" (samoa) creme brulee that was delicious. Also watermelon lemonade that was very tasty. If we lived in the bay area we would come to these all the time. I would recommend getting cash before you get there because both atms were out by the time we got there, but most of the vendors accepted credit cards.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Beautiful sunny day, awesome view of the bay and Angel Island, large stretch of soft grass, great music, and a chill, family friendly setting (our kids could spread out for games of frisbee and catch).  Great food trucks and tents.  A perfect way to spend a summer Sunday in the greatest city on earth!", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Big fan of Off the Grid, but never knew this existed.  A beautiful Sunday in the park with friends and our kids.  Great variety of food to select from.  Music, booze, food, friends... what more could you want?", "author": "Denise M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Been here only once and it was a nice beautiful day.  It's a Great location and parking isn't actually bad.  As with every OTG, there were a lot of food choices, take your food, then bring a blanket to lay on the grass.  It's a family-friendly OTG spot.", "author": "Claire J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Came here last night hoping to grab a cabana or fire pit at Presidio but everything was taken. But the beautiful park, clear skies for an awesome view of the Golden Gate Bridge and a wide selection of food trucks made up for it. \n\nMy girl and I got some food from Chairman Bao. We got the baked pork belly and the coca-cola braised pork bao. Both were delicious and highly recommended. \n\nWe got a side of Kamikaze fries from KoJa Kitchen and they so not disappoint. Their are so many flavors that makes it a \"go-to\" item anytime. The price may be a bit steep but compared to other Korean fusion places with fries, it's definitely better in quality and quantity. \n\nLastly, you can't go without trying Garden Creamery. Any gelato or ice cream flavor you get is top notch and made with local ingredients. We had maple bacon croissant, stoner milk, and ritual coffee. \n\nIf you're a foodie, you got try going to one of the events!", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "I love the Off the Grid concept, and I will argue that this is the best version in San Francisco. It encapsulates my idea of the perfect Sunday afternoon: rounding up my pals and a few blankets, staking out an idyllic patch of lush grass, and noshing until our hearts are content. The Presidio is the ideal location to escape the city without actually leaving it, and the prime selection of vendors is impressive: when I was there most recently, we sampled from both Rosamunde Sausages and Del Popolo's Pizza--two SF favorites. I guarantee there will be something there that will win over your taste buds. There's even someone who rolls around a wagon of libations for blanket-side beverage service. You CAN'T lose! \n\nThere's a plethora of people-watching and it's super dog friendly as well. If you find yourself poised with a beautifully lazy Sunday in your hands, don't hesitate to take advantage of this pre-packaged picnic. Roll me home!", "author": "Meredith C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "I'm a lucky gal to have gone from this year's opening weekend of Smorgasburg in Brooklyn to opening weekend of SF's Off the Grid Picnic in the Presidio within a week. I'll admit I complained about the SF food festival scene after eating in NY but the picnic was really a nice treat. The sunny weather brought all the Dolores Park and Crissy Field regulars to the Presidio. The crowd was a mix of families with kids, bros, and even some sunbathers. We knew to get there at 11 when it started and saved spots away from the vendors where it got too crowded.\n\nWe were able to order food and alcohol before the lines got crazy long and vendors ran out of food. The vendors were mainly from restaurants so it was nice to see different offerings from the usual OTG lineups. Highlights included fried chicken from Wing Wings (not offered at their shop), Del Popolo pizza (there were 3 or 4 food trucks), smoky potato salad from Whole Beast. The alcohol was expensive - beers $6?, bloody Mary's and mimosas $9-10. \n\nThings to bring since I was rusty on picnicking:\nBlankets\nPlates, cups, utensils, napkins, wet naps\nAlcohol and other drinks (so you don't have to buy there)\nSnacks (in case vendors run out of food or have something to eat while you're waiting)\nSmall bags for garbage (garbage stations emptied regularly)\nGames (Sports Basement has a tent where you can rent games)\n\nOverall, this was a well organized event. Use the restroom at the Presidio visitor center. Bring cash just in case. Maybe it was the alcohol but I spent 4 hours at the picnic. I'd definitely go back to check out other food. I only hesitate because of how crowded this event will get.", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Awesomeness!!!\nThis is really something we are lacking in Toronto. Actual good food trucks/pop ups with a great setting, loads of green space for people to enjoy their food and good dj/music to boot.\n\nI don't remember the names of the places, cuz we got way too much in a short time.\nWe had:\n- Wagyu beef on garlic noodles ($15)\nLoads of garlic and tender wagyu\n- Fried chicken (4 large pcs @ $14)\nStandout flavour, crispy skin and tender meat.\n- Lemon ricotta doughnuts ($3)\nVery refreshing, not too sweet.\n- Ramen burger\n- Croquette\n- Fish tacos\nGood flavour and crunch... Could only do one bite tho cuz I was way too full\n- Cheese pizza ($13)\n- Nutella creme brulee ($5)\nA little too sweet.\n- Chocolate creme brulee ($5)\nGreat flavour combo, a bit of sweet and tang\n\nWe were crazy full, we had to take a nap. Luckily my sister always keeps a tent and picnic mats in the car. Bonus... Beautiful view of the Golden Gate Bridge.  Loads of free parking and the beach is so close you can easily collect all your food and drive down for a picnic at the beach.\n\nI can do this everyday!", "author": "Daphne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Love it! Wish there was something like this hosted out here in LA regularly. Maybe there is and I've missed it? Please feel free to ping me if I have! \n\nThe Presidio is beautiful, with a great view of the bay and sail boats. The grassy area was perfect for picnicking and playing. I loved how they have plenty of trash/recycle bins around and someone keeping an eye on it. It never got too full and disgusting. Thank you!\n\nThe stalls/truck in attendance all sounded good. We ended up getting a variety of things to share and it really worked out. The selection of food options was really good and every thing we tried that day was pretty good. \n\nI love how they have picnic/lawn game rentals, and drink wagons making their rounds on the grass. It was my first time and I didn't think to bring blankets and such... luckily my friends, local to SF, did :) But if they hadn't, I could have rented something for the day!\n\nThe crowd was fun and friendly. Doggies and kids all around. It was breezy and overcast, but the bloody mary and friendly atmosphere kept me warm.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "Pretty cool event. We went on Labor Day weekend and the crowd was absolutely insane. Each line took about 10-15minutes, which is too long for my tastes especially for how expensive the food is. After about 3PM most of the vendors are running out of food so don't bother showing up around than because you'll be stuck with limited options. We ended up getting food at the Grille Cheez Guys and some mexican tent. Both were good, but in classic food truck fashion they used excessive amounts of butter and fat, which I am not a big fan of. My friend also ordered a mint julip and they didn't even bother putting mint in it...", "author": "Erik M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "Absolutely loved this version of OTG. Such a great way to spend a Sunday afternoon in SF , especially on a sunny summer day. Loved the food trucks and vendors, information booth was helpful. It was well planned and love the concept of a bar in the middle. Next time we will bring blankets to sit on as it seems like a nice area to relax. It's nice to see the different types of dogs as well that come by the event. Good place to bring the whole family.", "author": "Ellin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "I love all Off the Grid events that I've been to! Definitely a great place to try a bunch of different kinds of food at once. \n\nThis was my first at the presidio and honestly I really wanted To go because of the tent I thought I was going to have. I wish there were more b/c there was so much lawn space in the back. Traffic and presidio being at the farthest corner of sf, we end up being late. Go early if u want the tent!! But we still caught the sunlight before it went down. It was actually a very nice day in sf! (Didn't freeze in a t shirt) Definitely love the location and that you can see the bridge and there's so much parking.\n\nLines were long but quick. You already know the drill. Totally worth the wait of course.\n\nComplaints: rude sf people... The lawn is huge, can't you find another place to sit instead of right next to us? The lawn didn't even fill up to every corner. SOME PEOPLE... I just don't understand. Get out of my personal bubble. I guess there's not much OTG can do, but I hope people read this and like be more considerate. -_-", "author": "Katie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "Awesome event.  Great outdoor scene.\n\nCabanas get taken up very early.\n\nGets cold towards the end, so bundle up.  Bring Blankets and such.\n\nFood lines get very very long.  So just be aware.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "Expensive food but pretty unique fare. \n\nGotta love a place where you can openly sit and drink beers and in the park, even if you didn't buy them from the bar tent.\n\nThere's a bit of a dog/human problem. Some humans can't handle leaving their dog at home even if their dog is an asshole. They're, in fact, so ignorant that their dog is an asshole that they seem to misunderstand leash straining, aggressive barking for something cute because they softly pet their asshole dog while saying sweetly, \"you're ok, you're ok, awwwww.\"\n\nBecause of this dog/human problem, I'll never bring my dog here. I'm just not willing to subject my old girl to possible harassment.\n\nOther than that, I'd go back to hang out and enjoy some sweet SF fog and beers on the lawn.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "This place is AMAZING. Very San Francisco. Enjoy beautiful views of the Golden Gate Bridge and beautiful historical buildings of Crissy Fields while chowing down on various food from the plethora of food trucks and vendors on the grounds. Bring your picnic blanket, wine, and healthy appetite and enjoy the food. Amazing food, music and fun. Note that this is a seasonal event and for 2015 the final day will be November 1st but there's always 26!!. Its a must visit event and very close to other nearby attractions.", "author": "Jermaine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Cool event, but I'm not sure the food is worth the trek. The Presidio is so far out of the way. Took us forever to get there, so we only had like 15 minutes of live music and the food trucks started closing around 8:50. \n\nI tried a couple food trucks, and they were solid but not 5-stars. I liked the vibe of everyone chilling outdoors (even though it was definitely less than 50 degrees in June) to live music, food trucks, and the gorgeous view. They should have a few more bonfires and cabanas for other people, especially those in smaller groups!", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Off the hook! Music booth/dj + 2 bars + endless supply of food- what more could you want?!I was a little unprepared and didn't bring any blankets/towels or umbrellas (for shade in 90 degree weather), but there is ample green space to sit and relax with your food. I tried as many trucks as I had room for- which ended up being around 4, including: cholita, porteno, three twins ice cream and the stone-fire pizza (forget the name). Everything was great! ATM on site but most places (if not all) take cards. Also comes with a great view (on a nice day). You have to go!", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "Great place to spend Sunday afternoon, plenty of food and drink stalls, especially the food trucks. Can get pretty busy, with long lines at popular food places and finding a parking spot can take time. But worth the extra effort to spend the afternoon in a picnic area over a few drinks, good food, great view of the bay, and people watching.", "author": "Ninad S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "This is a great idea! If only they had more tents and \"camp fires\"! It's great for friends and family to gather along around a fire or a couple to cuddle under a tent while enjoying a live band and the company of good people! The trucks all line up and the grass area just gets filled! I suggest you come very early, my friends went 10min before the suggested timeeverything started up and all the tents were filled but luckily they got seats around one of the little camp fire like things. Oh and it gets windy don't forget it's SF so when they say bring a light blanket, bring one!!!!", "author": "Rosh E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "Key places to try here:\n\nDel Popolo: averages $11-$15 a pie, Margherita for $11 and Bianca $12, spend that extra $1 and get the Bianca\nGo Streatery: ZEPPOLES!!! amazing little lemony nuggets of fried dough. I personally didn't taste any ricotta cheese in it, which is a good thing. $3 for avg of 6-7 pieces \n(I also tried their oxtail and grits and perhaps grits is not something I enjoy, but their oxtail is fall of the bone tender & yummy. Don't be deceived by the pictures here though, that plate is NOT that big) \n\nand if you're willing to splurge ... WINGS WINGS!! These wings are ridiculously expensive to be quite frank. $14 for 4 pieces. or $28 for 8 pieces. Shit. I hope I'm eating gold or something. I wouldn't say they're bad, because they're certainly VERY big chunks of fried chicken and during the afternoon, with long lines for dayz, they pump it out fast. However, fried chicken is fried chicken. Beware of that orange hot sauce though, SCREAMS FIRE!!\n\ntip: ask trucks for foil so you can cover your food without it going cold when you're still in line for ..everything else.\nBYOB! you'll thank me for spending that extra cash on more food trucks\n& bring a blanket :) not always lucky to enjoy nice/sunny days at the Presidio", "author": "Sandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "I've been to off the grid: fort mason but just recently came to this one last sunday.\n\nNot as many food trucks / stands as you would think but they did have variety. There were food stands on one side, the farmers market on the other, and the drink booths in between. Everything is always pricey (but what do you expect from San Francisco). The drink booths were walking around with little carts doing refills which I thought was pretty cool. Crowded as usual, but worrying about a place on the grass is not a problem. There are many places to just plop down and enjoy the event. Make sure to bring a blanket/chairs or be prepared to sit on the grass because there isn't any seating anywhere. They had a DJ going and the vibe was fun. \n\nWe ordered some fish tacos from one of the stands (forgot the name) but it was delicious. Grabbed a couple oysters - which I was surprised to see because I've never seen any at all the off the grid locations I've been too. They were really good as well.\n\nOverall: Great experience. Would definitely come back. Great place to bring your kids or friends/family and relax.", "author": "Kristel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "love love love coming to Off the Grid at the Presidio especially on a beautiful Sunday. You can bring food and drink OR buy it. Its family friendly or just friend friendly. Really you cant go wrong with a view of the bay, sunshine, great food and drink, and awesome friends.", "author": "Kristan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Me, the hubby and almost two month old decided to venture over to this event. First off the view is amazing. You can see the GG Bridge in clear view and on a hot day it seriously incredible. The booths themselves are delish but be prepared to waiittttt. Each one has at least a 20 min wait but its worth it. Luckily we brought some snacks since we didn't want to wait in more than one booth. There are people of all ages and everyone is in such a great mood. I recommend this to anyone and think it is the best OFG by far. I will be coming back for sure a few times more this year.", "author": "Bri R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Fantastic event! I'm a regular at the Off The Grid in Palo Alto but was in San Francisco for the weekend so I came here to check it out. I brought my girl and invited another lady friend and we loved this venue. Its gorgeous, the view of the Bay, the island and passing sailboats is spectacular. Its a gigantic lawn so you can sit anywhere, the trucks and booths surround two sides of the lawn so food is always a few steps away. There is a huge selection of food so there is definite something for everyone. You can bring your own lawn chairs, blankets and umbrellas or you can do like we did and rent them from the Off The Grid Information Booth.\n\nThere is a DJ playing music and a (pay) parking lot right there so its a lovely, perfect picnic place.\n\nTheir lawn chairs are especially cozy so we lounged in the shade and sun, talked, laughed, played hula hoops and ate wonderful food. this is a great event and you really have to check it out before the winter hiatus, its really that good. Then come over Off The Grid Palo Alto and dance with us (we get live music every Monday night), we are easy to find, me and my girl will be the ones singing and dancing to the musician.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "I love Off the Grid and especially Off the Grid at the Presidio! When its a nice hot summer day, nothing is better than laying out in the sun with some oysters from Hogs & Rocks, a okonomiyaki w/ a fried egg on top from Namu Gaji, and some lemon ricotta donuts from Streatery. \n\nI've been Picnic at the Presidio twice and each time I seem to crave for the same things, but then again, it's just goooood! Enjoy the food, enjoy the sun. It'll make for a great Sunday Funday!", "author": "Jeanette Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Went for Mother's Day 2014 and had a great day.  get there early because parking is tough.  Absolutely get the frozen mimosas were AMAZING!!!!!!!  and who doesn't love kettle corn or sausage? \n\nbonus points for the beautiful setting and photo opps w/ the golden gate bridge....", "author": "Margarita P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "You already know! What a great and chill time. The food can get $$$$$$ but it's San Francisco. I do like sitting on the ground eating noodles though. Not a lot of places to sit in the grass eating noodles or whatever else surrounded by all sorts of chill people without a care in the world. Good views, too.", "author": "Jenna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "On a nice sunday, this is a great place to get together with some friends for a bite, a drink and just chill out on the grass.  There is a good selection of food places, a bar, a dj, and an amazing view of the bay.  Why wouldn't you want to be here?", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "If the Chairman is there, ALWAYS get it. Seriously, the steamed pork belly with pickled daikon is crazy good. Or better yet, don't get it so the line is shorter for me. But this is the coolest off the grid I have seen. They have chairs and fire pits and canopies available, plus plenty of parking.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "As a former Bay Area girl, Off the Grid: Picnic At the Presidio is one of those summertime events that makes me miss living in this part of California. \n\nThis particular location of OtG is perfect for those looking to have a lazy Sunday with a nice view of the bay and Golden Gate Bridge (if not covered in fog). Located near the Walt Disney Museum, it can be a bit of trek to get to without a car (for those with a car there's a giant parking lot). \n\nReasons to love this: \n1. Large grassy area for picnicking; lots of families with cute kids and dogs running around \n2. Little red wagons selling bloody marys and beer\n3. Bins for composting/recycling/trash--- the inner environerd in me loves how this is just standard practice here\n4. The food! If you're in the mood for tacos, Cholita Linda is an excellent choice for fish tacos (2 for $8); the batter was light and I like that they use flour tortillas. They also accept credit/debit via Square!! Love it \n\nIf you're in the mood for nachos, hands down Napalito is the place to hit up; the chips are nice ad thick made from fresh tortillas, dipped in their housemade salsa and then topped with a generous sprinkling of cotija cheese. My friends and I inhaled them while waiting in line for other food and immediately came to the conclusion that we needed to get another order stat. \n\nAfter our tummies were nice and stuffed, we layed in the fresh grass and relaxed taking in the sounds of giggling children and feeling the cool ocean breeze against our skin. \n\nATM machine on this particular visit was broken, and the only sad part was when humphry slocombe ran out of most of the ice cream flavors later into the afternoon.", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "A fun thing to do. Parking can be a pain so be prepared to look around. They have good food truck presence so you will have a lot of options especially for vegetarians. Make a picnic out of it, and carry stuff to sit around, shade would be very helpful. The wait times are getting longer and longer as this spot gets more popular, so wouldn't hurt to carry back enough food in one trip.", "author": "Ashish K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-13", "description": "Great concept, but I wish they would review their food vendors before just letting some of them in to sell - high prices that rip off customers.  \n\nDO NOT  waste your $$ at little green cyclo - not good, food tastes like its pre-made and been sitting all day to hand off at over priced rates.\n\nI do like the bacon chocolate booth and Kasa Indian, wood fired pizza was great too.", "author": "Veronica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "The Off the Grid picnic is my favorite of any SF food truck gathering's that I've been to.  It's super well organized.  The Presidio lawn is a great place to have this.  Theres even a parking lot, because lets face it, taking muni into the presidio is a pain in the ass. \n\nUnlike some other off the grids, this one is not limited to just trucks.  Many local restaurants also set up booths to sell their delicious offerings.  Check the website ahead of time to see what trucks/restaurants will be there, bring a blanket to sit on, and prepare to chow down!", "author": "Steven Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Definitely one of my favorite Sunday shenanigans. Bring your group, a blanket to sit on, and your appetite! Great selection of food trucks: variety of different cuisine, dessert trucks, and of course the bubble bar for some drinks! Relax on a nice Sunday outside with live music, a view of the bay and GG bridge, and be prepared to see some cute dogs. Very kid and dog friendly, so it's perfect for the whole fam!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "Great idea to house Off the Grid at the Presidio in the big grassy area.  Come here early and it won't be too difficult to grab a nearby parking space otherwise be ready to walk a little bit.  They have a good variety of food trucks, a drink tent, a farmer's market area and a DJ playing music.  Perfect for a family with kids or for anyone wanting to get out and grab some delicious food.  I had a salmon burger and my wife had probably the most amazing roast turkey sandwich I've ever had.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "Fun stop for sure! We did not plan on attending, but rather, happened upon it after we traveled out to the Presidio to visit the Walt Disney Family Museum :)\n\nWe had some good meals from the food trucks (I had a sandwich from the Streatery) and overall, just a nice vibe :D", "author": "Krissy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "Super fun and delicious choices.  Wing Wing's fried chicken was excellent.  Nopolitos ginger lemonade a thirst quencher.  Nice to see so many people...families...friends hanging out and eating well.", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "What a great way to spend Sunday's! Bring a blanket, a bottle of champagne + orange juice, scope around for food and your set. This place is perfect to relax and have a picnic with friends, family or your significant other. There's a lot of vendors to choose from and it seems like they change from time to time. I tried the bacon wrapped mochi from Chotto, mushroom empanada from El Porteno and the fried chicken with biscuits from Wing Wings. Everything was delicious. I love how theres so much to choose from. I guess I know how I'll be spending my Sunday's.", "author": "Laura T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "my review will reflect similar sentiments my better half Andy W. has recently expressed in his review, so I apologize in advance for any redundancies.\n\nFirst timers here end of August...and then once more Sunday.  Perfect summer days to go into SF, the weather both times were excellent.  First time we had to battle Americas Cup traffic; this past time, we had the breast cancer 2day walk instead.  So needless to say, leave ample driving time!\n\nparking in August weekend was considerably easier than it was the first time around, woo whoo.  we usually lay out on a patch of grass somewhat near the DJ station, and really anywhere is a good spot, with lots of space for all.  The dog scenario is insane, I would not bring my dog here, I think too many folks bring unruly dogs that shouldn't be around so many people and children.  they just let the dogs run around too with no leash, not cool.\n\nANYYYWAAAAY... Onto the main attraction: the FOOOOOD.  Oh and they serve booze here too, cool.  The first time I landed on the taco tent.  I tried a pork and a fish.  I was surprised that I like the fish more than the pork...sweet!  I'd wanted something sweet to finish it off and went with the crème brulee tent...bc sadly, the ice cream guys only had a lavender ice cream left, weak.  But my crème brulee with fruit was good.\n\nTrip #2 Sunday was better as it was much less crowded.  I made my way over to Popolu: the brick oven food truck.  It had the longest line around so naturally, I had to give it a whirl.  Limited menu...margarita pizza, a bianca pizza (no sauce, but includes mozzerella ricotta garlic and basil,) and then some other one.  all priced about $11-12, add $2.50 for stinking pepperoni!  after plopping down $25 for 2 pies, i will say it was a decent value, but wish they had more options for toppings...like fresh jalapenos! regardless, i loved the crust; super yum.\n\nall in all, worth the wait...which wasnt all that bad.  they take your order halfway through the line so by the time you're at the front, it's ready to go.  check um out for sure if you want a solid pie!!\n\noh and everyone else loved the pizza too, yay :)", "author": "Sara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "FUN, FUN,and more FUN.  Love going to the Off The Grid Picnic where you can can eat to your hearts content and relax all at the same time.  OMG the brown sugar and pepper biscuit I had was to die for.  Not quite a biscuit, not quite a cake but absolutely delicious.  The view was fantastic and just a rip roaring good time for all.   \nThis is the place to let your taste buds cut loose and have a good time. Some they love. some they will not.  But I bet if you are a foodie you will go back for more.", "author": "GG V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Great place for a Sunday Funday!! Food, views and entertainment. Parking can suck, but worth it. Something new and different to try out. Bring your own blanket and a cooler it can get pricy if you don't plan right.", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "Off the Grid at the Presidio has an amazing variety of food, a friendly environment and lovely view of the Golden Gate Bridge. I love the Argentinean empanadas El Sur--very authentic! The chicken empanadas are the best, but the meat empanadas are very good as well.", "author": "Magoo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "What a lovely pkace to hang out and try many different food on a Sunday afternoon. Chill people, great atmosphere. Tried some amazing bbq pulled pork sandwich and the famous pizza Napolitano truck, everything was delicious. Too bad that they close at 4pm. Parking can be difficult!", "author": "Francesca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Perfect way to spend Sunday Funday! Bring your friends, family, dogs, booze, and a blanket and hang out on the lawn. Tons of food and drink options including champagne bar, cocktails, and mobile beer cart. The only thing that was missing was the sunshine!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Perfect place if u like to eat lunch truck or other local foods,drinks,specialties.  You sit out in a grass field bring a blanket or lawn chair. There is music and beer also. View of the bay and lots of family's and friends.  Great place to chill and try different food. TIP. Bring a cooler with your fav brew or mix.  Parking can be a pain but it's the city what's new", "author": "Mr. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "Great location for off the grid.  \n\nAt this location, there is both trucks and well labeled tents.  Definitely hit the liquor booth- the Bloody Mary's are bomb. \nWe ate at the wing booth and the empanadas booths.  The wings were delicious.  I ordered both the carne and mushroom empanadas- I would recommend just grabbing the carne and pass on the mushroom. \nSunday Funday!", "author": "Christine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "So much fun! It was my first time experiencing the picnic and it was fantastic. I work in the bay, but haven't had a lot of time to play. Today was awesome for that reason. So many food vendors to choose from! We arrived right around 11am and had no issue with parking. We grabbed some grub, spread out on our blanket and enjoyed the view of the bay as the day was exceptionally clear. This is a great place to bring out of towners as it will leave a lasting impression. It does get pretty crowded later in the day, but I do think it's totally worth it.", "author": "Shelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Always fun here at the otg presidio. It is more a family/chill with friends on the grass type of day. You can rent some outdoor games from the sports basement tent, and there's usually a dj playing as well. Fun day!", "author": "E B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Awesome location, every kind of food you could want, what more could you ask for?  The lines can look pretty long, but everything moves pretty quickly.  With music, booze, and tons of people it's a great way to spend a Sunday afternoon.  The only problem you could run into is places running out of food towards the end of the day, but even then there's always something else to try!", "author": "Angus R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "I head to picnic in the presidio whenever I have a free Sunday....I bring a new friend each time....since most people haven't heard of this! \nIt can be funny to get to, but once are there it's fantastic!\nDrink white wine on the grass, eat your heart out, plus go home with fresh produce and flowers!\nI think her name was Lariena (oops!) from Home.Sweet.Flowers. Anyway, she was super sweet and her flowers were gorgeous. Plus, wrapped in burlap.\nNice way to reuse.\nAlso.... be sure to get strawberries from Daniel & Joseph at Blue House.", "author": "Diane V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "Met a few families there at opening weekend - packed by noon.  Pretty crazy lines and food waits but everything we had was worth it.  Pork belly sliders at Haven, 4 piece fried chicken at Wings (30 minute total wait but still worth it), secret breakfast (bourbon) ice cream from Humphrey Slocumbe.  \n\nPlenty of room for playtime after the little ones finished covering themselves in farmers market strawberry gore, but beware the grass if you allow little (or big ones) to tackle you into it - fertilizer gets itchy fast.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "It is worth the drive to come here. Bring a kite and a friend. This place is wonderful. Take pictures and have fun.", "author": "Ronald N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "These guys are proof there is still good in the world. The roster is never dissapointing and everyone seems to be genuinely happy to be there.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-07", "description": "So it is was SUPER cold on the day i came BUT luckily, everyone was so nice and was more than willing to share their little fire. I like this OTG because they have cabanas and fire pits which was totally cute. The line up for food trucks isn't as extensive to the one on Fridays at Fort Mason. I don't remember the two trucks i made purchases at but it was pretty good. I just remember it was Asian fusion - one had steak cubes and the other had pork belly. Hmmmm pork belly... i will definitely come again - with more layers and more friends because this is definitely a neat spot to just kick it.", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "I couldn't think of a better way to spend my Columbus Day weekend than at this picnic.  We got a good view of the Blue Angels, there was tons of parking, it was sunny, there was plenty of room and it was just an all-around great time.  It's great for kids, dogs, couples, families, seniors and everyone!\n\nThe food was delicious! My boyfriend and I shared a nice lunch consisting of a few things from different vendors.  We tried the cheese and baguette from one place and a sausage trio from another to have a little meat, cheese and bread lunch.\n\nI saw some vendors were selling alcohol, which is awesome!  We'll have to try the drinks next time.\n\n*Warning! Yes, some vendors take credit cards but make sure to bring cash just in case.  One of the vendors was having a hard time getting cell coverage to process our card.", "author": "Nic E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "I love this OTG! Go early to get a seat in the cabana or fire pits. The food selection is great. I had no line at chairman of bao. At fort mason its impossible to have no line. Its a really cool atmosphere but gets chilly at night. Bring warm clothes", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "The lawn can be a bit soggy but as long as you bring an adequate picnic blanket then everything will be fine. The food, music, and atmosphere for a Sunday in the Presidio is a relaxing way to end your hectic weekends. Be sure to try a few different foods and drinks but feel free to bring your own stuff too. Also parking is easy and cheap. See you there!", "author": "Gil A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-30", "description": "Let's see...screaming kids, lousy blaring music, overpriced food trucks, and peeing dogs all over an immaculate lawn...what could be wrong?  A more appropriate question might be \"who thought this would be a good idea\"?  I don't know about anybody else, but I go to the park to escape crowds and noise...a very poor use of public land, and whoever agreed to the idea from the Presidio Trust should be reprimanded or released from their duties.", "author": "Sally Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "What a wonderful way to spend a Sunday! Can't wait to go back. Had tacos from Cholita Linda - so good. Excited to explore more options in the future!", "author": "Audrey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "love it!\n\nloads of great options in a wonderful atmosphere. can't wait to go back - its the perfect sunday!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "When it's a nice day, this place is an awesome way to spend a Sunday afternoon.   So many choices of food to satisfy any palate.  Fried Chicken,  pizza,  grilled cheeses, ice cream,  etc.   Don't forget to bring a blanket so you can relax and enjoy the Sunday afternoon in the cool San Francisco breeze.   Big plus is that I didn't seem to have any problem finding parking.", "author": "Conrad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Bring your picnic blankets, foldable chairs, and football because this is going to be a great Sunday well spent! Lots of great food to choose from. I'm even more happy that Nopalito is there, too. Don't forget to enjoy the view.", "author": "Malou M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "I've been to Off the Grid in the Presidio twice now... In fact, two weekends in a row because we loved it so much. Lots of places to throw a blanket down with friends and chill. So many delicious food options (although the later you get here, the longer the line to wait for just about everything, also bring cash. There's an ATM and plenty of places take a card, but wouldn't want to miss some great food for this reason!). We've always brought our own beverages, but there are also lots of options of delicious drinks to buy too. Great place to chill for a nice sunny Sunday Funday with friends. Also a great place to bring visitors of all ages.", "author": "Kailey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Fun afternoon with friends. Cool bar area, lots of options for food. The music could be a little bit better.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-03", "description": "I like to patronize the trucks around town and get to OTG events now and then.  This was my first visit to the Picnic.  Great setting.  Not enough trucks on this occasion - waits were pretty long and there was one truck, Smokeys, where it was over an hour to get a so-so tri-tip sandwich and they let the other part of the order get cold.  Sorry but you need to be prepared for the rush if you are going to do this!  Something was clearly not going right with that truck and I hope they fix it, the menu looked promising.  The 3 other trucks provided great variety but still they all looked very stressed, this was not representative of a good OTG meetup.\nWe enjoyed  the other vendors and stalls that were present, chocolate makers,  a few farms, cheese, the creme brulee (they also suffered a very long production process and we had to pass once it looked like another long wait).\nLots of dogs and most well behaved but I'd suggest some protocol be 'enforced' before its left to pepper spray and yelling.", "author": "Peter R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "Old world food truck has tastiest schnitzel with sweet sauce and juicy triangle dumplings called pierogi. Streatery has delicious lemon doughnuts.", "author": "Lyuba F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-23", "description": "it's nice place to picnic on a weekend, but SF is always so windy and cold. sitting there eating food truck wasn't very pleasant. there are a lot of big dogs around, which scare me :(\n\nI got cream brûlée cart here, although they're in FI-DI everyday, i never got to buy them. it was good - S'more flavor which they don't sell in FI-DI (only basic flavor in FI-DI, like vanilla, chocolate, etc.). I also bought the most disgusting ramen burger from NOMBE, almost wanted to throw up cuz of the grease of this burger, and the disgusting ramen flavor and miso flavor (it just doesn't taste like miso at all). don't waste your $10!!!", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "fun. food is good. there are lots of different things to try. they have a beer stand so you can drink on this huge lawn. most stands take credit cards but there is an atm close by. there are porter potties available. but i know a secret bathroom. : ) . try the frozen mimosa. they are 10 bucks a pop, but somehow i feel like it is worth it.", "author": "Jon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "Woo Hoo! Great food, Friendly people. I can wait for next year. As chill as it gets. Dog friendly and the girls aren't stuck up. They actually smile and talk to you like a person. Im going to spend way more time here next year!", "author": "Mario A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "This place was such a good time and the weather couldn't have been better. Betty and I started off with a bloody Mary each which not overly strong, but it was tasty. There's  a good variety of vendors and the prices are your typical food truck prices.  Bring a blanket and some cash and hopefully the weather cooperates. If out does you're sure to have a good time.", "author": "Bob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "I stopped by the Presidio picnic after running bay to breakers. I was famished when I arrived. I really appreciated seeing booths with food from restaurants and not all food trucks. I also loved the booze tent! I had one of the \"presidio mules\" which was a twist on a Moscow mule, it was quite tasty.  This will be a great off the grid to attend while the weather is nice.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "You'll find me here on Sundays a lil more often.  This event is awesome.  We came with some friends, family & kids....and we had a great time.  The music set a good vibe, I love how it is totally kid friendly, and there are so many tasty beverages, food & treats to choose from.  If your in the area on Sunday and want something chill to do, definitely check this event out.  Good times all around.", "author": "Natacha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Sweet (kid-friendly) place for food truck fun and farmers market combined, on a picnic lawn with views of the bay!  (Today that means te Americas Cup!)", "author": "Sp S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-04", "description": "Not for you if you want healthy food from farms that treat animals well, or organic hormone-free antibiotic-free ingredients of any kind. Also was very very cold and windy. We went n and left hungry and cold. View was great though!", "author": "Erin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "Go to hang out with friends on a nice day, but don't expect good food.  Maybe I'm just jaded but, the whole food truck thing is over-rated.  I actually like a lot of the restaurants that have trucks at Off the Grid/ Picnic at the Presidio, but somehow food prepared in a truck just isn't the same....not even close...unless it's ice cream or dessert.  I got a pulled pork sandwich from Wexler that was dry and tasteless.  My BF got some oxtail egg thingy that was forgettable.  The only highlight was dessert.  We got some doughnut thingy from the oxtail egg place (forgot the name) and it was heaven!  Oh, and be prepared to wait in line FOREVER.", "author": "Wendy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "A great way to spend a Sunday afternoon. Plenty of awesome food trucks, beer and wine, and family friendly activities.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Low key music festival, awesome, but how do you reserve a tent?? Please answer asap!! :)", "author": "Luana G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "Thursday night Twilight (April 2), total fail. Ridiculously packed with not nearly enough food trucks to serve the crowds.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-28", "description": "Stag Dining, The Brooklyn Circus, an amazing DJ, drink service , what more could you ask for?!", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "What a fun event. Spent all day here for the Labor Day holiday and had great food, drinks and weather.  The frozen mimosa was delicious and I got good from several trucks all were great. Tip is to order early as several trucks sold out well before 4pm.  Also it was very dog friendly. Parkin was a bit tough", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "All I can say is: DAMN!  This is a gem!  I'm in the city with a group from my college studying urban planning, and we were wandering around the Presidio and happened to stumble across this event, and of course we all decided that it was more important to enjoy the food trucks and beautiful weather than to discuss the history of the area.  I chose to order a pizza from Del Popolo, which at $12 for a small pie seemed cringe-worthy, but it was honestly the best pizza I have ever tasted in my life and was worth every cent.  I also tried the ice cream from Three Twins, which was also tasty, and some of my fellow students sampled other offerings from different food trucks, and we all agreed that Off the Grid: Picnic At the Presidio will definitely be one of the highlights of our trip...", "author": "Mick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-11", "description": "After a $25 cab ride, I was expecting a little bit more.  Maybe it was the muggy weather or the high drink prices, but I thought something was missing.  Even though there was a decent selection of food, I was expecting to have many more food truck options.  I was looking forward to some Vietnamese tacos and cupcakes, but looks like either the trucks rotate or these options are at another Off the Grid location.  I also heard there was supposed to be music there but didn't hear that either.  There are two drink stations there (one on each side of the lawn) and they serve wine, beer, bloodies, and mimosas.  The drink prices are steep--expect $10 for a glass of wine.  I would say bring your own picnic with snacks and drinks if planning to stay for a few hours.  All in all, it's a great family and friends gathering space, but I would think twice about coming all the way here again.  Definitely bring your beach/lawn blanket and cash!", "author": "Tanichka B."}
