{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Go all the way in back of the farmers market at the Ferry building and look for the yellow Primavera sign, hand some cash over and be prepared to have some of the best chilaquiles EVER! Yes, its cash only and a wait but friends, it's worth it. I just wish I would have been a touch hungrier to snarf down the entire plate. A number of people were getting the strawberry lemonade as well but I had to have my coffee while enjoying breakfast.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "I've been coming to the farmer's market at the Ferry Building for three years and I always make a stop at Primavera for their amazing agua frescas and lemonades. Their food is great but for me the drinks are stand-out quality because they're so fresh. The strawberry lime lemonade has a puree like consistency because they truly use strawberries in their drinks. It's the perfect combo of sweet and tart! The pineapple cucumber agua fresca is also soooo tasty and refreshing, especially on the hot summer days at the farmer's market.\n\nGrab one of their drinks and sip on it while enjoying the view of the Bay Bridge and water right in front of the stand", "author": "Megan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "Not worth the hype.  \n\nThere's nothing bad about the food here but there's nothing particularly great about it either, just very middle of the road.  Everything was fresh and well presented but the flavor was underwhelming.  We had the chilaquiles and the chips, sauce, beans, queso were all just meh.\n\nThis place is definitely benefiting from tourist skew in terms of ratings.  I'd pass but if you're in the mood to wait in line for 10 mins and then wait another 15 more for so-so Mexican, then have at it!", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "Primavera was a prima facie case of very disappointed bundled in chilaquiles form. Each triangle of corn totopos, holding a TOTOlly sad POSition in the ranks of the honorable Californian chilaquiles - in form, texture and taste.  \n\nThe expectation was here:\n\n(you unfortunately can't see how high the mark is because the Yelp word parameters will not allow it to appear)\n\nThe execution was here:\n\n(you unfortunately can't see a mark because it's miscroscopic and not visible to the naked human eye)\n\n'What happened?' may be the response of the slew of elite 5 star reviews and ultra positive feedback - 'Maybe you tried the stand on a bad day?' 'Did you have a little too much taquila to recall the quile-chile?' Why, no, that would've made it all the more tasty.  I digress... back to the meat and potatoes. Or to the beans and totopos. \n\n(1) Texture - The texture was so off balance, each totopos soggy, with no slight crunch coming through - no strength to endure the mole that was left on it for too long before the handover from pan to table. And the less than ideal texture was a theme that resonated across the plate - the beans tasting as if they were refried beans right out of a can. I yearned for the slight crunch of the chilaquiles against the salsa/mole, and for grandma's stewed beans cooked with the rustic homemade feel.  All of those components were missing. \n\n(2) Flavor - the chilaquiles certainly got me to question the OR in flavOR.  This wasn't the flavor profile I was expecting. It was something else - or nothing. A bland form of salsa/mole. I was missing the expected flavor burst so characteristic of Mexican mole. Where did the CHILE in the CHILEquiles go? The ancho, pasilla, mulato and chipotle? Where was the crushed black pepper, the achiote, cumin, cloves, anise, tomatoes, tomatillos, garlic, sesame seeds, and herbs?  Where did the flavor go? \n\n(3) Portion - I get it - there's high rent in SF to account for. But isn't it already accounted for in the extra SF vendor fee that is imposed? In addition to the general issues with texture and taste, I was further disappointed by the amount - or lack of amount - of substance and food delivered. I could count 4 pieces (note, not slices) of square and triangular avocados on my plate. With an amount of totopos less than 10.  Maybe the beans are purposefully mashed to prevent one from noticing the 15-20 beans that would've been on the plate but for the mashing to disguise?\n\n(4) Overall performance and delivery - Bursting with desire to try the chilequiles, and filled with anticipation backed by raving reviews, I waited around 25 minutes in line and another 6-8 minutes thereafter for the chilaquiles to be prepared. 30 plus minutes of my life I will never get back. Please do not make the same mistake as me. Or do, but do so knowing that this is not that SoCal San Diegan variant of chilequiles, but a foreign, neutral variant. \n\nAs a recourse I thought... maybe I should try another dish? Maybe I should try the fish taco that came highly recommended by the Primavera rep? But from the soggy tortilla to the overly battered and oily fish to the totally lacking flavors and salsa, this only reconfirmed my earlier findings. I tried so much to like this place that is highly regarded by many.  But I guess this is one of those times the old adage is true - I would not jump off a bridge if others were to. \n\nPrimavera, Ima so disappointed and vera much wish I could post a more hopeful and positive review.  Please hear my plea to do justice to the noble and delicious chilaquiles dish that brings honor to California and its resident Californians.", "author": "Vivienne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "Had chilliquilles.  They were very fresh and good.  I'd get food here again. It was a little crowded.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "~CASH ONLY~\n\nOhhhhh chilaquiles ($10). So much flavor covering crispy tortilla chips. When you try to combine everything on the plate to one bite, it's a delicious explosion. Eggs were wonderfully buttery and smooth. All the condiments complimented the dish nicely. I am usually not a fan of beans, but I loooved the refried beans on the plate. \n\nAlso, you have a nice view of the Bay Bridge while enjoying your breakfast/brunch.", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "#bestchilaquilesEVA \nThis belated review was prompted by my many recent chilaquile disappointments in the southland.  Anyone who likes to EAT and finds themselves in San Francisco MUST visit the Ferry Building Farmers Market for a weekend walking extravaganza of eating FTW!  This market houses one of my absolute FAVE chilaquiles Of ALL TIME!  These thick corn tortillas got authentic CRUNCH (no sad soggy chips here)! The fresh ingredients including cilantro, onion, crema, avocado and cojita with the eggs, beans and salsa roja all come together in a TO DIE FOR party in your mouth!  I literally day dream about this meal, no joke!  Grab a plate and eat while enjoying the beautiful view of the bay bridge.  We're talking go alone just to eat this meal with total strangers on the benches GOOD!  Aka Hella Good!", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Hands down my favorite thing at the Ferry Place market. Head straight out back to get the best Mexican breakfast! Obsessed with the chilaquiles, refried beans and chips that are sturdy enough to stand up to the heavy sauce. \n\nMust eat on a Saturday morning in SF.", "author": "Leila K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Primavera sells mexican eats quickly. has lots of backup associates.\n\nmenu: Chilaquiles, Tacos   breakfast burrito?, Tamale Plate, pork/chicken tamale\n\neats: niman ranch tacos (2/10)\n--citrus spiced, marinated pork, avocado, purple onion, cilantro, tomato sauce?..\n-lots of chucky meat in soft tacos\n-needed more sauce.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "So chips cooked in salsa might be my new favorite thing. For now, I'll have to obsess over how the chips were entirely coated yet still crunchy. My friend told me these are the best chilaquiles and I will have to believe him. Yum!", "author": "Kenny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Ignore the long lines for rotisserie chicken at the front of the Ferry Building Farmer's Market. Come instead for amazing Mexican food served by super friendly people (tucked away at the back of the market). Expect a small, rotating menu of tamales, tortillas, chilaquiles, and more.\n\nThe only thing I disagree with other reviewers on is that the chilaquiles are the best thing on the menu; to me, it's the tamales. Easily the best tamales I've had, and worthy of the visit to the Ferry Building on a Saturday.\n\nThe chilaquiles are certainly delicious. How could they not be? They're tortilla chips covered in fresh cotija cheese and salsa, with sides of buttery scrambled eggs and super flavorful beans. And maybe they are the best chilaquiles I've had, and it's just that I don't get the fuss over chilaquiles in general.\n\nThe tamales are served piping hot, and come with the same deliciously flavorful side of beans (and I'm not usually all that into beans) as well as an equally surprisingly delicious side salad with various kinds of pickled veggies. The corn outside was perfectly steamed and comforting. Yum!\n\nAnd what's inside the tamales and tacos seems to be on constant rotation, so always something new to try (I had pork tamales, and saw chicken tamales on the menu on another visit -- the same one when I mistakenly opted not to get the tamales).", "author": "Sravanthi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "I got hella hyped for this place due to all of the reviews. I think being spoiled by the numerous options of Mexican food in SoCal resulted in my disappointment with Primavera.\n\nEach ingredient in the chilaquiles tasted as it seemed. To sum it up, it was nacho chips with red sauce, sour cream, beans, avocado, and scrambled eggs. \n\nHaving experienced a mind-blowing, what-the-heck-is-in-here chilaquiles from Santa Ana, I walked into the Primavera booth with too high of expectations. Good, but not great!", "author": "Evelyn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "CHILEQUILLES I cant spell it but I could eat it all day. That sauce you pour on yourself is to die for. Best I've ever had so far", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Yummy tacos! I was waiting for ramen when the lady making the tortillas at Primavera caught my eye. I decided to check out their menu and everything was sold out excect the Lamb Tacos and some Tamales so seeing that it was a popular place, I decided to give the Tacos a try. The Lamb Tacos were delish! I don't even care for lamb on most days but here, it was stewed in some savory, flavorful spices and it was not gamey. The best part were the tortillas which were soft and fluffy. Instead of two thin tortillas, they served the meat on one tortilla and they were chewy and awesome. Even the service was really nice. They were quick and efficient. Everyone I encountered was really friendly, like they cared you took the time to stop by.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Their chilaquiles put me in my happy place every time. Paired with their exquisite strawberry lemonade, life cannot get much better.", "author": "LaShonda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "I'll keep this simple.\n\nIf you like to eat... well... things that taste good, track down the Primavera booth at the Saturday Farmer's Market at the Ferry Building.  \n\nI'll let my picture of the chilaquiles dish stand for itself.  Every aspect was tasty, with an interesting mix of textures, flavors, light heat, and just overall yummyness, covered in the creamy trifecta of avocado, sour cream, and queso Cotija.  It was as if the plate was handed to me by Rick Bayless himself.  \n\nWife loved her a la carte pork tamales so much that she devoured them before I had a chance to snap a pic of them.  It was either get a pic, or get a bite of them myself before they were gone.  Sorry!\n\n10+ minute line to order, plus a 10+ minute wait for your food.  All worth it.  My only regret is that there weren't TWO Saturdays in the 6 days we spent visiting San Francisco, so we could have stopped here again and tried some of the other things on the menu (or the SAME things *sigh*).\n\n4.93 stars.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "We saw Anthony Bourdain ate here annnnnnnd he made it look so good we HAD to have it!!! \n\nLine was ridiculously loooooong but let me tell you this. It was worth it! We ordered the famous chilaquiles and the tamale plate. A bit pricy but worth every cent. Meat was tender, the sauce and everything on the plate compliments one another. It's like butter melting in your mouth only BETTER!!!! \n\nWhen we come back, we will come back wanting more! I'm already salivating thinking about it now. Some few thousand miles away. Pfff!", "author": "Isma S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Excellent tasting food from a limited menu that's made quickly. Prices are comparable to other shops at the Ferry Market.", "author": "Naveen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "It takes a lot to get me to ordering Mexican food early in the morning, but after reading up on the chilaquiles and tamales from Primavera, and with my out-of-town parents in tow, we went for it.  Knowing that the line here gets to be lengthy after they open at 8AM, we got here early to get leg up on the crowd.  We went with the chilaquiles plate and a roasted green chile & cheese tamale.  While the chilaquiles was delicious, especially with those AMAZING chips, the overall favorite was the tamale.  In finishing everything in less than 10 minutes, my dad said that it was one of the best tamales he has had in a really long time.  As an LA native, we know good tamales. As someone who doesn't love Mexican food, I can honestly say that I would go back time and time again to eat from Primavera.  TOTALLY worth the stop if you're at the Ferry Building on Saturday morning!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "If you happen to be at the Ferry Farmers Market, do yourself a favor and stop by Primavera - located outside the FM building where the food stands are. They don't serve your typical greasy Mexican grub, but trust me it's just as delicious. We tried the chilaquiles plate and tamale plate which came out to around $15. \n\nIn my opinion, this is the best food stand option at the market, and you can't beat the portion sizes & prices!", "author": "Juanita D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "It's Tuesday and I'm sitting here at work looking up the hashtag #chilaquiles so I can stare at pictures. Does anyone else ever do such a thing? No? Just me? I seriously can't wait for Saturday so I can satisfy my craving!!!! The BEST chilaquiles!", "author": "Grace V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "I finally got to check out this food stand on a breezy Saturday that was down by the pier!\n\nWhat caught my eye on their simple menu, was their fish tacos, but I have bookmarked this place ever since way back, to try their Chilaquiles!  \n\nFor $9.50, their Chilaquiles was the standard of a fajita plate, but without the meat.  Instead, it was with scrambled eggs and the norm of beans, avocado, cheese, optional side salsa, and chips on the bottom that reminded me of Doritos!  It was more a breakfast meal, to say the least, and it was good, but not the best!\n\nNext time around, I'm getting their tamales and fish tacos!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I'm impressed with Primavera.  I'll admit, I was pretty skeptical about their food because their prices are pretty high compared to other Mexican food joints, but they definitely give you your money's worth in portion size and best of all, their food is really good!! \n\nMy first two visits with them had me try their famous Tamales and Chile Relleno respectively. \n\nTamale Plate w/ Butternut Squash & Monterey Cheese and Maurilias Pork. --  http://bit.ly/19SBhnA\nOh man, these tamales!!  So good!  And they frequently change every week so you'll always be bound to try something different.  Both of these were loaded and came with a plate full of extra veggies and beans.  My favorite of the two was definitely the Butternut Squash with Monterey Cheese.  The pic itself doesn't do it justice, but when I cut into the Tamale, I got a nice amount of gooey melted cheese stretching out.  Definitely good stuff and you can't go wrong with ordering this.\n\nChile Relleno en Nogada --  http://bit.ly/KTKvXy\nBeef and pork picadillo relleno with Sourcream walnut sauce and pomegranite\nThere was a lot going on with this plate.  Very creative with the pomegranite seeds as it added some acidity to the richness of the beef and pork filled Relleno.  This isn't regularly on the menu, but if it does appear again, I wouldn't mind ordering this again too.\n\nSo after two visits to Primavera, now I realize what I've been missing out on because I used to always pass by their tent at the Farmers Market but after having their Tamales and Chile Relleno, I can't resist stopping by to take a look at their menu which constantly changes.  Their food is high quality and so far everything I've had has been really good!  I'll definitely be looking forward to see what they have next time and I also have to try their Chilaquiles that everyone seems to be raving about.\n\nI have to thank Anthony Boudain for leading me to yet another awesome eatery.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "I LOVE/HATE this place because there are so many other food stands at the Ferry Building Farmers Market on Saturdays and I always am drawn here. \n\nIf you havent tried the amazing chilaquiles, do yourself a huge favor and get some ASAP. Literally started my obsession with chilaquiles after having them here. \n\nI was also never really a fan of tamales and now have bought the tamales to make at home here several times. The jack and cheese is prob my favorite! I recently hosted a wonderful brunch and had these and they were a hit!", "author": "Hetal P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-19", "description": "I hate to ruin the party, but I just don't get the hype. I stopped by on a Saturday morning during the farmer's market for their \"famous\" chilaquiles. For ten dollars, I was expecting something super delicious and unique.\n\nService was prompt and friendly, and the dish was visually appealing. However, everything seemed to taste one dimensional-- the eggs were cooked nicely and the chile sauce was tasty-- but the combination of all of the items tasted plain. I found the fried tortillas to be oily and not as tasty as regular tortillas??!\n\nAnyways, I might swing by again to sample the fish tacos. Overall, I don't fully understand the hype.", "author": "Jackson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "I consider myself an expert on chilaquiles, I eat them about every other week from many different places, including home made ones :) \nThat being said, these chilaquiles are simple, with absolutely nothing wrong with them. They are full of good flavor and have a good mix of ingredients without being overwhelming. I don't give them 5 starts only because I would like them to have an option for meat. The place itself has food you don't find just anywhere or is not the usual \"Mexican-american made\" like in most taquerias or fast food Mexican places. The juices are healthy and go perfectly with the meals.", "author": "Sergio L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "Only had time to try one item, but I had seen the chilaquiles listed as a must order here.\n\nIt's a breakfast item and often cited as a hangover food.  Made with tortillas, refried beans, scrambled eggs, sour cream, salsa and avocado, the dish is kinda what one might conjur up in the morning from your own kitchen.\n\nIt was tasty, but I didn't find it particularly noteworthy, although the scrambled eggs were nicely done.  \n\nI hear the tamales and tacos are great here too, so maybe I need to try those.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "Poor service and over priced food.  I don't mind paying for good food but I sure didn't get bang for the buck, nor was it even good.", "author": "Lehrie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "So good! We had the chilaquiles and fish tacos. So good! It's a bit pricy at around $10 per serving, but it's definitely top quality. Everything is super fresh. We saw them making their tortillas on the spot (not just heating them up, but actually press them from a dough and making them), and cutting avocados to make guacamole. \n\nI love how they only have 4-5 things on the menu but everything is super tasty. They really have perfected their food. I would say this is the best Mexican breakfast in SF. \n\nThe line is long but it moves fast, but after you order, they make your food so that's quite a bit of wait. Totally worth it, though.", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Primavera is the first place I go at the Ferry Plaza Farmers Market. Primavera is often the best food I eat all week. Yes, of course the chilaquiles is the best ever, but I LOVE their carne asada with pineapple tacos, the ceviche is incredible (when they have it), and basically anything with masa is perfection. They always have the chilaquiles and tamales, plus two other dishes that rotate week to week. I've often found that the weirder the description of the dish, the better it is. Go often and try all of their offerings because you won't be disappointed. I never think about how much money I'm spending there (and it's about $10/plate) because the food is so good! It's rare for me, as a value-conscious person, feels that way.", "author": "Victoria J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "Always a favorite stop at the Ferry Building Farmer's market. A couple months back, got to try a couple new things and wasn't disappointed!\n\n* Niman ranch beef tacos de birria \"tatemada\" salsa de arbol, onions cilantro - 4.5 stars\npic: http://www.yelp.com/biz_photos/primavera-san-francisco?select=3ttf7BYtFve9Avg34RdetA#LO_f-5_uSkR_CMYBNLgVAA\nGreat flavor to the meat, and love the simple fresh toppings. You can add your own salsas too. \n\n* Tamales - 4 stars\npic: http://www.yelp.com/biz_photos/primavera-san-francisco?select=3ttf7BYtFve9Avg34RdetA#3ttf7BYtFve9Avg34RdetA\nTried a bite of my friend's - soft and moist, tasty!\n\n* Hibiscus Juice - 4 stars\nTart, fresh, unique!", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "We were browsing all the stalls at the Saturday Farmers market trying to decide what to eat when we stumbled upon Primavera. \n\nMy friend decided she had to try their birra tacos (3 per order $9.50) for two reasons. One, they make their tortillas by hand to order and two she wanted to compare it to her dad's birra. \n\nShe enjoyed the tortilla and thought it was better than how her grandma/mom makes them. However, her dad's birra was way better than Primavera's version. For me, I agreed with the tortilla but since I can't recall if I have had birra before I thought it was fine. I did think the meat was a little \"mushy\" but I think its how it should be?\n\nNext time her dad makes birra I'm invited!\n\nOverall Thoughts\n\nI'll have to come back again and try something else but for now Primavera is A-OK", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Favorite Saturday morning activity in SF: eating chilaqueles with extra tasty primavera salsa at the ferry building farmers market.\n\nDo yourself a favor and buy some salsa to take home.", "author": "Stine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "If you see a line for food...Stand in it. My other thought is, follow your nose.  I was drawn to this stand a few years ago by the yummy scent of chilies.  But the Chilaquiles hang in my mind, they are  the benchmark against which I measure all other chilaquiles.\n\nThe chips may be fresh and deep fried.  They are puffy.  The chipotle sauce is  fantastic.  Eggs scrambled soft fantastic, refried beans OK, avocado...I'm always up for that. Crumbled cheese a nice topping.\n\nI hate to admit it, but I love these so much I haven't tried anything else from this booth.  At $9.00 a plate they are a bit pricey but one can be split between two people.", "author": "Sam V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Favorite food stand at the Ferry Building Farmer's Market on Saturdays. Get the chilaquiles. They are the only thing I ever get but I hear the tamals are also great. Fresh, fast, colorful food with lovely service.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Agree with the majority here.  Tasty chilaquiles!  All the ingredients on the plate from the eggs to the beans, sauce, avocados etc made for a tasty combination.  The chips were solid and held up well to the sauce.  We had a late breakfast here and the line moved fairly quickly.  This was a filling meal and I would not hesitate to come back for more if I lived in SF.", "author": "louli e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Best Chilaquiles ever! Especially with their salsa. Also grab a cup of pineapple and cucumber juice there - perfect to go with the spicy food and to start a lovely Saturday at Fert building.", "author": "Kai-wing B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "One of the highlights of going to the Ferry Bldg. Farmer's Market is getting to try different food spots.  \n\nToday hubby and  I decided to try this spot.  Friends have told me they have good chilaquiles and yup they were right.  \n\nWe ordered the Chilaquiles Verde and fish tacos! Truly yum! Yea it's a bit expensive compared to regular spots but they give you a lot and ingredients are fresh.  Even my husband who's not a fan of chilaquiles actually liked it.  Ahh I wanna go back!", "author": "Claire J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "Who has the longest line of the cooking stands at the Ferry Building's Saturday market?  Look no further. In reviewing the menu, the enchilada and tamales sounded like my likely choices, but, in watching the food being picked up, the Chilaqiles El Cardinal ($9.50) became my choice.  Comprised of their freshly made crispy tortilla topped with tomato chipotle sauce, soft cooked eggs (covered with hot sauce), fresh avocado slices, and refried beans, this plate made for a hearty breakfast(http://www.yelp.com/biz_photos/6nPRtXL7lSg48stPsMLU4g?select=bAHDSbpJE3kKJkW9OBgOyw).  It was so good that I needed to pause after my first bite.  It was amazing to taste so many flavors and textures on that one plate.  A definite welcome surprise from my two previous Mexican food experiences.\nNo doubt why they have the longest lines!", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "NEVER DISAPPOINTS!!!! I look forward to Saturday mornings just so I can get my Primavera fix. I've never had a better fish taco. They are so incredible I come here to eat them for breakfast! Their salsa: awesome. Chips: no comparison. They are a staple at our place and so much cheaper to buy from them directly than going to Whole Foods. Highly recommend the fish tacos, or if they have then the crispy chicken tacos or chicken chalupa! (I don't eat beef so can't comment on those dishes, but I'm sure they're fantastic, too!).", "author": "Marissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "Apparently Chilaquiles in mexico is consider as hangover food. Who cares if it is or isn't this is definitely the best place to get it. It is probably a really inconvenient place to get it if you do have a hang over, but I go there every chance i get.\n\nThe menu is pretty simple - Chilaquiles or tacos. Get the chilaquiles!\n\nThe tortillas are made fresh then fried than topped with amazing marinara sauce served with a side of organic eggs, refried beans and avocado. The tortillas are soft from the sauce but still has a small bite to it - the perfect texture. The eggs taste really fresh and has that organic taste to it. The plate is well put together - perfect value for $10\n\nPS. You can buy the marinara sauce and tortillas at whole foods. It almost taste exactly the same!", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "It was cold, windy, and rainy. But I was hungry and determined to find some breakfast at the Farmer's Market. I had visited many times before, but never stopped here for their chilaquiles or tamales. Well, this was it. I was teetering back and forth on what to order, but everyone else in front on me ordered the chilaquiles.\n\n*Thumbs up*\nThere's nothing original or creative about the chilaquiles dish -- it's just a combo plate of scrambled eggs, refried beans, and a bunch of tortilla chips covered in sauce, cotija cheese, and avocado. But put everything together, it was just so fresh, filling, and comforting.\n\n*Thumbs down*\nThat I didn't have enough stomach space to try one of their tamales. Next time.", "author": "Dru C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "Open Saturday's only from 8 am to 2 pm, Primavera is a simple stand in the open-air Farmers Market behind the Ferry Building at Embarcadero. And yet, this small stand offers up deliciously fresh Mexican food worth writing about. \n\nI arrived at the Ferry Building just before 8 am and was one of two people in line. I ordered the Tamale Plate ($9.50) consisting of two pork tamales, refried black beans and pickled vegetables. Service at this early hour took no more than two minutes. A small vat of red salsa sits atop the order pick-up table.\n\nHow was it? The entire dish was fantastic. Everything goes well together. However, the salsa was very mild so I hope they entertain the idea of having mild and hot salsas in the future. \n\nTips/Thoughts:\n\n-There is limited table seating in this area of the Ferry Building. You're better off finding a bench, enjoying the view of the Bay Bridge in the near proximity. \n-Cash Only.\n-My understanding is the menu changes some every so often, but they always have the Chilaquiles and Tamales on there.", "author": "Tom R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "So delicious!! I don't know what was better, the atmosphere during the farmers market or the food itself. Either way, it was all amazing. I got the first option, don't remember what it was and it was so delicious. So many flavors! I initially forgot to get the sauce that was on the side but after a few bites I went back and poured it on and did it make a difference!!\n\nI wanted to get a drink but I forgot to while I was ordering and the line was way too long to go back. But they looked delicious and people seemed to enjoy them so I recommend checking them out. \n\nThe price was also excellent. Big portions as well. \n\nI want to go back to San Francisco just to eat here. Sigh, if only.", "author": "Sepi E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Their chilaquiles is one of the best prepared food options you can get at Ferry Building.  It's not a chilaquiles you would expect to find in the Mission, but it's fantastic in its own right.  It's lighter, fresher, and has its own farmers market spin on it: scrambled eggs, refried beans, fresh slices of avocado, sour cream and, queso fresco.  It's well worth the mess you'll make eating it!\n\nThe only downside is that the line is consistently long and it can be a little bit of a wait for your food, but what isn't at the Ferry Building farmer's market?", "author": "Carrie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Delicious! Delicious! Delicious! I l've driven from San Jose and Santa Cruz many a times to eat here on Saturday mornings. The chillaquilles are the best I've ever had but a little spicy. They have come with a red or a green salsa.. I think depending on the season but both are great. The beans are so flavorful and the eggs are cooked just right. Tips: parking sucks! Try and find parking on the street and walk. The farmers market can be crowded, and the line for Primavera long- but they work quickly so be patient! Bring something to drink! The plate can sometimes be on the spicier side and although they have drinks to choose from, I always enjoy some ice cold water. Get here before they close, because they do run out of certain dishes earlier in the day. Wish they were closer to me! ALSO .. Try their roasted chipotle salsa sold at Whole Foods markets in Nor Cal. So good! Bon appetite!", "author": "Kelly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "I dream about one day finding some chilaquilles as good as these closer to home. How do you make them so crispy? The sauce is the perfect spicy, the egg are cooked just right. This is my favorite thing when I visit San Francisco, and I have been know to schedule flights to be in town for the farmers market.  I am always tempted by some of the other food stands but this is by far the best and others must agree from the ever growing line.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "FML! CHILAQUILES!\n\nWhy are they so delicious?! It's almost impossible to be so good.. or is it? Screw the Roli Roti lines... come here for a better piece of heaven on your Saturday morning.", "author": "Joanne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "I wouldn't think the Farmer's Market would have awesome Mexican but it definitely does. I'm generally not a big fan of chilaquiles but Primavera's served up a great breakfast on a Saturday morning. A picture is worth a thousand words. \n\nSee: http://farm3.static.flickr.com/2711/4414326208_8aff32321d_b.jpg\n\nI will DEFINITELY be going back for more. It is worth 5 stars but at $10 it is a bit pricy.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-24", "description": "I came to Privevera with the expectations of the best chilaquiles ever. I was pleasantly surprised to find that the day I went they were serving chilaquiles verde (my preference) rather than rojo (their usual). \n\nLet me be real and say that I wasn't amazed. The sauce was ok. The main positive was that the chips were PERFECT chilaquiles chips. They were crunchy enough to hold up to being drowned in sauce. The huge chunks of avocado was a nice addition. The eggs really kind of got me down though. I'm not an expert in the chilaquiles field, but my local spot serves their eggs over easy and there is something magnificent to breaking the yolk on the chips. The taste is outstanding. And this is now my preference. The scrambled eggs Primavera dished up were disappointing. At $10 per plate...it didn't feel like the right investment of my dollars or my stomach.\n\nMy sister, however, came raving about the fish tacos. She insisted I snag a bite of one of hers and they did NOT disappoint! YUMMY! I honestly wanted to steal more but thought it was the right thing to do to eat my chilaquiles. \n\nI enjoyed the scenery at the Saturday Ferry Plaza Farmer's Market and eating my breakfast by the water (and next to a bum). \n\nI would love to come back and try the red chilaquilas and other menu offerings (and get one of those fish tacos to myself). I will update after my next trip to SF!", "author": "Leah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "I like this palace!  My favorite breakfast with nachos! Simple ingredients but an absolutely amazing combination! The price are excellent !!", "author": "Pilow K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-13", "description": "The food is pretty good at this food stand, in the Ferry building's Saturday farmers market. It's also one of the most popular food vendors. But at $9.50 per plate, the prices are more than double what you'll pay at most Mexican taquerias. Frozen tamales and containers of salsas (one of my favorite salsas) are also available for sale to take home.\n\nPork tacos and tamales:\nhttp://static.px.yelp.com/bphoto/ZTxZdWZjD37RtRSkDML1Kg/l\nhttp://static.px.yelp.com/bphoto/hi3wjj41YYu7-QkdaNF-Cg/l\n\nFood quality and taste is 4-5 stars + price is 2 stars = 3 stars.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "It took Anthony Bourdain's cynically sinister stroll through the Ferry Building Farmers' Market on his addictive show, \"No Reservations\", to tempt me to come here against my bitter...uhhh, I mean my better judgment. That and the fact that rising star chef David Chang was signing his new Momofuku cookbook at Sur Le Table later that morning. He's the one that recently said that \"...every restaurant in San Francisco is serving figs on a plate with ...nothing on it\". (BTW, he's also the one with me in my current profile picture...his food is amazing regardless of his smarmy comment!) \n\nAnyway, I never felt motivated to walk beyond the Rose Pistola kiosk to navigate the swarming crowds at the market until I saw the tamale plate Bourdain had on the show. Since Jamie W. and I had an hour before the book signing, we waited in line at the Primavera stand for one of their fabled Mexican breakfasts. There were four desirable selections on the framed menu, and I went with the $9.50 Chilaquiles \"El Cardenal\", which was a paper plate of chilaquiles with tomato and chipotle in adobe sauce accompanied by scrambled eggs, onions, crema, and refried beans (see photo). \n\nIt was a tad pricey for what you get, but the combination of flavors burst in my mouth with every bite, especially the spicy kick of the chipotle. You certainly can't beat the view of the Bay Bridge, and there was never a shortage of weather-worn wooden benches to sit on to be able to lap it all up. I'll definitely come back for the tamales and the enchiladas on some other Saturday, and perhaps I can also be cool and cynical like those bad-boy chefs. \n\nFOOD - 4 stars...a solid four-star plate of food with Ferry Building prices \nAMBIANCE - 4 stars...the Bay Bridge on a sunny day \nSERVICE - 3.5 stars...efficient for sure \nTOTAL - 4 stars...Bourdain is right again, dammit", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "Oh my god. SO good. I am so sad it took me 2 years of living in San Francisco to discover this!\n\n* Field of Greens - 5 stars!!\n(with scrambled eggs, refried beans, sour cream, avocado, queso cotija, white onion and cilantro)\n\nThe scrambled eggs were DELICIOUS. So soft & fluffy, creamy, flavorful, I wonder how they made them so good! The beans were really good (I got black beans, not pinto beans)...though still second to the amazing black beans at Gracias Madre.... Sour cream seemed homemade--fresh, light, and tasty. Cotija cheese is my weakness and it was a really great addition.\n\nI ordered with a friend and split it and still, it was so much food! So while it's sort of expensive to get a full plate for $10, I think it's a lot of food.\n\nI guess the one thing I would have wished is that they had given me some of their really awesome-looking guacamole instead of just cut up avocados...\n\n**Note to vegetarians--As I ordered, I asked if the refried beans were totally vegetarian and my server was very nice and told me that while they weren't the black beans were. So be sure to ask for the beans that are vegetarian!", "author": "Neeharika B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Met some new friends at the Embarcadero farmers market. Got my blue bottle coffee and off we went to explore. We made a beeline to Primavera for the breakfast tortilla meal. WOW was this delicious. I had to order additional stuff just to taste everything. Pork Tamale  best tamale I've ever had, moist overflowing with pork. Chalupa with Chicken again everything made fresh on site as you watch amazing! The line and wait were long as you would expect when you have a winner.", "author": "Rick F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-15", "description": "We stopped her on the way to the spa for brunch.  Their chilaquiles was delicious!  The chips were somehow still very crispy and it tasted great.  The fish tacos were pretty good, and their salsa was very yummy.\n\nI'd prefer Hapa Ramen to this if they were there, but overall not a bad stop at the farmer's market to take.", "author": "Tracy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "One of the best chilaquiles ($10) around anywhere. Also has some dope beer battered fish tacos ($10 for two). They usually have these two plates and a couple others every Saturday. Also offers some refreshing drinks - hibiscus tea and another fruity (orange lime) one, ranging from $3.75 to $5. In my humble opinion, this is one of the top 3 food stands at the Ferry Bldg - along w/ 4505 Meats and Roli Roti.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "Ordered food for 8 people, and they mixed up 1 item and failed to even add another item from the order.\n\nComplained and got one item replaced by the server, but the manager refused to fix the second item and got very defensive and brought out a separate receipt for it.\n\nThe food tastes fine, but so does the food from any Taqueria in the Mission. When you charge 3x as much as this stuff costs to make you would think they could eat $6 for screwing up a $100 order.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "The chilaquilles are unbelievable. I have been hearing about this place for some time so when I was in town I had to make the trip - so worth it.", "author": "Cris V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "This tiny little stand, hidden in a sea of people, with a line stretching all the way to the water, smelling like hot peppers and searing meat and fresh squeezed lemons, serenaded exclusively by a man with a sweet alto voice... I have Yelp to thank for even beginning to be able to find it.  And for enlightening me to the existence of the Embarcadero farmers' market in the first place.  I am a thankful tourist - thankful that I didn't end up at Fisherman's Wharf being sorry I ate at one of the crappy seafood restaurants, toured Alcatraz for $25, and/or stuffed my face with Ghirardelli chocolate whilst touring Ripley's Believe-it-or-not museum.\n\nAnyway, what I'm trying to say is that my experience at Primavera was the opposite of those things.  I had the tamale plate - one of each of the pork green chile and the beef with tomato salsa, plus black beans.  My boyfriend ordered something which I have forgotten the name of, but it was like two crispy giant tortilla chips stuffed with ricotta cheese and some other stuff... but mostly ricotta cheese.\n\n5 stars for my tamales.  3 for his tortilla thingy.  While both of them were mouth-meltingly good on the first few bites, my meal stood up to the test of time, and the test of 'oh my god I'm so full is it worth the stomachache to finish this?'.  Those tamales were complex and spicy and full of surprises at every bite.  The black beans - and I'm not even generally too crazy about black beans - were the best black beans I'd ever had.  I licked the plate clean of them.\n\nMy boyfriend's dish, however, just got very ricotta-cheesey the more of it I ate, and it definitely needed salsa to spice it up.\n\nBut our drinks!  Strawberry lemonade and pineapple-cucumber limeade, both ladled out of giant jars and clearly homemade.  The lemonade had nice crunchy seeds at the bottom that I gobbled up when I finished the drink.  In a uniquely Californian way, everything tasted like you were sipping the juice directly out of a fruit still swinging from the tree.\n\nAnd to the man who serenaded the group of kids by our table with an extended version of 'Old MacDonald Had A Farm', complete with realistic animal noises - thank you.  This was the perfect soundtrack to our meal.", "author": "Hannah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "Best Chilaquiles  Ever. No question about it.\n\nif you don't know what chilaquiles are, here's a quick rundown of what to expect from Primavera's Chilaquiles:\n\nCorn tortilla chips, smothered in a red (usually) salsa, topped with sour cream, avocado, onions and cilantro. Served with scrambled eggs and a side of beans (usually re-fried i believe).\n\nthat's it, simple enough. Admittedly it sounds a little pricey when you consider the simplicity of the ingredients list, but the final product is much greater than the sum of all it's parts. It's totally worth it, and it's totally worth the wait in line as well.\n\nThe agua frescas are usually really good also, so definitely give those a shot.\n\nI've brought many many people to try these chilaquiles for their first time ever, and literally it never fails. Every single one of them totally loved it.\n\nJust to clear up some potential confusion, Primavera is not a restaurant inside the Ferry building. It is a food stand that is open for business during the Saturday Farmers Market at the Ferry building. Go to the back of the building and walk towards the restaurant behind the Ferry Building. look for the white tent with the long line.", "author": "Charles Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Sometimes, the best advertising is other people buying food. The chilaquiles are otherworldly, as good as they look. And the seafood (shrimp, scallop, octopus) tostadas are unbelievable and giant. Both come with hella avocado. So legit, probably the best meal at the Farmer's Market.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I've changed flights so I could get to Primavera for chilaquiles on Saturday morning.", "author": "Bradley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "If you're looking for a pretty amazing breakfast at the Farmer's Market and don't want anything super fancy inside, Primavera is the place for you.  The Chilaquiles Aquascalientes is SO good no wonder there was a line right when it opened in the morning.  Check it out!", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "The chilaquiles are a great vegetarian option at the farmers market. But maybe I'm just a sucker for avocado.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-08", "description": "On my 4th visit I really had to write a review: the best Chilaquilles ever!!!!\n\nFood in San Francisco is amazing...so amazing that even food stands can be incredible.  This spot in the Ferry Building is no exception - great quality food.  While it is a little on the pricey side for what would normally cost about $4 at a taqueria, this is great quality stuff.  I almost always get the Chilaquilles - tortilla chips topped with a spicy red chile enchilada sauce; this is served with fresh refried beans, amazing and rich scrambled eggs 9the best scrambled eggs I've ever had!) and sour cream and avocados.  \n\nAt $10, it's a bit much for breakfast without waiter service, but this is San Francisco and with the food that good, it's totally worth it.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "I had the ceviche tostadas here. They are truly incredible, and doubly so considering they are served from a tent at the farmers market. The fish was very fresh, well cured, and incredibly flavorful without being overly fishy. \n\nDo it!", "author": "Nathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "After stuffing myself with pluots and dark chocolate almond bark outside the ferry building, I saw people with these amazing-looking plates of food containing avocado, beans, and just overall goodness.  I asked someone where he got his food, and he told me Primavera was the supplier of his plate of happiness. \n\nI quickly searched the place on Yelp to determine what to order, and I settled on the chilaquiles. The ingredients were so incredibly simple - tortilla chips covered in some tomato-based sauce (yet still crunchy), refried beans, avocado, scrambled eggs, sour cream, onion, and cheese. The sum truly is larger than its parts, because together it was delicious. I recommend loading up all the ingredients - yes, the eggs too - on a chip. Heavenly! \n\nOverall, it wasn't mind-blowing amazing, but it's definitely worth a lunch trip to the Ferry Building. It is rather expensive/over-priced though (for one plate of chilaquiles and two strawberry frescas, $17?!?!?! Ain't no brokeass Berkeley student got time for that). But I'm definitely willing to go back to try their chalupas and other mouth-watering menu items!", "author": "Crystal J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "OUT OF CONTROL ...AMAZING!\n\nSeriously, every time I come up north to visit my boyfriend we make it a point to take a trip to the Ferry Bldg on Saturday just to get some of this delicious food. The chilaquiles are out of this world ...\nMy mouth is water as I type this review.\nyes, they are THAT good!\n\nI've also tried their fish tacos, can't go wrong with these either. So tasty, and perfectly made. They really know what they're doing here.\n\nIf you ever have a chance to get their chalupa, DO IT.\nI'm pretty convinced that there is no way you can go wrong with anything on their menu!\n\nIt's wonderful to enjoy such amazing food, consistently. The quality is always great, fresh and full of flavor. The fact that they are mobile at farmers markets is very impressive - I don't think I could say enough wonderful things about this food!", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "It's tough for me to try other vendors at the Ferry Building farmer's market on Saturdays when Primevera beckons. I usually get the tamales plate and put a few spoonfuls of their salsa on top. It's heaven on a plate. They offer a meat option and a veggie option and change it up depending on the day. One of my favorites forgotten treasures is the pickled veggies that they put on the side. So yummy and lessens the guilt of stuffing myself full of carbs.\n\nI tried their chilaquiles and didn't like it all that much. I have friends that swear by it though. I thought it was a bit over salted and the eggs were over cooked. The chips had that not soggy but not crunchy texture that I didn't like. I wish they would just use un-fried tortillas. I'll give it another try though. Maybe I just had it on a bad day.\n\nThe boy had their fish tacos and loved it too. I had a few bites and thought the flavor combination was on the mark. The fish was so tender and melts in your mouth. Although I thought that with such a good piece of seafood, why fry it? The ginger peach tea was amazing too. \n\nAnother San Francisco go-to spot for me.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "There's only 3 things on this overpriced menu so every one of them better be the best thing ever. After spending $13.50 for a plate of chilaquiles and a jamaica tea, I'd say the food was above average, but not worth the price. The chilaquiles came in a roja sauce that was tasty enough, but nothing special. There was a side of scrambled eggs and overly salty beans. The plate was enough for me, but I have a small appetite so I can see a regular guy being hungry after.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-18", "description": "Yelp was a complete let down on this one.\nWe had the much advertised Chilaquiles, and an order of the beer battered fish Tacos for lunch today, and the food was a big disappointment. \n\nPrimarily, the flavors were completely lacking, and the food was pretty greasy. People serving the food seemed to be doing so with bare hands - no gloves! What's up with that??\n\nThe best Mexican food that I have had yet has been from Santa Fe, New Mexico, and this place just doesn't cut it for me. Won't be back.", "author": "Snowy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "I'm a huge fan of the ferry building farmers market, but I typically always get the same things.  I managed to pull myself away this time to try something new.  Seeing all the plates of chilaquiles and chalupas this place seemed like a solid place to try.  I got the pastor tacos and the chicken chalupa.  Great, fresh ingredients.  A bit difficult to eat either one with a fork though, but when you hold them it gets all over the place.  oyyyy oh well, it's still delicious.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-21", "description": "Sometimes the long booth lines can be deceiving because you assume that the food has something worth drawing people in.  But in the end, it could just be a monkey see, monkey do kinda thing.  That's how it was with Roli Roti Gourmet Rotisserie and this place too (but not as bad).\n\nThe man and I ended up getting a Chicken Chalupa plate ($9) & a single Pork Tamale ($4.25--comes with a side of black beans). There was one other dish on the menu which was sold out.  I think it was a breakfast plate of some sort and I hope that wasn't the main attraction.\n\n The chicken chalupa is topped with sour cream, guacamole, and salsa.  I wish the masa dough was cooked crisper--it was sort of in between.  The pork tamale is well... a pork tamale.  I think I had a more flavorful one at the dainty Castro Valley farmer's market (and that was without sauce).  Now don't get me wrong, it really does not get any fresher than this.  You can tell that the tamales were only made yesterday and the chalupas are cooked right in front of you.  BUT everything tasted rather bland.  Even though the pork tamale was layered with what seemed like enchilada sauce; it didn't really help.\n\nWhat's cool is that they offer all these exotic drinks: ginger-peach iced tea, hibiscus Jamaican juice, and some blackberry drink.  I saw tons of people drinking it but thought I'd pass.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-26", "description": "Outstanding chilaquiles! Everything done to perfection, and a generous serving of avocado on top. \nA Saturday morning, a plate of chilaquiles, sitting on a bench watching the bustle of the ferry market, with the water behind you - a marvelous San Fran experience.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "They are friendly people who make great food. Simple and fresh ingredients cooked well and compliments each other. I had the chilaquiles and it was great and very filling.", "author": "Jason Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "This was so much better than it looked like it might be.\n\nGreat tamale. Great black beans. Garnishes all so fresh and crispy and crunchy. Delicious house made pickles (cauliflower, carrot, etc.).\n\nPork sopes were unreal delicious. Just wow.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "Mom ordered the Chili Colorado chilaquiles when we were here two months ago.  Those things were awesome.  She loved them, and she is hard to please when it comes to Mexican food.  They were tasty and were full of flavor.  My mom judges breakfast restaurants by their chilaquiles, and these were top notch.  Better than almost all of the ones have had in Mexico.  I was surprised to find such good food here. Oh, they come with beans.  Eat them up.  \n\nOnly drawback?  Almost $10 a plate.  Damn Gina, they are just fried tortillas!  Still, when I come back to eat at the Farmer's Market, Primavera will be the place to be for me.", "author": "Humberto G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "The things I will do to avoid writing a final presentation on a gorgeous Saturday in SF...\n1. So You Think You Can Dance Hulu marathon in bed.\n2. Put on make up to go outside for 30 minutes.\n3. Stand in the lunchtime line for Primavera's tamales.\n4. Write Yelp reviews.\n\nI love tamales. Don't really know why... they are homely little things. Have you seen a tamale photograph well?? Nope. Although when I think of it in terms of mashed carbs with saucy savory goodness in the center, it makes a little more sense. \n\nOrdered a plate of two tamales, one maurilias pork and one white corn squash n cheese, served with black beans and pickled veggies; and a hibiscus juice:\n\nPros\nMy drink was free. I don't know if that's normal.\nThe beans were bangin. mm creamy, smoky, and topped with queso fresco.\nService is pretty quick and friendly.\nThe tamales are big. \n\nCons:\nAlong with being big (good), the tamales were way too dense (boo). I've been ruined by Rick Bayless' creamy, light, fluffy sweet corn tamales at Frontera Fresco and the masa here pales in comparison. The filling was also pretty tasteless and underwhelming.\nHibiscus juice a little too tart, though at least it wasn't cloyingly sweet.\n\nI've lost my train of thought. I'm in tamale depression. The chilaquiles were ogle-worthy though so maybe I will give those a try next time.\n\n***UPDATE***\nOk. I'm adding a star to bring my review to 4. I just vacuumed up an entire plate of chilaquiles, topped off by a satisfying buddha-belly pat. The salsa-drenched tortillas were the perfect level of crisp, and balanced out the soft textures of the eggs, avocado, really fresh sour cream, and refried beans. Other reviews are right, the eggs aren't anything special; I also prefer the black beans that come with the tamale dish to these refried beans. But the whole plate comes together really really nicely, and I'm glad I was constrained to whatever was on my plate because I would not be able to stop if an entire platter was in front of me.\nAlso, drinks do not come with the meal. I must have just lucked out last time!", "author": "Michelle Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-19", "description": "This place kicks Mama's(the Restaurant! not real mama:-) ass as far as breakfast goes.  IMHO their breakfast is just DELICIOUS.  Their 3 citrus fresca is the most delectable drink I have ever had.  It had just enough sourness to counter the sweetness, first time I have ever finished my juice, it was that Good! Their Chilaquiles with Chorizo is awesome, the scrambled eggs goes perfectly with the Chorizo.  The chips was also great with some sort of covering on them.  Since the guy sitting next to me had some tamale I had to tried them.  I ordered the pork and chicken tamale.  I felt the pork tamale was better than the chicken tamale which was slightly dry.  Overall, perfect Mexican breakfast for the champions! :-)\n\nUpdate:\n\n1/26/08\n\nI am always surprised at how restaurants owners think?\nI mean if there are things that people like, do you take it away just to be funny?\n\nI went to the farmer's market today for my breakfast. \n\nMe: I would like a Chilaquiles with Chorizo please?\nWASPY guy: We do not have that today?\nMe: What do you mean? I had it last week?\nWASPY guy: well, last week we had another dish with the Chorizo so we have Chorizo with potatoes but today we don't.\nMe: OK, I will have the Chilaquiles with the 3 citrus drink.\n\nNow I know why this place is still in the ferry building farmer's market.  I mean the thing about restaurants is their consistency.  Every time you order a Big Mac you know what it will taste like.  OK, it ain't great but at least you know what you are going to get.  I mean do they say sorry we do not have Egg Mac-muffin today because we do not have Bacon today? No. They don't!\n\nBTW, the Chilaquiles was completely different than the one I had last week.  The scramble eggs was stone cold, and even the 3 citrus drink tasted exactly like lemonade.  WTF.  That was it.", "author": "Jim J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Hands down- best chilaquiles I've ever had eaten.  They use the best quality ingredients.  They make the chips, which are great without any salsa, in case you want to buy them separately.  The eggs are humanely raised and local.  These eggs sell for about $10 a dozen at the grocery store.  So $9.50 for a meal here is a deal considering the quality and ethics!", "author": "Burger T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "This food stand rocks! I'm not a huge fan of Mexican food coz it's like the same ingredient that's Been assembled in many ways but this one is different. One of the best Mexican food ever! And the corn tortilla omg! \nI was hoping to try their ceviche earlier but they don't have it today. I didn't know they change the menu often. However, I am so happy with my order. I got chile rellenos and it is so damn delicious. I've had this dish before but this one is absolutely better! Way better! As in 100 miles way better! :D the sauce on top is good with pomegrante bits. Weird but good.\n\nThey also have fresh squeezed juices. The one i got is pomelo. Good! ;) but I don't think it's for everyone.  \n\nI'm hooked now in this food stand.", "author": "Cryszilla G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-31", "description": "I wanted to love this place so much. I missed it last saturday and spent all week waiting until this saturday, planning my meal based off of reviews here. I'm a vegetarian, and a brunch lover and mexican food aficianado, so I was really emotionally invested in this experience. It was hard to find as it was lunch time and it was all the way in the back of the farmers market near the water. There were masses of people there and no way of discerning where the ordering line ended and the pick up line began. I just looked at the menu and  jumped in near the register. I couldn't decide between the chilequile and the tamale dish so I got one tamale ala cart. The chilequile dish was $9.50 and the tamale was $5 and I couldn't decide between the pineapple cucumber or strawberry limonade juice so I got them both for $7.50. I was so excited, and the long queue of people was validation so I couldn't imagine the impending let down after a week of build up.\n\nThe only thing on my order of any worth was the pineapple cucumber which earned this review one star, the other star was for using organic ingredients. It was sweet but not overly so and refreshing, perfect for the warm sunny weather. The strawberry limonade was very tart at the top and got sweeter towards the bottom, it was weird.  I was looking forward to this chilequile dish so I took one of the soggy but firm tortilla chip and I was already hating the texture and dipped it into the black beans (their refried pinto beans are NOT vegetarian) and was taken aback by the saltiness. I thought wow i'm going to be bloated from the fluid retention and sent into a hypertensive state. I was hoping it would get better but the second bite was less satisfying than the first. Then it hit me... It tastes exactly like soggy CHEESY DORRITOS with beans and eggs... gross. I couldn't believe I spent over $20 bucks for this. I took off a star for the saltiness of this food.\n\n I took off another when I went to taste the potato and swiss chard tamale and saw meat in it, they messsed up my order. They were apologetic but Instead of giving me a new tamale and they threw the entire plate away. I admonished the guy on being wasteful. They gave me a new plate right away. I should have opted then for the greasy chile relleno so that I could have tasted all of their lackluster offerings. I couldn't finish the chilequile plate, the swiss chard tamale wasn't any better, it lacked depth of flavor, had very little chard in it, it tasted like a mexican take on a  samosa but without the spices and crunchy textures of an indian one. The person next to me also had a plate full of that wet dorrito flavored tortilla chips that went uneaten. Don't waste your time here. If you still decide to go, think of soggy cheesy dorritos when you bite down and think of me saying I told ya so. BTW search for dorritos in other reviews. I'm not the only person who thought it tastes like processed junk food.", "author": "Onika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "4 stars for the seafood ceviche. While I was waiting and wasting my time at Namu, my mother was waiting for the seafood ceviche at Primavera. The ceviche was prepared very well. I could taste the freshly squeezed lime/lemon mixture over the sweet delicate shrimp. Mixed with a lovely pico di gallo and topped with fresh ripe avocado and served on a freshly fried tortilla, easily made my morning. \n\nPrimavera also had a sampling of their fresh tortilla chips and a bean dipping sauce that was very delicious. Will def. come back and try the other Mexican delights when I'm back in the bay. Totally worth waking up at 630a to beat the crowd at the Ferry Building Farmers Market.", "author": "Marcus L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-15", "description": "** I suggest getting a half-order of chilaquiles verdes, since it is a ginormous portion.  A lot of people were getting a half-order of that, and also a half-order of the the tostada ceviche.\n\nIt's OK, but not worth a trip.  Here is what I had (see my photos):\n\nChilaquiles verdes: green chilaquiles with a sauce of chile poblano-tomatillo sour cream, avocado, onion-cilantro cotija cheese, Free range local eggs and refried beans: $9.50.  It was OK.\n\nshrimp and snapper tostadas de ceviche: with avocdo, lime mayonnaise and tapatio salsa: $10.  It was OK.\n\nAlso on the menu was:\n- beef brisket crispy tacos $9.50\n- mole amarillo chicken tamales $9.50\n- mushroom spinach tamales with chipotle salsa $9.50\n- aguas frescas: jamaica-lime, pineapple cucumber, watermelon/mint lime.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "I'm going to make Primavera's chilaquiles a \"must have\" every time I'm in town on a Saturday morning. Navigating through the crowds and busy farmer's market was a bit hectic, but trust me, it was well worth the trek. The chilaquiles were the perfect crispiness, and were complimented well by the sour cream, onion, and fresh avocado toppings. Plus, I was pleasantly surprised at how good the eggs (buttery!) and beans (topped with cotija cheese!) sides were. Eating this delicious plate with a gorgeous view of the bay and Bay Bridge was picture perfect. Wish I lived in SF just so I could spend every Saturday like that.\n\nPS-I'm from San Diego (where mexican food is at its best) and have had chilaquiles in TJ, and I would still say Primavera's chilaquiles is one of the best I've had.", "author": "Cha V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "Every time I get the chiaquiles - so satisfying. We also branched out and got the carnitas tacos and they were room temperature including the pork.  Go early because they run out of items and the line can be really long at noon.", "author": "Karrot L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "These tamales are really amazing. I bought some from Whole Foods and I was hooked forever since. The masa dough is soft, moist and fragrant. The fillings are just lovely. Even the vegetarian one tastes wonderful. The mushroom and spinach one is my favorite.", "author": "Mona W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "Ehh overpriced fish tacos, and not really worth the wait.  Don't get me wrong it was good, but you can get these at any taco stand.  The fish was nicely fried and not too battered.  There is also plenty of lettuce.  The guac was good, the fish was okay.  Biggest problem is the taco is way too big for street food.  Gets way too messy.  I wish they made smaller fish tacos.", "author": "Terence N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-18", "description": "How anyone can give this place less than 5 stars is beyond me.\n\nWe eat here literally every Saturday we are in town - have for years - get their tamales to make at home too.  I have NEVER had a meal here I would describe as anything other than excellent in years of eating here almost weekly.\n\nThe ceviche tostada when they have it is too good for words but our stand by are the Chilaqiles which are just perfection - pasture raised eggs - home made tortillas - chunks of avocado and mexican crema - a plate of insane goodness.\n\nThe aguas frescas are house made and pure fruit - I should know as we ordered large batches for a party recently and got the pulp then added water once we had them home - EVERYONE was raving about them - what a hit!", "author": "Mylea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "Delicious chiaquiles. Every time I've been here it's been really good. There's nothing quite like a steaming hot plate of beans, fried tortillas, eggs, and salsa or mole to get you moving on a Saturday morning. I've also tried the tamales and they're delicious too. \n\nBeware it's often crowded, you'll have to wait a bit, and there's usually only outdoor curb side seating.\n\nPrimavera's stand is one of the best Mexi-Cali places outside of the Mission.", "author": "Velshin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "I'm not even sure I can adequately express in words my love affair with their chilaquiles, but here goes.\n\nI was introduced to this delicious breakfast dish sometime last year by my friend, a bay area native.  One taste and I was hooked.  For awhile, I made it my Saturday morning ritual to come to the Farmer's Market and get my chilaquiles fix.  But, like most things that taste this awesome, it just wasn't good for my waistline, so I've eased up a little on my obsession.\n\nI've never tried anything else here, but I've heard the tamales are good (you can actually buy them at Whole Foods on Franklin).  I usually sub the refried beans for whole black beans (that's a whole different love affair in and of itself).  It's a bit pricey and you often have to wait quite awhile, but you can tell the ingredients are quality.  Like for most things at the Farmer's Market, you're paying for the atmosphere and the view of the Bay.  If you've got an extra 4 or 5 bucks to blow, try some of their refreshing beverage concoctions.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-06", "description": "S.B. and I eat at Primavera every Saturday.  We always order the special which changes every week.  So far, I've never been disappointed and I love being able to taste something new each time.  A couple things never change - the ingredients are fresh, based on what is in season at the time, and their masa is the best!  I'm pretty amazed that I haven't had one bad meal there to date.  (Wow...the fish tacos!  If you happen across this dish, it is a MUST).\n\nIn addition to ordering the weekly lunch special, we also take home a bag of tamales (love the butternut squash/cheddar the best), chips and salsa to eat during the week.  Only bad/good thing is, this food is fresh with no preservatives, so it won't last more than a week in the fridge without getting moldy.", "author": "Burrito M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "Saturday mornings I'm known as Esmeralda at the farmer's market.  It is the name I give when I order the perfect fish taco, amazing chilaquiles, ridiculous chile relleno.  It has gotten to the point where people from the market just call me \"Esmeralda\".  \n\nI can't say enough about the perfection that is the fish taco.  First can we start with a freshly made tortilla?  They press the tortilla right in front of you!  Then comes a hearty sauce and two perfectly deep-fried pieces of fish.  Next is the avocado cilantro crema topped with thinly sliced cabbage.  I could live off of these things!  \n\nI've learned to order an half order of chilaquiles when I give into my cravings.  The eggs are soft scrambled, the tortilla chips are made by primavera and have a thick bite.  They are topped with crema, onions and chunks of avocado.  Everything is served with a side of beans - your choice of pinto, refried pinto, black and refried black.  I usually go for the refried black beans.  \n\nGo and tell them Esmeralda sent you!", "author": "Monica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "I've been very hesitant to write this review because I don't want it to get anymore crowded than it already is, but I gotta lay it down and tell you the truth.  This is part of my Saturday morning ritual and I love it!  After an hour of spin class, I stroll over to Primavera and get my grub on.  I'm sure you're wondering what the heck brings me back to this place weekly when the Farmers' Market has so much to offer.  I'll tell you: if they have tacos of any kind that day, you better get it and get it early before it's gone because hands down it's going to be delicious!  Also, their verde chilaquilles is spectacular.  As for the tamales, I heart the spinach and mushrooms one.  It's all amazing and totally worth the wait which is always long if the day is sunny.  \n\nNow that I have confessed my love for Primavera, if you see me in line behind you, just save me an order of the verde chillaquilles or the taco plate, ok?  Thanks in advance!\n\nP.S. Minus 1 star for the fact that they're not the cheap Mexican food I'm used to.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-06", "description": "The best chilaquiles in town, and some damned fine scrambled eggs on the side. They sell other things? Oh, right... yes, they also have some good tamales and... well, if they don't have chilaquiles, my Saturday is essentially ruined, so forgive me for not remembering the other stuff. ;)\r\n\r\nDownsides: The long lines, and the limited hours. If this were a real restaurant, I'd have a hard time justifying breakfast anywhere else.\r\n\r\nUpdate 7/14: Just tried their fish tacos for the first time: Mmmm-mmm!", "author": "anita c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-04", "description": "Wow. Jean and I were at the Ferry Building Farmer's Market this past Saturday. The market opens at 8am, we were there at 8:15am and saw this long line at the Primavera booth. We got in line, without even really knowing what was in store for us. We just knew it HAD to be good. \n\nWe ordered the tamale plate. It had two tamales, the pork tamale and the green chili tamale with some black re fried beans. It was honestly the BEST tamale & beans I ever had in my life. Sorry Georgina & Petra, this includes your homemade tamales. \n\nThe beans had this incredible smokey flavor. Just great. We live about 90 miles from the City, but I have a feeling we will be returning soon for more of Primavera's divine food. WOW.", "author": "Rocky F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-16", "description": "This place is amazing. I would get (have gotten) on a plane for the breakfast here at the Primavera tent on any Saturday morning of the farmers market.\n\nIncredible tamales, black beans and eggs; all with salsa. It is really special and the vibe is, well, THE VIBE. What can one say...be there or be square.\n\nI can't believe I have not reviewed this before - I just included it in a Farmers market review I guess??? Oh yeah - entire meal noted above: $6.50. You can't beat that with two sticks and a whisk.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "Excellent tasting, though a tad small on serving size. Reasonable prices. The setting is beyond - the Bay Bridge, the SF Bay, the sights & sounds of a busy market. Oy! Sat morning in late fall had decent crowds & no long lines to complain about. People watching galore!", "author": "Candace V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "I love Tamales...and Primavera's Tamales are fantastic!  During our last visit to San Francisco, I wanted to try something different from another vendor at the Farmer's Market.  I left feeling very disappointed that I had not ordered Tamales...There's always next time.\n\nPretty pricey, as most Farmer's Market goods are, but the plates are huge and the food is delicious.", "author": "Joanne N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-12", "description": "Hard to miss this food stand since it always has a huge line.  Folks often write reviews and comment on whether the food is worth the money.  Since time can be considered money, those folks should factor in that premium into their calculations for Primavera because it will cost you a lot of time.  The food is pretty good, but I don't think it deserves the fanatical following.\n\nChilaquiles Verdes: Seems like a glorified nacho dish.  The nachos are awesome though, tasting freshly made and the green salsa gives them a good kick.  The refried beans are just refried beans and scrambled eggs are just scrambled eggs... kinda blah.  The soft avocado and sour cream gives some good personality.\n\nPozole Rojo w/ Pork Riblets: Love the red stew base and all the soft hominy.  The pork riblets in the name are deceptive because there was probably only one in the dish I got.  I definitely appreciate this dish because it doesn't seem prevalent at the Mexican joints around town.\n\nCrispy Potato Taco: A Mexican samosa?  Came with the Pozole Rojo.  Definitely a first for me.  A nice, slightly spicy mashed potato wrapped in a deep fried corn taco folded in half.  I could definitely see this catching on in middle American along the lines of microwave taquitos.  Was a great when dipped in the pozole rojo, though didn't do a good job of absorbing much sauce.\n\nPotato & Chorizo Sopes: Loved the corn base since it was thick enough to have a chewy inside between the fried outer edges.  The chorizo was extremely salty so I couldn't eat at such a rapid pace.  Good in small doses, definitely share this plate.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "MMmmmm chilaquiles (or as my friend calls them, \"nachos with red sauce\") and pork tamales!!! And smother your plate with their salsa! It's great on everythinggggg :)", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Excellent Veg. taco, so fresh. The veg. taco is not on the menu, so you will have to ask them to create it. The tortilla is the best I've ever had. So glad I stopped here.", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "Yowza. We got the shrimp and snapper tostadas and the chilaquiles. I think the chilaquiles are very good, though over rated by other yelpers. The tostadas though! So good. The flavors! The fish! The shrimp! I'm craving it so bad as I write this.", "author": "Trent M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "It must be a Bay Area thing, I've never heard of Chilaquiles growing up all over Southern California. But whatever it is, you just have to know that the chilaquiles here at Primavera (9.5) is very good. Just the right amount of sauce on top of fresh chips that hold their crunch. Wash down with a pineapple, hibiscus or strawberry agua fresca (3.75) a perfect way to start  a sunday at the farmers market.", "author": "Vince E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "You just CAN\"T miss eating at Primavera's stand at the Ferry Building during Saturday's San Francisco Farmer's market.  It's a love affair with food for the foodies out there.  You have to take in the enitre farmer's market experience if you enjoy food like I do!!!\n\nPrimavera is known for the tamales which are terrific but I just LOVE the Chilaquiles Aquascalientes and the Oaxacan Tlacoyos.  This place knows how to do food.\n\nThis is a breakfast of champions and you follow it up with a coffee from Blue Bottle Coffee.  Yum!!!", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "Really liked the fish tacos and the ceviche tostada. The waters out of fruits were really good.", "author": "Guillermo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "EAT THIS.\n\nEAT IT NOW.\n\nThe chilaquiles at Primavera are beyond righteous. This is easily the best Mexican breakfast I've ever had this side of the border. The tortillas used for the chips are thick, hearty, and rustic, and each bite unleashes an explosion of corn and peppery undertones that I've never experienced elsewhere. Then there's the aroma. Oh, the aroma. The chips have a subtle, loamy bouquet that reminds me of an earthen oven or wood chips from a smoker. Or maybe it's the sauce I'm smelling. Either way, I'm telling you, you gotta try it.\n\nAlthough the eggs and beans are the real meat of this dish, it's the seasoning and condiments that make it so extraordinary. For starters, Primavera uses Guajillo chiles in the salsa, which I rarely find in the States and I think adds much subtler, and richer, taste than jalapeños. A similarly authentic note is provided by the cotija cheese, which, like parmesan, adds a nutty, dry note that compliments the eggs and avocado very well.\n\nAll in all, if you're ever near the Ferry Building on Saturday, you simply must give this a try.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-13", "description": "For the many times I've been at the SF Farmers' Market I've always passed up Primavera because of the long gringo lines. Yesterday I found the line to be incredibly short so I decided to give it a shot.\n\nI was looking at the plates and wasn't too thrilled with the portions until I spotted the tamales. I ordered the tamale plate, 2 tamales with beans $9.50. I thought it was a bit steep for just tamales except I was craving some after seeing a tamale demo earlier in the week.\n\nWithout much wait the my order was ready. It looked quite good. I spooned some watery-salsa-whatever on my plate from the huge bucket-like vat. Taking a seat next to the gorgeous scenery helped make my meal so much better. What wonderful weather!\n\nThese tamales were awesome. For the past several years I've been turned off to tamales because people make the dry, crumbly, and bland kind. Primavera's on the other hand are moist, well formed, and tasty. There were two kinds of tamale. One was chicken with a green chile sauce and the other was mushroom vegetable with cheese. I like both yet the vegetable one was permeated with an addicting cheese flavor. I was impressed that each tamale's filling was very moist. The refried black beans were great too. It had a nice spicy kick to it.\n\n____\n\nI would definitely come back to try out some more dishes. I also hear that the drinks are awesome. I can't speak for anything else but the tamales.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "Even though it's overstated, the chilaquiles are to die for! OMG I had the green sauce ones last weekend. I mean I love the red and I'm saying \"How can it get any better?\" Then they come out with the green and I'm like \"Whoa this is how.\" Now It's got me thinking, \"What's coming next? Yellow?\" Wow think about that, yellow sauce!", "author": "Steve P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "probably a 3.5, waited in a little line for chilaquiles (pricey)\nGuajillo Chile Chilaquiles with house made Chorizo, organic,local scrambled eggs, refried beans, sour cream, avocado, queso cotija, onion and Cilantro -- tasted nice with salsa once mixed up, but didn't bring any special flavor, almost like just appealing to the masses.  also tried the beef barbacoa tacos which were good, classic verde and onion/cilantro", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "My friend told me there's only one thing she goes to the Ferry Building Farmer's Market for-- the chilaquiles at the Primavera Mexican food stand. Apparently you have to get there earlier than their closing time (2pm) if you want any of the good stuff. We got there around 11:15 am and the line was a decent size.\n\nGot my chilequiles ($9.50) and sat at a table right by the water, with the Bay Bridge just chillen in the background. What a beautiful view to go with a delicious breakfast on a sunny San Francisco day!\n\nMy food was wonderful. I wish the scrambled eggs were a little less soft (everyone has THEIR way of making eggs), but they were tasty nonetheless. The homemade tortilla chips smothered in beans and other Mexican deliciousness were to die for. Loved the avocado on top, and smothered the whole plate in their house made salsa.\n\nOne of the best breakfasts I've had in a while!", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "Chilaquiles: I am pretty sure I'll have a hankering for this in the future. The fried tortilla with sauce coating is really good. The beans have a good flavor and would be awesome to have with some mexican rice (none avail that I can see.) The complementary salsa went well with my eggs. Enjoyed it thoroughly.The avocado and those fried tortilla chips with the sauce coating will what I will be going back for, for sure...", "author": "Vicki T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-14", "description": "I saw this place featured on food network. I actually trekked over there on a gorgeous Saturday morning.\n\nI was a bit disappointed when I saw the price and how much people were getting back in return. However, I decided to wait in line and try for myself.\n\nI ordered:\n1 Crispy Potato-Masa Pork Sopes \"Colima\" (Ground pork with potato, salsa verde, cabbage and radish)\n--I like the bread that these were on, however, I could barely finish one of them. It tasted good, but I wonder if there is a less greasy form of it. It was just too heavy. The topping was pretty good. After ordering this, I was hoping that the potatoes would be mixed in or the taste/ smell covered up -- which I am happy to report it was. [Smell, more than taste of potatoes make me nauseous].\n 1 Jamaica drink\n-- Was delicious, but I still don't think it was worth $3.75\n\nThis place is overpriced for the food you get. I love Mexican food, but I am not going to pay an arm and a leg for something I can get at a local taqueria, or a friend's place. \n\nI might come back again when the menus change and try something else.", "author": "Anisha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-30", "description": "I had the tamale, it's really good so I change my review. \nI got the non-dairy mushroom spinach, there's barely any spinach, it's like all mushroom, and I feel like I taste butter... \nI'm a little skeptical about how serious they are about labeling what they put in their tamale, and I wrote them and did not hear back, so... maybe I will stay away :(", "author": "0 L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-22", "description": "A plate of Primavera's chiaquiles and a beautiful ocean view ... pretty much one of the best ways to spend Saturday morning in San Francisco. Despite the simple list of ingredients (tortilla chips, eggs, salsa, eggs, avocado, beans), it's not cheap, at nearly $10. But oh man, it's delicious. The tortilla chips are smothered in a spicy red sauce, yet manage to retain their crunch. The eggs are excellently scrambled, just cooked so that they're still soft. What you really want to do is eat everything in one bite, so scoop some beans and eggs onto a tortilla chip and enjoy. My one complaint is that I wish they gave a bit more eggs/bean and a little less chips for an improved ratio.", "author": "Ada T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-02", "description": "Primavera, \"Brexican\", has been a Saturday tradition of mine and my two running partners for 12+ months now.  Although the line can appear long, it moves fast, and for $10 you get a kick ass authentic Mexican breakfast.  \n\nLet's just say that on rainy days when Primavera doesn't show, the three of us go through withdrawals.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "I make it a point to go here on as many Saturdays as I can to get the tamales with mole sauce. They are amazing and I never can get sick of them. At times the sides are amazing (have pickled potatoes) and other times they are just merely good (no pickled potatoes). I think I tried something else a long, long time ago but never went back to it since I love the tamales so much. As with all good things, sometimes the wait can be brutal but it only makes the food taste so much better.", "author": "Miko L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "if you're reading this on a Saturday morning, go RIGHT NOW to the Ferry Building, go to the Primavera booth at the back of the farmer's market, and get an order of the Yucatecan Panuchos (if you're lucky enough to find them on the menu).\n\nIt's a small handmade corn tortilla, split and stuffed with beans and hard boiled egg slices, then deep-fried, topped with meltingly-tender braised pork,  served with pickled onion and avocado slices.  \n\nOMG.  never heard of this dish before -- it's a fantastic mix of flavors & textures ... go try it!!!", "author": "Jaina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "Waited on the long line last Saturday on a visit to SF. It moved quick and food was worth it. My friend and I split the Chorizo & German butterball Potato Enchiladas topped with 2 poached eggs, w. refried beans, pickled chiles and guac. For $10 this generous portion was filling and enough for the both of us to share. The Pinapple Cucumber & Jamaica Aguas Frescas was fresh and cool perfect for balancing the heat of the enchiladas. Snag a bench or sit on a rail to enjoy your meal while overlooking the bay bridge.", "author": "Lizz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "i decided to wait in line and check this place out on possibly one of the busiest saturdays ever.  wait time was 20-30minutes. i ordered the chicken mole tamales and then the beer battered fish tacos.\n\ni guess i should have ordered the tamale plate because all i got was one tamale. it was good.\n\nthe fish tacos were delicious though!  the best!  if i had known how good they were i wouldve ordered another plate instead of having 4 of us share the two on the plate.  i was supposed to share the one taco with my bf but i ate the whole thing before he came back.\n\noops", "author": "claudia y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "I have been suspecting for a while that I have started on the wrong foot with Mexican food.  I have shun it for years thinking that I simply don't like it.  But as I embraced empanadas in Chile and drooled over Peruvian ceviches at La Mar and enjoyed all my meals very much in Spain, my husband asked why I wouldn't like Mexican food if I like other Latin food.  Hmmm.  Maybe I just never had good Mexican food before.  \n\nNeedless to say, I am far from being a Mexican food expert.  So I am not even sure what we had the other day at Primavera.  All I know is that we ran into our neighbors at the market and they tell us how much they like Primavera, and next thing you know, we lined up and ordered a plate ourselves.  \n\nIt had three tortillas with beef brisket toppings and hot sauce.  And it was really good.  Spicy and greasy. And really delicious freshly made tortillas.  \n\nTo save our mouths from burning, we ordered a atole to share.  It was like a variation on hot chocolate.  Perfect for an unusually gloomy and cold Ferry Building day.  \n\nI wouldn't jump to say that I have been converted, but Primavera is a darn good place to start.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-09", "description": "The Ferry Building Farmer's Market is always such a big production. Move it, Lulu Lemon girl, I need my Blue Bottle. Mr. Tourist, scoot over, the grapefruit really can't be thaaat fascinating. Okay, okay, the crowds may be unavoidable since I seem to have a problem with getting there before 12. But seriously, can't a girl sleep in?\n\nPrimavera saved me from crankiness today, and reminded me why I go to the Ferry Buiding in the first place. The chilaquiles! I waited in a line of 20 to get to them, but I'm pretty sure I would wade through a vat of human excrement if that's what it took. These chilaquiles are pure home made deliciousness, with scrambled eggs, refried beans, saucy tortilla chips and a smathering of sour cream on top. \n\nThey have a second table where you can pick up pre-made food to take home as well, and they have everything from guacamole to salsa to their famous stone ground corn chips. A package of tamales is $5, and if you're tired of the same old, they have some pretty exotic choices, like butternut squash & green chile and pumpkin & white cheddar.\n\nIn the end, I took my chilaquiles over to the little bench overlooking the ocean, tuned out the craziness and downed them happily with a Jamaican lime agua fresca. Primavera, you rock.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "From my recent blog review...\n\n\"...Maybe it was eating our food under the bright morning sun with a crisp sea-breeze blowing across the water, and the impressive bay bridge in front of a cloudless sky dominating our view that made the chilaquiles taste so good; but likely it was because the thick, fresh-made and fried tortillas were incredibly tasty, and had a perfect crunch-to-sogginess ratio that is essential for good chilaquiles. The sauce was excellent too, and so was the rest of the plate: rice, beans, avocados and amazingly soft and fresh-tasting scrambled eggs. Really this is one of the better plates of chilaquiles I have ever had, and with their well-known hangover curing properties I could only look at my plate and wonder in vain, \"Where were you the day after Thanksgiving?\" The tamales on the other hand were a little dry and the masa fell apart too easily. The taste was good but my wife and I both fought over the rest of the chilaquiles while the leftover tamales got cold on the bench beside us as the boldly intrusive seagulls sat like vultures on a nearby railing, beady eyes fixed on the remains.\"", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-10", "description": "I knew I had a five star review on my hands when I was torn away from the amazingness of the Roli Roti porchetta sandwich at the Ferry Building Farmers' Market.  On most Saturday mornings I am able to resist the giant line of patrons waiting for Primavera's Mexican delights in order to wait in the giant line of people who feel it is perfectly acceptable to eat a herbbed pork sandwich at 9:00 am (my kind of people).  However on this particular Saturday morning I could smell the delicious aroma of battered fried fish from stands away and came to realize that Primavera was offering fish tacos!\n\n\"Screw you pork sandwich\" I thought to myself - I later apologized to Roli Roti in my head like a cheating husband to a devoted wife.  Anyway, I stood in line drooling over the promise of fish tacos in the morning, paid the nice lady and waited for my name to be called.  When I saw the plate of two heaping fish tacos I knew I was going to be happy.  Sure enough Primavera delivered and exceeded all of my fish taco expectations.  Perhaps the best part of these tacos is that the tortilla is so strong and pliable.  No wimpy thin tortillas that break in the center leaving the contents of your taco on the plate, these tortillas really stand up to the vast amounts of fish squeezed into the filling.  \n\nI can't say that I am leaving my porchetta sandwich for good, we have too much of a history to throw it all away.  But every now and then I will have to see my Primavera fish tacos on the sly.", "author": "Dana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-10", "description": "This is my go-to place on Saturday mornings during the farmer's market at the ferry building.  Yes, believe it or not, I walk right past the Roli-roti porchetta line and head straight here. You have to keep walking past the ferry building on the right and past all the other vendors like Roli-roti and the Hog Island Oyster booth, come near the water and snake left a little bit.  Look for the line.  The star item on their menu is the chilaquiles.  Yes, when I first came, I thought $9.50 was insane for a plate of eggs that you get on a paper plate and have to eat while standing up or on a log.  \n\nBut then I had my first bite.  Wow, maybe it's the farm fresh eggs, maybe it's the fresh avocados and sour cream, maybe it's the thick, coated chips to eat your eggs on or the decadent refried beans, but I personally think it's the crack they must put in these eggs that make them so good!  You put some egg, some refried beans, some avocado and some salsa on these super thick chips and shove it in your mouth.  After a bit or two your plate starts looking like a mess but you won't care, you'll scrape the plate clean.\n\nWhen the husband and I used to come, we used to get other plates, like the tamales but trust me, they don't compare.  Then we tried getting two plates of chilaquiles but that was alot so now we compromise on sharing a plate of the eggs and a an agua fresca and trying something else at the market.  Make sure you get there early.  I've been a few times by noon or 1pm or so and they are out of the chilaquiles.  Also, a slight negative is that they let you put on the salsa to your own liking but they've engineered it with a shallow wooden spoon and a tall container so that you can only get like a tsp of salsa per scoop.  I personally am not fazed so I'll stand there and take 10 scoops while people wait but just wanted to warn the faint of heart.  Trust me, the salsa is worth it.  Make sure you have enough!", "author": "Susan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-15", "description": "Tasty, but had the runs the WHOLE DAY after eating here at the Sunday farmer's market.... very suspicious as I had something vegetarian. It was probably the sour cream that was not refrigerated appropriately.", "author": "Bootylicious J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "Love love LOVE their tamales. Definitely on the pricey side as far as tamales go ($4.50 each or $9.25 for a plate of two with a side of delicious black beans) . . . but also definitely on the yummy side as far as tamales go.\n\nSadly, I only get to have Primavera on the Saturdays I actually have cash left after browsing the rest of the farmer's market. :)", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-13", "description": "O Primavera, why are you not at the Ferry Building on Tuesday and Thursday?  Why are you not at the Ferry Building every day?  Why are you not in the ground floor of my apartment building?  I would eat your food every day, multiple times a day.\n\nI had lunch at the Primavera stand around 11am today, and I am seriously considering returning at 2pm for second lunch, not because I'm hungry, but because I want to try the German butterball potato tacos.\n\nSure, the two tamale plate is $9.50, but it is a HEAP of food and it is SO delicious.  They've even started throwing in some pickled vegetables on the side (cauliflower, potato, carrot, jalapeno) without raising the price.  I usually have some room left after the taco or tostada plate, but not after the tamales.  Even so, I ordered an extra butternut squash tamale just for my 20-month old son, because he loves them too!\n\nThe folks running the stand are friendly and they keep the line moving.  Sure, there are lots of other stands at the market, but I know I'll always be happy here.", "author": "Connie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-23", "description": "I have no idea how this place has such high ratings- if anyone has ever been to a taco truck or a decent burrito place in the mission. The only thing I could think of is a number of tourists go here and find the food good versus a Chipotle back home.  When I saw the prices, I thought you would get 2-3 tacos, but it was actually for one taco! And it was nothing special compared to a taco truck in East Oakland or a place in the Mission. Avoid this place....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "Ok, so since the chilaquilles were SOLD OUT on Saturday (got there around 1:30pm), my only other option were the tamales...OMG, SO GOOD! The pork and the chicken---YUM!\n\nOh how I love you Primavera!", "author": "Misha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "Scrumptious and Delumptious!\n\nWhenever my gf and I have a chance to go to the farmer's market in SF, we go here for breakfast.\n\nPrimavera has awesome breakfast plates.  I don't know what it is, but it just tastes good.  \n\nThe drinks can be a hit or miss though.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "I am absolutely addicted to their Tortillas, their Salsa and Guac. I can usually find the salsa and tortillas in stores like Real Foods or the Marina Super..however, I can only get the Guac at the Famers Market. So worth the trek each Sat am!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-03", "description": "I LOVE THE CHILAQUILES!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nWhy? \nAll the ingredients are fresh and made with love. \nThe portions are large for a price of nine dollars.\nIt is definitely worth it\nImagine eggs, yummy black beans instilled with garlic, sprinkled with queso fresco, corn tortilla chips slathered with red poblano mole, cream, fresh avocado to top it off. I had it for breakfast and I'm still full!\nGood customer service, clean stand with a great view of the bridge on a sunny day at the Farmer's Market. I'd be happy to get another bit of that stuff next time. holla!", "author": "J A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "Pretty tasty food but I agree, it's fairly overpriced. It was fun to try it but I certainly wouldn't make a habit of it. The wait sucks too, as the Ferry Building Farmers Market is a mob scene of epic proportions. \n\nTried the chilaquiles plate ($9) which comes with organic scrambled eggs and whole black beans along with some decent chunks of avocado on top. The chicken mole tamale (solo, not the plate) was about $4 and not particularly impressive. The masa to meat ratio was decent but I didn't taste anything resembling mole sauce in that tamale. The shrimp and red snapper ceviche tostadas were the star of breaky, two to an order at $9 also. These had excellent flavor, the shrimp and snapper mixed with some salsa fresca and lime crema on top of crispy shells. Very delicious.\n\nTrekking from the Mission to hit this place up? Probably only gonna happen once!", "author": "margot b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-25", "description": "Delicious!\n\nThe chorizo/egg dish, fried tacos, chilaquiles, fresh corn tortillas, etc are all must tries... wasn't terribly crazy about the tamales (pumpkin was too sweet for me).\n\nYes, considering it's a food stand it's on the pricier side ($9 for most dishes) but I believe for the quality it's worth it... try getting there earlier because they start running out of food by 11:30/Noon.", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "Simply Delicious. I got lucky with a short line, and was lucky to have a great Saturday brunch. The Tamales rocked. What was already sold out looked to have rocked too. Not having a line rocked. The chipotle salsa rocks, and I am now also addicted to it. I picked it up once at a Mollie Stones, and it has taken business from my usual fresh salsa splurge suspect Casa Sanchez, also an awesome salsa in its own right. It would be great if I could find the Primavera salsa n the city at other markets too. \nStraight and simple, if your at the Ferry Building on Saturday and are craving authentic high quality California Mexican food, it's probably worth the line, and its good for the money.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-22", "description": "I write this review for one thing and one thing only... CHILAQUILES!!! I plan trips and flights around the farmers market so that I can get the chilaquiles from the Primavera stand for breakfast. The fried tortillas are like crack they're so good. Then throw on the egg, salsa, avocado, and red sauce... DONE, I am done and gone to heaven. The refried black beans as a side are great too topped with cotijo cheese.\n\nI have no idea about the other food they serve***, as far as I'm concerned, if you didn't order the chilaquiles then you ordered the wrong thing and your life will be that much less fulfilling until you do.\n\n***I've actually tried both of the tamales as a misguided individual did order them once and offer me some. They are a good choice and very filling, if you have some foolish aversion to taking good advice and ordering the chilaquiles.", "author": "Dave A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "I had the mole tamales here and they were AMAZING! Also, try the Chilaquiles Guanajuato which I consider the breakfast of champions. You can't beat a better Saturday morning then munching down some RoliRoti followed by amazing tamales!", "author": "Steve K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "Holy moly!  Every single plate coming out of this place looked and smelled heavenly.  Excellent chilaquillas!!!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-27", "description": "Rejoice--finally a fish taco worth celebrating! On a beautiful Saturday morning, make your way to the Primavera Mexican food stand at the Ferry Bldg. Farmers Market.\r\n\r\nThe menu at  the Primavera changes every week, with staples being a variety of their tasty tamales, but the best, absolute finger-lickin'-best I've had are their fish tacos. Unfortunately, it's the luck of the draw on their menu, but rest assured, everything is good there. I've also had their ceviche tostadas, several tamales, huevos rancheros, carnitas, and chilaquiles--all damn good. \r\n\r\nBeware: GO EARLY. If you stroll there anytime after 11:30 am, you will see their big white menu with a lot of black X's through the best offerings--even their agua fresca runs out early, and then you will feel compelled to compensate by going to Mijita's, at which point you will surely be disappointed. \r\n\r\nIf you can't make it to the Farmers Market, Sonoma-based Primavera's tamales are available at Whole Foods and a few other stores. I recommend butternut squash and cheese...", "author": "Dora A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-24", "description": "Saturday's only, but it's the best (brunch) thing going at Ferry Plaza. I get the chilaquiles and my kids eat the scrambled eggs while I eat everything else :-) Great agua fresca too. \n\nIf you like food stand mexican but want less of a crowd (or less $$), check out El Huarache Loco and/or the pupusa experts at the locals-only Alemany market.", "author": "y k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-16", "description": "These are the chilaquiles you've been looking for! Since that trip to Puerto Vallarta three years ago, I've been searching for chilaquiles that might come close to rivaling the fresh, lovingly prepared, neatly presented dish we found in Mexico. Primavera has it. Oh and those eggs - must've been laid the same day - fluffy, yellow, flavorful!\n\nPrimavera is worth the wait in line and the melon juice is totally unique. The only unpleasant thing is nudging everyone in the crowded Sat. morning Farmers Market environment and then trying to find a place to savor this great breakfast.", "author": "maureen f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-08", "description": "Yeah, it's a little overpriced but this is the Farmer's Market, right?...EVERYTHING is overpriced here because, let's face it, they should call it the 'Shi Shi' Farmer's Market because no farmer does it this posh unless it's in Switzerland.\n\nBut there is some great food to be had here if you want a reprieve from Hayes Street Grill or Rose Pistola.\n\nThe chorizo scrambled eggs with black beans and avocado was sooo simple but incredibly tasty...Apparently, they change up their menus pretty regularly so you can't predict what will be there from week to week but it's quality food.\n\nChiliquiles apparently is the 'popular' choice but definitely prefer the chorizo scramble...Still, ya can't go wrong with this one either.\n\nTheir drinks are what got me to try their food in the first place, also something that changes on a regular basis...The fresh rasberry lemonade is pretty remarkable and I can't wait until they have it again.\n\nIf you venture to Farmer's Market and don't have the cash to spend it at the oyster bar (I mean, what Farmer's Market doesn't have an oyster bar, right?) then you'll survive with an occasional treat at Primavera...You WON'T be disappointed.\n\nBTW, do they have a brick and mortar establishment anywhere?...I wish...Apparently, they are going to be opening, soon, a store in Sonoma but come on people, open up a restaurant for daily service in SF!", "author": "Barca F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Brunch never tasted so good.  Food stand mexican food at the farmers market isn't supposed to be this yummy.  Farm fresh scrambled eggs, tender pork, and fresh pressed tortillas.  Excellent!  The service was extraordinarily friendly as well.  They even let me split my order to have half pork taco and half chilaquiles verdes (green goodness).  Best of all, a great dining room with a view (bench overlooking the water).  Hungry at the market?  Don't miss Primavera!", "author": "Tripp W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-11", "description": "What's up with the name?\nDoes anyone know?  Seems odd for a Mexican spot.\n\nHands down the best Mexican breakfast with an amazing view...\nI always go for the tamale plate $9\nChoice of two served with pinto beans and side salad.\nSummer squash, mixed vegetables or chicken.  I always go for what's in seasonal and the veggie option.  The masa is perfection!!!\n\nNever fails BFF goes for Chilaquiles verdes -hardy portion and before I can ask for a bite... it's spoon scrapping gone.  \"BFF, Where the Love?\"  Guess when it comes to outstanding taste one becomes selfish.\n\nTo drink they offer a variety of lemonades,  good tasting but I'd save my money and you should go to Drinkwell Soda if you haven't yet :)  It's a fizzy tonic --that's good for you.\n\nbtw Tony Borudain ate here!!! hee hee", "author": "phong-lan h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "There isn't a thing on this menu that I wouldn't love to eat. I personally had the chilaquiles and my husband had the pork tamale. If you haven't tried chilaquiles, please consider tortilla chips and scrambled eggs, topped with a spicy sauce and everything good. It will make your morning/afternoon so much better. They also sell refreshing juice drinks to counter the heat of the food. Wonderful stand in the Farmer's Market!", "author": "Stacy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "My Mom was in town this weekend from freezing cold Minnesota and on Saturday I just had to take her to the Ferry Plaza Farmer's Market.  We arrived fashionably early as the weekend crowds can become uncomfortably unbearable as the hours pass.\n\nMom couldn't help but want to try the \"place with the long line\" aka Primavera.  We waited for 10 minutes at the stand to get our carnitas.  The guacamole was excellent and the pork was incredible.  There was not an ounce of fat to be seen for miles, yet the meat was amazingly tender.  \n\nThe staff gave the appearance that they were having a great time and the woman taking orders was very friendly and service-oriented.  Can't wait to stop by again soon.  For the price, the portions were generous and filling.  We shared a plate for \"breakfast\" (it was 9:00 am for heaven sake!) and didn't eat again (save for a few cheese cubes) until lunch!", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-28", "description": "Oh yeah, this place deserves 5-stars alright.  I had a Saturday morning to kill at the Ferry Building and heard about this place.  The chilaquilles really hit the spot, especially on a cold and gloomy morning.\n\nAnd get this- Anthony Bourdain stood in line and ordered the exact same thing I did 5 minutes after me!  I'm guessing he was there filming for an upcoming episode.  You might even get a chance to see me for a second or two since it looked like the cameraman was filming my gaping pie hole.  Just look for the guy sitting by the pier inhaling his chilaquilles and that would be me!", "author": "Kurt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "This is one of the best places that serves mexican food. Their chicken green chili  tamales is one of its kind.", "author": "Sulaiman B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-24", "description": "Their chilaquiles is the only reason I drag my ass out of bed on Saturday mornings.\r\n\r\n\r\nA tip: if they are making something with tortillas that day, you can ask for a couple of them to go with your chilaquiles.\r\n\r\nOK, one more tip: Ordering line on the left. People eagerly awaiting their food on the right.", "author": "Mister X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-27", "description": "Oh, chilaquile and tamales, how you make my Saturday mornings...\n\nWhen my boyfriend goes to the Roli Roti stand to get the pork sandwich (also VERY good but a little too meaty for me in the mornings), I go to Blue Bottle and Primavera.  I love the pumpkin with white cheddar tamales at Primavera, and if they don't have those (they have two different tamale types every week) then I go with the chilaquiles.  \n\nThe line can get a little long, but what do you expect--it's the Ferry Building farmer's market.  The last time I went the line was just intolerably long and I didn't have a half hour to spare, so I got the four pack of the pumpkin tamales to go.  Good buy and then I could enjoy them for the next week!  MMMMMMM.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "A morning that involves chilaquiles AND masa cakes???  Perfection.  I've had a couple of other items during other trips to SF, but that may just be my ideal breakfast.", "author": "Betty R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-27", "description": "I seem to be attracted to places with a long line! This is worth the wait and madness of the farmer's market! Amazing quality and taste. Chilaquiles are the bomb. Awesome tamales. We buy their chips regularly now at Whole Foods. Treat yourself to this jem. It is a unique experience in SF.", "author": "Malarie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-29", "description": "In between all my other meals at the ferry market, I stopped here for a tamale (sweet potato).  The texture and consistency were spot on with a nice flavor.  Definitely a nice place to have meal or a snack, judging from the long lines (breakfast ensembles seem most popular).", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-18", "description": "Seriously, I dont understand why everyone raves about this place.  My friend had Pork Tacos and I had Pork Tamales.  They were just o.k.  Both us agreed tacos from El Tonayense Taco Truck are waaay better.  \nBe careful with your money, the cashier guy swindled us.  \nPork Tacos plate $9.50 + Single Pork Tamale $4.50.  He charged us $17.75.  By the time we realized this, it was too late.", "author": "Gelato G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "This place is great! It's too bad they only exist once a week behind the ferry building. The Chilaquiles are amazing!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-07", "description": "Love it some of the best Mexican food I have tasted in the states.\n\nThe beans are yummy.\nThe Egg dishes are great and the the salsa is fresh and tasty.\n\nGreat view when you eat outside.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-26", "description": "By far the best mexican food in the city.  Might be the best breakfast in town, too.  The difference is clear: this food is made with L-O-V-E.  Every item is at its best, and the revolving menu offers many  items that are rarely seen outside Mexico (like Tlacoyos).  The black beans are to die for (and might kill you, methinks the secret is lard). Fish tacos are worth getting up early for.  Love the ChiChi Rodriguez and the other Aguas, in many unusual flavors like Cucumber-Lime.\n\nOf course, it's expensive, but the ingredients are only the best, and the view is worth a million bucks!", "author": "Teal H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "Chilaquiles every Saturday morning. That's my ritual. Even my kids love it. I'm sure everything else on the menu is good too, but in 4 years i haven't bothered to try. Gotta get my chilaquiles fix. Tip for those with kids, ask for a kids side of eggs and avocado (can also get tortillas, beans) and they'll charge you $1 or $2 for a giant boat of food. Hibiscus ice tea is delicious.", "author": "RK L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-24", "description": "Oh Saturday morning. No alarm, just waking up when I can't sleep anymore and have had my fill. Then walking down to the Ferry Building and weaving the crowds to my favorite temporary food establishment. These chilaquiles are one of my favorite meals in the city. The beans are perfect. The eggs might be the best i've ever had. The chips still crunchy. The gravy perfect. And lay down the salsa for that extra kick. So good.", "author": "Wes K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "I have yet to try this restaurant (I live near LA), but my coworker is related to the owner and brought in some of their tamales. So far they are the best tamales I have ever enjoyed!  The masa is delicious, moist, and full of flavor. The filling, organic butternut squash and cheese, was the perfect combination!  I can't wait to visit Primavera and also the sister restaurant El Molino Central.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-17", "description": "Note, the only star off is for price. It is overpriced.  9$ for Mexican is too much. \n\nHowever, for food quality and taste, it is outstanding! Fresh corn tortillas being pressed and grilled right before your eyes. The guacamole was lite and fluffy with just the right amount of lime. The chicken soft and tender. I wanted to try everything on the menu and panicked at the last second. Now, I can't wait to go back and try something else. \n\nReminds me of the quality of Tu y Yo back home in Boston. If you have been there, you know what I am talking about.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "My friend Annie is a regular on Saturday mornings at the Ferry Building and says that Primavera has lines every weekend. Now I know why - best chicken tamale I've ever eaten, hands down. And the portion sizes are huge. I ordered the combo plate with black beans and an aguas frescas. The line moves quickly but it is kind of chaotic. The staff is super nice. \n\nIf you find a better tamale, let me know.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "Dear Primavera Staff:\nPlease get rid of the ridiculous wooden salsa spoon.  We need a ladle.  \nThanks.", "author": "Caroline O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-17", "description": "I had the chicken mole tamale with a side of black beans. I will definitely return for the \"breakfast of champions\" egg dishes the other yelpers speak of. The tamale was delicious, but they could work on the presentation.\nI was also unhappy with the service. They took our order in a robotic way, then our food sat getting cold even though we were waiting close by.\nI think getting there early is the key!", "author": "Kyla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-14", "description": "Among the greatest advantages of living in San Francisco is to roll out of bed on a Saturday morning, throw on some clothes, and head to the Ferry Plaza Farmers Market to get chilaquiles from Cocina Primavera.  The fresh tortillas, the generous cuts of avocado, the buttery eggs, and the great refried beans are the perfect start to a weekend.  \n\nOf course, everything else on the menu is great.  I also recommend the tamales and the ceviche if you tire of the chilequiles, but how could you ever get tired of this goodness?  \n\nSeriously, the next Saturday you can, get to the Ferry Plaza, go all the way to the back and look for the yellow umbrella and the line of people.   Get in that line and pull out your $9.50 to have an amazing eating experience.  \n\nOf course, if you can't make it to the Ferry Plaza, you can pick up the tamales at Whole Foods in the Bay Area (don't know about elsewhere).  You can also pick up the packaged tortillas with cotija cheese, or the wonderful salsa at the stand as well.  \n\nBut seriously, you need the chilaquiles.", "author": "Greg K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-15", "description": "I am rather surprised by the abundance of 4 & 5 stars.  It may very well be the best hot food at the Ferry Terminal Building's farmers market  (excluding the Slanted Door) and there may be some emotional attachment (and hype) because it has the only long line outside of a truck stall -- its food is realistically only a 2.0 star.  Those who haven't ventured onto and around 24th Street in the Mission have no basis for comparison.", "author": "K G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-10", "description": "i don't even like mexican food but the chlaquile is delicious. this has become my weekend rountine\n\nthe grapefruit fresher is also really good.", "author": "Scarlet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-25", "description": "Primavera is pretty amazing. \n\nLike most Farmer's Market fare, it is a little pricey for what you get, but it's immediately evident the ingredients are of genuine quality. Mm. I recommend their aguas frescas and their roasted green chile and corn tamales. \n\nI'm a New Mexican transplant, and this is pretty much the closest you can get to a real Albuquerque green chile tamale in San France. Yummm.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "The chilaquiles at Primavera are amazing. The eggs are always cooked to perfection. The chips are amazing. The salsa brings it all together. It's a Saturday morning treat.", "author": "Sid M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "Chilaquiles!!! with several drops of chile just to make you feel more alive. Love them!! Craaave them!!!", "author": "Valerie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "This is one of my favorite things about sf. set at the back side of the ferry plaza farmer's market, primavera never fails to disappoint. \n\nfirst the chilaquiles are incredible. the chips are just spicy enough, the beans are pureed to perfection, eggs at the ideal hardness (not too hard), generous portions of avocado, crema and a little taste of cheese. i dream of these all week long.\n\nyou need to get there early before they run out of the daily specials.\n\neverything is organic-- including the masa for the handmade fresh tortillas-- which is hard to find. \n\ntamales are also worth buying for a week of quick, flawless dinners. \n\nalso, pick up the salsa to go. perfect fire roasted spicy flavors. it is cheaper at the market than at most stores. \n\nvery sweet owners and daughter are always very excited and proud to serve you their delicious creations. i can't wait until they open their restuarant... in sonoma. boo!", "author": "Mara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "delicious!  I love their ceviche & their tamales.  It's what I usually get for breakfast at the farmer's market - worth the wait in line!", "author": "Stacy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-08", "description": "Tortillas are handmade onsite and taste like corn!\n\nMy boyfriend, a Mexico City native, usually orders the chilaquiles plate - and he doesn't even like eggs all that much!\n\nPosole that is sometimes on the menu during winter is so deliciously comforting!\n\nTlacoyos and tinga are things gringos won't see at an ordinary Mexican restaurant, but definitely worthy trying. Primavera does both very well!\n\nTried a berry-lime-mint agua fresca once that was really refreshing!\n\nBoyfriend (who can eat A LOT) and I always leave stuffed - portions are great!", "author": "A. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "Primavera is a great place to grab breakfast while rolling around the Farmers Market on Saturday. The egg dish with tortillas, avo, black beans and chorizo was perfectly cooked. Everything at the market is pretty pricey so the $9 bones isn't outta line. Plenty of seating out by the pier to kick it and get your grub on.", "author": "Phil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "Walk around farmers market with a plate of Primavera chilaquiles and you will be the star of food envy.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-05", "description": "This is one of the few places that has helped me discover tamales. SO GOOD. The butternut squash was a real treat. I will never forget it.", "author": "Marian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-06", "description": "Organic, fresh, uber-filling, beautiful plates of Cal-Mexican breakie & lunch glory on the waterfront on a Saturday morning.  Chilaquiles with massive chunks of avocado, perfect black beans with queso fresco, and light fluffy happy chicken scrambled eggs, freshly made corn tortillas.  Still one of my favorite breakfasts at the market, and I'm there all the time...", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "Chilaquiles!!!!!!!!  The only reason I like coming to the Ferry Market when it's rainy is because the wait isn't as long for Primavera.  Their tamales are also good.  Will one day try the fish tacos, each time I think I want to I just end up heeding the siren song of the chilaquiles.", "author": "MJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "The chilequiles at the Primavera booth at Farmer's Market are the best I've ever had and probably my all-time favorite breakfast anywhere -- perfectly cooked, the right amount of sauce, chips, cheese, and eggs, and a definite spicy kick.  Rain or shine, it's always a fun, community scene -- dogs, kids, performers, the farmer's market, and that bay view right on the water.   The line moves pretty quickly and is part of the fun.  A perfect SF moment every time and a great way to start a Saturday.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-28", "description": "You beat me to it!  Been coming here since the plaza reopened--order whatever they have on the menu and be transported.  Their guacamole is outstanding, I've eaten tamales, fish tacos, huevos rancheros.  Also be sure to try whatever agua fresca they have--it's never too sweet, and always made from fresh fruit.  Each time I go to farmer's market I swear I'll try something else, but then I...just....can't....pass....it....up.  \n\nHow many days until Saturday????", "author": "Mel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "When I see a long line, I naturally assume that it's because something awesome is occurring.  In the case of Primavera, it is the chilaquilles and they are deserving of the wait.  And really, the wait wasn't all that bad.  These people are pros and it shows.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-01", "description": "The first time I went to the Ferry Building Farmers Market, I was amazed at all the food options that are available.   I also noticed this one food stand that had a loooong line.  My thought process \"If there's a line.. it's gotta be good.\"     I had just come back from Mexico and fell in love with those authentic carne asada tacos and lo and behold, Primavera was serving those that day.  $9 for two tacos might seem a lil pricey but once you dig into their tacos, it's worth it.  Their menu changes every week but I have not been disappointed anytime.   They are only open Saturdays.   Add my name to the list of people who want them to open a full-time restaurant.", "author": "Herb C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "Chilaquelas are insanely good. The chicken tamales are ok.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-21", "description": "If I had to rate my favorite place to eat in SF, it would be the Primavera stand at the Farmer's Market. Their tamales are the best I've ever had but I never get them because there's always something more enticing like shrimp & snapper ceviche, butterball potato tacos, masa cakes with chorizo and quesa fresca. If you ever visit Ferry Building Farmer's Market, this is a must.", "author": "Bill R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-13", "description": "Amazing huevos rancheros (Stone ground organic corn tortillas topped with frijoles colado, poached eggs and sikil p'ak (mayan pumpkin seed habanero pesto) and avocado! Sweet heavens, baby! Can't believe I had not try this heavenly dish before....I've been missing a lot...sigh. The Maurilia's pork tamale was very tasty too. There is usually a line but it's very well worth the wait. Get your food, sit at the table or bench and take in the bay view while enjoying the scrumptious goodies!", "author": "Yan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "Ordered their two tamale combo - chicken + mushroom with cheese, which came with a side of black beans.  Unlike past encounters with tamales from a truck, these were moist, piping hot, and didn't fall apart.  The beans too were hardly an afterthought.  One of the cheapest and fastest meals you're likely to have at the SF Farmer's market.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-05", "description": "Delectable goodness that's worth the long lines and high prices. 4.50 for a tamale? worth every penny! you never know what you will get, and you'd better go early or they'll be sold out. the best deal is to get two tamales and then you can get beans too. this is one of my favorite stops at the farmer's market, and you can eat it in the shadow of the bay bridge.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-25", "description": "Yum yum.\n\nI was shocked to find such fresh, light and delicious Mexican food at the Farner's Market.  The best part is that I don't live too far away.  I can just roll out of bed, throw on something comfy and mozie on down.  The first time I ate their food, I had something so yummy, but the name escapes me completely because no Mexican restaurant I have ever been to has served these.  They were basically corn and black bean cakes topped with chorizo and sliced raddish.  Shockingly deelish.  I went back today and was very bummed that the menu had completely changed.  I wondered if Primavera might disappoint.  I ordered the chilaquiles, which came topped with avocado and sour cream and a side of buttery scrambled eggs and the best black refried beans ever.  Their food sounds heavy but it is surprisingly light.  I have a sensitive tummy and tend to eat on the healthy side, but their food is perfect for me--hearty, not nauseating.\n\nAlthough I don't expect to be paying $9.50 for food at any kind of food stand, they give you plenty of food for $9.50.  No tax and tip...it's still cheaper and tastier than any brunch around.\n\nThis is going to be my weekly Saturday habit.  I work in the area and wish they were there for the Tuesday farmer's market!", "author": "Kandi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "I couldn't resist the long lines so I had to try it myself.  This was my first time eating chilaquiles, and they weren't bad (liked the eggs and chorizo) but I got tired of the tortilla triangles the meat was served on.  I actually preferred the tamales more - the pork was good, and the chicken mole was okay (I also got tired of the mole sauce).  Super fast from order to pickup, though, which I appreciated.", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-13", "description": "there are two places you *must* try while at the ferry plaza farmer's market.\n\nthe first is boulette's.  sure -- it's a pain to get in there and sample the grub, but it's worth the wait.\n\nthe second is primavera.\n\nthere's usually a long-ish line to get fed at their booth.  damn right there's a long line.  the food is fantastic.  it's easily the best food being served at any of the booths during market days.\n\nhad the chilaquiles plate today.  I'm sort of a light eater (preferring to sample a little of everything, but without a huge appetite).  I ate every damn bite of what I was served though.\n\nit's well-worth spending 10 minutes in line.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-04", "description": "Hands down, my favorite breakfast in the city.  Yes, you have to wait in line.  Yes, it's difficult to find a table, or part of a table, if it's sunny outside.  But, it's worth it.  I always struggle between the egg choice or the non-breakfast/lunch options, but the beauty of this stand is that you don't have to make a choice!  You can always do half orders (for half the price)!!!  The agua frescas are yummy and perfectly complement the food.  Everything is freshly made.  The chilaquiles, huevos rancheros, pork carnitas, fish tacos - EVERYTHING IS FANTASTIC!!!  I can't say enough wonderful things about this little food stand except - when will they open a full-time restaurant?!!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-28", "description": "Yes, the food is good, but the prices are so high, I mean, come ON people, $9 for a tamale plate?  That is ridiculous, not to mention, that their best menu offering, fish tacos, is rarely on the menu.  I used to love Primavera and go there every week, but I am kind of over the huge line of tourists and Ferry Building Farmer's Market prices.   Not to give away my secret, but save your money and go to the Alemany Farmer's market-it's not as pretty, but you'll get 4 tamales for the price of 2 of the Primavera ones.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-20", "description": "Primavera has recently become one of my favorite weekend treats to myself.  I love heading down to the Ferry Building early on Saturday...ideally before 10...for breakfast.  I've been twice and had the chilaquiles both times.  They are sooooo good!  The eggs are fluffy and buttery.  The verde sauce is great.  My absolutely favorite part of the meal is the chips once they get a little bit soggy.  I tried the Aqua Fresca - the 3 citrus -  and it was amazing.  I ordered a small and immediately regretted not getting the large.  It is a bit expensive but it is worth every penny.", "author": "Julie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-04", "description": "Tamales. Yes, get them. Really enjoyed the chicken mole...Punchy flavor, soft texture to the meet.........My husband who claims he doesnt' like tamales wouldn't really let me eat that many bites. Yummy beans (for better or worse). Just a warning, on a good day, there will be a line.", "author": "Jeannette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "People had been telling me about the famous tamales at the market on embarcadero, so I finally decided to try them out. I had the best tamales of my life at Primavera! Seriously, maybe butternut squash tamales sound weird, but they were delicious! I got the two tamales plate and chose one beef and one butternut squash and next time I go I will be getting two butternut squash tamales. The plate also comes with beans and pickled vegetables. The pickled vegetables might look weird, but try them, they are tasty.", "author": "Carly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "i have gone to the farmers market many many times, but this saturday i finally went to primavera...the line is usually too long i don't want to wait.  however, the line goes by fast and it is worth it!\n\ni got the breakfast plate and it was amazing! they have these chips that are still crispy but smothered in some sauce that makes them delicious! the eggs were hands down some of the best i have ever had!  they even include some yummy fresh avocado.  i would definitely go back and wait in line for this!  a little pricey, but oh so yummy!", "author": "Yummy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "In my opinion, there's absolutely no better way to start a Saturday  in San Francisco than with a trip to the Ferry Building Farmer's Market and enjoying a chilaquiles breakfast washed down with a aqua fresca and followed up with a cup of Blue Bottle coffee.  I swear, It just doesn't get better than that!", "author": "Jeremiah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-03", "description": "This is some of the area's best Mexican food, period. They use fresh, high quality ingredients prepared with skillful recipes that do far more justice to what Mexican cooking is all about than most any of the sit down places in the Mission. All ingredients are top notch, including the masa they use for tamales and the fresh made tortillas, the best you're going to eat anywhere. Forget all this talk about the prices being too high. If you want Safeway quality eggs, meat, veggies, cheese and old tortillas, then go get something cheaper and less tasty somewhere else. This is good quality, real food. The prices are more than reasonable.\n\nEat there and enjoy. And when the little voice in your head tells you that this isn't \"real\" Mexican food, tell it to shut up. The voice will be wrong.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "I fly in to San Francisco at least three times a year to get my chilaquiles fix.  Worth the wait, worth the price-fabulous.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-02", "description": "AWESOME beer-battered fish tacos (unless you hate mayonnaise ... there is definitely mayo involved). I've had some excellent tamales here, too.", "author": "Midori S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-12", "description": "This place is highly overrated as are their prices... We wanted to give this place a fair shake and therefore have tried it at least three different times and it's simply not that good tasting or worth the money....over 9 dollars for a tamale and small scoop, no I mean mini scoop of refried beans.. which turns out was probably a godsend since they were so terribly salty... Also, the guy working the front (some nerdy looking guy) was trying to impress some girl he kept referring to as \"farmer's market girl\" instead of paying attention to his paying customers. Anyway, we get the food and I was shocked.. the plate was handed over and I truly thought they made a mistake and left food off.. They presented us with what looked liked a half eaten tamale (mind you, tamales already aren't too big to begin with) a tablespoon of beans and 1/2 cup of some type of slaw.... To boot, the tamale was cold.... all this my friends for over 9 dollars.. to me , this is one of those places where you don't have true ethic food going on.. you have perhaps some person who thinks they know good food.. if this person worked with Mexican Cuisine, it sure doesn't show... The food was all sub-par and so not worth the money. Again, we have now tried this place a few times and it's just not up to snuff... Go to the Mission District and you can get better food and at lower prices.. Also note, the photos for this place do not match what you actually get........", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Primavera just created a lifelong devotee.  The hubster and I were spending a weekend in SF to celebrate our anniversary (4 years of wedded bliss and 9 years total togetherness!)  and I really wanted to check out the farmers market at the ferry building.  Food stand after stand had us oohhing and ahhhing after all the baked goods, veggies and fruits.  Then my hubster saw this stand with an incredibly long line and saw that people were coming away with these fantastic looking plates of mexican food.  We kept walking to see if there was anything else that we wanted to eat, but once the hubster saw that mexican plate, he was adamant that we have our own mexican plate.  So we stood in line, which wasn't so bad, maybe 10 minutes.  Menu is very limited, so we went with the tamale plate which consisted of 2 tamales, side salad and side of beans.  They had a pork tamale with green chile sauce and a tamale with summer squash and cheese.  We opted to have one of each tamale for our plate.  Got our plate within a few minutes of ordering and found the quickest bench we could find so we could get our grub on.  That first bite was just awesome (my mouth is watering right now as I type this).  I first tried the summer squash and cheese tamale and was so impressed with how tasty it was.  I must say that I'm a masa lover.  I could care less about the filling because I'm just looking to savor the flavor of the masa.  The masa on these tamales was awesome.  I don't know how else to describe it.  The pork tamale was great too, but I'm not a fan of spicy foods and that green chile sauce was just a little hot for me to eat, but the hubster dug it.  The salad was just plain cabbage with a litlte dressing on it and it was nice to have since it cut the richness of the tamales.  The beans were good too (I think they were black beans) with the cotija cheese.  All I can do now is dream of those fantastic tamales until I return to SF.", "author": "Ann C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-24", "description": "this is my new favorite breakfast spot.  i have now been the past two weekends in a row and have been blown away both times by the veggie breakfast options.  the chilaquiles here are amazing and i love the chance to eat delicious oaxacan food.  today i had the best agua fresca ever: cucumber pineapple.  doesn't that sound refreshing? it was.  i haven't had a problem at all with the long line as it goes by fast and the food is ready even faster.  there is always a nice spot to eat outside and enjoy the scrumptious food.  i wish they had an actual restaurant; if so, it should be near me in the mission.", "author": "Kristie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-31", "description": "Despite a long line, it moved quickly and we ordered the tostada, a tomale, and another highly recommended dish (can't remember the name, but it had the eggs). I really appreciated that they allowed us to have half-orders for the items on the menu because it allowed us to get a variety of items plus it was still more than enough food. I found the tomale to be excellent. The dough was steamed to perfection and it was perhaps the best tomale I've had in my entire life. All the ingredients in our meal was extremely fresh. The eggs were amazing, soft and melted in my mouth. I would definitely go again and try more items on the menu if I was in the ferry building on Saturday morning.", "author": "Will S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "omg, chilaquiles and tamales!  absolutely fantastic, and as good as the reviews say.  the line was pretty long, but it moves fast.  total wait time to order and get our food was probably about 20 minutes?  tasty, fresh...and to be honest mexican food is not my favorite as i normally find it too heavy for my palate.  that's not to say that primavera isn't heavy, but it sure is delicious.  it's probably better that they're only there once a week, from a health perspective, since i'd be there more than that if i could (or if i lived in the bay area any more, but just a minor detail).", "author": "Cynthia k."}
