{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Yes it's in a parking garage but hear me out this is a gem. Location can't be beat if you're doing some grocery shopping or running errands.\n\nIngredients fresh and portions left me stuffed. Try the salad it's pretty hearty.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "As happy as I was to discover a burrito joint so close to my office, I can't say I was expecting much either.  Which is kind of odd, since those two sentiments essentially contradict each other.  However, Publico doesn't exactly ooze authenticity.  I mean, I get that they're going for an \"emission-free, indoor taco truck\" concept (which is essentially just...a taqueria), but it's hard to get excited when I can't see the meats cooking on the flat top grill!\n\nIn all seriousness, besides the mildly odd layout (order from the \"window\" on the right, pick up from the one on the left), Publico actually gets the job done if you're craving Mexican food.  Despite offering only the three basic meats (just pollo asado, carne asada, and carnitas), at least the rest of the menu has a pretty good variety of offerings - Burritos, Burrito Bowls, Tacos, Tortas, Nachos, Salad, and Carne Asada Fries(!).\n\n-- THE CALIFORNIA BURRITO - Carne Asada, Jack Cheese, Fries, Pico de Gallo, and Guacamole in a Flour Tortilla...$9.95\n(https://www.yelp.com/biz_photos/publico-urban-taqueria-san-francisco-3?select=jGvtlqTOELpQ4U5iFOhAdQ)\nNot bad, but not all that fantastic either.  My burrito was filled with a decent amount of carne asada and fries, but I felt like their flavors were overpowered by the pico de gallo.  The fries also made the filling feel a little dry, though the guacamole helped with that (needed more!).\n\n-- FISH & CHIPS BURRITO - Beer Battered Tilapia, Fries, Avocado, Chipotle-Lime Crema, Jack Cheese, Lettuce, Salsa, and Guacamole...$9.95\n(https://www.yelp.com/biz_photos/publico-urban-taqueria-san-francisco-3?select=mBwvQ4QA9nHtbGu6X1bPeA)\nOn the surface, this isn't all that authentic, but it's DELICIOUS!  While it sounded weird at first, it's really not; imagine a California Fish Taco, but as a burrito.  The tilapia was flakey and fried perfectly, the fries were crispy(ish), and I loved how the cheese and guac blended together.  Plus, their chipotle-lime crema is awesome!\n\nWhile Publico's prices are a notch higher than taquerias in the Mission, they aren't particularly awful and the quality of their ingredients is supposed to be better (all natural, grass-fed beef, etc.).  Although the California Burrito isn't worth it, I have no qualms paying $10 for their Fish & Chips burrito.  What's more, Publico is pretty convenient - walkable from anywhere in Mission Bay and there's never much of a wait (except, perhaps, on Wednesdays, when the farmer's market is going on).\n\nAll in all, based on the two things I've had (and what my coworkers had to say about their food), Publico is pretty okay for what it is, and great for something relatively quick or on the way to a Giants game, but not anything to go out of your way for.  The rest of the menu has a couple of things that sound interesting, but to be honest, it's pretty much Fish & Chips burrito or bust for me.\n\nTHREE AND A HALF STARS rounded up.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-20", "description": "This is a unique place.  The outside is painted like a construction catering truck.  On warm sunny days this place is packed, so if you can avoid being there right at noon when everyone else has lunch, you will be able to get your food faster.  Basically everything is to go, they have one or two patio chairs outside, and that is it.... I had the crunchy taco with pork, and it was amazing.  Because this place is on UCSF property, there is only non sugar drinks... No sodas folks..... I gave it three stars, because there is no seating anywhere, and the lines get long with hospital staff. Oh, and there is no street parking either.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "Probably before moving to the west coast I'd have given this place 4 stars, but recently have had a number of amazingly composed tacos such that my reviewing scale needs to adjust. \n\nI usually can't resist a good fried fish taco, so I was excited to have one here. I would say there are a few issues with how it was put together - namely, by using a whole fish filet rather than frying chunks, there is a high ratio of unseasoned/comparatively flavorless fish meat to fried exterior. Also there was not much sauce. \n\nOther menu items that I've tried are the rice and beans, some other tacos, and their guacamole. All of these were decently good, with their rice and beans being the surprising highlight", "author": "Neal B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-11", "description": "Expensive and OK but nothing to write home about. If you like a lot of beans and rice in your burrito, this is should be a go to. Really good red and green sauces.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-26", "description": "Overpriced mediocre Mexican/American food.\nWas desperate for lunch, and stumbled upon this restaurant.. It was either this or Subway. \nI ordered the Mexicali Salad.. With grilled chicken.. Came out to 10$!!\nThe to go container was so small, I knew I'd devour my salad in 5 minutes. \nNot much fresh about this place... They freshly prepared it from pre-cooked meat, corn, and beans. Staff lacked friendliness or enthusiasm.. I mean you can serve me my 10$ salad with a smile at least. \nTap water for the free earns a star *\nExtra salad dressing for the free earns a star **", "author": "Maria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "3.5 stars\n\nLiven up your taco Tuesday with excellent baja fish tacos. For $4.75, you get a pretty big chunk of fried tilapia dipped in corona beer batter, served on red cabbage in a flour tortilla and topped with chile lime sauce. \n\nThe place looks like a taco truck was stuffed inside the building (it's a weird set-up!) There isn't any \"salsa\" bar available, but there's a tray by the window with some bottles filled with the green and red stuff that you pour onto your tacos. \n\nWith the scarcity of Mexican joints in the neighborhood, I'll take Publico over Subway any day.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-08", "description": "OVERPRICED! I went here during my lunch time, and ordered the carne asada super fries with chips and guacamole. The lady who was working there as a cashier had told me the guacamole for a small 2oz container would be $4!! $4 for guacamole? she had then mentioned about there bigger size which was a tub of guac for $6. After receiving my food, little did I know, the cashier lady had tricked me with the price of the Guacamole since there menu online said $2. This place is overprice!", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-06", "description": "Two burritos for $27, no guac, poor service.\n\nI took my customer to Publico and ordered two California Burritos. The bill was $27.08 and the burrito didn't have guacamole as advertised. When I informed the young, facially-pierced service man of the company's mistakes, he was indifferent and rude. \n\nLet's break this down. The price for a California Burrito is advertised on their website at $8.75 and includes guacamole. At the restaurant the same burrito is on the menu at $9.99 and includes guacamole. I paid $12.45. \n\nWhen I ordered the California Burrito the pierced service man said, \"the menu is wrong.\" And charged me to add Guacamole. I relented and he insisted. \n\nI paid $27.08 for two burritos with guac added despite different pricing on the restaurant menu and website menu (see receipt image). That's insane pricing by the way. Here's the kicker; there was NO GUACAMOLE IN THE BURRITO even though I paid extra for it. That's BS. \n\nInconsistent and non-transparent pricing, false advertising, poor service, overlooked meat. Not going back.", "author": "joseph s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-07", "description": "Looking for some lunch near the UCSF Mission Bay campus, I decided to give Publico a try.  The number of people ordering made me think it was a popular spot, and I was looking forward to seeing what all the fuss was about.\n\nUnfortunately, my taco was a disappointment.  I usually rate a taqueria based on their carnitas, and the Publico version was a greasy and fatty mess.  I didn't even the whole taco, as the unappetizing oil-slicked tortilla was a turnoff.  The meat was bland, and the side of tortilla chips and guacamole that I got also failed to impress.  The service was friendly, and there is outdoor seating if you want to get some fresh air.  However, I don't think I'll be back anytime soon.", "author": "Keith H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "If you want instant regret...go here.  I think people go here out of desperation.  You can have quality for a fair price but this place has been the same since day 1.  Bad bad quality meat smothered in overpriced beans and cheese.  Bland soggy chips..it's everything that bad mexican food can be.  Avoid.", "author": "Gigi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "I come here frequently more out of convenience because it's on campus. I usually get the torta with carne asada. It's not the most amazing torta ever, but it's pretty satisfactory when I need comfort food from work stress.\n\nI had a small issue the last time I was here. I was dining in because all the good spots outside with shade were already taken on a hot day. I waited about 15 minutes for my food and still nothing. I was busy answering emails on my phone to notice how much time went by. Once I noticed, I went to the cashier to ask him what was up with my order. They haven't even made it and probably wouldn't have if I didn't ask. I don't understand because it wasn't even busy? I wasn't super upset (even though I was starving) because the cashier seemed sincerely apologetic. I could tell it was the cook's fault for not even working on my order. I'm not sure what the miscommunication between the cook and cashier is about.", "author": "Karen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Love their food. I must have eaten the Burrito Morales + chicken at least 20 times. Never disappoints. Both the sauces are very flavorful. The 3 tacos are also a decent deal.", "author": "Ankit A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "If you're too hungry, and there are no options whatsoever try the California burrito.  It's so good.  \n\n\nTheir tacos and burritos are good but can be very greasy sometimes. \n\nThe California burrito is probably the best in the city.", "author": "Ahmad A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-24", "description": "The California burrito drew me here and the entirety of my experience was okay. A small spot catering to the people on the go or grabbing quick lunch. The workers usual seem oddly miserable and annoyed at life, but they get the job done.\n\nThe Cali burrito was underwhelming. The tortilla was simply there. It added nothing but being a method to put the other ingredients in my mouth. The carne asada was underwhelming. The fries were actually very good for the burrito. The rest of it was standard. As a whole, the burrito was edible but nothing special. The red salsa was quite hot and the verde quite flavorful, but the meat and tortilla need work. Maybe some sour cream would help too.\n\nA large amount of food decently priced. Simply okay.", "author": "Bryant C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "This place is really basic. If you like paying $3 for less than a tablespoon of beans and a small piece of avocado and maybe half a teaspoon of cheese and complaints when you ask for tomatoes, then this is your place. Seriously, I probably had more onions than beans. I go when I'm starving and desperate but you pay way to much for what you don't get.", "author": "Lexi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "I had a crispy pork taco and it was awesome. It was wrapped in a flour tortilla. There was so much over flow that I ended up having two tortillas for the price of one and it was awesome. I can't wait to go again.", "author": "Ron F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-27", "description": "Service was rather awful today. Only 1 register was open during the lunch rush.\n\nI ordered a carne asada super burrito with no beans and no sour cream. After a sufficient wait, I finally picked up my order and left. In that first bite, I found a mouthful of beans. So I ripped the burrito in half, and in that top half was nothing but beans and with a giant dollop of sour cream.\n\nHad I not already walked away from the store front, and if there was actually time left during my lunch hour, I would have returned with my dismembered burrito and requested a new one with the ingredients I originally ordered, or requested a refund.", "author": "Bonnie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Ordered a kid's size bean and cheese burrito for 5.17 total\nGood size portion! Note: They give you a lot of beans (a little too much lol)\n\nFood came out SO QUICK (came around 1pm)\nWould love to try something else next time.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "If it weren't for Publico I would have starved at Mission Bay, because I refuse to eat at Subway, Peasant Pie portions are small, and Terzetto is not good for anything besides really really strong coffee.\n\nThe service is pretty fast except during peak lunch hours so it's the perfect grab-and-go meal.  Although the prices are on the high end for Mexican food, Publico makes it a point that they use grass-fed beef, natural ingredients, etc.  Plus, it's impressive that they have a perfect score for health inspections (though this is expected as part of UCSF).  My main complaint is that all their meats are fairly salty (not expected for UCSF) but I guess that's what it so tasty.\n\nThey have food for every occasion in the typical life cycle of a grad student:\n\n-the vegelicious MEXICALI SALAD ($8.50) for something (relatively) healthy--my staple.  Bonus health freak points for black beans, radish, and avocado\n- the high-fat-diet CARNE ASADA SUPER FRIES ($8.75) for pre-gaming pre-carbing \n- the comfort food CARMEN'S NACHOS ($7) for satisfying cravings of nachos and the general salsa-meat-guac-melted cheese Mexican food flavors\n- the basic STREET TACO ($2.75)  for a simple snack, with the healthier/fancier/pricier option of a GRILLED FISH TACO ($4)\n- the massive SUPER BURRITO ($8.75) for a super massive appetite\n\nConclusion: Exactly what the residents of Mission Bay need--tasty taqueria food that you can pick up after a long day (and a long bumpy shuttle ride) that you can bring up to your room and stuff your face in preparation for a long night of work to get done.  The downside is that it is only only on Saturday lunchtime on the weekends, which means I'm always eating spring mix from Safeway on Sundays.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "I eat everything here all the time to the point where they know my face and it's a little embarrassing.\n\nThe MexiCali salad probably isn't as healthy as I think it is, but those black beans and that lettuce makes my intestines feel like there's enough fiber to get things going, so I'm not complaining.\n\nThe other thing I love? The California burrito. It's basically a steak dinner (beef, french fries) stuffed inside a tortilla with some tomato salsa. And the fries are crispy, but also a little mealy. Which means it's the full package. Thank you, California burrito, for everything you do.\n\nLooking for something a little tangier? Get the fish and chips burrito. It still comes with those delicious fries, and fish that's perfectly seasoned, and that spicy mayo that puts you into a food coma. Amazing.", "author": "Rosy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "This place has AMAZING burritos. Try getting there before 12 since the line gets long during lunch rush. \n\nMenu has a different selection of fish, chicken, steak, and veggie combinations. Oh and the fresca drinks are delicious. Try mixing them, you won't regret it.", "author": "Nate D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "The staff here was very friendly and were ready to make suggestions and answer all of my questions. It is also a convenient place to eat if you are coming from the UCSF Mission Bay gym. My food was ready for me quickly. I would come back here for a post-workout meal the next time I am in the area.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "It's a taco place on campus.  The food is cheap and pretty good.  I like their tortas and they're pretty cheap and delicious.  Great spot for a quick lunch.", "author": "Arman J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "I didn't really expect this place to be as disappointing as all the Yelp reviews suggest, but it was. I ordered a super burrito with carnitas. Wait, I'm getting ahead of myself. First I waited to order at the cash register for several minutes until one of the cooks told me the cashier was not there. The cook said he had left, and he'll come back, but he didn't know when. We waited several annoying minutes, but when the cashier did arrive, he was friendly and ordering and receiving our food was a smooth process. \n\nBUT THE FOOD: My burrito was rolled terribly; it was loose, had no butt, and fell apart immediately. It was the greasiest burrito I've ever had or seen in my life. Grease from my still-wrapped burrito dripped all over my kitchen floor. It was so greasy that I ended up not eating the tortilla (which became completely soaked in grease after a few bites) at all. It was disgusting. My wife ordered a carne asada burrito and did not have the grease problem, but did have the terribly-rolled  and fally-aparty problem. \n\nThe good? The flavor was actually pretty decent and they grilled the tortilla, which would have been a nice touch had it not been completely soaked in grease, rendering it inedible. \n\nEven though I just moved upstairs from Publico, I don't think I'll  eat there again.", "author": "m t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-31", "description": "Well, I've had better food from a real taco truck. People here are nice enough, friendly. But the food is meh. And they put hot sauce in their ketchup container, so my son smothered his burger in hot red sauce unintentionally. Sigh. They have a loud fan running all the time from the fridge unit by the counter - this place needs some TLC.", "author": "Nicki P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Great food, good concept. I went to Publico at the recommendation of my daughters nurse during a week long stay at UCSF Childrens Hospital. The food was delicious, the space is super cool, and the staff is nice! Definitely look forward to going back next time we are in the area. \n\nI recommend checking it out!", "author": "Brandi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Unbelievable \"Fish Burrito\" fresh crispy and divination....\nMy best dinner around UC site.\nThe cook will always smile and accommodate my needs.\nThe red and green sauce is incredible...", "author": "Ronit April V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-30", "description": "The lunchtime wait is usually untenable but worth it for the mexicali salad. It's got black beans, salad greens, sour cream, salsa, cheese, and whatever meat if you want.", "author": "Teresa D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "My wife stopped by for lunch and ordered us two burritos and specifically asked for no cheese and even vocalized it 3 times to them. The burrito ended up having cheese and was a bit overpriced. There are better places in the area but if this is your last resort then go for it.", "author": "Alonzo N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "A hipster version of a taqueria.  I came in and didn't even know how to order.  You have to pick from three different spots on the menu.  The total price seemed high for taqueria fare.  There was a large crowd hovering around the pick-up window.  The place is tiny to it's pretty much a take out only spot.  \nThe food was a let down in taste.  Salsas were bad.  Juices were just OK.  \nThis place should be a lot better than it is.  Maybe some cooks with Mexican food experience?\nI don't know.  Something's off on this place.\nParking is difficult in the area.", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-04", "description": "Excellent fish tacos! Average everything else.\n\nFor the price of $10, I would expect a authentic-tasting burrito, but that is not what you get at Publico. It tastes like something you get at an undergrad on-campus dining hall. You do get a huge portion of food though, so there's that.", "author": "Mina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Mexi salad was amazing with steak... storefront was trendy and cute.  ... I tried to rationalize the high prices in that \"It's San Francisco\"... but ultimately... you are on/near a college campus and it should be a little more reasonable in price ... I docked ya a star because I think it was a bit over priced considering its really a \"to go\" joint.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-19", "description": "The concept is new but the food isn't as good as the concept. I ordered a California burrito which has fries in it for which I was excited for. However, when I took my first bite, I was already disappointed. The fries werent crunchy and it became soggy potatoes.", "author": "Master R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-12", "description": "Decent, I had the carnitas, kinda bland, basic tacos, no frills.  The green salsa was pretty good.  They take FastPay, so that's cool...  prices were fair", "author": "Francis T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-02", "description": "This place is okay to hit up in a pinch. The food is really nothing special, expensive like most places around Mission Bay. Service is not great. I just walk by 9 out of 10 times that I'm in the area looking for lunch.  I think they feel they are the only option in the area for lunch otherwise they would step up their game, now that the Spark food truck business is up and running nearby they have no lines like before ... shouldn't that be a clue?", "author": "G B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-12", "description": "Terrible service. They messed up my order (no cheese, pretty basic) and then insisted I ordered it wrong. I had a train to catch and wanted a refund, but then they insisted I wait for them to remake it. Ridiculous.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "Not many Mexican joints on this side of town but Publico does a solid job (especially for a campus eatery). \n\nI usually get the California burrito, it's loaded with fries and guac plus your choice of protein. Comes out under $10 which is just reasonable for the size. \n\nI've had the torta but it's nothing to write home about. However their agua frescas are bueno! Cantaloupe and watermelon are the typical culprits. \n\nTry it avoid it during the lunch hours, there's always a line out the door. Swing by around 2 and bring your friends.", "author": "Tee T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "There's nothing else to eat in mission bay. Good eats here. Small little cozy location. Counter to place your order and pickup. There are a few stools inside for dining. Outside are tables and benches to soak up the sun. Prices are cheap considering the area.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "The burrito was small and overpriced. It tasted ok but wasn't that great. The bowling ball of a cashier was not very nice and bumped into me twice, almost positive it was on purpose. She kept going outside to feed her butt. The folk making the food were also talking s**t in Spanish.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "I'm a very picky person when it comes to my food, I'm sure like a lot of us. This place offers quality food from the meat, beans, salsa... everything is very high quality for the place to be a \"fast food\" restaurant. My favorite is the magnifico super burrito! STEAK!! I eat it almost everyday.. I prefer no lettuce or \"red sauce\" however I do drown my burrito with the green sauce. Very good! The green sauce is one like no other!! It has cilantro, lime, avocado mmmmm just delicious!!! I'm happy I gave them a second try, my first time visiting I ordered the steak magnifico, however, I had red sauce and lettuce. I told myself I'd never return. I'm glad I went back!!", "author": "Aresha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "Yes it's more expensive for a taco/burrito compared to anywhere else in the city-- but you're in Mission Bay, what did you expect?\nTacos run about $3-$5 here\nBurritos run about $8.50-$10\nExpect to add another $1.50ish for guacamole.\n\nLOVE their Baja Fish taco. ($4.50 for one taco with a huge piece of fish)", "author": "Jenna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "Stopped in while working at the Mission Bay campus, I took an early lunch around 11 and it was empty. The first thing I noticed was the awesome style. I like the food truck decor. Very cute and beautiful colours. \n\nI ordered two grilled fish tacos which came to something around $7 and some change. It was a little expensive in my opinion, but the food was pretty tasty.\n\nThe fish was very flaky and tasted pretty fresh, it was covered with cilantro which I adored, the onions were far and few between (I love onions) and the salsa was very mild, which really gave compliment to the fish.\n\nNow... while it TASTED good, the fish filets did not fit in the tortilla and that made for messy eating which I don't really care for.\n\nI'd totally eat here again and request extra lime and extra onion.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Their veggie burrito (build burrito with vegetariano filling) is soo good. Definitely will be going back.", "author": "Janna A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "Standard taqueria that fulfills its role at the UCSF Mission Bay campus. \n\nA few favorites:\n+Mexicali Salad: plenty of guacamole, beans, and corn to go around!\n+Super tacos: pretty sizeable and therefore economic\n+Fish & Chips burrito: yup, fried fish and fries in a burrito with all the typical super burrito fixings. Prepare for an especially low dip in energy after this. Regrets? None.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-13", "description": "Located on the UCSF Mission Bay campus. It has a little outdoor seating. Inside is very tiny. Decorated like a food truck....maybe it was a food truck? I thought the decor was cool, but it make the place look extra small especially when there is a line out the door for the employees.\n\nOrdered a burrito with pollo asada. It is good. The chicken was flavorful. The rest of the burrito was good. It wasn't the best burrito, but if you're nearby and looking for an ok burrito, this is a good stop. It's mediocre, not spectacular. Perhaps this is the only decent food in the little plaza area?\n\nI would like to try their other items. Like the tostadito. My friend ordered it and it looked good. The red salsa has a good kick. I'd like to have some of that on my eggs in the morning.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Went just before the lunch rush, ordered a simple chicken burrito and my order was up before I could even open an app on my phone! Food tastes fresh and had decent flavor. The salsa left something to be desired but for the price and friendliness of staff, I'll definitely be back!", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-06", "description": "TIP 1:Take the caltrain.Don't drive.Nearest station is 22nd street caltrain station.\nTIP 2: If you are a vegetarian,ask for food items which can be custom made to vegetarian.\nTIP 3: Grab and go quick lunch spot.Food turns soggy very quickly though.\n\nI went with my friend on a lunch get together.She works at a close-by company.We were looking at something to quickly grab and go.Publico has a fake - looking taco truck appeal.As a vegetarian,I found Publico to have good number of options as compared to the other nearby restaurants like terzetto,peasant pies etc.\n\nWhen I reached Publico,there was a queue of about 8-10 people ahead of me.Service was quick and our order came quickly too. The lady server at bill Deborah counter was sweet enough to answer all our questions,understand our requirement and ensure that we got vegetarian food items. She also told us about other dishes that we could order as custom vegetarian. On our bill she wrote a note saying 'no carne asad' which means no grilled meat.\n\nI ordered vegetarian california burrito,carmen nachos and magnifico burrito for us.The Carmen Nachos had lot of vegetables and cheese but was soggy.The magnifico burrito was a big size burrito which had good vegetable filling but was very bland.The california burger had very limited filling and isn't worth recommending.\n\nThis place is stone's throw away from 22nd street caltrain station.Parking around this place is a nightmare.You won't even find paid parking easily,according to my friend who works closeby.", "author": "Priyanka L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-17", "description": "Ordered a burrito. Paid extra for chicken (pollo asado). Halfway through the burrito, I realize there's no chicken. I didn't want to bring back my half eaten, directed burrito back to the store, but definitely won't be going back. This is the third time I've been left with a disappointing experience. The last time, my burrito was missing lettuce, even though that was part of the description . Too bad because there aren't that many convenient places to eat near the UCSF Mission Bay Campus, but even with the lack of options, I won't be going back.", "author": "Jem C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-19", "description": "Allow me to preface this by saying that I was a regular, not for the quality of the food but because I work across the street and come by during my breaks for convenience. The food is, at best, average. \n\nFinding hair in my burrito automatically earns this place a one-star rating, but witnessing the derogation of a kind employee by one of the managers disgusted my colleagues and I even more so. It was such a defamatory interaction that I could not recommend this restaurant as I do not tolerate employee mistreatment or abusive work environments. We arrived right when the restaurant closed and heard the manager scolding an employee, a friendly one whom has demonstrated consistent professionalism. It saddens me to see such crass behavior towards a subordinate. Seeing how things are handled at this place (I once overheard another employee say that she would \"spit\" in peoples' food if they were rude to her!), I would not be surprised if they do not have a grievance system.  \n\nI will be reporting this to upper management not only for their unhygienic practices, but also for misconduct. \n\nOverall, a sketchy place. I would give this place a zero if I could.", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "The good: Amazing tortas, one of the best I've had, and at $5.95, that's practically the best deal in the area. I haven't really tried anything else since I had such a good experience with the chicken torta, but I've heard good things about the burritos too. They take card and cash, and don't have a minimum of like $20 like many of the restaurants in the area. Quick. Easy. Delicious. \n\nNow, for the bad: there aren't many, but parking here is a PITA. Tiny garage and lots of traffic, luckily I work close by so it's never been an issue for me. But I have almost gotten hit by a car once, maybe twice. Also on more than one occasion I've waited 15+ minutes for my food to go, but most of the time I'm in then out in less than 10 minutes. \n\nDefinitely worth trying, don't mark it off based on its strange decor/location.", "author": "Andy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-01", "description": "My fish taco was wack! There is no taste to my fish at tall. Is a small one n it cost 4.50! N yet it still smell hella fishy!  it will be my first n last try at this place! \n\nThe display of the place is cute n clean when u first look but then when u walk inside it look dirty! The sauce bottles is not clean since the sauces is all over the bottle lids!", "author": "Lala B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Just ate a \"fish and chip\" burrito only to find out there was no chips in was gonna ask for a fix but the place got crowded fast. The food was good and service was nice but be sure to have the cashier repeat your order back", "author": "Finnzz L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "Good, but not great, tacos and burritos in a faux food truck setting. I tried the fish taco and the El Magnifico Burrito (with steak). The fish was a little dry, but the burrito was quite good. I felt that the burrito was a bit overpriced at $8.75 - I'd pay $6 or $7 for a comparable burrito elsewhere in the city. \n\nIn a nutshell, I'd eat here again if I were stuck at Mission Bay for lunch, but I wouldn't seek it out.", "author": "Nicholas R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "Publico is one of those eateries you are forced to keep coming back to due to a lack of options. Mission Bay is in dire need of some new eateries (food truck or otherwise). It's set up as a \"low-emission food truck\", meaning it's small with food truck inspired décor, but its an actual establishment that won't leave you stranded every other Friday wondering where to go for lunch. I've had the burrito morales, a quesadilla with add-ons of guac and sour cream, and the carne asada fries. \nBurrito morales ($9ish): Mexican rice, black beans, lettuce, sour cream, salsa fresca and avocado all stuffed into a tortilla. It's a pretty good size, but lacking in flavor. I also prefer more moist veggie burritos (i.e. MORE GUAC and SOUR CREAM).\nQuesadilla ($7ish with the add-ons): not bad at all, probably because it was stuffed with their guacamole which I am a fan of.\nCarne asada fries ($9ish): the only menu item I've had with meat in it, and I was sadly disappointed. I expect carne asada to be crispy, retaining some juiciness, and packed with flavor. This contained Chipotle-esque chunky pieces of steak that lacked that carne asada broiled flavor. The fries were too soft to hold that amount of sour cream, salsa fresca, and guac, and tasted like they had been frozen. On the upside, the guacamole tastes fresh and they are generous with it.", "author": "Ruth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Unique taste and super awsome employees. Small place but comfy. I 2ont even talk about the price since is to fall in love with. Buen trabajo muchachos!", "author": "Francisco Javier B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-13", "description": "This was my second but last attempt at getting a decent burrito at this establishment. If I hadn't been in a rush to grab something to eat for dinner before heading home, I would have saved myself a lot of headache.  Not only did the guy behind the counter, Vincent G, seem annoyed to have a customer, the burrito received was not the one I ordered. Not even remotely. Well, actually I take that back. It had a tortilla. Being the only customer there at the time of my visit, I am not exactly sure how this mix up occurred. I suspect that Mr. G's lack of customer service may have been at play.  My only mistake, other than going there, was not eating the burrito on the premise so I was unable to correct the error. Lesson learned.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "I enjoy Publico, perhaps most for its proximity to work rather than out of straight-up taqueria awesomeness. But for a *convenient* spot, it's an enjoyable one.\n\nMy favorite thing thus far is the tacos. They're piled with meat, and therefore a pretty good value. I would say -- get two if you're ordering sides, three if it's your whole meal. Those will likely be my go-to's going forward. \n\nBurrito is OK. Pancho Villa's kind of my benchmark, and these are enjoyable but not quite there. But that's not to say they're BAD; just not my favorite. However... one time, I mistakenly got the one with fries, which was a little much for me. Be warned!\n\nOn the last visit, I ordered the side of beans and OH MY GOODNESS, you get a large serving. They're pretty good. They're on the plain side, so don't worry about overly spicy beans.\n\nThe chips are OK. I prefer chips on the thinner and lighter side, so maybe it's a preference thing, but they aren't my favorite. If you like thicker chips, you'd probably enjoy them.\n\nThe salsas (available in ketchup and mustard squeeze bottles) are pretty good. The green salsa is mild; the red has a kick (just enough of one for me).\n\nPRO TIP: before you go, make sure you have your WHOLE order. Often, they've called me up to get my meal... and it won't have (say) the beans ready. \n\nSo there you have it: enjoyable, convenient, decent quality, in an area that has basically not much else going on", "author": "Tami S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "It's a restaurant built to look like a food truck.  How silly.  It's also one of only a few dining options on the UCSF Mission Bay campus.   I usually never come to Mission Bay, but had to drop off samples twice here recently.  The first time I came I noticed a large line/crowd outside of Publico, so it appears to be a lunchtime fav (again amongst the limited choices).  \n\nThe second time, we stopped in...around 3pm and two of us split an order of carne asada fries.  Do yourself a favor and get an order of carne asada fries.  It's like really good nachos, but with fries instead of tortilla chips.  Hearty chunks of steak, well placed melted cheese offering good coverage on all the fries, and generous scoops of pico de gallo, guac, and sour cream make for a winning combination.  This is a nice portion to share too.  Do it.", "author": "Anne Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "I always go for the chicken tacos - simple grilled chicken with cilantro, onions and red slightly spicy sauce on soft corn tortillas. $3 each. Doesn't feel greasy, chicken is yummy. A solid under $10 meal.", "author": "Keli W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-24", "description": "I was really craving a fish taco, so since I was in the area, i decided to try this place out.\n\nI ordered two street tacos (carnitas and carne asade), and  two baja fish tacos. \n\nI had a hard time understanding my number being called for some reason.\n\nSo here are my comments about the tacos. I really like the carnitas street taco, the carnitas was really juicy and tender. I like the combination of vegetables and meat.\n\nFor the fish tacos, the fish is bigger than the tortilla but it's good. There's definitely more fish than the sauce and vegetables. I like the vegetables in it, it gives it a crunch. The sauce is good too. The fish is crispy, I like the lemon on it.\n\nI used the hot sauce on top of my tacos, yum. \n\nOverall, I think I would go back again. It is more overly priced than I would like. It was about 3 something for a fish taco, I think that's normal price but if it was cheaper, I would be happier.\n\nNotes: $10 minimum for credit cards. FastPay is accepted here, BearHugs don't work here.", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "Although they claim to close at 8 pm, the doors were locked at 7:35. They ultimately let me in and made me a burrito that tasted old with super chewy dry chicken. While they were making my burrito, multiple other people tried to come in but the door had been relocked behind me (still well before 8 pm). Bad food and unreliable hours.", "author": "B G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Solid carne asada super burrito. Good, not great, and a bit overpriced ($10.50). Better than expected given generally poor reviews", "author": "Rahim H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "Not bad flavor.  Carne Asada skirt steak was tasty. Filling enough for the burrito But @ 9 bucks.  Not many choices for lunch here on campus so it gets busy.", "author": "Pedro N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "The background: Mexican food \"truck\" - they have a fake truck that is painted in the front of the store.  Located at the UCSF Mission Bay South building housing complex next to Subway. \n\nThe details:\n\nMexican Salad = best decision ever. It's gotten smaller over time though, so it's less of a value than it was before. If you ask for special instructions such as salad dressing on the side of something, chances are they are going to mess up. It comes with a layer of beans on the bottom, lettuce tossed on a cilantro salad dressing, topped with corn, radishes, meat of your choice, salsa, sour cream, avocado slices and chips. Pro Tip: Definitely recommend getting the chips on the side, they'll give you a baggy and that means MORE salad! I love getting the green chille verde chicken on this salad, it's like free flavoring. \n\nAguas referescas: Watermelon, horchata and canteloupe are your choices. Watermelon \n\nSoup = if you buy it, you are in store for the saltiest and oiliest experience ever. THe best thing to do is to go home and water it down with some hot water and it'll taste a lot better. \n\nStreet Tacos: They're nothing too extraordinarily special, but you do get the equivalent of two tacos. It's a basic two tortilla deal with a heap of meat topped with cilantro, onions and lime. Pro Tip: split the meat in half and make your own tacos with the two tortillas they give you each taco. If you eat it as is, you risk just breaking everything apart and making yourself into a hot mess. \n\nCali Burrito: Carne asada, fries, guac, salsa rolled into a burrito. It's a tasty guilty pleasure. Definitely something you splurge on because it's pretty hefty. ($8). Good enough for two meals! \n\nFish-cali burrito ($~8)  - skip it. ( Fried fish pieces, french fries, guac, some cabbage and sauce)The fried fish in it is pretty dry, and tehre isn't much flavor overall. The sauce they put in is just like mayonaise. You're going to have to drown the thing in ketchup. It's pretty pricey for what you get.  \n\nHours: they have some weekend hours now, but are still limited. \n\nStaff: they've been notorious for messing up for orders... shame on me for asking for no beans or salad dressing on the side. But hey it happens. They're nothing to gush about, but nothing to get really fired up about. \n\nThe verdict: I'm addicted to the mexican salad, but the rest of the menu is nothing special in terms of Mexican Food. It's a step up from taco bell definitely, but not your mission style taquerias.  If you're in the neighborhood or work in the area, it's worth a lunch trip, but not a place I'd go out of my way for.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "i honestly don't know why this has only a 3 star rating. i find their food to be pretty good at a decent price. maybe people don't like it because it's clearly a takeout food space with a floor to ceiling mural of a food truck on one of it's walls. come on, they take your order from where the front of the \"truck\" is located! i personally found that pretty cool, not to mention that the mural was done pretty well in itself.\n\ntwo words. CHARLIE'S TACOS. ($4.50 each) i ordered two carnitas tacos and that was way more than enough to satisfy my very expandable tummy. the tacos were huuuge (think the size of 3 street tacos each!) and overflowing with guac, meat, and tomatoes. they also did this fancy thing with the tacos where each taco was wrapped with two tortillas, but stuck together with a layer of refried beans.\n\ni admit it got a little messy after a while, but i'm all about giving up on handheld food that becomes overflowy/drippy/messy and eating with utensils. and it was still just as delicious!\n\nthe service is helpful, very quick, and friendly. i would recommend this place for a yummy, cheap and very satisfying meal!", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-02", "description": "There aren't many places to eat around UCSF Mission Bay for lunch so I decided to try Publico. I ordered a super burrito, which was not bad. Think Chipotle pricing but without the customizability. Portions were big enough, and service was just okay. It was really busy today so it seemed that the workers were a little overwhelmed. People weren't particularly friendly but the experience was overall alright.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-02", "description": "My friend works in the area and we were looking for a quick bite to eat before heading back to her office. We decided to try Publico Urban Taqueria when we saw that they had a salad on their menu. They have a singular salad that you can add pollo asado or steak to. I went for the pollo asado which totaled to around $9. I would like to say more for it but the salad just wasn't very memorable. All the black beans and black bean juice were at the bottom. They were heavy on the cheese which helped the flavor. They put plenty of avocado. The flavor of the chicken was just ok. The service was fast, the salad was mediocre. If I were to come here again it would be because I was in the area and just needed a quick bite - which is why I came the first time. It's not bad, it's just not great. It's definitely more of a take out spot. They have a taco truck layout inside but it's immobile. Other reviews rave about their burritos. If I return that'll have to be what I opt for.", "author": "Julie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "I had the chicken chile verde torta. The chicken itself was not bad, but was pretty bland. As they say on the menu, it seems to be grilled chicken that then gets a sauce added, rather than chicken stewed in the sauce. Also the chicken is in these tiny little pieces, like it has something to hide. The rest of the torta was quite good, although if anything, it seemed like it had too much going on. As much as I love beans, I actually thought the refried black ones didn't add much. But I liked all the lettuce, avocado, and especially jalapenos. What was most surprising was that the bread was actually really good - quite rich, but tasty.\n\nI TOTALLY agree with Caroline L. that it seems difficult to necessarily get the burrito you want (ie no rice, but with guacamole, etc). And I agree that the cheese quesadilla is kind of inedible - it's rare that I would say this, but there's just too much cheese.\n\nThis is a little tricky, because for a taqueria, it's ok but not phenomenal, but for options on the UCSF Mission Bay campus, it's pretty good. So definitely don't go out of your way to come here, but if you're already here, go for it.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-16", "description": "I was soooo excited when I saw that a taqueria was coming to Mission Bay.  When this place opened, though, I was over it in a second.\n\nI still eat there, because it's a choice between that, Subway, Peasant Pies, and Terzetto's sandwiches...and sometimes I just don't want a sandwich.  And I haven't found a Peasant Pie yet that I like...soo...yeah.\n\nI just devoured a carne asada quesadilla for lunch, which was pretty decent actually, and $5.  I might stick with this and their guac, which I do think is pretty awesome.  Their quesadillas without meat are nearly the same size as those with meat...meaning there is a TON of cheese in them!  I love cheese, but I don't need a whole pound of it in my quesadilla.  Also, they make the quesadillas look more like a squished down burrito rather than a folded-over tortilla...after you get it you'll know what I mean.  Which is fine, but just be warned.  And they do grill it well, I thought...I like the crispy outside.\n\nI've had other things on the menu, and in general, they just don't wow me.  I've never tried the al pastor torta, but thanks to Stacey H.'s recommendation below, I may next time.  The meat burrito only has meat, beans, rice, and salsa.  I really wanted a burrito San Diego-style...meat, guac, salsa.  In order to get that, it would cost me $1 extra for the guac, making it like $6.99 I think, AND i would have had to be \"that girl\" who stands there ordering something \"without X, without Y, etc.\"  Which I hate doing.\n\nOverall, there's nothing really bad about the food, their service is friendly, but I would go elsewhere if I could.  If you're craving Mexican in the Mission Bay area....it's your only option.  Unless you want to take the Red Shuttle to the Mission and get an authentic taqueria experience.  Mmmmm...Taqueria Cancun!", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "A pretty solid 3 star experience... service was filled with ennui... not an ounce of pep.  That being said, the veggie burrito I had was very tasty and well constructed; all of the ingredients were distributed evenly - which can be a pet peeve if you only get onions on one side.  The chips, guac and salsa were fairly benign, just par for the course.  They make good food, but aren't really trying to wow you.\n\nSun was out, so we took advantage of the outdoor seating.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "You know what? I'm surprised because this place makes a decent burrito for (relatively) cheap. The burrito itself is decent but the sheer size of it is the most redeeming quality. 9 dollars for the El Magnifico was a great deal. It was as large as my forearm and chocked full of meat. The components are good and they work together well. Made me full on the go!", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-23", "description": "This is a public service announcement. I have given this place 4 chances, and some might call me crazy for going there that many times as the food has given me GI upset thrice (including right now). I do not have a squeamish stomach, in fact some might consider me a food landfill for anything and everything edible, so I generally never have any problems; this has unfortunately been painfully consistent. Perhaps it's purely the burritos, although I had a different one each time. Eat at your own risk, or if you've been constipated for 3 days and can't make it to a pharmacy for some laxatives.", "author": "Gene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "Love the California Burrito and the Fish and Chip Burrito ! its a whole day for under \n\n$10 !And thw fish tacos are WOW!", "author": "Sonam I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "EXTREMELY disappointed in this place.\n\nThe first time I went here, I ordered the Fish & Chips burrito. When I started eating the burrito i realized it was missing a large portion of the ingredients listed on the menu. When I asked the cashier, he stated they were newly updating their menu and that the paper copy hadn't been adjusted to reflect the changes. Initially I thought this was outrageous and decided I wasn't going to eat here again.\n\nToday, a month later, I was back in the area for work and decided I'd peak in and see if they had updated their menu, they had. I asked the cashier if the menu was up to date and he said it was. I again ordered the Fish & Chips burrito, this time asking them to go light on the sauce as it was overwhelming the first time. The burrito was missing both lettuce and salsa. When I asked the cashier, he said they were out of lettuce, and pointed to the hot sauce bottles saying \"you add your own salsa\". Now to me, salsa at a restaurant means chopped salsa like pico de galleo. \n\nThe burrito was just a mushy soggy mess, no real texture due to lack of roughage, EXTREMELY disappointed.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-30", "description": "Originally, I was thinking about getting the $5 tuna footlong from Subway since it was tuna month (March) then I happened to pass by \"Publico II\" which looked interesting with its bright colored walls and \"zero-omission\" food truck theme...I walk in wondering if they have something like Nick's Crispy fish taco...mmm. \n\nIt's Friday at 1044am and I am the only customer. I look on the menu for a fish taco...then my eyes land on \"Charlie's Crispy Taco\" for $3.99 and I'm like...hmmm....I am usually intrigued when they name a dish after someone or the restaurant...I have this idea that it should be good. Anyways, after just quickly glancing at the name, I told the person behind the cash register (while holding out my $5 bill to him) that I wanted the \"Charlie's Crispy Taco\"...he then asks, \"what filling\"...and I'm like, \"uh...everything!\"\n\nThen he replies back, \"ok, you want chicken?\", and I'm like, \"uh...\" realizing he wanted me to tell him what type of meat filling I wanted. Ok, then I ask, \"do you have fish?\" (while still holding out my $5 bill for him) And he's like, \"yeah, but it'll be $2 extra\" and I'm like \"ah...Ok,\" and he's like \"Ok, what?\" in a kind of irritated tone of voice.\n\nI reply back, \"Ok, I'll take the fish even if it's $2 extra\" thinking...hey, i wanted to see if their fish and \"crispy taco\" would be just as good as Nick's even if it costs more than my $5 tuna footlong. Then he replies back, \"that's not going to be enough\" and I reply back, \"well if you want to take my money first (that I had been holding out since I first approached you) then I can get my wallet and get you more money\" I admit I was a little grumpy/annoyed...had trouble sleeping the night before, rushed to catch Caltrain...basically, I was hungry and just wanted my food, NOW!\n\nThank god I beat the lunchtime rush, can't imagine having to wait for my fast food order for more than 3min.\n\nAnyways, my order: 1 Charlie's Taco $3.99 with fish substitute $1.99, tax $0.51, Total: $6.49. Paid $7 in cash, $0.51 change which I just dropped in the tip jar. Yes, the most I wanted to give, considering there was no attempt at customer service.  \n\nReceived my order in about a minute. I sat by the window counter. The place is mainly like a food truck/take-out with limited seating. Five stools at the counter and some random patio furniture typical for the Mission Bay campus outdoor eating area. Doors open, a little chilly, though there was a sign saying sthg about \"if you want heat, ask us\". Anyways, I wasn't planning on hanging out for too long...maybe just long enough to write this review. \n\n- Portion size: decent, but not great, considering it was almost $7...just a touch smaller than Nick's. \n- Main ingredient: Tilapia, grilled or sthg, not battered or fried with ok flavoring, had that slight grilled flavor. Decent sized fillet, filled the taco in one piece. \n- Temp: slightly more than warm...but not hot enough for me. I like Nick's fried fish that you get the feeling that it just came out of the frier piping hot! \n- Other: decent amount of guac (nice and green), tomato, black beans with shredded lettuce (green with slight light brown edges); flour taco outside nice and soft/lightly toasted with lathering of the black beans which held the crispy crunchy corn taco...a little soggy inside because of all the wet fillers (fish, beans, guac).\n\n- Total Taste: typical of a fish taco, nothing exciting, it was good because I like quac in general and it was decent...but not like Nick's, unfortunately  \n\n- Will I come back? Maybe, might want to try the Charlie's Taco with chicken and/or sthg else...but only if I feel like Mexican...which doesn't happen that much, maybe once every 3 months...unless it were Nick's Fish Taco.\n\nResearch shows that there is a Publico at 555 9th St (between Bryant St & Brannan St), San Francisco, CA 94103\n- might be \"Public I\"", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "This five star review is only based on the purchase of one torta with carne asada, with no jalapenos. Oh goodness, that was great--every ingredient was top notch, and for such a reasonable price!", "author": "Richard U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-22", "description": "This place has potential, if they could just get their orders right. I've been there 4 times in the past 6 months, and they've gotten my order wrong twice. Normally just a new, correct burrito would be fine. Given I go there during my lunch break, and there is a substantial lunch crowd, having time to receive a new burrito isn't practical. I wouldn't recommend this place to any of my friends or co-workers.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "The food gets a review of 4-5 stars for me. I like their tortas with carne asada. You two big halves that you could share with a coworker or be completely stuffed on. I also enjoy their carne asada soft tacos and their baja fish taco. Dont think youre going to receive a small fish like other places. Their fish wont even fit in the taco! The small portion of chipotle sauce on the bottom gives it the right kick.\n\nThe downside to this place is their long lines and ridiculous wait times. Get there very early before lunch time or people are off work or suffer the consequences of missing 1/2 your lunch or your shuttle ride home.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "One of the few places in SoMA that you can get a California Burrito!  Yes, a burrito with french fries in it.  My eyes zoomed directly to the California Burrito, as I definitely haven't found many places that serve it.  The restaurant is super quick to deliver your order.  Even better, it's right next to the UCSF gym.  After a good workout, you can come here and eat a hefty burrito to cancel it out!", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "I tried quite a few things from here already: enchiladas, tamale, and tortilla soup. The black beans that pair with the enchiladas are really yummy. The tamale is good for the price. But the tortilla soup is the best tortilla soup I've ever had, and being from So-Cal, that's a big statement. It's served to you with a lime slice on the side so that you can control how much citrus you want in your soup. Genius! A third of the cup is all big pieces of pulled chicken; add in tortilla, rice, avocado, and beans, and you've got yourself a really hearty soup! Yumm . . .\n\nI would say things here are fairly priced and very convenient since I'm not too far away, but the one drawback is that they use these eco-friendly take-out containers made of really thin cardboard paper (you native SF residents know what I'm talking about). While I'm not against saving the planet because I'm a big \"green\" promoter too, it just doesn't make the best medium for carrying saucy Mexican food. The yummy spicy rojo sauce that covers your enchiladas just ends up getting soaked into the container (which is probably why they double box all hot orders), and your enchiladas also get stuck to the paper container as well. Boo!\n\nTip: Have a hangover? Go for the tortilla soup and a side of rice. It'll put that bounce back in your step in no time.", "author": "Linna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-20", "description": "Ew! Someone said they found matted hair on their burrito!!! Let's just call it \"Pubico\" from now on........\nI work nearby and as a vegan I order a burrito with no meat or cheese. They have messed up the order about 5 times (by putting cheese in the burritos). I kept coming back because there are so few places to eat in the Dogpatch area and because when they DID get it right, it was good. Their salsa was another issue though because it tasted like canned tomato sauce with some hot sauce in it.\nBut this time I went and ordered the vegan burrito and the guy said \"We don't have vegan burritos here. The beans are cooked with beef stock.\" I was shocked especially since it says on the menu \"vegetariano black bean negritos\" which would seem to mean beans cooked without meat but the guy said there's only one bucket of beans back there.......Bucket? Haha, no thanks.", "author": "Josie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-03", "description": "Expensive (especially for college fare but also by city standards) and substandard burritos. Not bad, just meh. Extremely limited indoor seating.", "author": "Shane O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "Great fish tacos! True treasure in San Francisco to find good food at a decent price. Great location as well on the UCSFcampus, sunny and peaceful.", "author": "Marisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "best lunch place around mission bay for a quick bite. i am so in love with the fish and chip burrito, though i'm pretty much useless after eating it because of the food coma it induces... :)", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "I work ~ 3 blocks away. While I had the salad with chicken before the 4 stars are for the Macho Burger!!!! I order it minus the cilantro mayonnaise. Love the black beans! It is a great tasting burger! Also I had some great interactions with the order takers which is cool too.  Table seating is limited but plenty of bench style and steps to sit on close by.", "author": "Bill P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "Was at the Mission Bay campus today and ventured out for some food. The rating is actually a 2.5. Here's why: \n\nthe tacos are a little more expensive than a typical truck because it's in an actual store front? don't think so, especially because there are many other items on the menu that can be inflated. $1.50 max, please. The flavour was good. I could eat it again. \n\nI was looking for a little more selection of meats. The usual suspects were listed with one omission. Was looking for the crispy carnitas!\n\nThe fish taco was pretty good. The fish piece was big. It was a little over $3. Again, a little high. Also, had the crispy taco, also a little over $3. It is like a light double decker taco. \n\nI had the carne asada and al pastor meats. They were seasoned well and had a nice flavour.\n\nIf you're keeping score, that's $9 for 3 tacos. I didn't think it was that gourmet that it warranted $9.  \n\nThe extra points are for being a glimmer of light in the otherwise sparse food plaza.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-05", "description": "I was at Mission Bay studying and got hungry. I found this place nearby and it looked yummy. I ordered the carne asada super burrito and was a little dissatisfied. Although the ingredients were good and fresh, it was not extraordinary. Also there wasn't a good salsa collection and I need salsa on my burrito! All in all, it's not bad for a quick fix but I definitely would not make it one of my main lunch spots.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "Pretty food, nice selection. But the taste is nothing special, especially for the price. Gloopy, gloppy nachos, cannot be eaten neatly. $10 minimum for credit card, but only $5 next door at Peasant Pies.", "author": "Ucb K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "I am eating a Charlie's Crispy Taco as I type this, and it's super yummy. Crispy taco wrapped in beans and a soft taco, filled with fresh goodness. I highly recommend it. I have it with their signature carnitas!", "author": "Jayson J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-09", "description": "Lets just say old meat + sensitive stomach= no bueno! \nI ordered from publico at least once week up until December.....when I had the worst stomach ache after eating (trying to eat) one of their burritos. I barely ate 20% of the burrito before I began feeling nauseous and ran to the restroom to hopefully beat my \"vertical spill\". I looked inside the burrito and noticed the meat was extra dry and seemed quite old.....I did go over before 12Noon, so it was probably stored from the day before. Oh, to dismiss any outliers, publicos was the only thing I ate that day. So went back over to tell publico about my experience, needless to say, they said it wasn't their food and they didn't serve meat from the day before. Which is completely false! I saw the cooks shredding lettuce at 2pm and putting in white barrels, yes for the next day of service. Lunch hour was over. Next the cashier said her manager told her not to disclose any more information to me and that it wasn't their fault. First, I was not trying to sue you, I just thought that not eating 80% of your product would be proof that it was horrible for me. Second, why not just give me my $8 back for hardship and horrible service. I called publico's management, no one has ever called me back a month later. \n\nWelppppp..... thats the end of me supporting them ever. The food is not the best mexicali in the city. Just go to the mission for a taco or head over to the eastbay.", "author": "Betty B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-28", "description": "Fantastic crispy taco yet truly terrible customer service.  It's very clear that the counter staff worker truly hates his job, his life, or both.   Surly, snarky, irritated, and condescending all during a simple transaction for a crispy taco, bag of chips, and with an added question abut about the \"salsa bar\" that is disguised in the plastic red and yellow catchup and mustard squeeze bottle containers sitting listlessly in the long ago melted ice water bath in the corner...?!?  Sorry Publico Urban Taqueria, I thought the crispy taco was close to being up there with Nick's Crispy Tacos yet your bad employee has lost you a potential regular customer.  Plus, you don't have a customer bathroom- so if you want to/need to simply wash you hands before eating you will need to go to another nearby restaurant or cafe and buy something additional to use their restroom... Four star plus taco, minus one for no bathroom, and minus another for poor customer service.  If you had a real salsa bar, it would be worth a positive star but you don't...  There are too many good taco/burrito shops in SF with better, more trafficked, locations- best of luck!", "author": "Christopher Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "I haven't been here in a little over a month, so I'm not sure how accurate my review will be, with that said they totally changed the torta bread. The torta is the best thing to get here either chicken or steak with a Jarritos. The thing about the new BREAD, is that its tough and not soft, so when you try to split the torta is falls apart. This happens every time, and it didn't with the previous bread. My advice change back to the softer bread. The new bread is even hard to bite through. I asked one of the cooks and he confirmed it, they did in fact change the bread. Their burritos aren't very good at all, their $8 salad is really good. I would suggest getting the torta (ask them to cut it all the way, otherwise it will fall apart) or order the salad and a Jarritos of course :).", "author": "L T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "The food's fresh. The tacos and burritos were good. I'm a route representative in the area so it's a nice spot to take lunch. Customer service (depending on who's working) may or may not be great. Otherwise for food, it's really nice. They also have salads and burgers too.", "author": "Bubba O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "I used to get the salad with chicken here  all of the time - it is really good! It tends to get pretty crowded. It pretty much made lunch survivable on the Mission Bay Campus (though maybe things have improved in the last couple of years). I tried the torta once but it seemed kind of small. The salad has tortilla chips, avocado, queso fresco, beans and more- so that's my favorite there.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-20", "description": "Inexpensive, quick(when not insanely busy), and tasty. They are very busy and popular during lunch since UCSF Mission Bay probably has a whopping three non-cafeteria restaurants in a half-mile radius. The only drawback is they have a habit of messing up your order if you ask for a substitution/alteration in anything, and a couple of times my burrito or quesadilla was soaked in grease(yes, I expect some measure of greasiness when I order a quesadilla, but not to the point where it was pooling and leaking out of the box) It only happened twice.. but its enough for me to always inspect what I get from now on.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "I've been here twice and both times have ordered the Mexican Salad! BOY is it freakin good. Only have had the pork, which is always hot and fall apart delicious. Radishes were fresh and sweet, sour cream was good, and I especially like the crunchy tortilla chips at the bottom of the salad.\n\nWith that said, I think it's a bit overpriced. $8.50 a salad is restaurant status, sit-down, enjoy your meal sort of price. BUT it was very good.\n\nThe 3 stars was also because the place can't follow instructions. Every time I've been there I've asked for the dressing on the side. First time, they didn't even put any and second time, they drenched it. AGH! But it was still pretty good.\n\nAlso, it takes about average time to receive your order. Wasn't fast but it definitely wasn't slow, all during lunch hours.\n\nI'd come back again, if I was in the area.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Not impressed at all.  Full disclose....this two star review is for the one meal I order which is the California burrito.  I should have read the ingredient more closely but instead of your traditional beans and rice it's steak fries....   The burrito was very greasy and the steak was tough.  It was the first time I've ever thrown away more than half a burrito.  A real travesty.  I was also meet with a slight rude lady with tattoos.  It's OK I don't mind rude and my review isn't based on rude just food quality.", "author": "Denise Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-24", "description": "I wish I could give a zero or negative star.\n\nI have eaten here about 20 times and felt the food was good and the price reasonable.  However today I ordered a Super Burrito to go and when I began unwrapping it to eat it a HUGE amount of matted hair was wrapped into the burrito.  Nuff said.  Nasty gross unsanitary food.  You have been warned!", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "The short: excellent al pastor tortas, good horchata, and a decent selection of taqueria favorites.  Service has improved since opening week.\n\nThe long: I'm so happy this opened, and it seems they've worked some of the bugs out of the system since their opening.  GET THE AL PASTOR TORTA that comes with cilantro mayo, pico de gallo, jalepenos, and avacado on a toasted roll with cheese.  Also, the horchata drink is really good.  The burritos can be a bit dry, and since they do not have a \"super burrito\" option, you're looking at $2-3 more to add the goodies like guac and sour cream.  Despite what the receipts say, they are NOT open Sundays yet.", "author": "Stacey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Torta's and Salad are the bomb thus 5 stars! Great place for lunch but is there's always a line", "author": "Max S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-01", "description": "Food its ok for what it is. If you are thinking to place a phone order around lunch time dont bother because their phone gets unplugged at that time ( that is because according  to  the cashier they cant handle all of the orders) so be prepared to wait a good 25 minutes for your 2 tacos or whatever you are getting", "author": "Edgar L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "The person who took my order was pretty damn nice.  I got a bottle drink and he asked if id liked it opened but i said maybe later.  Sure enough I came back after getting my order to get it opened and he even exchanged it for a colder one.  How sweet is that!  I got the surfer burrito and it was sooo good definitely worth the price $8.  Battered tilapia, fries, avocado, etc.", "author": "she q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-15", "description": "I came here because it's right next to my work. The food is way over-priced for the low quality it has. They charge you extra for chips and extra more for the sauce. Only reason they are in business is because they don't have real competition.", "author": "D V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-22", "description": "If you want a  boring/ plain burrito then this is your place.  Ordered the burrito morales (vegetarian)  first and last time they didn't even have knifes or napkins  I have had hundreds of burritos but this is by far the worst,  better stick to Chipotle...", "author": "Raymond H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-03", "description": "They have a pretty good burrito. I ordered the perfecto burrito which I thought would be equavilant to a super burrito but it didn't have too many ingredients. Maybe I got the wrong order.", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-04", "description": "Just updating because they've changed their menu a bit.  I think the burrito's are still misses here, despite the addition of the \"super burrito\" to the menu.  It just lacks any sort of kick to balance the creaminess of the sour cream (which tastes like creme freche) and avocado.   If they had a decent spicy salsa it might be worth it.  I do think the newly added line of burger based tortas are delicious though.  Hit up these messy tortas or the salad and you'll be happier.", "author": "Paul T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-28", "description": "Even if this isn't a real taco truck, it's painted as one and advertised as one, so I'm going to treat it as one. Which means they should have damn good street tacos. But unfortunately, their meat isn't good enough to be center-stage in a street taco. If I go back, I'm definitely just getting the veggie versions of everything. Their guac was really good on the crunchy taco after I picked all the meat out, so they have that going for them.", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "The best addition to the UCSF Mission Bay campus, and affordable too.\n\nGet the torta or the street tacos (3 of the $2 tacos = a good-sized meal).  The al pastor is yummy and comes with chunks of pineapple.\n\nUnfortunately the burritos are not as impressive, even with al pastor inside.  I'd only order a burrito if you're gonna add guac and other extras to it.", "author": "S L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-30", "description": "Been here twice, got the torta both times. This place is just okay. \n\nPros: The tortas are big enough, decent value for the price, tasty enough.\n\nCons: Could have more flavor, I taste mostly beans, not enough meat.\n\nFinal Verdict: I basically only come here when I'm sick of my company's cafe and don't feel like eating Subway.", "author": "Rodney Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "Great bargain ($2). Very tasty and overflowing carne asada street taco gave me the gastronomic push to carry on at WordCamp SF 2011.", "author": "Johanna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-16", "description": "A few months ago Publico stopped making its salsa available.  You used to be able to grab a bottle squirt it on your taco and enjoy.  Now you can't get any. At all. What kind of Mexican place does not have salsa?", "author": "Mike R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-21", "description": "This place is really growing on me, and actually it is currently my favorite best fish / beef taco in the city in my humble opinion. I may have not had all tacos in SF, but I live in the mission and tried a few others. I don't give it 5 stars only because of the slow service.  There is a long and lazy line of UCSF employees around noon every day. See you there for lunch!", "author": "Gilad D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "The food here is fine, but what pisses me off is how overpriced it is. Expect your food at this location to cost several dollars more than it does at the other location. 8.50$ for a salad?! Come on. I do like the torta, the bread is really good.", "author": "Megan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-18", "description": "An awesome and welcome alternative to the other food options on campus. So 5 stars for that, but -1 for not including avocado when veggie filling says 'avocado', and then -1 for repeating this error over and over. If you get the frijoles con filling, veggie style, you should get peppers, onions, avocado, pico de gallo, and cheese (except I still havent seen the cheese either, but I don't care about that). FYI. Pricer than it should be, but for the convenience, worth it.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-17", "description": "Ta Cos, Burrr Rittt tos, Car Ne As sa da,  AL Pas Torrr, Po YO...I tried them all -- the street tacos and burritos that is. The carne asada and pork shoulder are the best choice of meats for the street tacos, but they seem a bit dry -- not juicy, which usually comes from all the fat, and I love me my fat O_o This taqueria seems healthier than others. But then again, SF is the health capital of the world, no? Ask for some extra salsa to help with the dryness. It's not bad, though, but not great. I come from San Jose, where there are lots of tasty Mexican food at every block, so I guess I'm sensitive to not-so-Mexicanish food. Perhaps the mural of the food truck that you see on the wall as you enter in (as though you're buying from a food truck) threw me off. It gave me high expectations cause food trucks automatically means great food. I walk by to go to the Subway next door, but that freakin taco truck suckers me in. Dang it, Publico Taqueria, I commend you! That truck painting is genius, with today's fad being food trucks and all. 2.5 stars rounded up to 3 (because of the taco truck painting inside).", "author": "Johnny P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-07", "description": "Good fresh food. But if you order something from the grill, Im not sure that you will not get some meat left over scrappings :(", "author": "Renuka S."}
