{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "While walking around Chinatown, my party of two decided to try this shop for tea tasting. Although you could seat up to 6 people for a $35 session, we decided to try it with our small party anyways. First, we had to choose 4 teas out of the 8 options available. Then, a kind lady sat us down and guided us through the teas. \n\nA few things I would like to note about that place is that I loved how clean and tidy the place was! The cleanliness of the place definitely made the experience great. Also, the lady who served us was very kind and answered any of our questions. Last, I personally loooved the Formosa Red #18 tea and would definitely recommend trying that one! It has such a natural sweet flavor despite not having any sweetener added, and it smells delicious!", "author": "Julia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Tea shop with tastings. The way it works is that they offer tastings of 3 teas for $30 per group of people. A salesperson sits with you through the tasting to explain and prepare the teas, and tries to sell you teas and glassware, etc.\n\nMy first disappointment was that they did not put any effort into helping us select which teas to taste. In hindsight we really should have browsed the store and picked some out before talking to a salesperson.\n\nThe actual teas we tried were pretty good, as was the preparation. The salesperson rambled through a script full of half-truths and posudoscience about the benefits of tea as we went, which I found somewhat annoying. Once the core tasting was complete we were left alone to enjoy the extra tea, which was greatly appreciated.\n\nI did end up buying some leaves, but in general the prices seemed quite high and the experience was not good enough to make me inclined to buy more.", "author": "Christian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Delicious tea.\n\nThe offer high quality teas and reasonable prices. Employees are hard working, incredibly helpful and knowledgeable. They are so patient too, taking their time to explain their teas. They sell a variety of teas, teaware, gift sets, etc. This is a great place to find a gift for that tea lover in your life. The tea shop was clean and organized. Their teas are clean, flavorful, and have a smooth finish. \n\nGlad we got a chance to visit!", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "I came in for the full tea experience, & I got it here. Perfect for a rainy day.  They offer tea flights, that include your choice of 3 out of the shown menu. You should probably reserve ahead of time, but I got lucky mid day during the week.  I received a private lesson in tea.  They are very knowledgeable, & walk you through every step of the process.  I was very impressed.", "author": "Joby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Feliz was amazing, we literally came in off the street looking for loose leaf teas when we came across this gem.  I thought I knew a great deal about tea, but I was sadly mistaken.  The demonstration and sampling was a great experience for my daughter, as well, since she loves teas as well.  Cannot recommend enough.  Feliz was knowledgeable, friendly, and gave us some great tips for cold brewing.  Like I stated, she was just amazing.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "I went here with Debra R and Jose R. We bought a bag of oolong tea and another bag of jasmine tea. The customer service was good.", "author": "Julia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Love! This shop is very crisp and clean. Everything is clearly labeled, so you know exactly what you're getting. I couldn't chose which to buy so I needed up getting a box sampler set. You really can't go wrong in this place because all the teas are great quality. The staff is super knowledgeable and help guide you to the tea you might want to buy.", "author": "Ellie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "We really love tea and wanted to get some new ones... My husband bookmarked this place a while ago and last time we were in Chinatown, we decided to try it. The place is very lovely and the teas smell amazing.\n\nWe chose to have a tasting and tried three different teas (dragonwell and two different kind of jasmine tea). The person who took care of us was really nice and he explained a lot about the teas we were tasting. It was very interesting and useful too.\n\nWe bought two of the two teas we tried (dragonwell and a jasmine tea in little pearls) and also got little cups to drink tea. We really appreciate the advice they gave us and we will come back! Thanks for the experience!", "author": "Caroline P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Definitely a fan of this place. The staff takes their time with you and explains things. Additionally, free sample of something you are interested in buying. The tea itself is great quality and we have not been disappointed after coming here many times over the years. When I come back in town to SF, this is one of my top spots to check out and get some tea for home. Good quality, friendly staff, reasonable price.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Bottom Line:  Quality tea and trustworthy service in a clean store that is transparent about their practices and packages.\n\nIf you want good quality tea and want to purchase it from a knowledgeable and trustworthy source then come to Red Blossom.  Having tried tea up and down Grant Ave. in Chinatown I think Red Blossom is the best, by far.  Although the store may look new and modern, they have actually been in business for over 30 years.  This family owned store is serious about sourcing pure and quality tea and I think their clean and minimalist displays echo that sentiment.  \n\nAlice, who I presume is the owner, grew up in the tea business as her father was the entrepreneur of this great shop.  Alice is very knowledgeable about tea - not just from reading about it, tasting it and growing up in the business but also from traveling to China to visit tea plantations.  She visits tea plantations once or twice a year to see the process followed by farmers and to make sure they are not directly using pesticides or getting overspray of pesticides from neighboring farms.  Given Red Blossom's attention to detail it is not surprising that their tea is featured in many Michelin-Star restaurants throughout the United States.  The many varieties of teas sold at Red Blossom are perfect as is - there is no need to doctor them with milk of sweeteners. \n\nAlice is not just an expert in Chinese tea, she is an expert in the tastes and customs of tea served around the world.  I really appreciate that her context for tea extends beyond that of China and that her personal ties to England have given her another perspective.", "author": "Courtney K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "The moment I walked in this store I was shocked by how nice it was. I loved how they had tea lining up along the shelves and how in the front you could try the tea they had there. The tea was very good. I first walked in that store last summer and I keep ordering tea from there. I recently ordered 4 oz of the honey orchid oolong tea for about 60$ and I would highly recommend it. Another great one is the golden monkey first pick black tea and that was the first tea I bought I would also highly recommend ( about 17$ for 2oz ). They also have very nice tea sets. When I was there I bought a 20$ tea set and I use it frequently. The costumer Service was amazing they were very friendly and helpful. I was welcomed in and they let me try different kinds of tea so I knew what I liked. I very much so enjoyed my experience.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "It has been seven years since I have reviewed this tea shop.  \n\nAfter a project meeting on Sat, I just happened to be walking by the store, and decided to purchase my favorite tea for an associate.\n\nI was assisted by Eliza (!?). She was superb in reminding me on the various qualities of certain teas while giving me some shopping ideas.  It was also so nice to talk to Alice, (the owner and the ultra tea expert) again.   They are so pleasant.  \n\nAs usual, I was out of there in a shade of a moment (less than eight minutes) and believed that I got the most bang for my buck.. \n\n[ A Noteworthy Point ] \nThey usually have their tea tested for pesticide. I am not sure if other tea shops are doing that.  \n\nIf you are a hardcore tea drinker who love quality and enjoys dealing with people who are honest and trustworthy, I highly recommend Red Blossom Tea (RBT) as a \"alpha\" tea source.\n\nIn summary, I respect their business ethics and their commitment to fair pricing.  I give RBT \"5 stars plus.\"", "author": "Marshal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Outstanding.   Such amazing selection and super knowledgeable staff.   Feliz knows everything about teas and is the absolute best.    Great tea tasting classes for only $30 a person.  So amazing.  Did I say go, go, go?!?", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Serious tea drinkers should put Red Blossom on their shortlist of tea shops in San Francisco.  It's one of the few places which will tell you everything about a particular tea, or the \"SCOPE\": Season, Cultivar, Origin, Picking, and Elevation.  It's not a shop for something like an English Breakfast tea, which isn't really a well-defined product anyhow.  However, if you want to know exactly where and when a tea was picked, this is the type of shop for you.\n\nNote that it's more of a retail shop than a tea room, though you can taste small samples before buying.", "author": "Lucullus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Red Blossom is a fantastic tea shop for the beginning to intermediate tea drinker, and I love that they're conveniently located near my apartment, and near Chinatown where I like to buy other things.  Red Blossom covers your fundamentals, so they'll have great quality selections of the most famous / classic Chinese teas, and starter teaware at reasonable prices.  I can always find an excuse to drop by Red Blossom.\n\nIf you're looking for more rare, aged, specialty teas and artisan ceramics and are willing to pay accordingly for them then I recommend Song Tea & Ceramics in Pac Heights (see my review:  http://www.yelp.com/biz/song-tea-and-ceramics-san-francisco-2?hrid=tHJ7jtRMpgPWhAQRGmSChA)  I've found that Song's selection is much smaller and skews heavy on oolongs and a few red teas, so if you like whites or greens you might be disappointed.\n\nThe ambience in Red Blossom is clean and modern, and usually pretty busy.  They have 3 gongfu tea setups so they can serve about 12 - 15 people, but it's not the kind of place you can dawdle and taste tea all day.  They do try to discourage you from trying too many teas that are similar to each other, or teas they can tell you won't like.  I wish I could try more teas without feeling guilty but I suppose that's fair, the tastings are for customers who are actually planning to buy and just need to decide which varietal to buy.  If you want to sample the tea ceremony without purchasing tea, you can book a tasting and I think it costs about $10 or $15 per person.\n\n\n\nGeneral review of Red Blossom's teas, by type:\n\n---- GREEN TEA ----\nAll their Dragon Wells have a beautiful buttered toast aroma and flavour.\n- Pre-Rain Dragonwell:  bought this one as it's their cheapest Long Jing, finicky to brew but gorgeous clear fresh flavour\n- Cloud and Mist:  Fragrant, versatile, cheaper and easier to brew than the PRDW.  Next on my to-buy list.\n- Huang Shan Mao Feng:  Not my favourite, but good for people who like more grassy flavour\n\n\n---- OOLONG TEA ----\n- Jin Xuan Winter Sprout:  so buttery and sweet, my partner bought 2oz of this and almost finished it within a week\n- Heritage Golden Buddha:  creamy, smoother younger cousin of Da Hong Pao.  This tea has one of my favourite aromas of the teas in my collection (~40 teas)\n- Da Hong Pao (Beidou):  they take great pride in the fact that this is a close descendant of the Da Hong Pao mother trees, it was good but I'll need to taste it again before buying\n- Wenshan Baozhong:  beautiful light aroma of a greener Taiwanese oolong, but leaves only last about 2 infusions\n\n\n---- RED / BLACK TEA ----\n- Formosa Red, Assam:  gorgeous aroma, smooth, not sweet.  Partner bought this\n- Formosa Red #18:  slightly sweeter version of the Assam\n- Three Cultivar:  one of my favourites at a reasonable price, but then I'm inclined towards Wuyi oolongs\n- Golden Monkey, First Pick:  malty, caramelly, excellent\n\n\n---- WHITE TEA ----\n- Bai Mudan (White Peony) tasted rather old, not the best.  For fresh white teas I love the selections at Teavivre.com\n\n\n---- TEAWARE ----\nThe teaware Red Blossom carries is higher quality and thus more expensive than most of the temptingly cheap stuff you can buy online from China (and many other US importers).  The tea trays especially are gorgeous but the stone ones will run you a mind-blowing $400+!  (Makes sense, because the shipping from China alone for a similar stone tray I found on Taobao costs at least US$160.)\n\nI want to call out Red Blossom's basic Jingdezhen Spring / Summer gaiwans, incredible value for US$28.  (I bought one of these for my partner and I'd recommend it to anyone looking for a first gaiwan.)  It is made of very thin but sturdy porcelain, and they actually use those models in the shop for tea tastings every day and they don't seem to chip or stain easily.  For similar prices (US$10 - $24) I've bought 4 gaiwans on Taobao, Ebay and the like, that look good but the material and workmanship are coarser (for example, thicker porcelain that tends to burn the tea or blunt the aroma).  Am saving up to buy another of Red Blossom's plain gaiwans for myself soon.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Amazing! You have to try the tea tasting. Alyssa and Felice are so nice and knowledgeable! The highest recommendation possible.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Tea is very good quality and unlike the big chain, they don't try to upsell me when I make a purchase.", "author": "Gunnar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "My first time being served at a sit down tea store. I sampled the oolong orange blossom and it was strong to me. Oolong always is but I barely noticed the orange in it. I'm not a tea connoisseur so It was still worth trying. Good service from my host.", "author": "Miriam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "If your looking for a wonderful and unique experience See \nFelicia at red blossom. She explained and had a taste some delicious tea . She was so friendly helpful and an expert explaining the various regions and growing environments . The tea was delicious and our experience was the highlight of our trip to San Francisco. I highly recommend making an appointment with Felicia , and spend an hour learning and enjoying tea.", "author": "michele r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "Totally charming purveyor of tea imported from China. Wonderful person served us samples and lessons for a modest charge. We had some sent to Houston and a glasss tea cup brewer", "author": "Marc G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-22", "description": "**Appointment highly suggestioned. \n\nThis place is a stickler for time. \n\nI set up an appointment 4 days prior to coming in, but when I arrived, they had my appointment on the wrong day. Nevertheless, they still took me in and told me to pick three variations of tea for the tasting. I asked them , whether we could try more than 3, but they refused saying that time is very limited for them. My friend and I were bummed, but it didn't really matter, because they had such a limited selection of teas anyway. There were 2 teas variety of tea that I haven't tried from there entire store. \n\nHowever, as the Red Blossom tea expert carried on, she was very informative about teas, showing us the map of China and pointing out where they were from, explaining exquisite detail on each tea plantation process. I've been to countless tea shop and tasted no less than hundreds, but I did learn something here. :) That's a plus. \n\nThe shop was clean and neat, with the metal tea buckets on the right side from the entrance and the two tasting tables on the left. We were told that since there were limited amount of tasting table, we may had to share the space with two other customers (four chairs per table). We find it slightly ironic, because we made reservations to keep the table to ourselves and the time slot. However, they allowed it so just the two of us preoccupied the table.", "author": "Lily V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Very good, they walked me through the teas I was interested in and explained where they came from and what I should expect.\n\nLots of fresh tea broken down by production season and region. \n\nExpensive although the service is good, so I'll go there again.", "author": "A H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "My review is strictly for the teas as I ran in to buy a gift and a bag of Dragon Pearl Jasmine for myself and did not stay to converse or sample.  However, I can say that the service was excellent and swift.\n\nMy family thought the Dragon Pearl Jasmine tea was fragrant, smooth and had a delightful after taste.  A little flower went a long way.  We can't wait to try more flavors.\n\nThey wrapped the canisters that I purchased as a gift in a cute red bag with bright red tissue paper that made a wonderful presentation and present.  I will definitely be recommending them and looking forward to coming back.", "author": "Franco L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-16", "description": "My three friends and I had heard several people speak highly of the tea bars in Little China, so we were quite excited when we walked into the Red Blossom Tea Company. \n\nUnfortunately, right from the moment we entered, the service was snippy and abrasive. They refused to let us try anything but the one batch of tea they had already brewed, and unfortunately, that batch was only barely luke warm and so incredibly watered down that we could barely detect its flavors. \n\nWhen we asked if they had any \"stronger\" flavors, the lady seemed extremely harried by the request. We left shortly after, and found a MUCH better tea tasting shop just a few doors down the block.", "author": "Jassmine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "I have heard about this place from a friend.  In March when I went to SF for vacation, I decided I had to pay a visit.  Alice is super friendly and very knowledgeable about tea. She made us feel at home, having tea chatting with a friend.  We tried a couple Taiwanese Oolong tea - they were very good, probably the best we are able to get our hands on without having to go to Taiwan ourselves!  I will definitely visit again when I'm in the area.  For now, I'll have to order online.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "My husband and I stopped in seeking a respite and got a phenomenal education and experience from Felice, who sat with us for several cups of a sampler of several teas. Clearly the owner and employees know their craft, and even though we're regular tea drinkers, we learned a great deal. I look forward to returning and learning more!", "author": "Kenlyn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-22", "description": "I just ordered tea online from this company and I am very disappointed. I love tea. Lapsang tea is a strong robust black tea. When I get it from other places it only takes a small amount of leaves and they can be re-steeped several times before they are spent. Unfortunately the Lapsang tea I just got from Red Blossomm Tea is the weakest I have ever tried. I had wondered why the teas I purchased from them were so much cheaper, now I know why :( \n\nUPDATE: I just tried the second tea from my order, Tung Ting. It is my favorite oolong. The one they sent me is not as good as the previous one I have. This one is much weaker. Not happy with their teas.", "author": "Abigail L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Really good tea experience. Very patient and informative host, and she even offered to give us an extra for free, although we declined.\n\nThe tea was extremely high quality and tasty. Would definitely come again", "author": "Yanir R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "Cute tea room. Tea sample was a sweet ceremony. Alice is entertaining! And of course the teas are fabulous!", "author": "Lillian H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "The young lady who \"helped\" us was extremely pompous. When we asked about a tea, she quoted a price of $800.00 an ounce and told us \"We are like fine wines, we don't sell Sangria.\"  Other customers were having samples and getting educated by staff. Was the lady who spoke to us implying that because I look Latina, I can not afford their tea? I stated 3 times that we could buy some but she walked away. This was such a sad situation, so my husband and I left without tea.", "author": "Susan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "Checked out Red Blossom Tea Company in SF Chinatown.  It's a small shop that holds tons of teas from Taiwan & other places I think.\n\nI got to try Dong Pian (Winter Sprout), 2012 iced.  It's naturally sweet & tasted really good.   \n\nSome ladies were doing a tea tasting to find out what they wanted to buy next.  I tagged along & sat next to them.  The water was kept at 195 degrees.  We tried a bunch of teas:\n\nMonkey Picked Tieguanyin\nOrganic Dragon Pearl Jasmine\nSparrow's Beak\nHuang Zhi Xiang (Orange Blossom)\nHeritage Beidou (Grand Scarlet Robe) \n\nI ended up getting the Dong Pian (Winter Sprout) 2012 a 2oz sample is $33!\n\nCharged it.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Simply the best tea. The prices can be high, but the quality and taste ends up being totally worth it. As I mentioned a while back, they do charge $30 if you want 4 samples, but skip that and just seriously buy some. They will let you sample it if you have intent to purchase. Start with the monkey pick, delicious!", "author": "Jonathan U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "My friend and I were on a mission to find this place. We walked by it once but found it on the way back. Be careful when looking for it, because it's very easy to miss. The second you step inside, you're entranced by the amazing aroma of all the teas! The man who helped us was really nice (didn't catch his name but he had blondish hair). Hey have a huge selection of teas and I ended up purchasing the Jasmin holiday box. It can get a little pricey so just be prepared to make it rain in that store. Enjoy, fellow tea lovers!", "author": "Tati N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "If you are looking for an exceptional cup of Chinese tea, look no where else! I purchased hundreds dollar worth of tea from them and never disappointed. Their price are high but not unreasonable (Given you get high quality tea). I bought tea at malindao street at beijing China, and found the price is almost comparable ( I did bargain hard in beijing and know how to distinguished high quality tea)  I also found that their pottery is also comparable to those in malindao street. \nbeware though if you like sweetened tea, or any bubble tea, this is not the place for you. This is an old school, pure tea experience shop!\nThey do have good chai tea selection!", "author": "Dan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "Extensive selection of high quality teas... but pricey.  Think of them like wine and it will help you cope with the cost of the price. Staff very well informed and provides excellent tastings.", "author": "Sam V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "I went there not knowing what to expect based upon reviews on Yelp.  The shop is located in China town.  The staff was very good and explained the various teas and provided recommendations based upon the tea that I like.  This was very helpful in that I've never been in a Chinese tea shop before.  I left with a number of samples and will be able to reorder on line those that I like.  I'd highly recommend this shop.", "author": "Rick F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "I stumbled upon this place when I visited SF for the first time eight years ago. They have fabulous teas and superb service. I come by to stock up every year when I visit family for the holidays. Their jasmine pearls are a staple- the leaves can be brewed multiple times and still yield delicious tea. I love serving their blossoming teas when company comes over- so beautiful in a clear pot! The teas all smell so good and taste even better. Can't go wrong with whatever you choose, truly.", "author": "Princess U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "The staff here is very friendly and the food came fast. The place is nice and clean, a good place to stop for a drink or a quick meal.  Although food is good but a little pricy.", "author": "Doroncy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "We had an INCREDIBLE experience at Red Blossom Tea Co. this past weekend. Alice hosted our tea tasting experience; and, as the owner's daughter, she is SO SO knowledgeable about all things tea! I love taking high tea English-style with all the pretty silverware & pastries, and also drink \"tea\" on a day-to-day basis. Alice opened my eyes to the world of authentic, high-quality teas. For example, I learned that herbal teas are not really teas in the traditional sense, since they are mostly just flowers and herbs steeped in hot water. Also, the English tradition of taking tea usually calls for adding cream and sugar/honey to your tea, which, if the tea is of high quality, ruins the experience and masks the tea's true character and beauty. \n\nAlice took great time and care in explaining the different kinds of tea to my husband and me (white & green, oolong, & black teas). Very informative & enlightening! I love wine and have a fairly educated palette, so Alice used lots of wine references for me to relate to, since tasting wine and tasting tea are similar experiences. She also introduced us to teas aged for decades, which I fell in love with!\n\nSkip all those phony \"free tea tasting\" places you see in Chinatown, and come taste the real thing at Red Blossom Tea Company! I'm so glad we did; it was so worth it!\n\nNote: We visited in the late afternoon on a Saturday in early spring (the day before the Chinese New Year festival). We were the only couple having a tea tasting at the time, and though people came into the shop and made purchases, I felt like we had a very personalized experience. The shop did not feel crowded and I did not feel rushed at all.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "I am totally in love with their Pre-rain Dragonwell. I used to always get Dragonwell from Teavana or Davids, but Red Blossom's is superior. Some of their teas are very expensive but others run about what higher quality teas are elsewhere. Staff is very knowledgable and helpful, but haven't been overly generous with tea samples like other tea shops in Chinatown. Definitely give them a try though, very good tea!", "author": "Mylie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Absolutely love this place! I've been coming here ever since they opened, as they were our tea vendor when I managed Dragon Well on Chestnut St. Although their tea selection may be smaller than many of the other stores in Chinatown, the quality outweighs and outperforms any other option nearby. I'm always blown away by how knowledgeable the staff is, from where the tea is grown, temperature conditions, harvest times, post-harvest preparation and serving techniques.\n\nMy absolute favorites are the Moroccan mint, lychee black and Dragon Pearl Jasmine. As a treat, I'll sometimes throw in a blossoming bud as well.\n\nEven though I no longer live in San Francisco, I always stop by Red Blossom on every visit to restock my tea supply. Yes, you can order online, but there's nothing like being able to smell and taste the amazing aromas in person.", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I used to own a tea house and therefore am extremely picky about tea. I stop at this place every time I come to San Fran. In particular their oolong selection is excellent. They also do a nice tasting to let you select which varieties you want to buy. Highly recommend them.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "BREWING THE BAY: Chinese and Taiwanese loose leaf teas, gongfu teaware\n\nRed Blossom is tied with Aroma Tea Shop as the best tea shop in the city for Chinese and Taiwanese loose leaf teas. They don't have as overwhelming an amount of selection as Aroma, but the quality is just as high. There is also plenty of free tea sampling to be had. \n\nAlice and Ada are very nice and clearly passionate about what they do. Alice, who now runs Red Blossom (it's a family-owned business), is the type of tea connoisseur who could spend hours talking about pu-erh and oolong if you let her. Through consultations with her, I decided to pick up a few ounces of charcoal-roasted oolong from Taiwan and some Lapsang Souchong for tea cooking. Fun fact: Lapsang Souchong really isn't meant for drinking in the world of Chinese teas--it's mainly used for cooking. Who's making Szechuan tea-smoked duck in the near future? Meeeeeeee! :)\n\nI've visited pretty much all the tea shops in Chinatown and this one stands miles above the others in terms of service (friendly), knowledge (robust), decor (clean, modern and simple), quality (high) and prices (fair and actually cheaper than Aroma in several instances). Don't be put off by its location. It's anything but a tourist trap.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "We've always had great service from the staff working at Red Blossom.  They listen to us describe our tastes in tea and what we've liked from previous purchases, they then make suggestions and provide sample tastes.  I also appreciate the staff sharing their own views and preferences on the different teas in the shop and their techniques for brewing.  I like the selection very much, interesting and diverse varieties from PRC and Taiwan.  They'd be perfect if they also stocked interesting tea from India and Japan but I give them five stars for defining their niche and executing within that niche at a very high level.", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-27", "description": "Now that we got all the shopping out of the way, sit down, relax and enjoy some tea in a charming tea house. The entire staff is extremely knowledgeable about all of their teas and will not hesitate to answer any questions that you might have. They also have a sampling station so that you can try different teas before buying. This stop can prove to be a relaxing, educational experience\n\n\n(IF FOLLOWING MY \"CHINATOWN FOODIE TOUR,  this is a great place to temporarily escape the busy streets of Chinatown and take a breather)", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "The best selection of Oolongs, with Chinese names (not rebranded).\n\nFive stars for the tea, but not so hot on service, try to rush you out the door after one tasting, even if you buy what you taste.  Invent reasons you shouldn't try a tea.\n\nIf you like Oolongs, go and insist on multiple tastings. Being firm overcomes their get-the-f***-out attitude.\n\nedit: I am afraid they won't serve me since my pic is on this review, so I'm bumping it to four stars. I think my fear of not being served justifies the increase. Also, the Oolong they said I wouldn't be able to taste after trying some strong ones actually does not taste good. So I should have listened to them. So four stars. Ah hell, I'll give it five.\n\nSeriously the tea is kinda pricey but its really good.", "author": "Russell X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "Coming here made me realize how much of a novice I am in my knowledge of teas. I felt like I was a little kid in a candy store, wide-eyed with the assortment of teas and accessories they offered, and the decor inside matched the mood. You're not going to find your sugar-filled Kool-aid iced teas here; it's nothing but the best and authentic teas in it's most purest form.\n\nThe staff was very helpful (I think they saw my deer-in-headlights look when I was walking around lol), and I was even offered to join in on a tea sampling with a random newlywed couple. I saw/learned how to properly brew and taste tea for it's hint of flavors. \n\nTake my money. Now.", "author": "Marc M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Great tea shop! I took the time to sit down and try three or four different teas with absolutely no pressure. \n\nThey have a really solid range of teas and accessories ranging from the affordable and every day to rare and high end. Worth a visit for sure and prices are fair for the quality of tea.", "author": "Morgan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "Red Blossom really changed the way I saw tea.  No wonder why the tea bags bought at the grocery store (anything in tea bags for that matter) can be so bitter - I am told those leaves are the just bits and pieces leftover from the tea houses!  Just look how supple and fresh these tea leaves look after steeping, not like the dry, crackly bits and fragments you normally get: http://www.yelp.com/biz_photos/ZG0CRrkc9i-AGnea3CeWYw?select=RmcjO6uz5YCaKdZpQH5Dgw \n\nI did not know that the loose leaf teas carried by stores like this can be steeped several times.  I love jasmine tea and I fell in love with their \"blossoming\" type (also called flowering or blooming teas).  Tea leaves wrapped with dried flowers take the form of a bulb for drying and storage, the little bundle of leaves and petals unfurl and \"blossoms\" and have an amazing aromatic fragrance, looks so pretty and such a joy to sip on!  Here's how it looks in my personal steeping vessel, also bought at Red Blossom:  http://www.yelp.com/biz_photos/ZG0CRrkc9i-AGnea3CeWYw?select=sRTGEYFm62TGqMmVWQXNGw\n\nThe folks here are really nice, so well versed and are always happy to give a lesson and tasting.  They also have boxed sets that have a sampling of a little bit of everything, great as a starter kits or gifts.  Every time we plan a trip to Chinatown, we always have to make a stop here.  Whether you are into tea or not, the experience will really resonate with you.  I encourage you to drop in!", "author": "Teresa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Wow, I should have written a review long before this. My apologies.\n\nAlice has been the owner since her parents retired and she has kept the family tradition intact. Her brother Peter now sells very high end teas at a different shop in San Francisco, but Alice has kept the original shop the way her parents ran it. It was through Alice that I became a full-time tea addict, and I am forever grateful. I have probably bought about half of the teas on the shelves by now.\n\nThis shop sells mostly teas sourced from Taiwan, but also has a selection of Japanese greens, if I remember correctly. They also have flavored teas like Jasmine and those fun flowering teas. I gave a friend some black tea flavored with rose petals and it was a huge hit. They have teas at every price point, but the prices are definitely going to be higher than the teabags at the store because you're not getting junk. \n\nI've never made an appointment for a tea tasting. That said, I've had tea tastings here many times and it's one of the reasons I stay pretty loyal to this shop because this is how I ended up learning about many different teas. Try asking for a tasting when they're not busy. \n\nGreat place to venture out into the world of teas. \n\nMy preference tends to lean toward sweet, buttery, creamy, yet citrusy. That's why I'm really into their greens and lightly oxidized oolongs lately, so take what I have to say below with that in mind.\n\nMy faves right now are: \"Our Finest Dragonwell\" (the priciest one, but that one goes fast because it's super buttery and rich and amazing, totally worth it.) \n\nAlso, I am really into their high mountain oolongs right now. My daily tea choice is usually their Wenshan Baozhong; this one is very sweet and creamy, not as watery and citrusy as I've had elsewhere. My other daily tea is their Alishan (very buttery last year) and the Fu Shou Shan (despite the fruity, floral overtones this has a nice backbone that I typically just drink by itself, no food).  Love the Lishan as well. I love their Heritage Grand Scarlet Robe Wuyi oolong (very dark, charcoal roasted oolong). If I recall correctly, this is the one that someone suggested drinking while eating a chocolate cake. I haven't tried that yet.\n\nAssams are typically Indian teas, but I really like the Taiwanese sourced \"assams\" that they have here. I really love the Organic Formosa Red assam (sweet, rich, thought it was an excellent accompaniment to a single butter cookie)  and the Native Cultivar Mi Xiang one (from the word \"honey\" in the name, it's definitely sweeter, yet I'm kind of partial to the less sweet version). The Three Cultivar Red looks intriguing, but I haven't tried it yet.\n\nMaybe if I win the lottery, I'll go check out Peter's shop, or maybe I'll just stay here.", "author": "Choco L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Tea to try for free. All of the teas are in large metal containers (compared to the clear glass ones at most other places) so you can't see the quality until you request it. Once opened though, a nice aroma is usually released. They will gladly make you cup before you buy. Quality stuff is sold here.", "author": "Nam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "This place is great! Not only is the variety of teas available gigantic, but the servers are excellent. They are very professional and friendly, telling us the benefits of each tea an whatnot. Sitting in and simply trying different tea leaves was fun, and we ended up ordering about a pound of Oolong with ginseng powder", "author": "Tal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-17", "description": "Despite being on Grant Street, Red Blossom is the antithesis of a tourist trap.\n\nThe amount of tea here is downright daunting. Should I get a gunpower blend, or is the phoenix oolong right for me? There's a massive selection here, and it is easy to get drawn to browsing the shelves and reading about each style. \n\nThe place is clean and professional, but the prices can be downright expensive for some of the rarer blends. Then again, these teas are the real deal, and can beat the everloving crap out of store-bought bags six ways from Sunday.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "Shopping for tea at Red Blossom was a delightful experience.  I went in looking for some nice tea to give as a New Year's gift to a friend from China.  I wanted to be sure that I got something nice.  I was invited to sit down to join the proprietor and one of her regular customers as they tasted tea.  She was very gracious with her explanations.  The tea was delicious.  I left with two delicious teas in a nice tin, plus the confidence that I was giving my friend quality tea that will be appreciated.", "author": "J E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-12", "description": "This store has been passed down to the daughter.  Will be interesting to see how it moves forward.  The other sibling pictured in the main photo is starting his own tea company at http://www.songtea.com/", "author": "Erik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "wide selection of tea and accessories, but not overwhelming.\n\nUnlike the other shops on Chinatown, this one is geared towards Western shopping styles and expectations: not bargaining, no needing to check for authenticity. They sell the representative  best here, relative to each item's price price point. \n\nI came in hoping for expert, uncrushed personal help. Many of the shops I had previously visited were rushed, and clearly attempting to sell items which were not of the best quality. Here I was poured a cup to sample before purchasing, and left satisfied and confident with my purchase.\n\nI feel that this place is worth the trip if you live in the South Bay. So is Aroma Tea Shop on Sixth& Clement (specialists in Taiwan)", "author": "Ethan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "Very good tea at good prices. Tung Ting is great for an everyday tea. White teas is great for evening. I can drink it after 6pm and it will give me clarity and energy, but when it is time for sleep it does not keep me up.\n\nOnly complaint here is the service. Other places just down the street will offer you samples. We have spent over an hour tasting many teas at these other places. Not here. Once I was offered a taste of some iced tea they keep near the register. \n\nWe buy tea from here all the time and last time I asked if I could get the white tea but asked for if they could please separate it into to bags because I wanted to give one half to my friend. (I am trying to get her hooked on it, too. We are both law students and need all the good energy we can get.) The girl said no! Just flat out no! Did not even offer to give me a bag so I could separate it myself! Really?! WTF?!!!\n\nI had never seen her working there before. Maybe she was new and could not do me the favor,..\n\nI will be coming back but only for the tea. If you want a tea tasting experience go elsewhere. Three stars for the tea.", "author": "Yesenia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Love this place. I wish they would bring back the Vanilla Orchid black tea, though. It's my favorite.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "I believe Amanda was the person that educated me on tea during my visit.  She couldn't have been nicer and more patient.\n\nI simply didn't realize tea is a process and not a bag of something you throw in hot water.\n\nShe spent time walking me through there many varieties as well as the different stages of varieties.  The real focus was on green and white teas.  We talked about the similarities of tea harvesting and olive oil pressing.  We also discussed how to bring out the sugars properly in tea.\n\nAmanda offered and showed me how to make a proper cup of tea.  The tea pot couldn't have been more than 6 ounces, the glasses 1-2 ounces, and she did not bring the water to a boil.  The tea we had was a little beyond tap water hot.  She explained how to avoid bitter tea and most important showed that tea is an event and should be a slow and relaxing process.\n\nI'll be ordering from them in the future.  Great store.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "Being a tea lover there are several tea shops I like to support in Berkeley, but when I want to take visitors to my favorite tea shop, this is where I like to take them and here's why.\n\nThe owners are excited about tea, very friendly, knowledgeable, good humored, smart, and not at all pushy. They love to share their knowledge and traditions of tea and they've created a really nice environment in the middle of China Town where you feel like you're in a Zen space than the typical (and fun) stores in chinatown where every inch of space is crammed with things.\n\nThey also carry the most wonderful tea servers and the quality of their tea is excellent. I've been shopping here since a friend told me about the place in 2005 and my favorite tea is the Lishan, Formosa Oolong.", "author": "Andrea Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "These people seriously know their tea and can pretty much answer any questions you have! \n\nSo I love drinking tea and more than that I love learning about it too. I came here not knowing much about tea except for the fact that it's a bunch of leaves you steep and drink. I pretty much went up to one of the sales women empty handed with no clue where to even start. By time I went out the door I felt as if I were given a free one hour lesson on tea. Yes the tea is slightly more expensive than your crappy 99 cent tea bags but hey it's worth it! So put that earl grey artificial fruit flavor tea down and give this place a try!", "author": "Jacqueline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "While exploring Chinatown I suddenly decided a trip to a tea house would be quite enjoyable. I quickly grabbed my iPhone and loaded my Yelp app- which lead me right to Red Blossom. I was instantly intrigued by the walls lined with tea, beautiful handcrafted tea sets for sale and the overwhelming aromas. I instantly saw the sign for tea tastings so my friend and I participated.\n\n\nWe sat with a soft spoken yet eloquent and learned Chinese woman who reminded us both of Many Moore. She talked all about tea, asked us our preferences then gave suggestions. We tasted a white tea, a black tea and a jasmine tea. Each tea was brewed using a different method to show all the different ways it could be brewed. Each time she took the care and consideration to allow us to taste several different times, re-steeping the tea at least 3 times each.  My favorite was the black tea- bold, rich and full. We enjoyed the experience so much that I took home one of the handmade glass tea pots used in our tasting. It was such a charming yet informative little experience and I highly recommend it to everyone, from the tea novice to the tea master.", "author": "Sheena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Great tea selection, knowledgeable staff, affordable prices. What more can you ask for? I have drank lots of greens, oolongs in my life, so I thought the other ones were the most interesting, including Moroccan Mint and Lemongrass Ginger. You can tell their mint tea leaves are much different from the other ones. Also, the Lychee Black was really nice, I learned how to aerate tea in your mouth to experience the subtle flavors more intensely. Basically, just suck air into your mouth while you have some tea in it still, and let the liquid bubble in your mouth. Pre-packaged 2 ounce bags are available for purchase once you choose your teas. Containers are sold separately. They also sell pretty cute tea sets which a bit more pricey.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-04", "description": "If you're like me and was wondering whether to go here or to Vital Leaf down the street, go to Vital Leaf. \n\nDropped by here on the hunt for some tea. Place is very nicely laid out, but the service was underwhelming. I was the only person in the entire store on a quiet Wednesday afternoon, but other than a brief, disinterested hello and an offer to \"smell any teas I'm interested in,\" I got no help. \n\nI went down the street to Vital Leaf and had a much better experience, including having a chance to sample 7 different teas.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "This is one of the best tea shops! I went in here just to peruse their selection, I purchased the Organic Dragon Pearl Jasmine tea & the Dragonwell Chamomile green tea.\n\nAda was the rep who helped us. She was incredibly knowledge and explained the teas and processes simply but as if it were a science. She even sat down and brewed tea for us to let us try the teas to make sure we liked them. She was extremely helpful and her service was top notch.\n\nThank you Ada and Red Blossom tea for sending us home as happy customers!", "author": "Collette C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-03", "description": "My friend and I had an enjoyable and educational experience at this tea shop.  We were both scouting out the teas shops on Grant Street but found most of the shops to be filled with pushy sales people.  Red Blossom had helpful staff that was knowledgeable and passionate about their product; its great to encounter people who love their job.\n\nThe $30 tea tasting included 3 different types of tea with three serving per tea types for to 4 people.  Throughout the tasting we were given information on tea harvesting, tea brewing, and  various aspects that made the tea unique.  \n\nEach type of tea was available for purchase in different quantities depending on the amount of money you want to spend.\n\nI highly recommend you try this tea shop.", "author": "Chin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "Time for an update (7 years, later).  I'm still a faithful customer.  It doesn't get better than this!", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-08", "description": "This place was awesome an no pressure.  We came in unsure of what to expect.  There is a giant wall of tea canisters that you invited to open and smell at your leisure.  The helpful employees explained the arrangement of the teas, as well as TONS of information about the individual canisters we picked up.  While we were tea sniffing, another employee brought us a sample of a cold brewed tea (long brewed, kind of like sun tea), that was excellent.  Then a few minutes later she invited us to participate in an informal Chinese style tea ceremony where we tried a lighter style oolong and conversed about tea.  \n\nWe ended up spending about half an hour and $25 here, but never felt pressure to buy - these people are just really excited about tea and want to share their love of their excellent product.  They also have tea in all price ranges.  We bought a middle of the road tea for our middle of the road tea palates - I believe the bag of tea has about 32 servings in it for that cost.  Some were as inexpensive as $7 or $8 for that amount, and some were in the hundreds of dollars.  It just depends on what you are looking for, and the employees will be happy to help you find something suitable in whatever range you are working with.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "Had a strange experience here. I've been to a couple of tea places and am a fan of tea. I'd looked this place up on yelp and was excited.\n\nUnfortunately, my friend and I felt that the service was a little strange. The lady helping us did not seem particularly warm or friendly. When we asked if we could try one of the tea's, she said that they don't do brewing here because \"the whole place would smell like it\" (which seems a little odd for a tea place to be worried about..but hey). She then said that it tastes like it smells. \n\nMy friend then said she liked green tea and was hoping the employee would provide some recommendations but she just told my friend to open the canisters to smell the tea. \n\nI'm not sure if they were a little cold/not as friendly to us because it seemed like we weren't going to be huge customers, or if it was a bad day. It seems like the service is a little inconsistent (seeing the reviews below).\n\nWe ended up going a few blocks to Vital Tea and had a great time (and sampled a few teas there), and purchased tea there.", "author": "Yan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-25", "description": "RBTC made my day - almost hidden among the many touristy places in Chinatown, it suddenly reveals itself as a passage into another world of elegant teas. Minimalistic in its design the place focuses on the essential - a quiet oasis amidst a lot of visual and acoustic noise. \n\nJust entering and finding myself in this environment made me happy. And finding the Lapsang Souchong - which tonight turned out to be truly great - resulted in the solution for a personal mystery -  why Chinese supermarkets don't sell Lapsang Souchong: The amazingly patient young lady who helped me explained it with simplicity: Nobody drinks it in China - it's more a Russian thing - in China it is used to add taste to roasted duck dishes at best.\n\n'll be back soon!\n\n-------\nPackaging of the tea and presentation is excellent - also great for presents.", "author": "Flo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "I like it.  Young lady was very helpful and provided good advice to someone who is not experienced with tea.  I am happy with the tea she recommended and I bought.  I will order from web site in future.  I got Keemun tea.  Nice flavor and mild.", "author": "T B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Absolutely amazing experience. All of the employees were EXTREMELY friendly and knowledgeable about tea. I tasted a myriad of tea, from a bi luo chun to an aged baozhong from 1982. The store is absolutely beautiful and clean cut, and each canister of tea is clearly labeled with detailed information, everything from the specific mountain and region in which the tea was grown and harvested in to the production date. I ended up leaving with 2oz of charcoal roasted tungting oolong. This is one of those teashops where the employees objective isnt just to force Tea and random accessories down your throat. The people here are really passionate about tea and rather than doing the former, they teach customers about methods of tea preparation and culture. Definitely recommend this place to anyone who enjoys tea, from a casual tea drinker to a hardened tea hobbyist!", "author": "Julian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "Being of Taiwanese decent I thought for sure I'd know my teas...oh boy was I wrong. \n\nRed Blossom Tea Company went over the different kinds of teas and where you find them throughout Asia.  We got to sample 2 different teas and was delighted when Alice went over the proper tea brewing process with us...reminded me of how my grandpa use to serve us tea.  They have many varieties of loose leaf teas in the store.  Never thought I'd be that Taiwanese sucker that buys tea in Chinatown...but yes, the experience was so informative and the teas we sampled were great that we bought some tea.  \n\nOverall:  a great tea store in the middle of Chinatown.  Great place to get away from the hustle and bustle of Chinatown to learn about tea.", "author": "Shirley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Good teas. I bought a few different kinds to bring home. In particular, I got an oolong, jasmine, and lychee black. \n\nThe teas are premeasured in specific weights and so I wasn't able to make a strange request. If you're interested, I was buying tea in bulk for me and a friend and asked if I could get the 8 oz split into two 4 oz bags. They weren't able to accommodate that, but provided me with an additional ziploc bag so I could split it myself. Unfortunately, I made a bit of a mess at home, but that was my fault. :) \n\nThe tasting was informative and professional. The rep helping me knew her stuff and made it easy for me to feel like I made the right choice with my purchase.", "author": "Robin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "This place is wonderful. A great selection of tea, teaware, and very knowledgeable and friendly staff. Alyssa really took the time to help me find the teas that I loved! I will certainly be back!!", "author": "Ran D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "This place is great. The owner is really nice. The owner helps me out with picking out tea almost every week. Since my coworking space is nearby, it means a lot to me to have a great tea place around the corner.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-13", "description": "This is a nice date activity.  They let you have a sample of a bunch of teas so you can discover your \"tea palate\"\n\nIf you are very picky about teas this is probably a good spot for you.  \n\nJust know that the teas can get pretty pricey, so make sure you love tea.  If you can't tell a big difference this might not be the place for you.  \n\nI spent too much here.... The tea is good, but i can't tell a big difference between the expensive tea i bought here and some cheaper loose leaf teas my friends gave me.\n\nThis place might be super legit, but i'm humbly giving it 3 stars cause i can't tell a big enough difference for the price difference...", "author": "Steven F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Contrary to one of the previous reviews we were underwhelmed at vital tea leaf and welcomed with open arms at red blossom. They were extremely helpful and their knowledge of tea was impressive . We were positively infused :) .", "author": "Gavin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "I really like their teas! They had samples of the Jasmine Sparrow beak and that was amazing!!!\n\nThis place is the only place i'll get my tea's from now on", "author": "-Johnson- N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-23", "description": "I used to like shopping here, but lately I feel like they want me in and out as quickly as possible. The newer staff does not seem to want to allow you to taste the tea. I love the tea, but the service makes the experience suboptimal. I think the staff has an overinflated idea of the importance of this shop.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-27", "description": "We have loved Red Blossom for years, making it a regular stop whenever we go to Chinatown. Yesterday we went here with friends from out of town. The clerk accidentally gave us the wrong tea. When we got home and opened the tea, we realized her mistake. The manager refused to honor our purchase. When we called she said it was our mistake because we should not have left with black tea chai, knowing that we had asked for regular chai. This $20 error on their part has cost them a repeat customer. Their error left this customer unsatisfied with Red Blossom Tea Company. They have little regard for customer loyalty and offer poor customer service. Best of luck to Red Blossom! I recommend buying tea elsewhere. Buyer beware! Red Blossom does not care about customers.", "author": "Tyler R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "Let me just warn you, once you have their teas you'll never want to shop anywhere else AND you NEVER want a tea bag again. I admit it: I'm spoiled. My coworker took me to that other tea place in the mall in SF, where they sell bulk teas and it just could not compare to the quality and flavor of the teas at Red Blossom- i haven't found any place that can.\n\nNot only are they friendly, knowledgeable, helpful and family-owned but they simply have the best, freshest tea. They have so many different jasmine teas (i thought there was only one kind, but no) you'll never want a tea bag again, ever. \n\nIn comparison to other places I think their prices are reasonable, not overpriced for what you get. \nlove the lychee black and the zhi lan xiang-orchid is pretty good too. The smallest amount they let you buy will last a looong time even if you drink it every day.", "author": "Layla L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-06", "description": "We had a disappointing experience here. We have had great experiences at other tea rooms in Chinatown but wanted to try some new places, so we stopped here on the basis of the positive Yelp reviews. I am sure the tea is wonderful, but I wouldn't know, since we never got to taste it. We tried to get the attention of a saleswoman for about 10 minutes before she acknowledged us at all. When we asked to taste two varieties of tea, she told us to smell them instead, as the tea \"tastes like it smells.\" We asked again if we could taste it, which I don't think is an outlandish request in a tasting room, and she brushed us off. Then she asked us what kind of tea we like and where we normally buy our tea, and when I answered, she walked off without even answering, never to return. I got the distinct impression that her questions were a test we had failed, and that she had decided we were too pedestrian to be worth her time. Despite feeling uncomfortable, we still wanted to taste a few teas, but she never came back, so after standing around like idiots for another few minutes, we left. It's a shame, because some of those teas were intriguing, but I don't need to be treated like I am too dumb to qualify as a customer.\n\nInstead, we walked down the block to Vital Tea, where they were happy to prepare every tea we wanted to taste, and kindly and patently explained to us how to prepare them ourselves. You should go there instead.", "author": "Julie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "I have been going to Red Blossom for a couple of years -- I love their variety of Chinese \"candies\" and other edibles that are stored in containers in the back.  These Chinese candies are the kind that I grew up eating (I'm Chinese) and that my grandma would always get for me as a child.  So if you're into Chinese candies, this is a great place to go if you know your Chinese candies.  \n\nThey have a large variety of different teas, arrange on shelves from darks woody teas to the more delicate jasmines.  The staff are very knowledgable about every single kind of tea and can describe the flavor, texture and origin of anything.  It's almost like a museum -- so definitely grab one of the staff and they will be more than happy to give you a \"guided tour\" of all the tea selections.\n\nThe highlight of Red Blossom is their tea demonstration.  It costs $30 for up to 4 people.  And it's worth every penny.  One of the staff sits on a little banquet chair and you sit across from her on a little tea station.  They offer a variety of 6 teas (at least I think it was 6) and you pick 3 to taste test.  The staff member was very (as they all are) well versed in everything about the teas.  For about an hour or so, she showed us how to properly brew each tea and she serves you a little cup of each as she goes along  She steeps each of the 3 teas at least 3 or 4 times which gives you a sense of how the flavor changes with each steeping.  Needless to say, everything I thought I knew about making tea was wrong.  So if you're a fan of tea, this is a great way to learn and really discover how to make that perfect pot of tea.  When I have friends visiting from out of town, I always take them to Red Blossom and sign up for a demonstration.  The gal who guided us was well spoken, elonquent and a charming person.\n\nThere are several tea stores in China Town and I think Red Blossom is one of the best -- it's SQUEAKY CLEAN and the staff are always happy to help.  They also have a variety of tea pots/mugs, etc. beautifully packaged that would make great gifts or souvenirs for your out of town guests.  It doesn't stop there -- they also have a decent selection of ginseng roots that range from $28 a pound to almost $500 a pound (these are for the serious ginseng fan) -- it sounds horribly expensive, and it is but these prices for ginseng are market price.\n\nAll of their products are market priced -- this is not your discount tea shop.  But it's not terribly expensive so if you're a tea lover, this is the place to go.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-27", "description": "Wow... so dissapointed in this place. Came here with my dad who is an herbalist/acupuncturist and has been a tea enthusiast for years. Let me start by saying they had 6 people working, were not crowded, and told us they were too understaffed to provide us tea tasting, yet they provided it for 4 other people who came in! Pretty rude. The place is snooty and uncomfortable. The staff is overdressed, and the tea is overpriced. We went a few doors down instead to Vital Tea Leaf and spent over $200 after the staff generously served us about 10 types of tea, including their best (and btw Red Blossom said they do not sample their top shelf tea) and taught us all about the teas and how to prepare/serve them. If you want a perfect experience walk about a block more to 905 Grant and visit Vital Tea instead- much more welcoming, high quality, and fair prices.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "It's a temple of tea.\n\nMy family lived in Great Britain for a number of years so I'm more familiar with Black teas like Earl Grey.  I will admit I have a lot to learn about other types of teas. The staff at Red Blossom Tea was very patient with me as I stared longingly at the many containers of amazing teas.  Their English is better than mine so we had no issue with communication.  I asked so many questions my throat began to get dry.  I was even allowed to open the container tops to take in the aroma of each of their offerings.  Intoxicating.\nOne of the staffers brought me a sample of a tea in a small ceramic cup. They had just brewed it.  Such a nice touch and a fine selection.  I savoured every drop.  My throat was soothed. \nI found they had a large number of regulars who came through the door who greeted the staff and seemed to have a standing order for specific teas.  It's terrific to have such a loyal following in such a touristy area.  \nI was a little overwhelmed with the sheer variety of selections and I found myself reading all the details on each tea canister.  I decided to focus on tea which would be something I could have at bed-time.  One of the staffers (sorry I forgot her name) pointed to the low caffeine tea containers and the Rooibos in particular.  They still had a very large selection and it still took me some time to select.  I settled on the Rooibos.  It's a South African tea that contains a high amount of Antioxidants and a very low level of Caffeine.  Great recommendation.  \nI got a nod of approval from the lady who rang up my purchase so I felt pretty good about what I bought.  I'll bring my friends here.  Terrific Place.", "author": "Webb P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "The only problem I have here is when I have to decide what to buy. My family and friends have a running bet each time I go here on whether I will spend 100, 200, 300, or 400 (and sometimes, they even put me on a budget).\n\nTo those out there who are coming here to get \"medicinal teas\"...my suggestion would be to go to the tourist trap tea stores down the street. They have teas that are not as good quality and they will tell you anything you want to hear (I know this because I went into one of these stores and it just confirmed that I will stick with Red Blossom).\n\nRed blossom is for those who truly want a quality tea. If you tell them, what you are used to drinking, they will find a tea that might suit your taste buds and they will brew it for you to taste. The service that I always have is great and I feel so relaxed when I visit.", "author": "Lynelle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-31", "description": "I am disappointed at this place which is recommended by the Lonely Planet.  The assortment and branding of the teas are OK, but what I find disappointing is the attitude of the shop owners.  As I understand, this shop is run by a couple.  The husband was OK, didn't talk much though.  The wife was quite passive aggressive and gave me a blind eye when I asked her a question.  The most friendly staff was a young girl who should be their employee who had to be nice anyways.  What's more, I was not offered any tasting although I bought two different teas from them.   \n\nRegarding the price, it is very expensive.  Most of the teas are around $20-30/two ounces (or about 50g).  Some of the prices can be as high as early $40/two ounces.  I bought the best Japanese green tea in Japan Town, which cost me only about $18/200g.  That is to say the teas here is at least 4 times more expensive. I understand tea prices vary a lot depending on the type, the origin, the quality and the season.  But I seriously doubt that the teas sold here justify such a high price.  I am happy to spend more for the tasting experience, the knowledgable and friendly staff etc, but unfortunately these were just absent in my visit.  I really cannot recommend this place at all and I won't go back myself.", "author": "G C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-28", "description": "Walking by, the Red Blossum Tea Company can be quite intimidating for the average patron.  I had the pleasure of visiting this little educational interactive display courtesy of a Wok Wiz Chinatown tour.  \n\nAlice proceeded to explain the differences of the tea that the Red Blossum Tea Company offered and presented a wonderful sensory image as she steeped what would be a nice sample of their tea.  Explaining that she and her brother took over the family business and gave their store an HGTV remodel, you can see and appreciate the personal service that has made this family business such a success.\n\nAfter enjoying a few cups, you'll feel inclined to want to purchase a few bags of loose tea for your home consumption.  And if you're concerned that loose tea from a tea company will be expensive, think again!  Sure, they have some very expensive (out of my budget) type tea, but they also offer some moderately priced ones as well as some inexpensive ones.  Add one of their tea storing cans to your purchase and it makes an even nicer gift!     \n\nI would definitely recommend Red Blossum Tea Company as one of those places you must visit as a tourist or local of San Francisco.  You'll not only learn a thing or two about tea, but you'll also be embarrassed about all those other boxed tea bags you've been buying at your local grocery store.  It's about time one learns to better appreciate how tea should be consumed.  (I'm embarrassed that I only discovered this place now!)\n\nIf you can't visit the store, check out their website.  It's quite detailed with descriptions of tea and you can order it all online as well.", "author": "Teri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "Tea, tea, tea everywhere. These people really know their tea. Seriously, I've never seen so many teas before or since. Always come here when I'm in San Francisco.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-04", "description": "My husband and I went there yesterday and I can not say it better than any of the reviews here. We were a little intimidated at first but that quickly went away. Aida(sorry if that is the wrong spelling) was very helpful and taught us a lot about loose teas. We even had our own oersonal brewing lesson. It was very interesting to see the taste difference between the first time the tea is steeped and the fourth time. As I write this I an sipping my second steeping of their Emperor Pu-erh 1998. \nWe can't wait to go back.", "author": "Michele V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "My daughter Jasmyn gave me a tea tasting at the Red Blossom for my birthday and yesterday at 3p.m. was the appointed hour.  It was a beautiful experience.  If you like tea this is the place to be.\n\nWe were fortunate to have Alice guide us through the 3 teas my daughter chose: a dragonwell green, a Formosa oolong, and a tieguanyin oolong. Although green tea is my morning tea most of the time, oolong is my special treat tea.  Alice explained the different terrior and the different treatment of each tea once it is harvested.  Jasmyn has brought me back many teas from her travels in Thailand and Nepal, but the Red Blossom teas are the best I've ever tasted.\n\nAs important as the quality of the tea is the correct brewing.  Alice explained what she was doing and why during the multiple infusions; all done effortlessly as she was describing her trips to the different tea growing areas.  It was a delightful and delicious education.\n\nTip:  Avoid the noon rush and consider booking later in the afternoon when the store is not crowded.", "author": "joanne c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "I came into Red Blossom Tea a few days ago after a very long day at work, knowing that this would be just the place to cheer me up.  I'd been in more of a hurry the last time I came in, but this time I had more time, and Amanda was happy to sit down with me and let me taste a few teas.\n\nI learned a ton in my 45-minute visit.  Amanda explained the difference between all their types of oolong teas, among others, and showed me the best way to make a quality cup of tea in a gaiwan.\n\nIt was a wonderful experience, far more than just a great place to buy quality tea.  They also have a wide price range of teas, and they'll be happy to let you taste any so you know exactly what you're buying.  I ended up getting the **San Lin Xi, Spring 2010 oolong tea** that is an absolutely amazing high-altitude Taiwanese oolong tea, and the **Formosa Red No. 18** black tea that I tasted at Frog Hollow at the Ferry Building, and which is the reason I even decided I needed to track down Red Blossom.\n\nThose tea names, however, may likely be irrelevant by the time you may read this review, because their teas change with each harvest of tea.  However, I'm confident that Red Blossom is *always* going to have delicious, complex teas, and while I will mourn the end of my Formosa Red No. 18 the day it runs out, I'll find a new one to love at Red Blossom.\n\nCome in here when you've got time to do a proper tasting, and you'll have an unforgettable experience!!!", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "Good selection of teas divided by region and elevation. \nThe owner was very nice and gave us a good lesson about tea brewing and proper techniques, however they are kinda stngy with the amounts of different varieites you can sample, one or two and then they start making up excuses about this and that. Tea cups and porcelain pots are way overpriced.", "author": "Giorgio B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "Really impressive selection of teas, and lots of expertise.  A true treat.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-15", "description": "Was in a couple weeks ago, made a special trip just to buy tea from Red Blossom, have brought tea here previously, several times, love the hibiscus tea, was greeted by a woman that wasn't too interested in answering any questions my friend had about green teas, she was quite aloof, I finally after much frustration approached other lady, who was great, helpful and knowledgeable, the owner husband was changing lightbulbs, the owner needs to learn some basic how to greet, be helpful to prospective customers. She was very very rude. Time to find a new tea shop!!!", "author": "Sammie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "This place is serious about their tea. Went on a pretty crowded afternoon, but a staff member took the time to approach us and explained how to smell the teas and how they were organized on the wall. It doesn't seem like they give free samples, unless you buy a certain kind of tea and then they will show you how to brew it. \n\nThe price tags were pretty shocking and I didn't buy anything, but it definitely seems like you pay for the quality.", "author": "J E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "What a wonderful find. We did tea tasting and took home a couple of selections. Small family owned business.", "author": "E M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "If you are a tea addict, a tea newbie, or a tea scholar, this is definitely the place you want to be spending your time and money.\n\nWhen you enter the shop you will be greeted by a simple and humble looking shop. On one side there is a wall of tea containers that contain a plethora of tea leaves where you can pop off the top to smell and gaze at the leaves. On the other side are all the fun and authentic tea accessories such as fascinating tea sets, tea trays, gaiwans, measuring tools, etc. \n\nThe employees also make the experience fun as they are very knowledgable and helpful when trying to find a tea. Even if you are new to tea and wish to pick it up as a hobby, the employees are very patient and extremely passionate about tea. My best friends is a tea fanatic, whereas I am just a light tea drinker, but every time we go to Red Blossom there is a little something that both of us can enjoy. \n\nFor those of you who are interested in trying out the tea leaves prior to buying them, they have two small tables set up where they will provide a proper tea tasting. Employees explain the process as they create the tea and will share with you proper heating temperatures and steeping time. Don't be afraid to ask questions either because they will always give you a very detailed answer.\n\nThey also have a website that contains all the teas that come in from China and Taiwan so you can also order it to have it shipped to your home. However, if you ever get the chance to go to Chinatown, you must stop by this tea shop and experience a little piece of tea heaven. Don't be fooled by the simplicity of the shop, it is full of quality items just waiting to be discovered. :)", "author": "Alfred B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "I went here looking for some potent loose teas, on the recommendation of a co-worker, and was not dissapointed with my experience and take-aways!\n\nImmediately upon entering, I was greeted by a few shopkeepers from the back of the sleek space. Shelves of big canisters to the left, low wooden tables with Chinese tea service setups and shelves of pots, mugs, and other merch to the right. A young, very knowledgeable and upbeat Chinese girl approached me right away and made suggestions based on my statement that I need something strong that will be good for drinking all day. She sat me down to try a couple different teas,  and showed me differences in the tea based on steeping temps, 2nd and 3rd use of leaves, suggested I eat fresh tea leaves in my food (which I purchased -just cut a couple of months ago), and gave me some to try.  \n\nI did leave with $60 worth of green and oolong varieties, as well as a porcelain mug with a lid and porcelain straining insert that she said would be great for refilling all day at my desk (and it is!).\n \nI am a big tea lover; don't do coffee, and am really enjoying discovering places like this in SF. I am curious to visit others, and may have hoped for a more vast selection (although theirs wasn't skimpy),  but I'll definitely be back, particularly since I was treated with so much hospitality and left with new ideas about enhancing something that's such a constant part of my daily life.  Thank you Red Blossom! You really leave little to be desired.", "author": "Adrienne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "Really love this place.  Wonderful, knowledgeable staff, great teas and beautiful tea sets for sale.  We were so fortunate to sit down with Alice and have her demonstrate and explain her tea techniques.  She is such a kind, funny and knowledgeable proprietor.  We loved being in the shop, and will return on future SF visits.", "author": "David V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-04", "description": "I think this is one of the best tea shops in San Francisco! It's definitely one of my favorites. The staff is very friendly and knowledgeable! And their tea selection is top quality! I bought some wild fresh (sheng) pu-erhs there that are out of this world! Highly recommended!", "author": "Tim A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "They have very high quality tea and are willing to let you taste the higher priced teas before you buy them. Lovely oolong and green tea selections, as well as flavored and floral teas, such as che sen, lotus tea, and jasmine teas.", "author": "Vena V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-10", "description": "We stumbled upon this little gem during the Chinese New Year Festival. I am a huge fan of herbal tea since I do not drink caffiene. \n\nRed Blossom has a non-caffienated Chai (just the spices), which is unheard of! I have not tried it yet because I have two other favorites that I keep buying! \n\nMy favorite is the lavender tea. 100% lavender. It tastes like it smells, but it's not bitter at all. It's wonderful! It's relaxing and more flavorful than chamomile! My other favorite is the mint with roses! Their mint tea is top notch and so fragrant. Sometimes I just want to open the bag and smell it.... Other herbal teas include rose, jasmine, and chamomile (all pure flowers with no other teas added).\n\nThis is a hip little modern tea house nestled in with the older, traditional Grant Ave tourist shops. Such a refreshing shop. I have not sat down for a tea service yet, but I plan to on my next stop. \n\nThis would be a great place to do some Christmas/gift shopping. They will vaacum seal and bag your tea for you as you select it and they encourage you to smell the tins. You get a lot of tea for your money since they charge by weight. \n\nThe staff are polite and knowledgable on brewing techniques and any other tips you may need. \n\nThey sell an array of tea accessories like tea pots and cups and also have a large selection of ginseng.", "author": "Susanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-20", "description": "I'm not a tea expert, but Red Blossom Tea Company makes me feel like I know a little more than the average consumer.\n\nAs a culinary student in San Francisco, my chef instructor took me to this place for a tea tasting. They really know their stuff. They broke it down for us on how you should properly brew tea and which tea would probably suit your taste the most based on your preferences.\n\nIf you want to learn more about tea or get help finding a tea that will suit your taste, I really recommend checking this place out and talking to the staff. You may look at tea in a new light and find depth to this beverage.", "author": "Lih-Wern W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-02", "description": "Every kinda tea you could ask for! They are super knowledgeable and are willing to let you taste. I had fun. It was a great escape to the busy streets of Chinatown.", "author": "Ladybird G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "Having tried over a dozen providers of loose leaf tea in the US, Red Blossom Tea is hands down the best.  These people know their stuff.  They will take time to talk to you about them much like it's a bottle of wine.  \n\nTheir product itself is amazing.  It is some of the best loose leaf tea I've had.  The Dragonwell tea is the best I've had and people might be surprised what real Dragonwell tastes like.  Their oolongs are the best and their variety is incredible.\n\nYes, their prices are high, but to be honest it's worth it.  Not only that, Teavana charges the same prices and their tea is lucky to be half the quality of Red Blossom.  They are a small business and they know their stuff.", "author": "Drew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "We had a great experience with Red Blossom staff.  We were given a sampling of hot tea and proper way to get the most out of each brew. They spent time having us smell the bins and describing the flavors.  We purchased 4 teas/chais and enjoyed the experience.  The tea we tasted was great and we expect the same from our purchases.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "Sit for a spell, these folks will definitely stir you the right direction.\n\nTake your time hear, this place is a jewel.", "author": "Debbie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-12", "description": "Tourist trap.  He didn't even know what teas are for what ailment.  Give me a break.  He down played the value of tea in the medical value.  The gentleman that help me is photo here.  If you were trying to get medical teas or anything like taste.  This is not the place.  This is extremely well kept tourist trapped.  I'm not saying that the teas are bad quality.  I am saying if you are going to looking for teas for enjoyments and or health benefits don't come here looking for help or advice.  He's extremely rude and brushed you off as soon as you ask intelligence questions. \n\nIf you are  someone who  wasn't trying to get help on which teas that have  any value and not street- wise junk that a tourist wouldn't know from adam this is the estiblishment.  DON'T WASTE YOUR TIME HERE.\n\nI guess HINA'S TEA IN SACRAMENTO has given me the utmost tea experience.  She knows her teas.", "author": "China Doll B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-28", "description": "The Red Blossom Tea Company was stop #2 on my \"Eat my way through SF\" weekend tour. After a tea for two at Leland's we made our way to Chinatown to this store my cousin and friend had visited and been introduced to during a walking tour of Chinatown. \n\nI love the story behind this. A son and daughter took over the store their parents ran and modernized it. The place looks VERY different than its counterparts down the street. Mom and dad are still there, and on this day that we went in so was the daughter but the son was overseas tending to business. (They're very hands on with the whole tea leaf process)\n\nThe family is very willing to answer questions and let you taste any of the teas. After sniffing half the barrels in the store I bought 5 Green tea Jasmine blossoms which I can put in a glass, pour hot water over and watch the flower blossom like in Marie Antoinette!", "author": "Lori K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-15", "description": "The Dwight Schrute's of  tea!\nAre you a pretentious tea snob?  If the answer's yes, then you will make plenty of friends in this shop. I subtracted a star for smugness.\n\nIn their defense, they know what they are talking about but did they have to laugh at every question I asked?  I enjoy a good amount of tea but apparently, I know jack. \n\nThe tea we bought is incredible and I'm glad I stepped into this shop, but I will say that ol' ego of mine is deeply hurt by them.", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-04", "description": "A friend of mine was raving about this place, so when it came time to buy holiday gifts for some colleagues and business acquaintances, I went to check it out.  \n\nI trusted my friends' judgment regarding the quality of their tea, but I didn't realize how right-on he was until I actually visited the store. It is immediately apparent when you enter that this is not an apothecary  with herbs, but a tea shop that sells tea for enjoyment. If you're looking for steak, you wouldn't slam a vegetarian restaurant for not having it now, would you (Ok, maybe some of you nutcases would)?  \n\nHe introduced me to their Dragon Pearl Jasmine, which I got a ton (ok, not really a TON, but a lot) of--and they have 3 grades if you want to go totally high end, mid-range or low-end. There is a difference in quality and flavor--just ask them. \n\nSince then, I have tried their caffeine-free chai, their jade chai, the thai, and the vanilla orchid (a black tea). I am not a proper tea brewer (sorry Alice for violating your family's lovely tea!) and I often leave the tea steeping too long. Fortunately for me their tea is such good quality it is very forgiving and I have never had a bitter brew yet from the tea I have purchased here--which is less than I can say for other tea I've had. \n\nBe sure to check out their tea paraphernalia too, and if you have time, stick around for a tea tasting. You'll learn a lot. ;) They're also really friendly and warm. One of my new favorites.\n\nOh, and wanna know a secret? For a few bucks, they sell these little filter bags so you can travel with your tea and never drink bad tea again. I carry a few with me, along with a couple of different kinds of tea. Now all they need to start selling are little tea travel kits. Seriously...", "author": "N B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "There are lots of tea shops in San Fran's Chinatown, but this little shop caught my eye. It was pretty inviting, and like many of the others very small. Instead of a long tea bar this shop had several canisters of tea on the walls and you could opt to taste the different teas after you selected. The staff was very knowledgeable and I was able to watch the brewing of the tea and sample it before taking it home. I was also given directions on how to brew the tea in my set of teaware, so I didn't feel like I had to buy every tea product in the store. The even packed my tea in an airtight baggie, so it was super easy to put in my carry-on. I was all about this place.", "author": "Channa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "I wish we had this place in Columbus! Stopped in during a vacation to San Fran and was completely impressed.\nThe entire staff was very knowlegable and friendly. They helped me pick out some great gifts for my sister and educated me on the art of tea.", "author": "Iris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-02", "description": "No more tea bagging for me! I succumbed to the loose leaf craze today when I set foot into Red Blossom. Big canisters of tea leaves line the store from floor to ceiling, and tempting aromas escape when you open the lid -- from chai to caramel to nectar to mushroom. I was like nasal tripping.\n\nThe selection and scents were overwhelming until Jennifer grabbed a hold of us and gave us the 101. She sat us down at the cute little tasting table to try a Tung Ting Oolong, and it tastes like spring and smells like the gardenias in my grandmother's backyard.\n\nThe teas start at about $7 per quarter pound, which is about 32 servings, and each can be re-steeped 3 or 4 times for ever bolder flavor with each cup. Yes, as you can tell, I'm a convert. So don't tea-se me with your Mighty Leaf... I want the real thing!", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-08", "description": "Best tea house, ever. I have always received perfect customer service. The teas that are sold here are of the highest caliber. I have patronized red blossom for many years and will continue to do so for many more.", "author": "michael s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "One of the best places in Chinatown for tea and ginger.  The selection of teas is top notch and the sales people are friendly and knowledgable.", "author": "SF F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "I am sitting here looking at about $50 in tea from this place as I write this.  The Green Chai maybe the best Chai tea I have had ever. period.\n\nWonderful combinations of herbs and spices with teas.  Very helpful staff.  Increible tea tastings and lots of education.\n\nand the dried and salted fruits are really good too.  \n\nlittle spendy tho - (minus 1 star)", "author": "Samanta V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "This place is awesome for a true tea lover and a great place to learn about tea for the novice. They make you tea (gorgeously) and tell you everything, letting you smell and sample to hearts content. A lovely excursion.", "author": "Kerthy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "When i'm not in SF i order my pu-erh from Red Blossom by mail. They have the best teas in the country.\n\nThe service is amazing, these people know their teas. It is not a tea salon created for atmosphere, it is a shop created to get you the best tea. Sometimes the shop is full and busy and you will not get all the attention you wish. But go to buy a yixing pot and they will sit you down and serve you different varieties of the kind of tea you plan to use the pot for - last time we sat there for over an hour tasting teas and comparing, other customers would sit down with us for a while to get a sip.\n\nThis is the second generation of tea professionals now running the shop, very knowledgeable in storing and aging the teas. Some of their SF-aged pu-erhs are now being asked to be bought back to China because of how well they have developed.", "author": "nor n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-13", "description": "I found this place in my search for Thai Iced Tea. Luckily I found this place and was able to buy it because it can be pretty expensive at a restaurant or at one of those boba drink places.  You can even buy their tea online. The other thing that is difficult in making thai iced tea is finding a recipe online that taste like the thai restaurants do. Someone who works at Red Blossom makes it often and knows exactly how the thai restaurants make it. She told me the secret is to allowing it to brew for hours. She told me that she even let it sit overnight. \n\nThe woman at Red Blossom likes her tea a little stronger than I like mine. After experimenting a few times I found out that the only way to get it to taste like the restaurant is to let it steep for several HOURS or allow it to simmer for several hours.\n\nHere is what I do:\n\n1. 1 or 2 tbsp per cup of water\n\n2. Get water to a boil, turn stove off, add tea leaves, let steep for a couple of hours or so, bring back to boil, allow steeping again.\n\n3. Strain in pitcher\n\n3. I use splenda instead of sugar and that does not compromise the taste for me at all\n\n4. Pour half and half, evaporated milk, or condensed milk to taste. (I think condensed milk is the traditional way, but I use what I have on hand plus it has a stronger taste than half and half which is what I use)\n\n\nRed Blossom has many different kinds of tea and the people there are so helpful. I would definitely recommend this place to anyone who enjoys loose leaf tea.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-23", "description": "I used to come to this place from time to time.  The service is hit or miss, they have that  \"I am a tea expert, and you don't know shit\" attitude.  But the quality of the tea was consistent, so I still went back whenever I run out of tea.  During my last visit though, the service had gotten a lot worse.  I asked them about the increase in price, and they acted like if I can't afford it, then I shouldn't be here.  It's extremely unfriendly.  I understand that price is affected by the rise in Chinese currency, I'm not stupid, but the way that lady talked was humiliating.  I'll never come back, there are many many good tea companies in the city.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Red Blossom Tea is a shop of rare serendipity where if what you want is the world's best, you can simply go, enter and discover it.  High craft and selectivity meet farm products - like wine and chocolate, many steps must be done well to best meet nature's favor, create and bring us delicious products.  You need not be an expert to enjoy, and it helps just to be open to enlargement.  Alice and her crew are highly knowledgeable, service is professional and excellent fun can be had.", "author": "Walter H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "On a trip a couple summers ago, my friend and I wandered China Town and came across quite a few little shops that had tea or were considered tea bars, so to speak.  But as soon as we saw this store we just had to go in and see what they had to offer.   \n\nI have become more intrigued by teas in recent years, being solely a coffee drinker thus far, and found the people running this shop to be extremely helpful, friendly and knowledgeable.    They gave us a whole lesson on how to steep the fresh tea and allowed us to try any type we liked while there.  There was never a feeling of rushing us to make a purchase and onto the next customer.  They were sure to take their time and answer any questions we had.  \n\nWe both left as satisfied customers and embarking on a new era of becoming tea connoisseurs.   I will continue to order their tea online and stop in my next time to SF.", "author": "Brooke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-02", "description": "As a foodie and a tea connoisseur, I have been enamored with the chrysanthemum (gok bo) teas that are served at Dim Sum and Chinese restaurants.  \n\nRather than eating dim sum or Chinese food daily, I prefer to be able enjoy the tea in the comfort of my own palace.  Thus, I set out to find some gok bo cha.  I go to every tea place that comes to mind including every Chinese grocery stores such as Ranch 99.  \n\nOn a random trek up to SF, I ran across RBTC.  I walk in with intensity in my eyes and my blood determined to find the euphoric tea.  With a huge sigh of relief, I come across 2 types of Chrysanthemum tea at the back of the store.  I bought a quarter pound of each to ensure I got the right one.  \n\nWill definitely be back for some refills...", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-08", "description": "I came here a number of times last year with my then bf.  We were always seated at a table and tasted at least three of their teas before we would buy several and be on our way.  Always a pleasant experience.\n\nBut all that changed one day, and with it my opinion of Red Blossom.\n\nMy mom was visiting from out-of-state.  I wanted her to have the same delightful experience I had coming into this tea shop.  My brother loves tea and she was hoping to buy him some for his birthday.\n\nWe go in and the store is empty of customers.  So, I politely ask if we can try two different kinds of teas, since they obviously aren't busy.  The woman who usually served my bf and I was curt and would not let my mom and I taste any of the teas.  I've come to the conclusion that you have to prove you have money by regularly going in and spending a fortune, as my then bf did, or you don't get that same privilege.\n\nI was sad and disappointed that my mom didn't get to have the tea tasting experience.  But then we went to Far Leaves Tea in Berkeley, and that made up for it.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-19", "description": "One of my first trips to Chinatown found me at Red Blossom as I wandered around looking for places to taste some tea, and while Red Blossom tea doesn't have quite the tea tasting setup that Vital Tealeaf does, the selection of teas and helpfulness of the staff is impressive enough to warrant the rating that I'm giving. I purchased my first loose leaf tea here and have returned on numerous occasions since then. It's a must stop shop for any trip to Chinatown!", "author": "Zachary H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-10", "description": "The staff is friendly and knowledgeable. Don't be intimidated, just stop by for a sample. I would be surprised if you don't walk out with some tea. We bought a lovely teacup, got home, and found it was chipped. The owner had a new one waiting for us on our next visit.\nI can't wait to try more tea.", "author": "Mona W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-18", "description": "For me this place is kinda socially awkward.. you have all of these touristy run down stores selling trinkets and dried stuff you can't pronounce.... and then you have this store that looks like it could be in Los Gatos or some upscale area... we looked around and bf's mom decided on getting some dried hibiscus leaves... holla...", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "You need to know that Feliz this amazing Tea master knows her stuff in and out. I have never listened to anyone more passionate about tea than i am. Feliz is simply delightful and you will find yourself loving tea as much as she does. Our Tea sample session lasted almost 2 hours and i have to say it was worth every second. You really need to stop here and try some tea even if you are not a tea person, you will love it.", "author": "A R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-02", "description": "Let me start by saying I love tea.  I love the fragrance of the loose tea leaves, the subtle flavor differences between the varying styles, all of the little accoutrements to make a cup of tea.  I went in after a nice lunch across the street at Empress of China, with my mom, her friends, and my son, all of us tea drinkers, and Alice showed us the varying styles of dragon pearl Jasmine tea, which we just loved, and told us all about how it's picked, when, where, etc.  We found it very interesting.\nI don't think this place is pretentious whatsoever so the few reviews that say it is, I have to assume that maybe the writers are somewhat insecure.  Whatever.  The fact remains that their tea is excellent, and they have a beautiful store for you to sip and try the different varieties.  Just go-you won't be disappointed!", "author": "Holly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "I would never have discovered this place because trudging through crowded Grant St is never my forte, if not for specific requests from an overseas family member for a $285/tael Wisconsin premium ginseng.  As a side note, the first of those requests was a few years ago so I am over the \"these ugly things cost HOW MUCH?!?!?!?!\" stage.  \n\nBut after so many visits, only recently I realized that those massive canisters stacked against the wall up to the ceiling contain premium loose-leaf tea (I have tunnel vision) and only then I got the idea to try some of them out (I love free stuff) whilst the staff were painstakingly putting those overpriced little things in their packaging.\n\nTheir teas are no joke - some came with eye-popping price tags.  I settled for a quarter of a pound of the (white) dragon jasmine tea and a tea infuser, and after signing the credit card slip, I couldn't help thinking that, as much as I hate to admit, these guys do make Teavana look like a fast food chain.", "author": "Ange L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-04", "description": "These guys deserve 5 stars. They deserve every one of them. Their service and knowledge of the product are unparalleled (there's even an herbal pharmacy in the back),  and the overall quality of their product cannot be beat (seriously).\n\nHowever the store can be a bit cramped and not every tea is available to try before you purchase. But that said, if you want quality service and quality product, Red Blossom simply cannot be beat.\n\nOh! Also, the staff is extremely helpful and polite. Really. Super nice folks.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-05", "description": "Lon ago, when they were named under a different name, and the daughter had to just put everything into inventory, I wandered in, new to tea, willing to try, looking hopeless and uncomfortable due to the wet socks and soggy coat.  Alice ( I believe that's her name) gave me a bucket for my umbrella, a napkin to wipe the rain from my face and some green tea with ginseng, just so I can ward off the cold.  She showed me white tea peony, rose scented black, lychee, thai tea (unsweetened), jasmine scented pearl dragon tea, yin hao green, sencha in the powder form good enough for traditional tea ceremony, and as she rolled the names off the tip of her tongue, I was silently crying for I was warm and listening to poetry.\r\n\r\nReally, you can't find anyone more friendly and passionate about tea.", "author": "Tangerine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-25", "description": "I have to add my voice to the chorus of praise for Red Blossom.  I wandered in because I could see that they had the good sense to store the bulk tea in light-proof stainless steel containers instead of tea-killing glass jars, and found them friendly, helpful and very knowledgeable without being condescending.  I bought some Gu Yu-class West Lake Longjing,  better tasting and less pricey than a similar grade from Teance, and saved myself a trip across the Bay.", "author": "GarySoup I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-24", "description": "I'm a recent arrival, and i must say that my love for this city was consummated with the discovery of this tea shop that sells ounces of loose leafs with prices approaching those of crack.\nI was bumbling about at the Autumn Moon Festival this weekend and ducked in from the crowded street to be pleasantly greeted by a wall covered with selves stocked with canisters full of the leafy goodness; veritable tea porn to an aspiring aficionado like myself. Even though the store was quite bustling because of the Festival, the staff was very attentive and considerate. I only picked up some jasmine this time because of familiarity, but i'm looking forward to going when it's a little quieter and asking the staff to turn me on to something new.", "author": "annie d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "The lady with a smile like Mandi Moore is so helpful!", "author": "Caroline B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-31", "description": "I love this place! \n\nThe interior is clean and organized with labeled barrels of tea leaves.  I think this is why I was drawn here initially....OHHH CLEAN!  \n\nDon't be intimidated if you don't know anything about tea.  The owner saw that I was trying to decide what to get, and came up and helped me out.  He's very honest and knowledgeable (he REALLY knows his tea), and doesn't push the high priced teas (unlike the Dragonlady at Ten Ren..ugh review to come later).   \n\nI ended up with a bag of very reasonably priced middle grade green tea.  I'm used to drinking green tea that my family brings from Beijing's finest tea shop, and couldn't really taste a difference.  Time to tell my parents that they failed at raising a refined Chinese daughter.", "author": "Tinny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-13", "description": "I very much liked the place, although my girlfriend thought the lady came across as snobby  - but I thought she was more informative and educational.  If you buy a premium tea, you get a free tasting.  The tea selection is great and the quality of their teas is very high. \n\nIt was easy to tell that not only is the staff very knowledgeable about tea, but they are also passionate about their tea and share that with their customers.  \n\nHighly recommend.", "author": "Randall S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-11", "description": "I visited this shop while in San Francisco as it came highly recommended by other tea dorks that I know. Truth be told, it seemed as though Red Blossom had some fine teas, but I was a little underwhelmed.\nIt was crowded with people, which I guess is a good indicator that this place is well received. However, I didn't really appreciate the general attitude of the staff. While admiring teas, I was approached by an employee who looked like she had intentionally dressed as Indiana Jones that morning (I assumed it was a uniform of sorts). She answered a question of mine rather condescendingly, but continued to follow my friend and I around, as if we weren't trusted to touch anything. I went towards the back of the shop, where I saw herbs, and we were basically ignored by the gentleman there. I felt in general, from the interaction I did have with the people here, treated as if I didn't know the first thing about tea. \nI had planned to take a few lovelies home, but left empty handed with absolutely no desire to go back.", "author": "Sarah Louise F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-20", "description": "The place was full of middle-aged yups on their cell phones. We were hoping to see a wide variety of greens, and perhaps take part in a tasting. You can handle the tins (I saw more than one drippy nose smelling the insides of the lids), but you can't drink the tea!\n\nA small bar in the back for tastings would be phenomenal. \n\nThe place is very minimalist in decor, which is fine. A woman (perhaps an owner) was gracious in asking us if we had questions, and offerering a small cup of a ready brewed green with rose infusion (actually not bad).\n\nSo to come here, you should know what you want, or judge it by your nose. And be prepared to unwillingly learn cell phone snippets about the lives tourists and natives alike. The tiny space holds your ears captive.", "author": "Karen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-03", "description": "We have been to this tea shop many times while  in the city on business. If there is a tourist crowd inside we walk around until they're gone.  I think they are on the China Town walking tour route.  It's small so you won't get the attention you need if a lot of people are around.\n\nThat said, we love this place.  The brother and sister who own and run Red Blossom are always informative and attentive with us.  We usually go with a different \"tea focus\" at each visit.  Sometimes Oolong,  other times black, green or white. So many different taste profiles! The owners usually have good suggestions.  Typically they'll brew a sample of our choices to help us make our decisions.  Many times along with our purchase they will give us a sample of something new to try at home.\n\nAlso, they have these great inexpensive red metel tea containers in various sizes.  I highly recommend these if you are purchasing teas to help keep them fresh.  Oh and I agree with previous reviewer, in that the owners do not steer you to the higher priced teas, they seem to be able to gauge your pricing/tastes needs after talking with you awhile.\n\nReally a great experience if you're in China town whether your new to loose leaf tea drinking or are diehard expert.  We always have good time here and learn/taste something new everytime. \n\nThe only sad thing is that we are not traveling to the City as often as we used to, but the upside is that they have website which we plan to order our tea from in the future.", "author": "cathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "Super friendly staff. They were serving 40 yr old Oolong for taste testing to another couple and just offered us the 2nd and 3rd infusion while we were browsing and waiting on the sale staff to package up our bought tea. Very good quality tea. And they know their stuff. Highly recommended and **WILL** return for more", "author": "Rrr X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-17", "description": "Wow..this store is the most boring tea store I've been to. Yes, sometimes tea stores need charisma and charm to make it stand out from the crowd. So you know what is missing here? Yes, you said it..UNCLE GEE!!\n\nGo to Vital Tea Leaf for the real exciting tea experience. Only go here if you think you are an arrogant tea snob who is only interested in actual years, harvest dates, and different grades. Boring. blah blah blah. \n\nYes, Red Blossom Sucks. Peter sucks too. And his sister..wow..don't get me snoring here. zzzz\n\nAnd, oh yes, one more thing...where is your BLUE TEA?? Get some blue tea god damn it!", "author": "Run Sing M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-10", "description": "About a year ago, I became obsessed with tea. I went through the yellow pages and the internet, made a list of every tea cafe and tea shop in San Francisco, and tried every one of them. \n\nRed Blossom was the best. I buy 90% of my tea from them. (I also get a couple from Imperial Tea Court, my 2nd fav place.)\n\nWhy I like it above all the others:\n- Very high quality teas, stored properly  \n- Good selection of types of tea at various price points\n- Excellent value for the money, both for the teas and the yixing teapots \n- Friendly, knowledgeable owners, who will take the time to tell you about the teas, show you how to brew them, and give you tastes of the ones you're interested in. No attitude, just people who are passionate about tea.\n\nThe shop is very pleasant, clean and light with a soothing decor, and the teas are all in stainless steel cannisters. Each cannister has a label with a detailed description of where the tea came from,  when it was harvested, and what its aroma and taste are like. The shop is narrow and so can get a little crowded when they're busy.\n\nI have spent many happy hours here  - sniffing the teas, tasting the teas, and learning about them from Alice. I love this shop.  Every morning when I make my favorite, the alishan spring oolong, I am so glad I found Red Blossom.", "author": "Debi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "amazing teas!!! some of the best ive EVER had!!\n\nsuper knowledgeable, friendly staff\n\nstore is a trip.. clean and serene.. right in the middle of chinatown\n\nexpensive but WELL WORTH IT!!!!", "author": "jo jo j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "What a gorgeous store. I popped in here one weekday afternoon looking for some loose Genmaicha. The staff was so kind and knowledgeable! \nAnd it is as delicious as the tea I have with at my local sushi joint.\nI'm definitely making Red Blossom my only tea stop spot.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "A while back I took a Chinatown tour.  Some very good times...  Probably my favorite stop was the Red Blossom Tea Company.  When they said, \"visiting tea shop\" this was not what I was expecting.  The store was beautiful, their selection was fantastic, and the service was great.\n\nWe had a tasting of tea during our tour; the owners daughter talked at length about the different varieties and origins of tea...\n\nI returned after the tour to buy some tea.  I couldn't imagine myself spending hundreds or even thousands of dollars on tea...who knows, if I had the ability I may have...but I bought an entire pound of green tea for $12.  I then went on to pass out little bags of said tea to friends and family.  They even give you a free tea strainer with your purchase.\n\nOh, and if you want an interesing story about tea-mistaken-for-weed, contact Lori K.", "author": "Melanie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "*Special Note: Don't let the tourists fool you -- ignore them -- go in as a local, talk to Alice -- this place may be on the tourists' map, but it is not _for_tourists_*\n\nI drank tea before I came to this place, but now I am a tea drinker. Subtle, but important distinction. Bagged green, English breakfast, or random *cha at the local sushi joint was all I knew. Pearl Jasmine was the height of tea-cool-ery for me. Clearly, I was lost in the desert outside the walls of the lush Tea City. \n\nRed Blossom lead me into the abundant bazaar of the that city's streets. Alice's introduction to Oolongs and Puh-Erhs changed my morning-beverage world the way my first sip of a Belgian Triple changed my evening's. Let her lead you, folks -- just saunter right up and say \"Alice, please recommend some amazing tea.\" She'll steer you right, and won't overcharge an undeveloped palate -- many times she has recommended a lower grade tea, sensing that I might not be ready to appreciate some of the extra $4/oz flavors of the highest grade stuff.\n\nThough they carry the full range of teas, they specialize in Chinese teas and show a clear disdain for Japanese greens and English blacks -- I can't help but agree with them at the moment, though maybe I need to be schooled by a less biased source. However, trust Alice and you will taste teas you couldn't have imagined were possible.\n\nTheir prices are as fine as their teas and a perfect value for the introductory to the hard-core tea lover.\n\nI repeat myself: the greatest thing about this place after the remarkable taste of the teas they vend is the personal attention of the incredibly knowledgeable and friendly Alice -- Share some tea with her!\n\nAnd again about tourists: This is one of those strange places where local excellence and touristical big-footing cross paths. Of the many times I've been to Red Blossom, only once has my stay been marred by an ignorant cart-load of Patagonia-wearing camera-toters --it wasn't that bad, and besides, I like to see the Blossom get all the business it can.", "author": "John F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-28", "description": "Wow... I used to have such high regards for Red Blossom Tea Company but after my last trip, I'm sorry. I don't think I will ever go back.\n\nRed Blossom has a lot of good quality teas and cheaper prices than most of the Chinatown area. They take care of their stock well and have a lovely interior. For this, I did regard them as a good tea store.\n\nHowever, their level of customer service is incredibly subpar, especially when it comes to tea tasting. I understand not wanting to allow everyone to taste your stock, especially when you will get people who only want to taste and not buy, but I walked in with the explicit statement of \"I want to buy a white tea, but am not sure which one\" and was wanting to taste samples from that family so I could purchase one that I liked. Considering they are a store that offers free tea tasting, that seemed like a reasonable request. \n\nThey allowed me to try their Silver Needle b/c another group was already trying it out, but after that, the lady refused to help me b/c \"trying teas from the same family doesn't allow you to taste them\". Funny, b/c they had no problems doing that last time when I was purchasing a green tea. (Last time also, they told me I could only try 3 and the time before, they told me I couldn't try a white tea after trying an oolong b/c the taste of the oolong would drown out the white (at least the last statement made logical sense b/c the oolong's taste was strong). I do wonder if they're just pulling excuses out randomly...).\n\nI told her I wasn't about to purchase the Silver Needle w/o trying the others first, especially when the Silver Needle was priced at $165/lb while the others were around $50/lb. That's when she made that excuse.\n\nSo in the end, I left without buying anything and went down the street to Vital Leaf (which, by the way, I had to tell them to stop offering tea tastings b/c they were being so generous with them). Vital Leaf is way more expensive than Red Blossom, but for their services and welcoming attitudes, I was happy to purchase some teas from them. \n\nHonestly, without the hospitality, why should I buy any tea in an expensive tea store? If you don't let me try, what's the difference from me closing my eyes purchasing a box from a typical Asian market?", "author": "Theresa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-10", "description": "I've lived in SF for 3 years, searched all over the city (looking for a local and non-touristed place), and I found Red Blossom. As some others have said, don't let the tourist neighborhood fool you. This is the best place in SF to buy and learn about loose leaf tea. \n\nAlice is wonderful (and Peter). If you want high quality tea or you want to start learning, go here. Spend some time smelling the tea and ask questions. Alice gets really excited and will tell you so much so you can learn so much. \n\nI've been a customer for 3 years. I've learned so much. I love tea and love shopping here more than any where else. \n\nOn a practical note, they have a wide variety from the basic (aka affordable) to the highest quality (expensive). If you want to try tea (to see if you like it), then start with the basic stuff. Then slowly move up. As a rule of thumb, if you like the smell, you'll usually like the taste.", "author": "Kenneth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-07", "description": "Why? Because they spent a ridiculous amount of time serving us a beautiful oolong which he readily admitted was his favorite. Because I didn't have to buy anything right away.\r\n\r\nBecause boutiques that not only whole-heartedly believe in their mechandise but that trust you will be back again are a rarity and worth patronizing... \r\n\r\nWhy buy tea somewhere else? Ignorance isn't much of an excuse after you've read the reviews, buddy.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-07", "description": "BAIT AND SWITCH!!! I selected a mid-to-late 90s Puer, which cost over $40 for a quarter pound bag. They went away and made a bag of it and then came back, always a very bad sign. Sure enough, when I was back in the office I opened the bag and found a tea no more than 2 years old. You can tell right away because of the earthy smell, completely different than in the store. It's like the difference between smelling a wet and a dry blanket. There's no way to verify the tea without opening the sealed bag. They obviously hide when they pour and seal it so they can trick you. I took it back and they said over and over \"absolutely no return for any reason\". What a scam! Then I took the tea to two other shops and asked them if they could match it, just to make sure I wasn't losing my sense of smell. Both places offered me their youngest Puer. After I told the story to the third place they said Red Blossom has a bad rep and actually offered to exchange it for the real thing. Now I go there instead. IF YOU GO HERE DON'T LET THE TEA OUT OF YOUR SIGHT - DON'T LET THEM SCAM YOU", "author": "Mulberry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-01", "description": "Came here for a work event and had a nice tasting.  It was very educational and I got some really great tasting teas from it.  Very pleased.", "author": "Harold B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "Great Atmosphere, Great Customer Service, Very Knowledgeable, Great Teas. \n\nA fun, clean shop to stop in, browse, and sample the exquisite and  some rare teas. Also, a great selection of high grade chinese herbs.", "author": "Michael Joseph Fitzpatrick F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-04", "description": "I am not a tea connoisseur by any means.  But I like a good green tea, and can tell the difference between the stuff here and the stuff at the supermarket.\n\nThe interior of Red Blossom is really beautiful, and the sales people are extremely friendly and knowledgeable.  They really know their stuff too.  When I went here with my girlfriend, she was able to talk to the proprietors in Mandarin and find exactly what kind of tea she wanted to get me to counterbalance the \"fire\" foods that I was eating (it turned out to be dried Chrysanthemum blossoms).\n\nIf you sit down at the table in the front, you can sample their teas and talk to an expert there about what kinds you like and they'll help guide you to a purchase.  The prices are reasonable too.  Five stars for Red Blossom!", "author": "Evan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "Must be the best tea house in SF. Peter is very knowledgeable, patient, and sure to set you up with a brew you will like. You can tell he really cares about tea, and wants you too, also. \n\nTake a visit and learn something new. Sure, the good stuff can be \"expensive\", but cheaper than alcohol, and a lot better for you!!!", "author": "Johnny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-05", "description": "My friend and I had a great experience here last weekend, when we spent almost an hour and a half talking tea with the young guy there. I think he told us his name, but I'm bad with names. Anyway, we were a pair of obviously non-rich, goofy, overly enthusiastic young ladies but he treated us to tastings of two different teas and we were there past closing, smelling the wares and eventually buying more than we could afford. It was such fun.\r\n\r\nI know the owners are yelpers themselves (at least the woman is) and are probably reading this - thanks for your time and consideration, you really made our day. \r\n\r\nThat being said, if you're going to go here, don't expect to be served tea (they do tastings, but this isn't a Starbucks) and expect to have your picture taken by random midwesterners. Just because it's in Chinatown doesn't mean it's a museum piece, people. A bunch of tourists came in and just gawked. So, that was kind of unpleasant, I guess, but it's not the company's fault.", "author": "Simone M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-20", "description": "Red Blossom remains my favorite place to buy tea on the West Coast. The store is attractive, the teas are very fresh and the staff is both knowledgeable and passionate.\n\nMy only complaint is that the store is located on the main tourist street in Chinatown. On my first visit, I walked in with my 3 Year old daughter on my arm and was greeted across the room with \"We don't serve tea here!\" Well . . . Books and covers . . . I started talking tea with them and before you knew it they were serving us tea . . . Lots of tea, tea that was hidden in the back, tea while unfolding maps and enough tea to keep us a just past my wife's point of patience for indulging her husband. While the store could have a slightly larger selection of Pu-erh, I won't fault them as all their tea was top grade and fresh. They also have a great selection of Oolong to boot!", "author": "M Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-30", "description": "Been coming here for years and the service and the quality of teas are second to none.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-04", "description": "We got a set of tea cups and teas as a gift from this place. We got the Dragon Pearl Jasmine which has quickly become an office favorite. Very flavorful and aromatic. They also curry accessorites from diffusers to teapots. Great place to stock up on all sorts of different teas.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "Teavana needs to be run out of every town it tries to get it's minions to follow 'cause this place is the bomb! Granted, there are loads of tourists and people who have no business sticking their noses in the tins and manhandling the teas in the back but I grew up with tea and I feel like it's a  place of peace when I walk into any medicinal/herbal shop. \nI wanted to thank Matt for dinner and since my wine knowledge is like that of a pretentious Wrigleyville yuppie (meaning I know my wine, but I can talk and buy a better game than I do appreciating it) I opted for leaves instead. And yes they have rolled leaves that blossom as they seep in hot water and they have the popular blossoming tea pot sensations but what makes me want to come back time and time again is the owner of the shop? I think he's the owner. I gave him a sample of what I was used to drinking but the shop I frequented was from D.C. and there's no way I'm going to find the Jasmine tea I use in my J.W. Gold Label from Safeway. He breathed it in and found me a suitable pairing and explained the subtle notes and intensity. Awesome awesome intensity from this guy! He'll look at the wall for a moment, grab the tin and move it away from himself as you take a breath in. I got dragon ball pearls and jasmine leaves for myself and Matt. I'm so impressed with the knowledge and the time he took to explain about the process even though the store was extremely busy and I'm sure he could have made a killing with every tourist that walked in. \nI still have a few pearls left and the aroma just fills the kitchen. I can't wait to go back and try some new ones. They give you a handy little bookmark to help you differentiate teas and seeping times. The place definitely isn't like the normal Chinatown tea shops you're used to seeing and it's almost chic I'd say but don't let the new decor throw you off-it's old school at heart. Good luck finding parking and finding this place though. I almost hired a sherpa to find this place but again, it's well worth it.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-23", "description": "As a form of apology, the owner/taster sent some free tea samples with my friend for me to try. It was a nice enough gesture to warrant an additional star. I appreciate the apology. The substance of my previous review stands. I won't be shopping here.", "author": "S. T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-14", "description": "A fan of loose leaf teas?  Well look no further.  The newly renovated store front is a tea-lovers paradise.  The staff is super friendly and super knowledgeable about all their teas.  They also have demonstrations and tea tastings in case you have problems deciding from their huge selection.\r\n\r\nIf you need a suggestion, go for the Dragon Pearl Jasmine Supreme.  It's very tasty!", "author": "Betina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "Growing up with an English father I am a lover of tea.\n\nRed Blossom Tea Company has tea for people who know how to appreciate tea.\n\nMy favorite new tea that RBTC turned me on to is Pu-erh, it is fermented and very earthy with no sharpness.\n\nAlso just did a tasting of the Jasmine that comes wrapped like buds, it was so tastey and smooth but too expensive for me.\n\nThe more regular types of tea are affordable though, i just got a half pound of Black Rose tea for $14.", "author": "anders h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-01", "description": "Strolled in here today with my dad who's visiting from Hawai'i...\n\nI casually heard about this place, but forgot that it was on my to-do list.\n\nWell, I fell off of my rocker today!  I received an excellent mini-tea education as well as a fabulous tasting!  The shop owner, well, she was amazingly knowledgeable to boot...:)   \n\nI am passionate about this place and will return many, many more times.\n\nThis gets my 2 thumbs up!\n\nPatrick :)", "author": "Patrick I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "I like how Red Blossom has been able to transform from their old incarnation of a traditional Chinese herbal store to this sort of new, clean, and much hipper tea store. There's nothing new about the variety of Chinese teas here, but the packaging and clean-up at the store really do make a difference.\n\nI bought some of the blossoming jasmine tea buds during my first visit here, and my BF got some \"Eight Treasures\" tea, which brews up a tasty, probably-good-for-you pot of slightly sweet tea. The prices are pretty decent as well.", "author": "Andrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-29", "description": "I'll agree with Brandon about the quality, but it's not true--you can get tea for $3/oz to $15+/oz. If you're a serious tea drinker, and you don't like fruity herbal blends, then this place is great for you. it's a family-owned business and the younger generation has now taken over. One of the proprietors is a wonderfully geeky, well dressed young Chinese man who knows his stuff. They don't serve tea here like other places in Chinatown, but they will provide you with a tasting if you're considering buying a significant amount of something at least minimally pricey, or just to narrow down your choices. This is serious business--they know what they're doing here, and they store their tea properly. They spend alot of time with customers.\n\nHighly recommended.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "I grew up the Bay Area and try and get back as often as I can. I found this place by a complete accident about a decade ago and am I ever glad that I did. I am a big time tea drinker (I order tea from China by the Kilo) and every time I am fortunate enough to make my way to The City Red Blossom is one of my stops. As others have said this place is the real deal and there is something for everyone from less expensive . There's something available for everyone who has a love for tea. Red Blossom has a great reputation in internet tea circles though I've never ordered from them online but if their on line business is anythign like th attention they give their stores those ordering on line should be just fine.", "author": "Bert A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "I think this place deserves five stars for every other tea I've tried there. When I visited the girl I was talking to knew a lot about tea. There was only one other person in the store so I received adequate help. I had spent all day walking around SF buying stuff so I decided to get an inexpensive tea. I got a pouch of Jasmine Sparrow's Beak for about $11. I was really disappointed with this tea. I thought it was a 2/10. However every other tea I've had there was very good.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "This is a very whitey-friendly tea shop in Chinatown. (I say that as a whitey.) Super clean, well organized, mod decor. The sales clerk wasn't crazy helpful, but I was able to buy my mom a nice gift in under five minutes. I'll let you know how she liked the tea; I ended up getting the Golden Monkey black tea after I told the clerk that my mom usually likes English Breakfast. I don't know a lot about tea, so hopefully that was a good recommendation.", "author": "Emily A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "My boyfriend got me a wonderful, unique Valentine's Day gift from Red Blossom- several kinds of yummy oolong and green teas. When he wanted to go back, I really couldn't resist, and ended up picking out one of the beautiful infusers to go with my tea as well as some canisters. On the weekends (I think) they give you free samples with your purchase. I recently visited yet again to pick up some more tea- an organic qi zhong oolong (which I discovered I loved when I tried the free sample I had gotten) and and Eastern Beauty. \n\nThe staff is really friendly and helpful, and very respectful and knowledgeable. The shop itself is really nicely done, clean and bright. They have a great selection of teas and accessories as well. It has certainly become my favorite place to buy tea (and take friends and visitors).", "author": "Barbs J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-16", "description": "Great place to find premium teas and teaware at decent prices.  They have a great shop if you happen to be in Chinatown, but their website is equally effective.\n\nOne of the very best tea shops in the Bay Area!", "author": "Chris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "Ok, im a new tea drinker...its my attempt to try something different and stop drinking coffee. I was lured into it by Uncle Gee's demo..but my yelp reviews lead me to Red Blossom. I am a very happy customer...in fact a bit too happy...i think Im strung out on tea now.  Just came from the shop, got my fix...picked up the Jade Green tea Chai, the Black tea Chai, and a sample of the Amber Oolong Ginseng tea...The customer service is amazing..and they are great at educating you on the basics. I was assisted by pretty much everyone at one point or another...my thanks to the cute little redhead that helped me pursue my new habit.", "author": "Jack F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-07", "description": "Considering that the quality of the Natural Tea Company has seemingly declined in recent years, and that I can now hold my own in pretentious tea-offs, the Red Blossom Tea Company is a great place to buy tea. They usually have a wide assortment that's actually organized in some meaningful fashion, and the staff is cordial, if not actually friendly. They can still be aloof, and somewhat belittling, but for the most part they are easy to talk to. They do offer tastings, but with less enthusiasm then other tea shops. I do like them, but with reservations.", "author": "Herbert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-30", "description": "Where i get my genmaicha fix in the city, get gifts for my sister, and occasionally knock over an entire set of fixtures with nary a glance from the proprietor....\n\nPlus this place gives me an excuse to walk through chinatown...\n\nLove it!", "author": "D S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-05", "description": "I walked by this place while perusing the CNY fair booths.  Nice decor and catered toward visitors.  We manage to buy some chinese herb at this store as well.  \n\nwebsite:  www.redblossomtea.com", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "Not much to add, but I wanted to thank the reviewers who took time to post about this place.  I'm sure the folks who babysat my daughter and my dog would have preferred wine as thank you gifts, but since I can't carry that on the plane, they all got tea with strainers.  Even though the store was crowded with Saturday shoppers, Alice managed to help me with selections, have my gifts wrapped up, serve us some samples, and tell us a bit about the shop.\n\nAlice and her brother were both very welcoming, and I saw no sign of the pretentiousness mentioned by a few reviewers.  \n\nI'll be placing some orders online when I run out of my stash!", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-04", "description": "Good source for chinese tea.  Most of their tea come from Taiwan and China.  \nIf you are a fan of tea or learning about tea, Red Blossom won't disappoint.", "author": "N. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "I'm all about service, quality of products, and the appeal/design of a place. Red Blossom Tea Company did not disappoint. Since I live relatively close, I always bring my visiting friends (even my tea loving sister) and they always leave with buckets of things. I truly enjoy the staff for their service and knowledge of products. They offer tea service to help you decide. \n\nThey really know their teas and offer some great teas for a great price. They're tea-crazy, but maybe we all should be.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "I HEART Red Blossom!  One of my fav's is their \"Rose Black\" - which is a black tea scented with rose petals served nice 'n HOT... ahhhh, dreammmmy", "author": "Nikki B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-24", "description": "My friend and I came in and was greeted by the very knowledgable staff. She told us about the best green teas they had and if she wasn't sure about something, she asked her supervisor. We bought the the San Lin Xi Spring 2009 Oolong Tea and Ming Qian Dragonwell - Shifeng Green Tea. The prices were competitive and they explained the difference in price. They did a sampling for us and did a more traditional way of serving teas with gaiwan tea and tea trays. It was a great, fun experience. I loved it and learned a great deal more about teas.", "author": "Linda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "I was never a big tea person. Coffee was really my poison.  Then I met Alice, she maybe the most knowledgeable person when it comes to tea. She was just amazingly sweet and helpful. I walked out of there with 3 bags of tea and I've been drinking it since. This place is just great inside. You are transported into the world of teas and you kinda don't want to leave. The staff is friendly and really wants to find the best blend for you. They are honest and don't just have you buy anything they ask the right questions. They want to make sure the tea you walk out with is the one for you. Go enjoy, ask question, and buy!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-13", "description": "Red Blossom does it right.  Alice and Peter are very friendly and do a great job of letting customers taste different teas, and guiding them through the world of of tea varieties.\nThey may not have the best teas in the world, but they do the best job in San Francisco.  For quality and price, their Taiwanese Oolongs are topnotch.  \nAlso, no pretense, no obscuring of information, and no misleading stories. Just good tea and great people.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "Being a tea newbie, it was a little intimidating to be faced with so many teas.\n\nThe staff were great and talked to us all about the different teas, got us smelling all the lids and after talking, sampling, and smelling, we walked out happy with our fave teas of the day.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "I took my three year old granddaughter to Red Blossum today and we had a great tea tasting with Ada.  The tea was delicious, the service superb, and my granddaughter loved it as did I.  Ada was very knowledgable about their teas and how different teas were made and grown.  It was a fun, special experience and I highly recommend it. It is not touristy even though it is on Grant.", "author": "Carole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "Are you a tea fanatic? A  small space, clean and modern Asian decor. They have a very polite staff. All of their teas are very yummy and they have a wide variety. They will do tastings with you so you can figure out which one you wish to purchase. Just now that when it is busy it can be a bit cramped so your tasting may not have as great service or places to sit. If you see this place not full, definitely take advantage!", "author": "Ella V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "I am a fairly developed tea snob, and Red Blossom is the best tea shop I have ever found. Their selection is far more focused than an encyclopedic mail-order vendor like Upton Tea (also highly recommended), but the quality, service, and atmosphere are fantastic, and the prices very respectable.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "We love this place! Sure there are others out there, but for whatever reason this place seems the most upscale and detail oriented Tea purveyor. We always set aside time to sit and taste a few of the tea's and always walk away happy with our purchases. Great selection, better service. If you want to try out some tea and get top notch everything, go here.", "author": "Sean F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-31", "description": "Friendly service and very knowledgeable staff.  Red Blossom has good selection of teas, including traditional, herbal, and special blended variations. They also have other Chinese herbal ingredients. While small in size, the store itself is elegant and well organized.  The even provide a nice selection of traditional Chinese tea cups and tea sets.  My only wish would be that the place were larger  (a Chinese tea house if you will) that would offer more sit down space for imbibing teas. But ironically as may sound, Chinatown may not be the ideal location for a Chinese tea house. For Chinatown, this small tea company cannot be beat.", "author": "Gregory C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "The tea of course is great, but it is the experience at Red Blossom that makes it memorable.\n\nThe level of attentiveness, knowledge, professionalism and friendliness of the staff is incredible. I feel like a regular customer or friend of the family even though I only shop here maybe a few times a year. Alice remembers my preference in green teas and points out the new arrivals of the season, makes recommendations, and invites me to sit down for a tasting.\n\nOver the years you can tell their business has been expanding and I am happy for their success. Red Blossom teas are now appearing in notable restaurants, shops and cafés around town (Wexler's, Bi-Rite Market, Ritual Coffee).\n\nAnother recent addition is the wonderful tea ware for sale in the shop. These would make great gifts. I have been eyeing a few of the tea sets for myself...", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-26", "description": "Love the tea. It might be a little on the pricey side, but it is well worth it. Plus they have a huge selection so they'll have pretty much whatever yo want. Also a great place to get  gifts for your friends and family that like tea.", "author": "Russ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "Excellent place to learn about tea.  We are rookies to tea, and we sat down and received education on the tea(several options to choose from), how to brew it, temp to brew the tea, etc.  Great education and customer service.  Only thing is, it is a little pricey, other than that, no complaints =)", "author": "K. N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-12", "description": "Hands down, this is the best tea you can find in the Bay Area! this family run business puts a lot of effort into sourcing some really excellent tea (mostly from china and taiwan with a few japanese greens thrown in there). \nPeter, the tea buyer, is super knowledgable, friendly and full of information about all the teas they sell.\n\nIf you're looking for a thoughtful selection of high quality tea, go to red blossom!", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-31", "description": "About a year ago, I decided to investigate something better than supermarket teas. Red Blossom came up in a Google search along with 5 or 6 other tea sellers. I tried them all. \n\nRed Blossom people almost don't seem to care if you buy ... as long as you learn something and find something you enjoy.\n\nThe people are helpful, professional and know their large product selection. They helped me find a good ol' black tea of the sort I grew up with but of super, super quality. Then - at my request only - helped me expand my knowledge and taste into white teas, oolongs and pu'er. \n\nFine tea, fine product, I'm a customer for good.", "author": "Paul R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "Highly impressed with the abundance of teas, tea sets and raw herbs displayed in a beautifully renovated shop. The walls are lined with some of the most fragrant and delicious teas I've come across. For a true tea experience, find yourself here for a tasting treat!", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-26", "description": "I am a huge tea fan cannot stand coffee......And I found this place when I was on vaction there with my son back in July.  I was blown away at the store how sheek it is and clean. I have yet to see a store here with such a wide variety of teas in chicago with the whole WOW me away package. At red blossom you can try any tea and they also have daily sample's. Not only was the knowledge from the employee helpful but she also showed me different use's for different tea's   The Osmanthus Mao Jian \"Green Tea\" \" My daily moring drive to work drink\" is great hot or as an ice tea in summer And the Vinilla Orchard \" black tea\"  is simple heaven...... And love the web site so I can always order online for convience.", "author": "Carmella B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-30", "description": "If you are a tea drinker, this is a great place to go - excellent quality, great selection, and a lovely store. But if you aren't a tea drinker, this would also be a great place to start. The folks there are knowledgable and willing to answer questions. I bought tea to give as a gift, and think the labeled vacuum bag and can I bought, with the instruction card they included will make a great presentation. I'll definitely go back.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "Great place! This place really stands out among others in China Town. You can notice that by their interior design, friendly staff (rare thing in CT), variety of teas, and even their website. I really enjoy going there and get most of my tea supply from them (even though price-wise they may not be the best choice, but I'm willing to pay a few extra bucks for their service and attitude).", "author": "Dmitry I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-14", "description": "This is an incredible place to discover what real tea is all about. It is transformative to smell and taste the teas in this store. All you need to do is smell the oolong teas from Formosa to understand what I mean by that. Those particular teas explode with a sweet floral perfume that is unlike anything you could ever experience in a tea bag. It instantly makes you understand why empires rose and fell over tea. The tea sold here isn't just some beverage, these are refined opulent treasures which you really should try for yourself. You will be happy you did.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-18", "description": "I'm not much of a tea connoisseur, my favorite is a strong black tea with cream and sugar. Guess it's the British in me, taste buds poorly developed? Nah, you can appreciate good tea even when it isn't in a pure state! Every variety of black tea has it's own interesting flavor and whole leaves of tea taste so much better than mass-marketed \"loose leaf\" tea with microscopic bits of leaf. Red Blossom Tea Co has a great selection of teas, from white to black. Extra points for having a web site too! I love the organic Golden Monkey, and the Yunnan Black is also fabulous. After two visits I have a bunch of samples of green and oolong to try. The staff are incredibly friendly and seem very knowledgeable. There are a ton of tea stores to choose from, but I think I'll keep going back to Red Blossom.", "author": "Will A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-27", "description": "I was joyful when I encountered this shop at SF China town. Before that day,  I kept on complaining to my friends about the crappy tea you'll find in either Chinese grocery stores or Peet's. I feel offended to see those places selling two-years old huge leaves of Dragonwell and wanted to have my own shop to introduce really nice tea.\n\nApparently they did what I wanted to do. When the extremly friendly staff emphasized that they have an exclusive selection of Dragonwell newly picked during march to April from different farms located at different attitude of the area, I know they know something about tea. I tried several samples and very pleased to take some really nice Dragonwell-----best green tea and the best tea for me.\n\nI also love their taste about the tea pot and cups and tray. Simply classic Chinese beauty.", "author": "James P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-03", "description": "I almost bypassed Red Blossom due to the 1 star review I read about it being a tourist trap.  My experience was the complete opposite.  I found Peter to be very knowledgeable about teas and friendly too.  He gave my wife and I great customer service.  He let us taste several teas and occupy a table for a very long time even though the store was very busy.  He admits he doesn't sell teas for their supposed medicinal qualities.  They have an apothecary in the back of the store for that.  And even there, they'll only fill out presciptions.\n\nAnyway, I think you'd not be doing yourself a favor if you like tea and decide to bypass Red Blossom.  This place deserves a must visit status in SF travel books.\n\nI know Peter reads Yelp.  Told you I'd give you a good review.  You guys deserve it!", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "Red blossom has fabulous tea, and so many varieties.  I love this place.  The service is outstanding as well.  They are extremely knowledgeable about the wide variety of teas available here and how to prepare it. It is well worth the trip to Chinatown for their wondrous teas.  You won't regret it and will soon be back for more!", "author": "Sunshine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "Wonderful tea selection and very knowledgeable and friendly staff. Left with exactly what I wanted even though I didn't know what it was when I walked in. If you or someone you know loves tea, you can't go wrong with this place.", "author": "Poppy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-03", "description": "I rarely visit the store itself, but I always order my tea from Red Blossom Tea. (I've only been inside the store twice -- parking in Chinatown is just a pain.)\n\nAlice at Red Blossom is constantly introducing me to new teas or taking me on tour of some fresh and intriguing tea that has recently come in. She always sends a sample of something interesting together with my orders (not uncommon for tea shops), and she even seems to know what I like. \n\nMy current favorite is their Pi lo Chun Early Harvest. Simply delightful. A lovely looking tea with a great nose and wonderful flavor. I find that it only holds up to a couple of brewings but no matter; it's worth every penny.\n\nTheir Silver Needle is always very fresh, and I tried a Pouchong from them today that had a great flowery nose (smells like fresia to me but I'm not an expert on flowers). I've tasted a kuding from RBT that I'm sure was quite good (and definitely fresh), but a bit too tannic for me. It was quite intense with a sort of fruity taste.\n\nTheir Dragonwells are always excellent; including the low-end ones. Speaking of which, I typically stay in the $40-60/lb range with their teas and I'm quite happy. (Though I've succumbed to a couple that are a good bit more expensive.) \n\nRBT offers a great selection of very fresh tea with excellent value throughout their range. Alice will always steer you in the right direction and she clearly takes her tea quite seriously.\n\nNow, I am just getting to know the depth of puerhs and I am drinking their Emperor Puerh in the morning. It's better than the puerh I buy by the pound in New York's Chinatown (about $40/lb, so a bit less), but I don't know -- I'm just not floored by it. Then again, I don't know how well I know puerhs and I can only imagine what those $300 cakes taste like. (Though I did get a very nice bit of puerh from Ying Kee Tea in Hong Kong with a very deep and complex flavor.)\n\nI've sampled a couple of RBT's oolongs and they were very good, but I'm not drinking oolong much these days. I haven't tried any of their black teas, though I'm drinking a tasty Keemun from another tea shop as I write this.\n\nOh man. There are still so many more teas to try. Well, I'll start tomorrow.", "author": "WILLIAM P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-10", "description": "They have the BEST teas!! It will change the way you think about tea and they are incredibly courteous and helpful. I love that they are philanthropic and give back to the community, but did I mention..they have the BEST teas?", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "This stop turned in to a two hour lesson and relaxation. I walked away with some wonderful teas to enjoy and a better understanding of the product. This was a wonderful time and I look forward to coming back, not only did they recommend other places to go, they took so much time to answer our questions about their history, tea farms they get their products from etc. After a day walking around the city it was a sanctuary. I hope others find this place as much of a treat as we did.", "author": "Nicole P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-14", "description": "very well run. I have been here twice. they are very passionate about tea and the right way to get the most out of it. learned alot. temperature and time are key. And for gods sake! dont drink the first batch! its just getting warmed up!", "author": "Kahau M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-11", "description": "If you're going to buy tea in Chinatown, this is the place. Highly informed owners and the prices are designed for locals, not tourists. All the other joints on Grant street are a RIP-OFF!", "author": "Chili Bill E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-13", "description": "My friend turned me on to this place, and I was skeptical at first. It's in Chinatown, isn't it a tourist trap? That was two years ago, and I've been coming back every 3-4 months to replenish my supplies. If you like Chinese green tea, you simply have to come here. It's the Blue Bottle of tea stores, specializing in interesting and amazing tea. But unlike your $8 dollar 1/2 pound of blue bottle which lasts a week, your $8 1/4 pound of tung ting will last a lot longer. \n\nThey have some crazy rare high end stuff, but they also have a good range of more affordable teas...although it's all gonna be more expensive than that cheap-ass bagged tea you are used to, but totally worth the extra price. i reuse the same leaves several times, which means that it goes a lot further than coffee or bagged tea.\n\nThe brother and sister who run this place are great, friendly, and knowledgeable. They know their ish, and have turned me onto some great teas without making me feel like I am being upsold. My only complaint - i always come here on my lunch break, so have to decline their offer to do tea tastings.\nI also had to make a rule for myself - I'll only go there when I'm almost out of tea. Otherwise I'll end up with more than I can drink!", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-20", "description": "what a great find in the middle of chinatown!  this little tea company is wonderful.  they have a huge variety of loose teas.  the best part is open them and smelling them as you make your selections.  they also give free tastings.  the bad part is that recently this tiny store has been extremely crowded.  the prices are not at all cheap, but try any of their low cost teas and they are often wonderful.\ngreat website aswell", "author": "charlene l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-07", "description": "If you are serious about  teas, this is the place to be. Their quality and selection are superb. I'm sure  Sharon Stone and other oversea stars come here for their teas when they are in town would agree.", "author": "Will T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-04", "description": "Red Blossom has been flying under the radar for awhile, but it may change with their recent gorgeous renovation.  Old or new digs though, it's the tea that counts and their high grade teas will make you swoon. My favorites: Supreme Grade Jasmine Pearl, Silk Oolong (fired with milk for a caramel taste undertone, yum!), and just about everything else they have. Go at a non-busy time, act serious, and you might get a tea tasting and lesson from one of the owners.", "author": "Celeste S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-03", "description": "What's not to love?  This is a stylish update on a classic tea shop.  The space is sleek and well lit but even more importantly, the selection of fine tea is astounding.  The experts behind the counter will guide novices to the perfect selection or prepare a unique blend for those who know what they are looking for.  \n\nRed Blossom is not a sit-down tea house but, if you stop by at the right time, the owner will brew you a cup what he drinks in the traditional Chinese method while chatting about music, travel and of course, tea.   \n\nThis place is worth the trip to Chinatown!  Stop by before it gets discovered by the masses.", "author": "Lael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-09", "description": "I order about a pound of tea from this shop every month. I almost don't want to spill the beans, but this place lacks the pretense of so many other tea shops, and provides top notch product and service.", "author": "Wolfram A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-16", "description": "I was very unimpressed.  I'm not a tea person, so maybe I don't know what the hell I'm talking about, but I thought that what I could get there for the money was weaker than other tea places I've been, like Leland.   I also found them a little pushy on the sales.  I like to RELAX when I'm buying tea, drinking tea, even thinking about tea.  If I want to get wound up I'll stick with coffee.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-17", "description": "I love tea. It is a very close rival to coffee and each morning I have a mental debate on which will be my morning partner. Tea wins about half the time. If coffee wins, then tea gets me afterwards as I usually brew a cup at work around 11. Unlike coffee tea is my friend during more times than just when i need a caffeine buzz. When I am sick, it's helps me get better, when I am coldie on a rainy day it helps me feel cozy, when I am trying to chill out after a long day it helps me go to relax when I am hot on a summer day it brings some ice and is the perfect treat. Tea is so versatile and interesting it just really goes with everything. All of these things I already knew about tea, but today I learned I know very very little about tea and was not experiencing nearly as well as I could have been. This tea shop is a beautiful family run business that has incredible staff. We sat down for a tea tasting and in just 10 minutes were blown away with the information we picked up. Plus the teas were really excellent. My mom and I both left wanting to learn more. We bought a new cup so we could steep our tea more accurately and individually. Also a sample pack because we wanted to try so many. I am looking forward to getting to know my friend tea on a much deeper level over the next few weeks and hopefully go back to Red Blossom tea company for another session soon to continue my tea education. Very interesting, you should definitely come by for a visit and quick lesson you wont leave disappointed.", "author": "Audrey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-11", "description": "Being the total tea snob that I am, I have always been extremely happy with the purchases I have made here.  The store is beautifully designed, the staff is extremely helpful, the selection of tea is marvelous, and the prices are very reasonable.  Those not fortunate enough to live in the area can go to their website and order the tea online.", "author": "Michael I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-13", "description": "Their tea is fantastic -- I tasted it at the Food for Thought Gala hosted by APIAHF and was impressed by not only the flavor, but also presentation and professionalism of the staff.", "author": "Vera D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-29", "description": "This is a great tea shop that was recently renovated to reflect a more posh decor.  You can find traditional teas here such as Pu'erh, but also indulge in mainstream teas like Jasmine or red teas.  It seems that there is always someone that speaks fluent English, and the nonfluent speakers are perfectly capable of placing your orders.  There is also tea sampling and tea tasting!  When I first went here with friends, the shop keeper saw that we just bought tea from another store.  They allowed us to compare our tea to their tea!  The tea here was better!  Now I don't go anywhere else!!", "author": "GingerSnap G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-18", "description": "Someone must have put this place in a guidebook!  Despite the crowds, its still a wonderful place to visit.  The low tables with pots of tea brewing, the metal cannisters of tea on the wall, herbs in the back.  And what nice people they are!  They run around getting this and that, but seem so calm and even ask questions as you check out.  I'm working on a 1/4 lb of Dragonwell (Summer) and 1/4 lb Chamomile (ps.  volume-wise, that is a LOT of Chamomile).  I like to fill my canning jars with tea and cut the labels off the bags to tape to the jars.  Great tea, and a great place to buy.  Cheaper AND much better than buying it at Peets.", "author": "Ananda Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-06", "description": "Great service and nice selection.  For sure the best tea store in the area.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-08", "description": "I've been a \"tea snob\" for quite a while, and this place is about the best I've found.  The staff in the store is really knowledgeable and best of all, willing to sit down and let you try several brews to find the right one.  I live in East Bay and often order from their on-line store (shipping just about balances with the bridge toll).  They ALWAYS ship within a day and often throw in a couple of samples that let you try new teas.   \n\nThis one is a real winner.", "author": "Ken S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-29", "description": "Pretentious people who work there?  NO WAY!  My friend Peter co-owns the store with his sister.  He just knows his shit.  He takes the time to explain things to you if you want explainin' -- and if you don't, he'll leave you alone.  Peter, you rock.  You are the god of teas.", "author": "Lesley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-11", "description": "Good selection of tea.  Friendly knowledgeable family run tea shop.  Lovely tasting opportunity.  Some teas are quite expensive, but obviously also very high quality.", "author": "daniel g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-04", "description": "This place is to tea as Philz is to coffee, though its ambience is more upscale.  In the middle of gawdy, tacky Chinatown tourist traps is this very zen little shop with minimalist design and the best tea I've ever had in California.  The Black Rose is my absolute favorite.   Just don't ruin it with sugar or milk.", "author": "Gregg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "I started to get into tea about a year ago, and fear I may be turning into a fanatic. Over that time, I've been checking out just about every tea experience I can get my hands on. The more tea shops i visit in SF, the more I'm convinced Red Blossom is the only place I want to buy my tea. Their teas are of the highest quality, and they really seem to care about the product they sell. The experience can seem a bit off-putting if you (like I) aren't an expert, but it's well worth putting yourself out there. I've found the folks at Red Blossom to be incredibly helpful, and I've learned a lot from them.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-02", "description": "This is the place that got me hooked on tea.  They carry a large number of delicious loose-leaf teas.  The brother and sister who run the place are always happy to sample teas, and to talk about tea and non-tea subjects.  They can be a bit on the snobby side (they made fun of my friend's tea thermos, calling it a \"toy\"), but I can tell it's not in a mean-spirited way.  It doesn't quite get the 5 stars I gave to Golden Tea because it's a little more expensive (I know, it's the location), and because their selection of puers isn't quite as extensive.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-06", "description": "I brought a small group of sales folks to San Francisco.  Alice was fantastically patient and expertly dealt with my crowd.  They were awed by the selection of tea and the service that came along with it.\n\nI never knew that I was a tea fanatic until I stepped into the threshold of the Red Blossom Tea Company!  My nose was nearly dead from all the tea I was sniffing!!  \n\nThe whole experience is one that I would recommend for a unique experience.  (She also recommends some great restaurants!!)", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "Red Blossom is an oasis amidst the flurry of activity which is Chinatown.  I love to come here on a free afternoon to sample some tea and chat with Alice.  She is very knowledgeable and friendly.  I am always happy with my selections and find that the classy/functional packaging makes their teas the perfect addition to any gift.  My favorite is the Silk Oolong Formosa.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "Red Blossom has some delicious teas at good prices.  The staff is very helpful and informative if you have questions.  The Dragon Well Reserve is the best bang for your buck if you like greens and is a personal favorite.  The Tung Ting Charcoal Roasted oolong is tasty, but strong.  The Silk Oolong has a very unique flavor and is smooth for an oolong.  It's definitely worth a try, as it's a favorite in my household.\n\nAs for getting to the place, I highly suggest parking in the Portsmouth Garage at Kearny and Clay, as finding street parking will be nearly impossible and driving in Chinatown will make you frown.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-07", "description": "Loved the entire experience! Peter walked us through the different kinds of tea, which you can see he's absolutely passionate about and he set up a tasting area with different brews. It was amazing to learn so much about tea in such a short time. He brewed some special ones for us to try and we walked away with our own little stash.. I came back home and brewed some for a bunch of friends and they loved it! The tea here even comes with specific brewing instructions SUPER helpful! Will be going back there to stock up again and try some more new teas!! A big shout out to Peter and we'll see you again soon!", "author": "S R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-19", "description": "More Taipei than Chinatown, this sleek tea emporium is the place to to refine your tea palate. Newly remodeled in August after 20 years, deep knowledge meets high concept. Preparation is meticulous even for a simple taste. First, we used our noses to sample a half dozen complex oolongs from various regions in the mountains of Taiwan. From there, Peter very meticulously brewed a couple of them while explaining the efforts to harvest the tea in different seasons, as well as his personal efforts to locate and import the tea. Then we reseampled the tea for a second brew, and a third. Each revealed remarkably different character...from fruity, to bittersweet, to creamy and buttery. The tea isn't cheap, on the order of $9 - $15 an oz. and they are precious with it.  It's heat sealed airtight in mylar bags, like at a fine cigar store. The back of the store is devoted to ginger root. Old school meets new school.", "author": "Brandon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "This is the best and only place in San Francisco where I will buy tea. I have been to other tea shops and none can compare to this jewel in China Town. The staff, Peter and Alice, are friendly, knowledgeable and willing to sit you down and tell you everything about  tea. When we first went there we spent almost 2 hours tasting, talking and smelling many teas. We haven't gone, and won't go, to any other tea shop since and that has been over two years. We have taken friends and family there and all have loved it as much as we do, thankfully, since many are from out of town or country, you can also order online. \nThey constantly have new teas coming in, so it is always worth it to go  and have a nice conversation and try their fantastic teas. If you are looking for the best tea in SF come here \nRecommendations: Jasmine Pearl Dragon Supreme, Heirloom Lishan, Heaven Mist (Jade Oolong) or the Grand Scarlet Robe Amber Oolong, nothing beats them.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-30", "description": "Love this place! They sell great loose leaf tea...my favorite is the Thai Tea...last time I was there it was less than a fiver for a quarter pound. Clean, elegant, nice!", "author": "Darien W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-22", "description": "After reading the reviews, I thought for sure I would have a great \"experience\" here.  I even called the shop and asked if they have tea tasting the person on the line said of course they do.  Well... NOT TRUE!!!!!!!!!!!!  As I walked in, the sales clerk didn't even acknowledge me or even crack a smile.  I then asked her if I can sample her lychee tea and she said that the taste is straightforward and they SELL sample sizes only.   She said she will not brew me any lychee tea because \"the whole shop will smell like lychee tea.\"  No SH*T.  You are at a tea tasting shop!!!!  The place will smell like tea!!!! I then asked her which tea has the least amount of caffeine she said, \"All teas have the same amount of caffeine.\"  NOT TRUE again.  White teas have the least amount of caffeine and the highest antioxidants.  Needless to say, I walked out empty handed and quickly wrote this review.  I went to Vital Tea Leaf down the street instead and had great customer service there.", "author": "SillySP P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-20", "description": "We went there and talked with Peter.  He was extremely informative on the tea and gave us free yummy tea samples on everything we were thinking of buying.  We walked away with a white tea and green tea (delish).  It has a huge variety of teas.", "author": "Jaclyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-28", "description": "I love a pleasant shopping experience, as well as great selection and  quality. Peter and his family at Red Blossom have created a lovely and inviting ambiance. They will also prepare most teas for tasting, (as long as you're intent on buying something!). They walk you through the nuances of tea flavors and textures, sharing the proper language for describing the kinds of teas you like! So if you're ready to take step up in your tea savoring experience, this is a great place to start.", "author": "Larke B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-20", "description": "Okay, I am officially frustrated with how much this place charge on their tea I have to share this with everyone.  First of all, this place is SOOOO pretentious!  That Alice is the most snobbish and arrogant lady (and calling her a lady is being nice) at the store.  She constantly pushes for the most expensive tea.  This is the BIGGEST RIP OFF so save it for the tourists. The tourists don't know any better, but you should.   If you want good and reasonably priced tea, go up a block or two to TIN REN TEA STORE.   The margin they make is at least 300% on the actual price they pay for.  PUH-A-LEASE, who on earth would pay that in this kind of economy??!  Overall, the service is less than average, price is way too high and  they pretend to be a upscale store when it was only an old chinese herbal store a couple of years ago.  Really, do they they by repainting it, add a few chairs and do tea tasting that they think they can demand such obnoxious prices?  Come on!   By the way, there are similar tea shops one block before this sucky place and one block after it so please shop around and you will save a lot of money!  You are warned!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-03", "description": "I'm still quite a newbie to good tea so can't speak intelligently to the quality of their teas but I can share my experience at the store. A friend and I were doing the Wok Wiz tour of Chinatown and one of the stops is Red Blossom. We walked in and were immediately soothed by the atmosphere and the lovely surroundings. They apparently redid the interior recently and it is fabulous! The staff are very passionate about their teas and they are full of knowledge, which they love to share. My friend and I had to go back after the tour. Normally I'd have been really intimidated by the sheer number of teas they have but once the gentleman who worked there started talking to us, I knew I was in good hands. He described the different types of teas and got us sampling them so we could determine which ones suited us best. The Silver Needle white tea was one of our favorites. I just loved how they served the tea too...with the slotted bamboo tea tray set with the white porcelain Gaiwan and the little teacups. Had to buy the Gaiwan to brew the tea I purchased so at home I can slow down and really enjoy both the process of brewing them as well as drinking them. I highly recommend this place and will definitely go back next time I'm in town.", "author": "Tara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-21", "description": "this is exactly how a business should be run. the employees are passionate and very knowledgeable about their products. we asked questions about teas and we were given very thorough responses and were offered suggestions to other teas we may like. we were offered a sample of some teas, both hot and cold. alice explained the brewing processes as well as showed us what the tea was doing and how it was changing with the introduction of hot water. alice also shared a very cute story about her trips to korea.", "author": "cesar z."}
