{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "This neighborhood restaurant is a block from where I grew up and where my family still lives although I have only been here a couple of times. \n As a test to give a gift certificate for some really great neighbor's, I took my Mom to Marcello's the other night to make sure if we were giving a gift certificate to a meal that it was a good experience.\nWe arrived early and they seated us right away.  The place filled up yet we never felt rushed or that the service was lacking.  We ordered the dinner, salad/ minestrone soup.  The salad was cold, crisp and fresh.  The soup was traditional and very good. The pasta also was fresh, perfectly cooked and arrived hot.  We had to wait a bit for my entree as it took longer, however our waiter let us know that it would take a little longer,  I appreciated that he checked in and let us know. \nI ordered the Pollo Ai Fierri.  Both dishes arrived at the same time, hot and frankly it was the best roasted chicken I have had in a restaurant. It was moist, perfectly cooked and hot.  (I have a thing about my food arriving hot in a restaurant - so many times it arrives lukewarm) My mom had the Chicken Dore (similar to Chicken Milanese)  - she absolutely loved it;  she can be hard to please.  All in All a great experience. We bought the gift certificate. This is now one of my very favorite Italian restaurant's.", "author": "Janet C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "Food was tasty and hot. Service was terrible. Had to request water, literally, 4 times. Appetizer came out before water/beverages. We brought a cake for my Moms bday and had to ask for it at the end of the meal. Not a particularly young clientele or employees. We were there for almost 2 hours and didn't order anything particularly special. Just. Took. Forever. And ever.", "author": "Jess P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "As a sunset native I've driven past this place hundreds of times since I was a baby & never gave it much thought. It's an old school gem & I'm glad my partner suggested it. The staff is friendly & efficient. The pesto gnocchi was tasty, with a generous portion & will make for a nice leftover. I look forward to coming back to try more of their dishes (I had a hard time deciding what to order since everything looked so good).", "author": "Gena G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "I guess they get points for being a staple of the neighborhood.  \nBut we had a group of 7 last night for dinner and didn't have anything else great to say here.  \nOn check in they didn't have the group table ready.  Then once seated it took 20 minutes plus the involvement of the owner to get water and bread.  Then it took another 60 minutes to get the main course out.  At no time did they offer to bring the mains for the kids out early even though some adults got the salad menu option. We ended up there over 2.5 hours and other that that first time they set the water down it was not until 2.25 hours into our meal that we got the water refilled.  Wait staff stopped by exactly 3 times in that timeframe.  All in all TERRIBLE service. Food was okay but not special. All the servings were different sizes of food -- 2 dishes of gnocchi for example were 25% different in quantity.  You go here if you have fond memories of some dish long ago I guess.  Or you want an instagram photo in front for the 1950s era bar kitsch.  But for a nice meal with a family I think you search a new place.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Years. More than I can count. Years I've been coming here to Marcello's. One of these old-timely Italian places been around forever. White table cloths, crusty bread and pats of butter waiting for you and no they don't charge for the friggin bread!\nI've tried most everything and they're known for their tender succulent veal dishes, but I always get the eggplant parmesan. \n\nStop the eye-roll  please. I'm not dieting nor vegan. It's simply the best anywhere. And I mean anywhere. Thick slices not breaded, ethereally light and coated with both a tomato sauce and a gentle addition of béchamel. You cannot see this white luscious sauce but it's there adding unctuous goodness to this sublime vegetable. There are always a nice portion of sliced potato Anna and a vibrant green vegetable that accompany it all. \nDoesn't matter what you get. It's all so very del ious. Really. I'm not sure I've ever had a bad meal there. Or even an uh meal. I've enjoyed birthdays, engagements, during the week meals there-you name it-and have always been delighted. \n\nSo we get the meal here. That means a little plate of rigatoni w meat sauce to start then this salad with an Italian vegetable dressing. I've told my family to tel them I'm dying and my last request was for this salad dressing recipe. When gourmet magazine had a section called \"you asked for it\" I was hoping I'd get it then. Yes it's that good!! I've already been back in the kitchen to learn how to make the eggplant. (And still cannot replicate it!)\n\nIt's way over on that side of town. Nothing chic nearby. Doesn't matter. Or shouldn't. Before Marcelo the owner runs away porcini hunting again please go. Indulge in this delicious reasonably priced Italian food.  \n\nI feel lucky to have this as part of my history. So many memories have been made there. All good. All.", "author": "Peddie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Great old school Italian restaurant in our neighborhood. My grandparents used to go here all the time, hope this place never changes. Good food, stiff drinks, reasonable prices, and great service. What's not to like?", "author": "Meesh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Our party of four yearned for an SF traditional Italian meal. Salmon, rack of lamb and two veal with fresh porcini mushrooms filled the bill for us. We ordered the dinner which provided a salad with house dressing (very good), a pasta serving with delicious red sauce, and a dessert of choice. There are so many delicious choices on the menu that make one want to order more (don't --- the portions are more than adequate).\n\nThe service was impeccable and the pace of dinner was leisurely. Five stars! Only downside: parking is a challenge.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Sooo important to have places like this since they are a dying breed.Authentic and very old school place that is VERY retro,liked faded formal elegance \nFood is well prepared nothing fancy-what really is amazing are the prices which are some of the best in the city for this kind of food....tasty veal dishes and pasta plus things like escargot!! Crusty old waiters add to the charm!! Marcelo the man and this restaurant is an institution let us hope I it stays open for another 40 years.....", "author": "james m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Love Marchellos been coming here for years food is family style Italian staff are the best \nTry it eveyone", "author": "wayne b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-17", "description": "It was so crowded on a Friday and the place had an old feel to it. There were mainly old, loud, white folks in there, with a few young couples. On the brighter side, our waiter was really kind and funny. The food was OK; I wouldn't come back as this didn't fit the bill for me at all.", "author": "Steph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I love Marcello's! My family and I have been coming here since I was a kid. The atmosphere is old school, Italian, and San Francisco. As you are served by waiters in tuxedos, you can feel the rumble of the street cars on the Taraval line, and witness the owner Marcello chop it up with friendly patrons at the bar. I love their Cesar salad, fettuccine bolognese, and chicken parm! Marcello's is a San Francisco icon that I think is worth trying at the least. Who knows, maybe it will become a family spot for you too", "author": "Billy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Thursday night was the second time I've eaten there. This is another restaurant from the 1950s that's still around. There's no wait-time here. Customers are seated the moment they step in.", "author": "Julio B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "It was ok. \n\nI suppose I didn't have very high expectations going in, so by my normal standard it would probably get three stars, but I feel like they were trying to be nicer than they turned out, so, I'm going low.\n\nThe inside is nice enough.  Mirrors on the walls so it looks bright. Seemed clean.\n\nIt was surprisingly busy in my opinion on a Tuesday night.\n\nThe wine menu was hilarious.  For wines by the glass, they has a number listed, House Red, a Sangiovese - which did have a a name, a Chianit, a Cab Sav, a Merlot, a Pinot Noir, and a Zinfandel.  No explanation of where any of those wines came from or who made them, or the year... classy.\n\nThe house salad was very mediocre.  It has celery and carrots in it, which is never a good sign.  reminded me of a diner salad\n\nMy veal raviolis were fine. They tasted like ravioli. Definitely not anything to write home about. \n\nMy husband's veal with mushrooms was also fine. Tasted like food. The mushrooms were probably the best part. \n\nI did like our waiter.  He was a nice, helpful guy.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Marcello's is a wonderful gem on Taraval Street!  The touch of class and elegance this restaurant provides is greatly appreciated.  The food is superb and the staff is very friendly, professional, and dressed very smart!  Always a favorite spot!", "author": "Debra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "The pastor was good there was good service we all gave the pesto a 10 I wold recamend to eat here", "author": "Anthony U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Very friendly waiters / waitress. The English Sole is my family's favorite, every one loves it. We lived around the area for over 20yrs but didn't realize it existed.", "author": "E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Outstanding experience!\nVeal..Chowder..even the Cappuccino  \nDefinately returning for more.", "author": "Rick V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "Do not trust the good reviews. The food here is not good at all. I hate to say this because this looks like a nice neighborhood restaurant but it's one of the worst Italian food I've ever had. People that write good reviews obviously don't have very good taste and it's not surprising once you see who eats here. \n\nThe veal and mushrooms were the only thing that tasted ok but the portions were so small. Bread taste old and butter had a freezer burn taste. Tortellini was hard and not flavorful. Clams were chewy. Minestrone soup had a funky taste to it. They give you like 5 penne pastas with the dinner set. Ok I'm exaggerating... it was maybe 10 pennes.  Other pasta dishes were equally bad. \n\nI'm giving an extra star because people working there were nice and friendly. Although the main waiter was kinda grumpy.", "author": "Gir G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Have not been in several years, and decided to have an early Father's day dinner for my husband and father. We were greeted by an older women as I had a 5pm reservation which really didn't seem to matter and the restaurant was empty with 3 people sitting at the bar. Our waitress was nice and you could sense she has worked there for quiet sometime, but lacked an order of how to waitress. We received menu's and as she overheard me asking my party about wanting escargot's she jumped in asking if she should put in an order to be fired up. I held her off until everyone had made a decision of what they wanted to start off there meal with. She returned and an order was placed for escargot's and carpaccio. She then returned to take our dinner order. Never once asking can I start you off with something to drink. Overlooking things being done kind of backwards the food arrived. The escargot's and carpaccio were excellent and thought we were off to a good start! Then salads arrived and just fell flat with excessive dressing (too much vinegar) on the house salads and a bed of lettuce with all the toppings looking like they had been flattened with a rolling pin made the salads look quiet unappealing. I had the Caesar's salad which should have been crisp and cold and the yellow portion of the romaine lettuce and it was just the opposite warm lettuce and all green which was bitter and just fell short of what should have been a great salad. The Pasta of the day arrived for my mother and husband who had ordered the complete dinners were handed a tasteless penne pasta in a bolognese sauce with a running water sauce. I had the cannelloni which I was told was stuffed with spinach, ricotta and veal and I searched every bite for spinach and ricotta and to great disapppointment never found and I then unrolled the cannelloni and really questioned if it was even veal. My son had the Gnocchi in cream sauce which lacked any taste and felt like the Gnocchi came out of a box. My father had the pepper steak which had a lack luster tasteless pepper sauce and a cut of steak for the price was overpriced! His potatoes were cold as was everyone's potatoes that accompanied their dinner's. My husband had the special which was veal with porcini mushroom's and not wanting to rock the boat at the time, but we got home said it was just terrible and tasteless and the plate really fell short with cold potatoes and green beans. We then ordered desserts to be again disappointed that they could only fill 3 out of the 4 orders of creme caramel because they had run out. Not really disappointed after tasting and sharing with my son as the creme caramel tasted old and flat in appearance and size. Who runs out of dessert going into a start of weekend with celebrations for Father's Day?? The Tiramisu however was excellent!! Fresh as if had just been made. It was unanimous among all of us that this would not be a return restaurant on our list as it lacked presentation of dishes, taste and exceptional service for the prices they charge. Oh and by the way, when I told the waitress about the cannelloni which I specifically had asked her about before ordering responded \"Oh, they must have changed it\"! Too bad the price didn't change since it did not have the contents as you described. Not returning and extremely disappointed.....", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Have you ever seen the movie ratatouille? Well that scene where the critic tastes the ratatouille and it takes him back to his childhood... Well that's this place!\nAs a kid growing up outside of New York City, my folks took me to this little Italian place that has been embedded in my mind for a lifetime. I feel like I found the place again at this restaurant. This is the quintessential old-school Italian restaurant. Liz, Laura are great as is the food ....go!!!", "author": "Mischa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Started with a great artichoke heart vinaigrette salad. Had one of my usual entree's of rack of lamb which they do very well on the dinner with their solid minestrone soup. Another great meal!", "author": "Dan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-12", "description": "I hate to sound rude, but I really had a hard time dealing with the teasing that Patrick performed. That was a long time ago and I believe that this should be kept top secret. I'm going here with my parents tonight and we'd feel better having Tony as our waiter instead of Patrick whereas he's less likely to tease us in metaphor of Renato from The Olympic Club and my late great grandfather.", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Love this place! Outside looks like a dive bar but you walk in the door and wow! Old school Italian American food served in swank, time warp interior that blew my mind. Full bar made of big rocks is an added plus. Patrons are mostly older locals from the area. This joint is dripping with atmosphere including the old bus boy with his uniform or the owner who sits at a cute little desk with a mushroom lamp. Its been in business  45 years and you can tell since nothing has changed since the day it opened - in a good way. Nothing trendy or foodie here. You ain't gonna get organic or local. The wine list is a hoot but people bring their own wine. Reminds me of the restaurants I ate in as a kid in the 1970s and the menu is straight from that era. Yes this place isn't fancy or authentic Italian food. If you into vintage then you will appreciate this place. Its truly a time capsule and well worth the trip. Will go back for sure.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "On a more recent visit I took my son and two young grandsons.  The waiter was very accommodating and suggested things that the youngsters would enjoy and could share.  Service and food were excellent.  I was also impressed by the waiter going above and beyond his duties to make it enjoyable.  He noticed my son was leaning over trying to watch the basketball game on the TV in the bar.  So he moved some things out of the way and opened a window between the bar and dining room so my son could get an unobstructed view!\n\nReally pleased !", "author": "Bob S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-23", "description": "We came in on a Friday around 7:30. No reservations, but was seated rather quickly. Ordered two pasta dishes and where given bread and butter. Bread was warm and tasty. \nPasta was nothing to run home and write about. Good but just ok. Glass of Merlot. Good glass of wine . Tiramisu was on the tiny side but decent tasting.", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-20", "description": "I ate dinner here last night with a group of about 30-35 people. \n\nThe food was ok but the attitude of the waiter left a LOT to be desired. The room is NOT set up for a larger group. The group, due to it's size, was split up. The waiter found enough time to complain to customers (us) about having to work over such a large area. Sorry but that's what his job was I thought. Service slow and the waiter appeared to me to have no idea who ordered what. Then he would get mad at the customers arguing with them as to what they ordered. \n\nWas not a happy meeting. \n\nWould not go back.", "author": "R S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "Service was ok \nFood was ok\nWould I come back? I would maybe try a different place first. Not sure if it was worth it for the price \nLooked like they had a lot of regulars \nI had the halibut\nMy friend had the red snapper\nBoth were average\nThe salad was just ice berg  lettuce with carrots, red cabbage and radishes. I expected a little more fancy and dressed up salad for the place\nThe pasta was I again, for the price-it was just ok.", "author": "Merry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-31", "description": "This was our neighbourhood go-to for food when we wanted a nice place, good food and neighbourly service.\n\nWe booked my boyfriends birthday dinner wth family. We arrived on time at 6:30p on a Sunday.\n\nIt was much busier than normal\nWe were told the table wasnt ready. No\nProblem. We had a drink at the bar. \n\n45 minutes later we were seated.\n\n6 people, spending money on drinks and dinner. Willing to drink and dine and have fun\n\nWaitress was rude, unfocused, angry and with an attitude that was unwarranted and surprising \n\nI asked to speak to the manager. \nAlas it was this waitress!\n\nShe did not speak to us but plied us with more and more attitude throughout the dinner. \n\nI am appalled at the service and disappointed that we ever gave them our time and money \n\nShame on you for treating us with such disdain!\n\nHorrible service for a Place that we always loved.", "author": "Cora Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Wonderful little gem we stumbled on - classy - with Wonderful service. Felt like we had walked back in time - intimate - cozy - attentive service with great food. The female bartender (from Ireland) was so sweet - I had sprained a muscle in my leg and she gave me a nice bag of ice to take back to my hotel room. Will definitely visit again the next time I'm in the City.", "author": "Deborah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "I'm getting old.  I could have sworn I wrote a review of Ristorante Marcello long ago.  Well, let's remedy that right now.\n\nI love this place.  It is decidedly not hip, but neither am I.  Actually, that's one of the things I find refreshing about it.  It's a neighborhood restaurant and bar with the same folks sitting at the bar who were there in 1968.  Not a man bun in sight.  It's a breath of fresh air.\n\nIt's an old-time red-sauce Italian place, and the food is delicious and plentiful.  The best thing on the menu, though, is the minestrone.  Dear Lord, is it good.  It's thick and fragrant and warms my soul, especially with a thick slice of sourdough bread and butter and a glass of Italian red.  That is the old San Francisco. -But I digress.\n\nThe pasta is great.  The petrale sole is wonderful.  The chicken piccata is delicious.  Ristorante Marcello is old school.  Their menu is traditional.  They do traditional dishes, and they do them well.  Their prices are reasonable.  The waiters wear tuxes.  \n\nGive 'em a try, but please save me some minestrone.", "author": "Earline A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "I was in a good mood and hasn't seen my sister's family in a while so I invited everybody to dinner. I originally suggested pizza, but my sister suggested we try Marcello's since it was near her house.  I hadn't even considered it since the restaurant doesn't have a single window, but I was feeling adventurous so we walked the short block and a half over together. The decor is absolutely classic Italian as you might remember from the 70s, and really nothing has changed since.  Casino, Goodfellas, and other Sopranos, come to mind.\n\nWe decided to start with their hearts of palm salad, which was tasty and well-seasoned, but definitely came out of a can.  I decided to go with my gut and try the fettuccine Alfredo, and was thrilled to smell the presence of nutmeg in the dish. Flavors were classic Alfredo and the pasta had a wonderful al dente bite.  I wish there was a blackened chicken option but that might be more modern take.  The other dishes were pretty tasty as well, and I was a fan of my nephew's gnocchi and pesto.\n\nService was really friendly and made you feel like part of the family.  Prices are moderate and certainly not over the top.  There are absolutely no windows, which makes approaching the restaurant kind of sketch, but I assure you it's worth a try.  I'd definitely come back!\n\nFood: 7/10\n\nService: 8/10\n\nPrice: $$\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Before the ballet on a Thursday night we had a early dinner here with reservations for 5:30. Service was excellent as well as the noise level. As Marcello's started to fill a bit, the noise level only increased a little. \n\nFive of us ordered various pasta dishes and were very pleased with all. Everything was fresh, tasty and arrived after an average wait for made to order dishes. \n\nParking may be difficult as this is a mixed residential/commercial area. \n\nThe restaurant seemed clean and a little old school with many of the patrons the same. Not a loud type of crowd.\n\nPrices are a bit more than the Yelp menu link.", "author": "Pierce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "This restaurant is a hidden gem! My friend took me here and I fell in love with their Spaghetti Alla Matriana. I live in Oakland but I have been eating here for over 15 years now and try to eat here as much as I can. It's a little out of the way for me and parking can be tough, but it's worth it! \n\nThe restaurant has that old 60s feel to it and they have a LOT of regular customers. Great service, good portions, tasty pastas, and good dessert.\n\nI recommend the carpaccio, spaghetti Alla matriciana, escargot, chicken parmesan, bolognese, and salads.", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-24", "description": "I hate to give this place only 3 stars, because it's cute, quaint and fairly classy local business. But I was pretty underwhelmed by my two visits here and I don't think I'm going to give it a third try.\n\nThe food is not bad, but it's nothing to write home about for how much you're paying. The carbonara was a bit bland and almost on the dry side. The spaghetti matriciana was ok, but actually tasted the better as leftovers the next day. I think sitting in my fridge allowed the flavors to meld and intensify a little more. Portions are big though. The prosciutto and melon was great, but you can't really mess that up. \n\nThe service is friendly as well, but maybe a little too friendly. My biggest gripe was that I ate there alone one night and the bus boy made constant comments about my race and how much he loved Chinese women. It made me uncomfortable even though he was incredibly nice. It was completely inappropriate.\n\nI think it's a nice place to come for a quiet dinner, but maybe for a different kind of crowd.", "author": "Rebekah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "What a delightful experience. I grew up in the Sunset District, & the restaurant I usually go to, had no parking. So I drove around & found this wonderful restaurant. I had no reservation but the Owner?, I think he was the owner said he would find a table for me & my boyfriend. He was simply charming. \n\nEverything was perfect, from the atmosphere to the food, & the delightful waitress, & waiter. \n\nWe especially loved our steak dinners, & that lovely French bread. I will be back, & this time take my brother with us. And of course this time I will make reservations!", "author": "Carol G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "On my first experience coming here, I had lost my phone at the beach earlier in the day...after some frantic running around and use of Find My Phone, we were called by some people who had found the phone. After that all I wanted was a nice comfy place to eat dinner and Restorante Marcello fit the bill. The atmosphere and uniforms worn by the staff are very much from a different era (early 1960's), but this only adds to the charm. I notice a lot of families and older adults gathering together here to sit down and enjoy a meal together. I appreciate how the staff are extremely friendly. We've come here a few times now and ordered the below dishes and enjoyed them quite a bit.\n\nhome made tortellini with cream sauce - delicious. peas, panchetta and a little bit of spice\nbolognese sauce - standard, but still tasty and comforting\nRavioli - yum\nVeal Parmesean - delicious. The veal was excellent.\nFettucini Vongole - tasty, but would be nice if they used fresh clams", "author": "Alice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Very classic italian restaurant but high quality good.\nWe have enjoyed raviolis and veal Wotherspoon lemon sauce and it was excellent; desserts were also nice.\nA good quality price ratio with a good service to be recommended", "author": "Jacques B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Excellent food & services. Fair prices.", "author": "Carl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Best pasta around. Marcello is usually seating you and the atmosphere is quaint. Waiters are funny and entertaining. You really want to go for the pasta. Other dishes are amazing also, but pasta is memorable.", "author": "Lucky J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "You know you're in for a good night when you walk in and a dapper tux wearing man greets you with a smile!\n\nMinestrone is awesome.  Just awesome.\n\nChicken Parm/Veal Saltimboca/Swordfish/Petrale Sole\n\nI never know what to have because I love them all equally!\n\nDinner for 4, a bottle of wine, and a dessert to share was right around $100.  Cant beat that!\n\nDo yourself a favor and stop in.", "author": "Katy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "One of the best Italian restaurants I've been to on this side of the city! \n\nThe service was great to start with. I love when the waiters actually talk to you rather than just taking your order. Both of them were extremely nice people. The inside has a pretty big full bar and the dining area is decently sized. It has an older type of feel to it, which I didn't mind. It's perfect for a romantic date or a night out with the family. \n\nAs far as the food, it was so delicious! The bread that they serve was little harder than I'd like but it was still pretty good. I ordered the special of the night which was meat ravioli with pink sauce paired with a nice glass of Cabernet. There was just the right amount of food. It didn't leave me hungry or overly stuffed. My friend ordered their eggplant parmigiana. She said it was the best she'd ever had. \n\nI couldn't leave without having dessert. I got my usual, cheesecake. I wouldn't say it was the best dense cheesecake I've ever had, but it was really good and I was satisfied. On the other hand, my friend ordered their gelato(half chocolate/half hazelnut). I was disappointed with it due to all the good reviews for it on yelp. The hazelnut part was delicious, however the chocolate had some frostbite on it as it did taste a little old.\n\nRistorante Marcello is in the 2 dollar sign range but on the higher end of it. \n\nRegardless, I really enjoyed this place and definitely will come back!", "author": "Priyam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "LOVE LOVE LOVE Marcello's.\n\nWhen I went for my first time... I have to say I was a little intimidated by exterior decor. Lightweight felt like I was about to walk into a restaurant owned by the mob in the 70s...\n\n...until we walked in. The inside is amazing! Totally felt like an old-fashioned family-style restaurant that I would find in a back alley in Italy (although I guess to some it could seem a little dingy). The owners and waitstaff are all super friendly as well--one of the waiters even helped me take off my coat when he saw I was struggling to get out of one of my sleeves!\n\nWhat to expect: -if you get there towards the early side of the evening.... be prepared for a crowd of 80+ couples who are dressed to impress and are out for date night. So adorable, but mildly awkward if you go with anyone under the age of 40 and decide to wear jeans.\n\n-cool decor and fun people watching\n\n-amazing service (the waiters/busboys are so nice, and in tuxes!) and great food/dessert/wine selections\n\n\"Yay I'm a fan\" is right! But Marcello's, please add bruschetta to your list of antipasti!", "author": "Sam D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "I had the minestrone and spaghetti. They were both good. The food here is casual, home style. The decor is seriously dated and you can barely tell the place is open by the front door, but I enjoyed my meal and the service at the bar was good.", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Really cute old fashioned Italian place tucked away in the sunset area! \n\nMy friends say they always drive by this place and always wanted to try it. Looks unassuming from the outside but inside it looks very vintage and old school. \n\nThe waiters are dressed better than you as they are all in black and white tuxs! My friends and I felt really underdressed lol! \n\nBut everyone was very helpful and friendly! Our waiter was very personable and made us laugh a couple of times.\n\nWe started with one of the specials which were lightly battered and fried porcini mushrooms that were local. The mushrooms were delish and it was lighter than expected especially just adding a little bit of lemon juices on it! We also shared the beef carpaccio. This was good but I did feel like the sauce that was on the beef was a bit too overpowering\n\nMy friend and I both got the special which was meat ravioli or porcini ravioli with a pink sauce. Both raviolis were really good and we couldn't decide which was better!\n\nIt's a cute place and I would come back again!", "author": "Christine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "We had not been to Marcelo's since moving out of the city - 1999.\nThe food is still as superb as it was back then!  The veal Marcelo was tastier than ever!  Service was great.  Best Italian food around and very reasonably priced.  \nThe only reason for 4 stars instead of 5 is the decor could be \"refreshed\" a bit.", "author": "Rebecca B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Definitely one of the best Italian restaurants I have been to. I would recommend the dinner deluxe special it is worth the price considering everything that comes with it. Good service as well!", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "Very nice people but the food didn't taste fresh nor remotely homemade.\n\nIt was very bland and not what I was expecting for the price.\n\nThey were very understaffed the evening we ate there also.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "This restaurant has special meaning to me as my grandfather used to take our family there often, the food was always amazing. I have been feeling nostalgic & would like to go back soon, happy to see it is still owned by Marcello, who was a friend of my grandfathers until he passed away in 2003. Marcello also happens to have lived in the same town I live in the East Bay, the old Baldochi house still stands today, a historical beauty in downtown Antioch.", "author": "Lisa P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-02", "description": "A nostalgic, but - so, so sad to say - very disappointing dinner...  \nIt had been a long time, and a lot has changed in a decade.  The quality of the food and service has greatly diminished.  \nOur waitress was curt, inattentive to the point of rudeness, and never broke a smile.  The food was disappointing, with the majority of what we ordered just plain bad.  The gnocchi was like paste.  The pesto was bitter, and so was the sauce the scallops were swinging in.  The scallops themselves were past their prime.  Even my carbaholic children didn't eat their (terribly bland) spaghetti and ravioli.  The only bright spots were the minestrone and the Caesar salad.  The veal parmigiana was edible but nothing compared with what it used to be.  The desserts were very forgettable.  My old favorite \"Strawberries Julius II\" tasted of mold.  We walked away very disappointed, and - having been a habitué a decade and a half ago - embarrassed for this once great restaurant.", "author": "Alex I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "Well, it's a restaurant for old timers in the Sunset. Prices are reasonable and the food was decent. Most entrees were around $25 and included soup/salad and coffee. Hard to make an argument against that ;)\n\nMost people dining here grew up on typewriters and there's nothing wrong with that. I would also say that a majority of those dining were native San Franciscans...You can just tell. If you don't go in expecting a high end dining experience, and see it for what it is, you'll be happy. It's a neighborhood place that's been here since the 60's and it's good at being what it is - A place for the local old timers.", "author": "Con L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "I love this place, mostly for the atmosphere, but also because of their classic Italian American menu. If they have anything with mushrooms, I go for that, the owner is apparently obsessed with them. But be warned: side salads and other sides are not very fresh or good...well, at least for organic, locally sourced, blah blah Californian standards.", "author": "Amity B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "I haven't been to this restaurant since my childhood, when we went every week, but I'll go ahead and assume that nothing has changed! Very old school, lots of fur coats, waiters in tuxes, and the cigarette smoke of old still lingering in the air.\n\nThis place serves a version of spaghetti alla matriciana that I have been struggling my whole adult life to recreate. Excellent food. So many memories.", "author": "Alexandra L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-04", "description": "This mom and pop shop was very good about accommodating a party of about 20 people for a birthday party.  It didn't leave very much room for people to move around though.  \n\nMenu is not in English, so it was a little confusing to order.  I couldn't speak for anyone else, but I ordered the halibut and it was delicious, but not quite enough to make you full.  It came with a small side of veggies - maybe 3-4 pieces, but it needed a carb or something.  \n\nI don't think I'll be back unless someone I'm hanging out with realllllllly wanted to come here.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "I made last minute reservations for this place and i guess we got lucky.  The serve here is pretty good.  The food wasn't bad, it was better than eating at chain restuarants. I got the linguine with clams and i engjoyed it a lot. There was a lot of clams on it, which was to my surprise. My friend got the sweetbread and was disappointed in it because it tasted like chicken. I've never had sweetbread so i can't judge.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "I do think that the atmosphere of Ristorante Marcello exudes old-school charm and that is quite nice. Unfortunately, my food was more in the meh category. The highlight of the meal was the avocado salad. However, I wasn't smart enough to order that so I only got to eat a little from someone else's plate. They do make delicious Italian dressing here as well, but my main course of Spaghetti alla Carbonara definitely was not worth the price I paid for it. It was a huge portion to be sure, but the flavoring was rather bland to me and the noodles were a bit clumpy.\n\nSir Nicholas and I also were the youngest diners there by a long shot - I'd say the average age was around 65 on the night we went (a Thursday.) I personally don't have any problem with that, but it does set the mood a little.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "Cozy family style Italiam restaurant always filled with old folks. Great menu filled with your standard Italiam food. Chicken parm and raviolis are pretty good but I couldn't tell you anything too spectacular about this place.", "author": "Anastasia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "THE hidden gem in SF. This homey Italian restaurant is located ever-so-casually at Parkside. The place is spacious, with a very friendly gentleman as your server to pamper you with delicious food. Not to mention their generous servings. All this for a reasonable price.\n\nI was craving Vongole in particular, and the only place I could find on Yelp in proximity was Marcello. Drove about 20 minutes from where I was, and arrived slightly earlier than their opening time - but they still let us in! Very comfortable atmosphere, and along with the great service, this place really makes you feel happy that you are there.\n\nTheir house special salad is refreshing and light, and their soup of the day was very warming. Nothing was overly-seasoned/oily/dry, everything was just right. According to the gentleman who was our server, they make their pasta slightly thinner than elsewhere, because it gives a better flavor. I found this out when I asked him about the angelhair-thin Vongole that came out. It did taste good, and the portions were ginormous. LOTS of clams, already taken out of their shells - I really appreciated this since this shows that Marcello wasn't skimping out on the clams (many places tend to place just under a dozen clams, in their shells, in order to make it look like there is a lot). \n\nBy the time I finished my beloved Vongole, I was too full for dessert. But there's always next time, because I plan on making this my go-to Ristorante in the Bay Area. \n\n\n**Tip: Also seems great for families. By the time we left, there were groups of large families, and everyone seemed so happy. I feel like this is the place I would want to share with people I love.", "author": "Soo Jung R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "I've been coming to this neighboorhood restaurant for 20+ years as I use to live in the Sunset.\n\nIts an old world mafia feel NYC style of Italian Restaurant (without the mobsters, though it definitely has that feel).  One of Herb Caen's favorites (rightfully so)... as he has written articles about this great old establishment.  The service is great and staffed with all the people I've gotten to know over 20 years.\n\nThe food over the years has gone down a bit, as they like most restaurant fight to keep their prices competitive and reasonable, unfortunately this has impacted their quality.\n\nI am still a fan because they have good Veal, Sweatbread offerings at reasonable prices.  The waitors has been around for years and still serve up good service with penguin suits.\n\nI admire their Salmone cooked with Champaigne sauce, something I've mastered over the years using Ristorante Marcello as a reference point.\nThis is why I still have a soft part in my heart for this great neighboorhood establishment that still packs them in.", "author": "David H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "The ambiance according to the restaurant is classy. That is the last thing this place is from the food to the service. \n\nIf you're looking for an Italian restaurant, and not dressed up, don't go here. they will sit you in the back with all the other non-dressed up people. That should have been my first sign to get out of there when I clearly saw more then enough tables open where the semi dressed up people were sitting.  \n\nThe lady that was serving us was unprofessional and made the restaurant seem lower then a 1 star in my book. She ate chips in eye sight and checked her phone multiple times. this was all while our water glasses had been empty for about 10 minutes. \n\nThe poor service didn't even make up for the less then mediocre food. I will never go back.", "author": "Ellie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-07", "description": "Perhaps I'm a little jaded, but when I sit down and a dirty, yellow-crusted fork greets me, I'm not a happy camper. My aunt had dirty silverware as well. Get a new dishwasher. When the lady asked if I wanted cheese on the pasta, she didn't wait for my response and put cheese on anyway, that was a little upsetting. Actually, her service in general was upsetting. This middle-aged red head looked like she didn't want to be there, and she was so sassy and rude when we asked for the most basic service. I've never really encountered such a rude, curt person in the service industry. The busboy/gentlemen in the yellow coat was a much better server; he was kind and was very respectable. \nIt's the little things that make an experience a great one. \nThe food was a solid 2 on a 5-star scale.\nI really don't know what everyone else is raving about in regard to this establishment. I'm never coming to this place ever again.", "author": "Lisa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "Yes, the interior is tacky in a \"This was probably considered classy looking in the 80s, but now it's simply aged;\" but the food and service when I've had dinner here were excellent and I was never dressed up so I don't understand other Yelpers' complaints regarding poor service in response to casual attire. I love the avocado and shrimp salad and the minestrone soup.", "author": "Becca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "If you want some real good wine and a delicious pasta dish, I'd recommend this place. It also has a full bar too.\n\nTwo of my friends ordered the Fettuccine Alfredo and one ordered the Pesto with Penne. I learned not to order something I recognize at an Italian restaurant. Its either too bland or too salty. \n\nI er..ordered something I recognized but it was just the pasta part. I had the Linguine with Volgno (garlic baby clams) and a glass of Pinot Grigio. I must say my meal was really good with a glass of wine. My meal came out piping hot and the waiter was friendly and knowledgeable about my wine questions. \n\nRistorante Marcello is a bit pricey, but its affordable. I really recommend this place for special occasions like a birthday for a family member, prom, or a romantic date. \n\nTrust me, you'll like what you see on the menu.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Love Marcello's it's Small but great food. Music is a little loud but adds to the atmosphere. Parking is a gamble but, that's everywhere. I had the Salmon and it was out of this world!! Love it! Our waiter was great! We came in from Sacramento just for Dinner! It was worth the 3 hour drive in Mothers Day Traffic!", "author": "Paul Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-28", "description": "If you are looking for a great Italian Place to eat and dont want to go all the way to North Beach Marcellos is tha spot.\n\nGreat Appetizers! Highly Recommended the Prawns Marcello, Avaocado.\n\nEntrees! Linguine and Clams with White Sauce and the Rack Of Lamb.  Oh and a great Roasted Chicken....", "author": "King L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "I've driven by this place a million times, and never thought of actually checking it out until someone who grew up in the area raved about it.\n\nThe outside of the building doesn't look very welcoming.  It's all enclosed with no windows to peak in.  It doesn't look like something that I would want to check out without a recommendation from a trusted source.\n\nMy husband and I decided to give it a try after a friend raved about it.  To our surprised, the inside looks very different.  It's semi-modern, spacious with nice deco.  All the waiters wear a tux.   It's looks like a very traditional Italian family own biz.  It gears toward families.  It does have a bar...\n\nI order the house salad and shrimp scampi and both very good.  I always love shrimp scampi.  However, my coffee/tea never came as part of the set dinner.  By the time I realized that it didn't come, it was too late already (i.e., time to get the check) so I didn't bother to say anything.  \n\nThe service in general is good, though the lady who served our table is polite, but didn't smile much.", "author": "Lolipop W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "Best escargot I've had in the city so far....ended up ordering 2!\n\nOnce you walk in, it's like you walked back into the 1980s.  Old school italian restaurant - waiter and maitre'd in old tuxedos, decor leaves much to be desired.  Pastas are pretty good, but the best for me really was the escargot.", "author": "Theresa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Food never disappoints. My absolute favorite restaurant + best veal in SF (you can cut it with your fork)...feels like home and is cozy as hell. If rack of lamb or the salmon with champagne sauce is on the specials menu, get that ish quick...so good and the lamb always sell out quick. Always order entrees as the dinner option. You get pasta and their amazing house salad. Warm bread too...wear your eating pants.", "author": "Will K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-16", "description": "I usually feel like I'm pretty \"in synch\" with other Yelpers...but this is an exception. I went to Marcello's for the first time tonight and thought it was awful from start to finish. The exterior is nondescript and uninviting, the interior is tacky (fake flowers with glitter, dusty ribbons, you get the picture). We were a party of seven...shoved into a too-tight, poorly set table, our waiter was indifferent at best, seemed generally annoyed that we had questions about the menu...the food was too salty, over sauced, mediocre. Highlights were the bartender who was friendly and efficient, the clam chowder which was good, and the calamari steaks...but all in all, the bad outweighed the good...I won't go back. So disappointing!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "The outside's very unassuming (from the lack of windows). You will definitely have trouble finding parking, but that's the price you have to pay when you drive in San Francisco...\n\nWhen you walk in you can tell that they have done little redecorating--The white tablecloths, the servers in tuxes, the decor; it feels very home-y and cozy.\n\nThe atmosphere here is very... fancy. Fancy as in you should probably wear something nice when you eat here, something reminiscent of your Sunday best--walking in with super casual clothing might give you some weird stares from people. For me, it's slightly intimidating because I usually don't eat at these kind of upscale restaurants.\n\nI had the veal milanese. It was probably one of the only times I've had veal and it was really good. For dessert I had hazelnut ice cream--or was it gelato?--which was absolutely delicious. So delicious, I would want to bathe in it. Like seriously, get it for dessert and revel in the hazelnutty bliss.\n\nMe and my significant other were being taken out to dinner by his parents, and I felt bad that they paid for our meals--it's a little on the expensive side.\n\nAs for service we were treated pretty well, mainly because my SO's parents have been going there for years and may or may not know some of the people who run the place. The servers were very polite to us.\n\nIt's a nice place to go to for a formal dinner, especially if you feel like dressing up. Me? I'm probably not going to eat here again anytime soon.", "author": "Trista B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "You'd never know just walking by, but this place is a hidden gem behind it's unassuming facade.  The waiters are in tuxes, and they do fancy things with the wine and champagne that I'm not used to (i.e. showing you the label and letting you try it first).  I find it refreshing that places still do things the old school way.  \n\nI adore the food here.  I think the prices are so reasonable for the amount of food you get!  They give you pasta and salad and a meal - and bread!  I always get the chicken picatta - yummy buttery chard and potatoes on the side.  \n\nAll fanciness aside, I always feel extra classy when I'm eating here.  It's charming and homey on the inside, with a classic feel - it's been around for over 30 years, so they obviously have got something good here at Ristorante Marcello.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Very nice meal. Minestrone and risotto were terrific. Price was affordable and service was attentive.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-18", "description": "As usual, you'll always have trouble finding parking. \n\nEven though we had a reservation for 7PM, we weren't seated until after because the restaurant was packed full of diners. There was a bar separate from the dining area for those who want to watch sports or get a drink while waiting for their seats. Over all the decor has a very homey feel. I was surprised that it was pretty noisy after we got seated. The ambiance and look felt more intimite and quite, but I guess it was too full for that. Half the patrons were dressed nicely and the other half were casual. At least I didn't feel overdressed.\n\nThe service was very attentive here and the server liked to joke with us. I was sitting alone at the table at one point and the server came by to refill my water. He joked, \"Left you with the bill huh?\"\n\nWe had the Prawns Marcello for the appetizer and it tasted delicious. Too bad the portion was so small. It left us watering for more. For entrees we had the Veal Marcello and the seabass special. When the veal came we were suprised because it just looked like it was slapped onto the plate and looked like a soggy, saucy mess. The seabass was quite a big portion. I should have asked if it was Alaskan seabass or not since that is the type I like to eat. It wasn't Alaskan, but the fish was tender. However, it was very salty and I was so sad to discover that it was dry. Overcooked fish always makes me sad. I like the potato and green sides but the fish did make me too full to finish the potatoes.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "We were greeted and seated promptly by a friendly staff person.  Our waiter was efficient and courteous.  The atmosphere was warm and cozy and all the staff made us feel at home.  The food was fabulous.  Was easy to find and get to via public transportation.  Highly recommend.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "Very pleasantly surprised by this Sunset gem. The ambiance made me homesick for the east coast and the food did not disappoint. I asked the waitress to choose an entree for me. She brought a veal dish named for someone (the dishwasher?) who works in the kitchen. It was truly amazing. I'll be back!", "author": "Sid D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-24", "description": "My friend and partner had a simple pasta bolognese. I had pasta carbonara. My dish was by far superior to the bolognese--but the bolognese was not stellar. \n\nWhat really honest offset our experience was the service. The place was relatively busy--but we were profiled based on our menu choices and somewhat \"abandoned\" comparatively speaking. At the end of our meal we were given styrofoam boxes--which is shocking considering San Francisco and California law. Our friend noticed that other guests had been given smaller plastic boxes--so we asked for those instead. Interestingly as well, the waiter (earlier when he brought our table styrofoam) dropped them off and walked away for a good while. When he brought us plastic--he immediately put our leftovers in our boxes for us. Strange first experience, decent food.\n\nNot overpriced, but around $20 for a meat dish. Will look forward to giving them one more try.", "author": "Carlos H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "I literally felt like I should be invited to Christmas dinner after eating here. It is a really sweet, family owned restaurant where everyone welcomes you. It has the charm that most restaurants don't have anymore. The bar is welcoming and after sitting there for a few minutes we met and started chatting with a few wonderful people. It is really a cohesive and welcoming environment. When we were seated and couldn't decide what to order, the waiter asked us what we were in the mood for and the waiter nailed it on meal suggestions. I highly recommend this gem!", "author": "Johanna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "Let's do the time warp again----\nOld school Italian served by waiters in tuxes. Some dishes can be hits, while others are misses. Stick with the classics.", "author": "Cynthia J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-12", "description": "We went there on a week night around 8ish.  We had to wait to be seated even though it was not busy.  The service was not the best as I had to inquire as to how certain dishes are prepared.\n\nThe food was nothing spectacular.  The prosciutto with melon appetizer was good enough.  My companion's ravioli was so-so.  My chicken rustic-style was basically lots of onions in some kind of sauce with chicken.  The chicken was falling off the bone yet not tasty - I don't know how they achieved that in such a short amount of time it took to prepare.  They must've cooked it ahead of time and then threw it in the saute mix with lots of onions.  The onions overwhelmed the rest of the dish.\n\nAll in all, I don't know why this place has an average rating of 4-stars given the lackluster taste of the food.  The prices are too high for the quality of the food.   I would not recommend it.", "author": "William L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "For a sec there, I arrived at Marcello's with a little less expectation, the building of the restaurant was made out of solid rock materials which prevented me seeing the inside from the outside, which was quite a bummer because once youve reached the inside, its actually not that bad, in fact, it had a home vibe in it. Came here to celebrate with my friends for the end of semester from college and i enjoyed the place. Its not so crowded that its loud but it had people also inside which means its not a complete silent. \n\nService wise, i think it was pretty decent, I just wished that the manager would get waitress who understands english better because everytime i asked for a little parmesan on my pasta, the waitress also adds tons tons of cheese. But overall, they welcomed me nicely. \n\nFood wise, I had the three course meal with the salad, soup of the day(minestroni)  and special Chicken pasta Marcello's, the pasta def my favorite food in the restaurant, the texture of the creamy chicken with mushrooms and the pasta was just right. I really enjoyed eating in here, had a good time too with my friends. \n\nFood: 3.5\nService:3\nAmbiance:3.5\nOverall:3\n\nI'd come here again if I was in the neighborhood.", "author": "Cavin T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-10", "description": "I so wanted to love this place, like really really love this place, it bothered me that yelped has took me to the wrong place... the only thing that was amazing about this place was that the service was amazing... that's what got me the most.. How much I love good costumer  service, but the food was horrible..........\n\nBOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO\nthe seafood linguini was freaking horrible. flavors was indescribably bad, and the chicken parmsesen maybe the worst I've ever had. I can honestly say that in comparison to the hungry man's frozen dinner and marcello's Parmesan chicken .... hungry man's is by far much better...\noh crap I forgot my Caesar salad.. that was decent, and I really wanted to like it, because the ambiance was so freaking amazing.. I felt like I was in a Scarface movie..... all in all.. maybe I will update this soon with a better review.... but as for now it sucked., and my hype was so overrated. \n\nI totally wanted to love it but i couldn't..sorry maybe next time.... I'm going to give it one more chance... one day.... or maybe not", "author": "Nina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "Dear Marcello:\n\nYou have turned me in a very, very selfish girl. I have been to your place twice this month and I have purposely did not Yelp about you.\nWhat have you done to me? I was not like this before I met you. \n\nI must let you go now - I must let others enjoy you. As an Elite Yelper, I have a civic, Yelp duty to share great reviews. As so, I have to Yelp you, and reveal you to the world. \n\nOh Marcello. I will be back. Things will not be the same between us anymore. More people will come to you, love you, Yelp you and they too, will spread how good you are to everyone.  You deserve this. I cannot bear to be so selfish anymore.\n\nxoxo, Vanessa\n-------------------------------------------------------------------------------------\nNorth Beach serves the absolute best Italian food? Hm. No.\n\nRistorante Marcello is a fantastic, Italian restaurant tucked away in \"the Set\" [Sunset District]. This place has no windows. It's as if this is an Italian food lovers secret society -- and this is the meeting place.\n\nWhen you first walk in [hopefully you've made reservations], you open a big wooden door. You walk in and there is a bar with local patrons all around - talking, laughing and drinking. On your left you see an upper level of many tables full of deliciousness, glasses filled with wine, happy, dressed up women with ruby red lipstick and big, grandpa-like men enjoying themselves. This is the place to be.\n\nThe dining area is intimate, and the waiters and busboys maneuver their way around to provide the best, top-notch service.  This restaurant has white walls, adorned with paintings. There is a fireplace near the entrance to a kitchen and you feel like you might be in grandma's cozy living room. It is warm and inviting -- very Italian. The servers are Italian and give great service - always checking up on you [but not disturbing you] & they give great recommendations on wine and what to order. \n\nThe food. Every night, Marcello's has specials. Valentine's Day night specials included: veal, rabbit and salmon. \n\nThey bring fresh baked bread and butter after you order. \n\nAppetizers - their clam chowder is creamy and comforting. \nTheir artichoke hearts was delicious and came with a great olive oil/vinaigrette dipping sauce. \n\nFor their entrees - their roasted half chicken is cooked to perfection and tender. \nTheir rigatoni with bologonese sauce is delicious. I try making my own and never again! - Italians always do it better.\nTheir Canolini is cheesy and filled with meat and some more cheese -- all the leftover cheese is perfect as a dipping sauce for the bread.\n\nMarcello's wine list is quite extensive; I personally like Rieslings when I eat Italian foods.\n\nFor dessert, they often have different flavored ice creams among other Italian desserts.\n\nYou will leave here feeling full, a little buzzed, very warm, and very, very happy.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "discovering new restaurants to try one day at a time...\n\nwe in ocean beach, daughter wanted spaghetti and meatballs.  yelp italian and here we go.\n\nno meatballs though...ordered:\n\nshrimp cocktail - straight forward, small in size but okay. bay shrimps\n\nescargot - nice ratio of garlic, butter, olive oil, hacher parsley, dipped breads in it!\n\nspaghetti marchiatte (pancetta and tomato sauce) - very good light soft pasta and perfect flavors\n\ngnocchi bolognese - one of the more doughy heavy gnocchi i've had, sauce on sweet side\n\nprawns livornese (tomato, capers, onions and olives) - little too salty for my taste, i understand the capers and olive can add to the salt flavor\n\nchicken dore (egg battered, sauteed with lemon butter) - little too lemony but i like. chicken very tender and juicy.  good to mop up the sauce with the veggies and mash potatoes that came with it.\n\noverall,  good old fashion italian out in the SUN...SET!!!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Took my friends here for their 21st birthday. The experience was good. Unfortunately, the names on the menu was not necessarily in English, so i forgot the names of what everyone ordered. \n\nThe dishes itself was very delicious, the waiter that we had was very nice. however, he didn't seem quite happy about serving a bunch of kids that look way younger than what we really are. \n\nI expected the atmosphere of this type of restaurant to be a little less noisy. The prices were very reasonable. A good place to have a date with someone special. and don't let the gigantic mushroom near the bar turn you away from this place. haha", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "Service: 5/5\nFood: 3/5 \nCleanliness: 3/5\nArea: 4/5\nPrice: 3.5/5 - it's not cheap\n\nI feel bad giving this place a 3 star, I really do. Me and my family came here because my step-dads co-worker gave him a gift certificate to this restaurant. Supposedly he said it brings back childhood memories, since his grandmother used to take him there all the time...making it a pretty old restaurant. \n\nService was nice. I believe it is a family owned business. Our waitress was very helpful in helping us choose our dishes.\n\nFood was not was I expected it to be. I was expecting more homecooked dishes with some secret sauce or ingredient but seems to be that the secret ingredient was adding extra oil to every dish. I ordered the carbonara with bacon. I was expecting to eat a creamy pasta meal with a pouched egg over it or something, but turned out to be a big plate of pasta, olive oil, and small bacon bits..I wasn't feeling it, and neither was my mother and her zucchini dish.\n\nThe restaurant needs redecorating/renovation. You can tell it's been in business for years and that the customers are loyal customers. I saw a lot of elders... but I gotta say, it's a new generation! Young people love eating and if a business is to succeed, it has to step it up with some flavaaa or that extra pinch. This place is missing something..", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-06", "description": "After seeing this restaurant had four stars on average, the highlighted review said family friendly, and was rated at only 2 $'s, I figured this place would be good to take my two friends to while I was in town.\n\nI should have walked out the moment I walked in. The first sign that something was amiss was when I realized that we may have been underdressed as we entered the place but we were still paying customers, and the reviews on yelp HAD said family friendly, so i dismissed the thought. \n\nThe hostess came up after giving me and my friends the \"once over\", and She LITERALLY pursed her lips as I smiled and asked for a table for 3. She then clucked her tongue when i mentioned we didn't have a reservation. Her reservation book was empty, she perused it right in front of me like she was looking to see if she had any space available, so why would a restaurant be upset about a walk in when there were no reservations? I would have rather just been turned away because we weren't up to dress code. We then waited about ten minutes for a table at a half empty restaurant. \n\nI knew yelp is sometimes incorrect about pricing, but I never realized how off  it could be. I would not consider $25 (on average) per plate a 2 dollar sign restaurant. We had barely sat down when our waiter came up and asked us what we wanted to drink. We were still contemplating when he rattled off all the specials of the day and walked off without our drink orders. \n\nAbout 12-15 minutes later, after being ignored by the waiter, we had to hail him down by mentioning we were ready to order our dinner. Even after our vocal notice, he continued To ignore us (didn't even acknowledge we were there) and the bus boy brought us cold water (iceless) to sip while we waited. When the waiter finally did get back to our table, my two friends ordered fettuccine Alfredo (both opted just to drink water, though the waiter didn't even ask them if they wanted anything else) while I ordered the tortteline ala panna along with an iced tea. \n\nAfter the waiter left the bus boy came and refilled our waters. Our food DID come out in record times, but my iced tea was missing. I didn't mention anything was amiss because I wished to see how long it would take them to realize their error. The whole time we sat at the table, the waiter walked past us over twelve times to serve the customers around us. 4 other parties that came in after us were catered to first, 2 of those parties received their meals first. never, during his waiting other tables, were we asked how our food was or if we needed anything. The fettuccine, so I'm told, was mediocre at best, and my tortteline was in one of the saddest excuses for a sauce I'd ever seen or tasted. \n\nThe only saving grace of the whole meal, was the bread that they served 3 moments before our meal came out. After we were finished eating, the bus boy finally came out with my iced tea. I told the man we were already done eating and I didn't want it anymore. Why was the bus boy serving us anyway? The waiter served drinks at the other tables, why hadn't he served us? \n\nthe entire time we were seated, not once had the waiter come up and asked us how our meal was, or if we needed anything else. He didn't even check our water glasses, which were empty halfway through the meal, mine even before he had taken our orders. he did ask us if we wanted dessert when he handed me the check.\n\nafter i payed for the check, wanting to get out of there as quickly as possible, I didn't even realize they had charged me for the iced tea I hadn't even received, let alone drank, until the END of dinner, until after I got home. \n\nBefore we left the building, one of my friends went to the restroom, once we had  left, she mentioned that the servers she walked by on the way back to our table had all given her dirty looks. I will NEVER recommend this place to anybody. I've been more attended to at a coffee shop than I have here.", "author": "Tabitha O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-12", "description": "I had heard that this place was old school and had been drawing a crowd of regulars since the 70's, but I was still surprised to find our table to be the only one without a person over 70.  That combined with the fact that it has obviously never been remodeled, give it a serious time-warp feel, which is actually pretty cool if you're into that sort of thing.\n\nAnyway, I'm not exactly an italian food connoisseur, so I just tried something that sounded old school: the spaghetti alla matricianna.  Best spaghetti ever.  Other people's dishes, like the pesto pasta, weren't as phenomenal.  The other major dish of note is the spumoni: it's the real thing.\n\nIf you're up for the ambience, you could certainly have a good dinner here.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "O how I love to find new and wonderful gems.  When you are outside of Ristorante Marcello, you brace yourself b/c it looks like a seedy bar.  You expect that when you open the door, you will be surrounded by smoke (well two women were smoking outside already).  You are pleasantly surprised to find a paradoxical atmosphere of fine dining and relaxation.  The waiter is extremely funny and kind.  Regulars come there as frequently as a daily basis.  The clientele were senior citizens minus myself, mom, and a couple.  The gentleman next to us stated, \"I don't use Facebook or Twitty! LOL When I talk on the phone, I don't need all that stuff, just hello-goodbye.\"  Ahh, where else will you find awesome people like that?\n\nI ordered the ravioli with pink sauce (mix of white and red wine), and the portion was just right to fill me up.  My mom was so cute and hesitantly asked the waiter to explain some of the dishes.  He was more than happy to do so.  She ordered the spaghetti with pancetta, etc.  Bonus: They have two flat screens at the bar, and the waiter chatted with me about my beloved Giants.  We ended the meal with a passion fruit sorbet--refreshing!  I can't wait to go back to eat and relax again!", "author": "Steph W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "Take a trip back in time with classic Italian dishes.  I enjoyed the old school feel and the proper tuxedo'd wait staff, white tablecoth's and all.\nThe food was very good, wait staff friendly and a FULL bar.  \nReminds of the old days as a kid eating in those Italian joints in the North East near NYC, Philly, etc", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "fantastic.  i thought this was my father's kind of place (steak, potatoes, overcooked fish...) Wrong - really delicious, fresh, perfectly prepared and a Real Cocktail as accompaniment.   Yum.", "author": "Artemis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-29", "description": "When my girlfriend and I sat down at a table her bread plate had a thin layer of yellow grease on it, and both my wine and water glasses had small smudges on them. I scraped a bit of red pasta sauce off my wine glass, and maybe it was butter on my water glass. The reason we stayed though was because the staff was really nice and friendly. The food was pretty good, but I wouldn't say awesome.", "author": "Matthew J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-18", "description": "If I could give no stars, I would! They are, by far, the worst place I have ever eaten in my entire life. \n\nI went there to celebration a special occasion and wish I had opened a can of tuna for dinner instead. The food was not fresh and it all  tasted canned. I wasn't famished but the waiter had decided (for me) that he was going to give me (and charge me) for the three course meal. When I had mentioned that was not what I ordered, he argued with me. The salad looked and tasted like vomit, the fish was rank, and I couldn't stomach anything else. The bill was about $20+ a head and no one ate. \n\nI don't know how they have so many good reviews but if you want to eat your food, go some place else!", "author": "Dayana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-09", "description": "Abysmal. I am shocked that this restaurant has received such great reviews so far. I ate here with my boyfriend's visiting family (all of whom LOVE Italian food) on a recommendation from a friend. That friend is now no longer allowed to recommend anything.\n\nI had the pasta primavera, which was among the worst I've ever had. (Seriously, a Michelina's microwave meal would have been more palatable.) The uninspired mix of vegetables (broccoli + cauliflower?) were both soggy and flavorless--I suspect, because they were frozen. The cream sauce was mediocre, though admittedly I've had worse. They only offered one kind of pasta: spaghetti (don't bother asking them to cook it al dente). My fellow diners had cheese ravioli (decent) and beef ravioli (which everyone agreed tasted very much like chef boyardee and was, also, likely frozen). The bread was cold, stale and inedible. Though we were still hungry at the end of the meal, we could not bring ourselves to order dessert, for fear of what we would receive. \n\nAs for the atmosphere....it was like walking into an estate sale in 1963. If the Brady Bunch house had a love child with a swap meet, that child would be this restaurant. I can not fathom how some reviewers deign  to call this place \"classy.\"  The best I can say about the decor is that the dirty doily curtains (hanging from crooked tension rods) perfectly complemented the popcorn ceiling. The stuffed animal head replicas peppering the bar, moreover, really balanced out all the paintings of \"the old country.\" The fact that the waiters are required to wear tuxedos  against this drab and utterly confused setting is all the more troubling (if not laughable).\n\nI will admit, though, that the waitstaff was very, very nice.", "author": "Catherine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "I usually come dressed up, but I had just come from the beach and I was wearing casual clothes. I noticed a big difference in how nice they were to me. Still good food at a reasonable price, but the difference in service and the fact that no one came by to refill my coke or water makes me want to drop a star.", "author": "Chris I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-05", "description": "This is my favorite Restaurant in the Parkside Neighborhood. \n\nFor those who go to Marcello's expecting grandiose service and California inspired cuisine are out of their element and should look elsewhere. Marcello's is not part of the Hip San Francisco Restaurant scene, nor does it strive to ever be apart of such a movement. Rather Marcello's is representative of a time when neighborhood establishments where viewed as a place to gather with friends and family for events big and small. A place where people know you, a place to have a formal celebration, or just a rowdy Saturday night with some friends. At Marcello's the atmosphere is always friendly and inviting. \n\nWith all of that being said, not a thing in Marcello's has been updated since the day they opened - including the bus boy. This is not a bad though - it adds to the eclectic ambiance. I also find it ironic at the Italian Establishment that all of the waiters are Irish Immigrants. \n\nThe service is different than one would expect for Bow Tie sporting Irishmen. The waiters and bus boy are a little slow to the draw, but what they lack in speed the make up for in personality and friendliness. You never leave Marcelleo's feeling unappreciated. And furthermore you should not go to Marcello's expecting James Beard Golden Fork Service. \n\nThe food and cocktails at Marcello's are always consistent. I would recommend \"Frank's Salad\" and the \"Veal Marcello\". I would also recommend the full service dinner that comes with soup and pasta. The apps are also a good bet as well. Their wine list is weird, but very reasonably priced. You can get a bottle of Jordan Cab for half the price of anywhere else. \n\nThe other night me and a group of 6 of my friends went in for dinner armed with 5 of our own bottles of wine and purchased another 7. I don't exactly remember leaving, and was a little embarrassed to return, for fear that we upset the staff. But much to our surprise, when we returned they bought us a round of drinks and told us that they were glad we were back, \n\nThat is just the kind of place Marcello's strives to be.", "author": "Jack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-20", "description": "Hands down the best veal in town.  They have many ways of preparing veal and each is outstanding.  \n\nIt's very \"old school\" but that's not a bad thing in my book, as long as the food is good quality.  \n\nI have been going to Marcello's for decades and I have never had a bad meal.  The veal, as mentioned, is fabulous.  If you can get it with the porcini mushrooms- order it because Marcello, the owner, hunts high and low for the best porcini's.  They also have a dynamite porcini risotto.  I sometimes order that entre as an appetizer for the table.\n\nThey offer each meat entre either as a \"dinner\" selection or \"a-la carte.\"  The dinner menu includes soup or salad- great homemade dressing, pasta, and a decent  portion of the main dish with potatoes and vegetables as a side/ sharing the main plate.\n\nHomemade pasta sauces are all delicious-great palce to have alfredo sauce.\n\nOverall Marcello's is a great place to go if you are out in the sunset and don't want to schlep downtown for old school Italian food.", "author": "Edmond S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "I came here on a Friday night, and dude, parking was impossible! Holy crap, but luckily, I found parking just a block away! We came in and we were already 30min late for our reservation due to some personal reasons. But the owner was nice enough to let us get the nice table. \n\nEveryone in here was basically a regular. I felt kind of left out with my boyfriend, not because we were the only young Asians, but because I felt like everyone knew each other. Oh well, that's not going to ruin my night!\n\nOur waiter was pretty nice, however, it took awhile for him to come around to start us off and to take our order. It took him about 20-30min just to come around to greet us. The place was pretty packed as well, but still no excuse to leave us there with our bread crumbs. \n\nWhen I finally got the menus, I couldn't read a damn thing but only the ones that are closest to the English language of course! I had to text my brother to translate some of them on google, yeah how pathetic of me! I ended up getting this shrimp dish, and mann, it was bomb diggity! My boyfriend on the other hand, he didn't like his dish at all. He had some chicken leg dish. \n\nBottom line is that I wouldn't come back here. I wasn't feeling the atmosphere, and neither was my boyfriend. \n\nnote: about $23 includes, salad/soup + pasta +entree + tea/coffee. That sounds pretty sweet until I found a hair in my pasta......", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "I'm a bit shocked that some people give this place less than 3 stars.\n\nI've been here twice and I can't think of a single thing that's wrong. The food is great. The service spot-on. The place is clean and the staff are very friendly.\n\nRack of Lamb was tender. Cheese ravioli was fresh and the sauce was delicious. Full bar and a large wine list. Perfect for date-night or satisfying that craving for some delicious Italian food.", "author": "Christopher B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "Marcello's is a conundrum. If it were a person, it would be one of those older women you sometimes see that you know used to be really hot.  She still puts on full makeup and gets her hair did twice weekly, wears gaudy jewelry and maybe even some tasteful animal print. She has designer sunglasses. Even though her exterior is kinda tacky, she's somehow so charming and classy in temperament that you can't help but feel intrigued by her.\n\nThat's how this place is. It's like someone's throwing a black tie gala in a Holiday Inn from 1967. Charming somehow.", "author": "Mari C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-12", "description": "Funny how I had to wrote a bad review in order for the owner to notice. I went last year close to the end of baseball season and finally have time to write review regarding bad restaurant(s). Were there a rule that I can't write a review in so many month later on a restaurant?  The owner wrote back tried to make some smart @ss remark. Well guess what...you did turn us down when we walk into your restaurant. You were act all cold toward us and didn't even tell us we have to turn over a table in certain time. All you said was, sorry no table, all reserve. We walk into  your restaurant where is was empty, there were only 2 tables with customers. I don't just love good foods, I also look at customer service. Don't worry, I don't mind if my family is not welcome at your restaurant. In anyway, I have to said Thank you. Because you sent us out of the door with your unwelcome attitude.That have give us a chance to enjoy our dinner with a better restaurant where not only their foods was delicious and they truthfully treat all customers like family.", "author": "Kat S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-07", "description": "For the \"Italian Place less Than Two Blocks Away From My Apartment\", Ristorante Marcello is indeed, \"A-Ok\".\n\nOnly been here a couple times, both times were with a party of 8 or more.  Me, the bf, and his various family members (Mom, Dad, 3 lil bros and respective significant others).  Each time our dinner was remarkably unmemorable.\n\nNow I don't mean this as a bad thing.  The service wasn't bad, kinda.  It was busy and we did have a rather large party, the average party size was about 4.  Seemed like we were somewhat ignored in getting drink orders and then returning to take our dinner orders, allowing other people to be seated and then order, thus causing our food to TAKE FOREVER to come out (annoying).  But the food was fine, nothing amazing, but decent Italian.  I myself had the Chicken Parmesan, kind of hard to mess up, and they didn't.  But others who order Scallopeni or Piccata were less than thrilled.\n\nIf I'm in the mood for Italian, even though I live less than 2 blocks away from Ristorante Marcello's I'd head else where.  Although prices really aren't that bad. Ok, so, if the MUNI was broken and I was drunk and couldn't drive I would def go to Marcello's.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-27", "description": "Excellent from start to finish! We moved to the neighborhood 6 months ago and never tried this gem until now-wow! SO good! I started with the carpacio which had a great dijon sauce and capers while my husband had the escargot and both were exceptional.We both had vodka martinis which were lovely. Then, I tried the veal saltimbocca with prosciutto and he had the veal Marcello with a Marsala sauce. For dessert, I had an Italian wedding cake and my husband had strawberries with a grand marnier sauce.Great service and food!", "author": "Antoinette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "Marcello as noted by other reviewers is a hidden gem in the outer sunset/park side district. From the outside you would not be able to tell what to expect. My boyfriend and I conjured up weird ideas about this place as you cannot see what awaits you from the outside. Inside, you'll bedazzled by the friendly people, decor, and atmosphere. \n\nThe service is impeccable! Our waiter was a good joker and though I'm a bit shy, he made us feel at ease. He was able to give excellent recommendations for our meal and I can't believe he caught me trying to look up the dishes on my iPhone. He was kind enough to ensure me that I was in good hands when it comes inquiring about their Italian dishes.\n\nI have only been to one other Italian restaurant in the city but my boyfriend and I can tell that the food here is delicious without it being overly \"arrogant\" (right amount of flavor without being over powering or too fancy for my palate.)\nYou know that old Olive Garden commercial \"when your here, your family\"? Well Marcello definitely gives out that vibe and the dishes reflect that. The veal scallopini was full of tender veal and mushroom goodness, the flounder nice and flaky with a distinctive white wine taste and their minestrone soup was nice and thick and not too watery kind of way. The meal ended nicely with chocolate truffles that tasted like they were made in the kitchen, rich, velvety and dark.\n\nDefinitely 5 stars! The people were friendly, the waiter provided great service! Food, decor is fabulous!", "author": "L H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Great service and yummy food! Brought my elderly father and they were very accommodating. Will be back solo and with dad again!", "author": "Kristi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-28", "description": "Marcello has a old fashion classy feel and is a place were you walk in and will feel under dressed if you're going in in jeans. But regardless of how you're dressed they will service you no different than others. Our waiter was friendly and informative. The meal was slightly on the expensive side for what you get. We had the Carbonara, Frutti di Mare, and Veal Eduardo.  Pretty standard type of meal. Tasty like it's suppose to so not a very memorable meal even though the meal was good.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "I love Ristorante Marcello. It's very homey and the food is awesome. We always seem to get the same waiter and he deals with my indecision about what to get by helping me order. He figures out kind of what I want then fine tunes it. I really love this restaurant. The waiters actually know what they're serving. They can tell you if the fish came in fresh or frozen. They can tell you what's in the sauce and who made the recipe.\n\nIt cracks me up to read a couple reviews from people mentioning they got ignored because they dress like slobs. That really makes me like Ristorante Marcello even more... I don't want to go to there and be surrounded by slobs. It's not an fffing pizza joint.", "author": "Art L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "Went there for the first time tonight with my dad. A slow Tuesday night at about 8pm.\nWe had a wonderful experience!\nHe ordered one of the specials of the night, the sea bass with a caper sauce(which he seemed to enjoy). I had the eggplant Parmesan. \n\nI originally thought this should be a 4.5 star rating. But the place was so nice and hospitable that I decided it deserved to be rounded up to a 5 star rating.\nI only say 4.5 because the eggplant Parmesan was a little odd; it had a white sauce under the marinara (which made the eggplant extra soft, but also added a strange gravy-ish flavor). Both dishes came with sliced potatoes (sort of like au gratin) and greens on the side, maybe close to kale greens or something like that. But they were still both good enough dishes that we took the leftovers home.\n\nVery lovely atmosphere. Wonderful waiter and busser, both of them joked around with me and my dad. The busser took my wine glass away as soon as we sat down at the table, which peeved me for a second, but I look younger than my age, and it's not like it hasn't happened before. \n\nWe got the dinner meal with the salad and the pasta, which ended up being so filling that we weren't able to really crack into our entrees. Yes, the entrees did take a while to come out, but I think in general the restaurant is accustomed to people ordering this particular style of meal and allowing time between the courses for digestion.\n\nThe atmosphere is very comfortable, with a little bit of class added in. I felt under dressed compared to the wait-staff, but not compared to everyone else in there.\n\nOh and also they have a wonderful selection of wine!\n\nSorry this review was all over the place! \nI'd definitely go back because of that atmosphere and would love to try some of their other dishes.\n\nI wish the outside showed more of the character of the inside though, because this place is a gem!", "author": "Chaslin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-17", "description": "Marcello's was a flashback experience, a throwback in time to the classic neighborhood Italian eatery. The menu, while extensive, isn't fancy, but features classic Italian dishes. Marcello is quite the mushroom hunter, and if you're lucky, his restaurant will have some fresh mushroom dishes as a special. I had a very nice veal scalopine al funghi with fresh porcinis mushroom; very flavorful with a nice touch of lemon in the sauce.\n\nThe place was pretty busy for a Wednesday night and service was a little slow. But our waiter took pretty good care of us otherwise and I'd certainly be happy to go back.", "author": "Bruce H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-26", "description": "Went here on a recommendation.  It's definitely old school Italian decor and the owner is old school too.  My wife is Italian and we had a hard time placing the region, but she often orders a \"staple of chicken piccata\" to check things out.  It was well tender, but under seasoned.  My meal was rather bland.  \nI'm okay with the decor and the owner seemed like a nice guy, but the service was really poor.  The waiter was good at spin, but as an example of several...They brought my wife her wine at the appetizer and my drink came with the meal.  I'll leave it at that.  I won't seek the place out, but might give it another chance if the stars align..", "author": "Scott K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "Nice neighborhood restaurant.\n\nFood was very good\nWait staff ho hum; accommodating with orders but not much attention given for that special occasion you may be celebrating. \n\nOverall, nice restaurant for dinner, fair market prices and comfortable atmosphere.\nIf I were celebrating an anniversary, birthday, or some other occasion I would go elsewhere.", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "When you're hankering for old school Italian, linen tablecloths, waiters in black ties, head here. Service is great and the food is good.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-23", "description": "This place is what you would expect from an italian-esque restaurant in the outer sunset. \n\nApparently it's been there for 30-something years, according to the other reviewers, and I think that is absolutely awesome. It's a cute little place inside, it has a homey vibe to it. Lots of mushrooms hidden around the place, not sure what that is about. \n\nMy boyfriend and I were greeted when we walked in by the owner, Marcello. He had kind of a grumpy-grandpa thing going on about him, but seemed to be very friendly with the regulars. Being friends with the regulars is a great way to do business, but not being friendly with the new-comers is a great way to encourage them not to come back.\n\nA couple came in shortly after us and stood in the doorway looking confused, they weren't even acknowledged, and eventually asked if they should just seat themselves. \n\nOur wait for our table wasn't very long at all, considering it was a Saturday night during dinner time. They seem to do a decent amount of business, and have just the right amount of seating for a Saturday night. I did not see many people waiting for tables after us. \n\nThe food was extremely unmemorable and kinda over priced for what it was. I ordered the baked salmon and my boyfriend ordered the seabass. We were served basically the exact same dish, same stale potato (\"fries\"?) pieces, the same bland wilted greens with boiled onions in them... and the same sauce on our fish. His had capers on it. \n\nThe best part about the meal was the house pino nior, which they served generously. \n\nIt wasn't a bad experience by any means, the service was a 3 out of five, the wait time was short, the wine was good, and the food was mediocre. \n\nI likely won't be returning any time soon.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "Dining here is like getting in a time machine and traveling to a bygone era in San Francisco. \n\nYou'd almost think that cast members from the Soprano's could walk in and sit at the table next to you. In fact, it looked like a few were! A real old school Italian feel here. From the menu (simple typeset and large variety of food selection), the low key atmosphere and consistent personal service we experienced made me visualize a nostalgic yesteryear.\n\nThe food is remarkably delicious. And unlike the old-school-era vibe, everything we ordered was a timeless Italian classic. Even for my more discerning foodie partner!\n\nOverall I was impressed with Ristorante Marcello and I recommend it as a must check out restaurant  if your dining in or near the Sunset District of San Francisco.", "author": "S M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-20", "description": "I really love this place.  It's an old-style Italian restaurant, complete with accented waiters in tuxedos.  (Diners are dressed relatively casually, though!)  Good food, good wine.  Good service.  What else could you possibly need?\n\nThe place was relatively crowded on a Tuesday night, which I took as a good sign.  We sat down and were fed bread and butter and water immediately.  Service was quick.  Our meals came with salad which had a great house dressing.  Two of us ordered the special salmon in a champagne sauce, which came with pasta with marinara sauce, served before the entree.  To me, that brings to mind Ragu and noodles, but it was actually really great--ziti with parmesan in a bolognese sauce.  The salmon itself was delicious--cooked perfectly and very tasty--with spinach and potatoes.  I ordered a Pinot Noir to go with the salmon, which was also a great pour One of my fellow diners ordered another special--ravioli with cheese and veal in a red sauce.  Everyone loved their entrees.  Granted, they were specials and we may not be able to order them again--but after food that good, I would order anything that looks good at this place.\n\nFor dessert, we split the Creme de Cacao and Creme de Menthe parfaits.  Also delish.\n\nReally, no complaints here.  Entrees were $11-$25, for whatever it's worth.  Great Italian food.  Highly recommended!", "author": "Erin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "I love the old school feel in here. There are also no windows in here which makes it perfect for clandestine maifioso meetings in the thick fog of the outer sunset. The food is average, nothing special, but the ambiance and vintage atmosphere is the perfect place to sit at the bar and have a Manhattan or other strong throw back drink. The staff is cool and mellow, and there are a few tv's perfect for watching a game. So hit the bar!", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-15", "description": "So, remember when you were 8 and your mother sent you into a store and remember how the shop people would glare at you like they just knew you were a shoplifter?  This is how we were greeted by the hostess.   Glare.  Ice. Glare.  Ice.  No smile. No welcome.  Just stomped in the direction of the dining area with 2 menus encrusted with previous diners cruddy finger prints and other mysterious things.   It went downhill from there.\n\nEntrance:  cool looking old school bar area, nice. \n\nDining room - everything is painted white, even a formerly beautiful  old fireplace is painted white.  Strange white curtain panels everywhere.  Stark contrast to the bar area.  Airports are more welcoming and warm that this joint.\n\nLooking over the menu we see the white walls speckled with sauces and other crud.  Trying to ignore it . . . .\n\nThe menu - old school which is fine, what we were in the mood for.\n\nThe food - Every single thing missed to boat    A chicken dish looked like flattened mystery chicken piece with sauce dumped over it and on top of that melted processed cheese.   Avocado salad was slices of avocado with a strange dressing - we never figured out what the little orange bits were (they look like crushed up sushi bar fish roe)  Pasta dish something microwaved from Trader Joe's would have been better - and I don't shop at Trader Joe's or microwave anything. \n\nSomeone recently wrote a review and said the food is \"exquisite\"  Mama Mia . . . .  I've been to Italy multiple times, I've eaten Italian on both coasts of the U S multiple times, this food is as close to being exquisite as McDonalds.  But then I suppose there are people who adore McDonalds, so wadda I know?   \n\nAnd so, judging a book by it's cover - would it be too much to ask that they remove the graffiti that's been on the outside of the building for years?", "author": "Cinnamon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Great food, but gnocchi aren't homemade. At least they were honest about it. Otherwise everything was perfect. Real italian food!", "author": "Saso M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "This is the place to go if you want a truly vintage Italian American dining experience from the 50's and 60's.  The decor hasn't changed a bit for 40 years, the bar deserves some kind of hip retro status (though it is undiscovered as far as I can tell).  The waiters do wear tuxedos and have all the grace and charm you would expect if you went dining with your grandparents. \n\nPerhaps the most authentic thing in this place is the way they process money.  There are no digital cash registers or credit card terminals here.  It is all done by hand, on paper!  Just like they used to.  \n\nI have even seen some well dressed senior Italian men there with some menacing solidly built bodyguard types in suits - draw your own conclusions :)\n\nThe menu is a slice of Italian American food heaven from 50 years ago with all the classics, some of which I haven't seen in a long time like Sole Almandine etc.  The food is good.  And I am sure would have been considered top notch in 1958!  However, food has changed a lot since then, so I am not sure it's really up to snuff with current favorites in this competitive city.  That said I really enjoy the menu and always enjoy my meals with a classic martini or two. \n\n Go to Marcello's for the whole experience and you won't be disappointed.  If you lived on the tail end of those times like I did, it will kick your nostalgia glands into full gear.  If you are younger, it will possibly seem foreign and wonderful like something out of a Godfather movie.   Or if you have no sense of retro, it will seem stuffy, dark and mediocre.", "author": "john h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "Wouldn't walk in in jeans and a tshirt (the way I did, ahem). Definitely more of an upscale type place (although reasonably priced for the quality of food). Food was fantastic. And by fantastic, I mean made by some kind of crazy international chef and his team of food specialists, fantastic.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-27", "description": "This is not a quality Italian restaurant and I can't figure out why people come here...and I know quite a few that eat here regularly.  The restaurant is dated in terms of decor, the crowd is older as well, and there is no music or any kind of atmosphere.  The service was ok but they forgot to bring two items out after being asked a few times.  \n\nThey have a full dinner option when you order your meal, which comes with either soup or salad, entree, side of pasta, and tea or coffee.  I think that's a good deal for the price - most plates were in the $21 dollar range.  That would be a good deal IF the food tasked good.  But I was disappointed with the meal.  \n\nThe minestrone soup was ok but a bit standard and salty, not restaurant quality.  I ordered fish, which was very think and heavily breaded.  I couldn't taste the fish at all, just the breading and the heavy butter sauce it was in.  The side of sliced potatoes and zucchini were plain and cold.  My Friend had the veal and other types of fish and were not impressed either.  The side of pasta was served with some meat sauce on top and was bland and cold.\n\nbasically, we all left feeling unsatisfied with the meal and that we had overpaid for the food/place.", "author": "Frida C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-13", "description": "This is a great Italian restaurant....ideal for those who don't like to leave the Sunset. The waiters are entertaining and you're assured to never leave the place feeling hungry. It's a comfy, friendly place to dine with family. The minestrone soup and gnocchi are my favorites.", "author": "Bernadette W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "This blast from the past is my husbands favorite restaurant in the city.  Now married with children, he took me there on out 2nd date.  To say at first, I was bewildered at his infatuation would be an understatement.  However, overtime this place has grown on me as well.  The staff, which has not changed, is very very nice.  The food which perhaps was a little old school for my snooty tastes has really grown on me and I CRAVED when I was pregnant.  Very consistent and yummy food from an excellent staff with excellent value and relatively easy parking.", "author": "Slone F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "This place was absolutely amazing.  I think part of its charm is the fact the it is completely unassuming from outside.  The decor, atmosphere and food are almost perfect.  It's like you've gone back decades.  The only reason I give it four stars is that the service was pretty inattentive--no one filled my water without me asking first.  They need another bus boy.  Also, the bread wasn't warm.  There's something about an Italian food that demands warm bread.", "author": "Seth E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "This place is interesting.  Service is good, definitely has an old-world feel to it.  Reminds me of 1930's ganster films.  Even the front door is a non descript black door and there are no windows.  however, this just helps the atmosphere and the food is very good.\n\nThe only criticism i have is that my GF ordered a salad and it wasn't the most exciting thing i've ever seen.  Just a bit of lettuce, cucumber and tomato on a plate.  it even had raw mushrooms sprinkled on.\n\nThe pasta i had was very good though, tasty, a good sized portion and not overly expensive.  Big menu too, but i usually find that detracts from a restaurant.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-09", "description": "Went into this place not knowing that the attire was dressy, my friends and I got good food, but the bread wasn't even warm and the butter wouldn't melt, so that was a fail. But the drinks are strong and they didn't ID my friend who just turned 21. A lot of mirrors too, and decent service. I've had better Italian food for a better price.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "Went to Marcello's this past weekend with friends who wanted to have Italian food. They had never been to Marcello's before and are well accustomed to good Mediterranean style foods. \n\nThey loved it! We all had one of the house specialties, the veal Marcella. So, delicious, with plenty of veal and just the right amount of mushrooms and artichokes. The thinly sliced potatoes and streamed spinach was the perfect amount on the plate and mixed well with the Marcella wine sauce. \n\nThe house was full that Saturday night, which I think is an indication that people know the food is good and at a affordable price. \n\nThe dinner price is a good value as you get choice of soup or salad with a side serving of pasta for the day. And then a cup of coffee or tea at the end of the meal. Dessert is separate. \n\nWe shared the creme brulee, a very rich and satisfying custard with caramel sauce. \n\nParking is not easy to find along Taraval Street. L-Taraval trolley stops a nearby. Best to call to see if reservations are needed on weekends because house gets full quickly and there can be a wait. \n\nStill a good value and a neighborhood favorite with friendly staff and atmosphere.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "I have been going to Marcello's since as long as I can remember.  It was one of my dads' favorite spots.  Marcello himself is usually there to greet you when you come in with his warm smile.  The food is quite excellent, some of my family's faves are the shrimp Marcello, shrimp covered in bread crumbs, rosemary, and cheese, the house salad has a wonderful hand made dressing made with fresh herbs, the Calamone, calamari prepared like abolone in a light batter with lemon sauce, the chicken ferri garlic and herbed chicken, the peppered corned steak to name a few.\n\nAlso as several other yelpers have said the wait staff is very good. They ware tuxedos just like the waiters at OJ's on Taylor used to.  They are attentive and can offer some good tips on wine and daily specials.  Marcello's is definitely one of San Francisco's special spots.", "author": "Pat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "This is an old school Italian restaurant.  Be expected to see some old folks wearing fur coats here.  Service is quick and friendly.  Prices are reasonable.  Portions are generous. Server has good understanding of the menu.  Waiter never pushed us to open a bottle of wine even we came as a group.  Food were great.  We ordered rack of lamb, New York steak, pasta, grilled salmon .... everyone seems to be happy with what they had.  Be sure to make a reservation.  They get busy all the time.  The night we came they had some kind of wine tasting thing going on.  They had complimentary cheese and strawberries to go with the wine.  The only thing I think they need to pay attention is the dinnerware.  It's a bit out of style.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-29", "description": "My family and I have been eating here once or twice a year since I was six. So that's about 16 years, for anyone who's keeping track.\n\nThe food is always impeccable. My dad always gets the Veal Lombatina, and my mom says the shrimp scampi is to die for. I am a huge, huge fan of their homemade tortellini with meat sauce.\n\nOh. Oh, my goodness. I almost forgot. Their minestrone soup. Oh. Don't even get me started. I can chug that stuff. I can't even...I don't even know how to explain how wonderful it is.\n\nThe waiters can be a little pushy, but they relax a little if you joke with them. A lot of those waiters have been there since I was small.\n\nI think I'll be going to Marcello's for the rest of my life.", "author": "Cara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "This place is fantastic! Both times we have eaten there, we showed up without a reservation and were welcomed warmly. The food is fantastic...don't miss their house salad, with the dressing. It's so good you want to lick the plate. The pasta is fantastic and plentiful, unlike the trendy \"new\" Italian restaurant. I LOVE their linguine vongole is amazing. One day I hope to make it to  dessert as I am sure that is terrific too.", "author": "Simone D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-13", "description": "Time tested and time honored. I've eaten here numerous times. Sometimes the service is a little slower than others, but it's always been, at worst, good. Love the food, love the atmosphere, and love the clientele.  Some of the regulars have more stories than you can finish drinks. Great stuff from the old days.\n\nThe pan fried calamari is to die for, as is the house salad. They make a martini like it should be, and there's nothing *healthy* on the menu. It just doesn't get any better. \n\nAnd, another word on the service. I was entertaining a group of six from out of town. At the last minute, everyone wanted genuine Italian. I called, they recognized me, and said they'd work us in. We arrived an hour later to a very busy restaurant. 45 minutes later we were seated. I have no idea how they did it. If service was a little slow for you that night, my apologies. My friends from Chicago and NYC still talk about how great Marcello's is.", "author": "Harry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Marcello's has become one of our haunts to go to on Saturday ....better get a reservation because they are very busy.  Never have had a disappointing meal there...the staff are very accommodating....and friendly....It is a nice place for a couple to eat at when it is a special occasion...they don't rush you at all...", "author": "Patti L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "I only live a block away and have been reading about it on Yelp, but it was only tonight that I decided to actually go in and take a look.\n\nI think the first thing I noticed was that the restaurant was not as dark as I had expected and somewhat noisier.  Also, the crowd was a lot younger than I'd expected from the other reviews, but then again, it IS Feb. 14.\n\nCame in at the same time as another couple, no reservations, at 9PM, and I think we were all seated within 15 minutes, which wasn't bad.\n\nThe complimentary bread was typical for restaurants of this type, but I liked the butter.  For the main course, I got a rack of lamb, which was one of the specials.  It came with 8 pieces of lamb and some potatoes and cucumbers.  It's a good thing I didn't order the full special which would've come with soup/salad and pasta, or I don't think I could've finished it all.  But I do want to try those, maybe next time (I was also sick, so my appetite wasn't fully there)\n\nSpecial things of note:\n\nThe waiter noticed my Cal jacket and said Go Bears! when I went in, and also as I left. +$1 tip\nHe made more conversation and jokes than 99% of the restaurants I've been to, which was great!  More waiters should do that.  +$1 tip\nHe didn't make a comment or stare at my very... untraditional date.  +$1 tip\n\nSo I think I ended up overtipping by 20% or so.  But I do expect to go back in the future, preferably with a more traditional date so I consider it a good investment (sorry, weighted companion cube, but I do expect my date to speak to me...)", "author": "Yeh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-16", "description": "It's been said before but it should be said again - the \"old school\" atmosphere of Marcello's holds a lot of its charm. The staff is friendly and relaxed, the menu broad enough to satisfy any italian craving and priced really decently considering the whole package. If you're really hungry try one of their dinners - comes with soup or salad, pasta del giorno (usually bolognese) and coffee for about $25. The waiters take the time (when they can) to get to know you and I've been hearing something lately I never thought I would in a city - \"The usual?\" \n\nDefinitely a San Francisco gem that I hope is around for years and years to come.", "author": "Mindful Indulgence S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "- Outside not inviting but inside looks nice.\n- Good marinara sauce\n- Good portions\n- Service was very good.\n- Get the Strawberry sunset dessert \n- \"Never go against the family\"\n\nI don't think I would've even bother trying this place out if it wasn't for several Yelp reviews. The outside of the restaurant doesn't compare to how it looks inside. The place has no windows to look at until you take a peek inside.\n\nThis Italian restaurant is truly a throwback of what all Italian restaurants used to be. The servers are wearing bow ties and tuxes. The decor has a classy Italian feel.\n\nIn some way i felt a bit under dressed with my jeans and t-shirt but after sitting down, I noticed nearly everyone was dressed casually.\n\nWe ordered spaghetti primevera and the roasted leg of lamb dinner. The red pasta sauce was very tasty. It's obviously hand made. It didn't have the  typical overwhelming tomato sauce you usually get from other places.  The lamb wasn't what I expected (it wasn't on a bone) but it was still tasty. The portions were just right to even fill up my hungry appetite.\n\nFor dessert we had the strawberry sunset. It has strawberries with ice cream spiked with some alcohol- quite good!\n\nThe service was very attentive and were on the ball with anything we needed. Great service.\n\nOn our way out I noticed there were old school peep holes on the entrance door. I thought wow... I feel like in a \"Godfather\" Movie.", "author": "Bert T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-26", "description": "I have an opportunity to try this restaurant, taking date in a foggy night.  Even though I did not make a reservation (because I wanted her to choose which restaurant to go), the owner allowed my date and me to be seated in a short time.  \n\nI ordered a Cros Du Val Merlot as she liked red, but I thought that wine would not be versatile with almost any dish.  My prediction was right, as it was smooth enough to be complimented with my ravioli and her veal/mushroom dishes, yet characterful enough to be enjoyed on its own.  \n\nShe wanted to have escargot, so we tried.  That was the first time for me (and her) to be served with escargot tongs.  I was somehow able to grab a shell with it, but she had a hard time.  It was very cute, and of course I let her eat it by bare hand ;).  Oh, the escargot was tasty with pasto-like sauce.\n\nI ordered angle cake, while she ordered sandae.  She definitely enjoyed the food, and the service.  The old woman who was sitting next to us told us that we were a cute couple.  I know I know, that obviously skewed my rating, but what can I say...?", "author": "Tak K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-26", "description": "Best Italian in the city, now that the Gold Spike is no more.  A great place to take a date on a weeknight when all you've got planned after dinner is a cocktail and some bed-wrestling.\r\n\r\nReservation times are a bit flexible but the bar is a very well-stocked and comfortable place to wait.\r\n\r\nEdit: I went back this week for the first time in maybe a year and the service sucked.  The waiter came by twice in the first five minutes to take our order and we told him we needed a few minutes still.  Then we didn't see him for a good while.  He was friendly, as usual, and we weren't too put out.  But it also took him forever to drop the check.  I used to wait tables so it's a peeve for me.  So Marcello looses a star.\r\n\r\nThe food was still excellent, but maybe I've got more dining out experience and now I think it's a little spendy for what you get.  The bill was over a hundo for two people with a bottle of wine and no dessert.  And as good as it was, I've had better.  With so many other Italian spots in the city, I don't think it stands up.  Damn.  Down to three stars.\r\n\r\nAll that being said, I'll probably end up there for some family thing some time and it'll be better.  And I'll take this all back.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-01", "description": "I've passed by here probably a bazillion times before in my life and have never had any urge to go inside.  The outside seemed very lonely and boring.\n\nI finally decided to come here after reading great reviews on yelp!\n\nInside was very much different than the outside.  It was LIVELY and full of people deep in conversation.\n\nBf and I were quickly seated in between to pairs of couples.  It was kinda close, but still I had my own little space.  I sat on the long couch, and all the ladies separated each other with their handbags.  \n\nI had the deluxe dinner, veal special; bf had the seafood pasta and clam chowder.\n\nAll the hype about the butter and house salad......it was just regular butter, and just a house salad.  My meal also came with a penne meat pasta, that was yummy.  My veal indeed was tender, but not very flavorful covered with too much sauce.  I dont know what kind of veggies I had, but they were very soft.  potatoes were a thumbs up.  \n\nBf's clam chowder was wonderful!! \nHowever, his seafood pasta was kinda 50/50.  The pasta was good, sauce was good, but the clams were rotten.  Like you couldnt see it, but you could taste it.  They were UBER fishy tasting, and was not edible.\n\nWe did not complain, service was TOO nice to complain.  \n\nOne waiter in the yellow asked us, \"shui?\" meaning water in chinese, and then said \"xie xie\" meaning thank you.  It was kinda racist, but also very funny!! \n\nAt the end of the meal, the waiter forgot my cappuccino and later brought me a dessert on him.  \n\nOKAY, i gave this restaurant 3 stars as I was writing this review, but now that i recapped how much i liked the waiters and service, 4 stars it is.", "author": "kim w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-31", "description": "Fancy?  No.\nInnovative? No.\n\nThe restaurant has been around since 1979.  It doesn't look like they've changed anything since.  It's more than a little bit worn and slightly kitschy.  \n\nThe reason you go to Marcello's?  The food.  It's simple but they do it WELL.\n\nMy Italian grandfather dropped out of school when he was in the 4th grade and cooked his entire life.  He was a fantastic cook.  \n\nHere's what I'll say:  My mom ordered the Minestrone soup.  She took a bite and said that it tasted so much like nonno's she wanted to cry.  My dad and I each tried it and we concurred.", "author": "T M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Excellent pasta and meat dishes, generous portions and a solid wine list. Marcello's is a dependable classic and their minestrone is about as authentic as it gets.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-04", "description": "Many of my good friends are in the 70 & up age bracket. They all swear by Marcello's. A place must be good if you've gone there for 20 years straight. No one keeps a pricey habit on a pension unless it's worth it! It hails from the same camp as Joe's of Westlake, but dare I say it-- the food is better. \n\nMarcello's does have an old school feel, and by old school I mean: class. The decor is comfy, like you're in the large living room of someone you really like and the service staff are excellent. They make you feel like the place is yours. Take time to get a story out of your waiter on a slower night (which isn't often in this neighborhood haunt), there's something fun up his sleeve!\n\nI've taken large groups there on multiple occasions, and the service is always perfect. I agree with the rating below, it is a perfect place to take family, or friends who are family.", "author": "Erin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-25", "description": "Old school Italian restaurant. \nWe had reservations for dinner and arrived a few minutes early. We were told that it was going to be a few minutes until our table was going to be ready. We camped out at the bar and had a drink while waiting. A few minutes turned into 45 minutes and we saw several other people being seated before us. The food was good and the drinks were strong but based on the long wait I probably wont be returning", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-14", "description": "Tony Soprano walks in for a \"family\" dinner. At the bar are the Black Donnellys with their crew. A Beck look-a-like accompanied by a dark-haired Kirsten Dunst look-a-like. The rest of the patrons are from the movie Cacoon with a Driving Miss. Daisy thrown in. Marcello's is kitch-o-rama. One walks in from the darkness that is Taravel St. to a burst of energy and interior only found ...well ..at  the Madonna Inn or a Jersey Lounge. All the same, with so much charisma, it's a pity that the food can't match. \n\nWhat can you expect from a night at Marcello's? A crowd of seventy-somethings, slow service, good energy, nice staff, fair Italian family-style food, and ...the reason to go... throwback interior with throwback Martini's!! \n\nThe wait staff dress in dinner jackets, evoking a by-gone era befitting a 1940's cruise ship line. Though I wish their food was closer to that of Delfina, you can't buy this kind of atmosphere anywhere.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "I was craving some Italian last Friday night, but was too lazy to travel far for it and definitely not up for Olive Garden. I just wanted some seafood pasta in a nice wine sauce. So as the BF and I thought of Italian places in the Sunset, this was pretty much the only place we could think of besides OG. We'd driven past this place a million times but it always looked closed.\n\nSo after doing a quick yelp search on my trusty iPhone, we decided this place might be worth trying. And I'm glad we did. This is not an out of this world good Italian joint, but it is good. BF ordered the chicken saltimbocca and I had the spaghetti di (del? something starting with a \"d\") mare, the seafood pasta I craved. \n\nThe Good:\n-The service--our waiter was very nice and kept offering me generous portions of parmesan for my pasta, which I accepted as I like lots of cheese on my pasta but I didn't want to seem like a piggy asking for that much cheese.\n-The atmosphere--just like other yelpers said, it feels like a restaurant our of an italian-American mobster movie. A la The Godfather or the Sopranos, which is perfect for BF, who dreams of eating Carmella Soprano's cooking and recites lines from Scarface. Our waiter with his accent sounded like he was a Sopranos character. \n-Food was good. My pasta wasn't quite as wine-y tasting as I like for my seafood pasta to be. but it satisfied my craving. Saltimbocca dinner came with a side of pasta, salad or soup, side of veggies and potatoes.\n-Parking's easy to find.\n\nThe Bad:\n-Price. Price is reasonable the pastas, from $12-16, but it was $20 for the meat dinners. I think it's a little cheaper minus the side of pasta and salad, but still.\n\nSo 5 stars\n-1 star for good but not spectacular food deserving 5 stars\n-1 star for prices just barely within my budget\n= 3 stars, but I would eat there again should I have a pasta craving while in the Sunset. Or if the BF ever feels like pretending to be Tony Soprano.", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-16", "description": "I have been eating and getting food to go from Marcello's for over six years now and I have been a very loyal customer. Last night, I got a chicken liver dinner and eggplant parmigiana dinner to go and I have to say that I was quite disappointed with the quality of the food.\n\n\n I mean I just didn't feel the usual love! Where is the love?\n\n\n The salad didn't have as much mushed-up goodness, and my chicken livers were dark and freaky looking, and not very delish.\n\n\n I certainly hope this is just a fluke. An off night, perhaps.", "author": "henriettaol"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-26", "description": "I am so excited about this place.  It's close to where we live, and it was excellent tonight!  I mean, I have been waiting for years to come across a veal piccata like this one.  Unbelievably lemony and tender!  The salad that I got was crazy good- it had fresh avocado, shrimps, hearts of palm, radish, carrot, and crisp lettuce.  I already want more of everything.  My husband's sea bass was so tender, I couldn't believe it.  I usually only like the endangered sea bass (Chilean).  Bread was fresh and yummy, and what they called gelato for  dessert really was gelato.  (not ice cream trying to pass for gelato)  I love this restaurant and can't wait to go back and maybe try a pasta dish.\n\nOh yeah, the atmosphere is definitely \"old school\", but I see nothing wrong with that.  The waiters were charming and friendly, and we were clearly surrounded by patrons who were very happy to be there- young and old.", "author": "Allison A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "Let me start by saying we got here at 7pm on a Thursday when most of the neighborhood was out of power. So apparently everyone went to Marcellos. It was very noisy. Lively, happy diners, so it was a good thing, but my old mom was impossible to converse with. So that was slightly annoying. But its not anything I'm lowering the stars for.\n   My mom got the chicken picatta, which she really liked. It looked very homestyle, and it was a good amount of food. I got the pesto tortellini, which was okay. I don't know if what I want is impossible, but I am constantly looking for a pesto dish that isn't suuuuper oily. I know pesto is oil based, but I just love the basil & garlic flavours & wish there wasn't a big pool of oil at the bottom of the bowl when I was eating. I understand it, but its just unappetizing. Eh. \n   We shared the tiramisu for dessert....it was not good. I am saddened by this. The restaurant seemed traditional Italian, so I figured the tiramisu would be super amazing. Of course I'm not Italian : /  It was kinda rubbery & tasted a bit stale, and I expected the liquor flavouring, which didn't deliver. Boohoo.  \n   For my pesto tortellini & tiramisu, I would give 2 stars. But since my mom really enjoyed her chicken picatta, 3 it is. Meh.", "author": "Dakota M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-08", "description": "Marecello's has fantastic food,we have been going to them for a lot of family functions.  They know how to cook their food perfectly.  My favorite is the calamari steak and their special salad with the artichoke hearts is really yummy!  Hope they stay there for a very long time,so I can bring my grandchildren someday.  Thank you!", "author": "Annalisa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-22", "description": "Terrible service. They'll only take care of you if you're a large party. Parties of two are automatically ignored. Guess they know what they're doing since they've been around for a while. Can't comment on the food since they never bothered to take our order after waiting for a while and being \"too busy\" to serve us. What a shame.", "author": "H I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "What can I say - if you're looking for classic, old world Italian food, you can't do much better than Ristorante Marcello.  A friend from work introduced us to this place (she grew up in the neighborhood) and it was a wonderful surprise.  Taraval can be a busy street, and from the outside it doesn't look like much of a place.  But wait until you get inside.  Marcello himself greets and seats you.  The waitstaff are all dressed up in tuxes and very professional, and the food is classic Italian food.  I had the chicken parm and it was wonderful.  Not too breaded, lightly sauced with a nice amount of cheese.  Served with a nice house salad, pasta, veggies and potatoes, and coffee.  What a wonderful treat to find such a nice place in such an unlikely spot.  I'd definitely go back if I found myself over there around dinner time.  Lot's of other things on the menu I'd like to try.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "This place is old school San Francisco Italian. The food is good and they have all of the more interesting dishes like frog legs (which are fantastic) and shortbreads. This alone means big ups from me. The pasta sauce is great, as is the minestrone, and their profiteroles are incredible. The service is fantastic and the characters in this place are classic San Fran. Basically I'm here every time I'm in the city and I'd recommend it to anyone.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-27", "description": "I went for dinner with friends last night & must say that I was less than impressed. I haven't been to Marcello's in a long time & last night reminded me of why. We waited 15 minutes to be seated for our reservation & then had to wait another 30 before anyone came to take our order. By the time the waiter came to take orders, we'd all forgotten what the specials were and had to ask what they were again, which really pissed them off. That's what they get though for reading the specials & letting you sit for 10 minutes before coming back to take orders. \n\nThe place was insanely hot & they only brought water for half our party. When we asked for more they said they couldn't because they didn't have any clean water glasses.... bring it in a fucking coffee cup I don't care... \n\nThe food was good, but hardly & I mean HARDLY top notch.\n\nGiven that it's way out in B.F.E and plays host to the blue haired ladies society I think it's safe to say the place is way past its prime.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-18", "description": "Not every plate will come out the same. My linguini had plenty of clams, but barely Any sauce. My friend order the same thing n had plenty of sauce. Great service though, so the stars are basically for the service", "author": "kiki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-24", "description": "Think about \"The Godfather\" when you come to this place.  Marcello's serves traditional Tuscan-Italian cuisine.\n\nWe stumble upon this place when we were looking for another Italian restaurant on Taraval.  We didn't find it, so we decided to try Marcello's.\nThey almost turned us away because it was packed and we didn't have a reservation, but some people left and we had a table.  The guy did say that they get busy, so reservation is recommended.  \n\nMy finance had the homemade cheese ravioli, in a white sauce.  This was extremely good dish.  It was rich and creamy, but not too cheesey.  It was perfecto!  The bread is ok, but their butter is really good.  I had the wild salmon in champange sauce.  This was damn good. Although this item was one of their specials for the night.  \n\nFood was excellent.  Services was great. Butter was heaven.  I would highly recommend Marcellos.", "author": "Nam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "Been going here since the late 70's with my parents before the Gold Mirror became a tired joke.   Love this place, mostly for the seafood specialties and spaghetti carbonara (when I fell like being especially bad with my diet)  casual atmosphere.", "author": "Sfgpgirl G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "This place is great. Good portions on the food. The staff is always friendly and they all have been there for years. I used to live down the street and would go here pretty frequently. I left town for a couple years and one of the first things I did when I came back was take some friends out to Marcellos. Has an old school feel to it. \n\nPark the car close because you won't be able to walk very far after getting the dinner here.", "author": "jared c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-11", "description": "Decided to try this place out on suggestion from a guy at the local bar I go to from time to time!\n\nI loved it! It totally reminded me of the places I went to with my parents growing up in New Jersey! It's like walking into an episode of The Sopranos. Old, east coast style, traditional Italian restaurante. \n\nThe waiter was awesome! The service very good!\n\nThe bread was nothing special, great butter! The salad was awesome! Awesome being traditional Italian style overly dressed vinegarette. The Veal was delicious! The greens were kind of strange but otherwise it was basic!\n\nThis place is good but I could see where most west coast hipsters wouldn't like it! On the contrary I could see myself hiding in the corner of this place on from time to time!", "author": "Elle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "Good Wine, real butter, good service!!!!  What more is there...  Great old world atmosphere with a nice bar and great bartender...  The hostess could use a lesson on customer service, but that is not enough to skip this neighborhood gem!!!", "author": "B M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-31", "description": "We have been long time fans of Marcello's.  It is an oassis in the Sunset for dining and a gem in San Francisco over all.  Dining at the tables is always great, but even more fun is having a less formal dinner experience eating at the bar.   A great bar-they really know how to make a martini.  Some of our favorite dishes are Frank's salad-I would love to know how they make that dressing-the salad is filled with avacado and shrimp, delicious.  Another must try is Prawns Marcello-fresh prawns baked in a scalloped dish covered with the most wonderful breading...go just for those two items...go back to try the rest of the menu, cuz it's all good.  Great pastas, a wonderful pepper steak and so much more.   Like I said, we are long time fans...check it out.\nKelly", "author": "skippy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "Love it!  Any place with tuxedoed waiters has alot going for it off the bat!", "author": "Michael D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-30", "description": "I brought my friend here for her birthday as she loves old style Italian.   The highlight of the evening was the prawns appetizer which was so tasty I could have ordered it as an entire entree.  Unfortunately, the dining experience only got worse.  \n\nThe house salads tasted like they were prepared in advance and left sitting in the fridge case too long.  Blech.  The veal piccata was overcooked and underseasoned, while the eggplant parmigiana was bitter and rubbery.  The sauce was watery and didn't taste fresh.  \n\nWhatever you do, don't come for the first dinner seating or be prepared to gobble down and get out within an hour.  Before we even had a chance to order a birthday dessert, they were trying to scoot us out the door.  Our table was seated near the host station and he kept pointedly telling a waiting couple that he was waiting for our table.   The host was some old guy - don't know if it was the owner or not - but shame on him.  It wasn't like we were hanging out for hours sipping water.  \n\nIn hindsight, I would have skipped the aggravation of ordering dessert which tasted stale.  I have had better out of the frozen dessert section in the supermarket.  \n\nWish I had taken my friend to the Gold Mirror down the street instead.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "my sister-in-law hosted her rehearsal dinner at the restaurant where her now-husband's parents had their first date. definitely sentimental! the staff was very kind and was able to run things pretty smoothly. our meal was pretty standard, but it was a great place to host a celebration.", "author": "Marjie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "Ok first off, if you go there at the right time, the doors might be closed, but it's actually open, you need to open the door. Once inside, it's a nice place and all, but this is NO OFFENSE to Caucasian people, but that place was FILLED with Caucasian  people. I think my friend and i were the only ones there who were not Caucasian. It was very awkward, because firstly, i didn't know what kind of place it was, and the attire my friend and i were in, probably wasn't up to their standards. BUT, overall for the SHORT time we were there, the waiter was very nice, the service was very nice, the place was clean and such. I think if we didn't feel so awkward, and if we had known what the things on the menu actually were, we would have stayed.", "author": "Ernest C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-15", "description": "The food was terrible. The meat sauce tasted like salted dog food with off brand, old tomato paste. The fish that my girlfriend got smelled like a fish packing plant in the summer and tasted like sardines mixed with feet. It made both of us slightly ill. They bait and switched my girlfriend from the al la carte pasta to the meal, then tried to charge for the salad that they brought us that we didnt order and didnt eat(because it was gross) and tried to justify it. The prices were outrageous for the school lunch quality of the food. All of this was on valentines day no less. Ignore the positive reviews, they are either people who work there or people who got extremely lucky. This is simply the worst dining experience of my life. I wish we had gotten frozen pizza's at trader joes and just stayed home.", "author": "joshua b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "Oh Marcello's, how I dream of your minestrone soup every night. No for real though, they have the best minestrone I have ever had......I always try to get the recipe from our waiter but to no avail. My fiance and I have been going to this restaurant a few times a month for the last few years and love it dearly. While I can say that the restaurant can do with a little updating on the decorating side, it has a great atmosphere and everybody is so warm and friendly. The food is awesome and the drinks are good, how can you beat that?! Hands down its the best restaurant in the sunset.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-17", "description": "one of the BEST restaurants ever. the veal parmigiana is top-notch, their other choices are so delectable but too numerous to name. the pepper steak will knock your socks off ! all the waiters are wonderful, especially Patrick -- I would marry him if he wasn't already ;-)\n\nthe bar is well-stocked, well-manned, and well-visited by moi !", "author": "Prima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "i have been going here for every special occasion I can remember since i was just a kid and it never changes the waiters and the food are always the same, exceptional!  If you like shrimp try the scampi you won't be disappointed  it's the best!", "author": "Rosie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-24", "description": "This is another restaurant my grandmother and I go to (we have a dance card of about five restaurants we go to for dinner), but we don't go nearly often enough. The parking is extremely difficult. As I have said before, it is hard to find parking in the Sunset, and this restaurant doesn't have a parking lot, so my grandmother likes to park in the driveway of the nearby auto body shop, since they're closed when we go. I order the same thing every time I go. So far this is the only place I have been to that knows how to prepare veal. Normally, veal isn't something I would have even tried, let alone even admit to eating, but once you've had it here, you'll understand. Compared to Marcello's, I think other restaurants serve regular beef (or whatever the heck it's called) and try to pass it off as veal. I can't comment on the prices because Nana pays when we go out, but I can say the service has been consistently excellent over ten years. Although they're usually packed when we get there, I think we only had to wait once for a table, and that time we sat at the bar and had a drink. It has a neighborhood feel at the bar but feels slightly classier in the tables section, perhaps because there are steps up to the tables? Elevation = superiority? At times it can be a little loud, but I'm usually too busy eating to care.", "author": "Ivy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-04", "description": "Been here a couple times for dinner. The ambiance is like a classic Italian dinner-house. I always tend to stick with Caesar or hearts or romaine, the spaghetti Bolognese, the panzotti, spicy spaghetti all'amatriciana, a gigantic veal chop or pollo ai ferri for my main choices. I always make reservations so I usually don't have to wait long to be seated.", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-01", "description": "So I decided to try Marcello's just because I wanted Italian around my neighborhood. I was expecting a lot from this place. But no, it was horrible. I was not happy at all. I ordered the Spinach Salad and Clam linguine. My boyfriend ordered the New York Steak which came with soup and pasta. As our soup and salad arrived, the waiter asked if we wanted Parmesan Cheese on dishes. Mistakenly, he was only referring to my boyfriend who had soup. My bf told him \"the lady would like parmesan cheese on her salad\". The waiter goes and says \"Oh but this isn't for salad.\" Well, excuse me, I like parmesan cheese on my salad. THANK YOU. My clam linguine came and as I glanced at it, I already knew that it wasn't going to be good. The linguine was so dry and plain.. I had to ask for lemon to give it some more taste. The waiter refills our water and says water in Chinese. Really though? Was that necessary? What if I wasn't Chinese? Gee..I was being stereotyped.. I don't think I will be coming back again. Their service and food did not satisfy me.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-24", "description": "I LOVE this place.  Old school Italian at it's finest.  Very friendly place.  The food is FANTASTIC.  Be sure to get the minestrone.  I really can't say enough good things about Marcello's.  I'm a lifelong patron for sure.  I'm so happy I found this place.", "author": "Jeffrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-19", "description": "we love this restaurant! We have been going here for years and never have had a bad meal. It is consistently good. Their minestrone soup is the best I have ever had. There is nothing not to order on their menu. Every time I have visitors in town we go here. Marcelo is a REAL Italian chef from Italy and he knows how to cook. I find this place to be good and reasonably priced. This place is popular so be sure to make reservations. Absolutely the best Italian in the area, so I highly recommend it. You will not be disappointed.", "author": "Paula C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-10", "description": "The Sunset is filled with little old Italian men, if you know where to look.  You can find loads of 'em at Marcello on a Sunday night...er...a Sunday later afternoon-like maybe 4PM.  Marcello is an original, the spaghetti del mare is wonderful, as is the gnocchi, and you must try the Frank's salad.   My dad drives an hour to get that salad...he pretends to want to see me, but really it's the bay shrimp and house dressing.  Um.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-01", "description": "3 stars and no more.  \nThis is an ordinary family style Italian restaurant. with ordinary food.\nThe Rack of Lamb was very tender and they gave 7 ribs, but it was over seasoned with pepper and rosemary. The New Years eve night prix fixe dinner was $60.00. per person.  All it did was force you to eat items you don't normally want. The small plate of  tortellini were fair - and nothing to brag about with ordinary sauce on it.t. The house salad with shrimp had a good dressing but it drenched the lettuce leaves - Then the dessert....the choc mouse cake was okay and didn't have  much flavor and seemed generic like something you'd find in the supermarket freezer section. The ice cream with fresh strawberries with amaretto was the most refreshing. For two, the bill came to $135.00 the 3 course dinner + dessert and two cokes, no wine, no drinks.  It was not worth that price as the quality and taste was inferior. We're Italian, know Italian food and this just didn't cut it for us. Wait staff were very nice and the service was pretty good. Coffee was weak and just okay. I don't think we would go back.", "author": "Girly Foodie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-15", "description": "Marcello is an ok Italian restaurant in the Outer Sunset. It seems to cater to an older clientele, so my group and I felt out of place. The waitstaff are all in tuxes, which can seem slightly pretentious, but they are friendly. The decor is not as stuffy as I imagined; the main dining room was bright and pretty airy. The reason I'm giving Marcello three stars is because of the food. I didn't find anything impressive, except maybe the calamari steak that my sister ordered. I ordered eggplant parmesan and minestrone soup, and neither were tasty or anything special. Frankly, I think I could get the same stuff from the Olive Garden.", "author": "Cee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "We were in search of  old school Italian restaurants.  First impression was great.  Large bar area, old school decor, waiters in bow ties.  From there we moved on to strong cocktails, very friendly service and excellent food.  I've seen places like this described as somewhere your grandma would take you.  Hey, I loved all my grandma's (long story) and yeah they probably would have taken me to Marcello's and we would have had a great time - plus now I get cocktails.  Cheers Grandma!", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "My amazing aunt and her husband took me and my husband here and it was unforgettable.  You would never know how special this place is from the outside, it looks like nothing special (but that's part of the fun), but inside such a different story.  Wonderful atmosphere and equally wonderful food.  Order the salmon!  A truly remarkable restaurant.", "author": "Whitney W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-25", "description": "Food was tasty, service was not. Guy was nice, but we waited way too long to order drinks and because that took forever, we were ready to order food but he walked away right after getting the drink order & didn't come back for another 6 minutes. We got our food quick, but I ordered just a chicken breast for my son when I saw the prices & I asked if they could do just a chicken breast b/c my son doesn't eat anything else; our server said yes. You'd think he should have added \"but you still have to pay for the whole entree\" so that the check wasn't a surprise at the end. Nobody came to see how our meal was, nobody was even around to pull aside to refill our waters, so we had no water half-way thru the meal. We ordered dessert, after he finally noticed we were finished with our meals & that was served quickly, again, which is great, but why does it take forever for the server to figure out that his table needs something? Like the check? Isn't dessert the last thing someone orders? Then the surprise of my son's chicken breast, which cost $17.50. WTF. I called ahead of time to make sure this was a family-friendly restaurant, which clearly it wasn't. Maybe the lady who answered the phone thought I was asking about if it was ok to bring my grandparents, not my child. Because everyone was definitely at least 40 years older than me. The decor matches the clientele & the wait staff probably moves slow to support the pace of their regulars. We only chose to eat here because I didn't want to drive all the way to Fisherman's Wharf for some clam chowder. I should have turned around the minute we walked in.", "author": "Lachelle J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-05", "description": "This place is SO random.  I was dragged here by friends who'd just moved to the Sunset.  We walked in, not knowing what to expect, and we were really out of place.  Marcello's is really old-school, both in decor and demeanor; the kind of Italian place where the waiters wear tuxedos, and almost yell at you for not talking fast enough.  Customer service is kind of non-existent, but food is ok. I imagine it's a good neighborhood go-to for Italian, but definitely not worth trekking all the way out to the Sunset.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-23", "description": "THE BEST RESTAURANT EVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! this is one of my favorite restaurants in the sunset. i absolutely love their house salad and pasta. MMMMMMMMm and their veal, my mouth is watering as i type. lol. this place is a must. i plan on going here this coming weekend.", "author": "bridge A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-23", "description": "Two friends and I met at Marcello's thinking it was quite good in the past years.\nMy friends ordered Tortellini, Fillet of Sole and a Palm heart salad to share (which came up as an artichoke heart salad as the server had not listened carefully so it went back). \nI ordered one of the specials of that Friday night: Rack of Lamb! I ordered it med-rare. I was looking forward to it.  When it arrived it was already sliced to each rib. I took one bite, did not taste like any other lamb I ever ate. I am a Mediterranean I know lamb! Hello, it was BRINED!!\nIf anyone ever ate brined lamb ribs or any kind of lamb I would like to know where so I will not go there! My friends tasted it as well, one of whom does not like lamb even she agreed that it tasted nothing like lamb.\nI was and am very disappointed.. Tortellini was good, I tasted it, so were the potatoes and the vegetables which came with my  \"BRINED RACK OF LAMB\". I did not want to spoil the evening, did not send it back, just gave it to the sweet Golden Retriever Ruby (minus the bones).\nIf you ever order lamb at Marcello's please ask if it is brined and insist on finding out or just skip it!\nWhat a disappointment!", "author": "Yasmine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-29", "description": "I went in for dinner and didn't particularly care for the entree but didn't want to make a fuss.  Soon, Marcello comes to my table, yells at me and tells me to never come back.  I've never had such an experience as this and promise to not go back.  Customers should not be insulted just because they don't care for the food.", "author": "Robin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "The food was alright. The ones I went with praised it. But I guess I'm more of an Americanized Italian fan. The busser was charming. Our server had the smile on, but barely gave us any service. And he wrongly charged a dessert from the table next to us on our bill. He had a smile on the whole time though, so I give him that. I don't think I'm likely to come back. Oh yeah, one downer is that the whole menu is in Italian with no english descriptions. That caused a bit of hassle.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "We have eaten here two or three times now. The waiters dress formally. I like that.  They do not introduce themselves by name and say that they will be our \"server.\" I like that too. When I am in a restaurant and a person wearing a black suit, white shirt and black bow-tie approaches my table and gives me a menu I don't need them to tell me they are a waiter. I do not care what their name is. This is a business transaction. The ambiance is unostentatious and friendly, seems to have old-world class. We had a reservation and were seated promptly. Our waiter knew the menu and was easily able to tell us about the specials, answering all our questions in a friendly way.  The bread was fresh. We started with a rich dark minestrone. Salad is also an option on the dinners. Then came a serving of the house pasta with a tasty meat sauce. Cheese is always offered and generously supplied. They serve good quality Parmesan with lots of flavor. I had sea bass with a lemon and caper sauce which was really good, lemony and savory at the same time. My entree came with a delicious serving of chard and some sliced potatoes which were perfect for getting up the yummy sauce.  My dining companions were all happy with what they ordered. The wine list is reasonably priced. One of my dining companions was my father. We were celebrating his 91st birthday. On the way out I noticed happy looking people drinking at the bar. As we left the owner asked us if all had gone well. This is a great place and we will be back.  According to my mother, who has lived in the Sunset for a long time, this place is what the area used to be like decades ago.", "author": "Willy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "Came here for the bf's birthday on Friday.  We started with the escargots and they were delish.  We ordered the special which was roast leg of lamb and it was good.  The place was really loud and busy which was cool.  I had the hazelnut gelato for dessert.  Service was good too...I'd come back again.", "author": "Jade B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-08", "description": "i hope marcello's is still around when i'm, like, 70 and able to finally \"fit in\" with the rest of the crowd.  Old School in a very, very, very good way.", "author": "Trina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-31", "description": "The food was very delicious and very filling. My BF and I ordered from the deluxe dinners that come with soup or salad, pasta, and after meal drink of tea or coffee. The menu was kinda hard to decipher unless you're a major foodie or just know Italian food. I know I had the shrimp scampi on the deluxe menu but it was called something else. BF had the veal. They have like 4 or 5 veal dishes. Very tender but it was the first time I had veal so can't say much about it. As for the pasta, it was a penne was cook to perfection and had a really good meat sauce.  We also had two types of vegetables that came with the meal. I didn't really care for it much. The potatoes were really cute  when I first saw them but they were kinda dry on the edges and as Alton Brown on the Food Network says, \"that's not good eats\". They did serve bread with our meals. Not so sure about the butter being really, really good. They didn't skim on the bread either like most places do. So I like that especially since I'm usually really hungry by the time we sit down.\n\nAll in all, I think the regulars know exactly what they're getting and stick to the tried and true method. \n\nI would like to try the homemade ravioli now that I read another yelper's review and save room for some dessert...", "author": "Judy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "Very old school Italian Restaurant. I've been coming here since I was a kid. The waiters are very friendly and are willing to tell a joke if you're listening. The minestrone soup is really good and so is the pasta. The entrees are filling and if you're not full by the time you leave this place, then you have an extremely big appetite. I'll keep coming back to this place as long as they keep serving up those traditional Italian dishes.", "author": "D J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "I really loved the feel of this place. The service was awesome and that's why I give them four stars. But the food was not so great which was very disappointing because I have heard great things. I had the Alfredo and it had no flavor plus the ling with clams tasted like the white wine had not been reduced and all I could taste was wine. I am going to go back and give it another try because the service was so good and of the great things Ive read on yelp. I really want to like this place.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "Marcellos is a throw back kind of place. Every time we go, we run into people we either know or have met before at Marcellos. \n\nThe bar is a great place to start and have a nice cocktail. The Manhattans are perfect, and that's how we like 'em.\n\nA few steps up into the dining areas and the dining fun begins. The atmosphere is cheery, friendly and efficient. The food is good basic Italian style. Although not spaghetti and meatball basic. They have great seafood and veal dishes and an always perfectly done NY Strip steak. I recommend the carbonara hands-down, best I've had.\n\nWe've had lots of family dinners here (25+ people) and everyone always gets a hot meal, served at the same time.\n\nThe tuxedo-clad wait-staff is the best and they do everything right, without being cheezy, they even sing \"happy birthday\".", "author": "nancy l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-07", "description": "I've never had a bad meal here.  I love the bar and I love the penguins.", "author": "Mieke V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "You know the place is good whenyou run into a couple of north beach natives who've been around more years than I know they'd want to admit!!  I've been going there for years and have always insisted North Beach restaurants have nothing on this place.  But, when I see a couple of the boys in there raving that it's better than any restaurant in North Beach I sit up and take notice.\n\nThese guys tell it like it is... perhaps why I never ask them if my butt looks big in these pants... ah, but I digress.\n\nIf you're looking for consistently very good italian food - you've found it!\nRistorante Marcello's!", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-22", "description": "Best restaurant on Taraval.  Tony is a great waiter, very pleasant and when he's not too busy he's good for comic relief as well.  The few times i've been the food has been nice and comes out relatively fast.  Place is usually busy but they take reservations.", "author": "Joel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-08", "description": "I've only been here once, but I definitely want to come back.  For one, I love restaurants that don't mind a throwback to days past, like male servers in ties and tails.  The interior is sparsely decorated, but clean and warm.  A long bar dominates one side of the long rectangular building , with tables lined up along the other wall.  Fare is traditional Italian, the fish is excellent, and it features a solid wine list.  Parking can be challenging because it's SF, but if you are in this neighborhood try it out.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "There is a door that opens onto 2100 Taraval.  The building has no windows and there doesn't appear to be any people going in or out....it says Marcello's on the outside...so it must be the place.  It's a cold and rainy Friday night at about 7:30.   The six of us walk in and the place was just packed to the rafters and as loud as can be...it was electric with people enjoying themselves.  Better wear your sun glasses and day makeup though...it's bright in there.  We were treated like old friends.  You will get a hearty meal, good service and at a reasonable price.  Marcello's is the kind of place where the food, while very good, seems to place second to atmosphere and old school charm.   Marcello himself was as nice and generous as could be.  Chances are, you won't be disappointed.", "author": "Larry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-29", "description": "The food was decent but the service was a bit questionnable. This is definitely an 'old guard' Sunset establishment. The clientele wasn't particularly diverse and the vast majority looked as if they were over 50. Not complaining, mind you, just giving you a sense of the environment there. The food was...okay. Not great, not bad, just okay. I feel like it's not something I couldn't do at home with a solid recipe and a few minutes. Probably wouldn't go back but if you like 'homey' Italian food and the old school environment, this might be for you.", "author": "Bethany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-09", "description": "I love this restaurant because I feel like I have stepped back in time.  If Don Draper from Mad Men were Italian I would expect him to drop by and have a drink at the bar alone and stare into space.  The waiters all dress in tuxedos but customers feel right at home wearing sweaters sans jacket and coat.  Ok maybe Don Draper would feel a little over dressed but he would enjoy the food if he ate something rather than drink scotch.\nWhat I also love about this place is that if you want to split an entree they do it agreeably  without a condescending attitude as some restaurants do.  If you bring your own wine they are happy to open it and even suggest decanting it for you.  They do charge a corkage but that is only fair  and I have no problem with that.  Also if you want to have more vegetables and forget the potatoes that is fine too.  Actually you can't do anything wrong here, the customer is always right.  A rare attitude with some restaurants.\nThe food is tasty, and served warm by a friendly waiter. \nIf you like the 50's and 60's when things were easy,  comfortable, normal and uncomplicated you would love Marcellos.", "author": "Sally F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "Great neighborhood Italian. Taraval street car stops right in front.  My wife and i discovered pasta alla matriciana here - absolutely the best past we've ever had - and we LOVE pasta. Now we have to go whenever we get a craving!  Service is good/competent, wine list is varied and reasonable but has very limited by-the-glass offerings.", "author": "G T S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-26", "description": "Here is a great Parkside gem if you are in the mood for very high quality Italian food that is well executed and complimented by excellent service.   For starters, I showed up there with a party of five and without a reservation when the place was totally packed.  The staff was very friendly and made us feel comfortable waiting for a table to clear up.  The atmosphere is certainly old school, as you are inclined to find out in Parkside.  For me, that is a good sign, not like the over crowded low quality touristy joints up in North Beach.  Once we sat down, the real fun began.  Once you have picked a wine from their ample cellar, move on to making a selection of appetizers.  I highly recommend the avocado and shrimp salad.  If you are in a large group, pick a few more and enjoy the familial atmosphere.  Any selection of entree is sure to satisfy.  Marcello's is a little expensive, but the price is comfortably reflected in the quality and service that they provide.  Good for an unpretentious-yet-fancy romantic date, or a graduation dinner.", "author": "Mr. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-31", "description": "Not amazing, but not bad.  So the basic vibe here is traditional Italian, with a whistling owner/matre d' patting backs and greeting long-time friends with grace, candor, and old time humor.  The food is good, and the bar is large and features more than a few fantastic regulars.  So why only three stars?  Well, there's a place called Golden Mirror, which is very close by, and does the exact same experience, but better.  You won't have a bad meal here (the veal is as tender as you could ever hope for), and, in case you were worried, I won't fault you for dining here, so you got that going for you.  But, basically, this falls squarely between Villa d'Este (on the low end) and Golden Mirror (high end) in terms of West/SouthWest SF old school Italian eateries.  But if you are in the area and are entertaining folk (or in-law folks), this will calm their fears that every SF restaurant is like Emmy's.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-06", "description": "all about the atmosphere. if you like the scene at house of prime rib you'll enjoy it hear as well.", "author": "carl p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-19", "description": "i hope no one from this restaurant has connections to the mafia (good fellas/casino style)~vee was in the mood for italian & we were in the avenues since watered down olive garden was crowded....the scene was nice~it was packed...yes it seemed like we were the youngest ones there...so i was in the mood for seafood~now when i think of seafood @ an italian joint~i think of pasta & my choice of clams/shrimp/sum type of fish....maybe my thinkin of seafood pasta is very americanized & not authentic italian....but what i got was sumthin i couldve made as a fri nite tv dinner =x....my salad wit vinegrette dressing was sooo unfresh & tasted old...three slices of marinated fish with seasoning/lemon....grilled cucumber on the side...slices of steamed potato slices...& the red pasta served b4 my meal look like chef boyardee....im never coming back here~nothin worse than goin home with eating a horrid meal & wondering what couldve been~one star for our waiter chuggin a beer in the back while we were waiting for our food & smelling like a chimney when taking our order/served our food", "author": "elmer d."}
