{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Yes, the sandwiches are good and reasonably priced. Yes the coffee is hot and fresh. Yes, you can't beat the am egg bagel sandwiches. And without fail customer service will be friendly..and friendly toward everyone no matter their walk of life.\n\nBut the absolute best thing? Pfeffenusse and Lebkuchen are available here during the holidays!! Nope, not made in house, but packages of the really good imported stuff.\nThank you Rossi's for helping make my holidays merry!", "author": "El B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "Rossi's Deli is one of those spots that you might have missed at first when walking by it.  It is a little shop that has obviously a deli and lots of snack and alcohol choices.  They also sell lotto tickets so prepare for that line when the jackpot is up.  A very small space barely enough room for two people to walk side by side in the one aisle they have but they have good quality food but I mainly get either a sandwich or a bagel.  The thing I like most about this shop though is the very friendly service.  Always greeted with a smile and a hello.  This \"ma and pop\" deli is they kind of place I want to go to spend my money because of the polite service and the positive energy.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "I hope places like these stick around. The falafel sandwich is the bomb! I order half spicy, half regular. Cheese selection is affordable and yummy try the Bulgarian feta and service is always friendly.", "author": "Nils H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "I am in Rossi's once or twice a week for 20 years.  Best Falafel Sandwich in San Francisco. Meatloaf Sandwich and Meatball Sandwich are favorites.", "author": "G. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Right across from The Castro Theatre lives the best damn lil liquor stop in all the land. \n\nMy friends and I popped in before a play for some wine to bootleg + shotgun before the show and the guy at check out was legit the coolest dude. He helped up secured the wine for our on-the-go eve so we could get it safely from point A to point B and enjoy accordingly. \n\nThe selection of cold boozy beverages is a little on the limited size but shop is pretty small and they carry a lot if you take the real estate limitations into account. \n\nI didn't get a sandwich or any of their mixed salads on this trip but they looked p good. I, instead, loaded up on theatre munchies with Kit Kats among the wide selection of chips, cookies, candies and will keep this place bookmarked for my future Castro excursions for quick snacks and friendly service.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Best breakfast sandwich in The Castro district hands down. It might be hard to find because it is in the middle of little strip mall, but well worth the hunt! The owner and staff are very friendly and the price for the breakfast sandwich was well worth it.", "author": "Carly S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "It was my first time here and I ordered a few sandwiches and one with no onions and tomatoes. I asked multiple times if they made it the way I asked and if they could label them properly so there'd be no mistake when eating. There was literally 2 pickles in this thing. I'm my opinion not worth the service or food.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Omg the most amazing little place for food in the Castro!!  It's only a simple small deli but everything I ordered was yummy and very affordable!  The falafel and Piroshki are my favorites and the best pre drinking food ever in the area lol. They also sell various other items such as salads, snacks, and desserts but the customized sandwiches seem to be very popular for call in orders.  The people who work here (seems to be family owned), are also very sweet and friendly. Can't wait to return!", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Rossi's Deli is the home of the best breakfast sandwiches west of the mississippi! The staff is beyond friendly and their selection is great for a small joint in the Castro District. Great prices and great for a grab and go breakfast!", "author": "Pilar P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "I love Rossi's - they make the most delicious sandwiches! Make sure to try the Veggie Delight. My office is up the street, and I go at least three times a week. The owners are super friendly, I sometimes pop in just to say hi.", "author": "Jamie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Rossi's sandwiches and salads are fresh and delicious every time! And I've been going to Rossi's since the early 1980s! The service is friendly and fast; the prices are very reasonable. This is my favorite 'grab some yummy food' stop. I'm partial to fresh roasted turkey or roast beef on a big sour roll. Try their fresh tabouli or cole slaw, or pasta salads too. But there are a wealth of choices for anyone. You'll find a large array of wines and coffees. They also stock fun imported foods, which make great gifts even if you don't want them for yourself.", "author": "Melinda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "These sandwiches are so good. They are made with care and with tasty and fresh ingredients. I keep forgetting to take pictures of them. I'm sure people mean well but the pictures on Yelp make these sandwiches look frightened and alone. Like they're being interrogated. In reality they are very attractive sandwiches. I'll glamour shot the next one I order.", "author": "Xian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "What a great sandwich - the avogobbler - avocado and turkey- real turkey breast, like just off the Thanksgiving roasted whole bird - really impressive. And always a pleasure to support such a good local merchant.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "There are many reasons to come here but the Avogobble keeps me coming back. The family that run Rossi's is wonderful as well.", "author": "Kosta P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I love this place. I live a block away and come here all the time for their very cheap breakfast bagel sandwiches - hummus, tomato and cucumber is my regular breakfast for super cheap.  Their falafel deluxe and avogobble are my favorite sandwiches and still relatively cheap.  Best part though is the very very friendly family that runs the place. I look forward to the hellos and the smiles I get from them every time I walk in. It's the neighborhood deli you've always wanted.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "First time!\n\nStopped in for Avogoggle sando; that's smoked turkey with avocado, your choice of breads and the usual lettuce, 3 kinds of mustard, pickle and tomatoe. $7.75 is a deal for big sando; that is big enough for two medium eaters. The turkey was tasty and smoky; lettuce, mustard and bread were fine. Recommended.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "I came into the store awhile back when i was looking for a bite to eat while exploring Castro by myself. I got the sausage egg and cheese on a sesame bagel with a drink -- Noyu brand Lychee Oolong tea! \n\nBagel is pretty good, and it was made on the spot. bagel was all toasty and yummy. balance of bread and filling were equal. The sausage was not bland at all! Also, that brand of Lychee oolong tea is pretty hard to find (granted i havent reallllllyyy looked LOL) but its not a very common drink that is found in convenience stores. It was really refreshing and not too sweet.\n\nThe cashier and workers are extremely nice and patient. I remember i was short a penny and he told me it was fine lol. There was a line, so i'm sure the rest of their items are delicious.THey have an good selection of lunch food as well as a very large variety of cheeses and meats. If i wanted to have some kind of wine and cheese/meat party, you must definitely come here. They're very well stocked. they also have baklava!", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "I love this place. They make great sandwiches and very reasonable. But what I really like the most about this place is the kindness and service that these guys give. They seem like they genuinely care and are not just in it for the money. Super nice guys! Great stop for a quick sandwich and yummy deviled eggs. A+++++", "author": "Roy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Four stars for the food and an extra star for the awesome staff. Rossi's has a great selection of sandwiches and deli food. My faves are the Garden Delight and the falafel sandwich. I've also enjoyed their pasta salad and dolmas.\n\nThis place is close to work so it's a frequent lunch fav. I love stopping in for a quick bite and a smile from the always friendly staff.", "author": "Erica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Solid sandwich. I wandered in and was pleasantly greeted by the guys behind the counter. I didn't have much of a plan, so I just belted out \"I'd like a sandwich\". He didn't miss a beat, \"How about hot pastrami?\". Confirmed bread, toppings, suggested cheese. Very kind and happy to help. The pastrami was really good, especially for $8. I will definitely come back here to try their other sandwiches since it's a very convenient stop next to the Castro metro station.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Stopped by for a quick grab-n-go breakfast. I ordered a ham, egg, and cheese bagel that was perfectly toasted and delicious. Many different bagels and cheeses to choose from. In and out within 5 minutes and very satisfied.", "author": "Edward W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Great spot with great sandwiches. Try the falafel sandwich or the avogobble. The folks here are super nice too.", "author": "Jeremy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-10", "description": "Their Staff is really nice. I have tried the following:\n\n1. Sesame Bagel Toasted with cream cheese, cucumbers, and tomatoes. (They only carry plain cream cheese.)\n\n2. Sesame Bagel Toasted with hummus, cucumbers, and tomatoes. (It wasn't per my taste. The seasoning inside wasn't to my liking)", "author": "Hiral P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "The thing that stands out most about this delicatessan is the service. Everyone is super friendly and really takes pride in this cute little shop on Castro. You can buy the meats and cheeses that are displayed in the window, and while you're at it, why not get a sandwich to go with it? \n\nI tried the hot pastrami sandwich. The menu is a little confusing because there are so many options that sound the same. I just asked the guy behind the counter to give me a suggestion on the type of bread, cheese, and produce to put with the sandwich, and it turned out great. My default for sandwiches is the nearby Subway, but now that I know this exists, perhaps I'll be venturing here much more often.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Five stars for great employees who are always smiling and so friendly, even when dealing with the late night crowd. Five stars for halva and the random german cookies my family always had on hand over the holidays.  Five stars for an excellent chocolate selection. Five stars for yummy sandwiches at amazing prices. Rossi's has been in the hood for a very long time. They love the Castro and serve it well! Show these guys some love.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "There's no better deli within 2 miles of Rossi's (And Ike's is about 500 feet from them). Let me explain to you why. The customer service first and foremost is remarkable. The owner of the joint, I believe his name is Sam and his lovely wife, are good hearted people who want the best for you. The first time I stumbled across this place was one Ramadan night during Iftar (breaking of Fast for Muslims) and I was starving. My family had to attend a funeral leaving me alone to eat dinner. I thought I was going to come in for a quick bite but it turned into more. A conversation turned into laughs, laughs turned into hugs and etc.Long story short, I come here every Friday afternoon after prayer and it's safe to say that we are all like family now. The Avo-Gobble is the absolute go-to. Ask for a little extra pesto and pepper jack cheese to spice up your experience! Trust bruh!", "author": "Faiz J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Mark was working during pride Saturday night and came through with a cup of water for a girl in need. Good people, good guy.", "author": "Viv B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "YELP is soooo cool! I have been craving all week for a Reuben sandwich and whenever I come to Castro, it's either for their happy hour, dancing, coffee, or hanging out with cool friends, and I certainly would have never thought of Kosher deli here if it wasn't for my trusted YELP Mobile!\n\nMan this place rocks! They have everything to fill my craving. I jumped right away and ordered two sandwiches. One corned beef and the other pastrami both on rye. I was so excited about the sandwiches I completely forgot to order the sides like potato salad or I was even thinking of humus and couscous! I did have my eyes on their deviled eggs which looked delicious!!\n\nBTW - my sandwiches were delicious!\n\nThe owners - the nice gentlemen and the nice woman I'm sorry I didn't get your name, thank you for making my night and for making me your awesome Reuben sandwiches. Your pricing was just excellent! What a great deal! Thank you also for your warm smile and for your excellent customer service. I definitely know where to get my Reuben fix when I'm in the Castro from now on!\n\nRossi's Delicatessen also sell plenty of many goodies here too including lotto and they're open late until 10PM. They even serve fresh coffee and you can even buy them by the pound!\n\nCheers ~", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Honestly the best place to get a sandwich in the Castro. So much verity and everything is so delicious. I love coming here because it really gives off a feeling of what San Francisco is, a loving mom and pop shop.", "author": "Shaun N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Upside surprise!! We were shopping in the Castro and We just wanted a quick sandwich. First we walked in and it is a deli counter w no seating so we walked out. But they get great reviews and we decided to just grab our food and sit at the little tables across the street by the tram tracks. Good call - the sandwiches were delicious - I actually had their fresh roasted turkey which was really greasy roasted - not processed. The bread in AMAZING. It looks like nothing much from the outside - but it's great!!", "author": "Ms. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "I lovvveeee this place. Everyone who works here is great. \n\nExcellent sandwiches(fresh roast turkey plz) and good pasta salads. Very interesting selection of imported cookies.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Our go-to sandwich shop in the neighborhood. Best falafel sandwich around, all home made and not like those stale hard ones most other places seem to sell. They also have quality deli meat sandwiches with good portions, but not so huge you can't get your mouth around it, and very good prices.\n\nVery friendly service as well, the owner has been there 30 or 40 years on that same spot, and he and his family who work in the shop are really nice.", "author": "Brad N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "Do yourself a favor and drop by Rossi's sometime. Be it for a sandwich, cold cuts, dolmas, a bagel, falafel, a drink, or speciality sweets from Europe. Sam and his family have run this Deli for over 40 years in the Castro and they are all very sweet. When I used to work in the Castro, I came here nearly every day for an Avogobble, a Bagel w/ Cucumber and Hummus, a BLT, or a Reuben during my lunch break. Everything is so delicious, fresh, and reasonably priced. Fun fact: you can also buy single beers from here.\n\nDefinitely the most affordable place for lunch in the Castro.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-12", "description": "I really didnt want to write this review cause I want to support a family business but I'm hoping this review will be constructive and they'll learn about a turkey Reuben and not sell this to anyone else under that title. \n\nI ordered two turkey Reuben sandwiches over the phone to pick up. \n \nThe boy on the phone asked if I wanted the dark rye bread so I said I'd try it but it didn't taste like rye bread at all, pretty sure it was pumpernickel... But even worse \n\nThey didn't even use turkey pastrami!!! The kind of meat that goes on a turkey Reuben. They put HONEY SMOKED turkey on it. So wrong. So wrong. This Reuben was all kinds of wrong. A Reuben without rye flavor or pastrami and the bread was so soggy ): and we got it x2", "author": "Brianna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Delish sandwiches at a great price, especially the Reuben and the roasted turkey.   Family service, family run, old school deli.    Great people and I love supporting a local business.  Nice selections of drinks to accompany your sandwich, as well as a basic wine selection for your outdoor picnic.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-28", "description": "I'm sure that I must have ordered the wrong kind of sandwiches.  The special today was roasted turkey.  I asked them to make it on a Dutch Crunch.  The bread was more chewy than crunchy and the roasted turkey looked like leftover pieces of dark meat from a Thanksgiving dinner.  It wasn't tasty either.  \n\nThe other sandwich that I ordered was an egg salad on toasted white but, she accidentally toasted rye bread--- which I didn't discover until I brought the sammies home.  I asked for onions on both and there were a lot of onions!  They weren't the thinly sliced red onions, but rather the strong white onions.  It too was lacking flavor  (other than the onions) and was heavy on the mayo with large chunks of boiled eggs.  \nThe dolmas were great though!\n\nThe people that work there are warm and personable.  I did wind up buying a winning lottery ticket there too-$15!  Sweet!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "I stopped by this little deli/liquor store on my way to muni to get a quick breakfast sandwich on the go one day... Happy to have found my new breakfast spot in the Castro! $3.50 for a fresh made bagel with egg and your choice of cheese and the people who work there are incredibly friendly and nice! Much better quality food/price/service than Posh bagel IMO.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "So......\nThis is my new favorite place to eat in San Francisco. They are so friendly there, like friendly and smiling to the point that I thought \"is there something on my face, is that why they are smiling?\" NOPE. I checked when I got home, nothing on my face. They are just that nice. The food is so cheap and it is fantastic, the sandwiches are huge. \nIts just good all around. \nGo there.", "author": "Sari S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "Looks are deceiving with this place! It's a very small little shop but they have so much stuff! The sandwiches are good, I wish they offered different meat options like boar's head though. The service was great- very nice people behind the counter, and the location is super convenient.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "Roast beef = so good\n\nBlack forest ham = awesome too.\n\nStollen = WIN!! Marzipan stollen is MORE WIN!\n\nPrices = moderate.\n\nService = friendly.  \n\nSupport your local stores!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Absolutely FANTASTIC sandwiches! They're all delicious and there's a ton of different sandwich options. Great assortment of breads, and their prices are great considering how expensive the castro is. 10/10 would devour sandwich again.", "author": "Alberto P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Excellent food made with and served with love. Best hummus I have found in San Francisco.", "author": "SF R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "Went here for Lunch. Split a Rueben and an Avogobble sandwich on dutch crunch. The sandwiches are decently sized, and you get a good bang for your buck. Two sandwiches ended up being ~$16 total.\n\nThe Reuben felt like it didn't have enough meat/filling in it. It was satiating, but the thousand island really overpowered the sauerkraut. The sandwich tasted too sweet with no nice sour offset you usually get in a reuben.\n\nThe Avogobble was a bit dry (even with the mustard and tomato in it). I found myself enjoying the parts where the tomato/pickle were, but not so much when I had a bit that didn't. Could barely taste/see the avocado. Turkey is usually dry though, so it might just be the sandwich. \n\nI enjoy sandwiches a lot, so I'll probably be back, but I'll definitely be giving some of their other sandwiches a try. Perhaps the hot pastrami.", "author": "Courtney Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Very good! YUMMY!! Exceptional pricing, great service and supreme product. Although it may seem odd from the outside and yes the inside, it is great! The breakfast sandwiches were amazing and cheap! They were about 1/3 cheaper than other places but 300% better than those higher priced sandwiches. The place is great and has a variety of everything. I wish I had gone there sooner. I would have had more meals at this place. Go there and enjoy! There is no inside seating, however, it is fine. Enjoy the outside! YUM!", "author": "Big D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Rossi's is the jam. Sam and the rest of his family are extremely nice, and they serve up some great sandwiches. The deli itself is reminiscent of corner stores of the Middle East, with shelves jam packed with goodies. Their breakfast sandwich on a bagel may be the new standard for that classic item.", "author": "Saad H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "These guys are really nice people. Very friendly and always smiling. I can't stress this enough because that is very important.\n\nThe breakfast sandwiches are quick and delicious. This is the perfect place to stop before a trip to the park. I'm always consistent in ordering the Sam's Special with bacon and cheese. Great homemade nibbles and sides. Beer, wine, champagne, and picnic essentials. \n\nWe love this place!", "author": "Thomas Nathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Fresh roasted turkey on a soft dutch crunch roll was very good.\nI love their pesto pasta too.\nI want to like their deviled eggs but there's tooooo much mustard tang in the yolk whip.\nI love that they close late at 10pm even on fri/sat nights.\nI will be back for sure a couple of times a month.", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "I work near Rossi's and this is my go to sandwich spot on Castro Street. The food is good. I'm tried the Tuna Sandwich and Falafel sandwich. I like both of them. And the the staff is very nice. I ask them to change their gloves when they are making my sandwich so it doesn't cross contaminate with meat, and they have always changed them without any hesitations. This is good spot if you just want to pick up your food and go.", "author": "AB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "My favorite place to grab food in the castro. I'm in here about twice a week\n\nThe place isn't fancy and doesn't have a placed to sit, but the food and deli items are awesome and well priced.", "author": "Kenneth C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-08", "description": "Sandwich was good, ready on time. Service was super friendly. \n\nI liked the bread (sour roll). I agree with the reviewer who said it's 'just the right amount of meat' (not too much). \n\nWish the EAT24 site had made it clearer that cheese was not included in the \"with everything\", but I think it was on there and I just missed it.", "author": "Sam Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "I love Rossi's, it is so convenient for me when I'm in the Castro to spend the day. I can pick up a sandwich and a salad, or two and sit for an hour, or two at the corner of Castro and Market at the BART Station, and people watch.\n\nMaybe pick up a free copy of the Bay Area Reporter, and leaf through it a while. \nCatch a movie at the Castro Theater, maybe run into a friend, or two, do some window shopping. An extremely pleasant way for me to spend a day without having to buy a drink. I haven't had a beer in many, many years. I still savor the taste, and enjoy the aroma of a beer, but I'm happier being sober.", "author": "Ernie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-27", "description": "I just walked out of Rossi's with a Falafel Deluxe for $6.\n\nIt's like the mother of all falafel wraps, oozing with delicious hummus, fresh cucumbers and tomatoes and so many falafels that are spilling out of the wrap like crazy. And I had no idea it was a full pita -- two half circles stuffed with heavenly goodness.\n\nI'm impressed! \n\nIt's a little cramped in there, but I guess I shouldn't complain since I'm just going to go in and buy a sandwich and leave. I'll come back! Maybe ask for a smaller option for a falafel wrap since I ate half already and I am way too full for the second. Nom nom nom.", "author": "Peggy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Wouldn't have thought to stop by here, but a friend recommended it. Came here for a quick sandwich dinner one Thursday night, and the hot pastrami sandwich was pretty good. There's not too much meat, so you can still bite into the sandwich without making a big mess. The bread was very soft and all the ingredients were very fresh as well. Prices were good at around $6.25 for a sandwich, plus they accept credit card.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "I keep really wanting to love this place but they completely fall short in their most important area: sandwiches.  I have bought sands here on multiple occasions, mostly because of convenience.  A couple times at most I've been pleased, other times the sandwiches seem light on the goods.  Case in point, in order to support my local deli, I stopped in the other day and ordered 8 sandwiches with avocado for a meeting I was going to.  When I looked at them later, all sandwiches maybe has two small slices of avocado.  The rest of the ingredients were so light I left I was eating a giant roll of bread with a tiny layer of stuff inside it.  Other times they've gotten my order totally wrong, even though I'm right there.  I think I can finally give up on this place and stick with a pizza slice from next door for food on the run.", "author": "e w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Nice staff. I had their roasted turkey sandwich in dutch crunch and it was amazing. There's nowhere to sit and eat but that's ok. It is a very small place but great items.", "author": "Luis O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "Sam and crew at Rossi's are neighborhood a Castro institution.  This tiny, unique deli offers a surprising selection of yummy treats.  The sandwiches are fantastic, made to order and a great value for your dollar.\n\nMy only wish is for Rossi's to stop selling small bottles of liquors.  These bottles end up being part of the quality of life problems in the Castro.  Some of the very problems I've seen staff at Rossi's having to deal with.", "author": "EC N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "Old neighborhood feely friendly, everything you ever want in a deli.  Love the $1.25 Baklava.  Had the Dutch Crunch Pastrami, just a plain good old sandwich.  Everybody coming in ordered the \"avogobble\".  Need to try that next time.  Had too much turkey in this past week.  The Holiday cookies were calling to me, good thing I had the volume on low.  This place is so European, so many meats and side dishes.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Where to begin!? I slept hard on this place for the longest time and I'm not really sure why.. Possibly because next door to where I work is a bagel shop (that I now despise, but that's a separate review) that seemed \"easier\" to get to.. When I learned that Rossi's also did breakfast and their prices were more competitive than places like Posh Bagel and Castro Tarts, I decided to give them a try! Conveniently placed between muni (where I off board) and my job which is down the hill! An awesome selection of breakfast sandwiches to pick from, and for the best price that I have seen in the neighborhood! And Sam (the owner) is such a great fellow, friendly as can be and the rest of the staff there are just as amazing! Two of his children work there from time to time and they are fun to chat with on my way home after finishing up work.. Rossi's takes the crown for best breakfast spot around, and when I get a craving of some kind, like a Yerba Matte tea midday or an ice cold brew when I have finished a 10 hour shift, they are there! Such an seemingly innate friendliness with that group, you could go in upset and walk out with a more pleasant attitude! Been 2+ years and I have never gone to back to Posh of Castro Tarts since discovering Rossi's, at it was always there! \nGive them a shot", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "This place looks bland, but it's actually very, very awesome.  They have a bunch of beer, wine, food, and other concessions all at extremely reasonable prices.  Basically it's like what a \"deli\" SHOULD be: Actual sandwiches, actual conveniences, all done well.\n\nAnd the folks who work here are really nice, and they've been working here as long as I've lived here, so they must be either family or treating them well.", "author": "Jon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "This place is a gem! In the best location on Castro, near Market. It looks unassuming from the outside, but it's filled with magical deliciousness. Their sandwiches are out of this world and the staff are friendly and helpful. They are always pleasant and happy to help. They sell liquor, beer and a large selection of wine and whole bean coffee, along with homemade salads and antipastos. As it is a deli, you can buy sliced cheese and meat here as well. Highly recommended!", "author": "M J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "A cheap alternative to IKE'S if you're near the area and looking for a good sandwich with some other amenities. The prices are relatively fair and the staff is very friendly. They have a surprising amount of wine and beer if you're looking for that, and also some great homemade treats from time to time (the baklava is quite good). Dutch Crunch for life.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "The most delicious deli in town. Whenever I can, I'll always come here for a quick lunch. Yummy sandwiches and salads of all kind with fresh ingredients! Not to mention, the staff is always very friendly. :) I always get the chicken salad sandwich and the feta, edamame and quinoa salad. Both are spectacular!!! Definitely try this place, you won't be disappointed.", "author": "Karissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-03", "description": "Geno B. says:                                                        \n\"Rossi is the best!\"\n*blushing\n\nDwayne A. says:\n\"I love Rossi.\"\nswoooooooooooonnnnnnnnnnnnnnnnnn!\n\nPretty O. said:\n\"There are not a lot of great deli places like it used to be, with that said\nRossi is truly ONE OF A KIND.\"\nthank you. \n\nNick C. says:  \"My only criticism for this place is I wish the sandwich would of been bigger, it is definitely on the smaller side when compared to other deli's and sandwich shops in SF. But all in all, it was a fulfilling experience.\"\nerr....sorry, Nick?....sometimes it isn't the size of the pen but the author who writes with it....or some shit like that. I think Rossi has an average size sandwich. \nAt least it was a fulfilling experience.\n\nAustin C. said it best tho: \n*at least to me\n\"There are some things in life that are complicated. And there are things in life that are fucking awesome and simple. (Rossi)\"\n\nseriously tho.\nGood sandwiches if you are in the castro.\nthank you\nand good night.", "author": "Rossi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "This is my favorite deli in SF. The sandwiches are delish! The ingredients are so fresh and they give you the perfect amount of meat. My boyfriend recommend this place to me and we have been going here pretty regularly. What I really love about Rossi's is how friendly the staff is! I love to support businesses like these. If you are craving a fresh sandwich come here. They also have a wide selection of chips, candy, drinks and other yummy treats.", "author": "Allie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Everything bagel with hummus tomatoes and cucumber. On point. Coffee. ...... ? Um hit or miss.  Today was definitely miss. Sandwiches also the bizz", "author": "Kenneth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "I get the bacon, egg and cheese bagel every time.. man that is tasty! And they are always so nice.\n\nShould give the lunch a try next.", "author": "Rob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-08", "description": "There are not a lot of great deli places like it used to be, with that said Rossis' Deli is truly ONE OF A KIND. This establishment has been in the neighborhood for more than 35 years!!! They are mostly known for their deviled eggs, the avogobble (which is a fresh roasted turkey with avocado) and their variety of affordable cheese. \n\nI come here every morning though, for my breakfast bagel. I get the bacon, cheese and egg bagel sandwich and I LOVE IT!!! Toasted perfectly and a full-filling meal before I go to work. \n\nThis establishment is a one stop shop...there are so many goodies to chose from that its often difficult to just buy one thing. \n\nAs for their customer service, it's GREAT! Rossis' Deli is family owned and they are genuine, friendly people. :)", "author": "Pretty O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "A great addition to the neighborhood.  My only issue is the owners are a little cheap.  They don't want you to include a lottery ticket with your purchase on a debit card with other items you have purchased, and they charge you .25 cents for a bag as opposed to .10 cents that the city asks for a dime.  The extra .15 cents won't change my life, but it doesn't seem right.\n\nI understand business is about making a profit, but lets be reasonable.  Rossi's does a bang-up business in our neighborhood, don't squeeze extra pennies out of us for bags and debit card purchases.  I'm sure the prices already reflect the transaction fees, and they get their extra share of profits every time a winning lottery ticket is sold.", "author": "John .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "Two Words\n\nDEVILED EGGS\n\n( well ok more than two words, I love this place. Great sammiches, the people who work there are quite friendly regardless of what some of those here might yelp about. )", "author": "Tom M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "Just got done working out and was VERY HUNGRY! I decided to try a new place to grab a quick sandwich before I went home to really get my grub on. This place came through with flying colors.\n\nOne of the best Ruben Sandwiches I have ever had. Thinly sliced pastrami, delicious dressing, and perfect amount of kraut.\n\nI had a feeling that would not be enough so I looked at what else they had and was surprised at all their different Greek side dishes (Tabouli, Greek AntiPasta Salad, Hummus, etc...) So I decided to give their Greek AntiPasta a try and I was happy I did. Really fresh and delicious artichoke hearts, olives, sliced bits of salami, feta cheese, olive oil....man this stuff was healthy and REALLY GOOD. \n\nAs for their service, GREAT! The guy that helped me was nice and gave off a good impression. There was also these two GORGEOUS girls that helped me cash out, and were very nice as well.\n\nMy only criticism for this place is I wish the sandwich would of been bigger, it is definitely on the smaller side when compared to other deli's and sandwich shops in SF. But all in all, it was a fulfilling experience. I will definitely come here after I workout for more food!", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Best place ever. I only originally gave this place 4 stars, so people would believe that this place is that great. It really is. It's the best god damn place to eat for me, anyway. Everyday, I come here for lunch. I'm always looking forward to eat my food from here. This place has been here and run here from the same family many years before I was even born. It's a hidden on the way close to muni gem that everyone should try. MMMMMMMMMM I'm eating it now!", "author": "Gazza D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "Falafel pita sandwich creation thing was so good! This litle hole in the wall was a great place to grab something quick to eat before our show at the theater across the way and their food options seemed endless. \n\nAlso, when they ask if you want hot sauce, it really is hot.", "author": "Lily K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "3.5 stars\n\nThe couple running the joint are super nice. Their selection of meats is vast and cut fresh per order it seems like. The wide array of salads are also nice and nothing is breaking the wallet too much.\n\nI got the Sam's special which was a good sandwich for the price but nothing really special about it. Very typical and something you can make at home. No special sauce or anything like that. With that said, I will still continue to visit regularly as other sandwich places have lower quality and charge almost $10 for it. This place keeps it real.", "author": "edward k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "Rossi's is probably one of the oldest establishments still in this neighborhood. But just because they're an oldie doesn't mean they're not a goodie!!! \n\nI was actually forced to go here to pick up a sandwich for my co-worker so I grabbed a roast beef avocado on wheat roll with everything, and a side of potato salad as well. \n\nThis meal was one of those pleasant surprises that you find when you're wandering the area looking for something to eat... Anything to eat! My sandwich was affordable but they put a really good amount of meat and goodies in to make it a great sandwich. There wasn't any special sauce or anything that they put on it like ike's or little lucca's but it was just a really hefty and fresh sandwich! And the side of potato salad I got was delicious as well! \n\nRossi's is definitely a great delicatessen and I'll be returning more often for lunch!", "author": "amelia g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "My sandwich world revolved around the likes of Ike's, and when they closed up shop, I was pretty devastated. I knew there had to be pretty good sandwiches around the city as alternatives, but I didn't realize that delicious sandwiches would come out of Rossi's in Castro.\n\nI'm not connoisseur for the simple bread and meat meal, but I will say that I am a little selective. With that said, Rossi's has a really tasty fresh roasted turkey sandwich, which I get on a toasted dutch crunch roll. Cheese? Why not. Extra pickles and olives. Hells yes. It's not your typical subway sliced meat. Nope, this is shredded turkey meat, which I was a nice surprise the first time I ever bit into it. For a little more than $5, you really can't ask for more in a sandwich. Also, if you're still hungry you can pick up some greek pasta salad or a piroshki.\n\nThe guys behind the counter are always friendly and quick. I work near Union Square but I still make it to Castro for lunch at Rossi's. Try it out!", "author": "Mike A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "I love love these guys and family. I'm there every weekday getting my coffee. He calls it Jet fuel. It gets my day going.\n I also agree with the transexual or was it the . Yes their BLTs are better than the other deli's around, those other deli's don't compare. I still miss Maritsa.\nKeep up the good work!", "author": "Joe Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "I love this place !! The people/owners are always friendly and funny. It's a family owned deli that have been there for over 30 yrs. Its nice to still see a mom and pop shop (instead of Starbucks on every corner) in the City. And btw this place has fresh brewed coffee ! \n\nI love their fresh roasted turkey sandwich, falafel, and deviled eggs, I like all their sandwiches but those are my favorites.  \n\nIt's a cute little hole in the wall with a lot of character and good food. It's a \"to go\" deli, no seating but great to pick up some sandwiches, chips, salads, wines, cheeses, chocolate, soda, beer, and the list goes on and hit the park for a picnic. \n\nI saw some of the negative reviews and I've never had a bad experience and have been going there as long as they have been in business...I recommend giving them one more shot before calling them quits !!! (I mean nobody's perfect right). \n\nps. To daphne who complained about the lady saying she would charge .10 for a bag, you should've asked for a bag before you paid, you know we have to pay for bags now !!!!! No disrespect but just saying!!!!!", "author": "Jay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Great service and food. They're so friendly and helpful. Only criticism is that the hot sandwich maker isn't gay. :(", "author": "Tim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Rossi's is the best! I always come here and get a sandwich for lunch, because it's priced well, and the sandwiches are delicious!\n\nThe fresh roasted turkey is delicious, and they have a great selection of cheeses to go with it. The side salads are also quite good. The Greek pasta salad is fun- made with orzo instead of the typical rotini pasta. I also have gotten the meatballs to go, and they make a great easy meal - just cook some pasta at home to pair with them.\n\nI also love the selection of Ritter chocolates. I always have to give in and get a square for dessert. Plus, they sell lotto tickets, a fair selection of wine, beer, and liquors, and random chips and breads. And the people who own it are always SO nice!!!!!", "author": "Geno B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "I like this place, it's cute and pack full of yummies. The sandwiches are just good, giant sandwiches. No special sauce or anything. And they have pepperoncinis! The pesto pasta salad is really yummy, highly recommend.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "Absolutely delicious! Fantastic deli sandwiches. Great family owned business that's been in the Castro for a long time.  I love going here before heading over to Dolores Park.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "Here's all you need to know about Rossi's: super friendly guys (and gals), great, simple, inexpensive sandos, and you'll always leave with a smile on your face.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-13", "description": "Rossi's Delicatessen is one of the best delis in the Castro. In middle school, I come here everyday upon getting out of Castro Station to wait for the 24. In a moment of thirst and hunger, I go to the store for a bag of chips and soda knowing I'd step into Rossi's for the first time. The staff there are very nice. This deli is worth going to if you are in Castro.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "Fast deli sandwiches that are good and filling!\nI go there on my lunch hour and get the smoked turkey. Nummers! They also have a great deli bar. Salads, macaroni, hummus, Cheeses galore....Oh and there is this one Man who works the counter....sooo handsome!", "author": "Nene D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "Try the chicken salad sandwich here!!  Delicious!   The gentlemen behind the counter are always pleasant, and polite.  I love this place!", "author": "Tylr K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "Simple, delicious and fresh sandwiches! Inexpensive... It's hard to find a \"east coast\" type deli. :)", "author": "Aileen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "they make everything in here. .... i would say it is the best place in castro. i am here almost every other day. great, great loving people.", "author": "B H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-04", "description": "It's on my way to metro, and it's open before 8am.  Seems good enough for me.   I had a smoked ham sandwich first time and falafel deluxe the next.  The food was okay, very typical quality from a deli, but the male owner and the female cashier were very friendly both times.\n\nAs I waited for my smoked turkey sandwich to be made this morning, I checked out their salad selection and made note of what to order next time.  It's a woman I've never seen before at the register today, and she just handed me the wrapped sandwich with a couple of napkins.  When I asked for a brown bag, as she bagged the sandwich.  \"Next time,\" she emphasized, \"I'm going to charge you 10 cents for the bag.\"  \n\nThis was a first, and maybe they're just starting to enforce it, but Deli Lady if you're reading, \"Next time, I'll buy my $7 sandwich elsewhere.\"", "author": "daphne w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-07", "description": "I love this Deli! I always get a turkey sandwich on Dutch crunch with lettuce tomatoes and avocado. Sam is the best. Everyone is friendly and helpful. Glad they are here. Check them out. Amazing Deli!", "author": "Raul I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "So many time had I walked right past this place that I was surprised to find out it was actually a deli.  From first glance, it looks like a random liquor store but after walking in I was amazed at their deli selection!  My personal favorite, of course, are the deviled eggs.  Just how momma used to make them!  The only downside to my new find is that I'm starting to get deviled egg cravings at all hours of the night and find myself throwing on a sweatshirt over my pjs to walk over and get some!  I tried the egg salad sammich the other day and it was ok.  I think I prefer my eggs unadulterated.  I saw they have bologna sammies so I can't wait to get over there and relive some of my other childhood memories!\n\nThe dood behind the counter is always really nice too!  Ike's is just different...but I'd head over to Rossi's if the line at Ike's is too long!", "author": "Alex A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "I've fallen in love with the sandwiches from Ike's, but I feel that I should try the other neighborhood delis first before I swear off all other Castro lunch spots in favor of Ike's...\n\nRossi's is clean and run efficiently.  The sandwiches there are fresh and made to order.  The prices are very fair.  Plus I can buy Lotto tickets there...\n\nStill, Ike's this is not...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-09", "description": "The falafel deluxe is my favorite thing in the planet! By far the best falafel pita I've tried in San Francisco, they always keep me coming back for more.", "author": "Lissette V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "Staff could NOT be nicer. Great selection of wines and beers and deli foods. Support this place!", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "Best bacon, egg, and cheese on a bagel I have ever had! Their customer service is tops to boot. Definitely becoming a regular.", "author": "Craig J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-17", "description": "I have been a loyal customer to this family's Store for over 36 years . I bought my first sandwich and coffee at the tender age of 14. My favorite is smoked turkey and Genoa salami with pepper jack, mayo and tomato on sliced french bread. Yummy!", "author": "Lydia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "So I grabbed a turkey sandwich  here today to try this place out and once I opened it.. to my surprise ... it's fresh carved! This is something they should advertise.... had I known I would have gotten a sando here long ago.\n\nThe turkey had a nice flavor to it.. .it wasn't dry either..\n\nThe guys in here are pretty nice... they even toasted the bread :) \n\nAfter reading the other yelpers comments... I will also be buying muni passes here :) \n\n\nSome of the sa", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Cute neighborhood deli with cute couple running things.\n\nPerfect place to grab a Lotto Quick Pick & those decadent Lindt white chocolate balls at the front counter- 3 for $1.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "I only just started going into Rossi's recently.  It wasn't on purpose, and it certainly wasn't for the purpose of ordering great food, but boy am I glad I checked it out.\n\nFirst off all, I am a huge fan of great customer service.  Rossi's has some of the best customer service I have ever encountered.  It's a family owned business, complete with who I believe to be the brothers Rossi, and their wives and children.  I am always greeted with a smile and enthusiasm, and it shows in the product that they produce.  I regrettably have only tried the bacon egg and cheese bagel so far (I only say \"regrettably\" because they have so much more to offer as well!), and boy does it pack a punch.  I sometimes add vegetables and avocado to my sandwich, and they always taste fresh.  Not to mention, Rossi's is EXTREMELY clean and well taken care of, so eat with confidence.\n\nWhether you need a bottled water or a breakfast sandwich, do yourself a favor on a long drawn out Monday and step into Rossi's; it'll turn your day around for the better.", "author": "Funky C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "Great sandwiches! And for a good price too.  Love the guys behind the counter, always nice and helpful. Quick nice spot to grab a sandwich after work or school on my way home", "author": "Julie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-20", "description": "I'm their chicken salad sandwich addict.  6 bucks for a filling sandwich that hits the spot every time, totally worth it!", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-31", "description": "Love this place. Friendly, fast service, and good fresh food at a reasonable price.  I often stop in for a morning bagel sandwich or a turkey sandwich on Dutch crunch later in the day. The falafel is reasonably priced and delicious. Good cheese selection too.", "author": "P P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "So i guess yelp doesn't like if you don't write a story behind your review so here i go. I work in the \" Castro \" and are often torn between where i want to eat not because i can't afford it only because the choices are limited on a 30 min lunch, I always walk past Rossi's & never payed attention to it because theres So much Liquor ( which is great right ??? ) So i ordered Ham sammich 1 day and the next day i ordered Black forest ham sammich \" real adventurous Right ? \" Lmao Delicious btw in a few days I'm going to try Pastrami !! Good Food, Not expensive, Fast service. 5 stars", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-20", "description": "I miss this place so much.\n\nI used to work in the Castro, and Rossi's was the best perk of my job.  The best 2 delies I've ever found in SF are Moesha's Pipic (sp?), in Hayes Valley, and this place.  I've heard there's another on Polk St., but I've never been there.  I'd appreciate pointers from other yelpers.\n\nAnyway, Rossi's is the real deal for east coast deli fanatics.  The meats, cheeses, and salads are kosher and top quality, and the prices are below, and the quality higher, than pretentious rip-off tourist traps such as \"David's Deli\".\n\nI lament that they no longer offer an onion roll as an option for thier sandwhiches, which was a great appeal for me, and the only reason I considered withholding 5 stars.  I gave 5 stars, anyway, because the food and service is so good.\n\nGo soon, and you will go often.  The other reviews are right in noting the real friendliness of the service.  If you order a fresh cut roasted turkey sandwhich, they warm the meat with a little juice before they put it on the sandwhich.  There aren't a lot of places left in The City that would bother.  \n\nThese guys actually want your business, and make sure you know they are glad you stopped in.  They've been in this tiny location decades while other Castro businesses have come and gone.  If you stop into thier shop, you will know why.\n\nThey also sell Muni fast passes.", "author": "Gary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "This is a real mom and pop deli. Great sandwiches, best chicken salad sandwich around! Super friendly and clean.", "author": "Oliver K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-06", "description": "Excellent service, average sandwich. We'll opt for a special next time - maybe they are more exciting? We will be back and I'll update this review when I have a second chance.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "It's easy to do. Take things for granted. My mama lived in Muscle Shoals, Alabama and never went to the Music Hall of Fame and I haven't been to Chinatown in 10 months. That's what I was thinking about when I walked into Rossi's today, really yearning for their falafel sandwich...the big one.\nRossi's might not be a fancy up-style kind of deli but it's a family-run place and a neighborhood establishment. I love their Sam's special, the deviled eggs and the varying side salads but I craved the falafel. And, yea was it good. Perfectly fried falafel balls along with tabuleh, cucumbers,tomatoes and hummus. All for six bucks.  I promised myself later, as I finished the last pieces, I won't take Rossi's for granted anymore. Oh, I'm taking my mom to the Music Hall of Fame and all the other places she hasn't seen when I see her next month...", "author": "michael s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-23", "description": "Whatever. The old guy that works there totally called me a fag in Arabic not knowing that my friend standing next to me understnds Arabic.\n\nNice behavior in the heart of the Castro.\n\nWe fags pay your rent, dude.", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "For almost three years now, I've been changing buses at the corner of Castro and 18th Streets in the Castro.  And in almost three years, the only places I regularly go are Escape from New York, La Tortilla, and Taqueria Zapata.  I also sometimes went to that Taqueria El Castro place before it became Kasa, which I'm still afraid to try.\n\nAll of this is to say that Rossi's Deli has been right under my nose all this time.  I'll admit that I'm a little afraid sometimes to visit delis and corner stores in the Castro.  Not because I don't like gay people but because I don't like the unreasonably higher prices Castro businesses charge gay (and other) people because apparently you have to charge more or people just will not like your deli or corner store.\n\nSo honestly I think I did know about Rossi's, but I was always afraid of being overcharged.  So I came in here for a sandwich, a side of macaroni salad, and some hummus; and it was well worth the (average for San Francisco) price I paid for it.  The sandwich was amazing.  The hummus was OK.  The macaroni salad was a little sour, but I tend to have that problem with most people's macaroni salads.  (There's some non-sour macaroni salad I remember from my childhood that nobody seems to be able to replicate.)  I'm definitely going to come back here, as I want to try more sandwiches.  They also have a bunch of other sides that look delicious.\n\nI also got some Kettle Chips nachos here, and they were really good.  Now, Rossi's didn't invent Kettle Chips nachos, but this is the first place I remember ever seeing them, so I'll give them that.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "LOVE them...family owned deli in the heart of the Castro.  You can get all the things you want (and need) in life.\n\nHandmade sandwiches (which are VERY hard to find in San Francisco - not including SAFEWAY), coffee, pre made salads, MUNI passes, chocolate, cigs, alcohol, wine, lottery tix, 1/2 & 1/2, etc...\n\nLocal, nice, family owned, multi-generational - wonderful.\n\nIf you are looking for a place to grab a bite to eat, to go somewhere and eat, stop here.  If you are looking for a place to go get that \"oops I forgot...\", stop here.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-09", "description": "No, no, no.\n\nMy friend Joui was having a birthday celebration in Golden Gate Park, and I wanted to bring a bunch of nibblers.  I usually buy my Muni Pass at Rossi's since it is on the way to the train, and I remembered seeing lots of packaged italian cookies & crackers in there.\n\nI ended up purchasing quite a few snackables.  When I got to GG Park, and started putting the cookies out on plates I was mortified.  THEY WERE MOLDY.   Yeah - greenish mold on the chocolate cookies.  Lovely,\n\nNastola.  No more cookie purchases here.  Although, I guess I'll continue to buy the Muni Pass...", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "It's really easy to miss this place if you aren't looking for it, but I'm glad I found it. It's a great place to grab a sandwich if you live in the Castro. The sandwiches are really good, and you can usually get in and out in two or three minutes. There are a few better sandwich shops in the city, but given the speed and friendly service this place is a must. They also have a good selection of chips (that is to say, not just the standard lays varieties). When I lived in the Castro I would typically stop here on the way home from work once or twice a week.", "author": "Cameron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-29", "description": "I love Rossi's.  Their Avogobble is a great sandwich.\n\nI love the guys behind the counter...", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-25", "description": "Rossi's is the best:) \n\nI live in the Castro, and Rossi's has become a staple of day to day life here. The sandwiches are delicious, I reccomend the Avogobble and the meatloaf on toasted crunch,  the deviled eggs are also excellent( though once or twice they have been partially frozen) \n\nThe customer service from the guys behind the couters is excellent. I appeciate thats its family run and I usually go buy all my liquor/alcohol there.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "Sandwiches here are delicious, ginormous, and budget-conscious. And with Safeway on the cigarette-ban, this is the go-to place for a pack of smokes in the 'stro. I also buy lotto tickets. The place just screams good luck (in fact, I got a $1 on my mega million ticket last week!)", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "havent tried anything but the falafel pita, but i have to say its pretty amazing and inexpensive for the quality.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "What a great Castro area sandwhich shop !", "author": "tom s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "Pretty fantastic deli/lunch joint in the heart of the Castro...would definitely come here more often if this place were closer to me.  I'm originally from the East Coast, and this place reminds me of the delicious Italian & Jewish delis found in Philadelphia and New York.  I had the \"Sam's special,\" which was ham, turkey, and cheese with all the fixings.  The rolls were top-notch and the portions were generous.  Prices were very reasonable.  They have a large selection of drinks...everything from Vitamin Water to Iced Yerba Mate tea to alcoholic stuff.  They also have some ready-made salads and stuff that looked pretty yummy.", "author": "Nina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "I have lived in San Francisco all my life and I LOVE Rossi's Deli. Its a family owned business (well you can tell, they all look alike) and have been open for a very long time. I can't get enough of all the coffee they have. WHOLE BEANS! Which of course they grind the coffee if needed, but I love doing that at home. Makes my apartment smell awesome!They are fresh and taste so delicious. I go every week to grab my fresh roll ,(YUM) made that morning, my turkey and swiss cheese, toasted and grab some taboulleh and I am set! They tell me to trust them with a new taste which they always come out as winners! Their Avo Gavo's are amazing. I may have to go back soon. The prices are very reasonable also. Love grabbing my hot or cold sandwich, hummus or potato salad, whatever I feel like having. Everything is delicious! No complaints out of me! \n\nThey are right across the street from the Castro Theatre, which has been around for forever. The family is generous and always welcoming. All I'd like to say is, try them, it won't hurt.", "author": "Jane F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "Good, fresh food, super friendly staff!  The best BLT and  EggSalad sandwichs, good fresh salads ...and amazing pickles.....love the neighbor hood feel...good selection of cheese, small selection of wine.", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-13", "description": "Mmm. I crave their BLT with avocado on sweet roll.\n\nAwesome, awesome sandwiches. Tasty deviled eggs. Pastas salads are pretty good too. The guys behind the counter are ALWAYS friendly to me. Plus I can buy my muni pass on the way out. No complaints.\n\nIt's the perfect place if you're looking to grab a sandwich (or snack) to go.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-09", "description": "Now that I live in the 'Stro I get my Muni token books at Rossi's - they're a good place to stop in for something quick before the bus comes or on your way to the underground...", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "Thank goodness I remember seeing this place listed in my Yelp search for a cheap yet quality place to grab food in the Castro or I may have been starving through the Monday night Noir City double feature. OK, maybe not starving cause I can go a night without dinner, and besides there was pizza, thai, and taquerias to choose from too. But the original plans changed. The Ike's Place plan was shot because they close at 4:30 on Mondays. The plan to go to Blue, which has been bookmarked for me to try because of the mac'n'cheese on the menu, was shot because the MUNIs were all packed and we had to wait for a train with room. But lo and behold directly across from the Castro Theatre is Rossi's, which I vaguely remember as having lots of stars for their overall review. So I ran across the street while my friend stood in line and, upon looking a the menu, immediately knew I had to try the Devilled Egg Sandwich. Now, I added cheese because I like cheese with my egg salad, but this sandwich NEEDS NOTHING but what they put on it. I honestly could hardly taste the cheddar I asked them to add because the devil gives such a kick. I'm now realizing this sandwich also was appropriately foreshadowing our movie that night, a Film Noiresque take on the story of Doctor Faustus. Did those eggs sell their soul to taste so good?\n\nThe rest of the menu appears pretty standard, with two or three more decent sounding vegetarian options, and all sandwiches come with the standard trimmings, and also with options of adding cheese, avocado, some other stuff I can't remember.\n\nBut the Devilled Egg Sandwich....kicks ass. This is not a ho-hum sandwich in the least. For once, I'm actually appreciative for public transportation delaying and canceling my other dining plans!", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "Great neighborhood deli that's great for more than just sandwiches... perfect to a quick, one-stop picnic basket filling. The sandwich fare isn't that fancy--they offer the basic assortment of deli meats and nothing crazy fancy. However, everything is prepared well and is quite fresh. Where I really appreciate Rossi's is their selection of cheeses. Again, they're a bit more limited than Ferrari's, but what they do have is priced far more reasonably. Service has always been friendly whenever I'm in there.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-16", "description": "I lived in the Castro for 4 years, right on the corner of Castro and Market. I discovered Rossi's one day because I had to buy a Muni pass but then saw the great menu of sandwiches. I got a fresh roast turkey on dutch crunch with cheddar cheese, and my love affair began...\nThat if hands down, bar none my favorite sandwich in the city and yes I've been to Molinari's. It just has the perfect combination of turkey (one star just for the dark meat alone), melty cheese, mayo, mustard, tomato and awesome wilty-from-the-warm-turkey lettuce. I like to pull it apart in my own particular way and savor my way to sandwich heaven.\n\nI moved from that apt. 2 months ago and I am having serious withdrawals- from the Castro and my sandwich.", "author": "melinda g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-12", "description": "just a great Deli to stop buy.  The food is really good, the Drunk Goat Cheese is one of  my favs.  Very nice group of people work there, always friendly.", "author": "Kim O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "This place is great, and I don't say that just because I'm a Rossi myself. I say that because there is such a good selection of cheese and at very good prices! Need a small amount of gruyere for your Sunday brunch quiche but don't want to break the champagne bank? Rossi's is your place! They always have nice sweets, like halvah for a dollar, good panettone and last time I checked, quite the variety of Christmas stollen. They're nice too, which gets my vote every time.", "author": "Isabella R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "Very convenient. I used to get my muni pass there. Never purchased any food items there, but always wondered how fresh their deli items are...", "author": "Jelly G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-01", "description": "The ONLY place on Castro Street from whence to purchase your brown-bagged beers during Pink Saturday revelry.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-12", "description": "I love the sandwiches that I get here.  They always make them the way I want them with no mistakes.  They also have a good selection of drinks, chips, chocolate and homemade items.  I always buy my lottery tickets here because I like to support small businesses.  However the owners have gotten into a few shouting matches with customers, vendors and each other while I was in the store, and that makes for a very uncomfortable experience.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-08", "description": "A good selection for a small space. Fresh made sandwiches, great cheese selection, and the guys behind the counter are nice. They also have some interesting imported cookes hanging 'round the deli counter.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-13", "description": "For years, I have enjoyed the fresh roasted turkey sandwiches offered for sale at Rossi's Deli.  However, in the past year, whomever is in charge of removing the turkey meat from the bones needs to be retrained.  Again and again and again, I have found pieces of bone in a turkey sandwich that I have bought at Rossi's deli.  The sandwich I ate today contained a huge chunk of bone that I can't imagine anyone missing when the turkey was deboned AND YET AGAIN when the sandwich was prepared.  Will Rossi's Deli wait until someone chokes to death on one of their turkey bone sandwiches, or will they wait for a lawsuit, before they care enough to make a concentrated effort to provide boneless turkey sandwiches to the public ?  As for me, I've bought my last item from Rossi's Deli.", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-23", "description": "good food, nice staff been around for a long time. from Muni passes to food a great one stop shopping place! and they care about the area!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "Their sandwiches and deli foods are in my opinion as good as most.  The main reason I give Rossi's four stars, though, is their excellent customer service.  The folks who work there (my fantasy is that they're a family -- maybe I'm wrong) are friendly and helpful.  The place has a wonderful neighborhood feeling to it.  I've been a customer for a lot of years, and I always try to patronize them when I can.  You should give them a visit too.", "author": "John M."}
