{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "favorite and the lady who works here is really nice whenever i come in she's like a Russian women", "author": "Dameyon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "Ordered a simple pepperoni pizza and an order of cheese bread through grub hub. Opted to pay cash which camenout to 37.00$ and some change. Delivery driver once he delivered began calling my phone repeat, texting me, shaking the gate to my house demanding I pay more money. Saying the bill was more. I informed him he was incorrect and asked him to stop contacting me. This was an unsafe and unacceptable interaction. Is this how you treat your customers round table?? Not acceptable I urge everyone especially single women to rethink before ordering from here!", "author": "Chela A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "Its the worst experience ever had just arrived from Sandiego kids hungry got inside around 10:35 pm the lady kept telling me order fast many times with anger and rudely I did order extra large pizza for $35 but I told her noooo Pepporoni and she said  ok but we can't eat in I said ok but the worse thing that made me mad in the car when i opened the box the pizza was filled with pepperoni that non of us can eat and the kids and us stayed hungry whyyyyy?O M G that lady just closed the doors and left I took a picture for it and going to return it tomorrow and see what's going to happen will she treat us nice or rude again .", "author": "Azhar A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "Their salad bar was average and they were out of things like spinach the first time. For what we paid for the pizza it was disappointing. We had mushroom and pepperoni thin crust. The pizza basically lacked flavor and the crust was just ok. \nThe lady was nice and asked us if everything was okay. That was the only good part. \n\nLarry", "author": "Larry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Just had lunch here about an hour ago or so and I was greeted right away by the cashier (I didn't catch her name) but she was super friendly with very good vibes. Customer service was great and my food was delicious and hot. I don't usually enjoy eating in because I am not the one to put myself in a noisy people filled environment but the atmosphere was perfect. Thank you guys so much for a great lunch.", "author": "Lupe R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-12", "description": "I had a weird craving for chain trash pizza and against my better judgment I popped in here and ordered a beer and a personal size pizza. Wanted just a slice, but this is their smallest size. Ordered at the counter and headed straight to the bathroom. While I was using the facility, a cashier who handles food and drinks came in and used the other stall. I came out and was washing my hands when to my horror she exited the stall and went right out the door without washing her hands. Minutes later, I emerged and looked for a table that didn't have sticky grime on it. (I checked three tables before finding one.) Then the lady who had neglected to wash her hands after using the bathroom delivered my beer. I reluctantly accepted it since her hands were nowhere near the rim of the glass.  Luckily someone else delivered the pizza. The pizza was actually decent, it was what I expected, but this location is straight up nasty as far as cleanliness and hygiene goes. I'm too grossed out to ever return.", "author": "Traci R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "My experience with this round table was terrible. I was overcharged by $10 for a small combination pizza and a 12 piece order of buffalo wings. My total came out to almost $45. On top of being overcharged, my pizza was delivered late as well as cold. I was extremely disappointed with their product and service. They are not the 'last honest pizza' because they are dishonest about their delivery times, dead ass.", "author": "Alden C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Sunday night.\n8:00pm.\nLazy from sleeping all day.\n\nAfter a long and stressful day of watching TV I needed some healthy nourishment.  The last commercial was for this old place.\n\nI decided to use the on-line ordering option which is easy enough. Fifteen minutes later I picked up my pie in an empty restaurant.\n\nThis is by no means the best pizza in the neighborhood but there is nothing wrong with it. This time I had the Large Original Sausage & Sweet Pepper for $18.99. \n\nThat's practically free for San Francisco.\n\nEverything was just the right amount, out to the edges and decent quality. The thin crust had no bubbles and ingredients were fresh. I will be back. This is a chain so don't expect miracles.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "Dont go here unless you want to pay for ranch. Absurd. They do not have the customers to be charging for something so simple. And they wonder why theyre going out of business.", "author": "Javier S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "We always get friendly and speedy service with this location. After being disappointed with so many other pizza spots in the area we always go back to round table since their pizzas are consistently good.", "author": "Kristina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "I don't know about you, but I really enjoy Round Table pizza. I like the crust, I like the toppings, I like the cheese, I like the flavor. I ordered pizza from this location couple of times and pizza came just the right consistency with enough juice and crust on it with generous toppings. Drivers are friendly, service on the phone is good too.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "We had build your own medium pepperoni sausage and mushroom pizza, 12 pc mild buffalo wings, 1 all you can eat salad bar and 2 drinks. Total was $59.60. Pretty expensive but we wanted it anyway. The food was good, my only concern was cleanliness. There was dust in the window sills along with dead flies, crumbs in the corners of the seats. Even the napkin dispensers were dusty. Don't think we'll be eating here anymore.", "author": "Raquel T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-20", "description": "Pizza looks good but this location is smelly and slow. I think a lot if homeless people walk in here and have seen them.  We've had to move clear across the room.\n\nWent here because kids wanted it and found a coupon on Yelp.  Really spent $3 less and waited twice as long and almost list my appetite.\n\nNext time i'm telling them we're going to get pizza from one of the better independent pizzerias within easy walking distance even if it costs a few extra bucks,", "author": "Erik H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-22", "description": "BURNT PIZZA. GHETTO SOLUTIONS.\nOk, I was weak and had a moment of nostalgia for some Round Table pizza. Little did I know that the company slogan, \"The Last Honest Pizza\" now came to mean that this would be honestly the last pizza I ever ordered from them.\n\nAfter waiting an hour and 15 mins for my pizza, I find the Pepperoni & Bacon pizza is burnt. My girlfriend and I each have a slice and agree that it tastes as bad as it looked - Bitter, dry and are pepperonis supposed to crunch this much?. \n\nWhen I call to complain, the woman who answers tells me that she can send me a new one (Oh great, another 75 minute wait.) BUT, I have to give them back the burnt pizza still intact! Really?! Yeah, Round Table pizza is just that amazing, I am going to scam them out of another one. I told her if she wanted proof the pizza was burnt, she could see the photo of the burnt pizza I was going to post on Yelp. So, now because my girlfriend and I had a slice each (See: 75 min wait), we now are stuck with this truly awful pizza that is below even a school cafeteria's standard of quality.\n\nSave yourself the heartache. I guess the owners of the Geary Round Table make so much money so they can just ignore negative Yelp reviews.  This location is an embarrassment to the chain.\n\nNEVER AGAIN!", "author": "Albert P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "On 7/17/17 I placed my order online. I immediately received a phone call from the restaurant informing me that the driver would need to take an imprint of my credit card. I did not feel comfortable with this and asked to speak with the manager. The manager was not at the store and the person who called me said they needed to call the manager and ask if I could show the driver my credit card (as I have done in the past). Five minutes later I received another call from the restaurant informing me it was OK to show driver my credit card -- but the pizza I ordered was not available. I asked to cancel order and have the manager call me. The manager never called.\n\nOn 7/23/17 I checked my online bank statement and noticed the charge from Round Table had not been removed. I called the restaurant and spoke with Mary, who identified herself as the manager. She told she canceled the order and a refund should be to me in \"two business days.\" I pointed out that the order was canceled four business days ago. To this, Mary said, \"I canceled the order on 7/18. You'll see your refund in two, three, four business days. If you want it sooner, call your bank. I canceled the order so it is not my problem.\" Then hung up.\n\nAngered by this I called into Round Table Corporate and issued a complaint. I was told someone would reach out ASAP to address my concerns. I never received any correspondence.\n\nOn 7/25/17, having still not received a refund I emailed Round Table's CEO and COO. No response.\n\nAs of 7/31/17 I have not revived a refund. I am now going to dispute the charge to get my money back.\n\nI am frustrated, disappointed and feel like my money has been stolen.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "The roommate and I enjoy eating different types of food. He loves chains, fast food, etc. I love frou frou places, coursed meals, tasting menus, etc. In fact, I think I've had more fast food since he moved in than I have had my entire life before he found his way into my apartment!\n\nDon't get me wrong. I can get down with some fast food. Doesn't matter to me as long as the food tastes good. The roommate loves pizza, so we order one once every month or two. Since we live in a city with so many pizza delivery options, the last place I think of is Round table. Well the roommate loves Round table! And I have to say I see where he's coming from. The crust is crispy and not too thick. The toppings are plentiful. And the pizza isn't too oily. Their slices have a nice chew.\n\nLast weekend, we ordered:\n\nWombo combo ($19.99 for a 12\" Medium): Zesty Red Sauce, Pepperoni, Primo, Sausage, Italian , Bacon, Linguica, Artichoke Hearts, Mushrooms, White, Onions, Green, Tomatoes, Roma. This one is the roommate's favorite. I love the artichoke hearts on it!\n\nUlti-meat ($15.99 for a 9\" Small): Zesty Red Sauce, Pepperoni, Primo, Sausage, Italian , Bacon, Linguica. I love meat pizzas so this is perfect for me!\n\nClassic wings ($5.99 for 6 wings):\nFlavor Select: Buffalo, Hot\nDipping Sauce: Creamy Ranch Sauce\nWings are okay. I've had bigger and plumper, but I liked the subtle spicy kick in these wings.\n\nWe've tried other pizzas and apps like the ones below, but the two pizzas and wings are our typical order.\n\nChicken and Garlic Gourmet\nItalian Garlic Supreme\nGarlic Parmesan Twists\nGarden Salad\n\nRound table has a delivery fee of $2.50. It's not a huge amount, but for a chain, I do find that odd. But I'm willing to pay $2.50 to save the amount in gas and just cuz I'm such a lazy butt on the weekends.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "Sorry.  I ordered from this place for a while but no longer.\n\nI would ask every time to not ring the doorbell - I have a baby sleeping.  I even have a piece of paper taped over the doorbell saying \"Don't ring - please knock - baby sleeping\".\n\nThey rang the doorbell - 3 times in a row.  I told them \"If your guy rings the doorbell again, I'm not tipping and I'll never order from you again\".  And he rang the doorbell.  \n\nIf you can't follow simple instructions or perform basic tasks, I'm not trusting you to prepare my food.  If your employees can't do that right, can we really trust them to mop the floors right or wash their hands right?  Sorry but you need to get better employees.  Pizza isn't even that good and prices are too high.", "author": "Bumbaklot R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "In the past we have had decent experiences with this location, but it has been going downhill lately.  My most recent experience, just now, has nothing to do with the food because we didn't get that far.  I called four separate times to place an order and on all four occasions I was hung-up on, after holding, by the person who was supposed to take my order.  I have had problems with them before when placing orders, but the service is getting progressively worse.  \n\nThe only good thing is I was forced to second guess my decision to order from Round Table and go back to a better, neighborhood, option that never fails.", "author": "Barry M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-19", "description": "I seldom go to this place but had to pick up a new computer down the street.  I was both tired and very hungry and they were near the computer store.\n\nI ordered a sandwich and have to admit it was pretty good with a lot of fresh veggies and quite tasty.  On the other hand they were very slow with the order so much so I known how slow I would have gone elsewhere.  I believe this is due to their baking the roll it was served on freshly which is nice but takes too long if you are in a hurry or hungry.\n\nI thought the place was a bit pricey for what I got $13 for a sandwich and a soda.  The price inflation is due to them charging a whopping $2.99 for a large soda so be advised if you want to keep the price reasonable skip the soda which was 25% of the bill.\n\nOverall I thought the bathrooms were less than I would expect.  They were tired and dirty and need painting.  I can only imagine what the place is like with a lot of kids running around at a busy time on the weekend with the dirty bathrooms (I've seen most better and a few worse).\n\nI would have given this place a higher rating if it were not for the overpriced soda and the slow service.  One would think for $13 you would also get the salad bar but you don't.", "author": "Dalt W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-07", "description": "I don't know what happened, typically this Round Table does a decent job of providing the type of\npizza they are known for....today was an off day I guess. The pizza was under cooked and there was way too much topping with too much cheese which added to the uncooked results. I had to deconstruct the pizza and pan fry the King Arthur pizza to salvage some of it. To the cooks making the pies please reframe with the heavy hand of cheese and topping. To Jessica, thank you for taking the time to take down my grievance.", "author": "Esther K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "Worst. Pizza. Ever. The delivery brought my pizza with all toppings smooshed and congealed to one side. That's the most disappointed I've ever been in Round Table and delivery pizza anywhere. Thanks for a waste of my money.", "author": "Meera K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "I joined Yelp because of my experince with this Round Table.  We order probably around 4 pizzas a month here and have them delivered.   They have always got my order right and delivered in a speedy manner.  They have deserved 5 stars ever since I moved to the Outer Richmond.  I sadly however will not be ordering from them ever again.  \n\nIts not because I am moving.  The person who delivered our last order was very rude.  I was doing a reading assignment with my 5 year old son and had my phone on silent.  Apparently the driver was calling me on my cell.   I looked outside while we were practicing and noticed a vehicle double parked.  I went downstairs and the driver said, \"I've been trying to call you.\"  I said to him that my phone was on silent.  He handed my pizza and did some noise with his lips.  I felt terrible.  I ran back upstairs to check my phone and see how long he was waiting. THREE MINUTES!!!!!!!!!  Guy waited just under 3 minutes and gave me attitude.  Hey how about ringing the doorbell?  That's what I was waiting for.  I don't want this angry man delivering pizza to my house for so many reasons.  This is why I will source our pizza cravings around the neighborhood until we get someone we really like and who rings the doorbell.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "This is my first time ordering from RT. Ordered a large pizza to be delivered. Pizza arrived hot and crispy 10mins before the scheduled delivery time. Round table pizza is better when crispy. RT is what it is if you like thin crust.", "author": "Kmaintl L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-14", "description": "Sadly I was not able to try the pizza or pasta because the hours of operation are misrepresented. The store door, online, and Yelp said they close at 11 but someone in the store decided to close early. As much as I wanted pasta, what was worse was not finding one open place in a 5 block area. Pizza Hut, please make your hours clear. Thanks", "author": "Cindy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-11", "description": "Round table calls themselves, \"the last honest pizza.\" But the workers at this Geary location are a bunch of idiots and liars. My office made a call at 11:55am and ordered 3 XL pizzas for the company. We were promised by Mariym that our pizza will be ready by 12:45pm. My co-worker and I were there there at 12:45 on the dot. I told Mariym that I needed a receipt since we paid with the pizzas with a company card. She puts the receipt in front of me on the table on a puddle of water! First idiot because she shook off the soaked receipt and gave it to me. I asked for another copy. She printed a receipt that wasn't even the same receipt. I asked the guy where our pizzas were. He said it'll take another 20 mins. I told him I was promised it would be ready by 12:45 for our company lunch. He said, it's coming. After 20 mins, I asked the supervisor how long it's going to be because we waited an extra 20 mins he got upset and yelled, you can either wait or go. He didn't want to give me a refund either because I didn't have the company card. That's why we paid over the phone! He said it'll be 20 more mins. I called my boss and she said to just wait. After that 20 mins, it was another 15 mins, another 5 mins, another 10 and we finally got our pizza at 2pm, when it was suppose to be ready at 12:45pm. As I waited, I heard Mariym tell her other female co-worker that she just tells people 45 mins and if they get mad, she doesn't care! What a bitch! I brought the pizzas back to my work and felt so bad because all my employees were already seeing patients and hadn't eaten. We all agreed to BOYCOTT all round tables. We work at CPMC. So we will definitely spread the word how awful this shit hole is. There were other upset customers. They also told the employees to be honest about the time. You'll have less pissed off people. The whole hour and 15 mins we had to wait, about 12 people cancelled their orders and got refunded. BOYCOTT ROUND TABLE!!! Paxtis will never do that to their customers! We'll go there next time!", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "I'm sorry to give this place only a 1 star. The reason is that I went there 2 wks ago. I had a coupon ordered a large pizza. My coupon was for $10 off a pizza over $25. First of all the prices on the chart was false advertising & second my coupon after it was scanned only gave me $3 off my order.  Clients be warned & be careful. I don't think I'll be coming back to this location!", "author": "Monica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "I order from this location very often -- they can do no wrong in my eyes!  I love love love their pizza and they always deliver within the time they say.  Love Round Table!", "author": "Sofia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "I love delivery from this location! I'm surprised there aren't more stars*******\nGreat service, pizza always comes earlier than they say.  Ask for the specials when you call, the offerings are an amazing value", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-17", "description": "who, in this day and age, needs a carbon copy of my credit card, even after the transaction was completed online? not a signature, not to verify my card and ID,,, a carbon copy in the hands of a driver who can barely find our address and a minor handling food and money in the store SMH. this policy is not listed anywhere on Round Table site. I cancelled my order. keep an eye out for odd transactions, if you do give them a copy. this is why we pay online and have to use chip cards. NEVER AGAIN!!", "author": "J. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "I was impressed with my take out/pick up King Arthur Supreme.  Though the place was empty during pickup, it seem like a place that was popular in days gone by.\nIt was just like how I remembered it when I took the first bite.\nThanks for the easy online ordering.\n\nIt was a little hectic for a medium Friday night crowd, but the staff did well to help.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "High prices, bad food, unfriendly staff and very slow delivery. They put cheap cheddar on their lousy pizzas instead of all Italian cheeses and nothing looks as good as the photos. You're better off making your own pizza at home. It's very easy with pre-made crusts and there are lots of great recipes online.\n\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.", "author": "Pam J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "We ordered a pizza and wings. It took 1 hour and 20 minutes for the delivery guy to show up. And no, it wasn't game time or any other big event where you would expect a delivery delay. When he opened his bag he didn't have our pizza. He left and we were empty handed. I called the store and asked them about it. They put me on hold and said that he gave our pizza to someone else. Boxes are labeled; shit's not difficult. We're hungry. I guess I shouldn't be so lazy and just cook at home. The woman who I spoke to on the phone was really nice and apologetic. I don't want an apology or discount, I just want the food we ordered.", "author": "Yelper F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "Ok what's with the .10 bag charge when they deliver pizza in a box \nAlso they charge 2.50 delivery charge for only a mile away. My order was 25.00\nBig rip off most place give free delivery \nThe pizza is no big deal, it's a family restaurant  I like chuckey  cheese pizza better", "author": "Irving S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-22", "description": "The pizza is okay. I generally like Round Table pizza. This is sort of like most Round Table, but they tend to skimp on toppings. Delivery is slow, never at the \"fulfillment time\".  Don't bother to call them with feedback, the manager blames everything on Round Table headquarters.  I would order from the Van Ness location, but their online ordering system says I am out of their delivery zone. More than 45 minutes late.", "author": "Blair C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-07", "description": "This location is extremely hit or miss. I have had really good fresh pizzas, and dry, bland pizzas. My husband says he likes to eat their food as long as he doesn't have to go into the store, because it always smells bad, and there is no one there so the people working there just stare at you while you eat. \n\nThey also have a delivery fee so we usually get takeout. But there are so many other options, within 3 or 4 blocks there are at least 3 other pizza places. And they are not particularly cheap, as far as chain food goes it seems very overpriced.", "author": "Venus S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-08", "description": "I like Round Table Pizza. In the world of chains they always manage to make a darn good pizza with fresh ingredients and hand formed crust and that's something that can't be said about the Pizza Hut or Little Caesar's chains.\n\nI've always been quite the junk food junkie. Living in the Bay Area for most of my life has developed a sense for finer foods, but I often fall back on my junk food past.\n\nSo driving around the area one afternoon I suddenly saw the Round Table sign and had a sudden urge for their pizza. I found parking fairly close so I walked into the mostly empty restaurant. This specific location is larger than most RTPs I've gone to.\n\nI knew exactly what I wanted. Personal pizza? Heck no! I'm having leftover slices for breakfast the next day. Small sausage and mushroom is how I roll. Ordered that with a bottomless self-serve soft drink.\n\nFast and courteous service! I had a delicious pizza in front of me in just a short time. Unbelievably I ate half the pizza and guzzled down two sodas. Who woulda thunk a skinny girl like me could eat like that!\n\nI asked for a box for my leftover slices and happily left the restaurant. Definitely the good, honest pizza they claim to be!", "author": "Sara A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "Ordered I pizza the Guinevere with sausage added for a total of $34+ for a large. The pizza arrived over an hour later tepid , soggy as hell an flavor less asked for extra sauce but didn't receive hardly any in the first pelace. The sauce any way is not appealing with there spices especially when it's cold. Quite tasty if I had ordered a sponge.\nTo me it was horrible .  With any luck I will never order again . If I'm that hungry I will consult my freezer thank you!", "author": "Stef M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-09", "description": "Ordered twice within a month for delivery which consist of a personal size pizza and 3 garlic twist. Both times we asked for ranch dressing for the garlic twist and both times we did not receive it. \n\nDo people really eat garlic twist without ranch dressing? I don't understand how they don't automatically put the dipping sauce inside the box. \n\nWill not be ordering from this location ever again.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "This is my first review I've ever had to write. If i could I'd give zero stars. I ordered an artisan pizza for delivery just because i had a newborn. Mind you this is not my first time ordering the exact pizza that was already in the system.  When the delivery guy came, I received a totalllyyy wrong pizza. It looked half ass made!  Basil on the side.  No tomatoes or mozzarella on the top. Just pepperoni and sausage. A lady called back and said it was right and said she was sending the pizza back. I specifically told her that was not it, there were items missings and told her to even look online.  She kept denying it, and said the basil is on the side.  Why would the basil even be on the side for us to even put on??? I HATE DEALING WITH IGNORANT PEOPLE!  POOR SERVICE!", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "Great Service. Very good pizza. Lots of selections. Also have had take-out and delivery. BOTH very good!\n\nGo to this location regularly and like it a lot.", "author": "John G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-06", "description": "We call here almost every Friday for the same thing. I live ten minutes from their store. They use to deliver faster than the 45 minutes they say. The last two weeks \"they've been busy\" so it's was an hour last week and 1:15 minutes tonight. The pizza arrives cool and taste like leftover once we have to heat it up. Dude on the phone: we're trying the best we can. For this much money for a large pizza it needs to be so much better. Oh well, probably won't do that again.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "As bad as all the reviews say. Took over 2 hrs for the pizza to be delivered and the store was less than a mile away from our house. Called to check on the status and the round table worker hung up on me before I finished talking. Will never order from this round table again.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-21", "description": "Ordered XL Maui Zaui and XL King Arthur for delivery.  Promised in 45 min.  It was delivered on time.  Maui Zaui was a hit.  Gone in 60 seconds but the King Arthur difficult to eat because it was heavily salted.  The King Arthur was packed with sausage and pepperoni olives green peppers onion which is similar to the Costco's version.  I actually like the costco pizza more.  Round table has a better selection and delivery.  Next time I stay away from the King Arthur.  Only if Costco widened their selection with a Hawaiian pizza and offered free delivery.", "author": "S F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "Ordered a X-Large pepperoni pizza. Very uneven pizza toppings, but we started eating it. We stopped eating it when we found a piece with black bits inside the cheese and another piece that tasted like cleaning chemicals. We complained to the store and they asked for a photo of the pizza which we provided. The manager was extremely aggressive and said he won't do anything because we ate a lot of the pizza already and there can't be anything wrong with the pizza because they have inspectors that insure the quality. We came to Yelp and found this restaurant has a long record of poor quality food. We won't be eating here again after getting no satisfaction from the rude manager.", "author": "Randy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-25", "description": "If I could give negative stars, I would. The owner and manager of this location should be embarrassed. It's disgusting, filthy, and the employees get the award for the laziest employees of the year. \n\nI went in on a Sunday afternoon about 1:30 and there were 4 other people in there. Hardly busy, but the employee's sit and watch the game or t.v. in between going out of their way to take an order. The tables are filthy, the windows and mirrors have so much dirt smeared on them, I'm not sure how anyone could see through them.  Both bathroom stall doors were busted and the stall I entered was out of toilet paper. The salad bar isn't full, the croutons were stale, and they were out of ranch dressing. \n\nHere's a thought, in between helping the occasional customer, you WORK!! Call me crazy and maybe my expectations for the 20 something generation is far too high, but  part of working at a restaurant is CLEANING and REFILLING the empty food products. Your job is NOT to sit down and color while watching the football game. \n\nThis place is a disgrace to Round Table Pizza's everywhere.", "author": "Brenna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "Always have my last order on file. Easy to pick up and not too expensive. I have always loved their pizza for being consistent, the marinara sauce has a little spice, and it's pretty quick. If I am not ordering gourmet, I go here because I know what I am getting, a delicious pizza!", "author": "Tevis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-25", "description": "The staff is nice and the pizza is decent, but the facilities are a little unkempt, and the food's a little pricey for what it is; you *almost* get what you pay for. I like the pizza fine, but the salad bar is sort of lackluster. Many items seem to be straight out of a can and much of it tastes stale; it's just not that impressive. Still, I can't ever say I've really regretted going here because, flaws and all, they do make pretty decent pizza and everyone who works there is nice. I've been to many restaurants around this area with somewhat rude employees, and I do appreciate their good service.", "author": "Erik B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-22", "description": "In some strange need for nostalgia, my partner decided to order a pizza and garlic sticks from here. With the seemingly fresh veggies, it's a teensy step up from, say, pizza hut. But why (whywhywhywhywhywhywhy) would anyone want to eat nasty chain pizza when there are so many decent, independently own pizza joints in this city? It's not like we're in the middle of the suburbs or out in the sticks with no good food choices! We're in San Francisco ferchristsake! With more restaurants per capita than anywhere! I'm as much of a pizza snob as the next East Coast transplant, but even I'll take subpar pizza from a corner mom and pop shop than the nastiness that comes from one of these chains. \n\nAnd who puts cheddar on pizza anyway??? \n\nI hope he enjoyed his nostalgia because he has an entire pizza and box of garlic sticks for himself.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "I'm not sure why people don't like this place more. It's always empty, and if you sit down they'll let you turn on the game. Salad bar and the sides are pretty good. Easily the best pizza in the area. Only downside is that it is kinda pricey. High quality though. Order for pickup.", "author": "Ron D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-05", "description": "Ugh. Round Table. I will never stray from Domino's again.\n\nMe and four of the boys - first televised Giants game of the season. First commercial - the Round Table Barbeque Beef and Bacon pizza - cheers go up. We decide to order. It's 6:41. We order a large BBQ beef whatever and a two liter of Dr. Pepper. They quote us 26.60 and an hour. Whoa. Pricey. And lengthy - especially for a room full of sub-seven foot twenty-something men. And demure little me. I have misgivings. I feel like chocolate lava crunch cakes from Dominos. After ordering, I, online, order some cheesy bread and lava cakes from Dominos.\n\nThe Dominos arrived, hot and delivered by a happy, funny guy, in about twenty, twenty five minutes. No kidding. And they came all the way from the lower Fillmore. \n\nThe Round Table came at 8:18. The delivery boy seemed unhappy with his $3.40 tip. The ninety minute plus pizza was cold. Partially cooked. A size smaller than ordered. Coming from less than a mile away. Honestly, in a city like this, you're THAT busy? \n\nAnd they sent Diet Pepsi. Diet Pepsi. Gross me out twice. I have no recourse. I, being the demure female, was ordered to call and complain. The guy who answered the phone hung up on me. I called back. This time he told me HE was the manager. Do people still do this? I guess so - even in the day and age of online complaints. \n\nSkip it. The pizza, even after I threw it in the oven and finished cooking it (I mean, really? 90 mins and it isn't even cooked? The cheese was still shredded!) it tasted like death on crust.  Just, ew. Okay? Ew.\n\nAnd for the record? I hate writing reviews. It seems like I only do it when something really shitty has happened. Now I have to write a second to prove I'm not a bitch. And the Giants lost. What a crappy night.", "author": "Raina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-20", "description": "I've ordered from Round Table in the past; it's decent pizza. Not particularly memorable, but not offensive either. Though it's MUCH better fresh than reheated or cold. I know the same can be said of most pizzas, but Round Table's in particular seem to congeal pretty fast.\n\nThe single star is for my experience today. Ordered a medium pizza last night with black olives and green peppers, nothing complicated. Ate half the pizza last night and saved the rest for today. I was chowing down on a piece at lunch when I felt something REALLY hard in my mouth. I bit down on it a couple times but it wouldn't break down. When I spat it out, I saw it was a tiny metal coil. In the pizza.\n\nNeedless to say, that ruined my appetite and I won't be ordering from Round Table again.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-30", "description": "It's round table...so you know probably know what its like. I haven't had it for a while but got a random craving for the round table taste. Expensive as usual..round table, while still being a megacorp pizza, still thinks its too good to offer decent discounts, even during this recession (unlike pizza hut n dominos who have gone insane).\n\nIt came as expected..took a while to deliver tho (about 55 mins)\n\nAnyway this was just to satisfy a craving, next time ill go back to Nizario's, Pizza City, or Irving for delivery. \n\n*****Heres where this review can be useful for you. I wanted to get some wings as well as my pizza, but dont think ive ever had em at round table. I figured since it was round table they have to be better than the shitty pizza hut and dominos wings (sometimes when pizza hut has wing stop i guess its ok, but those are loadeddd with MSG). I was wrong...the wings were horrible. Soggy and flavorless, very similar to the shitty frozen wings you find at safeway. I had the honey bbq and imagine the regular spicy is even worse. I only got 6 wings and i didnt even finish em. They were not cheap either $5 something for 6 wings...for that much I can get a whole huge bag of the frozen shit at safeway, and these were of the exact same quality.", "author": "Belito L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-23", "description": "If you have plenty of time and got nothing else to do please come here and waste your time. Chicken wings took 35 minutes to get ready. Very Mean People and supper bad service. They focus on deliveries I guess. Please to come for the in house eating.", "author": "Hidayat U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-05", "description": "I come here because it's close by and hardly busy whenever I come in. For that reason this is not meant to be a negative review but just to share a experience related to service. I ordered an extra large as well as a kid's pizza for my son. The kid's pizza came out first and was served on a plate. I handed the plate to my son who somehow grabbed the plate before it touched the table. Just a slight angle and the whole pizza slide off onto his lap and eventually on the floor. The server came back with the other whole pizza and noticed the kids pizza was on the floor as my wife was trying to clean the hot pizza off my son and I was picking up the pizza from the floor. My son was screaming it was really hot and I too felt how hot it was as I was picking it up from the floor. At this point I didn't tell the server if we could get another one since I attributed it to my son mishandling the plate. I actually thought she told the kitchen to make another one but eventually we didn't get any replacement. In terms of servicing the server should have warned us the pizza was VERY hot considering it was for a child. Secondly, the server made no attempt to even ask if we wanted another one (extra money or not)", "author": "Benson C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-11", "description": "The man who took my delivery order was rude from the start.  Was even worst when I said I had a coupon.  Was quoted for a 45-minute delivery.  Took a little more than an hour for our order to arrive.  AVOID!!! \n\nDelivery guy was nice though; otherwise definitely would have gave a one-star review.", "author": "Max P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Got a small combination with no cheese. Came out fast and who ever put this pizza together was a god!  Excellent toppings and plenty of them.  Would not have known there was no cheese!   Will be coming back!  A lot!  :-)", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "I now work around the area. So I'm going to frequent this place. But they need to get their things together. Usually the weekends are busy anywhere you go. This place is busy with only one cook and one front worker. Hopefully someone called out sick today and that's why they're sober handed. The table I was sitting at waiting for my food was dirty. There were pizza crumbs and oil marks all over the table. The poor guy at the front was answering 2 phones and taking walk in orders and cleaning up and delivering food to the tables. Staff up please! The food is average. It's pizza. Oh and if anything, call ahead if you're going to dine in.", "author": "Ta S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "I am very disappointed in this Round Table location.  I work nearby and had a large order to place (a few hundred dollars worth) for a work event.  I called right when they opened as I figured they would want a heads up on a big order.  When I called, the guy who answered the phone did not say Round Table so I had to clarify where I was calling.  Then, when I told him I wanted to place an order for delivery, he told me to call back.  When I asked him why I would call back since they were open, he told me that the cashier was late to work and he wasn't sure when they would be in.  I told him I needed to place a large order and he told me that I couldn't.  When I asked to speak to a manager, he hung up on me!  I called back twice and no one picked up.  Needless to say, I called another Round Table who said they would go the extra distance to complete our order since I received such poor service.  I will not be giving the Geary location my business due to their horrible customer service which is a shame for them as we frequently have high dollar orders.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "I bought a pizza via their website and this location never delivered the pizza. When I called the next day the person told me they cannot do anything about a refund and referred me to the website. They offered no help at all to try and figure out what happened. Actually, when I asked the person what happened, they told me that all the deliveries were complete and hung up. Well, I contacted the website and after a few days they told me they would send my complaint to the store who would then personally contact me. That was a month ago. I contacted the website again and they stated that only the store can give a refund. Either both are lying, or this location did not want to deal with me. They stole $24 from me and offered no help. I am very disappointed with the lack of customer service and will never buy Round \nTable again. Do not go to this store because there are better pizza locations that actually care about their customers.", "author": "Jacob A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-09", "description": "First experience with round table pizza. Got the King Arthur supreme. It was mediocre but then all my roommates and I got sick after. Never again!", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "I'm so surprised that this Round Table Pizza location only got 2.5 stars because I've always had efficient and friendly service when dining there. In the past 6 months, I've probably gone five times...true story. And after throwing a fun birthday party there, I felt like I've tried EVERY pizza they offer with the exception of the all meat ones and the Hawaiian or anything w/ pineapples (not a fan on pizza and savory foods). \n\nMy favorites have to be the King Arthur Supreme, Wombo Combo, BBQ Chicken. and Italian Garlic Supreme. Not THE best pizza out there, but I do love the thin crust and zesty red sauce. A huge plus that they are consistent with the size of the ingredients, as well as the amount on each pizza, and crispiness of the crust. \n\nSay yes to the Garlic Parmesan Twists with the creamy creamy ranch dressing, and the salad bar as well. Skip the Buffalo Wings as they weren't that spectacular and seemed undercooked. One thing that's worth noting is they don't have a freezer (at the bday celebration we asked if they could put the ice cream in the freezer but since they didn't have one they just stuck in the fridge). At least we know that ingredients are fresh...no thawed out Buffalo wings, crust or twists.  Also, they have a good number of special deals/pacakges that aren't too publicized, so with asking if you're a large group dining there.\n\nI'll probably keep going because it's reliable in terms of food quality and service, always ample seating, and a hop jump skip away from my home and workplace. And you gotta love their slogan, \"The last honest pizza.\" I'd say, in terms of big pizza chains...yes.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-16", "description": "Been here twice to eat and it's usually always empty. The place is a typical round table but not the cleanest looking. The pizza is nothing compared to any other round tables I have been too. It's more burnt. Oily, and cheesy then the other places. You get no satisfaction from the pizza expect feeling out of shape with all tht oil inside of you. Overall I wouldn't come back to this location again unless they change there quality and put it in the real standards of how round table  pizza should be", "author": "Leonard I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "I don't know why this place has so few stars.  We ordered 2 pizzas and wings, and it was all great!   The delivery was faster than expected, the food arrived hot and it was all delicious.  Both pizzas were totally loaded with toppings and cheese and sauce.  No complaints.", "author": "Caitlin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "When I was a kid every day after school I would go to round table with my friends, play video games, and of course eat pizza. I loved it as a kid. Until recently I had not had a Round Table Pizza since I was a kid. That all changed after I saw that $10 for a large pizza promo. I figured why not give it a try?? how bad could it be??\n\nFrom the first bite I was hooked again. There is just something about the crust, the sauce, the cheese, and the pepperoni that I just love. It instantly became my favorite pizza again and will remain my pizza place till I get sick of it which might not ever happen.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-29", "description": "Dirtiest RT I've ever been in, hands down. Corporate should stop by this location. They would shut it down.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "Best service ever. I was there just this Friday and even though they were busy they provide me the best service. I also had couple request add up to my order and the manager took my order very patiently.\nGreat quality.", "author": "Boz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-25", "description": "I love Round Table. Everytime I come home from New York ( Yes, Round table is a guilty obssession) I order a pepperoni pie, garlic twists, and extra ranch sauce.  Yay for Round Table!", "author": "Jilleen l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "Good but kinda spendy. Wombo combo is addictive", "author": "Buzz L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-06", "description": "Better than many of the mom and pop pizza places out there.\n\nIngredients are often fresh and their crust is better than a many, but still lacking in some of the tooth and standup (non floppyness) I enjoy in a good dough.\n\nI've gotten delivery and also ordered at the counter. Wait/delivery time has always been right around an hour, which is pretty average for a pizza pie place.\n\nFor the delivery price, it's great. I've paid twice as much for half the satisfaction.\n\n\nIf you really want the quality you're going to have to go to a place that has it, pay 1/3rd the price more, and sit down and enjoy it at the establishment.\n\nhttp://roundtablesf.com   for online ordering.", "author": "Roger C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-03", "description": "Rude, slow, I mean reaaaaal slow.\nI tried it once and thought oh my god its soooo fucking expensive pizza....why?\n\nbut I tried again last night, called for delivery, rude lady picks up and yells HOLD!\n\n5 minutes late i am still on hold listening about their corporate customer service and how we are really important.\ndont think so\nmind you we were trying to watch the Stanley cup, we need pizza, so I hang up and drive to Safeway to pick up a digorno and 2 bottles of pinot noir, and still came up under their $25 for a medium pizza...\n\nTHIS PLACE SUCKS", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-05", "description": "Prompt and couteous staff!  The Smokehouse Combo pizza with artichoke hearts added is my all-time favorite! A great place to hang out for dinner or lunch, plus it's super-convenient on Geary close to all my Clement Street venues", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-21", "description": "I ordered a XL gourmet Chicken pizza to be picked up.  I had their coupon to use.  Upon arrival I gave my coupon to the cashier.  She rang me up but charged me $22.99 when the coupon said the XL Specialty Pizza is for $20.99 with coupon.  When asked about this she said the prices went up.  I told her that is misadvertisement and wanted to talk to the manager.  She said there was no manager on site at the time.  UNACCEPTABLE.  When customers anticipate to pay a certain amount due to their advertisement, they should honor what they advertise.  In addition, I still get the same coupons in the mail still advertising the cheaper rate as of today.  This is not right.", "author": "E. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "I never write reviews on here, but I felt inclined to after my latest Round Table experience. I like my pizza well done, and they've alway obliged on this request, and they also deliver it promptly and with a smile. I know this place gets a lot of bad reviews on here, but I implore you to give them a chance.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-13", "description": "I used to love Round Table but the store on Geary has completely ruined it for me!   We've given it several shots just to make sure it wasn't a fluke....but no!  \nAlways Late!!\nAlways Cold!!\nAnd Always Awful!!\nSorry Round Table, our relationship is over.  It's not me, it's you.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "*sigh*\n\nI have such a love/hate relationship with Round Table.  It's one of the things I like about going there. I'm starving, hungry for anything. So we go to RT for quick and dirty pizza.  i'm giving it 3 stars because for a Round Table, it's good.  I said for a \"Round Table\", not for a pizzeria.  It's apples and oranges, folks.  \n\nI mean, why do you go to McDonald's? Is it for the tasty burgers? Um no.  It's for the \"McDonald's burgers\", which are a completely different food category on its own.  \n\nThe crust is thin and crispy.  The salad is always consistently average.  Obviously they've bought their produce from the same place for the last 10-20 years.  When you come here, you always know what you're going to get.  The service is average, but it only ever takes 5-10 minutes at the most for my personal pizza to be zapped up.  And when we go, there's never more than a couple of other tables, so it makes the service even speedier. \n\nIt's definitely Not like a box of chocolates.   You always know what you're going to get here.", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-25", "description": "I was quoted 45min but took over an hour to be delivered. It was $25.00 for a small salad and small pizza maybe because it was half hawaiian and half sausage and pepperoni I don't know just seemed pricey. The pizza took so long that it was cold and hard, I had to reheat in the toaster oven.   luckily I had my own parmesan cheese and red pepper because they didn't give me any. NEVER AGAIN!!", "author": "Rude A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "I order for delivery and everything work out great. I receive the pizza In about 30-35 minutes and it was nice and hot. Very delicious and it's one of the greatest tasting  pizza had in my life. I would recommend chicken garlic gourmet.", "author": "Jorge A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-23", "description": "Sometimes nothing hits the spot like Round Table pizza.  I grew up on it, it's my dad's favorite, and at times it is an absolute necessity (take, 1pm on Bay to Breakers Sunday, for example).  Sometimes, you also don't want to leave the house and need to have it delivered (see previous example).  Few things ruin the magic that is pizza delivered to your front door.  Here's a short list I've come up with:\nWhen my 45 minute wait (45 minutes?!) turns into an hour, which turns into a follow up call on my end once that hour has turned into more pizzaless time.\nWhen that pizza that took so long to arrive (serious agony) is room temperature when it finally shows up.\n\nCome on Round Table, pull it together.  You only need to do two things - make the pizza and deliver it.  If you can't manage, I know plenty of other places that can, nostalgia be damned.\nTwo stars since I still ate the hell out of it.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-24", "description": "I usually love Roundtable, but not this location.  Several times I've gone in off the street and things were okay, however recently my boyfriend and I ordered delivery and have decided to never order or go here again.  \n\nWhat happened?  Well not only was the pizza an hour PAST the 45 minute delivery time quoted, but the pizza was stone cold, the garlic twists were cold and kinda burnt and they over charged me.  We ordered the \"Big Vinnie\" meal that was supposed to come with a large Big Vinnie and breadsticks for $18.99 per the commercial.  The guy even restated that over the phone and we added a 2 liter of pepsi (which they charge over $3 for mind you).  Somehow the bill was $28.  I'm not that great at math but 18.99 and 3.00 do not add up to 28.00, even if you add in tax.  \n\nJust to add a cherry to the bad experience we only live 20 blocks away in the direction away from traffic.  I can (and have) walked from the Round Table to my home in 20 minutes and a pizza takes 10 minutes or so when you walk in so there was no reason a pizza driver needed to take a hour and 45 minutes to get there.", "author": "Dawn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-11", "description": "I had my mom call in a pizza tonight because I am taking care of my sick daughter. She uses her card. They refuse to give me the food because I am not in possession of the card. Pizza showed up 1 1/2 hrs after she ordered it, and I couldn't even take the pizza. Not I have to pull my daughter out of bed at 6:30pm on a rainy, cold night, while she is sick to go get food. ABSOLUTELY RIDICULOUS! They are garbage.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "I have long been a fan of the King Arthur's Supreme, but 24 bucks for a medium??????? Gimme an f-ing break.\n\nThis sort of price gouging from a chain will insure that I became a full time Little Star guy.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-07", "description": "Worst pizza experience in recent memory! Too many negatives to explain. I grew up on and still love Round Table pizza but this location does it all wrong. Will NEVER EVER eat at this location again. BEWARE!!!", "author": "Kort S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "I came here to eat the pizza and it was great. I dine-in and the pizza was out in less than 10 minutes. The cashier was very helpful and notice team work among them. Great service.", "author": "Danny Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-02", "description": "My kid earned a free pizza coupon from Round Table by participating in the library's summer reading club. She was thrilled -- she if four, and pizza is like crack to her. Anyway, so we go to claim her pizza, and the manager says that they aren't participating in the summer reading club promotion.  What the hell? \n\nThe library says that all Round Tables in SF promised to honor the coupons. These guys are just jerks.  Well, the library didn't say that last part, that was me.\n\nOh, and I actually like Round Table Pizza. That Wombo Combo is tasty. But not from this place.\n\nAnthony A, I will gladly join your fight to destroy this Round Table franchise.", "author": "Tailypo W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-22", "description": "They have a private area for parties, so we decided to give them a try. We've gotten RT delivered for years with that love/hate everyone else griped about. We spent almost 4 hours there despite booking for 3 hours and fed 21 kids and 15 adults and for the party food, it came to under $300. They didn't mind the kids' noise and were all very accommodating, even after they ran out of paper plates and needed to give us REAL plates! Their party room is no charge but they do charge for the pizzas of course. Remember to try to bring coupons cause they will honor them. I didn't know this but they did give me 10% off.\n\nA side note for parents who might have a pizza party here: they have video games and those little gumball machines with toys, so bring lots of quarters, cause while they will give you change, we used up most their quarter stash!", "author": "cindy c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-01", "description": "First let me say that I actually really like Round Table Pizza.  But this location is HORRIBLE.  The first couple times I've ordered from them I received a pizza with no sauce on it.  So, the next couple times I ordered extra sauce thinking I'd at least get a normal amount of sauce.  Still, the pizza shows up with no sauce.  So the next time I call rather than placing the order on line and specify that I actually want sauce on my pizza.  Sure enough, it comes with no sauce.  When I called back to complain and have another pizza delivered all I got was attitude from the manager... and the kitchen people told him they did put extra sauce on the pizza and he didn't believe me.\n\nAm I missing something?  Is the sauce the most expensive part of the pizza and they are trying to save money?  Other than not having sauce the pizza is loaded with toppings so I don't understand why they have such a difficult time putting sauce on the damn pizza.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-26", "description": "The customers service wasn't that good for us. Me and friends ate and we were suppose to have a party in that party area. They never opened the lights for us for the whole time we were there. The XL pizza had 16 slices. The pizza was like a medium with small slices of 16 slices. Might as well go o Costco. Well it taste okay.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "always a treat to go this place. well ordering from it at least. way back when as a kid this was always the place to go for anything from birthday parties to post-basketball game meals with friends. these days i generally only go when i get my \"roundtable cravings\". they usually begin sometime in the mid afternoon and only when im at work. the thought of roundtable pizza with a side of garlic twists along with (for some odd reason) a 12 pack of miller high life bottles (only bottles, no cans) that are put in the freezer and become either ice cold or borderline slush. one of those things in my life that i cant really explain, but i do however recommend to absolutely everyone. \n\nbut everytime lately that these cravings have come about i always get my order over the phone done fast and efficiently and the delivery always comes sooner than expected. sure it costs a little bit more than the average pizza you might get at other spots but as ive learned that when i crave roundtable NOTHING else will do.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-27", "description": "Round Table Pizza is a freaking rip off.  I still eat here every now and again, cause there's nothing like a little MSG on your pizza, but unless you got some coupons, spending over 20 bucks on a combination large fast-food pizza simply isn't worth it in my book.\n\nDelivery is also a pain.  Expect to wait up to an hour from the time you order till the pizza arrives at your door.  Every time I call them up and ask them, \"Hey man, where the hell is my pizza?\" they have this crazy knack of ringing the bell as soon as I hang up the phone.\n\nBut still, it's Round Table.  I'm also guilty of ordering a Chicken McNugget  meal every now and then, too.  And even though I crave a nostalgic slice of King Arthur Supreme once in a while, at these prices, the world maybe be better off without it.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "On the day of our party, I ordered (with Joe) 11 pizzas (cheese, veggie, sausage & mushroom) to be delivered to a nearby park by 4:00.  The pizzas were there on time. They were hot and delicious.  My only complaint is one cheese pizza was slightly overcooked but we had plenty so it wasn't a big deal.  I highly recommend them.", "author": "TC C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-11-22", "description": "This may be the best chain pizza place but thats like saying this is the best pile of shit I have ever stepped in. Ok, it isn't nearly that bad, I just wanted to put that very gross image in your head.\nAnyways, their pizza has way to much crust and not enough sause and toppings. Delivery is normally fast. I only eat this pizza when it is free at school events or parties.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-28", "description": "It's Round Table.  Everyone's had it.  Why do I continue to get it?  They deliver.\n\nIt's fine.  I think it's too pricey for what you're getting.  Especially for a chain place.  I am a sucker for their twisted breadsticks.\n\nAs long as I have coupons and they continue to deliver, I'll keep calling.", "author": "Melissa Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-15", "description": "I do not understand the hype over this pizza.  I've heard from many native Californians how great Round Table is, so I thought I'd give it a try.  I ordered a large pepperoni and onion pizza and it cost over $20.  Plus a $2 delivery fee - are they kidding?\n\nThe estimated time for delivery was 35 minutes but it arrived about an hour and ten minutes later (it's not Chicago Style!).  I had to heat it up in the oven b/c it was so cold.  The place charges as if it's upscale, restaurant pizza, but really it's just cheap fast-food quality (similar to papa johns or domino's).  NEVER EVER again  will I order Round Table.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "This is the only Round Table Pizza in SF I know as of now that will have shrimp as a topping when I order the King Arthur Supreme combo.  I know, I'm against the flow in that I request for the shrimp and anchovy to be added.  They have pretty good beer selection here also.  The last time I was here, the girl at the counter seemed a little challenged maybe due to language, but overall she was okay.", "author": "H K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-01", "description": "I do agree from the other reviews that this Round Table rates pretty low in providing quality pizza for delivery.  I once received a cold and \"stale\" pizza delivered to my home after waiting for almost an hour.  \nOn another occasion, I personally went there to order a to-go pizza only to find out after 45 minutes of wait that they had had some mix up with the orders and \"forgot\" mine.  Total wait ended to be over an hour!! Imagine that, waiting there in person over an hour for ONE pizza.  \n\nYet, I now give this place a 3 stars only for based on their SALAD BAR.  Since my husband and I enjoy eating at Fresh Choice and given that there is none located in the city (only in San Bruno/Daly City) we would usually go to this Round Table for their all-you-can-eat salad bar ($6.99, which is a pretty good deal).  The choice of vegetables is pretty decent, and the staff does a pretty good job in keeping the bar wiped clean and re-filled.  And once in a while, if we feel like it, we'll order a small pizza to complement our plate of salad.", "author": "Nadine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-22", "description": "if I could give negative stars I would. ordered a small King Arthur's supreme with a side order of 3 garlic twists. we decided to pick up since wait time was 20 minutes vs 45 for delivery, and with the NFC championship game on, every second counts! we left the house late and now after an hour after the said 20 minute pick up time, I'm still waiting in my car for this damn pizza. yes, I'm listening to the game on knbr 680. lame.", "author": "Rica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-11", "description": "I personally like this place. Although I've always come when it's fairly empty, I still feel my review is fairly accurate. The guys that work here have always been very nice and I think their personal pizzas are just great. I come here when I need a quick meal and I'm fixing for pizza. I'd recommend dining-in instead of ordering based on the other reviews.", "author": "Allison K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-06", "description": "Manager is rude, has no customer service skills.  They seem to never have any of the specials offered online at this location. I agree RIP off.", "author": "Shima L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "Why does everyone have to hate on this Round Table?  I've gotten delivery twice from this location and it has entirely met my expectations of pizza delivery.  Coupons in the mail make it cheaper, the website ordering (even of half and half pizzas) makes it easier, and they've always come on time or early.  That's good enough for me.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-13", "description": "As far as chainstores go, the pizza is a little doughier and crispier than Domino's, but not nearly as doughy as Pizza Hut. (Little Ceasar's seems to still be the best tasting chain pizza, with Papa John's a close second.) Still, the pizza here is just not worth it at this price. For much less you can get a more satisfying meal out of a no-name pizza brand anywhere in the city. A sitdown will give you ok to not-ok service, depending on if it's peak hours with families who bring in loud obnoxious children (usually ensuring not-ok service from the already disgruntled personnel).", "author": "Clar L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-11", "description": "I typically like round table pizza especially their garlic cheese twists. Plus it's a franchise they can't really mess it up too badly right? Wrong! \n\nFirst off they take FOREVER to deliver on a monday night where there is no football or anything else along those lines.. But hey I can deal with a wait, we all kind of expect that sort of thing.\n\nThe Pizza was ok the bread sticks were woefully over done. Again I can deal with that occasionally you get goofballs who get high temperature happy and over cook food. \n\nWhat I cannot tolerate is making mistakes that could potentially harm people. I am very allergic to tomatoes i break out in hives and get headaches and well it's just not fun. Now I call in and place my order and ask for white sauce. The lady says what sounds like white sauce. So repeat just to make sure i'm understood \"white cream sauce\". Now i figure that's enough because we continue with the order. I wate.and it arrives in about 45 mins about what the lady said.\n\nThere on my pizza is LITE RED sauce. Now since it wasn't very visible and i was damn hungry i ate a slice before realizing it was tomato sauce. So I called the store and said i had a complaint. Who ever I spoke to was rather rude and was apparently trying to blame me saying that's why i asked you twice. Well i'm sorry she had a strong accent and white and lite sound similar. Anyways they did replace my pizza, and demanded i give them the one they botched... PLUS it took an additional hour for them to deliver that one when it should have been placed as priority. \n\nThis is definitely NOT a round table i will go to again.", "author": "Just My O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-14", "description": "I had to stop eating to write this review.\n\nI ordered by phone and asked what the prices were and he gave them to me and included a delivery charge.  Delivery Charge??? Isn't delivery what keeps them in business and they charge for it?  \n\nI asked to have a large combo and a personal cheese pizza with extra cheese but only provolone and they could not do it since it was all prepackaged.  I thought they made everything fresh.  Guess not that fresh.  So I canceled the personal pizza and had extra cheese on the combo and the cost was about $26.  \n\nThe pizza arrived and it was horrible.  Crust was thin and had no taste.  I saw no extra cheese.  Very disappointed.  I could've madea better pie.", "author": "kenny l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-22", "description": "Made an order for delivery here and they told me an hour. An hour goes by still no pizza so I decided to take a shower. While I was in the shower the delivery guy rings the doorbell and my landlord opens the door and tells me the pizza man is here. This delivery guy yells at my landlord and tells her to HURRY UP after being about an hour late. Then while I'm grabbing my money I can hear this guy screaming from downstairs PIZZA PIZZA PIZZA i tell him to hold on and come down and tell him to chill out that i was in the shower as if he couldn't tell from the soap and towel wrapped around my waist and he replies RUDE AS F@#K , \" YOU COULD HAVE TOLD YOUR MOM TO PAY WHAT\"S WRONG WITH YOU\" i'm like wtf... you guys are an hour late and thats not my mom he then proceeds to throw the receipt in my face put the food on FLOOR and TIP HIMSELF while yelling at me about how far this is from where he works... if you live in SF you know that Sunset to Richmond is about 5 minutes away... my brother has down syndrome and he can walk from Richmond to Sunset faster than 2 hours ... I call round table to complain and they offer me 25 percent off my next order... like I would ever order from here again....  if you could even call eating frozen pizza eating...I mean really who likes spit in their food anyways. STAY AWAY AT ALL COSTS", "author": "Solo D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-01", "description": "i tried to use a coupon that i received at a baseball game, and i don't know if it was the language barrier or low IQ or just plain incompetence, but it took 3 employees and 10 minutes of stilted discussion to decide they'd accept it \"this time only.\" the attitude was just too much, but luckily, we got our personal pan pizza to go. if i'm coupon-less, i'll definitely go someplace else (giorgio's or gaspare's, definitely).", "author": "Bee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-18", "description": "splitting a large pizza and reading the onion isn't an awful way to spend 20 bucks and 40 minutes. i haven't gone to nizario's, though... do they have good reading material, empty booths, and free refills?", "author": "dave w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-16", "description": "used to go there all the time with friends.. not anymore... i still remember there games in the back.. i love their twists with ranch sauce.. hmmm... havent eaten that for a long time!!! guy bring me for a first date!!! PLS GUYS dont pick somewhere NICER!!!! =0", "author": "Lily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-17", "description": "You people don't appreciate that which is Round Table Pizza.  That shit is the bomb.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-04", "description": "I never write reviews but always use yelp for guidance in eating. I had to right this though. I decided to order a pizza b/c my friend was over and said there was deal.  We called and a very cold and unfriendly guy answered and responded sharply that there were no deals.  We called back and ordered anyway. They said it would be 45 mins to one hour (I thought that was long for pizza). After one hour, a different guy called and asked if I still wanted my order.  I said yes and hung up.  After thinking a minute, I thought that was weird and called back to ask what happened.  Our order was messed up. i asked for a discount and they said they would take a few dollars off.  They also needed the credit info again.  We were starving so we had no choice. We gave them the info and then checked the credit card webpage would showed that we were charged three times. We called to let them know. Our pizza arrived almost one hour and forty minutes later.  They did not give us a discount.  Pizza was good.  I saw the number to call if we were unhappy costumers. We called and talked to a computerized women who said to enter a number that was on the box to get a free coupon for an appetizer from the store we just ordered from.  Are you Krazy, Roundtable?  Screw that.  I WILL NOT BE ORDERING FROM HERE AGAIN!", "author": "Jacqueline B."}
