{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "The last honest pizza, Round Table is my favorite place to deliver - I love the old school move of just a little bit of cheddar in the cheese.  \n\nI dined in once though, and this has to be the saddest restaurant in the city, certainly in the Marina.  The place had two arcade games, one with an \"out of service\" sign on it and the other that ate my quarter, a huge Zenith tv from the early 90s with rabbit ears and no reception and a jukebox that had selections handwritten out and, you guessed it, ate my quarter.  My guy at the counter was insistent that I paid for the pizza before they served it and only accepted one card.  He also took a good 10 minutes to refill our pitcher of beer.  There may have been a language barrier issue.  That said, Round Table is the last honest pizza and I will continue to order takeout from this spot, much to the detriment of my BMI.", "author": "Robby W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-07", "description": "What a shitty ass staff lmao this place is a joke. Dirty ass restaurant. Got weirdos working here.", "author": "Briana F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "DON'T BUY HERE. Very bad experience/very unkind to me. Had ordered from them before, but could not get to the door fast enough this time and driver drove off. The woman on the phone screamed at me and really ruined my afternoon. Round Table was the pizza parlor of my childhood. Writing to the corporate head quarters.", "author": "susan h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Let me preface this review by saying this is the first negative Yelp review I have written. Every other review I have left has been to review a highly satisfied 5-star experience.\n\nRound Table changes this streak. My review in short: Do not eat here. Their pizza tastes like cold, burned, frozen cafeteria pizza.\n\nIn full: I was excited to discover a pizza place close to my apartment - but this will be the one and only time I pick up pizza from here. Upon picking up my large half cheese/ half green pepper pizza, I am told it is $23. $23!!! I thought there was surely a mistake, but sure enough, $23 for one large pizza. I almost left right then and there, but paid and brought my pizza home, expecting a nice meal for the (absurd) price I paid. I got home, and my pizza is cold. It wasn't even a little warm. There was one small sliver of green pepper on each slice. The crust was burned. Everything about it tasted like frozen pizza that is served cold and burned in a cafeteria. \n\nI will be calling the manager tomorrow - as a consumer, I truly felt taken advantage of. It is wrong to be charging these absurd prices for the terribly low quality food they serve.\n\nMy advice: get a Digarnio, or even a Safeway brand pizza instead. You will be much, much happier with the quality.", "author": "Ashley E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "Good lord, worst pizza ordering experience of my life. Put in an online order at 11:56 AM. Two hours go by, not a word, so I call the restaurant, no one answers. Call 5 more times in the course of the next hour, no one answers until just before 3pm, THREE HOURS after I put in my order. Very angry guy answers the phone, tells me he has no delivery crew, but he can make my pizza and I can come pick it up... what??\nNo apologies for a three hour delay, no offer for a discount or a coupon or even recognition that waiting for three hours to each lunch kinda sucks. Tried to ask him his name and he hung up in my face. Will def be writing a letter to corporate.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "Wow. A $32 pizza that came with paper plates; this Round Table is under an apartment building, so my internet died; I asked the owner and he told me they don't have wi fi. Like, really? He's aware of it. Coke and Sprite dispensers lacked CO2 (flat), the waiter knew it, yet the owner still sold me a soda with no warning or choice. We were the next-to-only ones there. It was dead; no business. Salad came with one tiny little cup of dressing. Pizza was delicious however, because it goes by franchise recipe. Other than that, I'll never return there.", "author": "Rudy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-25", "description": "I wouldn't recommend anyone going here. Maybe to watch tv and drink a beer but other than that save your money. The service is subpar and my pizza looked like a frozen pizza. Way to expensive for the quality of service and frozen looking pizza.", "author": "Paisley L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-11", "description": "I love Round Table pizza but this location is the worst. I ordered online and went to go pick it up 40 mins later and they hadn't even started it yet. I am sitting here while she makes it and she has no idea what she is doing. She asked me if I wanted white sauce, while holding the receipt that says red sauce. I am worried. Apparently this is normal for this location", "author": "Rosee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-27", "description": "Soooooooo, where do I begin.....\n\nI place an online order, get an email confirmation at 7:34pm saying my pizza will be delivered by 9:03pm (already eyerolling). \n\n9:15 rolls around, and I call. The guy answers, tries to find my order and can't (mild irritation now). Apparently I wasn't the only one today. So he says he can place the order over the phone, and I say sure. By this time. It's 9:30. \n\nHe gives me the price, and I have to tell him \"uhhhh I've already been billed.\" Them he says \"uhhh let me have you talk to my boss, because I'm not sure how to handle this. I appreciate that. But NOT the 5 minute hold I was placed on. \n\nI hang up, call back, and the \"manager\" answers. He apologizes and offers an upgrade to my pizza and some wings. By this time, it's about 9:40pm. He tells me 30 minutes, he's throwing it in the oven and sending it my way......\n\nHad to call an additional two times, and at 10:55pm, I received my pizza.\n\nWhooooooooooo in thee hell waits 3.5 hours for a pizza less than a mile from you?! \n\nAnd on top of it, it was WARM at best. \n\nI don't normally complain or post, but corporate is DEFINITELY getting an email from me. This was just unacceptable on any level of customer service.....", "author": "Wesley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "Terrible service!!! Will not pick up phone, so how does one order for delivery? The old guy (I assume the manager) is angry all the time. I have witnessed many disgruntled customers arguing with him. Don't bother to order by phone for delivery or pick up. Be there in person and wait. It is no wonder that the place is empty most of the time. If you must get Round Table, try the one on Geary.", "author": "Klaus W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-26", "description": "Below average pizza. The Marina offers much better options for better price points. Delarosa is so much better! \n\nI'd only go to Round Table as a last resort.", "author": "Shawn P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-02", "description": "Two stars because food was good (at least when you dine in which I did with my family)\n\nBut this should be one star (but had to give something for good food, great garlic bread) but it was very uncomfortable eating here. \n\nWe could hear the manager the whole time yelling and threatening a poor young kid doing what is probably his first job for minimum wage in the Marina. And yelling orders to him while the kid was taking our order. \n\n\"This is how you do it, don't let me catch you doing it wrong again or I'm going to charge you for the pizza and send you home\"\n\n\"Why are you talking? There's no talking while you're making a pizza\"\n\n\"This is your job. Do it right. It's simple. I can't say it any simpler\"\n\nWe're never coming back purely because of the rude owner. I bet he goes through employees like wildfire.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-03", "description": "I ordered a pizza online at 11 am with expected delivery time of 12:36. Got a call from them at 12:20 stating that they don't have a delivery guy so no pizza will be delivered.", "author": "vahid r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "Nice enough kids working. \nCan't really blame them as their seems to be zero management. Staff working at phone, keyboard, and then straight to preparing food. No gloves, no hand washing.\nYuck.", "author": "G W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Best pizza I had during my stay in SF! Don't let the young guys speaking Japanese put you off, this is an excellent place to get a good pizza!", "author": "Zach S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-21", "description": "These guys are incompetent and screw up orders almost every time. Best of luck to anyone who places an order", "author": "Brendan O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-15", "description": "Omg!!! \n\nI get we didn't order from a five star restaurant. But seriously, how difficult can pizza delivery be?\n\nDouble checking the customers phone number and address for your delivery is basic 101! \n\nAlmost two hours later... annoying.", "author": "Gaby D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-01", "description": "Seriously appalled at this experience. We waited almost 2 HOURS to get our pizza. When it finally came there were no napkins, parm cheese, or red pepper packets which we had requested. I swear to god the pizza had made then reheated and delivered to us. The cheese was all congealed like it was yesterday's pizza. The same pizza I ordered, I've had at a different locaion and this tasted NOTHING like it. It was horrible and bland. You can just tell they don't give a crap about the food they make, timliness, or customer service. I wish I didn't ignore all these reviews. Marina has SO MANY other pizza options, AVOID THIS PLACE. What a waste of $40.", "author": "Jane R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "Horrible service.  Walked in to order a pizza and employee said he was too busy to serve me for at least another 40 minutes.  Wouldn't even take my order standing there for 5 minutes. F you dude! walked out", "author": "Bob O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-04", "description": "It took 3 HOURS to arrive & I live within a mile from this location.  In addition to it taking 3 hours to be delivered, my order was completely incorrect.  I keep trying to give these guys a chance, but they drop the ball EVERY TIME!!!!!!!  I have no idea how this location is still open.  It is SO POORLY run I almost feel bad for the people working there.  There are too many other restaurants doing it better, give them your business instead.  This place sucks on every level.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "I have to say that I love the taste of Round Table pizza, but it's just not worth it anymore!!! They are extremely high-priced which has always been the case and the only way to get around that was with coupons.  However, they now say that they charge you the full price for your pizza until they review your coupons and decide whether or not to give you the coupon value (or not) as a credit.  And they only take coupons that they issue even though they don't send out coupons anymore...\n\nThis may be good tasting fast food pizza, but what does it cost you? $56 for a cheese pizza and one \"special\" pizza?  The coupon value was $20 less. It's just not worth it. \n\nThis branch has nickel and dimed its loyal customers out of wanting to eat their pizza at all. What a shame. It's the poorest customer service of anywhere we order food. \n\nI grew up eating pizza at this Round Table and have ordered from there for decades, but that breeds no loyalty on their end. It's all about the money for them and not about customers. What a disgrace! We will be searching for a new place to get pizza!!!", "author": "Anne B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "It's not like I eat at this place much but honestly I wonder how they stay in business. I went in there today to get some lunch. Absolutely no one in the place, except for two middle-aged guys having a soda (employees maybe?). I stood at the counter, no one there. No one anywhere in sight..what the hell? I get that business was slow. But not even having anyone available to take an order at lunchtime? If the two guys at the table WERE employees, why didn't they notice me walk in? Or notice me leaving? I'll find somewhere else to get lunch when I'm in that part of town from here on. Clearly, everyone else around there does.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "I just got a phone call from this manager of this restaurant on Sunday 6:10 pm oct 2,2016 he called to yell insults and racists comments to me in retaliation of me reporting for bad customer service ,delivery,and product.He told me he didn't want my kind ordering from this location even though this is my closest location told me we are thugs, told me to expect not to get a hot pizza if I order from there location told me to order from another pizza location this is what 2016 looks like for me all I wanted was three thing Hot ,delicious , and on time smh but I guess that's too much for my KIND!", "author": "Erin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "I ordered from here on Saturday. Ordered 2 Pizzas and was told 30-45 mins. 2 hours later it showed and only received 1 pizza. So i called to let them know, and the dude that answered the phone kept picking up then hanging up. So i continued to call, he finally picked up and not only was zero help and very rude, but he used language towards me that not anyone should use against people. I have never been treated like this in my life. DO NOT GO HERE", "author": "Bo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "Ordered pizza for pickup that said it would be ready at 648. At 649 they had not even started making the pizza. No apology from person at the counter.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-07", "description": "My friend and I used to have favorable opinion about this Round Table, especially the location. Everything may have changed after last night's visit and dealing with that clueless girl cashier. We ordered a King Arthur Supreme which this location, like almost all others, offer shrimp and anchovies as toppings upon request at no additional charge. This girl didn't understand that and kept wanting to charge us for the toppings. We weren't going along with that since that didn't happen before here. That girl (who we hadn't seen working there before) was just terrible. Another experience like that again and for sure we will never come back.", "author": "H K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-12", "description": "This place is by far the worst round table I have ever been to. It's by the water and all but don't let that fool you. I knew it had bad reviews before I came here but most talked about how bad delivery was. Since we were going to dine in, those reviews didn't concern me. So we arrived at the place, there is a parking lot across the street, so far so good.\n\nWe walked inside and it was a tiny little place and noticed quickly how dirty, smelly and outdated it was. There was nobody else in there besides these two guys and 3 other people. It was cold as heck and smelled like dirtiness. We ordered out food and sat down at a table. \n\nThe carpet was dirty and had stains. The tables were not wiped down and crumbs on the floor. Once our pizza got to our table it was hot but it was way too crispy for my taste. We didn't even order it crispy! The veggies seemed like there weren't cooked all the way which they weren't. This was one of those cases where I was hungry enough to eat my side of the pizza. \n\nAfter we finished eating we hanged about and saw this guy come in. He looked around all suspicious and walked over to the big screen tv and picked up the remotes. He looked at them and turned around and made eye contact with me and stuffed them in his pocket and walked out. Luckily one of the employes saw him and managed to get it back. But how ghetto can you get?! Wouldn't recommend this place at anytime of the day or night! Avoid at all costs!!!!!!!!!!!", "author": "Anne R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-27", "description": "Manager is Rude and decides his own hours of operation. I love the pizza don't get me wrong. Grew up on the flavor but after 8 years of ordering from here, the service is at an all time low. It disgusts me what this staple has become. I would wish my worst enemy on this place.", "author": "Dennis S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-24", "description": "Let me first say I've been ordering pizza from here for years as its a neighborhood place and its always been good - staff has been very friendly in the past - no problems until now.  \n\nWould give it ZERO stars for the WORST customer service ever.  Placed an order for pick up at 8:03pm Wednesday - arrived for at 8:30pm and was told they could not make the pizza as the pizza maker was not there!  Funny thing they were boxing up orders when I walked in. No phone call to let me know.  Sent email that evening.\n\nTalked to owner the next day  - he was the worst person I've dealt with in a long time - BS excuses.   Based on his attitude alone I will not be ordering from here for a very very long time which is sad because this was my go to place for pizza.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "Ordered a pizza two hours ago. The delivery guy called me and asked me for directions. I gave him directions. He continued to fail and the driver told me I know where round table was, so I could go pick it up. Rude so I canceled order. Call in and the person I spoke to continuously called me a mother fucker...", "author": "Charlie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "This Round Table location really gives the brand a bad name. I've loved round table since I was a kid and the poor service from this location is absolutely ridiculous. My pizza took over 2 and a half hours to be delivered and when the delivery boy actually got here he called me and said he couldn't find my building which is the easiest place to find on the block. I had to go down to the street to get my pizza, mind you he was parked right in front of my house so not really sure why he couldn't find it. He seemed super stoned, maybe that's why. I didn't feel as if I should've even paid for my food at that point. I will never order from here ever again. This place really needs to step their game up.", "author": "Natalie m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "Pizza was not even round with cheese and topping fallen to the sides. Crust tasted like raw dough. Do not visit.", "author": "Ameet R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-28", "description": "I am giving this location 1 star b/c I love RTP, but this location has repeatedly provided exceptionally poor service.  Most recently my food was never delivered due to the \"delivery driver disappearing!\"  When I contacted corporate I received an unprofessional email from the store owner.  And now I see the poor food safety score....", "author": "Alaina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-02", "description": "I ordered a pizza and some other stuff tonight at 7:03 PM. I called the order in. I was told the wait would be \"an hour to an hour and fifteen minutes.\" That was no problem so I said fine. I just called the location after one hour and 52 minutes and was told \"the location is busy and we only have one driver but the order should be on its way now.\" That is absolutely not an acceptable answer. I canceled the order. If I was told it would be 2 hours for delivery I wouldn't have placed the order. It's not ok to lie to customers about wait times just so they will place an order rather than ordering from somewhere else.", "author": "Adam P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-28", "description": "Very friendly atmosphere... And very poor service attitude... Environmental pollution is not clean...", "author": "Yadong T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "4 stars because it's a Round Table and I love Round Table in general.\n\n-1 star because I've seen it many times here when I picked up in store and experienced it myself when receiving delivery.\n\nMost Round Tables have a conveyor belt oven where you put the pizza on the belt and it slowly moves through the oven while cooking and pops out on the other end cooked to perfection. On numerous occasions, I've seen the delivery driver walk over to the oven and pull a pizza through before it was fully cooked so that he could get out on his delivery more quickly.\n\nPlease, for the love of fully cooked pizza, tell your employees to stop doing this. I've had numerous deliveries that were fine, but I could tell that they were slightly under done and I know it's because someone pulled it through the oven before it was finished.", "author": "max m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-11", "description": "No Stars!\n\nAbsolutely the worst customer service on the phone... Extremely rude and at the end of all that I was told that they don't accept credit cards over the phone, REALLY?? I can understand a check but the card gets accepted or declined right there and then. \n\nI guess they are not hurting for business. Waisted time... Never again... Act tack tack", "author": "Sandon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-26", "description": "Can't believe this restaurant stays open. Extremely rude employee/manager. Extremely rude to me and the customer that followed. Yelling and swearing. There's no reason anyone should take his abuse.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "If I could give them 0 stars I would. I love Round Table and probably have it way too much but I have no idea how this location is still in business. The owner is rude, the phone never gets answered and usually takes over an hr and half to get. I now order from the Vaness location and pay more for deliver.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-15", "description": "Danger danger! DO NOT ORDER DELIVERY...you have been warned! \n\nI live 5 mins away so you'd think bam Pizza delivery is no brainer if im stuck at the house. Now apparently the delivery driver doesn't start until 1pm. So if you think ordering a pizza at 11:30 is a good idea think again. Nothing will arrive for  1hr +.\n\nPizza was good though. No complaints there. I'd give review more stars if the hassle and frustration with delivery hadn't bothered me so much.", "author": "Jean Francois K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-16", "description": "Ok, I know this is a chain, so I wasn't expecting the best pizza, but I was expecting a solid Round Table pizza experience. I grew up with the nearest pizza joint being Round Table (RT) , so I know what a RT pizza should be like. I was craving the Italian Garlic Supreme and placed an order for delivery. First, it takes over an hour and they charge you $3 for delivery - while annoying, I think it's actually standard for a RT. And then the pizza came and here where my issues:\n\n1) I ordered a large, skinny crust. Based on my prior RT experience, this should come in a X-large pizza box - since the skinny crust is thinner, they typically make the pizza a bit larger. And I know this is standard, since you can't order a XL skinny crust - since it wouldn't fit in the XL box. But I got my pizza in a large box AND it was super tiny - I mean, the pizza should hit the ends of the box - this thing had a good few inches around it.\n2) I wanted my pizza well-done - I like a crispy crust. This thing was barely done. Talk about floppy pizza.\n3) They left the green onions off my pizza. Not the end of the world, but annoying since it's not like it was a special addition (this is part of the Italian Garlic Supreme).\n4) No parmesan or red pepper flakes were even offered.\n5) No coupons at this location. I'm chalking this up to being in SF and not suburbia, but still annoying.\n\nSo while I still love my RT Italian Garlic Supreme, this place just does not do it justice. I will just have to wait to have it when I go home and visit my parents back in Orange County.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-14", "description": "LIAR!  Owner said that he was going to refund my pizza on \"Monday\" because he was unable to process refunds on Saturday.  The refund has still not been processed.  He had taken over 2 hours to get my pizza delivered on a Saturday and I was 0.4 miles away.  When I went into the store the pizza was sitting there cold on top of the pizza oven.  He said \"How much do you want to give me for the pizza\" instead of just giving me a full refund.  I'm going to talk with Round Table Corporate and get this location revoked.  DO NOT GIVE THIS LOCATION BUSINESS UNLESS YOU WANT TO GET RIPPED OFF.", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-12", "description": "I should have read the reviews before ordering online. This has been one of the worst dining/take out experiences I've ever had. I wrote a long email to customer service which I've posted below. Please the few grammar mistakes as I wrote this all from my phone. \n\nLong story short, this place should be shut down and the owner should not be running a customer facing business. \n\nEmail body below-\n\nMy friend hosting a get-together lives two blocks away so we ended up heading over to round table around 8:00pm thinking that our pizza would be getting cold and arrived at the North Point location around 8:05pm. When we arrived, we asked for the order and were greeted by an employee stating that they were out of extra large skins, so our pizzas had not yet been started. This was confusing since this was already over 20 minutes past the time our pizza should have been ready. Our pizza had not even been started yet and I had no notification of the fact that our pizza had not even been started. \n\nUnsure of what we should do, we asked what my options were, but the employee was confused and unsure. She mentioned that the manager Najeem was supposed to make more extra large skins, but he had been out on deliveries.  I told the employee that we had 10 hungry guests waiting for the pizzas;  she said that the pizzas would be done in about 15 minutes. I asked if we could get a refund or some form of compensation, but she said that they would have to go through an online system to issue the refund - she did not actually offer to refund me my money until I asked if we would get a refund. She also said that they could stretch a large pizza skin and make it an extra large, but that just seemed like we would be receiving less pizza for the same amount of money so we decided that we would wait for extra large skins to be made. \n\nHer manager arrived shortly after and irritably asked us what we wanted. We calmly explained the situation and he responded that we had two options: we could wait for the pizza or we could cancel our order. At this point, it was already around 8:20pm, over an hour from when we ordered and over half an hour from when our pizza should have been ready. We were committed to bringing food home to our guests. The manager also said that the we were in the Marina district and that he had been out doing deliveries all night. He said that if we went to any other restaurant, we would be waiting in line for a long time. There was no line at round table - that is why my friends and I wanted something quick and easy. Even if there are lines at other restaurants, that should not affect my service at Round Table. That had nothing to do with our pizza. He was rude and condescending, saying that the longer we spent talking to him, the longer we would have to wait for our pizza. I've never been spoken to in this manner by a restaurant. \n\nWe ended up getting our pizza around 8:30pm. Our friends and I agreed that the pizza was salty, undercooked, disgusting, and poorly made. I am severely disappointed in the service and quality of food that I received from this Round Table location. Your slogan is \"The Last Honest Pizza: No corners cut. No compromises. No kidding.\" The pizzas we ate were compromised; corners were cut and the quality was a joke. I do not understand how this Round Table location is still in business with the quality of food and the way the manager treats his customers and his employees. If this is the way Round Table allows their franchise to run, I am recommending that all my friends never order from Round Table ever again.\n\n\nUpdate: the owner reached out. Below is his \"apology\". I appreciate that he reached out, but I don't think we will be going back. \n\nhello Mr ****,\nI apologize for any inconvenient we may have caused you,as you know it was the fleet weekend and we were busy,on line times\nare only an estimated times,some times it can take much longer or shorter,these timings are already set in the system,we do not\nguarantee pick up times,only if you call you will get more realistic time,it all depends how backed up we are,the number of employees available etc,the only reason you were asked if\nyou wanted to cancel your order so you can get a full refund,we do not issue refunds for the food that has already been consumed.\nIf you like we can give you half off on your next order(,this offer is valid till the end of the month)i.e Oct.,31st,2016.\nBest regards.\nNajim Khan.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-04", "description": "Whoa, this Round Table is ridiculous. The guy behind the counter is incredibly rude.\n\nBackstory: \nI bought some stuff at the Safeway across the street and went to meet my friends at Round Table. When I got there, I asked the guy for water. I forgot the exact response he gave me. but it's somewhere in the lines of \" Why didn't you buy it at Safeway.\" My friends already order the pizza, so that sucked.\n\nWhat is sad about this is i haven't had Round Table Pizza in over 14 years and wanted a taste of nostalgia, but there is good news. I did not eat here and never will. Hopefully when I try it, it would be as good as i remember it to be.\n\nThis rating is not reflective of the food.", "author": "John K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Several things here:\n\nEDIT: ADDING COMMENT AFTER EATING THE PIZZA: my girlfriend just pulled a 4 inch hair out of her slice. How could this possibly get any worse???\n\n1) we ordered a large thin crust pizza. We were given an extra large regular. The employee didn't consider that we might have wanted what we ordered and laughed handing us the wrong pizza saying \"sorry, the new guy made it\"\n\n2) I wanted to lighten up and play the arcade games while we waited but they laughed and said they only had a couple quarters on hand and couldn't spare 4 for a dollar. Not a big deal but demonstrates the lack of management. No retail location should run out of quarters on a Sunday at 3 pm. \n\n3) a girl with messy hair walked by the cashier who said, \"tie your hair back like you should\" and the girl with the hair said \"I'm not touching the pizza\" and did nothing. Where is management?\n\nI like round table so I want this place to stay, but I think everyone should be fired and the company needs to start from scratch.", "author": "Rob W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-09", "description": "We have been ordering Roundtable Pizza for years and always been loyal because the pizza is great. However, this is the worst Roundtable Franchise I've ever ordered from! We ordered delivery on a an early Sunday evening. We made a very simple request, sweet Polynesian sauce on the Maui Zaui and 2 sides of ranch. \n\nOur pizza was delivered to us and the delivery guy tried to argue with us that we did not order ranch and so he didn't bring any. Of course, they just forgot and they could not admit to the mistake. Additionally, we were told that they don't carry the Polynesian sauce for the Maui Zaui Pizza...really? All Roundtables have it and you don't? That's like going into a McDonald's and them telling you that they don't sell apple pie's at that location. Anyways, on top of these issues, the pizza wasn't cooked all the way through and was extremely soft.\n\nI'm not one to complain about much, especially with food, however I've had Roundtable 100 times in my life and this was by far a terrible experience. We will never again order from this location.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-22", "description": "This Round Table location has awful awful awful service. I ordered a pizza from them and was told it would take 45 minutes. I understand that's always an estimate, but after 1.5 hours and still no pizza, I called back and asked about the status of the order. The person who answered the phone was immediately defensive and told me the pizza would arrive in just a few minutes. When another 15 minutes passed by and I called back, I was told the delivery man had left 10 minutes ago and it would be a few minutes. I was very frustrated and this guy on the phone was neither apologetic nor nice. He started getting more and more defensive and ending up threatening to cancel my order.  I got frustrated myself and cussed the guy out. He deserved it! What a frustrating experience. \n\nFor most businesses, they know an apology goes a long way. I was offered zero apologies, zero explanations and literally nothing to make me feel better about having ordered from them. \n\nI would never order from these guys again. Their service is awful and they don't understand that the customer should be treated with a modicum of respect.", "author": "Dario A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Love the Italian Garlic Supreme! One of my regular places to get pizza. The guy who takes orders is really friendly and always throws in paper plates, plastic spoons and lots of paper towels whenever I order takeout,  so that I don't have to come home and worry about dishes.", "author": "Fatema M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-05", "description": "Well first time in here. Walking in I notice people in the back just talking wild pizzas are backing up in the oven. After waiting 5min I finally said hello! Excuse me! The lady that helped me apologized an said she was clocked out. Then turns around an screams someone's name and says pizzas are coming out hurry. Then 2 kids came out an start arguing because they can't figure out whose pizza it is. This kids are literally 14yrs old! This guys are just arguing and arguing. I front of customers! What is wrong with you guys. You guys really need to step up an start learning how to run a business this is one of the worst restaurants I've seen an so unprofessional.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-03", "description": "A story of Marina/Cow Hollow Round Table PIzzeria Franchise:\n\nI had being living in Japan for three months, and in Japan, they do not eat much cheese, so you can imagine the pizza. I had a desperate craving for some good, American style, greasy cheesy pizza.\n\nI emailed this Round Table to warn them that as soon as I got off the plane, I would drive straight from SFO to their branch to pick up a pizza (Italian Gourmet, though I'm sure the rest are also delicious). I got a nice email back from the Palestinian owner:\n\n\"dear Moritz,\nThank you for choosing Round Table as your first pizza after a three months break,We make the best pizza at North point Round Table,the available crusts are original,pan crust,and skinny crust.We recommend the original crust as the best .Please call us 15-20 minutes before picking up your order and we will have your order ready when you get here,the number to call is (415)563-1001 see you on Monday and you can look forward to eating the best pizza with lots of fresh cheese.\nNajim.\"\n\nNajim was completely right. The pizza was being made as I got there, and Najim and I had a pleasant conversation about life as it cooked. 10 minutes later, I was looking at a beautiful medium pizza, and I ate the whole thing. Few things in life are as satisfying as you predict them to be, but this pizza was an exception.\n\nSuper dank restaurant. Go there.", "author": "Will M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-19", "description": "This Yelp page is a broken record. DO NOT ORDER FROM THIS LOCATION! There are so many good pizza deliveries out there, please do not put yourself through this. You will not get your pizza on time if you get it at all. I unfortunately never got my pizza but was still charged. 20 days later, I still have not received my refund. To make matters worse, Round Table Corporate is either unable or unwilling to process my refund either. They put it on the franchise owner, who by looks of this Yelp page, either does not care about his business or is completely incompetent.", "author": "Christopher B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-30", "description": "Ordered a pizza for delivery:\n* 1hr. 20 minutes later I call them to check in, wait on hold for 5 mins, and they say it will be there any minute now...\n* 1hr and 40 mins in I called them again, waited on hold, and told them to cancel my order\n\nNever again.", "author": "Captain B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-16", "description": "I really love pizza, round table especially, but this round table is horrible. After being out on hold multiple times mid-order I finally got my order in. At the very end of the phone call I was made aware that the driver does not show up until noon, so I had over an hour to wait.  \n\nWhen the food arrived I dove into the garlic twists which were drier than the Mohave desert, and one actually had no garlic on it. I quickly moved on to the pizza hoping for better results only to get more of the same. Cold and old pizza that looks as if it had been cooked when I ordered than just say around.  Worst delivery/pizza combo in the city. Will be sticking to the likes of Hole in Wall pizza going forth.", "author": "Chase P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-06", "description": "AVOID THIS LOCATION AT ALL COST. Worst experience ordering pizza ever. I loved Round Table when I was growing up and haven't had it in years, and thought I would treat myself to a pie. It took over an hour and a half to get here, order showed up cold and wrong (with an item I am allergic to and I asked to leave off). When I called the store to fix the order, the guy who answered the phone (didn't get name, thick Indian accent) was extremely rude, unhelpful and kept hanging up on us. We called back a few times and finally he said he would charge our credit card (had the number from the original order) a $100 if we called again. I'm appalled that Round Table would abuse my financial information that way. I've since contacted corporate and awaiting a response as I believe this is illegal.", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-31", "description": "I don't eat pizza often, but on a night when I felt nostalgic for my favorite childhood pizza memories, I ordered online. An hour seems like a long time to wait; wasn't the industry standard ~30 minutes when we were kids? Fine, but an hour later the pizza showed up smothered in black olives (which I had requested they hold) and with a lack of extra sauce (which I requested). The light sauce I could have handled, but I find olives absolutely unedible. Now I was hungry and irked. The driver didn't know what to do so he called the manager who said they could have a new pizza there in an hour. I said no thanks, told them to just go ahead and cancel my order, and called Patxi's, which I guess I should have done in the first place. \n\nAll of the above was not a big deal until a few days later when I checked my bank records. Yup, they charged me. Seeing as how I never signed the credit card slip, I consider this pretty shady. Did they forge my signature in order to get the bank to pay it? When I called to ask about it, the phone just rang and rang but no one answered. So I called both my bank and Round Table corporate to try to get this fixed.\n\nSave yourself a huge headache. If you must have Round Table, order from a different location.", "author": "Brian T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "DONT ORDER FROM THEM!  Ordered pizza for delivery, paid over phone with credit card, an hour later get a call that delivery person knocked and left, and I was at fault.  I never left my place.  They had no way of contacting delivery person again.  Not sure why delivery person didn't call.  Seems like a scam business.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-21", "description": "I was in there for lunch (Sept 2013). The owner was busy making orders and looked over at me and said \"I can't help you when I'm making someone's pizza!\"\n\nI never said a word before or after that comment. I just stood there waiting until HE was ready to take my order and money. After he popped everything in the over, he walked over, took my order/cash and went back to making the food. \n\nThat's right, touched the computer (to input order), touched cash and the subsequent change and went back to making food. No food service gloves and no hand washing. If you ever think about ordering food from here, you may want to visualize his bare hands rubbing cash and then deeply kneading your pizza dough. Stock the pepto.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "On Saturday October 25th, 2014 I called to make an order. I've ordered pizza (Round Tables N. Point) from here plenty of times with no problem until today. I called to make an delivery order and a man (Najin Khan) answered.His name is Najin Khan. As I began telling him my order he instantly cut me off saying they don't deliver personal pizzas. I went on to tell him that's not all I am ordering. He wouldn't let me finish my order so that's when I told him he needs to let me finish my order. Then he said okay and I started telling him my order. Again in the midst of me telling him my order NAJIN KHAN cut me off by saying, \" Ya know I don't think I'm going to send my driver out there\". I exchanged a few words with him then hung up. I decided to call another local Round Tables (on Van Ness st) close by and they lady was really sweet and explained that they aren't able to deliver to me because it's out the way. I wish I would've gotten her name because she had really GREAT customer service skills :). After I hung up with her I called the first round tables back (North Point) and NAJIN KHAN instantly hung up the phone. I called back but this time on my job phone and he answered. The first thing I did was ask for his name. When I asked to speak to the manager he figured out it was me and said, \"I am the manager. I'm busy\" and hung up. I'm not sure if he's the manager or not but either way he doesn't need to talk to customers the way he does. I've never had any problem with any worker besides NAJIN KHAN. I will NEVER order or recommend anything/anybody else to that Round Tables again. I'll stick with Extreme Pizza, a pizzeria that actually knows how to treat their customers.\n\nRound Tables 1503 N. Point Street San Francisco, CA 94123\n\nI LOVE Round Tables but NOT this one.\n\nSMMFH!!!!!!!!", "author": "Jerkima P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "Holy moly... that was awkward. \n\nMy go-to is the vegi pizza at round table growing up. So last night I was with a group of friends and ordered a pizza to pick up because I was literally a couple blocks away from this Round Table. Never ordered from here before. So I did and I'm afraid to go back....\n\nIt was about 8pm and i walked in to pick up my pizza i ordered. As I walked in, I noticed there were no customers just the entire staff eating pizza and chatting on the table in front of the cashier desk. But when I walked in, everybody looked at me with weird stare as if they were thinking \"wtf are you doing here\" kind of look in their faces. I told them I ordered a pizza and no one got up until one of the guys sitting down told the lady wearing her Round Table pizza shirt that I ordered a pizza so get up. I really didn't know what to say, so I kind of let it roll. Everybody looked super stoned. And once everyone came back down to earth that another human was actually in their shop, they continued to chatter as if I wasn't there. The lady who gave me my pizza had no clue what she was doing because she was stoned out of her mind. I asked for napkins and peppers and plates, luckily she knew where they were. As she reached down she said something to her friend in a very sexual way, growled and shook her shoulders... at that moment I told myself \"WTF\".. I gotta get the F out of here. \n\nOn my way back to my friends place, I was thinking shoot we probably shouldn't eat this pizza. They looked like they had no clue what the F they were doing. They were super high and maybe they could of drop the cheese on the floor or ionno some gross bad service restaurant horror story kind of deal. \n\nThe funny thing is that the pizza ended up tasting just fine! HAHA! \n\nBut on a serious note, Don't go to this location. The people there are damn awful and still give me a freaky feeling just thinking about it. I know I won't, just trying to help out all the basic guys and chicks a trip from meeting these people. \n\nSeriously don't go here.", "author": "Ahmed C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "I realm love this place, very convenient location. The pizza are good and the people working there are very nice!", "author": "Fabien L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-13", "description": "Typically I think I would have to give this place  3 or four, just based on the pizza, which is yummy! \n\nBUT - It's not so yummy that I paid $27 for a large pizza that I picked-up last night! I was shocked when he told me the price, don't they know that you can order and have delivered from Pizza Hut for like $15! Not to mention the fact that I had told the guy when I placed my order that I had a 15% coupon, which of coarse wasn't honored... charged my card and made no attempt to back charge for the right amount - \n\nI NEVER order pizza and it's a rare specialty when I do. But, I am pretty sure I haven't been in a cave long enough for the price of a large pizza to cost me nearly $30. \n\n+1 Digiorno\n-10 Round table", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-04", "description": "Worst customer service I've ever experienced. Promised 20-40 minute delivery and then after an hour the dispatch said it was another 15-20 min away. Called again 15 min later and got the same thing - 15-20 min away! Their phone demeanor was as apathetic as the dmv. They could literally care less that we were pissed off about the service. After 1.5 hours for a medium 2-topping pizza the driver parked outside our apartment even after we told them to cancel the order due to long wait and poor service. Stay away.", "author": "Lea C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-01", "description": "First of all, Mr Man behind the counter, lighten up. When a customer jokingly asks you \"Howcome nobody is eating in here?\" you really dont need to threaten to give back his credit card because you dont want to give a refund after youve swiped it. \nAlso, you might want to ask the customer if they would like thier drink when the pizza is ready, or while they wait. Instead of TELLING THEM when you will bring the drinks because there's no free refills. I would have gladly paid for refills if you woulda just told me that. Now, on to the food. \n\nYou told me you make the best pizza in San Francisco. Um, no.  I recognized the pepperoni, and I believe those were mushrooms. But THAT was ground beef? They felt and looked like sausage with no flavor. Oh, and thanks for enough to cover two actual slices of the personal size pizza. \n\nAt least the cup was filled with Sprite. That was indeed what I ordered and it was nice and cold. Thank you for that. \n\nTo summarize, I was raised to say nothing if I dont have anything good to say, so in regards to your establishment...", "author": "Andy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-24", "description": "For some reason i love veggie pizza and the Guinevere's garden delight with pineapples hits the spot. What however doesn't bring me joy is the following\n\n-Saying my delivery will arrive in 25 minutes then taking an hour and by that point my food is cold when i live a 5 min drive away\n-Ordering ranch sauce and paying for it then it not being in my pizza box\n-Being put on hold for 10 minutes the second i call then needing to call back twice more and talking to people who sound like they want to strangle someone\n-Charging me a delivery fee then asking how much tip i'm adding then barking at me if it isn't 20+% after charging me a delivery fee. pay the driver, don't keep it for yourself and force me to pay more \n-it adds up so quickly, somehow i end up paying $25 for a medium veggie pizza!\n\nThe pizza itself is actually pretty good when comparing it to other round tables. That being said since i only order for delivery and the service is horrible and they usually mess up my order, i can't give it  more stars.", "author": "sasha h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-21", "description": "STAY AWAY from THIS particular Round Table Location!!!\n\nI have LOVED round table pizza since I was a kid but this location has repeatedly killed my joy for RT. \n\nThe place itself is dingy, dirty and an absolute Mess anytime you walk in.  The staff is NOT well trained and because of that, they constantly screw up orders and ingredients.  \n\nWhy have I gone back so many times over the years you ask?...   Cause I have and do genuinely like RT pizza and really keep hoping the franchise owner of this location will eventually fix things but he NEVER HAS.  \n\nDo yourself a favor and either order from the Van Ness or Geary locations as they are by far better in every angle.", "author": "A R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "This place has the worst customer service of any roundtables I have ever been too. Do not ever try and have delivery ordered. Coming from a person who loves their product.", "author": "Michael V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Ordered Pizza from here because I was quoted a 3 hour (????) delivery time from Pizza Hut. First time ordering from RoundTable and from this location. Was a bit apprehensive at first because of the other reviews but decided to give it a shot. Glad I did, Pizza was really good, came on time (was quoted an hour and delivery was on time), no complaints. Thank you Roundtable pizza people! Will be ordering from here again.", "author": "hanzal M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-29", "description": "THE OWNER HERE IS THE RUDEST MAN I'VE EVER COME INTO CONTACT WITH. i WILL NEVER GIVE HIM MY BUSINESS AGAIN. I RECOMMEND GOING TO A DIFFERENT ROUND TABLE OR NOT GOING TO ROUND TABLE AT ALL. We ordered a pizza for delivery with an estimated time of an hour to an hour and a half.  After 2 hours we called and told it was on its way at 2 and a half hours were told that it could not be delivered. At this time it was too late in the evening to order anything else. We asked if we could receive a new pizza free of charge if we pick it up because of the problems over the last 3 hours.  His customer service oriented employees were very helpful and the manager on duty agreed.  After 3 days the charge was still on my credit card. When I called someone agreed to take off the charge, a couple days later it still hadn't been removed.I called a second time with the same response but no charge removed. Two days later I called again and left my name and number  (for a third time) for someone to call me back.  I finally received a call from the owner who immediately screamed at me that I would not receive a refund, that I was stealing from him, he thinks I''m lying.  This continued for 3 phone calls which each time he hung up on me. Mind you I did not raise my voice once, I was not allowed to explain the situation in full detail. I don't know how he retains such friendly employees. I can only imagine how he treats his employees if he treats his customers this way.", "author": "Melinda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-27", "description": "I've enjoyed Round Table over the years, but this place is notso hotso.\n\nI brought a hankering for the Chicken Garlic Supreme when I moved up to the city. It's usually pretty tasty, but this place serves it a little cold, which is not great.\n\nSome real annoyances with delivery. It's super super slow and they charge a $3 fee.  OK, so that's the tip? I guess. Not really sure. If round table is keep that, then why? What's the deal? If they are giving it to the drivers, I'd rather just give them cash (I usually top more anyway). Annoying.\n\nAlso, tried to use the Yelp special tonight, but they gave a lame cop-out \"Umm we don't do that on delivery.\" Why not? You are charging me for the freaking delivery, so what's the difference in charging me the same as someone who lives next door and walks over to get it?\n\nIs anyone else getting tired of all the extra crap being stuck onto the bills in San Francisco?!?! Why is it that when something says $17, we can't just pay that and instead it somehow comes out to $23, $25 or whatever. WTF.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-02", "description": "Ordered a pizza online and when I called two hours later to find out where the pizza was I was told that it had not been made yet and would be another hour minimum.  The worst part about it was that I paid online and they never refunded the order.", "author": "Ted H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "How did I ever wound up here? In the Marina with all the yuppies in nether region of Cow Hollow?\n\nWell, it was one of those creepy Yelp event that Ed to the M. set up. He told everyone to meet at the Hot spot hook up place we like to call ...Safeway supermarket. Unfortunately, I didn't get the message that the meeting place was changed.\n\nMy buddy and I waited for so long. It was even worse than feeling like you were getting stood up on a date. So we decided to walk across the street to Round Table to grab something to eat before we go.\n\nThe place was actually pretty nice in terms of a tavern kind of look. It had that \"Cheers\" kind of look where you can look out from the window where people were walking by. (the street was dark and not too many people were passing thru). The service here was also very friendly as the guy did checked up on us to make sure we got everything we ordered.\n\nIt didn't take us long to chow down on slices of their version of deluxe pizza with everything on it. I liked the fact that the place was quiet and very unassuming. Even though there was a TV on at the time showing Nascar, it still gave me and my buddy a chance to catch on stuffs.\n\nOf course, we were also hatching a plan to get even with Ed to the M. But the \"Goth\" night he set up was more interesting. I think was more in to the bar hopping adventures.\n\nThe $6 meal I got with a slice of pizza and drink was not very memorable, but the setting of the place did set us at ease and at the right mood for the night.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-22", "description": "The location on van ness is much better. My friends and I frequently order the Cambo Wambo and this location leaves off the bacon. That's the best part of this pizza! There are a couple pieces of Bacon on this whole pizza, not worth $30!!\n\nFor $30 a pizza better be damn good, this however is not. And it always arrives via delivery all soft because it has been sitting in the delivery bag. I need to remember not to order from this location in the future. Plus they charge for delivery!!", "author": "sierra s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "Round Table Pizza - 5 Stars. But DO NOT order for delivery. I live less than 5 blocks away both times we tried the pizza showed up over an hour late. Someone please buy this place, manage it correctly, and make it a real round table. The decor is shit but that's fine - its a pizza joint. Get some nostalgic games and cheap beer and the marina crowd will flock (myself included) .", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-19", "description": "I ordered a pizza here because we got hungry after a long day of video games and chatting.\n\nI yelped Marina to find a nearby place that delivers but I guess Round Tables is our best option at 9:00 PM.\n\nWe decided to do the special listed on the Yelp page. $17 for a large pizza. We added mushrooms, bacon, and pepperoni. Nothing special, we were just hungry as hell.\n\nWe called the place and was connected immediately by a grumpy employee. He took down our address and then put me on hold for ten minutes. Ten minutes later, we gave him our order and had to wait another ten for pur confirmation. He told us our pizza will be there by 10:30. An hour and a half times wait....\n\nWhen we finally got our pizza, iy was still hot. That's good. It tasted like any other greasy fast food pizza. The bacon was burnt to bits and fell off the slices but it was pretty okay.\n\nthey also forgot to give us any parm cheese or pepper or anything like that.\n\nOverall, it took too lomg, both ordering and delivery. The pizza was average, could be better. And they could have at least thrown in a packet of parm or two. I reccomrnd you just go in and order, save the delivery boy the trip and cut out all that waiting time for just a pizza.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-08", "description": "My friend recently got hired here and the manager there is a complete a-hole. Then I seen him for myself when I went to order pizza, I was like oh hell no, no return to this joint. This place needs to be run by someone else. Some other people say he is racist, I strongly agree with them. Stay away from this round table unless you want to eat at a racist place.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-23", "description": "This is pretty much the worst Round Table I've ever been to in my life. They keep it consistent enough to keep the brand but the owner is a jerk and the place itself is a hole.\n\nI only eat here because I work nearby.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-18", "description": "I wish I could give this place a zero!!!! Round table is round table but this particular one is owned by a single jacka$$!!! He is RUDE, Racist, and does not know the meaning of customer service!! People like the owner give round table a BAD name! Don't support this guys pockets eat somewhere else!!", "author": "Alexis S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-04", "description": "Never order from this location. Worst customer service I have ever experienced.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "We ordered a Pizza at 4pm via RoundTable website. Showed up at 5pm and door was open and it said Open and there were no employees. We waited 10 mins. and yelled hello over and over and not a single employee answered. There were no other patrons present but the door was open and sign on. We left and got pizza at another store. What a waste of our time and no we have to get a refund on our VISA card. I wouldn't shop for pizza at this store. I think it went out of business.", "author": "John D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-04", "description": "Imma stop ordering from here. They are always busy and i called today to be left on hold for about 4mins.. where the hell is the customer service. The chick who answers the phone gotta a bitchy attitude so i took my business to north beach pizza.", "author": "Tareau B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "Not bad.  I like that it's never very crowded.  The pizza is good, but not amazing.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "* Note that this is a review from Sunday  09/05/10\n\nAs a kid I have always loved Round Table Pizza. Until I went to one in L.A. that made me vow never to go back again.\n\nI was visiting a friend in the apartments right behind the Marina Safeway and decided that we needed to go out for the night since I was in town.  But we needed to eat before hand. My friend recommended that we go downstairs to get a pizza from Round Table and I told her no and why. She assured me that this Round Table is not like others and that I would definitely love this pizza.\n\nSo after I agreed we ordered a Backyard BBQ Chicken ( I think was the name ) and we wanted. When we got the pizza it looked and smelled great. There was lots of cheese and toppings on it ( not skimping on the meat like other places ).  When I took a bite my love for Round Table Pizza was back. I am happy again :-) Not forgetting to mention that the service was also great.\n\nI will definitely be coming back soon. This is the spot to go to eat before we go out now.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-16", "description": "I have always loved Round Table Pizza and when I recently moved to the Marina in SF, discovered one in my neighborhood. \nMy first visit there was horrible.  I ordered online for pickup and when I got there at the estimated pick up time, they had no record of my order. I showed them my email confirmation and after searching the area, discovered someone had printed the ticket and then just put it under something else without making my order. They had to make my order while I waited, and didn't even offer an apology.\n\nAgainst my better judgment, I went back again. I have had a handful of negative experiences since but here is the one that TAKES THE CAKE.\nMy boyfriend and I ordered online for delivery. He paid online with his credit card and received an order confirmation for estimated delivery in 75 minutes. After about 90 minutes, we called the restaurant to check the status. A man who we could barely understand informed us that they were very busy and had not even started our order.  He asked if we wanted to pick up or have it delivered an hour later.  Not wanting to wait ANOTHER hour, we said we would pick up.  He hung up on us.\nWhen we got to the restaurant 15 minutes later, the same man was eating behind the counter and there was not a single customer to be seen (even though he had told us they were \"very busy\"). We inquired about our pizza and said we came to pick up and he again tells us that he hasn't started it.  We ask when it will be ready, he told us he had no record of our order and would not be making it. We showed him our email confirmation and he replied that the charge never went through so he would only make us the pizza if we paid again.  My boyfriend showed BOTH his email confirmation with the credit card charge AND logged into his credit card online to show the pending charge and the guy still refused and kept saying \"you didn't pay so I am not making your pizza.\" At this point I was MAD. After 15 more minutes of refusing to leave until we either received a refund or our pizza, he finally reluctantly and rudely made our pizza. The charge DID go through and my boyfriend sent an email to the owner of the store who is frankly just as rude (if not ruder) than his employees.\n\nAnd then after all of this, one day my boyfriend decides to try ONE MORE TIME to eat there. This time (to avoid online order mishaps), he walked in to order in-person. The same guy was working as the time before and immediately said to my boyfriend, \"why are you here? You complained about me to my boss. You should leave.\" My boyfriend asked, \"are you telling me you refuse to serve me?\" To which he replied again, \"why are you here? Why did you complain about me? You should leave.\" So he left and we will never ever go back there. \n\nThis location is horribly run and I honestly don't know how they are still in business. I am not surprised to see all of the other negative reviews.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-23", "description": "Round Table is my hands-down favorite pizza of all time. Even though its a chain, its delicious. With all the nouveaux pizza chains all over the place, its hard to say if this is better than Little Star or Delphina- they cannot be compared because they are all so different now. \n\nThe lack of stars is because this is the WORST location I have ever experienced. I gave the place a few chances because I love the pizza so much, but we are now at the point where I refuse to buy their pizza because of service. We are boycotting them and so are our friends. \n\nThe first time we were told the pizza would come within an hour (we like to hear 30 minutes when we only live six blocks away, but we like the pizza enough to wait an hour- pickup not an option this time). The pizza was not there in an hour and the girl on the phone felt compelled to lie and say it was on the road. 20 minutes later.. no pie. I won't make this long- but to recap it took five calls and four lies, and a hang up from them. The pizza was not made and neither was an attempt at making this right. In total this took 2.5 hours to handle, all while starving to death.  Stupid us for trying again.  This is beyond uncomfortable when one has guests over, waiting.  \n\nPicking up from them is never any fun- they lack personality and frankly, the place looks shabby and unkempt. Its depressing to say the least. \n\nThe last time we ordered here is seriously, the LAST TIME. I do not even want to go into detail because I am getting worked up again. They are by far the worst place to get pizza, or any kind of service for that matter. Maybe I will elaborate in a month or so.\n\nGo with a local spot instead- I have found Dino's pizza on Fillmore to be delightful (they make clam pizza with red sauce) and they only charge a $1 to deliver. Their prices are 1/3rd the cost of a RT pizza so its worth it.  Delarosa is also amazing (they have truffle oil).  \n\nLast note to RT - Do you notice that your stupid sandwich board is flattened sometimes? That is me.  I get real joy out of knocking it down every time I walk by.  You guys are real jerks.", "author": "Kathleen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "I know this won't earn me any cool points but I have to stick up for round table. The pizza here is great. And I realize the latest trend is all about THE artisanal, fancy pants pizza joint, which seem to pop up on every corner. Honestly, it's getting tough to distinguish one from another in both taste and style. I have found that, in an effort to be more like the east coast, we have lost our ability to make room for a different kind of yummy pizza, one that is truly set apart from the rest. It has filled our little league bellies on the west coast since I can remember. And while I adore and support the evolution of the new style of pizza 100%, I don't believe round table should be compared. Simply put, it is and always has been a different breed of Za. The brand is not going for ambience, but it has managed to stay true to both its identity and core competency for decades. If you like a good sauce with some character and kick, this is the spot. \n\nFurther, the level of delivery service here is stellar. The man on phone taking my order was surprisingly professional and thoughtful. I didn't feel rushed whatsoever. When I asked for basil he said, \"Sorry, we don't have basil ... I know it has less flavor but if you want a little extra iron, I can put spinach on it for you\".  It's the little things that make a big difference, especially in a city where taking the time for positive human interaction is a rarity. And I wouldn't be writing this if I didn't think the pizza was damn good too. I can't speak to the in-restaurant experience, but I can always count on RT for good take out / delivery.", "author": "Paige H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-14", "description": "The only place I can order pizza and get it within a reasonable amount of time. Quality is pretty good for the price. ALTHOUGH, I gotta tell you....the lady that works behind the counter usually on Friday evenings has such a horrible attitude. My boyfriend and I purposely go in there to pick up our order and say \"Hi...how's your night going??\" and we just wait for her to TOTALLY ignore us. If I could write to the corporate headquarters and complain about how bad her attitude is, I would. She just has no nice in her whatsever. Ugggh.", "author": "DayDay D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-01", "description": "Sunday, November 30, 2008 - approximately 2:30pm\n\nAttending an event at Fort Mason, Round Table was the only restaurant around within walking distance.\n\nWe ordered an Italian Garlic Supreme.\n\nA medium to large sized Asian woman, hair pulled back to a bun, was working the counter.  When we arrived, she was on a personal phone call.  After a few minutes, she finally hung up (without saying goodbye) on whoever she was talking to.  NO courtesy from her.  Not even, \"Sorry for the wait.\"  She gave us this stoic, \"What do you want?\" look.  It's as if she didn't want us there, but we needed to eat SOMETHING.  No customary thank you's, etc.  \"Your drink's at the bar,\" she uncaringly told us.\n\nHer rude attitude continued, making average food taste worse.\n\nThere were two other tables she had to serve.  There were two elderly women, where she barely dropped off their orders, then quickly walking away.  The same thing with 4 guys at THEIR table.\n\nConclusion?  An equal opportunity f***ing c*nt.  This woman needs to work somewhere, where she doesn't have to work with people.  Hopefully she's the owner's relative or lover.  Or does he (or she) know that this woman is emitting the nature of unpleasant flavors?  Next time, we'll just grab up something from Safeway.\n\nCalling in today, we found that it has a name.  Its name is Anabelle, and she's a manager there.  OMFG!  Somebody put this thing out of her misery.  She is obviously not happy with her life.", "author": "D. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "Food: \nI tried the King Arthur's Supreme pizza. It was tasty with so many toppings. I don't like my pizza too dry, and this one definitely wasn't even though there wasn't quite as much sauce on it as I like. I did end up adding some red pepper to my pizza. As it is hard to find good pizza in SF, this one was definitely ok and filled my cravings. \n\nAtmosphere: \nI walked in and ordered take out so didn't spend too much time inside this place. There were very few other customers inside.\n\nService:\nService was ok. They quickly took my order and told me it would be ready in 20 minutes and I got my order quickly. \n\nValue:\nIt was around $19 or so for the medium pizza which is normal for SF prices. \n\nOverall I feel that this place was ok to grab a pizza. It doesn't have the most exciting atmosphere inside that makes you want to linger with beer, pizza and friends. Instead I would opt for take out again.", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-02", "description": "Great Pizza place !!! WOW One Of the Best Round Table In San Francisco !!! AS GOOD AS IT GEt'S !!! Fast Delivery !!!", "author": "Boris M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-07", "description": "We ordered the supreme here and garlic twists over the weekend - it arrived within 30 minutes which isnt bad; however whoever made the pizza didnt really do a good job: it was quite dry and cut SO unevenly! The twists were also pretty small and not as big and fluffy as other locations. We also didnt get any cheese/peppers/napkins!\n\nI think we'll probably order from another location next time around.", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "This RT is much better than the Van Ness location- service is better and food tastes better. Mmmmm, large cheese pizza- with extra sauce and extra cheese.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-20", "description": "Everytime I visit California, I make sure to go to round table at least once.\n\nLast time I was in the state for only 3 days, and I had dinner at round table 2 of the 3 nights!!\n\nI don't know what it is...the crust is crunchy and soft at the same time, there's just enough cheese, not too much sauce..sigh its amazing.\n\nwhen i used to eat meat, their meat pizza was awesome - but the last time i went i had their veggie pizza - and it is equally good.\n\ni love it - and not delivery..i like sitting there and eating it..it reminds me of simpler times  - i dunno\n\ni love you round table, i wish you were in the east coast.", "author": "Jasmin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-13", "description": "shitty pizza. in the vein of papa johns or cicis.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "This is for delivery, as if i am going to a pizza place i will head to little star or north beach pizza.... \n\nIn general, i am a fan of round table.  Their topping combinations are unique and they have some truly good specialty pizzas.  the only gripe i have is that i always feel like i am paying too much.  But then again, the times that i order from them are when i have had about 20 north beach pizzas in a row and need something different. so price is not always the deciding factor....", "author": "Robert R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-13", "description": "Oh Round Table. You please me ever so easily with your decent tasting pizza. I used to come to you with pure excitement at the thought of getting an extra larger meat lovers (LOL Meat Lover) pizza. That is, until I learned that there was something out there for me in the realm of better pizza.\n\nI don't know how to say this, but I have been cheating on you with other pizzas...Nizarios, Extreme, even Orgasmica. But there will always be a special place for you at the bottom of my heart, in the back of my brain, deep in my intestine....I love you, you and you endless refills of coke.", "author": "James J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-26", "description": "Delivery is fast... Service is excellent...  This is my favorite Round Table location, the pizza everywhere else is sub-par compared to this place!", "author": "Sheldon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "I did grow up going to Round Table such as many of us native Californian's. I have spent evenings at The Table after t-ball games having an amazing time drinking pitchers of Dr. Pepper and Root Beer. \n\nSo I am sorry fellow Yelpers' what do you expect from Round Table? \n\nIt's greasy, amazing tasting, dirty, has an arcade and serves beer. This is no A16 but that's why you chose the R Table. Maybe you had a long day drinking at Mascone field and want to stuff yourself or even were on Chestnut or Union with all the prep's and need to get away. Maybe you are watching a little football with all your douche bag roomies who went out the night before hoping to \"score\" after the big \"game\" but ended up puking in their sink. \n\n Just go, eat great bread sticks, drink, have fun and relax because it's ROUND TABLE.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "It's really hard to hate on Round Table. If you don't know what I'm talking about, I don't blame, because on the surface it seems like it would be like any other chain pie. Shit, I was in Dubai a couple of weeks ago and they had three or four of them there. Generally not a good sign.\n\nBut a King Arthur's Supreme is the best chain pizza, and honestly, better than most crap that passes for gourmet pizza.\n\nThe location leaves something to be desired ( too many flies,) but you're going there for pizza not for picturesque-ness, right?", "author": "Jason R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-22", "description": "Dear Round Table,\n\nPeople have all kinds of attitude about you, and I have no idea why.   Is it because of your modesty?  \"Last honest pizza\"  is not exactly flashy but yes....yes you are.  Your crust is the perfect thickness and only time in a hearth oven could make those lovely crust bubbles. Your sauce is super tasty and even a little spicy, and you avoid that pitfall of pizzerias everywhere: the congealed cheesy mess.  Round Table, you're perfect in every way.\n\nMuch love,\nAn appreciative customer", "author": "Tammy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "Busted up arcade video games.\nTerrible service.\nMoth balls a plenty. \nSticky booths.\nPizza sauce outta the tube.\nFat old men downing pints at high noon.\nIck.\nIck.\nIck.\n\nGo to Piccolo in the Tenderloin. \n\nRound Table is so good at being bad I gave them 5.", "author": "Dandy O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-30", "description": "The only reason that I give this place one star is because the pizza is great. Thier Garden Delight veggie pizza is second to none. \nHowever!!!\nThe service at this location is unbeleivable. I mean i really do not understand how this place is open! I've done pick up because for some reason when you call they tell you delivery is not an option? They don't have many things on the menu.....\nI'm sorry aren't you a franchise... you are supposed to operate the same way every roundtable does? They are never open during the times they say they are open, and when I do go in, the counter people act like you are bothering them?\nAren't you in a service based industry that relies of people coming in and paying money to get a quality product?\n\nI often call the Van Ness location, they can always deliver and often in under 1/2 hour.", "author": "Sylvia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "I love their Gourmet Veggie pizza with the white sauce. It is expensive if you compare with Pizza Hut. But you get what you pay for.", "author": "Vibrant J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-20", "description": "I ordered a medium Chicken & Garlic Gourmet pizza from Round Table next to the Marina Safeway on Friday  (for two of course) - by Sunday I was craving a second pie - all for myself.    \n\nThis ol staple, some of you may recall from growing up in the 80's suburbs style.  No joke I am adding Round Table to my speed dial and retiring Pizza Orgasmica ...\n\nWhat's the nutritional value you might ask?  Why it's pizza after all.  Protein outweighs the fat - I'm there! \n\nServing Size: 109 g (1 slice)\nServings Per Container: 12 \n\n--------------------------------------------------------------------------------\n \nAmount per Serving                      \nCalories 240 Calories from Fat 80\n--------------------------------------------------------------------------------\n \n%  Daily Value\n \nTotal Fat 9g 14%\nTrans Fat 0g  \nSodium 580mg 24%\nTotal Carbohydrates25g 8%\nDietary Fiber 1g 5%\nSugars 2g  \nProtein 13g", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-02", "description": "I love Round Table Pizza, but the woman that works there is the most miserable human being I've ever come across. She works in customer service yet has no clue how treat HER CUSTOMERS! She may even find that being nice is easier than being such a rude bitch. I don't understand how management can continue to let someone like that run their business despite numerous complaints directly to Round Table Corporate.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-25", "description": "I have been a patron of the marina Round Table for many years.  This particular restaurant sets a standard for restaurant hygiene; it's employees are always washing their hands after handling money, peperoni, or anything non-food related.  The employees are the hardest working, most friendly and willing to please of any food establishment I've ever frequented.  All the ingredients are the freshest and the final product is incomparable to any pizza in the neighborhood.  My daily diet generally consists of brown rice, vegetables and chicken or tofu but I can't seem to get away from enjoying a personal pizza at least twice a week.  If you don't believe me, try it.  You too will be hooked.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-15", "description": "How is your portfolio? Strong to moderately strong? I hope so. Because you need to be financially secure to buy pizza from these guys. Two pizzas, $60??!! WTF!\nF that. Plus you get my order wrong? You guys suck. Don't tell me that you \"changed your Maui Zaui to have regular tomato sauce because everyone complained that the Polynesian sauce was gross and asked for regular instead.\" Dude, tell me that before the shit gets to my house. Don't assume that I blow tons of cash on your food all the time and study your marketing environments. I wouldn't order a specialty pizza that is double the price of a normal pizza, just to have you put normal shit on it. Plus your pizza isn't even that good. Then again I guess there are those loyal few Round Table devotees who regularly order from you. Like my Dad, he loves it, buys it all the time. Then again, he does have a secret method for picking a winning Lotto ticket 80% of the time...\n\nExtra star for your Italian Garlic Supreme (still a rip-off).", "author": "Ben R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-21", "description": "Go to the Round Table on Van Ness - they are much more professional, with better customer service, and they can actually keep their ingredients in stock.  I never actually was able to order from these guys because they didn't have the ingredients necessary to make their signature Chicken and Garlic pizza (namely chicken).  \n\nBeing able to keep your ingredients in stock should be the minimum a pizza place can do.", "author": "Jimmy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-16", "description": "I order a medium King Arthur Supreme Pizza.... I must say that the pizza was freaking small.  I don't know if it is just this Round Table Pizza but when I order round table pizza in pinole their medium size isn't this small. Round table pizza is better then pizza hut or domino's. I like the taste but spending 30 dollars for an 8 slice medium pizza and 6 garlic twist is a little too much.", "author": "R. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "So after vowing to never again order from the RTP on Geary, but needing a comfort food fix, I decided to branch out.\nI was nervous.  I was on edge.  And I still had to wait almost an hour.  Would it be cold when it arrived?  WOULD it arrive?  I had no way of knowing.  After the 45 minute mark passed, I started to worry.  I paced a little, went to the bathroom.  Were they ever coming?!\nThe bell rang and I ran down, completely ready to send his slow butt packing if my pizza was cold.  It was warm!  There was steam coming off of it when I opened the box and as I ate it!  I tipped him ridiculously well I was so excited!\nSomeone please explain to me how the RTP that is a mile and a half from my house can show up after an hour with a cold pie, and the one that's two miles away shows up (grrr, after an hour) with a nice warm one?  Maybe this delivery driver keeps them on his engine block while he drives that extra half mile.\np.s. I stupidly ordered a large because I was wallowing and then ate four pieces and wanted to die.  So if anyone wants pizza, just let me know (veggies need not apply - this has meat all over it)!!  Round Table makes the best leftover cold pizza around.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "This was my first foray into Round Table Pizza. I was skeptical because it's a chain with some pretty annoying commercials, but it looks like a pizza place should. It's not cheap either, another clue that the pie might actually be decent. I mean, really, yeast, water, flour, tomato sauce & mozzarella...how much could you charge for that? You just know they're using something tasty if they are charging you double what  every other place is charging. I can't say it's my favorite pizza in town, or even in the top 5, but iffin I find myself way out this way by the Marina Green & have a hankerin for some pizza pie I'd meander back in.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-23", "description": "This Pizza is good.  I know its a chain but it is always a solid pie.  Pizza Hut and Dominoes are both garbage but Round Table is some probally the best pizza offered in the Marina area in my opinion.  Always a delight to have Round Table Pizza.", "author": "Harry E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-28", "description": "Call me trashy, but I am always down for Round Table compared to other pizza resturaunts in the neighborhood.  Probably a weird carry over from my childhood after-soccer pizza parties.  Although, it does seem expensive when compared to other chain pizza resturaunts.", "author": "Jennie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-23", "description": "Standard pizza.  Nothing exotic.  Fast service, great for late night hunger.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-20", "description": "Huge fan of Round Table Pizza.  They are always consistent and the pizzas just taste great!  Its even great the next day!", "author": "shaun l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "ok if you are dying for pizza and it is the only place around, but there is better pizza out there. Most of the time the pizza is too greasy for my friends and i. But the spices are there and the service is adequate.", "author": "Karen O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-17", "description": "We had the absolute worst pizza delivery experience with this Round Table Pizza. We ordered at around 6pm on a Sunday evening, and were told the standard delivery time of around one hour. It was also raining that night, so we did expect that the delivery would take a while and that was completely fine. Once an hour and a half had passed, we called to check in on our pizza. We were told that the pizza should have already arrived, and that the delivery driver was looking for the house. Thirty minutes later, the pizza still hadn't arrived and so we called again. It was at this point, a full two hours after ordering, that the Round Table Pizza employee became agitated and rude. We expected to receive an order within a reasonable manner of time, and when it became apparent that that would not be the case, expected that the Round Table employee would be able to calmly explain the situation. No apology was ever issued, and instead the employee got continuously more rude and disrespectful. By the time the pizza finally arrived, more than three hours had gone by. We were given a discount on the order, and we tipped the delivery driver generously especially given that it had taken over three hours to receive.  We were willing to give this store another chance given that it is consistent pizza, only to find out that our address was blocked from receiving delivery after the previous issue. Considering that we were the ones that received rude, abysmal service, it is completely ludicrous that we were then blocked from receiving delivery.   The fact that a store can stay in business while treating its customers this way is really quite disturbing.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-12", "description": "slow counter, confused staff and mehh, avg pizzas!", "author": "Gautam C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-29", "description": "My wife and I have ordered here a few times.  Delivery has always been slow (~ 1 hour), but not awfully slow until our last order.  Two hours later we received our lukewarm pizza.  This is after calling in multiple times and being assured the pizza was five minutes away (ha!).  I can understand the occasional long delivery, but 2 hours is way too long.  The added insult is the $3 delivery charge added to your bill PLUS they ask you to add your driver's tip when you place your order (aren't tips supposed to be given for good service AFTER you get your food?).  So yeah, we paid $7 for our pizza to be delivered 2 hours later.  No thank you.  I live a block from Pizza Orgasmica.  I'll just go there from now on.  Based on other reviews, this seems to be a persistent problem... it's also the reason I didn't bother to complain or ask for any partial refund.", "author": "John S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-23", "description": "The pizza isn't that bad. What really sucks is the service. People who work there don't seem to give a sh*t about customers returning.", "author": "John C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-05", "description": "do not go or order from here\nargumentative  horrible service \nwrong order  2 hr delivery time with wrong order\nconsistant bad service", "author": "thena h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "I grew up on this shit, so I have a biased opinion, but I have to say this is some banging pizza.  It was a Sunday night and I was in need of some serious pepperoni!!  In walks the Large Double Pepperoni for 13.99!!!  I have to say it was pretty dope!  Good work boys!", "author": "Pete C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-04", "description": "HORRIBLE PIZZA!!!!!!!!!!!!!!!!!!!!!!!  I usually love having Round Table pizza and have had it for years.  I ordered from this Round Table one time and it will be my last!  The people are extremely rude also.  I can't believe anyone can run a business like this.  They give Round Table a terrible name.  NEVER ORDER FROM THIS ROUND TABLE FIND ANOTHER......", "author": "Doug F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-23", "description": "My first foray into pizza in this city, and I was so pleased. It was the perfect dough/sauce/cheese mixture. There could have been a few more pieces of pepperoni - but thats just me being picky!", "author": "Katie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "i grew up eating round table in the east bay...i like round table. i've tried to order pizza from this location several times in the past but no one answers the phone. so i gave up... until tonight when my boyfriend went on and on about how he loves round table. we ordered and the pizza came in less than a hour --- we ordered a pepperoni and personal garden. pizza was cold and there wasn't any sauce. we live less than 4 blocks away. not sure how this happens. not ordering pizza from here ever again. i've purchased frozen pizza across the street at safeway that tasted better. glad they never answered their phone.", "author": "jen y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-25", "description": "Good pizza, for what it is, which is your basic American style thin-crust pizza.  I haven't eaten much pizza since Ruby's in the Marina closed years ago (OMG, the best pizza ever, cornbread crust, etc etc)...so I was surprised at how expensive it is!  However, you can always go on-line and print out a coupon ($1 off a medium, $2 off a large, $3 off an extra large).  My only objection is that the pizza is EXTREMELY salty.  You don't notice it so much at the time but seriously, I have to make sure I have a quart of Gatorade on hand any time I order their pizza, because I develop a raging thirst afterward, and especially in the middle of the night I wake up with a dry mouth and have to chug Gatorade.  The service is very efficient, there's one girl in particular who seems lightning fast and it's a nice feeling knowing she's got all her marbles and is going to get it right the first time, which seems to be rare in public service these days!  The place is really clean.", "author": "Alexandra D."}
