{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "8 years I have been searching for a good curry in the States. 8 bloody years!!! \n\nBeing from England the curry here has always been disappointing. Not this place. Leaving with a massive smile on my face because the curry was banging. Oh and accompanied by a nice big cold larger. \n\nHeaven.", "author": "Henri P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "Based off what I ordered, the food here is tasty but doesn't cater to homestyle Indian taste. The curry portions were pretty small. \n\n- Chicken Tikka masala - too creamy I would not reccomend this. \n- Chana Saag - really tasty but chickpeas were overcooked\n- Muligitawney soup - had either too much coconut milk or cream, oily, taste of Dal didn't come through\n- Tandoori Chicken - came out on a sizzling platter and was nicely cooked but the marinade left a lot to be desired \n- Service - excellent!", "author": "Anjali P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-04", "description": "This update is in response to Mr.Ajay's reply to my review-\nFirst of all please Google or find out from restauranteurs in India what a\"Thali\" is- your justification is -when I order Gulab jamun and you bring rasmali and say that every restaurant has its own menu and food.\nNo! There are some things which are standard and you need to stick to what they are when you are naming them.What you served was a Three course meal and not a Thali.\nAnd to the point where you said we questioned only when the bill came up,of course we were taken aback to see 85$ for 2 Thalis which would have normally costed us less than 50$.And in the beginning when we were given 4 samosas the server told us that 2 Thalis were a lot of food,then I immediately told we will cancel one and he said no you cannot as we already brought the samosas!(if he would have cancelled then, all this chaos wouldn't have happened)\nSo the whole situation arose because you used a Standard item Thali and made it into whatever you want.You are free to do it but it's your responsibility to explain it to your customers and not think that it's a headache to the servers.\nYou wasted our time,money and we left your restaurant completely disappointed with your hospitality.", "author": "Ramya R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "I stayed out a little too late on Friday. So when I woke up, I was starving. Decided to get delivery through Eat24 on Saturday, September 22nd. I placed my lunch order at 2:45pm. It arrived at 3:45pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour and tamarind chutney, All batters are signature chickpea (garbanzo batter) prepared by our chef ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce, Extra spicy ($12.95)\n*Garlic Naan: Naan layered with freshly minced garlic and chopped cilantro ($2.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n\nI adored the curry. It was creamy and comforting. Could have used a little more spice as I wanted it extra spicy, but it had a good amount of heat. The naan were both soft with a nice chew. Though, I do think they could have used more garlic and chili. The flavors weren't strong enough for me. The samosas were good. Crispy on the outside and soft on the inside. Though their mint chutney was very bland and watery. Didn't really stick to the samosas. I love dumplings so the momos were tasty. The dipping sauce complemented them well.\n\nIndian is my comfort food and this hit the spot. Especially since I was feeling a little delicate that day.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "The korma and masala are heavenly, and the service felt warm and personal compared to last year.  We stopped in for an early dinner last weekend and were immediately seated. We got an unexpected free serving of excellent papadum and chutneys to start the meal. The vegetable korma and vegetable tikka masala were both amazingly flavorful, full to the brim with vegetables, and not too heavy. I would also recommend getting the kabuli naan because the sweetness of the cherries baked into the naan complements the creamy sauces perfectly, and all of the naan portions are enormous. The food was so good that we ate every last bite even though we weren't very hungry! We're looking forward to our next visit.", "author": "Vijay N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "I'll start with saying that I have only ordered takeout from this restaurant. I should probably dine in at some point but their takeout is just so dang good and easy. My staples are the chicken tikka masala which has a nice rich flavor, perfect over their basmati rice. Samosas are packed full of goodness. And the garlic naan, oh my, the stuff dreams are made of!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Craving for Indian food? This is an amazing restaurant: heads up: they don't have buffers !! I was surprised too since I've rarely seen an Indian restaurant without a buffet.\n\nWe ordered roti, butter naan and butter chicken, the gravy was amazinggg!! Creamy and delicious!! The quantity was enough for 2 people. The roti bread was good food, and with prompt servers, I had no complains whatsoever.\n\nGreat food,  wish the restaurant was a bit bigger in size, but I didn't have to wait so no complains :)", "author": "Saarthak C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "If you crave that spice fix you can only get from authentic Indian food, this is the place! My favorites are chicken tikka masala (spicy), garlic naan, lamb chops, and of course, chicken momos. \n\nAlso very fragrant and flavorful- the chicken biryani, Shrimp tikka masala (spicy), and the seekh kabobs. \n\nEverything tastes a little bit better spicy, as hot as you can eat it, and followed by a delicious mango lassi.\n\nThe ambiance is very nice and comfortable. The service is really great.", "author": "K C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Oh sjit!!! Thus spaketh the dude who ordered, when he opened his to go platter.\n\nThis freaking spot actually lives up to its name..\n\nOrder the veggie momo nice spicy flavor\n\nBut the aforementioned exclamation and subsequent explanation came from the awe provoking lamb shank.\n\nThis mofo was like the size of mr T.'s bicep!!  No baby ill equipped veal box baby here!!!\n\nFelt like a dog gone sultan eating this prized specimen..  \n\nTrue royalty while eating on my drive down Fillmore Street in my Chrysler minivan... \n\nA+ guys. Job well done. Excellent portions. Flavor, freshness... And hooked me up with extra naan!", "author": "Dubl A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Ate here last year with 2 friends.\n\nFood: The food was so so good - some of the best Indian food I've had in the city at reasonable prices!\n\nAtmosphere: Comfortable, clean, and they have a decent location. Note, the dining area receives a lot of cooking scents from the kitchen, so we left with our clothes smelling strongly of spices, so just be prepared!\n\nService: The service was great - fast, nice and knowledgeable!\n\nWould give this 4.5", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "VEGETARIANS AVOID THIS PLACE! We ordered kadai paneer but got chicken pieces along with paneer. When we asked them to check, first they mentioned it should be paneer but we requested them to check with chef and they confirmed it was chicken indeed and then mentioned it is \"No problem\" for them and can prepare a new one. It may be no problem but its a big deal for vegetarians. We left the place immediately. Horrible experience", "author": "Pray D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "I was in a particularly zen mood when I entered this familiar Indian restaurant because I just came out of a low and slow afternoon at the Kabuki Springs & Spa down the block. After all, it was men-only Monday, so I was au naturale in the hot bath but fortunately not at this restaurant. No, I was fully clothed and feeling quite serene in here, even though I recall taking advantage of their busy all-you-can-eat buffet more than a decade back, probably stuffing my gullet with chewy naan and saucy korma. Those gluttonous days are gone (fingers crossed), and I decided to keep it light, at least as light as my head was feeling. A complimentary flat of papadum arrived on my table with three flavorful dipping sauces (photo: http://bit.ly/2iL45vC).\n\nJust wished there was more papadum. From there, I started my true order with the $4.95 Cucumber Tomato Salad, a simple and small plate of freshness with tomato slices covered fort-like by cucumber slices lightly seasoned with chat masala and accompanied by a vinegary dipping sauce (photo: http://bit.ly/2kl1Y1N). For my entree, I ordered an old veggie favorite, the $10.95 Baigan Bharta, clay oven-roasted eggplant cooked into a stew-like consistency with green peas & spices in an onion & tomato gravy (photo: http://bit.ly/2BwU6O9). Quite hearty and tasty with plenty of umami flavor and complemented nicely by the $2.95 dish of Basmati Rice (photo: http://bit.ly/2AoBGSr). So I did manage to keep things light and maintain my sense of calm. Ummmmmmm.\n\nFOOD - 4 stars...a surprisingly refreshing Indian vegan meal\nAMBIANCE - 3.5 stars...the space looks more open than it did before\nSERVICE - 4 stars...efficient & polite\nTOTAL - 4 stars...a fine post-bath meal if Dosa is packed", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "Ordered dal makhni and bread. Not even close to my expectations. Not properly cooked, bland \n\nI'm disappointed. Will not recommend this place and especially this dal.", "author": "Cyber B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "I eat here probably more than I should. This isn't a place for really spicy Indian dishes, it's more for creamy, indulgent flavors. I love it. If I'm extra hungry at first I'll get the veggie momo's which are excellent. I've gotten their saag paneer, paneer tikka masala, vegetable korma, and malai kofta. Everything has been excellent. Great spot for vegetarians!", "author": "Shelby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "This was the best indian cuisine i ever had.Food was so delicious service was so good.The guys outfront were really friendly and the service was so good.It was an amazing experience for us as we flew from La and were looking for a good indian food.This place is really good and very friendly atmosphere.", "author": "Sudeep B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Delicious food! We ordered the baigan bhartha, shahi paneer, and malai kofta. Everything was very well seasoned, and just as spicy as we asked for. I especially recommend the malai kofta. They all had a little too much cream, but that's to be expected from restaurant food. The downside is naan or rice are not included with the entrees, so you have to order them separately. I ordered a serrano chili naan, which I really loved and recommend.\n\nWe came during lunch time on a Sunday, and it was pretty busy. Turns out, this place is owned by the same people who run Om Indian Cuisine in Haight-Ashbury, and they just opened another restaurant as well. The ambience is alright, a little dark (I think Om does a better job here). Service was also a little slow. They brought out our three different appetizers one at a time, perhaps in order to buy time for the entrees, which came a good 25 minutes after the order was placed. However, it was well worth the wait, and, overall, made for a great meal.", "author": "Apoorva A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "We ordered through Ubereats  and it took forever for the driver to deliver the food to us. We had called the restaurant so many times to ask about the status and the guy over the phone was extremely helpful and the good part is we found out that they do free home delivery . Now lets talk about food. OMG  food over here is amazing. We got seekh kebab and salmon vindaloo with some rice and naan. The spices were right on point but however I do think that they should give some complimentary rice with curries.", "author": "Vimpy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "After the delivery guy left and I peeked into the bag, I frowned when I saw the jumble of containers and a cup of Mango Lassi nearly overturned. The mango lassi was a bit warm, too. \n\nMy grumpiness immediately dissipated when I popped open the trays and the fragrant aroma of spices and grilled meats perfumed my kitchen.\n\nAnd everything was really delicious, juicy and perfectly cooked. \n\nWe ordered two appetizers, Chicken 65 (pieces of yogurt-marinated, seasoned crispy chicken breast,  $9.95) and Chicken Momo (steamed/pan-fried Nepalese chicken dumplings, $8.95). Both were solid but didn't bowl me over.\n\nTandoori Mixed Grill ($18.95) entree was truly delicious with tikka and boti kebabs and tandoori chicken and salmon. The grilled onions pulled all the proteins and flavors together. \n\nPlain basmati rice and garlic naan ($2.95 each) rounded out the meal.\n\nThat I have to nitpick shows you everything was delicious. Suggestions would be including a small container of plain yogurt (especially if you order more heat) and to slice the salmon bigger in the Mixed Grill plate because it looked identical to the pieces of chicken. When I found it, I was too full to try it. \n\nPlenty of leftovers means there's enough for two full meals tomorrow, no skimping necessary. \n\nAnd PS...That was the best mango lassi I've ever tasted.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-19", "description": "This place is good if you are not looking for aunthetic indian flavor. Their flavors are good but medium spicy is too mild and if you order spicy- god help you finish it. They add tons of red chilli flakes if you order spicy food. We have given it many chances, tried to explain that we would like medium spicy food but it never turned out to be what we wanted. \nIf you are not looking for certain spice level curries- you might like this place", "author": "Grishma Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Wow. What a hidden gem! Reasonable prices and very generous portions. \n\nCame on a Saturday night by myself. Place was pretty full when I arrived at 7 and was packed with a wait by 7:30.  \n\nFirst of all, I ordered vegetable pakoras. Usually you get like three or four. I got a total of nine tasty, well seasoned fritters. More than I could manage by myself so I saved some for later. They were perfectly battered and fried fritters of strips of what I think were mainly potato and zucchini. Nicely salted too. \n\nFor my main I ordered mattar paneer which is always a favorite. While I prefer not to be asked for a spice level because dishes should just have a level, i liked that when the server asked for a spice level and I asked her to recommend one, she actually thought about before saying medium. She also recommended rice over naan when she asked me that question. The naan was more than the rice, too. \n\nIt took a while for my main course to arrive which tells me it probably was not  just sitting in a cauldron but was actually cooked. It arrived piping hot, with a ton of peas and really big chunks of cheese. Yum. For \"medium\" it wasn't that spicy but the flavor was really good. \n\nI'll definitely be back. There's a huge selection of vegetarian dishes. I'm not vegetarian but enjoy eating well done vegetarian food. Five stars for that here.", "author": "Tim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "Do I miss the old restaurant? Sure I did,  but my husband and I love the new. The feel is great and the service is wonderful! \n\nThe food was excellently prepared, the seasoning was just right on EVERYTHING and it was just an as around God experience. \n\nOne star off only because my fruit naan didn't have all the fruits it said did. (Sad face)", "author": "Milan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "The food is fantastic here. Everything is fresh, the spices are intense and pungent, and the sauces are velvety. \nWe visited twice while on our vacation, and had two very different experiences. We went the first time early afternoon just after the lunch rush and the service was attentive. The second time we visited for dinner and the service was pretty bad. We waited almost an hour for food and when we finally got it they had my hungry five-year-olds order incorrect. I ended up giving him my food and having to eat what they brought since there was no way we could wait longer for them to remedy it. All in all though, the food is so good that I can't even take a star away for the poor service on the second visit.", "author": "Marcie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-26", "description": "3.5 Stars.\n\nService was great and there were some in-house appetizers. This is one of the most upscale Indian restaurants I've ever eaten at but I'm not surprised since it's around the Lower PacHeights area. The food was decent but I'm not sure I can justify the price for the quality of the food. The curry I had was in medium spicy and IT WAS ON FIRE. And mind you, I've done the fire noodles challenge 2x in my life (on a tangent but there are tons of videos on this challenge on Youtube). Anyway, I also love MALA dishes, so it's safe to say that I have a high tolerance for spicy food. This medium spicy curry will sure make you sweat...or swear. \n\nThe food was good but not something that wow'ed me, for some reason the wow-factor wasn't there. The chicken was ok, but it wasn't extraordinary. Same for the naan. The basmati rice was a better in quality compared to other places but I'm not really here for the rice.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "My absolute favorite food to order-in in the city. The portions are generous for the price and the flavors are exceptionally good. Food is always fresh and tasty. My go-to order is the chicken tikka masala and the salmon tandoori. Both are amazing!", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "We went here for dinner on a Sunday. There was no wait and got a table right away. The food was great- portions were big and flavorful! I got chicken vindaloo with garlic naan and my friends got chicken tikka masala, butter chicken masala, chicken korma. They were all delicious!", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "After a long day running around for my birthday,  hubby and I decided to stay at the hotel and order delivery for my birthday dinner.\n\nAfter endlessly pouring over yelp reviews for the best restaurants in the area, we settled on two choices and dug into the reviews for each. \n\nThis restaurant had far fewer reviews, but most were highly complimentary,  so we decided to take a chance. We were so glad we did!\n\nWe ordered the butter tikki chicken (spicy) and the chicken vindaloo (very spicy). We also ordered some samso.\n\nSo before I talk about the food, let me be a Debby  downer.  My issues which prevent this from being a five star review are that 1. The order took 25 minutes after the quoted delivery time, which was already an hour from the time I placed the order. 2. No silverware was provided, but thankfully we were able to get some from the hotel staff. Umm, it's a delivery...provide some cutlery!! 3. Since it took so long for the food to arrive, it was not as temperature hot as I prefer and we couldn't warm up our food,  so we had to eat it as delivered. \n\nSo the food. OMG,  it was FANTASTIC! We love love Indian food and this seriously could be the BEST Indian food we've ever eaten. The spice level was accurate and we definitely got mouthful of heat and perfect spiciness. \n\nThe garlic naan was good, and the rice was perfectly cooked. If our delivery was this good, I'm sure it would be the same in the restaurant. \n\nOverall great experience and we can't wait to eat here again!", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "Sweet intimate feel and we scored the table by a window. Very nice people and very good food. We had the vegan coconut curry vegetable and they made the dahl mahkani vegan, using coconut milk. Not outstanding but really good and we thoroughly enjoyed the feel of the place. \"Medium\" price was a bit not spicy so I would order it spicy next time. And then see what happens!\n\nNext time we'll try the chicken or vegetable Momo which is a Himalayan dish. FYI their chai comes already lightly sweetened with sugar.", "author": "Genie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Food is quite delicious. The saag paneer was super, and the Bharta was the best, tasted homestyle. Would definitely come again. Price reasonable for the food given.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Great food and service.  I had lunch here friday and ordered to nataraj veg korma normally i wouldn't eat all of it but it was so good i ate it all, love this place and i'll be back.", "author": "Kent P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "Showed up 30 minutes later than promised. Tasted terrible. My tikka masala tasted exactly like tomato cream pasta sauce. Biriani was soggy and lacked flavor. Rogan josh was bland and watery. Naan was kind of ok I guess? Basically no redeeming features of this meal.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Very good, traditional Indian food. Royal Indian is not \"fusion\" like other Indian restaurants in the neighborhood, but it is slightly higher scale than most.\n\nUnlike their completion, down the block, they do not teas you with papadum and then charge extra for chutney. They don't charge an additional \"SF Mandate\" fee. It's included in the cost of their food. Their wine list is not huge, but their wines are fairly priced. Food is tasty. Service is very good and you can tell that they're wait staff are really making an effort.\n\nThe restaurant has a diverse clientele so I wish their spread of \"spicy, medium\" or \"mild,\" designations for how you want your food, reflected the spectrum of their clientele. We are Indians who have lived I. The US for most of our lives and we felt that their \"spicy\" was not spicy enough. Otherwise, Royal Indian was bang on.", "author": "Tushar N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "To add to my previous review: also love the Lamb rogan josh.", "author": "JJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "I miss the very affordable AYCE place it once used to be, but I LOVE this new place. All the food we ordered came out hot, seasoned to perfection, and reasonably portioned. My husband and I ordered the following:\n\nTandoori Assorted (chicken, lamb, grilled veggies) - $10.95\nTandoori Chicken Wings - $9.95\nKashmiri Chicken - $11.95\nGarlic Naan - $2.95\nTandoori Roti - $2.00\nChai - $4.00\n\nCannot go wrong with any of the above. Our favorite was the Kashmiri Chicken. It is a sweet, creamy, and rich chicken curry dish. The chicken was buttery soft. The curry could be spicier though.", "author": "Jenn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Some of the best samosas I've ever had. The Tikka masala is clutch. I'm a wimp about spice and the medium Daal was fine. Definitely a favorite spot.", "author": "Adrienne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "We didn't have any entrees here but the Tandoori Chicken Wings were the best chicken wings I've ever tasted. Masala chai was super good too. Can't wait to come back for dinner!", "author": "Shevawn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Ive been coming here for Lamb shank it's so good \nI also have tried other stuff which was good", "author": "Mohammad Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "What a gem! When you're feeling tired of hitting up all the trendy SF restaurants in Hayes, the mission, and nopa, come here for some truly excellent, well prepared Indian food. Many Indian food restaurants in America make the food overly rich, but not Royal Indian! I've ordered several entrees ranging from vegetarian to chicken to lamb. All of them were perfectly seasoned, the meat was always very succulent. I can't handle a lot of spice and they prepared the food to my tolerance level without sacrificing flavor. \n\nOn top of the fabulous food, the prices are reasonable and the ambiance is nice.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Amazing quality of meat, sauce and fine attention to detail.  We really enjoyed the atmosphere as well.  We will definitely be back!", "author": "Julian K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-24", "description": "Meh. Second time ordering food via delivery. Got the tandoori chicken, lamb vindaloo and garlic Nan. Delivery experience was fine. Food is pretty bland, sauces are watery and meat is dry. Tandoori chicken tasted mostly like tomatoes. Garlic nan is ok, but again not well seasoned.", "author": "Bill L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Fairly priced and very filling! There aren't very many restaurants left on Fillmore that can cost about $35 for dinner for 2. When you sit down, you get a really yummy sort of spiced cracker and dipping sauces. The entrees look really small when you order them, but about 2 entrees and a side is definitely more than enough for two adults! The servers are really friendly too and it's nice to still have a place like this in the neighborhood.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Apparently under new management and slightly remodeled, this place has improved slightly from the previous owners.  We had a hankering for some Indian food after work and remembered this spot out in the Fillmore.  No buffet options anymore either.  \n\nAlthough they were busy, there was an table available for us and didn't have to wait.  We decided to go with the Thali special for 2:  STARTER: Pappadum, Samosa ENTREES: Chicken Tikka Masala, Saag Paneer, Tandoori Chicken with Boti, Side of Rice & Naan. DESSERT: Kheer.  Such a steal for a little over $40.  \n\nMy favorite dish was the tandoori which was perfectly spiced and came out sizzling on a hot plate.  The naan also stood out as the texture was spot on.  The not so greats?  The saag paneer was quite plain and the tikka masala was also slightly bland.  Were they terrible?  No, but I've definitely had better.\n\nI have to say that the portions were huge though.  We definitely needed doggie bags and had dinner for the next night.  \n\nService was slow but they were efficient.  3.5 stars and a good option for Indian food in the area.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "I don't know Indian cuisine that well and I've only had a few dishes here but this is a place that I will keep coming to because it's so damn tasty and I plan on working my way through the whole menu. The chicken vindaloo is so flavorful and just enough heat. Tonight I had the tandoori chicken and again, very flavorful. I thought I hated rice but the jeera rice was like something I want with every meal now but I can't make it so I guess I'll just have to keep eating here. \n\nThe ambiance is casual and the service has always been great. Also it's pretty cheap for SF. I had the tandoori chicken, rice, laccha paratha, and a glass of wine which set me back $29 for meal and $6 for tip. Btw, I have enough leftovers for another meal and snack.", "author": "Juliette H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-27", "description": "Couldn't even get anybody to acknowledge that we were there waiting for a table. Finally got seated after 45 minutes and bigger groups that showed up much later being seated. Took another 45 minutes after we ordered to get our food. \n\nAsked for a chair so we could sit facing each instead of on the same bench, and they simply  said \"no\", when there were plenty of extra chairs. Menu is way too big. Apparently the sizzling meat plates are the thing to order. They did smell really good, and the curries were at best mediocre. \n\nI would be tempted to go back now that i know what to order, but the service was so bad all the way through. There's really no point.", "author": "Grem W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Yum! Cute little place had lots of patrons on a Saturday but no wait. Service and food was prompt and super tasty. Great selection on the menu, will have to be back to try some more options. Good prices.", "author": "Kaitlin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-21", "description": "I rarely if ever give bad reviews. So I will clarify here. There food is good but the delivery system is bad. I ordered food two nights in a row. The first day, the food was delivered on time at the room (motel) & the delivery man got his tip from us. \n\nThe second night, the delivery guy called up 5 minutes before reaching and asked me to collect the food from the street. It MAY be linked to me having paid the tip online.\n\nThen, on opening the food containers, we realized that the order was mixed up.  And basically, the chicken dish was missing. I tried calling twice but wasn't any use.\n\n\nSo, to summarize. Good food.\n\nBad delivery system. So you guys should either eat in, or find some place else to deliver. RAAVI is better and professionally managed.", "author": "T D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-21", "description": "Lamb shank was so undercooked that it was hard to chew soi we left our. The tomato sauce was clearly just added to the cooked lamb shank right before they served it. Basmati rice was also not cooked well. Chicken tandoori, we asked for dark meat only and our waiter confirmed the order but still we got breast pieces and thigh. They are audio loading like 1.5 pounds of onion on top of this tandoori to make it look like a large dish. You don't fool anyone.\nWaiter forgot to bring us Jeera rice. Then instead of bringing it, he said he will go check if we ordered it. \n\nWe last more that half of what we ordered on the table and asked for check. The waiter did not even ask why the lamb shank was untouched and most of the 3 orders of basmati rice was not eaten. \n\nTo those San Francisco folks who think this is awesome Indian food, you have not had good Indian food. Go eat at Amber at least. Or go 3 doors down and eat at Dosa.", "author": "Nariman R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "My favorite Indian place in SF! Never a wait and food is always SOO good!!!", "author": "Ayaka S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-07", "description": "I was disappointed.  It's been hard to find good Indian food in my neck of the woods and I was hoping this could be it based on all the reviews. Unfortunately we did not like 2 out of 3 of the main dishes and could not be bothered to finish them. \n\nI give it 2.5 stars but because the main dishes were so disappointing, I'm rounding down. For $55 for the meal, I  expect better. \n\nDelivery took a long time (1hr 20min), which was predicted by the ordering app, so I do not take off any stars for that. \n\nWe ordered 6 things:\n1) Saag Paneer, medium spice - this was good, I'd give it 4.5 Stars \n2) Chicken Tikka Masala, spicy - the chicken was incredibly dry and tasteless and the sauce was thin and milky lacking the thickness and depth of taste I expect. 2 Stars\n3) chicken Vindaloo, extra spicy - incredibly watery, very disappointing. 1.5 Stars\n4) garlic Naan, good, not amazing. 3.5 Stars\n5) mango lassi - excellent. 5 Stars\n6) basmati rice - average. Like that it had peas. 3.5 Stars \n\nPortion sizes of the main dishes: below expectations. I would have expected 50% more for what I paid. \nRice and naan and lassi portion sizes were about right.", "author": "Hayley J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "Food is great.  The service sucks.  I've been there four times now (after their makeover and shift away from buffet style) and at least three of those times I've received either pushy or forgetful service, and had multiple interactions that made me just feel weird by how the staff acted.  And this does NOT happen most other places with me.  \n\nTonight my waiter was downright rude when he dropped the check by pushing it under my hand practically so I had to \"pay attention\" to it and him, and instead of being polite he stared at me and looked down at the check, like pay it now.  Then, as there were two other tables full of people in the restaurant, he came by again after about two minutes and asked if I was ready.  I was not.  Still munching on food. I can't remember exactly what he said but he bordered on aggressive in insisting I need to pay immediately.  Food in my mouth. Still sipping the (warm) water that was just poured in my glass.  I think he said \"you are ready\".  I replied I was not.  I've just eaten a full meal, not stopping chomping from the second they dropped the food.  And they want me to pay and leave.  With two other tables with multiple people still eating and laughing and chatting.  Not only that, when I arrived there were three empty tables.  One of those a two-top about 4 feet from the front door.  I was offered either the table by the door or a table that hadn't been cleared, but definitely NOT the other two clean, set, and empty tables.  I said I'd like the table away from the door that hadn't been cleared.  In case you missed it, there were two other clean tables empty, mind you.  So I proceeded to wait patiently for what seemed like 10 minutes while the bussman took his sweet time clearing and setting multiple tables.  Not just the table he was asked to set for me by the waiter.  Then as I'm waiting patiently (but starting to get frustrated at how distracted the bussman seems to be already) a group arrives and the bussman stops setting my table and starts getting water, menus, and whatever else for this new group, while a waiter stands there and chats.  The whole time there are three other waiters not taking orders but rather talking amongst themselves or to the new group that has arrived. Finally the man I presume was the bartender or something comes over and asks if I've been helped. I mention that I was waiting for said table but the bussman seemed to be distracted attending to other things.    The waiter came by and must have heard of my comment to bartender and mentioned that they were tired, \"twelve hour shift, you know\" and did apologize for the wait.  This did make me feel better.  But it makes me think, maybe you shouldn't all work twelve hour shifts!  I've been in fine dining service and I can't imagine ever being asked to work from noon to midnight, or whatever.\n\nTo continue in this forgetful/slow fashion, the papadam arrived ten minutes after I sat down and two minutes before my meal was served.  And I'm pretty sure the stack of three papadam was not for me but for the full table behind me, as I saw the same man walk back a minute later with a shorter stack of papadam for them. Not a big deal, but also not good service. \n\nThen after being served and eating non-stop I get the downright rude check drop and subsequent aggressive attitude with the check.\n\nJust left me feeling crappy leaving there, again.  And I walked in very relaxed and happy.  I thought I'd give them another chance.  But it seems they just don't get the fine(r) dining that the have shifted to, since their makeover (and new ownership?)\n\nYuk.", "author": "Bill s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Amazing deals and lots of food! I came with my friend and my girlfriend, who has hitherto experienced decent Indian food. Everything from the texture and taste of the curry to the naan is made with science and art. The royal thali special is great to share for two, but even with three people we had a tough time finishing all the food. The deal is definitely worth it if you like the popular Indian hits (saag paneer, tikka masala, tandoori). Great service too - definitely worth the shot, and happy to say everyone at my table was glad they came to eat here. Be wary of the food induced coma that will likely follow any meal here.", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "We came in expecting the previous restaurant--Indian buffet. This was great though. Apparently, it was day 2 of their grand opening. \n\nFood = great. Clean. \n\nComplimentary papadum = great. Fresh, hot and full of flavor. \n\nChicken tikka masala = good. Great flavor, white meat chicken, creamy and slightly sweet. He loved it. \n\nBasmati rice = okay. \n\nService = friendly. Attentive.\n\nPrices = moderate. \n\nWe'll be back for a return visit.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "First thing that attracted me is the name then the ambience while coming to the main stream of any particular restaurant is \"FOOD\" because,with out great flavour or the special essence the ambience or the name doesn't make any magic....\nAmazed by their hospitality and the food tastes beyond awesome,small place with great taste love it.\n\n1. Chicken tikka kebab smoking hot.\n2. Delicious creamy Chicken tikka masala.\n3. Crispy crispy Onion kulcha and garlic naan.\n4. Mango kulfi.\nAmazing lunch under 50$.\n\nI wish you guys all the very best.", "author": "Phani C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "We came here with empty stomachs. We shared samosa, rice, and garlic naan. I ordered chicken korma, my brother ordered shrimp tikka masala. The samosa was great: clean and not salty but perfectly spiced. The naan was great but I thought it could've been crispier, perhaps I was just biased since my goto Indian place in NYC had really crispy (yet soft inside) naan. The chicken korma was definitely solid, but I thought it could've been a little thicker. The portion was pretty small as well - too small for 1 serving of naan. The service was good. If I live here I'd visit this place on a regular basis.", "author": "Karl S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "My favorite Indian restaurant EVER. Usually I don't have Indian food more than once a month. Now I go here weekly!  Everything I've had is delicious but my personal favorite (as a pescatarian) is the salmon tandoori. The menu has something for everyone including a whole page for naan options- Yum!!\n\nThey also sell wine which is abnormal for an Indian restaurant except for the super premium places. This isn't dirt cheap but you get a nicer ambience and the option for booze. They also do delivery but some dishes I would say are best hot!  Speaking of hot they accommodate mild for those of us with weaker taste buds. \n\nFor two people including a bottle of wine and usually enough leftovers for lunch the next day it's still less than $100 after tax and tip.", "author": "Z C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "I love their shrimp tikka masala!  Full of flavor!  Not to mention the texture of the shrimp is perfect with the luscious texture of the tikka sauce.  Service is great and I will definitely recommend this to family and friends.  Of course, I have a favorite spot now for Indian food!", "author": "Hazel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Great chicken tikka. The mild option is not spicy at all. Suggest medium hot if you like it a little spicy.", "author": "Casey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "Delicious! The butter chicken is sweet, the naan was chewy and delicious. Love the chicken momo! Great flavors all around.", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "This is a wonderful restaurant. The service is exemplary and the food delicious and more than beautiful in looks and taste. We thoroughly enjoyed our meal.", "author": "Ashleigh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "I was greeted promptly. The service staff was polite and responsive. The chicken tikka marsala was superb. The entire staff was very attentive...this is a classy restaurant among area restaurant that are not.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "I was really pleased with delivery from this restaurant. It came quickly and was still warm.\nWe ordered the \n\"Royal Thali Special for 2: Starter: pappadum, samosa. Entrees: chicken tikka masala, saag paneer, tandoori chicken with boti, side of rice and naan. Dessert: kheer\" for $42. \n\nWe got four meals out of it! The entrees didn't have very much protein in them, but to be fair it was supposed to be for two meals. The naan came a little tough but I bet if we had it fresh at the restaurant it would have been better. It also came with a variety of dipping sauces which were fun to try and all tasty.\n\nThis was a fun way to try out multiple dishes from a new restaurant at a great price.", "author": "Emma B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-10", "description": "Don't be fooled, there are better Indian restaurants anywhere else. I walked in after a couple. I was greeted with a side eye because they were going to close in 25mins. Then after I sat, another couple walked in and the host/waitress gave them a bad time for walking in as a paying customer. The fresh flowers on the table was great. The hair in my chutney and the fries fries in my pakoras was not great at all!! The only place they earned two stars from was the Vegan coconut curry with vegetables. Other than that, it's a spot that I would never return to again.", "author": "Nisha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "The vegetarian food was good but the non vegetarian varieties we tried were average. Good service. Loved the mango lassi here out of all the Indian places I tried in the Bay Area.", "author": "Pavani P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "One of my favorite Indian food places to order delivery from.\nI always find myself craving their Daal soup & the Baigan Bharta. While I've never eaten in, the inside of the restaurant looks nice and cozy, with white linen covered tables. Good dinner option for a night out on Filmore St at a more affordable price point than DOSA down the block. I appreciate the fact that they have a good variety of vegan/vegetarian options, also when they mean spicy, they mean SPICY (Thank you) :D", "author": "Daniella O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "Had it delivered. Hot and delicious! Mango lassi chilled and sealed well. Yum!", "author": "Ivy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Stopped in for a quick meal after reading the amazing Yelp reviews! Overall a great experience!\n\nFOOD: I had the veggies momos as my appetizer. They were fairly underwhelming taste-wise, but the presentation was very cool. I've never had vegetarian monos before so it's possible that they were good, but I just don't like veggie momos. \n\nMy main was Paneer Tikka Masala with white rice and chili naan. It was awesome! Highly recommend! \nThe naan was presented very well and was buttery and flakey. The Paneer was thick and creamy. \n\nSERVICE: My waiter was attentive and very accommodating. No complaints here. \n\nAMBIANCE: The ambiance was pretty neutral. Basic Indian restaurant, nothing fancy but far from dingy.\n\nI would definitely come back to try some of their vegan fare!", "author": "Premlata P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "I loved the use of seasoning and spice at this restaurant.  I went with an Indian friend from Silicon Valley, so she did not think it was as great as I thought, but I thought it was very good, close to Indian you'd have in London, U.K. vs. California in general.  I will be back again.", "author": "Masako T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "I ordered the vegan coconut curry veggies, and OMG. So delicious!! Creamy and light at the same time. Garlic naan is also yummy. I highly recommend!!", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "If you are looking for a restaurant with traditional and delicious Indian​ food this is THE place! Cozy (not fancy) environment and great price as well. Totally recommend​.", "author": "Bruna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "Same old average, non-authentic indian food that you get pretty much all across the US. I ordered the chicken korma and butter chicken with garlic naan. Chicken korma was better than the butter chicken but again, it is nowhere close to what you would get in Shalimar, which is not very far from this place. I didn't try the kebabs but I am pretty sure I didn't miss anything. If you're looking for a restaurant which serves kebabs cooked in a proper tandoor and have a nice char on them, or tandoori naans which are crisp on the outside and soft on the inside, then this is not the place. Go to shalimar instead :)", "author": "Akshat G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Great flavor, variety of options on the menu and everything we ordered was delicious!  I found it hard to find truly good tasting Indian food in this area and this will be my go to place!  I loved it!  The samosas were flavorful and not oily.  The chicken kebabs were my favorite!", "author": "D R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I have eaten here several times by myself and with my wife and each time have had a pleasurable experience: prompt and polite service, nice ambiance, delicious dishes and reasonable prices. They will customize the amount of spiciness you want and get it right. This is my new Go To place for Indian cuisine.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Their korma is one of the best I've ever had. I'm super excited about returning and eating a billion more dishes.", "author": "Saphyre R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "I LOVE THIS PLACE! Best Indian in town! The naan is delicious and the tikka masala is amazing.", "author": "Fernanda D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "This restaurant is a little tacky but kind of in the best way. The waiter is in a suit and there is candlelight. I got the chicken tikka Marsala, garlic naan, and chicken mo mo. It was okay but not great. Very light flavor but good texture.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Some of the best Indian food that I've had. We ordered vegetable momo, butter naan, chicken tikka masala, coconut vegetable curry, and rice (you do have to order rice separately- it does not come with the entrees). Flavors were full and fantastic. Servings were generous.", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "There were obviously a lot of fake 5-star reviews for this restaurant, but we tried it anyways.\n\nDelivery was faster than expected. The garlic naan bread was delicious. The aloo gobi had the perfect amount of spices.\n\nHowever, the chicken tikka masala was bland and the shrimp vindaloo was really watery and also very bland. Hopefully this was just an off night for them.", "author": "Lester W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Small hidden Indian restaurant with great flavor. Don't get discouraged with the ambiance as it's pretty outdated but the food is well worth it. Went with the recommendations made by the hostess and was well worth it. We ordered the Paneer Tikka Masala and the Navratna Kurma and both were very delicious. The only issue besides the very outdated decor was they had loud music playing in two different languages one in the dining hall and the other coming from the kitchen which was louder which was very annoying. Overall satisfied with the food as that's what we went for.", "author": "Dev S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "We love this place. Wait staff is very friendly and food is great. Fantastic Indian for the price. We have already been here 3 times in the last month and will definitely come back soon.", "author": "Yasi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Best Indian restaurant I've EVER eaten at!! Everyone I meet who asks where to eat in San Francisco this is my favorite spot! Most consistent Indian restaurant I've ever been to. Staff is amazing, food is amazing, ambiance is perfect! I'd give 10 stars if I could!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "Portions were good. I ordered chicken tikka masala (chicken was a little dry), saag paneer (yummy), garlic naan (good), and eggplant fritters (loved the sauce). Overall, experience was okay but not my favorite in the neighborhood.", "author": "Robyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "Just got my postmates order and overall some things were delicious and others I wouldn't order again. I think the order may have been rushed as things could've been better. Examples; no silverware, no sauce for my samosas and no rice! They probably charge extra for it but this was a huge disappointment! How do you eat curry without rice??? \n\nAnywho...\n\n1. Chicken masala - 4/5 - the chicken was a little tough but the curry was absolutely silky & delicious! \n\n2. Saag Paneer - 4.5/5 - the cheese was cut into enormous steak-like chunks, they should be bite size. Overall the dish was incredibly tasty! \n\n3. Samosa - 3/5 - incredibly average samosas. I was really disappointed that they didn't include a sauce with my order. It definitely needed it as they were a little bland and nothing spectacular. Kudos for arriving hot and crispy though. \n\n4. Garlic Naan - 1/5 - probably the worst naan I've ever had! So disappointed! The dough was super chewy/almost raw, and had a very bitter taste to it. The garlic made it even worse. The whole bread was submerged in bright yellow garlic butter (normally I'm a fan) but it was just soggy. Also the garlic was cut into large raw chunks, and there was tons of it which rendered an even more unappetizing bitter, stringent taste. And this is coming from a garlic fan! Yuck! \n\nMaybe they are better when you dine in?", "author": "Tifany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "I really liked the old place. I mean, it wasn't all that good, and, even though they'd raised their prices, it was still a pretty good deal on the buffet. So, when I saw this new place, I was skeptical, but still willing to give it a try.\n\nThe food was delicious. We started with the baingan pakora. It was good for what it was, but I think I'd get the mixed vegetables. Our two entrees were spot on good. They vary the spiciness, but the mild/medium/spicy is still pretty subjective. I thought they did it appropriately - medium hit the range for my wife and me (max comfort for her, just enough to taste for me). We had laccha paratha and butter naan. The paratha was super wheaty, which was fit the bill for whole wheat. The naan was both fluffy *and* crispy.\n\nI went in dehydrated, so I was gulping down water, and the waiter was constantly running over to refill my water right on cue - attentive without hovering.\n\nWe'll definitely go back, and might be doing delivery or pick up.", "author": "masa s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Ate light lunch here during Fillmore Jazz Festival. Usually tough street parking in this area, but today we walked Fillmore area and decided to eat here. Service was very good. Food tasted very good. Nice decor of table cloths, napkins, and flower. Not too crowded today probably due to everyone eating festival food vendor offerings.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "I have been to almost every Indian restaurant in S.F. over the last 40 years. I think that I know good Indian food when I taste it. I tasted it at Royal Indian in its new location on Fillmore. First off everything looked fresh and clean. The walls had the same interesting artwork that was in the previous Indian restaurant there. Everything we tried was excellent. The samosas were stunning. The potato stuffing was mashed together with spices and peas, not lumps of potatoes as with some samosas.  The Tikka Chicken Kabob was perfectly done neither dry nor undercooked. The portions were very generous and the prices were very reasonable. \n\nMy one criticism would be that the sweet lassi wasn't sweet enough, but that is easily corrected.\n\nI rate this one of the best Indian restaurants I have ever been to and highly recommend it to anyone who loves to eat.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Photos via yelp; and reviews. Made ordering from here a simple choice, plus extra points for delivery options!!!!\nDelivery guy was very kind and called me upon his arrival. Food  was hot, containers were solid and clean. \nEverything was delicious! Check out the lamb vindaloo, fire!!!!!!!!!!", "author": "Bryan O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Update: downgraded to 1 star because got sick. Old review: Not great not terrible. Food lacked flavor. This is not going to satisfy your craving if you're craving Indian food and you're used to flavor & spi. The people who work there are lovely and it's a nice space, but we won't be going back.", "author": "Ruth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "My friend and I were craving some Indian food the other day and looked on Yelp for some inspiration when we found this place! For the appetizer, we had Papadum which is like a thin, crispy, biscuit accompanied with three yummy sauces. What really grabbed my attention was the Garlic Naan. Never really been a fan of naan but this Garlic Naan was sooo fresh and perfectly toasted, I got a little sad when I looked down and realized I had already finished it so quick. We decided to try the Lamb Shank and were so glad we did, thanks to the waiter for the awesome recommendation! It was super tender, moist, and the sauce was absolutely delicious. (10/10 would recommend!) For dessert, we ordered Rice Pudding and it wasn't the jello-like substance I was expecting but it was really good and definitely satisfied my sweet tooth :)\n\nIn addition to good quality food and service, the ambiance was also great. Some restaurants either have super loud music playing or obnoxious bright lights, but I noticed that this place had a nice, dim lighting configuration and soft music playing in the background. (Perfect place to bring a date!)\n\nDefinitely coming back for round 2.", "author": "Ashley O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Great Indian spice!  This place is exactly what I expect in delicious ethnic food.  After taking a seat I this quaint restaurant the waiter recommended 2 dishes Chicken Marsala & Lamb something.  Both were medium to heavy spice & we added rice & garlic nan.  I mean, why not!  My 10 yr old & I loved it!  Recommend u stop by soon!  21% tip!", "author": "Dave S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-15", "description": "Chicken Tikka Kebab: The portion was generous, however the chicken was dry and had no flavor. The menu claimed it is marinated- it clearly had not been.\n\nBaigan Bharta (eggplant curry): Too oily. Did not have peas as promised in the menu. Flavor was OK.\n\nSaag Paneer: Too oily. Good flavor though.\n\nKabuli Naan: Good flavor, however for $4 it was too small. Other than the pink, shredded coconut, you couldn't taste or see any of the other ingredients it was supposed to have.\n\nSamosas: Crispy and chewy- I think they use a little cornstarch in the dough. Filling was flavorful.\n\nVegetarian Momos: The filling was unremarkable- some kind of green paste with no defining flavor. The dough was some kind of thin, translucent rice paper or cornstarch mixture- not at all what you expect from momos. The skins dried out almost immediately. They try to mitigate this by brushing them in oil- yuck.\n\nService was polite and the decor/ambiance pleasant. Would not return for the food though.", "author": "Gene G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "I noticed this new spot had multiple 5 star reviews and decided to try it out. Noticed some Yelpers were doubting all the positive feedback. This just made me more curious, and hungry! Sometimes you just need to see for yourself. \n\nStarted with a Papadum appetizer, which is like a big cracker with 3 dipping sauces. We also had the Garlic Naan which was so fresh and delicious,....I could eat it all day.\n\nFor entrees, I asked the waiter to recommend something with chicken and he suggested the Chicken Chilli, which I had never had before. It was a solid choice and I'd surely get it again.\n\nI was craving lamb so we got the Lamb Shank. It was tender and moist and I loved the flavor of the marinade, it really hit the spot!\n\nFor dessert, we had Rice pudding.\n\n***At the end of the meal, we saw another couple had ordered Tandoori. They brought it out on a sizzling platter, filling the place with an intoxicating aroma,....Oh God. Even though I was full, it smelled so good that I vowed to order it when we return, which we will! \n\nNo question, easy 5 stars.", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Most of the reviews are fake for sure, but I liked it, especially the missi roti (chick pea bread). Also solid were the butter chicken and daal saag. I'd return!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "My friend wanted to go here and I must say I was dragging my feet trying to convince him otherwise. Boy am I glad I'm not such a great convincer because the food was really good. We got the samosa, chicken tikka masala and butter chicken masala. Everything was really good and the service was amazing. They were on top of their service. Their heat level was very low. We got the spicy and the guy kept warning us and asking are we sure. We got it and tried it we all agreed it was mild at best. Great food, amazing service!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-26", "description": "We were very disappointed by the quality of the dining experience here, especially after seeing so many glowing reviews.  Just don't get it.  The food was very mediocre, not particularly well seasoned and very salty.\n\nThe prices were good for SF and the servers were friendly, but that's about it.\n\nIf you're in the neighborhood and craving Indian food, I would suggest nearby Dosa instead.", "author": "Jane D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "A-OK. I ordered delivery on the night of the Oscars, so I can't speak to the staff or ambiance. The food came way late, which was to be expected on that night. I give it 3 stars, because I ordered the dishes I would usually get at other Nepalese restaurants and in comparison they were tasteless.", "author": "Adriana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Did take out from here last night. I had the Chicken Korma, basmati rice and naan bread. The Korma was delicious. I got it medium to mild spicy and although I could have done spicier I liked the mild kick with the sweet raisins. The chicken was dark meat and was moist and flavor full. The rice was good although I can't think of words to describe rice. I guess good is the best I can do.. The naan bread was different than any naan I have ever had. It was flat and sort of doughy. I thought it could have used some salt and overall was kind of tasteless although good when dipped in the sauce. \nAs I sat there and waited from my order, the staff was very welcoming and offer a cup of chai that was very tasty and not overly sweet. \nIf I am at a hotel near the Royal Indian I will definitely be back. My mouth is already watering for more Chicken Korma", "author": "Linda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Awesome!!!  Great food, Great location and customer service.\nI am a huge fan of indian food so when i saw a new one i had to try it. What's even better about this place is  that along with indian dishes it has small but  great selection of himalayan food (nepalese food). \nThere are plenty of vegetarian and vegan options here.Its not that pricey and the food portion is just right. Will be taking my family and friends there next time.", "author": "Sub N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "This restaurant certainly earned its 5 star rating! We came in around 6pm on a Thursday and we're seated immediately. For starters, we ordered the samosas and vegetable momo. The samosas were incredibly flavorful and cooked to perfection. The momos had a nice mix of flavors and spicy sauce on the side. We also ordered vegetable tikka masala, which was creamy and full of vegetables. To finish the meal we got an order of garlic naan, which was fresh, warm and covered in delicious garlic. Will definitely return to try more of what the menu has to offer!", "author": "Mary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "We haven't been in to the restaurant, but our delivery is always early, accurate, and delicious. Excellent amount of spice at every level (mild to very spicy) and large portions--one order of Naan is usually enough for two. The meat has always been good quality and I love their chutneys. Maybe the tastiest Indian food we've had the pleasure of ordering in the city (and with a health score rating that doesn't make me second guess my sanity!). Delivery guy is always pleasant to top it off.", "author": "P D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Nice and friendly service. \nFood is amazing - If you don't know about Indian food well, don't hesitate just ask them. They will explain all the details and find your perfect meals for you.", "author": "Soran R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Try this it's really delicious \n1. Chicken tikka masala\n2. Chicken Momo\nI expected my delivery for one hour but I got delivered hot by 30 minutes of my order, awesome!!!", "author": "Asif R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-02", "description": "Three stars for the food but two for the biased experience we had the other night here.\n\nWe walked in around 6:30 and we were immediately seated at a small table for two. There were already two tables present there, a table of one and a table of two. They have around 10 tables, with two small ones. We got seated at one of those. Then three more tables of two came in and they seated at a the big ones, one of the three couples were even sat at a big table of six. \n\nAt that moment I realized how biased my own people could be. Most of their customers are \"American\" and that is who they cater to. They are not very expensive with each dish priced at between ten to fifteen dollars. Our bill was sixty bucks. \n\nJust because of that I will not be back.", "author": "Lovejit K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "This was a delivery through Yelp's Eat 24 app.\n\nAfter a problem, the restaurant called me and very politely apologised and offered me a refund and explained it was an interim chef (I can believe it as i've had a good meal there before). A very good gesture. I've updated my review to 4 stars for that customer service. I will try them again next week and may completely re-write this review depending on how happy it makes my belly.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This should be a place to go restaurant for the locals and visitors in the area. They changed the ambiance of previous establishment with upgrade in whatnot. Very comfortable seating arrangement and very homely service, not a foppy so-called professional palace service. \n\nThe food is very flavorful with perfect texture of spices and ingredients. \n\nWe tried \nAchare chicken - mouth watering taste\nAloo Gobi - very fresh\nButter Chicken- very rich\nChicken vindaloo - spicy tasty\nNaans- hot and crispy\nCumin rice - aromic delight.\n\nI already tried 2 times. I will definitely go back next time soon as it is my place to go restaurant.", "author": "Laxman A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "I love mutter/matar paneer. I've eaten it at many, many restaurants and often make it at home. Royal Indian Cuisine's matar paneer was a huge disappointment. I usually get medium but decided to go for mild, but the dish that I was served had not the slightest hint of a kick. In fact, it tasted like they'd forgotten spices in general. There was such a lack of flavor that it mostly tasted like peas and the oil in the paneer cubes (they were fried, which is a bit unusual in my experience). The consistency was more like soup. I ended up taking it home and adding a lot of chana masala and a bit of hot ground red pepper to make it enjoyable. The other things we ordered were okay, but not amazing, so I really don't understand how this place currently has 4.5 stars. Sadly, our experience was not worth the second dollar sign it cost.", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Originally planned to go to DOSA but it was closed for lunch. That is when we decided to try out this little gem.\n\nInteriors were nice and clean. We got the vegetarian thali which was basically a three course meal for two. It consisted of samosas for starter, followed by Saag paneer and Dal makhani served with butter naan and rice. I loved the kheer for desert. Would recommend. Also got sweet lassi which was ok.\n\nOverall good service and solid food at a decent price point (under $50 for 2)", "author": "Nishith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Great Indian delivery! Order was right on time and cooked exactly how I asked. Love how they have 5 different spicyness levels for their food, I got the hottest and it was great. Also the side of garlic naan is a huge amount of naan. Not from SF but would definitely order again!", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "This in my new favorite Indian place! I live in the Richmond and Indian cuisine isn't very popular there, so my girlfriend and I went to try this newly renovated restaurant and we were impressed!\nWe had butter chicken and veggie biryani, our go-to Indian dishes, and both were cooked well and tasted delicious. The Naan was nice and soft but crispy on the edges like it should be. The ambience was also great as it was well decorated from inside, but I wish they had a more welcoming sign outside instead of the old one.", "author": "Abdul H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Great food, good value for money, very friendly waiter....don't give this place a miss if you are in San Fran", "author": "Tony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Excellent malai kofta, great bread, and friendly service. I was dining alone, that night, and the staff didn't give me any attitude, or try to sit me at the worst table. I can't wait to go back to try other dishes!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "We were very pleasantly surprised with the quality of food. The chicken was tender, the sauce was quite flavorful, and the naan was deliciously chewy. The rice was also done very well, and wasn't a distraction to the meal. The service is great, I was treated very warmly and when my initial order seemed to be less than ideal, it was promptly replaced. \n\nBe warned that the \"mild\" sauce is quite spicy, so unless you have a high tolerance, I wouldn't recommend anything spicier.\n\nI am sure that the first order I had was a fluke. 5 stars all around.", "author": "James P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-16", "description": "Ordered delivery because it was new and had good ratings. Naan was horrible and flat, more like roti. Chicken tikka masala had way too much cream and no flavor. The chicken momos were ok (but Red Chili is way better). The samosas were soggy. Lamb biryani was fine.\nAll of the chutneys were watered down. Super disappointing.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Another great Indian restaurant in San Francisco. I and my girlfriend went there for Friday night dinner. We only had to wait 15 mins. We ordered chicken momo which was juicy and delicious. Garlic naan was long and big, rice was okay. Chicken tikka masala was very flavorful and rich in taste. Welcoming customer service. Definitely recommend. Tried their delivery service fast,\nPrompt and accurate.", "author": "Steve W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-08", "description": "Everything was ok-ish, but had the slightly off flavors that commercially pre-prepared meals have, like Sukhi's gourmet meals. I was really tempted to walk into the kitchen and see whether they're using mostly brought-in pre-prepared food, or are actually making things from scratch. I have a strong suspicion that it's the former, though I have no concrete evidence. I wish I could be more positive because the staff was extremely nice and welcoming.\n\nI lived in NYC (8 years) and near London (11 years), and while there were many mediocre Punjabi-centric restaurants in both cities, I've been to some truly extraordinary ones. Sadly, this restaurant is nowhere near a five-star experience.", "author": "Geoff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "Great food, Delicious with full of flavors, atmosphere and ambience was wonderful!  The garlic nan is one of the best along with navratan Korma. Giving only 4 stars since the service was very slow, not sure if it was because of Thanksgiving day. But overall a great restaraunt. The nans are bigger than other places and momos is a must try.", "author": "pallavi g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "Went here excited for a new location that opened up in the neighborhood poor service , cold papadum and we didn't even get our beer when complaint the waiter dint even say sorry I would not recommend this place to anyone ironically I am indian and felt that the service was marginalized", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Coming in, I was wondering how can a place have so many 5 stars. Am now convinced that this places deserves it's unanimous MVP rating. Tried the momos, dal soup, navratan korma, baingan bartha, missi roti, pudina parata, and lacha parata. Service is excellent.", "author": "Karthik G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Went for a business dinner meal and everything we ordered was to our liking! Chicken Tandoori, Lamb Vindaloo, vegetable salad, samosas, and rice/naan were all cooked perfectly and order accuracy was impressive! We were delighted with the food taste and variety of options which satisfied our entire party's appetite! If you're looking for a warm and inviting atmosphere to enjoy some Indian cuisine, this place will meet your needs!", "author": "Abel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Nicely decorated. Tandoori chicken was flavorful and fresh. Samosa and Chana-pretty good. Can't say the same for the basmati rice as it had a funny taste. Not a big deal as it was just a side order of white rice.", "author": "Betty D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "What more do you want? Fairly cheap, food comes out fast, great service and consistently delicious! A++", "author": "James A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-04", "description": "Ordered for delivery based upon the reviews but food was just not worth the wait...\n\nTandoori chicken came covered in sauce - in other words 'wet' and covered with cooked onions, etc. Great for a stewed chicken but not what I expected - and of course it was not 'spicy' as I had requested...\n\nLamb biryani was dry, and seasoned with cloves... Let me tell you, after crunching down on a couple of those you get very timid about your next bite! The dish had the appearance of having been thrown together from just rice and some precooked lamb pieces, not prepared together.\n\nI picked up some seasoned rice that was better. A small portion of cumin and turmeric seasoned basmati - not exactly the typical saffron rice one might be used to.\n\nI tried a couple of breads - paratha and a buttered naan that were nice. But the order did not include the advertised \"2 free papadums\"...\n\nOverall I'd rather drive to Pakwan in the Tenderloin for a more authentic and satisfying meal. Not going to order from these guys again...", "author": "Leake L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "I eat here regularly because I live in the neighborhood. It's pretty decent. The only thing I don't like about this place is the inconsistency with the spicy-ness level. I had a different server than usual today and the food came out not spicy at all. I was super disappointed about this because I love spicy food. It is half the reason why I went here today. But the food came waaaay below what I'd even consider \"mild\". In the past I've asked for spicy, medium spicy, very spicy etc ... sometimes you get what you ask for sometimes it's the least spicy Indian food you've ever had :(. Such a bummer.", "author": "Uriae W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Samosa are bomb!! Curries bomb!! Lamb is bomb! I'm from hawaii and we only have one good Indian restaurant so while we were in SF it was on my priority list to get good Indian food and this place definitely hit the spot.", "author": "Mikela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Amazing Indian food with free delivery! Have eaten here at least 5 times, trying different dishes, and never had a dish I didn't like. Keep the great food coming!", "author": "Marina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "This place is a hidden gem.  I live a half a block away and this somehow flew under my radar for two years.  So happy we found it.  \n\nThe food is simply great.  The vegetable momas and any type of vindaloo are incredibly flavorful.  \n\nBonus: we can get takeout - 2 entrees and an appetizer for less than $40.  \n\nHope this place never leaves.", "author": "Shawn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "This is tooo good taste \n\nI like momos they r to good and stuff inside momo r perfect \n\nAnd the chicken tandoori mix is good every piece is like well marinated \n\nThe chef is too good in presentation of dish and flavors are so perfect and mild \n\n\nto good \n\nThis is for chef ‍", "author": "Kunal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Yummy food. I do miss the buffet that was here before but I love the food at this place more. The baighan bharta (eggplant) dish, the chicken curry and the saag paneer were delicious and perfectly seasoned. Loved the garlic naan as well. One of the best Indian places that I've been too.", "author": "Reena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "This place is under new management.  It does not have the buffet anymore but they really beautified the establishment with new chairs and decor..  Its really nice and intimate. My wife and i ordered the butter chicken masala and vegetarian mushroom Matar. It was perfectly cooked fresh.  It was not too spicy and the sauce was savory with sweet tomatoe undertones... Kabuli naan was pretty good too.", "author": "Allen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Highly recommended\n- Great vegan options. If it's not a default vegan dish, chances are they're glad to make it vegan for you. Which leads me to...\n- Very nice crew. I've been twice now with friends and they remembered us. Both times we felt super welcome. Patient when going through the menu and helpful when trying to understand options.\n- Super reasonable pricing, even with wine.\n- Spice level is \n\nJust go.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "The first thing we loved about this place was good and kind service. The restaurant was in quite place though in the middle of busy downtown. A cool place to hang out with friends. Food was satisfactory too and in reasonable price.", "author": "Subai T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Don't look any further if you want quality Indian food! This place is definitely the best Indian cuisine in SF and I'm very picky when it comes to Indian food. I have it delivered through Eat24 at least once every couple weeks and they never disappoint. Keep up the great work over there and thank you for always being consistent.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "I really wanted to like this place, but was disappointed in the food. Coconut chicken and tikka masala were both average. Saag paneer was the best of the three. Little Delhi, which is now temporarily closed has much much better food.", "author": "Q Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "The best Indian restaurant we'hv ever been to , great service and the food was to delicious chicken tika masala , garlic bread, chicken momo were the best we'hv \nDefinitely be back \nThank you", "author": "Bharat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Had a lot of Indian food. This is the best. The malai kofta and kabuli naan are particularly delicious, as is the kebab.", "author": "Lane E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Good service and overall atmosphere of the restaurant. I ordered the Chicken Saag in mild spiciness and it was delicious, but it was much spicier than what I wanted to order.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "I love this place. Been here multiple times for takeout and they never fail to impress! The portions are big, prices are right, and food is delicious! I love their chicken korma the most, it's so sweet and savory. I have tried a bunch of their other dishes and each time I want to come back again. I've been trying to find a good Indian restaurant for a long long time and I finally found my go to spot!!!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Another great place for Indian food \"Royal Indian cuisine\" located exactly at Fillmore st between post st and sutter st has won my heart with its great taste and rich flavors. Lamb Rogan josh, Serrano naan, Jeera rice, with a glass of red wine. Perfect evening. Prices are ok, service is swift. I'll go again. Thank you Royal.", "author": "Feroz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Delicious....chichen curry was tender, aromatic and spicy. Appetizers were scrumptious. Will be going back. Thankyou for opening up a new indian restaurant in auburn.", "author": "Allison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "So awesome to live close to this place! The garlic naan and butter chicken masala are really good. The renovation this place just completed under new management makes for a brighter experience that is a step above the previous buffet style that it replaced. Highly recommended.", "author": "Brian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Took my parents to this place. The food tasted really good but the quantity was a bit less.", "author": "Suhani N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Our new favorite Indian food spot! So delicious, good flavor, unique dishes, and well made classics. My usual spot Aroma in Benicia CA has competition here in SF! Highly recommended. The staff was friendly, attentive, and answered all my questions.", "author": "Chris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "My family and I were supposed to dine in at Curry Leaf on Columbus because it has high reviews but when we got there the wait was long and it was getting late for dinner.\n\nI searched for another Indian restaurant and came across Royal Indian Cuisine along Fillmore street with 5 stars review. I called the place and the person who answered was very friendly and told me that they have table available. \n\n When we got there, there were 2 people ahead of us. When the table for 6 became available they offered us if we don't mind to sit with the 2 people ahead of us but we decided to wait for a different table. \n\nWhen we got seated we placed our order (chicken tandoori and lamb biryani and samosa for appetizer). Omg, their food is very good. The staff are very friendly and we didn't wait that very long for our food to be served. I highly recommend this  restaurant if you're in the mood for Indian, Himalayan and Nepalese cuisine. \n\nWe will definitely come back to this place next we visit San Francisco.", "author": "Thea G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "The menu has most of the Indian restaurant food you may expect. But I have to say, it was WAY MORE TASTY than I expected. And at great prices, too. Feels like a really good neighborhood restaurant. Friendly service as well.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Just on a weekend getaway from LA, loved the food in this small, quaint Indian Restaurant. All the dishes were tasty, well prepared. Good attentive service. Ambiance is cozy. Will come back when we come back for another getaway to SF.", "author": "Katherine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Possibly best Indian food I've ever had. Inexpensive for anywhere but especially for San Francisco, fast service. I had samosas, lamb curry, and chicken korma, and all were perfect. The lamb was so tender I could smash it with a fork with no effort.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "A good place to grab food. It can get really spicy !  Me and my wife love it! Definitely, we recommend this place!", "author": "Sergio R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Value for money and many choices on the menu. While food is not wow, its not bad for what you pay. I loved their naan and dal makhni which was above average", "author": "Abinash S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "I cannot say enough good things about Royal. My boyfriend and I came in last night (no reservations) and had a 5 star experience. The service was great, the people were lovely, and the food was AMAZING. I've lived in the city about a year and this is by far the best Indian food I've had - way better than Dosa and at a fraction of the price. Definitely will be back - found my new favorite SF restaurant. Do yourself a favor and go!", "author": "Heather F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "First time ordering from this place and we are just simply impressed with not only the awesome food but the quick delivery as well. We ordered the chicken tikka masala, vegan vegetable curry, rice, garlic naan, and last but not least the vegetable momos(dumplings filled w/love) all of which arrived hot! Will definitely order again! Momos all day everyday...", "author": "Ray N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "I ordered delivery tonight -- chicken tikka masala, aloo gobi, plain naan and rice. The food was fresh and tasty. I will definitely order from this place again!", "author": "Esther L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Really clean and bright atmosphere when you walk in. The staff is super nice and the food is amazing. Their mango lassi's are delicious and the chicken tikka masala is to die for. It's a perfect location on Fillmore. Definitely a place I will come back to.", "author": "Leah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "You step in the door and you are met with the smell of wonderful spices and herbs. You are immediately hungry and excited all at once. The servers are gracious and attentive. The white table cloth and nice portions are perfect for a meal. The curry I ordered was flavorful and creamy. Perfect. Considering what you get for the price, it's fantastic.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "When looking for a place to eat before show at the Fillmore we saw that this place had five stars. And it earned its five stars! \n\nWe ordered the chicken tikka masala and the tandoori chicken. You do have to order rice and naan separately, but the prices are very reasonable. The chicken tikka masala had a  deliciously creamy sauce. The tandoori chicken arrived sizzling on a cast iron plate and stayed warm throughout the meal. The ambiance feels like you are at a dinner party in someone's living room, and the service was perfectly attentive. We will be back for more!", "author": "Amy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Decided to try this place out because I was craving some good Indian food.some Indian friends recommended this place and I was more then pleasad.amazing food,great service,definitely we will be back.", "author": "Somnath R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Split the Vegetarian Thali for 2 with a side of chicken biryani. Of the 5 Indian places in the city I've tried it has been by far the best. Ordering our meal \"spicy\" actually resulted in spicy food. The daal makhani and the biryani were standout. It's not the best I've ever had, but the the best I've had in SF. Will definitely return.", "author": "R M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "Food was above average but service was really bad. I went there with my friend, we were having such a good time and thn this Indian lady comes to take our order with really bad attitude. I think she was having a horrible day but it spoiled our mood. And her attitude was like that for the entire time we were there. Other employees were good. But I AM NOT GOING THERE AGAIN.", "author": "Rush S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "We visited Royal Indian Cuisine when we came to San Fran to catch a show at the Fillmore, just a few blocks away. We enjoyed our meal.", "author": "Tami S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Excellent food.  Nice restaurant and clean.  The coconut naan bread was so good.  Definitely want to return.", "author": "Barbara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "I and a group of friends visited here on a Sunday afternoon. It was well occupied but I didn't feel crowded & service was quick. We ordered a chicken tikka masala, saag paneer over rice, and I was immensely satisfied after my meal. The menu was thorough, and I plan to venture back soon to explore more of their curries. Ooh, and the samosas at a nearby table caught my eye.", "author": "Jake P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Excellent food and service. We ordered 8 different items and everything was fantastic. The tandoori chicken was tasty and moist. The chai tea is also recommended.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "Just ordered delivery from here for the first time last night. Everything we ordered was spot on. Not the best I've ever had but the best I've had in SF for a long time. Delivery was on time, all there and well organized.", "author": "Daniel E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "This is just for the chicken momos! 4.5 *s Went for a solo lunch in the city, being Nepali myself was craving some momos and figured would check this new place out! Served in bamboo containers, the Momo was delicious and the sauce was authentic! Was hoping for greasiness that tends to be the case with most momos in the Bay Area but was delighted that it was light and fresh. Will be back :)", "author": "Mo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Probably the best place to eat at san Francisco.  Wish they were in new york or jersey!", "author": "Rahul S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-05", "description": "Two stars for a nice atmosphere and decent service however the food here is just not good at all. Their naan is literally flour and tastes terrible and their tikka masala was extremely bland. Their shrimp bryani was extremely wet and wasn't great. Honestly overall, this was the worst indian food I've ever had. Please keep in mind however that I have many close india friends who take me to really good indian food in San Jose so I am an indian food snob but this place is really just subpar.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "The Indian food is good here and not spiced up to the point of fiery heartburn-inducing unkind. The waiters were very attentive and I enjoyed all the dishes we ordered. We got free chai refills (I think) and a free dessert. I've never had Indian-style dumplings (momo?) but they were quite tasty and a must order. This place was packed on a Sunday night.", "author": "W A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Great food, friendly service. It is tasty, I am a vegetarian, and they have a lot of vegetarian options, and a few vegan options.", "author": "Uka U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Really good. Best Indian I've had in a while. Friendly service, nice ambiance. Skip dosa-come here!", "author": "Reham A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "I went here for the first time with a party of 10 and the staff was really great! It was a seamless experience and the food was fresh and hot. The restaurant did a really great job catering our needs! Definitely one of the better Indian restaurants in the city!", "author": "Manvi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "Okra and naan were amazing. Tikka masala, baingan bharta and malai kofta were mediocre. Too creamy for me. Would definitely come back for the okra though!", "author": "Kendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "The Royal Thali dinner was a fantastic deal and filled us up with leftovers for tomorrow. The variety of this dinner for 2 was great:  tikka masala was extremely flavorful as was the rice pudding. Fluffy naan, great service and no wait. We will definitely be back!", "author": "Abby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "It's is one of the best restaurant in town I was there last night chicken saag , butter chicken veg & naan was amazing they did add acid in food .", "author": "Jigna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Best indian food so far ! Food is delicious not too heavy and service is awesome ! Definitely will come back", "author": "Ko O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Great deal for this neighborhood. Nice place for a Friday night dinner. Excellent service, nice relaxed atmosphere. And overall good food.", "author": "Sara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "We had the pleasure of eating at royal indian cuisine a few weeks ago and I wanted to review it immediately but life got in the way! I  can not say enough good things about this little restaurant. We will be regulars once back home in SF. Being vegetarians we eat Indian food all over the world and Royal Indian Cuisine is our new favorite.The naan is amazing, Saag Paneer was fantastic and the other dishes were all delicious, not greasy as a lot of Indian food can be and perfectly spiced. AJ the owner was so warm and welcoming. He introduced himself and made us feel like we had been valued customers for years instead of walk ins. You can have your fancy trendy places for party nights,but if you want a delicious meal with an intimate atmosphere where you can hear the people you are dining with, this should be your go to restaurant.", "author": "D C A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Butter chicken and Kadai chicken are delicious! Ordered them twice and they were good both times. Good delivery service, once they reached early! 5/5", "author": "Thejas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "This place is amazing!! Excellent service, the staff are so friendly. Very clean. The food is fantastic - their tikka masala is the perfect comfort food!!", "author": "Mollie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "This is my first time writing a review and that shows how good this place is. Great prices and large portions. Hands down the best restaurant in San Francisco. Not just the best Indian restaurant. The best restaurant.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Absolutely love this place. Have been coming once a week since they opened and their chicken tandoori is the best I have ever had. Friendly people and overall a great find!", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Live around the corner from this spot.After new renovation Me and my friend went there last night  for dinner. Seriously delicious .we order bunch of stop. Chicken tikka masala samosa garlic naan basmati rice. Seriously delicious yummy food great services. I wish this restaurant will Seattle  so I could eat here regularly !!!!\nThank you Royal Indian cuisine for delicious food we will see again", "author": "Khem G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "My husband and I order from this incredibly delicious restaurant almost every week, and we could not be more pleased.  Everything we've ordered from this establishment has been flavorful, and I enjoy that we can choose the spice levels since I prefer more kick.  We've been trying all their tasty breads and have successfully discovered our favorite in the keema naan.  The chicken tikka masala is extraordinary, filled with large chunks of white meat chicken garnished with a rich spicy sauce.  Kudos to the chicken curry as and lamb korma as well!  Portions are generous, so we are able to have two meals from one delivery.  All the staff are dependable and courteous, and delivery is prompt.  Our favorite Indian restaurant!", "author": "Laurie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "It takes a lot to get me to review, and this place KILLED IT! We ordered vegetable pankora for an app, chicken tikka massla and chicken vindaloo for entries and we couldn't be more impressed. Add this to fantastic service you got one of the best Indian spots around. Check it out", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "The food was EXCELLENT ...we got exactly what we ordered....and very quickly.  Easy online ordering too. One tip...we ordered to our hotel room and they didn't include cutlery or plates. We were at a loss when the (motel) couldn't help either.  We had to call back and wait for them to come back with utensils.", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Great little Indian place with tasty curries and good naans. Service can be a bit slow but if you're not in a rush then this is a good spot.", "author": "Hannah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Excellent food. Excellent service. That's all that needs to be said! It's a quaint little restaurant in the middle of a quaint little neighborhood.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "there's just something about this place, we came here on a busy saturday noon, ample parking available all around, an aquarium to visit after \n\nfood is so good, so is the service and worth every dollar!", "author": "Awani M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "Good food. I ordered the Chicken tikka masala and was content with the amount of meat. The sauce was also sweet.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Wow, what a find. My daughter lives on this block, and my husband and I stopped in for a mid afternoon dinner/lunch. Unbelievable. I knew it was under new management..you really need to try this place. I ordered a glass of wine and got an incredibly generous pour of a sauvignon blanc. The chicken korma was beyond, and the garlic naan was so fresh and hot we wanted a second one. My husband loves okra so we had the masala bhindi and it made me an okra fan. They start with papadam and chutnies, and the Samosa was piping hot and good also. We'll be back for sure.", "author": "Lisa M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "i had a good experience in this new indian restaurant. the food was tasty, fresh and great value of price , service was excellet.i highly recommend to dine here once. thanks to the royal family", "author": "Sha C R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "I used to come here all the time before the remodel/new ownership, even though I didn't live in SF.  I moved down the street, and really wanted the great quality quick buffet, I remembered, so fondly.  It looked scratchy but the food was amazing for the price.  I'm pretty sad, that not only is that no longer available, but the prices have dramatically increased.  Now it's just like any other mainstream Indian Restaurant, and I'm not impressed.  The chickpea nan sounded awesome.  It was dry, and hard to eat, even after dipped in the curry.  Lamb Saag was just okay.  Lower Pac Heights prices, but average food.  I'll be pursuing new Indian locations, that have food that is worth the pricing.  I gave what was left, to a homeless guy around the corner, so it would go to someone, who would actually eat the leftovers.", "author": "Kitty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Recently opened Restaurant at Fillmore! Really surprised to taste an extra flavor of food which has awesome taste! Naturally yummy, of course once is not enough!  Thank you Royal Indian, You are the best!", "author": "Bhuwan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "I wasn't going to leave a review since this place is new, but the food destroyed my stomach, and not in the good way that Indian food normally destroys one's stomach. The food was meh. Entirely possible I just had a bad experience and this place is in fact excellent. Just avoid the chicken vindaloo perhaps.", "author": "B H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "This place is fantastic. I live in the neighborhood and it's my new go-to Indian place. Love it, and the servers/staff are very nice too!", "author": "M J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-12", "description": "Food was ok but we had to wait over an hour to be seated and given our food. It surprised me because it was 8:40 at night. I will not come back because they also took 18 percent gratuity which was unfair since they took so long to bring the food.", "author": "Tanvi W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "Ordered delivery. They were quicker than estimated so that's a plus but the food was really mediocre. Everything was very bland or super spicy. The egg fried rice was incredibly dry. I gave this place a try based on all the good yelp reviews but prob won't be going back.", "author": "Saikat P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Delicious! Good service. Recently reopened and is excellent. If you ask for spicy you will get it.", "author": "Joel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Live in the neighborhood and pass this place frequently.  With all the restaurants on Fillmore, I just never got around to trying it.  My loss.  Finally went for the first time today.  Charming decor and pleasant ambiance, very attractive table service.  My companion, a vegetarian, had quite a long selection of vegetarian dishes to choose from.  He ordered samosas and the vegetable momo, a Nepali dish very like light steamed dumplings.  He loved the spice combinations in both the samosa filling and the momo.  I ordered the vegetable soup and the Kashmiri chicken.  The soup was spicy and very tasty.  Since I hadn't been here before, I decided discretion was the better part of valor and ordered the spice level on the chicken \"mild.\"  It was a delicious  dish but even for my timid taste buds it could have been spicier.  Will definitely ordered \"medium\" spicy next time and there certainly will be a next time.  For me the servings were generous and I took about half the chicken dish home in a box.  One caveat, service was slow.  We were in no hurry and felt the dishes were prepared to order and not just dished up from a steam table.  Therefore, it was worth the wait.", "author": "Claire L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Was conflicted between giving 4 or 5 stars, and perhaps we can chalk this up to my low expectations when I ordered, I am going to be generous. Saffron Grill has gone downhill these days, it used to be my go to place. So I was really hoping for a new place to pop up, but anytime you see a crazy number of 5-star reviews by a predominantly newbie crowd, you tend to be suspicious, as I was. But the chicken tikka masala was pretty decent, the bhindi masala good, and the saag paneer passed my wife's saag paneer test. Don't get me wrong, I am grading on a curve here..but expectations exceeded, so will order again. If the quality drops, I reserve the right to reconsider my generosity.", "author": "Gibu T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Tried this place on a recommendation fob my optometrist a block away.  Used to be a buffet which I never would eat at. The new ownership is the best thing as the  improvement of white table cloths,  great service & most importantly the food is good! Service was  gracious and attentive.  I wish them the best.  SF can always use more great Indian cuisine. I'll be back!", "author": "Graciela P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "I will give it  4 stars,since taken over they got rid of Bollywood tv,which is good,they still play indian music which is not too bad,the service was quick and friendly,i got lamb biryani  I would have liked it a bit less spicey,i asked for it mild,the lamb was nice but they could have had some more pieces,the biryani was a bit wet,im used to England biryani were it more dry,i would probably avoid it next time as they make it very sweet,i might buy it and share it but would not buy it on my own,prices seem very high,not as high the place down the road but still high,plain nan bread was big and nice its called butter nan,they gave out a free popodom at start,it was busy and people seemed to enjoy the meals,iwould go back but probably not for biryani", "author": "cc c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Ordered delivery - service was quick, food was delicious, and the spice level was perfect!", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "This is the best Indian food in the world. I have no complaints. The naan is amazing and they are super friendly.", "author": "Ethan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "What a wonderful surprise.....there was another Indian restaurant here but when we thought we were going to that one we walked into Royal Indian and immediately knew it was different and much more attractive. The food was really really good and the service very pleasant and timely. The tandoori shrimp was the best I have had, even in England. Can't recommend this place enough......try it you won't be sorry.", "author": "Barbara D."}
