{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-30", "description": "This place gives you the most bang for your buck! I always stick to my usual, which is the chicken and shrimp over rice. It just has everything I'd ever want in my meal: rice, protein, and veggies. Such a balanced meal right? Last time I came here when it was just about to close (maybe 20 minutes from closing time) and I noticed that the cook had placed burnt veggies on my plate, of course you won't notice it after he placed the chicken on top, but since I was watching him the whole time, I definitely noticed. \n\nI don't think this will stop me from coming here because they're food really is delicious!", "author": "Nenette T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-16", "description": "TL;DR : Don't get anything other than the chicken teriyaki , especially the shrimp, unless you like half cooked shrimp\n\nGo here once in a blue moon because I've run out of ideas for lunch. Just a piece of advice: just get the chicken teriyaki and rice (steamed, brown, fried rice, whatever you prefer). Everything else is not worth it. \n\nI usually go for the chicken teriyaki and fried rice but I ordered their \"daily special\" which was chicken and shrimp teriyaki with steamed rice. My mistake? thinking the shrimp would be all right. They literally only cooked one side of my shrimp. They didn't even pay attention to cooking it; it was just at the very side of the grill, being \"cooked.\" \n\nTook awhile but the other chef (the one not cooking the piles of chicken) finally returned, put a little bit of teriyaki sauce, tossed my shrimp once or twice to mix it with the sauce and then proceeded to put it in my to-go box. Like??? We can see everything you're doing, and the shrimp was not cooked. One side was overcooked and the other side practically just came out of the sea. I get that i'm not paying a lot of money here for some sub-par food, but the least they could do was cook the shrimp a little longer. disgusting. I got my food and took all the shrimp out. did not eat the shrimp. cut most of them in half and proved to myself that the shrimp was indeed not fully cooked.", "author": "Athena P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-30", "description": "So, I understand that a full-fledged Japanese restaurant is too much to expect from this place, but their menu is limiting, and their policies regarding substitutions or modifying the courses are far too rigid. They don't allow any real changes to their preset format, which means wasting a bunch of money on 3/4 of a bento box I won't eat. \n\nI've never seen a Japanese salad without dressing. This was disappointing, and I've never heard of a Japanese restaurant that only serves single pieces of shrimp as an order of tempura. They don't offer any vegetable tempura, so the menu is far short of adequate. \n\nTheir staff barely speaks English, so it was a headache trying to explain to them why I didn't want my chicken and rice cross-contaminated with wasabi. (I loathe wasabi.) Anyhow, it took me years to forget my last poor experience here, so I'm sure it won't be anytime within the next few years that I'm back here. \n\nIf you want Japanese food, definitely go elsewhere, and if you like options, forget this place, but if you like poor customer service and limited options, this may be your place.", "author": "dAvid s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-31", "description": "I came Monday 10/29/18 around 4pm. Not many people there, one person infront of me. I ordered beef plate w/noodle for togo $9.75. I like the way the restaurant designed to let customers see the process the chefs cook. When my order ready to pick up, the chef will call out the food name.  I asked, is that mine. He starred at me and said yes. So I took it, didn't open the box and left.  When I had a chance to open the box , all I see was a bunch of over cooked and burned beef on top of the noodle. Can't believe he still give it to customer eventho know it already burned. My chef he's the fat guy, very unprofessional, too concentrate on his conversation, as a result, forgot about my beef.  During 5-7mins waiting my order, he was nonstop talking, talking, and talking to his colleagues, with NO face mask on, but all I hear is his voice. I thought I was inside a talk show. Probably his saliva covered all over my food!  How could he bring cancer food to the table give to customer?  Eating burned food not good to health, everyone knows, and can cause cancer for eating too much. I don't want to imagine how many customers daily had ate their burned food here!  The only person i would give star is the cashier.  i see she very responsible, concentrate and respectful her job, standby the whole time ready to help customers take order.", "author": "Epicure M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "When you walk by this place, there's usually a lady standing out in front handing you pieces of the teriyaki chicken. While I didn't really enjoy that piece that much, I was really craving a good teriyaki chicken with vegetables and decided to go here.\n\nWhile the food wasn't the best, it was decent enough to hit the spot and the portion size is relatively large so it is filling. They serve it with rice, chicken on top, and some veggies. If you request to have a stamp card, I believe after 5 or so orders, you get a free chicken teriyaki plate!\n\nThere are condiments along the side that you an use after getting your plate. Be careful though, the plate can be kind of hot since they are putting it all in the right after it comes off the grill.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "They lured me in with a sample. The teriyaki chicken with rice and veggies was good. The salmon sashimi was surprisingly good as well. Good, inexpensive food served with a smile.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-12", "description": "Sarku Japan is a very convincing place for me to come and try their Teriyaki chicken with rice. Why? Free samples of Chicken Teriyaki when I walked by! That sure did convince me to give it a try since I was hungry. I ordered the Teriyaki chicken with rice; It came along with vegetables, rice & Teriyaki chicken. My total came out to be around $8.02. Really nothing special all honestly. I do however like that you can ask for a free water; I also like how they have small packets of Soy sauce so I can add it to my meal. The whole meal was a 3/5. Why? A) It doesn't make me full. B) I'd question if the Vegetables are even fresh. C) They give less very less Chicken. D) They should give more rice & Chicken. E) The price is so expensive; $8.02 for one meal and I still wasn't full, I had to get Milk tea to fill in my half hungriness. \n\nOverall, This place is okay for lunch but for $8.02, I'd rather eat something else.", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "Same as the Sarku Japan in Westfield in San Jose. Cheap sushi and not at all fresh. Portions of salmon in the sake maki is very small and way too much rice in some of the pieces compared to salmon. I guess you get what you pay for. Not sure how this can still survive at a busy mall. But I see most people get their bento boxes opposed to be sushi.", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-05", "description": "Food: 2/5     Price: 3/5      Service: 2/5       Ambience: 2.5/5\n\nJapanese fast food located in the basement of Westfield Mall. They offer freshly cooked teriyaki, bento boxes, and fresh sushi. However, the taste was really mediocre. Nothing special and pretty low quality.\n\nRainbow Roll - CA roll with assorted sashimi. CA roll was ok, the crab meat was kind of dry. Sashimi on top wasn't fresh either.\n\nOrdered:\n* Rainbow Roll ($8.59)", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-28", "description": "Nestled in the corner next to Pac Sun, this place is is your typically quick and greasy mall asian food. They offer a good bit of variety, all of B-grade mall quality. \n\nCome for the chicken teriyaki or chicken+shrimp teriyaki. Its a bit on the saucy side, but it's larger on the portion size, piping hot, and its a good warm and filling meal. For $8 and ready in 5 min its hard to beat in the area. I've tried their rolls and gyoza before and don't recommend it.\n\nSeating can be kind of tight, and you are regularly exposed to the randos that troll the mall, so proceed with caution.\n\nAlso, they have a buy X get one free card if you frequent this place regularly.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "For mall fast food this place is really good. I got the teriyaki chicken substitute the rice with noodles for an extra $0.50. They grill everything right in front of you so it is super hot and fresh. The portions was huge. I don't recommend their sushi though. Took a long time for an order of salmon rolls and it was mediocre at best.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-21", "description": "Ok I get working a mall and for a fast food chain is not ones dream job BUT dam everyone working here is like a zombie waiting to be put out of their misery... On top of that the service sucks and apparently they don't understand take a order correctly when you order their special or the chicken / shrimp combo. \n\nWhen I told the cook the order was wrong as it was just chicken only all he did was look at my receipt and handed it back to me without saying a word or getting someone to fix the order. The food is OK for fast food but the service sucks so I'll pass next time and go to a place that can get my order right or at least give a crap on fixing your order if their was a miscommunication.", "author": "richard j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "One of my go-tos for cheap eats downtown. Chicken teriyaki used to be enormous portions, now they're just big, and price has been sneaking up, too. But still, a good deal for the area, where reasonably priced lunches are getting harder and harder to find.\n\nI always get a teriyaki, which is cooked fresh in front of you. Potstickers, etc. look like they've been sitting under a heat lamp for a while and dried out. I would never, ever eat fish here.", "author": "Crabcakes C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "I usually get teriyaki chicken with rice and veggies. It's not bad.\nTypically service is quick. For a hot meal in downtown, the price isn't bad.", "author": "Lizzy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-12", "description": "Things that might attract you to Sarku: noodles, the smell, chicken, beef, teriyaki sauce, sushi, free samples at the storefront.\n\nBest thing to get: Noodles with teriyaki chicken\n\nPros: Can ask for more/less veggies, extra sauce\n\nCons: \nUndercooked noodles may give you a tummy ache. Not enough sauce = less flavor/bland. \nVery low quality/fatty meat. \nToo many veggies, not enough chicken. \n\nSarku has the potential to be great because it's teriyaki sauce is bomb, but they fail to deliver with undercooked noodles and incorrect proportions of chicken/veggies/sauce :(( \n\nOrder with very low expectations so you leave somewhat happy.", "author": "Saachi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "As a Japanese American this place is just ok.   It's like fast food Japanese so it is what it is.  My biggest complaint is when I ordered the Shrimp Tempura it was coated with a substance very similar to KFC's extra crispy chicken.  NOT the traditional flour batter and served with NO tempura sauce.  Came in a bag felt like I was eating pop corn chicken!   Kinda over does it on the rice and vegetables on my first trip\nthere carried the rice and vegetables left overs and gave it to a homeless person on Powell St.", "author": "anson o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "This place is pretty great! Best you can get for mall food. Not \"the finest of cuisines\" but a delicious comfort food if you're looking for teriyaki chicken while you're shopping!", "author": "Jake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "This place is ok, but mostly foods are too sweet. I ordered beef bento for $10.84 But it's too sweet. Some of the pot stickers is ok. I don't anymore chicken. Because the chicken is too hard and dry.", "author": "Jackson L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-24", "description": "You know when you've had a long day at work, or you've been walking around a big city for a good while, and your stomach is begging to be filled. Yeah, this spot might do it for you. It's not top shelf Japanese, but more equivalent to street cooked Hibachi protein in a small mall shop setting. They have combos you can alter to your liking. It's casual, portions are plenty, and you can let the chef know how you want your order made as you go down the line. Quick in, quick out, Japanese stir-fried.", "author": "Alan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "Honestly it's the usual food court food, not amazing but fills you up. I got the Shrimp and Chicken Teriyaki Combo ($8.19). The portion size is humongous, the shrimp and chicken pieces were overfilling. The rice covered the entire bottom of the plate and the vegetables seemed endless. The flavor itself is okay, just the usual stir-fry soy sauce. However, I have to say the shrimp was really tender, very surprising considering how it came from a food court. \n\nThe only reason I would come back is because of the price which is so cheap! The name is intriguing but the food is pretty normal haha. Nothing very special.", "author": "Vivienne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-25", "description": "Exactly what you would expect, freshly grilled chicken terryaki in a food court. Benihana's without the trip up to Japan town. Food is nothing spectacular but it is certainly a good value for the location.\n\nPro-Tips: always get a free sample here, it's like Costco & always get double meat when you order, it's actually double meat.", "author": "Roger L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-10", "description": "I would have to give this restaurant 3 stars because the food does not fully satisfy me. It's always burnt and the salads they serve are old and moldy. Although, it's quick to just grab and eat I would rather wait for a high quality meal. I didn't expect much from it anyway. Would recommend if you are a oily food junkie. Just isn't for me.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "We went here twice today. The chicken, beef, and shrimp were grilled on teppanyaki. This gives almost like less fast food like atmosphere. Taste so yummy. Portions sufficient enough. Valie for money. Thumbs up.", "author": "Wahjudy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "It is nice to see the meat cooked right in front of you, even if this also creates a longer wait for your food. We got the beef teriyaki over fried rice with extra chicken. Their chicken is pretty solid. The fried rice was not great and the beef wasn't either. But there was sriracha available, which made it okay. This is not a place that someone looking for great food would ever seek out, but if you get hungry in this mall's foodcourt it is a solid option. \n\n3.5 stars.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "I ordered the Beef-Bentobox: The sushi was... easy to tell not good quality, the beef was ok tender but for me personally to bland, the fried Dim Sums~?! were ok. The best thing there was IMO the rice. The service is good and your food is ready within 3-5mins even at 12:00-13:00 and theres always a guy standing there who gives u samples. I dont think I'll come back but u can give it a try.", "author": "Duy-Nam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "Honestly, the anticipation in waiting for this delicious delicacy was increasing. The chicken dumpling were delicious from every bite. The white meat chicken is soft and the crust is perfectly crafted. The rice have Just the right amount of oil in them but the noodles lacked that genuine signature flavor. The environment could've been a cleaner but overall my experience was amazing and I recommend trying out this amazing Japanese delicacy.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "It's mall food. I have two friends who are absolutely in love with Sarku and I'm still not really sure why. I guess it's like the Panda Express for Japanese food? Not authentic but still tasty? It isn't mind blowing but it sure does hit the spot when you need to refuel before/after shopping!\n\nPROS\n-samples!! I appreciate how they always have samples and are super eager to share them with you :)\n-relatively cheap and fast\n-still tasty :9\n\nCONS\n-super smelly from all the stir-fry/cooking\n\nTIP\n-Check out their special of the day/week. It's usually one of their combo meals for a little less.", "author": "Grace J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-22", "description": "A quick and good option at Wesfield's food court. Not the best, but also not the worse. \n\nThe advantage is that is cheap and the portions are pretty generous.\n\nUsually they give a free sample of teriyaki chicken in front of the store, so is a good idea to take one and decide if you like it or not. The first time I ate there, I ordered this teriyaki chicken with noodles and I couldn't eat it all alone, is too much food for me. \n\nMy favorite there is the sushi and sashimi menu, but they are very slow to prepare it and you'll spend a long time in line. Don't ask that if you're in a hurry.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "I order from postmates and an hour later when the driver goes to pick my food up they tell her they're out of the kind of sushi rice that goes in my donburi...like that's fine but you could've told me this an hour earlier.", "author": "Lucy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "They have good food but the customer service is horrible and they don't care about their customers. Also the food quantity is little for $10.", "author": "Ameer H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "i order teryaki chicken with teryaki beef..it was good  and i also order shrimp tempura.but its burn. even though they know it. they still sold it. i didnt complain to them because they might do something on my food.", "author": "Mj H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Not the most savory food, but it's edible and very filling -- the price to quantity ratio is probably the most favorable in all of Westfield Center. For that reason, I'm giving 4 stars instead of 3.", "author": "Barack O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Very good taste, a lot of vegetables and HUGE portion size. Relatively in expensive price with awesome grilled beef, chicken, and shrimp.", "author": "Ender L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-21", "description": "OK. JUST WOW. I've been in the service industry for years (busser, hostess, server) and have NEVER been so appalled by the way I was treated today!! Literally 45 minutes ago!!!\n\nThe reason why I can't EVEN right now - legit CANNOT EVEN - is because I read the 6th review and someone is telling the same tale I am about to jump into. \n\nWhen you order food to-go, you'll probably need a bag. WHY are the guys cooking my food telling me I need to go back to the cashier to ask for one? WHY did the cashier not ask me initially if I need a bag for my to-go order? \n\nI ask the cashier for a bag, she tells me \"10 cents.\" So I asked her, \"do you accept card for that?\" \n\nI would've gladly paid 10 cents for a plastic bag that, by the way, is illegal to be sold in SF. She doesn't budge. A paying customer pulls 10 cents from their change, hands it to me - in an attempt to help because she is ~hella awkward~ bro.  \n\nShe tells me to get to the back of the line to pay. I already bought my food, are you kidding me? How fucking bored do you have to be dude?\n\nBasically, this cashier is the worst person who has served me... ever? Ever. She starts ignoring the fact I am standing there waiting for a bag. I had to give my dime to a customer in line, ask them to get a bag for me (now they know what's going on, even more awkward), and she hands the customer my bag even though she knows it's for me. Petty.\n\nAfter getting my fucking bag, I might've given her a piece of my mind. \n\nI don't regret it. Whatever. As long as she is there, I ain't coming back.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "The cashier was helpful suggesting what type of ingredients would meet my needs when I asked for something not too salty.  She even asked if I wanted , no salt, light salt or sauce in it.  I assumed the sauce had salt so she asked about the sauce.  She later spoke to the cook to make sure my meal was the way I wanted it to be.  I haven't experienced a place at any food court being this attentive to my requests before.  The chicken teriyaki with rice was amazing!  The samples they pass out are also a nice perk.", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "This is my go-to place for my lunch breaks. They offer a lot of food at a reasonable price. Their best deal is the chicken teriyaki with white rice and steam vegetables. I prefer the chicken here than Kirin Grill, but I like Kirin's teriyaki sauce.\n\nWhen I first came here, they offered a ton of chicken so I was happy with splitting my meal for lunch and dinner to save money.\n\nAs I started coming here more often I noticed that they were putting less chicken on mines and a bit more on others. It's hard to say if they are purposely putting less meat on regulars, but I still like eating here so I pay for the extra chicken.\n\nI just wished served the chicken more consistently. There are times when I get chicken that is slightly burnt, dry, and in various amounts.\n\nYou can also request extra teriyaki sauce and you can also substitute white rice with brown or noodles for just 50 cents.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "4/2/15 - Decent Japanese mall food! I had the deluxe bento box with noodles $9.99 and the bf had his regular: chicken teriyaki extra meat ~$7 + ~1.50 for extra meat but I forget exactly. The tempura wasn't all that, but you can't expect much. I got a hefty amount of noodles which were yummy, and my bf was happy with his usual. The only con about this place is the customer service because the workers can sometimes be really rude, especially the cooks, but ehhh like I said, can't expect a lot. Decent food to satisfy your chicken teriyaki cravings!", "author": "Cassie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-20", "description": "I was charged for chicken and shrimp, received chicken only, not one shrimp found. To top it off the guy cooking just mumbled my order and walked away. I asked where is my bag that I paid for? He mumbled \"Get from cashier\" The cashier gives me a blank stare. I walk to the cashier leaving my food unattended for the inconvenience of having to get the bag when the cashier should've given it to me when I paid. Terrible employees, food is just ok. The line was too long at Panda Express which is why I ended up here, no line at all....no wonder.", "author": "wayz W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "The food here is okay, but the service is atrocious. Ordered my meal with noodles, then waited while they prepared it. The guy called my order a few times, so I went to check on it. It was wrong. I told him that it was indeed my order but I had asked the cashier for noodles. He looked at my receipt and then said I needed to pay  fifty cents extra. And he pointed to the line. Which was huge and out the restaurant. I said to him, I'm not waiting in that line to pay fifty cents. What he could have done: remade the order with noodles. instead he insisted on recuperating fifty cents for an add on. Bro, this is NOT your store. You don't own it. Instead of them eating fifty cents and retaining a customer, that customer has decided to take her business elsewhere. That's a loss of  a couple hundred over fifty cents. #sorrynotsorry", "author": "Zehra A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-05", "description": "For a quick fast food area in a mall food court, the food was decent and the line moved quickly. I ordered the Vegetable with Steamed Rice D'Lite Meal (which is literally white rice + cabbage, carrots, broccoli, etc). The vegetables were pretty oily, but the meal filled me up (probably from the rice), but it was a good option for a quick bite.", "author": "Winnie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "Definitely a 3.5 star joint. The line is long but moves very quickly. Tried this place for the first time and got the special which was teriyaki chicken, rice and veggies for $7.79.  Super good and super fast! I would definitely go back. I saw a guy behind me say no veggies and they piled the chicken on his plate. Gonna try that next time.", "author": "Marylouise R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "Fast, quick, tasty, and cheap.\n\nGet the bento, it's a good deal. You get a lot of food for $10 and it's decent quality [:\n\nThey prepare the noodles and chicken in front of you so you know it hasn't just been sitting somewhere waiting to be scooped into your plate.\n\nOf course it's not going to be straight up authentic Japanese food. It's a mall, not a restaurant with a full kitchen. Don't come to the mall looking for quality Japanese food. \n\nIt's decent food for a decent price.", "author": "Bianca M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-11", "description": "Japanese fast food is such a contradiction in terms, an oxymoron if you will. Like deafening silence. Like slightly pregnant. Like thoughtful Republican. For a culture so accustomed to meticulous presentation and maximum efficiency, Japanese cuisine is never able to reconcile the two concepts to make it a worthwhile choice in a mall food court, at least to me who would rather have a vegetarian burrito bowl next door at Chipotle anyway. Maybe that's why there's always one or even two red-hatted employees trying to push free samples of their chicken teriyaki. Enough already, Let my people go. I give. I'll try it.\n\nSo I waited in line and ordered the $5.99 Chicken Teriyaki plate and added $1.49 worth of Extra Meat, all of it over a pile of Brown Rice for another fifty cents (see photo). Add my Diet Coke, and I was looking north of ten bucks. It was hard to tell how much extra meat I got since the regular order looked fairly identical. By the time I took my hefty carton of chicken to the table, it frankly looked unappetizing with the sweet sauce liberally squirted in a Jackson Pollack-style pattern. I didn't hate it, but there was nothing remotely unique about the execution here. That brings me back to my original point - either spend more on a quality kaiseki meal or just fuggedaboutit.\n\nFOOD - 2 stars...mound of generic chicken strips with a dispensable sweet sauce\nAMBIANCE - 2 stars...it's the ghetto side of Westfield Mall\nSERVICE - 2 stars...no eye contact whatsoever\nTOTAL - 2 stars...for those who care how much chicken teriyaki they get, not how good it is", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-30", "description": "This is just another Japanese food chain found in most malls in America. If you have never been to one it's not something you should feel bad for missing out on. For the price it's not a bad deal as the food does fill you up for less than $10 but the quality isn't very good. The actual chicken they serve you is also never as good as the free samples they hand out but that is fine. The rice tastes ok but it is just normal traditionally made rice and not the authentic sticky rice you would expect from a restaurant that  has the word Japan in their name.\nFor a quick cheap bite this place is alright but it's also in a good court in a mall and better options are not that much further away.", "author": "Itzak H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "So impressed by level of customer service for mall food. Gave me more chicken after I dropped some without even asking and they offer more sauce. Food was good too. \n\nSamples offered of both chicken and California roll!", "author": "Emma W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "I have been eating at this place for years. The chicken teriyaki is great, always ask for more sauce and get noodles with your order. Best place to eat in the mall.", "author": "Trevor C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "For mall food, seriously decent.\n\nWas lured in by some chicken teri samples and ordered the Chicken and Shrimp Teriyaki combo after some hesitation on getting shrimp... but they had a daily special on this dish. The shrimp was surprisingly, very fresh. Usually with these dishes I get sick of the taste by the end of the meal but I really rnjoyed every piece of meat and shrimp the whole way through!\n\nSarku Japan and Ajisen Ramen are the way to go in this Westfield.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-13", "description": "A very convenient quick healthy choice. I ordered the Teryaki Rice. Solid,as a rule I find Japanese cuisine to very tasty just small portions of meat. Here if you are not out to get stuff its a good bet. They give very generous portions of rice--to much I did not finish half. I could have used more  Teryaki sauce with the meat. Still the meat was cooked tasty and its hot off the grill.  Also considering the affordable price of the meal the meat portions were more than adequate and I look forward to returning.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-11", "description": "Their chicken teriyaki attracted me, so I got an order of just the chicken without the rice and vegetables to go. Same price as the rice plate. Guy wouldn't fill up the box and it was only half full. I felt ripped off. Not worth it unless you're ordering the meal.", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "Fresh sushi in mall, and bento boxes too? What's not to like?\n\nDashed in and ordered, it took a while because of the line, but the sushi showed up real soon, nice sized cali and salmon rolls, and then the bento came.\n\nVery fresh, very tasty, and not pricey!\n\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-15", "description": "I've been on the search for a yakisoba noodle dish since I left Toronto seven years ago. A few years ago, Sarku Japan opened up in the food court near my work place and I tried it out. It should say something when I say that it's been 3.5 years since I last ate there. Last week I was craving noodles and figured I'd try it again, not quite remembering anything good or bad about the last time I went. I ordered the soba noodles with vegetables and extra teriyaki sauce plus spring rolls. \n\nIf I'd read my review from before, I wouldn't have bothered ordering the rolls as I did wind up with a lot of extra food... again. The serving size is pretty generous and the prices are still really cheap.\n\nBut after trying both the noodles and the spring rolls, I remembered why I only went there once. The noodles are adequate with not a lot of sauce and while the vegetables were ok, just the whole thing wasn't that good. The spring rolls actually tasted pretty bad, and on top of that I had to ask for them as they seemed to have missed them in my order. \n\nWhile the price can't be beat ($6 for the two things I got) I'd rather pay more and get something that's delicious. I won't be going here again.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "Sarku Japan offers a really tasty option in Westfield and in my opinion, trumps Kichi Grill in many ways.\n\nCustomer Service:\n\nThe only real downside, in my opinion. I went early in the day when there was no queue and headed straight for the cash register. I was standing there while I saw the employees idly looking at me. No \"welcome, we'll be right with you in a moment, sorry!\" or anything. I don't mind waiting, but the situation felt a little awkward and I would've at least liked some feedback from the staff that I existed.\n\nWhen my food was made, the chef half-heartedly put it on the pick up counter. I said \"thank you\" and he just continued with his work with a glazed-over expression on his face. Like I said, the whole experience felt really awkward and unwelcoming.\n\nFood:\n\nTasty and affordable! I ordered a Deluxe Bento which came with your choice of protein (I opted for chicken), rice, salad, tempura and California rolls.\n\nThe Teriyaki Chicken was delicious and the tempura was pretty good too. My only complaint is that the California rolls seemed a little cheaply made. Loads of rice with only a small amount of filling led to it being less than satisfactory. However, thankfully since there are other things to be enjoyed from the Bento the puny California rolls can be easily overlooked.\n\n---\n\nI might consider coming back to Sarku Japan. Being limited in choices of good Japanese food in Westfield, it would be hard to be picky. The food is decent with affordable prices, but it's nothing out of this world to have me begging for more.", "author": "Clarissa Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-27", "description": "I know it's fast food but I'd like to not feel like I chugged oil after I eat. Tried the teriyaki chicken though the teriyaki flavor got drowned out by oil. Definitely won't be eating here again.", "author": "Kay E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "This is one of my favorite places to eat in the mall. I always get their special of the day which is chicken teriyaki with rice and vegetables. The special of the day price is about $6.50 or so. However, they can get you by requesting brown rice other than white rice, or removing the vegetables and adding extra chicken or what not. Drink not included in the price. Then before you know it the price is up to $11.00-$12.00 in a matter of seconds. Gosh! I love San Francisco. ;-)", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-25", "description": "This is a solid place to grab a quick lunch in the Westfield food court if you don't feel like Chipotle or Panda Express. I consider this location a Japanese fast food joint. You order at the cashier on the right side and slowly make your way left while you watch the chefs stir fry your food. \n\nI tried the CHICKEN TERIYAKI  rice plate and was surprised at its large portion for only $6.95. They fill a big square Styrofoam box with white rice, teriyaki chicken, and stir fried veggies. While not fine cuisine, it does hit the spot and fill you up so you can have more energy to shop!\n\nThe good:\n+ Quick service\n+ Cheap pricing\n+ Large portions\n+ Tasty food\n\nThe negatives:\n- Not sustainable by their use of Styrofoam boxes", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "After tasting a little piece of chicken the staff gave us for free, We ordered shrimp teriyaki combo and chicken teriyaki combo. The amount is so big. And they are so delicious. I think what makes them so great is the sauce which is a little sweet. Highly recommend!", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-05", "description": "A mall restaurant that serves Japanese food, run by Chinese. A while back I had to talk to the manager because their cashiers obviously have no social etiquette. I told them it would be nice and courteous if the cashiers would thank the customer, a no brainer right?! Well it's been a while, I was hungry and figured on getting a quick bite and order some sushi. I was trying to inquire if it would be possible to get an order of California roll and an order of Inari (rice covered with tofu skin). The cashier didn't know what the heck I was talking about. Even with a visual aid of a picture and me pointing at the picture of Inari, she still couldn't comprehend what I was asking. Jeez, if you're serving Japanese food, at least know what the heck you're serving at your establishment!", "author": "Kim L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "Avoid the tempura. Very greasy. \nThe teriyaki chicken was also a bit greasy. The rice evened that oil from the chicken. Salad was pretty below average. CA rolls not good. Wow. I know this is a fast food level joint but even with that said I will not be returning.", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-16", "description": "This place is great. But very slow today when I came here. They need another cash register to speed the ordering process along. They don't even call out the number on your receipt. What happens is that it is hard to tell what food is your and when it is ready. I love this please. But I hate the slow service here and the disorganized way of getting your food.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-21", "description": "Located at the food court inside the nordstorm shopping center. My mom and i both order the chicken teriyaki special since its cheap which cost about 5.99. You can always add extra meat for 1.49 more. We both got with noodle instead of rice but it'll cost an extra $0.50 if you get noodle. The good thing about this place is they cook the food in front of you. Theres one person who is charge of cooking the chicken while another person deal with the noodle/rice/vegetable. They usually give free sample of their chicken teriyaki. Other then that, the food is good, quick service if its not too busy, and friendly service.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Fresh teriyaki chicken, steamed veggies and rice filling a to-go box to the brim. $7.99 for all that, I'm so down. The meat tends to be a bit chewy sometimes, but that delicious sauce makes up for it. When you look around and see Chipotle, Panda Express, the choice is obvious. They also fill up your to-go box so full, it's like yes. I never eat all of it in one sitting. It's simple, cheap, and not bad at all. The line is always a little compacted and confusing, but I have always gotten the right tray at the end.", "author": "Jenni W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-25", "description": "It's been years since I have eaten here cause the last time I had a bad experience also, so\ndecided to give it a go again since I was in the mood teriyaki chicken. I order my food and wait for it to get prepared as in waiting, a few people have come up to the counter asking for bags the cook is a little rude and tell them \"it's 10 cents\" I see him grabbing the money with the glove he has on preparing the food I though maybe he would change it since he touched the coins but no....I was a little grossed out. Finally my food come up and yells my order out I ask for some teriyaki sauce to go and he proceeded on putting it all over my food I stop him and say \"no I need a it on the side\" I repeated my self twice before he got it the the cook starts pointing at me where the side cups were located, at the moment I had no idea what he was doing, he finally grabbed one him self In a huff and gave me the side sauce with no top and left my food open with out closing the box top. It was basically almost the same service I got the 1st time rude short and the cooks can barely speak English. I don't think I'll be returning to this place.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-21", "description": "I like the chicken teriyaki lunch special...Ample chicken with fresh sautéed veggies atop white rice.  Recession buster $6.51 including tax.\n\nPay at the cash register.  Queue up and watch your lunch being cooked on the hibachi like grill.  It doesn't get fresher than that.\n\nLocated on the lower level at the food court at the Westfield shopping center by the Powell street BART station.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Fast food sushi. The bento box is the best deal. I always get rice with it but this time I had the noodles and omg, it was amazing! This is my favorite place to eat if we need something quick and delicious.", "author": "Yee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "I came here during lunch time after a long day with clients. So you could guess I was starving! Anyways, I knew this place had a bento and I've always wanted to try it. Comes with teriyaki chicken, your choice of rice or noodles, shrimp and veggie tempura, 4 pcs Cali roll, and a salad: all for $9.99. I had also ordered the 2pcs egg roll for $1.49. Total was about $14. Not bad for lunch, considering the fact that I live in sf (lol.)\n\nAnyways, instead of the typical chicken over rice, I picked noodles. And it was the best decision yet! The sauces from the chicken ooze down to the noodles (which is chow mein btw) and it just tasted soo yummy! And may I add that the tempura complimented it greatly, along with the salad and sushi. If only it came with miso! \n\nOverall, it was a delicious and satisfying lunch. It will definitely fill you up. I wouldn't go here all the time but once every so often would be enough. A place to go for your cravings!\n\nOh! And it is in the food court of Westfield mall. Grab a bite and go shopping. What girl can say no to that? :)", "author": "Sadia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "Sarku finally opened in San Francisco, no more commuting to San Bruno. Ordered the Teriyaki Chicken over rice and got a second one for only $2.99 from a promotion they are having. I would have to say it tasted the similar to the San Bruno location possibly the same cook. I have noticed the portions are smaller here and they do not give you as much food and meat at this location but you can pay more for extra meat. FREE samples while you wait and if your just walking by.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "After trying their Teriyaki chicken sample and getting a coupon for a 2.99 chicken plate (basically half off the second chicken plate).  Be aware that they actually have two prices for the same dish.  The Teriyaki chicken combo plate (comes with rice, veggies and chicken) is 5.99 a plate without the coupon but if you use the coupon then they charge you for 6.49 a plate. Very strange indeed and totally deceptive.  It's pathetic that they play this game to get you to believe that you are getting a better deal than you actually are.  I was too hungry to argue about this after waiting for what felt like an eternity in line.  People seem to have lots of questions about their menu which is obviously confusing.  Two prices for the same dish?\n\nI noticed everyone was very young including the cooks. The average age of the employees here is probably 22 years or younger.  They look very nervous and inexperienced.  It took fifteen minutes to get through the line after giving my order in line to a girl with post-its, then giving my order again to the cashier and then showing the receipt to the cook to prove that I had paid before I was finally given permission to take my food off their tall counter top. Cumbersome! \n\nThe Teriyaki chicken was tasty and fresh.  I ordered brown rice for an additional 50 cents. The veggies were scant with two broccoli and some cabbage but overall, the dish was good comfort food.  They take the chicken fresh off the grill and directly onto your plate and the food isn't very oily.  Other fast food places like Panda Express uses way too much oil so if you're stuck at this mall then Sarku Japan is actually a good place to eat.  They are fairly generous and the chicken plate has good value relative to the price.", "author": "Lorissa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-09", "description": "I tried the Vegetable D'lite.\n\nVery inexpensive dish.\n\nWarm lettuce atop warm white rice with a few teeny tiny carrot slices. No flavor.\n\nI'll never try that again.\n\nThey need a little more attention to cleanliness.\n\nA bench and one of the tables was dirty, and the serving tray area by the grill was dirty. All the staff was behind the counter; no one was looking after the eating areas.", "author": "D N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "Chaisaapaaooooooooooowww!\n\nChaisaaaaapowwwwwwwwww!\n\nHaaaiiiitrysanpaaaaaaaaooooo!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Found this place located in SF Center.\n\nHad the Chicken Teriyaki Bento Box.  Excellent!  Very delicious!  A great value.\n\nI recommend this restaurant to anyone.  Give them a try.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "I don't normally eat food court food, but I decided to make the exception for Sarku because I was really craving teriyaki. \n\nWhat I had was the chicken bento box for $10, which is not bad at all considering it is the food court. The California roll was pretty good considering it is the food court, the vegetable tempura was decent, and the chicken is made fresh right in front of you.\n\nUnfortunately, the chicken I was served did not taste as great as the chicken they were sampling, so although their samples may taste good, you should not get your hopes up. Additionally, they claim to have fresh ingredients, but their salad was so gross and probably loaded with GMO. For a second there I thought I was munching on cardboard... \n\nOverall, decent place to stop by if you are looking for fast Asian food that's not Panda Express.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "The food here is okay however the service is THE WORST! Hui was the worst customer service person I've ever met! He first gave my sister the wrong food and when she showed him the ticket and told him that's not what she ordered he started yelling at her! Like are you serious! Then when my mom asked him for her egg rolls he yelled at her and told her to wait! She didn't get them for 15 minutes until she walked back to Hui and asked and without even looking at her grabbed egg rolls from the counter behind him and threw them at her and they weren't even hot! My cousin then ordered a shrimp roll and he gave him a chicken roll and insisted that's what he ordered! A lady next to me said Hui was rude to her too! I would never come back here no matter how good food is, the service makes it taste awful! Hui should be fired!", "author": "Amari G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-20", "description": "Two stars only due to their location otherwise one star for food/service. I wanted to order  the veggie with rice from the d'ite menu with chicken and asked for the rice to be on the side. The person taking the order laughed at me and then started talking to her co-worker wherein I was asked to repeat my order. That person laughed as well. I asked them why they thought having the rice on the side was funny. A third person came to take my order and when I repeated it he said I would have to order the combo even though I wanted the veggies from the d'lite menu. He even pointed where in the box the rice would be sectioned off vs in a separate container. Of course when the order came the rice was NOT on the side but rather under all the chicken. \n\nI had also ordered their beef teriyaki and while the sauce was yummy I wonder what part of the cow that meat came from - unlike anything I have tasted before. I even questioned to myself if it was beef so I stopped eating it.   By the way the veggies are way over cooked and chopped so little it looked like left over veggies. They even got the drink order wrong. Very disappointed of the service and quality of food. \n\nSMH of how this eatery came to be in this fabulous mall.", "author": "Sandra V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "I order the chicken bento box comes with rice,chicken, 4 piece of California roll and shimp tempura for 10.00 not bad at all the chicken is very good.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "We have been here several times  after shopping and really like the flavor of the chicken.  \n\nNice vegis over rice or noodles.\n\nIt does seem every single time there are issues with the order, either it's your order or someone in front of you, but if you order anything out of the norm, like sub noodles for the rice, it seems to throw off the chefs.\n\nSo just go with the flow with whatever they hand you.\n\nToday we had the chicken teriyaki, extra chicken and vegi delite.  Both great.\n\nWe arrived after volunteering all morning for the SPCA at the Macys window which has puppies and lots of kittens.  You can get two kittens for price of one this Xmas!", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-11", "description": "Extremely bad service and attitude towards the customer. These people don't care about their food, the customer or how they treat people. The food is mall food so don't expect much, but the worse thing is that they are extremely slow and don't care.", "author": "The A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-30", "description": "Hey now, it's mall food.  But if you hungry and want a cheaper meal from SF, this is the place to go to.  \n\nI went because of a coupon.  If it wasn't for that coupon, this review by me wouldn't exist :)", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Decent fast food. $7-8 depending whether you want steamed white rice or noodles (extra) w/ your protein.  This place is always packed. Poor Indian food next door is always empty. I alternate the two depending on my mood.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Seriously one of the best deals you can get at the food court. The reason for all the stars is because I mean come on it's the food court...\n\nThey always have a special for their Chicken plates. Its a huge plate of terriyaki chicken with rice and veggies. Occasionally they have a coupon where the second plate is $2.99, that's an amazing deal. You can also ask for extra sauce and they don't charge you extra. \n\nThree stars for the deal alone, and one star for it actually being edible mall food. Definitely a quick lunch staple when working right across the street.", "author": "Mindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "You will love the teriyaki chicken n shrimps with steamed rice for $8 with vegetables. Bento lunch box is also worth for one person with $11 filled with 4 sushi rolls,shrimp tempuras,vegetables tempuras n teriyaki chicken/shrimp/beef with steamed rice.", "author": "Soe O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-19", "description": "I couldn't order what I wanted because the cashier did not understand the menu items. She did not speak English well at all and I tried pointing at the menu. Still couldn't get the message across. I am dissatisfied because I couldn't get what I wanted and was charged for something I didn't want. MANAGEMENT please educate your staff ASAP!", "author": "Valeria L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-18", "description": "Just saw this cook's spatulas hit the floor no fewer than eight times while I ate in front of this place, no exaggeration. He's trying to do flair like at Benihana, sucks pretty bad at it. And he never once took them to the back to clean them. He's been cooking with them off and on. Gross, and I'm not coming back.\n\nThis happened on Sunday 6/16/2013 at about 11:00am, not today.", "author": "A.J. R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-12", "description": "OMFG!\nWTF?\nBuWaHaHaHaHaHaha!\nWahahahahahaha!\n\nI can't stop laughing at you!\nI've made up my mind\nTo live in memory of the lonesome times\nI can't stop vomiting at you\nIt's useless to eat\nSo I'll just live my life in dreams of yesterday\nThose happy hours that we once knew\nTho' long ago, you still make me blue\nThey say that time heals a broken stomach\nBut time has stood still since we've been apart\nBuy \"I Can't Stop disliking You\" \n\nOMFG!\nWTF?\nIs this Panda Sushi?\nPanda-Express?\nTokyo Express?\nKobe-Bento?\nYama-Sushi?\n\nSame old Terry-Yucky-Chicken.\nGo F' Ur-self kind of place.\n\nWell, mall food is \"Chinese\" anyway, it does not matter what.\nBtw, What does the \"Sarku\" means?\nI really don't know.\nIt must be Chinese.\nI think it means \"fake\". \nHaha!\n\nPlease Jesus, tell the owner that people knows the difference between fake and real-thing these days.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-02", "description": "I can't even make a review for their food because they forgot about my order! (I ordered a teriyaki plate but with fried rice.) Which resulted in me asking for a refund, and I waited for a decent time before asking for one... even AFTER the cook had asked what I had ordered since he saw me waiting for a bit.\n\nThey need to figure out a better system receiving food orders from their cashiers to the cooks. After waiting so long for my own order I had observed the cooks periodically asking the customers to show their receipts again to see what they've ordered. Some places can get away without the need for writing orders down... but if you're constantly asking customers what they ordered, that may be a sign. \n\n*insert Gordon Ramsay raging*", "author": "Sydney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "Really good and fresh. Super inexpensive. Shockingly good for mall food. Nice to see them grill it in front of you! Chicken teriyaki was SOOO good!", "author": "Ruby S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-30", "description": "I am a total softy and always want to give places a high rating (4-5 stars) but due to very poor customer and lack of flavor in the food, I am giving them a 2 star rating. 1 star for convenient location.", "author": "Ariel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "Cheapest place to get sushi near Powell if you are craving it. $8.19 for two intermediate sized rolls, or $10 for a full bento. Their $6.49 special of the day meal is super cheap too. \n\nThe sushi is fast food tasting but decent enough for me. Tastes better than Tokyo express which always leaves a funny flavor in my mouth. \n\nDon't forget to look on the counter for other special little deals too. Like 50 cents to upgrade from rice to noodles, and $1.50 for a row of potstickers. There was also no tax on my meal. (How do they do that??!)", "author": "Deb B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "(See pics) Review #1303. If you want some fast service and okay food, the chicken teriyaki with rice was good and was only $5.99 + tax. It had lots of rice and the chicken was okay with the sweet sauce.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Gone are the days when malls only had food courts that serve crappy, unhealthy food.\n\nWelcome to a new era where healthy, delicious food is accessible and reasonably priced (so you can buy that Kate Spade bag you've been wanting.) even when you're at the mall.\n\nSarku Japan is a great, quick and delicious lunch or dinner option.  All natural, simple ingredients.  Their staples are teriyaki chicken, shrimp, rice (fried rice, brown rice and white rice) and veggies.\n\nGenerous portions for an inexpensive price.  But buyer beware because their portions are a little TOO generous.  Over 4 cups of rice which is  989 calories in one sitting!  Not to mention the calories in the over sized portions of teriyaki chicken (which has TONS of sugar!)\n\nHere's how you beat the battle of the bulge, while still enjoying their delicious food:  Get their shrimp combo, one scoop (I said ONE) of brown rice and extra veggies.  That's it just 2 simple changes and you're off to a great start.  And with all that walking, you are sure to lose weight, instead of gain that extra bulge.\n\nCashiers and cooks are very nice.  Lots of places to sit along the left side of the restaurant.  A great place for a quick lunch with healthy alternatives.  Enjoy!", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-23", "description": "I can't ever seem to walk out of the Westfield mall without sampling in their food court. I passed by Sarku one day and tried a free sample of their teriyaki chicken. Fresh and seasoned well! \n\nOne of the cheaper options in the food court, Sarku doesn't have a large menu. Simple teriyaki beef, chicken, tempura and a few types of sushi tolls. The chicken is fresh and is cooked right in front of you. I got the teriyaki chicken combo. For $5.95 it comes with lots of rice, decent amount of steamed vegetables and a freshly cooked chicken. I don't think the chicken needs extra teriyaki sauce, but they offered it anyways. \n\nMy combo was a bit skimpy on the vegetables, but it was simple no frills fare. It got the job done. \n\nTry not to shop while hungry. =)", "author": "Julie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-28", "description": "It's okay, the deluxe bento came with a salad and it was subpar because the salad have wilted lettuce. It took forever for the food to come out. The people behind the counter spend more talking and gossiping. One guy came out and grill some beef. The beef look a frozen block of meatloaf.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "Came here late on a Sunday. Mall closing at 7 pm. Anyway pretty good considering mall food but they gave a ton of rice and not a lot of chicken. The portions do not seen consistent as the guy in front got more. Other than that it is alright", "author": "Allen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-11", "description": "The chicken teriyaki tastes very artificial an is full with fat.\nRice was good but nothing special.\nService wasn't that good either.", "author": "Lucas G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-02", "description": "Not the worst, but for some reason, I'd still rather just not eat than to eat here.  Go over to Loving Hut instead.  Or, just anywhere else in the food court but here.\n\n\nP.S.  They load 3/4 of your plate or container with rice.  Such a waste.  Can we get a vegetable in here, or what?", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Great food court cuisine - HEALTHY AS HECK (lots of veggies and grilled chicken) - affordable - great portions.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "I work really close to the Westfield Mall, so I end up at the food court during lunch time quite often. I got really excited when I saw the Sarku coming soon sign because I've been to the ones at Valley Fair and Oakridge malls in San Jose. \n\nThe food is REALLY good. Get the chicken teriyaki - can't go wrong with that. The portions are also really big and I like the fact that it comes with a generous side of steamed veggies. Fried rice is pretty good too, but I think its about 50 cents extra. They also pass out coupons on most days so you can get a second chicken teriyaki meal for a couple of dollars more - what a steal! \n\nAnd this is why I go here about 3 times a week...", "author": "Megan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-22", "description": "Gah! Was in a hurry. Didn't have much time. Chose this place because, evidently, I hate myself.  Disgusting. They do not like people. They do not like food. \n\nThe packets of soy sauce (Kimlan) were excellent.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-05", "description": "This place serves decent food for its price. However, they seem to always forgot my order. I come here often and order a chicken terriyaki and with either with sushi or dumplings. Each time I either stand there waiting for a while or often forgot I had picked up my appetizer at all. \nI end walking out of the mall and walk back. When I ask where my appetizer was, they begin making the order. This happen quite some time already.", "author": "M L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Good choice for a quick bite to eat in the mall. The chicken teriyaki is my favorite.", "author": "NaKita H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-12", "description": "For those of you rating this place a 4 or 5 stars, I take you must love eating lot of white rice!  Well, even for white rice, it is kinda bad.. a blend of 2 different kinds of rice cooked together.  Nothing cheap about the food here either, for around $7 you can do much better at many other eateries in the same food court including the Thai place.\n\nWhere do I start.. oh, I remembered!  I had to stay in line getting the greasy smoke on my shirt while waiting for my food.  The raw chicken barely had enough time staying on the griddle.  The strips of chicken are cut way to big to allow the chicken to be cooked quickly.  Greasy, greasy greasy!!!!!  Oh btw, if you are a blonde and beautiful female, you will get lots of chicken!!  The rest of us ugly folks will have to make do with a much smaller portion of everything we get.. do not believe me?  Go see it for yourself.. LOL", "author": "Ernie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "With an Ajisen Ramen, and a Panda Express just a few doors down and a myriad of options further down the hall at the main food court, you'd think the idea of another Asian restaurant at Westfield would be a mistake, but this fast and fresh Japanese-themed option is here to stay, and a welcome addition to the mix. \n\nSarku Japan is a fixture in mall food courts from coast-to-coast, and has finally made an appearance in San Francisco proper. This place doesn't pretend to be authentic Japanese any more than Panda Express purports to be legitimate Chinese cuisine, but what they do offer is fresh food (they literally cook it in front of you), generous portions, and good value for the money.\n\n$5.99 buys you a heaping spatula full of Chicken Teriyaki, along with white rice, and veggies. For 50 cents more, you can upgrade to fried rice, brown rice, or Soba noodles, and for an extra $1.49, you can opt for 4 ounces of extra meat. \n\nIt's easy to make a healthy meal here as they provide calorie counts for all of their dishes. I'm not much of a veggie guy, so I generally opt for Chicken Teriyaki, extra meat, and brown rice. This protein-packed lunch only sets me back 685 calories and will not only keep me full for the rest of the day until a late dinner, but it also fuels me through 3-5000 meters of swimming after work. Be advised that if you opt out of veggies, they're going to load up on the rice, so if you are watching calories, eat the chicken first and then go to the rice. You'll generally be full before you can eat all of it. \n\nOne last hint: If you're trying to eat healthy, be advised that the teriyaki sauce here is awesome (possibly even laced with crack), but an extra ladle of sauce is going to carry at least a hundred calories, so if you are going to ask for extra sauce, do so sparingly.\n\nThe next time you're in Westfield, follow the cries of  \"Try Sample! Chicken Teriyaki, yummy yummy!\" to Sarku Japan. Your tummy will say \"Arigato!\"", "author": "Josh J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-06", "description": "Ah, another one of my haunts when I spend too much time at the mall. Cheap, lots of food, lots of veggies. I usually don't get the rice so they give me double veggies. And if I feel like it, I'll get double meat. It's like two meals for 8 bucks. Nice!", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-18", "description": "Ordered a Deluxe Bento with brown rice (50 cents extra, ~$11) because I had a craving from cali rolls and tempura. Presentation was okay for a fast food style joint, but the food itself was disgusting. \n\nThe teppenyaki looked good and seemed exciting with the guy calling out, but turned out to taste quite horrible. Very greasy yet undercooked terriyaki chicken, with uneven texture. The brown rice was not fresh. The Cali Roll was made by an amateur, with the cheap imitational crab, and unevenly wrapped. They don't have tempura sauce, and the Kimlan soy sauce just does not work. Salad looked fresh enough, but nothing special. The best tasting thing was the tap water, which somewhat washed out the bad aftertaste. \n\nThe others next to me opened their box, took a bite, then left, leaving their entire uneaten box on the table. \n\nSeating could have been more clean - tiny bugs flying around.. stuff on the chairs. \n\nTheir sample is not representative of the food.", "author": "Yosun C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-21", "description": "I though it was good but it wasn't  I order bento box ! The only hot is chicken .the tempura was cold supposed to be crispy !  the guy who cook the BBQ chicken is so loud talking to another lady worker! .... .", "author": "Bien M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "This place pulled me and a friend over because of their awesome coupons they were handing out (Buy one chicken teriyaki plate get one half off, so ~10$ for 2 meals).  The chicken tasted pretty good (they even had free samples of it) so we ended up each ordering 2 plates of it.  Personally, I liked it better with the noodles instead of rice (they're basically chow mein noodles) and I kinda wish I'd added extra chicken for 1.49$, but the food was very filling if nothing else.  \n\nPros: Lots of food, cheap\nCons: The rest of the food didn't look all that great\n\nOverall: Great for a quick bite with large portions.", "author": "Keith C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "I was first introduced to Sarku Japan at the San Bruno Tanforan shopping centre. I love this Japanese fast food. Esp the chicken and shrimp with veg and soba noodles. It is fast fresh and convenient and I will continue to be their customer until I get tired of their food. It is consistent and the staff are very inviting (almost too much)\n\nIm so glad they are in SF now. Much better than the other Japanese restaurant in the Westfield.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-07", "description": "Man, their store promotors are really aggressive! Everytime I've ever glanced over in that direction, they start smiling and waving at me, to try and get me to try one of their samples and consequently enter the restaurant. I kind of think it's cute haha. So, I got suckered in yesterday!\n\nThe deal seems to be the teriyaki chicken right now, which is approximately $5, but comes with generous portions of teriyaki chicken, rice, and steamed vegetables. Too bad I don't really like rice plates. I ordered the spicy tuna and eel sushi, which was $8 and took them a while to make (not any longer than a normal sushi restaurant, but a lot longer than the teriyaki chicken, which they had the assembly-line process down pat).\n\nMy sushi was kind of small, but tasted okay. I didn't really taste any of the spicy that I was looking for from the spicy tuna ):", "author": "Melody L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-29", "description": "I got the bento box for just under $10.  Essentially it was a taste of the entire menu and came with a CA roll, Teriyaki chicken, shrimp and veggie tempura, rice, and salad.\n\nPros: LOT'S of food.  They didn't scrimp on the chicken.  I was full and could not finish it and the rice.  Don't tell my tiger mom, she'd be pissed!  At $10, the bento box was practically a steal.\n\nCons: The chicken was overly salty.  I was not a fan of the packet of 1000 island dressing that came with my salad.\n\nThere is a good amount of seating inside the restaurant and right outside in the mall.\n\nIf you're looking for a good value on quick Japanese grub while shopping, check it out!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "This is my guilty pleasure when I need a quick meal at the mall. I know there's plenty of choices in the multiple food courts, but for the price, quality, and quantity of food, this deal really cannot be beat! Also the chicken teriyaki special with rice and veggies is only 640 calories. I am skeptical but I'll take it!\n\nOne warning: Although Sarku is a chain, I think the franchises are individually owned. This is not nearly as good as the LA versions, specifically Westfield Culver City (aka Fox Hills Mall for those who grew up there). Even within LA the quality of the franchises varies. BUT they are all still worth a quick meal or take out!", "author": "Ang F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-08", "description": "The food is cheap, tasty and fast, and they give you enough of it to keep you going. I had the chicken teriyaki for not-quite $7 and got a second one for $3 for my bf.  Cheap date!\n\nCome here if you are hungry for filling food and on a budget. Do not go if you are expecting authentic Japanese food. The chicken teriyaki looks more like stir fry.", "author": "Erica D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-15", "description": "My friend and I were passing by in the mall and an employee from Sarku was giving out samples. Their teriyaki is awesome - it's the main reason we wanted to get something  to eat there. The employee passing out the samples gave us a coupon where if you buy a chicken combo you get teriyaki chicken for $3. And the total for both would be around $10 so I was like why not. In the end when I got my food there wasn't even any of the teriyaki that I thought I paid extra for! It was pretty much chicken and I paid $3 for the teriyaki sauce -_- Such a ripoff my friend got a bento box and she had even more teriyaki than I did! Not to mention the vegetables are plain, quickly steamed cabbage, broccoli and carrots - that feels likes food for a horse. And the rice was a little hard and undercooked.\n\nI seriously do love their teriyaki chicken but everything else in their combo meal is definitely not worth it.\nAlso that instead of using toothpicks for their samples they just broke up pieces of raw spaghetti and used those as toothpicks instead... which is weird. Not part of my review but just thought that was strange...", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-24", "description": "It's mall food. It's not the worst thing ever, but it's definitely not a good Japanese place.\n\nThe chicken teriyaki tastes really bland. It comes in small pieces and the teriyaki sauce is really light. Tastes more like grilled oily chicken with a very light teriyaki flavoring.\n\nOverall, there's better Japanese food out there, but this place is pretty cheap and it's fast. Mall food basically.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-15", "description": "Not great when you compare to other food options in the mall. The chicken teriyaki isn't bad but compared to other sarku across the country this is the stingiest.\n\nDon't bother paying extra for the fried rice because it tastes terrible, like rice that has gone off. Better to stick with white rice.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-27", "description": "Order their chicken!! Not their lamb!! Gave my bf a stomach ache! \n\nTheir chicken is delicious! \nSometimes their cooks take too long to give out orders when they're talking to each other.\nTend to be skimpy on food when they're busy. \nDecently nice workers. \nExpensive tho!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-16", "description": "SAAAMPLLLEEEE!!!! CHICKEN TERIYAAAKIIII!!!  SAAAAMMPLLLLEEEE!!! \n\nMore on that later.....\n\n\nSo this place has pretty good chicken teriyaki.  For around $8, you can get double meat with brown rice, and they always top off my chicken with another small scoop of teriyaki sauce for no extra charge.  If you get regular white rice and no double meat, it's only about $6.50 including tax, no drink though.  Pretty good deal.\n\nQuick tip: It's your responsibility to keep your plate moving.  Sometimes, I have to literally move my to-go box in FRONT of the cook at the end of line so that he finally puts the chicken in.\n\nHere's where they lose two stars for me:\n\n(1) After about 5 successful lunches, I decided to splurge and try the bento box.  UM. So disappointed! The bento box was not that much bigger than their normal to-go box, so you don't get that much more food, since they have to adhere to the confines of the box specifications. The tempura was OK, but the salad was sad.  What really bugged me was that all the sauces came in these lousy to-go packets.  I was like, seriously, you're going to give me thousand island dressing from a packet like I'm putting hot sauce on my tacos from Taco Bell?  After speaking with some co-workers who also tried the bento box, they also said they were disappointed.  I will not be making the same mistake again.\n\n(2) Referencing the all caps above, their staff handing out samples are WAY too aggressive and loud.  It's ridiculous, really.  The last time I decided to eat in, rather than take-out, I even witnessed mall-goers approach the sample givers and ask them to stop yelling.  It's out of respect really.  Even though it's fast, people are still trying to enjoy their food in peace.  The seating area is a public space, and not everyone eating in the common area are patrons of Sarku.  How about the staff actually GO OUT into the mall and personally hand out samples rather than shout out over the crowd?\n\nOther than that, it's alright.  Definitely better than the other Japanese place in the other food court.", "author": "Vince S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "I've rated 4 stars in comparison to other fast food restaurants, like Panda. The chicken teriyaki is really good. Brown rice is an option if you prefer it. I'd say this may be the best Asian style food in the mall.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-05", "description": "I've been here a couple of times for lunch. Good, yummy Japanese lunch...Both times, I've had the chicken terriyaki over brown rice (healthier option), along with some veggies on the side.  \n\nI'll likely come back to try other items...", "author": "Annette L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "$5.99 for a chicken teriyaki plate with rice and veggies. Who can beat that. Its made fresh in front of you and it tastes good.", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "Surf. Turf. Teriyaki.\n\nNew dining option at the Westfield. Bloomingdale's side is called the Food Emporium. Guess that makes the older side just a food court.\n\nSarku proves five stars is possible in a sea of mediocrity.\n\nExperience on par with traditional restaurants? No way. But it's all about context.\n\nEight bucks gets you freshly grilled chicken and shrimp along with rice and steamed vegetables. Don't want rice? They'll give you more veggies.\n\nTopped with a sweet homemade teriyaki sauce as good as anything you'll have outside of a food court.\n\nWas tempted to forget takeout and eat everything immediately. Held myself to a few teaser bites. Later had just enough disciple to save half of the huge portion for later.\n\nQuality. Quantity. Price. Quite possibly the best (food court) meal ever.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-29", "description": "Passed by and they were handing out samples of their teriyaki chicken and cali rolls so i tried it and it was really sweet but i decided to eat here anyways. I ordered the teriyaki chicken combo and then the chefs cook in an assembly line style. as it was my turn to pick up, the chef put the chicken scraps that were on the edge of the grill and put it on my plate. So the chicken turned out to be over saturated with sugar and oil which I can look over but it was also burnt. I guess it was just my case but my meal wasn't so tasty :( other people seemed satisfied though. haha", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "Good food which is really affordable for the city. Loud and fun atmosphere. Would recommend it! You can even get sushi and tempura. Nice staff too and really fast service.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-10", "description": "Urgh!! wrong choice!! One of the worst Japanese food I've ever tried. Very unimpressive and unfresh tempura and California roll. Spitting on the food (argueing with colleagues) while cooking is unacceptable. Will never go back.", "author": "Fonda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-08", "description": "Sucks. Was looking for an alternative to Sorabol so tried this place. Not tasty at all. Had teriyaki chicken. I'll stick with Sorabol's grilled chicken.", "author": "pj n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-29", "description": "we really got ripped off here, paid for extra chicken and they gave us chicken like its regular meat. the on in san jose is MUCH better ! \nmaybe because they were packed but it was disappointing :(", "author": "R F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-17", "description": "Rude people, totally ripped me off on my \"7oz of meat\", I paid 9 and left hungry. I work in the mall and no one I work with thinks this place is worth it nor is it good. Panda and tokyo express are better then this place which is very sad.", "author": "Tim V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "The samples were good not so much the sushi. We got a Chickem teriyaki over rice it was ok. My boyfriend loves it but I rather have a Chipole", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Been going to the Tanforan location for quite a while already. Happy that I don't have to commute to there since BART is getting very pricey. Overall the experience was okay, food is decent, portion is fair, price is cheap for 2 person since the 2nd plate is only 2.99!  On a side note, ask them for more sauce, it gets pretty bland after you eat all the meat.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "Was craving some asian food after a couple hours of shopping and found this place. Pretty much this is a new store by the looks of it. There was a fair amount of waiting at the lines but hey cant complain about that. ordering was a breeze since the lady working at the cashier said that i should try their teriyaki chicken, which in my opinion, was pretty good, wasnt too salty or too sweet, food was nice and hot and it smelt great! To sum up my experience, this is a good place to eat at if you want some asian food", "author": "Danny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "The Bff and I came here because it was new and we couldn't think of any other place to eat at. We both ordered the Deluxe Bento. That was a lot of food but I liked it. Shrimp Tempura, Noodles, Chicken Teriyaki, salad and California rolls. I agree with Matt S., the 1000 island dressing packet was not great but didn't affect the rest of my meal. I was hungry. It was good. The chicken was especially flavorful. Not bad at all for 10 bucks. I'd go back!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-03", "description": "I had spicy tuna and eel sushi which was VERY, VERY, VERY MEDIOCRE for $8. I really should have spent money elsewhere. \n\nThis place is not run by japanese - hence the quality - BAD! Do not let the name of the store fool you!!\n\nIf you did not grow up eating asian food, you would probably think that this place is decent. But take it from an asian: this place just use way too much unhealthy sauce on those teriyaki combos you get. The sushi was the healthier (but not better by my food standard) choice i could find at this place. Sushi was bad, the ingredients they used did not taste fresh at all and the sushi rice was done wrong. All in all, over priced, bad experience and would not visit again.", "author": "J P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-08", "description": "You pay for double chicken but never comes like that:-( and buy one get second just $ 2.99 never works!!! They always charge more !!!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "I typically don't do Asian fast food, but I was on my way over to Chipotle, ravenous, when a friendly Asian fellow with a ridiculous red hat called out to me to take a sample of the teriyaki chicken and California roll. So I obliged. The teriyaki chicken is made with thigh meat, which made it more tender albeit higher calorie than breast meat, and the sweet glazed teriyaki sold me. For fast food, this chicken is really good. Several other Asian fellows in ridiculous red hats are behind the scenes grilling teriyaki chicken continuously in an assembly line so you'll get a fresh batch. I also got a salmon lover combo and the salmon tasted fresh, but the rolls were no good. I'd over ordered anyway and left those rolls behind. I'd return for a quick and cheap refuel in future Union Square shopping trips.", "author": "A. S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-20", "description": "We went right when it  opened, and everything was cold and bland.  Was very dissapointed for the price, as i spent $30.00 no drinks.  The picture showed a lot of broccoli with the entree I ordered.  However I got maybe two pieces of broccoli. Skip this place and go to the Loving Hut, they are preparing food fresh, right in front of you.", "author": "tonya m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-28", "description": "Flavorless vegetables, syrupy chicken. At least its fast.  I would rather eat almost anywhere else in the mall than here.  Chipotle is right next door!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "I like this place in the city. Teriyaki chicken and sushi combo plate is excellent choice. It is not best sushi but it is ok for downtown area.", "author": "Denis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "I have a huge fascination with this place. I enjoy going through the line to get my food. I feel like I am transported to a different land. It's pretty good and super cheap.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-26", "description": "I recommend not to go to this fast food chain..first of all the people who worked here was all rude from the register person to their cheif people..secondly the food that you paid was not even worthy..why you gonna pay $8 something for just little pieces of chicken or beef..its better to go to panda or ajisen and just add $1 something and you get a full meal..trust me i've try the most restaurant inside the westfield mall but SARKU was the worst one...and i think or in my opinion they really should hire people who knows how to communicate with the customer..customer service was really poor..", "author": "Portia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-03", "description": "Bad customer service. The dumb \"manager\"cut the whole line when I went and took the food orders that were ready for the customers who ordered before her!!! That's BULL. She didn't even seem to feel bad for doing that. And I only know she was the manager because that's what one of the workers said so. I have NEVER seen her. Does she even do anything as a manager?! All the employees are pretty young, don't really care, and are inexperienced. But at least they do their jobs. But whatever, the line went pretty fast, and the food was alright. They gave us the wrong sushi, but then they took it back and changed it. We only go here because of the coupon lol.", "author": "Rosanna A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-08", "description": "is this really what Japanese eat?  greasy cheap and low quality food ?", "author": "Al M."}
