{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Another win here. Avocado toast - and I asked for the ghost pepper tomato chutney. Generous portion of chutney sitting atop the toast: sweet, fresh and just a dash of spice. Great combo. \n\nMy Gibraltar was pretty good too.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-18", "description": "Good quality, but not cheap. \n\nAvo toast ($10)- Thick slice of bread topped with a huge pile of perfectly ripe avocado. I added an egg and it came fried hard instead of running- would be more clear about that next time. \n\nPumpkin latte ($4.75)- Seasonal special, fine. Cute latte art. :-)\n\nIt's a tiny space with counter seats around the perimeter if you are eating quick/solo.", "author": "Ryen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "I was in San Fran for Dreamforce for a week and ended up going to this place three days in a row, even though it was a mile from my hotel, because it was that good!  \n\nGet the burnt caramel latte and the welsh rarebit with ham.  Their toast is really good, pretty thick but really soft inside.  Their ingredients are high quality and you can tell very fresh. \n\nI did have the avocado toast as well, but I think I'm just not an avocado toast person (that was my first and last time trying it).", "author": "Mona B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-06", "description": "Cool compact cafe! They over varieties of coffee and toast. I chose the spicy PB&J with apricot habanero jelly, and my boyfriend picked the cinnamon French toast. Both were extremely good. I'll definitely come back for the spicy PB&J!", "author": "Perla N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Eating toast in a closet doesn't strike me as the basis of a sound business model. It sounds like my childhood. \"Yes, Mommy, I'm in the closet. I'm not getting crumbs on your chinchilla.\" This place showed up on the Yelp app as a place to have breakfast in the 'Loin. I figured it was going to be a greasy spoon coffee shop with a cigarette dangling from the cook's mouth. But no, it's a much classier affair with a marble countertop, white subway tiles, and reclaimed wood beams to sit at. The challenge occurs when there are more than four customers and you have to find an open place to take your order. Did I mention it's in the Tenderloin?\n\nThey serve Five Mountains teas, make all the usual suspects with Sightglass Coffee, and use Recchuiti chocolate in their mochas and hot chocolates. Fancy. I ordered a $3.50 Cafe au Lait which met my immediate caffeine needs (photo: http://bit.ly/2OVRct5). For breakfast, they serve nine different toasts as well as daily specials like English breakfast and pesto eggs. Toasts range from plain with salted butter to Smoked Trout to Welsh Rarebit with ham and chutney. I wasn't feeling entirely adventurous and went with the $8 Avocado Toast drizzled with garlic oil and rock salt (photo: http://bit.ly/2LbHnEJ). It was more delicious than I expected and I was fortunate enough to have a stool. I mean the kind you sit on.\n\nFOOD/COFFEE - 4 stars...a nice light breakfast that manages to satisfy\nAMBIANCE - 3.5 stars...nice upscale touches...in a closet\nSERVICE - 4 stars...two-person operation, very polite\nTOTAL - 4 stars...toast is a many splendored thing\n\nRELATED - Looking for other places to eat in the Tenderloin? Here are the places I have visited and reviewed: http://bit.ly/2MAPqN5", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "Tiny, pretty, friendly, and delicious. Cappuccino and avocado toast were on point. Local spot despite its location. Great find.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "I've walked by this place a handful of times whenever I visit my parents. I love supporting local coffee shops so I swung by to get a cup of coffee. I ordered the Tenderloin as I couldn't resist as I grew up in the Tenderloin. It was a cold brew with condensed milk. It wasn't overly sweet and was pretty good. The place is small and has a couple counter space to eat. They offer food but I didn't get any. \n\nStreet parking. No bathroom. Would recommend walking here, using public transit, or carshare.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "They have one of the best cappuccinos and avocado toast in the area. The staff has always been very friendly. Overall is somewhat pricey but I feel is worth the try.", "author": "Denis O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "We ended up at Scullery on the recommendation of a random San Franciscan who took pity on us waiting a tad too long at a nearby brunch place to order. Apparently Scullery had the best toast of SF! We took her word for it and walked up the street to Scullery's little hole in the wall. Unfortunately, it didn't live up to the hype.\n\nAs soon as you walk in, you can appreciate the cute little shop (and its awesome logo!), you get wafts of the freshly delivered bread and you look to a chalk board to see what to order. Two friends and I each ended up getting different toasts. I got the smoked trout, another got the avocado toast and the other got a shakshuka-like toast with lots of  waterey tomato topped with an egg. We were all kind of underwhelmed to be honest. The trout was pretty dry and overly salty, the tomatoes really runny and making it uncomfortable to eat, only the avocado toast seemed decent. Maybe the basic toast was the way to go? \n\nIn any case, as soon as we were done, we kind of regretted not having our lunch at Bandit next door, those burgers looked amazing.", "author": "Jobye-Kyle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "I remember a time when the Tenderloin was just plain ol' dirty, urglie, and janky stanky. And with the conflicting feelings of San Francisco gentrification and hipster revelation, I can't help but feel that (in a whisper's voice) it's kind of a cool thing that this kind of newness is taking over... minus any snooty pretentiousness or the drones of \"yo, bro!\" from crowds of yuppies, but of course. Oh no. Here at Scullery, you get a good blend of modern and easy coolness, an eclectic mix of earth and industrial. This tiny coffee shop is as neutral and as \"Can't we all just get along?\" as it gets.  \n\nHere is where Old SF and New SF can unite. \n\nMy order:\n\nSpicy Plum Toast - This toast was a thicker cut and served nice and warm. I decided on the spicy plum jelly, not too sweet, really delicious. Since the toast was warm, the jelly seeped right into every cranny. YUM!\n\nNitro Cold Brew - I like my coffee just plain black and bold, this was right up my alley. The sun was out and it was a bit warm, so the cold brew was refreshing. Great contrast to the sweetness from the spicy plum jelly.\n\nAvocado Toast - Fresh and filling. The avocado was ripened to perfection, not too soft and can stand on its own. The garlic oil and simple sea salt along with the cracked pepper were a perfect addition. This bread was also of a thicker cut. \n\nAmericano - I got mine with a quadruple shot. This did the trick. It was strongggggg\n\nService was quick and helpful. They do have some items that are rotating on their menu, so what may be available one week, may not be the next. They do serve\nSightglass coffee and provide baked goods from local bakeries. Seating is very limited here. Prices are on par with the blossoming area, but the quality of the food is worth it.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Great avocado toast! Seasoning, avocado itself and sourdough was on point!! Definitely a knife/fork type of avocado toast! \n\nGreat Burnt Carmel Latte, one size 12oz!\n\nIt's a small grab and go type of cafe but with nice sunlit windows and bar seats in the morning. Outlets are available too!", "author": "Ann T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Adorable, comfy shop with simple, fresh breakfast items and delicious coffee. Small space, but a great way to focus and start your day.", "author": "Maleah O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I come here on weekends once in a while when I'm in the area. They serve Sightglass coffee and a variety of different toasts. I've tried the avocado toast and thr Welsh rabbit (some kind of cheese) as I am usually craving something savory. \n\nThere are only a few seats here so most people to things togo or eat quickly before leaving.", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Loved the charm of this great coffee spot. We enjoyed a perfect vanilla latte and the toasts all looked killer. I had butter and raspberry chipotle jam. Apparently all the jams are Welch so they have a little kick- loved it!", "author": "Brittnee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "Cute cafe with friendly staff that's easy to miss! Ordered a Burned Caramel Latte which was absolutely delightful! It's definitely a grab and go place so don't expect to be able to sit down with a large group. The avocado toasts looked really good def want to come back to try that as well!", "author": "Johanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "One of my favorite grab and go spots. Small hole in the wall with very few stools, so don't come with a large group expecting a place to gab for hours on end. GRAB AND GO PEOPLE, GRAB AND GO. \n\nIf you happen to be here while its empty though, enjoy the quiet. I've only been in the early mornings, so it has always been a grab and go case for me. \n\nAlways friendly service, and usually with a smile despite it being morning. I usually just grab toast. Yes, I'm a millennial that blows money on avocado toast. You know what? It's better than any damn avocado toast I'd be making at home because let's be real: how many of you actually have readily ripe avocados on hand, solely for your avocado toast craving? Yea, exactly. Have also had smoked trout and the Welsh Rarebit as well as pb & chutneys and they're all good~! Favorite is probably smoked trout as I love a good smoked trout. Bread is always beautifully toasted and crunchy, doesn't get soggy throughout my morning munching, and yea it is a short wait but you're waiting for someone to toast your bread for jeebus' sake. This isn't Sbux. If you're that pressed for time then don't order toast! Geez. Also stay away so I don't have to wait in a stereotypical San Franciscan line, thanks.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Mini Yorkshire Breakfast Pie .. U gotta try the Yorkie! \n& Welsh Rarebit \nDELICIOUS + coffee great too\nGreat addition to hood", "author": "Edmind A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "A total gem in a sea of chains and nothingness! Their seeded sourdough bread is unbelievable and the place has a very cozy locals stop-in vibe. The owner hand-makes the pumpkin mash they use in their seasonal latte, and all of their \"sweeter\" drinks - mocha, pumpkin spice, and burnt caramel latte (!!!) - are designed to be low on sweetness factor. The space is small- just a few bar seats in the windows. So it's not a place to post up with your laptop! But a very cute spot for a great coffee & toast of all kinds.", "author": "Marjory G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "DO NOT GET AN ICED DRINK HERE! This place just dumps ice into hot drinks so everything was watered down. It was a hot day and our cold drinks had no ice and were lukewarm.\n\nThe food looks good and they seem to use high quality products. I just wish we had received a warning that they don't accommodate cold drinks and I would've opted for something hot.", "author": "V M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Great breakfast spot!  My husband and I ordered the Avocado Toast and Smoked Trout to share (we ate half, then switched lol).  \n\nAvocado Toast: Amazing!  Usually places are really stingy with their avocados but lo and behold, one big beautiful avocado seasoned on a yummy slice of bread.  Their avo toast is definitely what will bring me back here!  A+, Scullery, A+.  \n\nSmoked Trout: also great, but a little salty.  My biggest complaint about this one is that half way through we found a little piece of plastic in the trout (see photo).  It was a little disappointing, but I'm hopeful this was an honest mistake.", "author": "Jann B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Are you looking for good coffee and toast with numerous options (jam, cheese, etc.)? If so, you'll enjoy this Scottish-themed hole-in-the-wall cafe. Try the bread pudding. The \"Welsh rarebit\" is a fancy name for grilled cheese. Minus one star for the small space. (April 2018)", "author": "Matt R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "I went to Scullery because I was craving for an avocado toast. It is a perfect balance with the garlic oil, the sea salt and the avocado slices.\nI took a cafe au lait, I felt it was a bit too strong for me, not bad though. I did not see how they make it. My boyfriend had the breakfast sandwich, which was very good too, and a matcha latte that he didnt like. \nI cannot judge since I hate matcha latte anyways! \nIt is a tiny coffee/breakfast place with 2 nice staff, something like 6 seats around the walls. It is very clean, simple design and not pretentious. If you are staying or living in the tenderloin I think it is your best bet for a small breakfast.", "author": "Adeline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Came inside with a warm welcome. Super friendly and asked questions if it being your first time drinking coffee. Currently trying the pesto egg with a latte and it is delicious first time trying it and would come again for seconds!", "author": "Monica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "The avocado toast was wonderful -- delicious seedy bread, drizzled w/ garlic oil and topped w/ generous slices of perfectly ripe avocado, rock salt and pepper, added an egg for couple bucks more.  Cozy, but cool space. Concierge at the Clift highly recommend it; glad I gave it a try!", "author": "Amber E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Delicious lattes! Get the burnt caramel or chai latte. They also have a large offering of unique tasting toasts that I haven't tried yet.\n\nCool, bright ambiance but seating is very limited, so very much a grab and go place.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Amazing place, tiny gourmet coffee and designer toast place. A little off the beaten path but well worth the walk. Burned Caramel Latte is simply amazing assaulting the taste buds with truly unique barrage of flavour! Toast is not just toast... Explore the magic ;)", "author": "Degustator J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "This is a lovely place for coffee and breakfast for those in the area.  A small storefront with a few counter seats (plus take-out for those who want it).  Behind the counter, they take real care in crafting exquisite toasts and perfect coffee drinks.  The sign is small, and it'd be easy to walk by without noticing it--but then you'd miss out on a charming and delicious meal.", "author": "Joshua K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "The place isn't big enough to swing a cat in, but who needs to swing a cat when they're dog friendly?  Water bowl outside and the place is packed (which amounts to 6 or 7 people) every time I go.  Most patrons are a grab and go coffee type.  But if you want a tasty breakfast, toast is what they do.  I've had the avocado toast, with an entire avo thinly sliced and artfully placed, a Welsh rarebit with ham, which I topped with a cold tomato bacon chutney, and plain toast with fig ginger jam.  The toast is a thick slice of seeded sourdough.\n\nI really enjoyed all three enough that I make it a point to visit Scullery as an urban hike destination each time I'm in SF.  It's a refreshing take on breakfast when most other places have a traditional and somewhat interchangeable breakfast fare.  Try some toast today!", "author": "LakeLady A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "On my 3 day trip to San Fran. We came across this small and cute coffee shop and decided to give it a shot. We were here every morning. The staff here really know's what they are doing. They take their time crafting your morning beverage. You appreciate your carefully crafted beverage EVEN MORE once you see all the work they put in to their drinks. Our favorite was the special of a \"Burnt Carmel Creme Brûlée Latte.\" A little sweet and a tad bit salty. And the last day I decided to try the special tea. A ginger, lavender, and honey tea. Super refreshing. Especially after a weekend of drinking. I almost wish this place were a chain but I'm so glad we found what I think is a hidden gem in San Fran.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "This review is after 4 visits \n\nSolid place. I mainly go for the Welsh rarebit. I've never had Welsh rarebit outside of here so I can't say if it's authentic, but I still like it. I get it with the ham. \n\nThe bread they use for the toasts are very good. Some thick sliced, multi-grain, seeded thing. Interesting jelly options.\n\nStandard, good quality coffee (for modern day SF). \n\nI read most complaints here are for a long wait. I'm lucky as I go here and no one else is there. It still takes a bit so I ca n see how they can get backed up with multiple orders. \n\nIt certainly fits a toast niche. I often can make good toast at home so I'm not coming here a lot, but it's good if I'm too lazy to make toast and coffee and I got $20.", "author": "Dash_Rendar _."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Great service, amazing bread with butter, and best soy latte I've had in a while.", "author": "Shivan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "Went here for a quick bite and coffee with three of my girl friends. It is a cute little spot with about 4-5 stools lining the interior and \na few out side seats as well. This is a place that seems very grab and go friendly, not somewhere you stay and chill. \n\nWe ordered and shortly found some seats together inside, so the wait wasn't horrible for seats. I ordered a soy chai tea latte and a cream cheese toast with habanero mango jelly. My friends ordered a gibraltar (in between latte and a cappuccino), soy latte, avocado and pbj toast. \n\nAll the coffee drinks were nicely made with those barista designs. My chai had the perfect spiciness and sweetness I look for. Out of all the toasts, my favorite was the avocado one. It was a close call that I didn't order it. But I knew that it would be much heavier so I went with the cream cheese. My toast was yummy. The jelly was a little spicy but not over bearing and there was a nice schmear of cream cheese to hold up to the multi grain toast. The pbj toast was good as well. The presentation was the best on this toast. \n\nThe staff was mostly behind the coffee 'bar' and was eagar to help, but they were also very appreciative that the patrons would bring their trash and dirty dishes to the counter. \n\nI liked this place, def recommend checking it out.", "author": "Tanya E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "The best avocado toast!!! Wow. Wouldn't get the matcha latte again but the toast was incredible and enough to share with 2 people. Limited seating inside.", "author": "Kailee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "While walking around after lunch, we passed by this newly-opened cute little coffee shop. I didn't get my morning cup so I had to try some of their's. While San Francisco has a HUGE amount of good coffee shops, (I haven't even tried half yet...) this new one is worth going to more than once. \n\nScullery is located on Geary Street in the Tenderloin district of San Francisco. The parking situation is mostly street parking. There's always parking in the Union Square Garage or the O'Farrell Garage. I always like the O'Farrell one just because they valet on each floor and that wastes less time. I like to get in and get out in the most minimum amount of time. (wasting time is a pet peeve of mine...hehe.) \n\nScullery is by definition a small room or part of the kitchen where washing up and preparation is done. That is exactly what the space looks like; except with some modern touches. (aesthetically clean.) This coffee shop reminds me of the ones in Manhattan, small enough to seat 4 to 5 customers. Customers can come and get a cup with a pastry to go. They brew with beans from Sightglass and feature pastries from Jane's. They had some huge chocolate croissants and plain ones which I totally wanted, but was still full from lunch. Next time! \n\nI ordered myself a Burnt Caramel Latté which seemed like an interesting flavor. I must warn everyone though that this latté is VERY sweet. It's more of a dessert-like espresso drink. I could definitely taste the caramel in it. For people with a sweet tooth, this would be a good pick for sure. I had to get a cup of water for myself. I'll probably stick to my regular latté or cappuccino next time.", "author": "Julie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "What a gem! So glad this place is in my neighborhood! Delicious toast with gluten free bread option. Highly recommend the burnt caramel latte. Cool minimalist decor that doesn't overwhelm in a small space. It's a tiny space so either get there early and snag a seat or grab your coffee to go. One of the best coffee places in the city!", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Fantastic brunch/breakfast spot. This was a very small place and would be easy to miss if you were not looking for it. \n\nWe got different toasts and they were delicious.  The almond butter and jam toast was amazing.\n\nThe avocado toast was the best of the bunch. It was so well seasoned and the avocado was beyond fresh. \n\nThis is a must stop in when in san fran.", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-09", "description": "The tiny place is adorable however the service and coffee was not. A young woman greeted me with a whisper and I placed my order. I kept asking her to repeat herself and finally she raised her voices level I could discern. The kippers sounded interesting. I also ordered brewed coffee. Prices are reasonable. \n\nFound myself a place at the window and took a sip of the coffee. Burnt. Prolly sitting on a warmer too long. It took an amazingly long time to toast bread and poach an egg. Since kippers are new to me I don't know if they were good. What I can say is the  smoked fish was dry. The egg was delicious and the toast it's served on grain filled and good. \n\nIf I return I'll try something else.", "author": "Todd R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Prior to coming here, I read another review saying how they know how to toast their bread just right... I didn't really know what that meant, or think much of it... But now I do! They have the perfect bread for toasting and it's toasted to the perfect crispness. And the the addition of pb and and spicy jam is the perfect touch! The toast is crispy on the outside and chewy on the inside... And the spicy jam (including several different options) is a unique touch! We had this while traveling to SF...but now I can't wait to be able to come back to town for more!", "author": "Beth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "4.5 stars for some amaze-balls avocado toast, served with butter, garlic oil, salt and pepper! Friendly baristas, beautiful but small space, interesting coffee combos (\"The Tenderloin\" comes with condensed milk and they offer burnt caramel Recchiutti Lattes!).\n\n* Avocado Toast - 4.5 STARS ($8): A full ripe avocado, sliced beautifully on sliced seeded, fresh toasted bread. The combo with the flavorful garlic oil and butter was incredible because it made it *that* much creamier. My only gripe is that I'm not a huge fan seeded bread, but it was still good.\n\nThey kindly allowed me to sample the fig ginger chutney and passionfruit apricot jam. The Fig was great, super chunky, a little tart. The passionfruit apricot had a great flavor but was too sweet. Next time I'm definitely coming back for the Welsh Rabbit cheddar chutney toasts!\n\n- No Wifi\n- Cozy, limited stool seating (~8)\n- Jane Pastries\n- Stumptown coffee, Recchiutti chocolate and caramel, 5 Mountains Tea", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "The BEST avocado toast of your LIFE! This is my go-to place for avocado toast! Yes, it's something you can probably make at home. HOWEVER, I am a woman of convenience and I am always down for a place that makes my life a little easier. Anyway, depending on who makes your toast will determine the enjoyment you will have(that's why i deducted a star) LOL ! Always a good meal after a morning run. Don't forget to add the Burnt Caramel Latte, superb with a little bit of cinnamon and brown sugar. Parking is not terrible, especially during the week. Though it is quaint, I always score a seat to dine-in (:", "author": "Kimberly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Hidden gem alert!!!! Little space that serves up a great cup of coffee and even better toast options.. \nyou might be asking now .. toast? What? \n\nNow order the follow and judge for yourself; \n-Avocado toast: if you like avocado you'll LOVE this \n-Cream cheese toast with oil and fresh cracked pepper was bomb! \n\nAs for the coffee? \nBurnt caramel latte... no questions asked, just order it now", "author": "Pattie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "Super cute cafe. Went out of the way to try their avo toast. Love the yellow. From the stools to the cups. Wish they would serve me the toast on a yellow plate as well. hahah\n\nI got the avocado toast and it was super tasty. The staff was super friendly. Limited seating. The coffee tasted great but only complaint was that my latte art. I didn't get much art. Over all it's a great cafe and great addition to TL.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "This place is the most bomb spot for toast you could go to in the city PERIOD. You definitely get your money's worth!! Their chai lattes are delicious. My friend ordered the avocado toast ($8) and was delightfully surprised that they literally put a whole avocado on the toast. They definitely don't skimp you like many other places do. I got the almond butter & passionfruit habanero toast ($5) which was so delicious. You could tell they were putting love into what they were making. Not only did it look great, but it tasted even better. The toast itself is absolutely incredible. This is now my go to spot for a quick breakfast/brunch. 12/10 would recommend to anybody I know!!!", "author": "Sofie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "Fairly expensive for a coffee, but I thought it was worth it for a nice treat. I had the burnt caramel latte and it was great! The server was very attentive and quick. Payment is easy. This place is more of a stop and go place, there is not really room to sit down for a while so maybe grab coffee to walk around.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "This small but cute little coffee shop opened up a block down from us, and every morning on my walk to work I see the menu with its cinnamon sugar toast calling to me. The problem? I'm not a coffee drinker. So, I waited until the weekend to stop in with my coffee-loving boyfriend so we could give the place a try. \n\nFirst and foremost, the staff is lovely, and the place is so well presented. It's very small, only about seven or eight stools, but the menu is large. They have every kind of coffee you can think of, hot chocolate, and kombucha, and then a wide array of toasts. While their other customers ordered the healthier options of avocado toasts and such, and they all looked delicious...I came with one toast in mind and was so ready to finally get my hands on the cinnamon sugar toast. \n\nWe ordered just that, with a hot chocolate for me and a standard brewed coffee for the boo. The food comes fast, the drinks even faster. My boyfriend liked the coffee, he said he'd definitely be back during the week since it's so close to our apartment. He also loves that they sell bags of Sightglass coffee, which he loves to buy and bring to work. \n\nThe toast was delicious! Perfect size for one person, next time we will order two rather than sharing. But it was buttery, cinnamon and sugar deliciousness in every bite, I loved it. The butter makes the center a wee bit soggy, but then the sugar kind of melted into it there and I could not complain. \n\nSo why four stars only? The hot chocolate. Of course this place is a coffee shop primarily and so it's understandable that the coffee is the priority. But for non-coffee drinkers like me, hot chocolates have become a go to option when friends wanna hit up a coffee shop. The hot chocolate here was waaaaaay too watered down, you legitimately can barely taste the chocolate. It feels like you're drinking warm chocolate water rather than hot chocolate and that's not a good look. Next time I go I wanna try to kombucha, and mention that they should maybe rework how they make the hot chocolate. \n\nOverall, super cute place with yummy food and good coffee. I think it's a great addition to the neighborhood!", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "I am Very Happy with Scullery Coffee!! In Tenderloin!!\n\nNice energy!!\n\n@the.secret.lab\nPablo Gimenez Melo\n(Neighbor)", "author": "Pablo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Cute little local coffee shop.  Amazing almond milk chai.  Has a variety of toasts available for breakfast!  Small seating area on tall stools.", "author": "Laurie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Great addition to the neighborhood and this stretch of Geary! Along with Jane and Hookers, Scullery joins a great group of coffee shops in \"tenderloin heights\" and I'm very impressed with the coffee, food, and service after my first visit this morning.\n\nThe shop itself is pretty small--maybe 8 stools? Bright yellow stools and beautiful wood counter tops. I had a latte and the cream cheese toast with olive oil, salt and pepper. My partner had the sausage croissant from Jane.\n\nLatte was ONE OF THE BEST I'VE EVER HAD! Give your barista a raise! So so good! Cream cheese toast was really yummy too. Reminded me of the toast at the Mill. Pastry was delicious--as expected--we love Jane pastries! \n\nOwner and people who work here are lovely and not pretentious. As with all new businesses in the rapidly gentrifying Tenderloin, I hope they donate leftover food to shelters/pantries and hire/train people from the neighborhood. A \"charity of the month\" jar and some sort of matching by the owner would also be a nice nod to the nabe. Can't wait to return!", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "tried the breakfast special - Yorkie.  Yorkshire pudding with eggs, bacons and goodies.  Long wait because they cook it fresh.  Solid items", "author": "Robert H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-09", "description": "Good food. Loved the burnt caramel coffee. Ridiculously over priced for toast. Bread is too tough so makes eating really hard.", "author": "Aamnah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Delicious. Small cafe, quick and friendly service. They even made some sample cold brew for us to try while we were in the shop. \n\nI had the chai latte, which was quite good, but the standouts are their toasts:\n\nThe avocado toast: so simple, yet packed with flavor. I think they use a garlic oil or something with generous amounts of salt and fresh cracked pepper\n\nSpicy ABJ: almond butter and your choice of jam on toast; I chose the passion fruit habanero jam; very tasty, but I wish the jam had more of a kick. I could barely taste the habanero.\n\nLimited bar seating, but it's kind of an in and out type of place. Perfect for those lazy Sundays, when you wake up late, want a bite, but don't want to wait hours at typical breakfast and brunch places.", "author": "Cynthia X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "We had trout toast chi latte, cold brew and a yorkie. Delicious! Super friendly. Lots of regulars in and out.  Highly recommend!", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "Small place with a variety of toasts and coffee. Recommend getting the food to go since there is only about 6 seats in the shop. Had the Avocado and Smoke Trout. Both were good but the waiting for the toast killed the experience. \n\nTook about 25 minutes just to get the two toasts. There was only one person making toast and unfortunately her process was slow, practically making one toast at a time. It's morning rush time, someone needs to train them to make these toasts quicker and at least get two people making it since you have room for it. \n\nAgain, good food but slow to get your food. Maybe avoid the rush times for a better experience.", "author": "Kei T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "Avo toast is one of those things you *could* make yourself but it tastes much better when someone else makes it. Scullery's is served on a thick seedy piece of toast and has a full avo on top. It's topped with chunky salt and freshly cracked pepper. I found the price to be reasonable for the quality. \n\nWhy only 3 stars then? For some reason service was slow and forgetful and it didn't appear to be that busy. People came and went and got their food while we waited (to be fair idk if they do call ahead). I think they forgot entirely we ordered coffees. \n\nIf you come here bring your patience and don't be in a rush. Probably more of a takeout place since there's limited counter seating. The avo toast was good enough for a return trip.", "author": "Tara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Delicious freshly baked bread pudding and smoked trout on toast. Coffee was excellent too", "author": "Lesley-Anne F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "If they play their cards right I'm predicting an expansion. Their coffee beats blue bottle by arms length and their mini breakfast options are pretty unique\n\nI tried the Welsh rarebit with ham and cranberry chutney and it was very interesting to my taste buds to have aged cheese an sweet chutney in the same bite but I thoroughly enjoyed it\n\nI'm glad I gave these guys my business instead of the usual breakfast establishments where you have to stand in a 30 minute wait", "author": "Vikas J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Ordered a Gibraltar and a toast w/butter. Both were top notch and full of flavor. The Gibraltar was creaming and milk steamed to perfection, I think their espresso is very good too. Now the toast was amazing, big thick slice of bakery fresh multi grain goodness and spread with the perfect amount of warm butter. Like the aesthetic of the place and cute little front seating room. Service was friendly and helpful.", "author": "Andruw M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "Avocado toast, your garlic oil, saltiness and thick bread saved me from an even worse hangover than I already had. Many thanks!!! I watched the man who made it for me and could tell that he infused it with some love energy. The brewed coffee was just ok. I wish that I had seen the pour over option earlier. There were many toast options that I would come back for!", "author": "Jana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "OMG! The coffee kinda melts in your mouth and the avocado toast was the best thing I've tasted in a long time. Plenty of avocado, sea salt, cracked pepper and olive oil - so delicious. 10 of out 10", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "BEST AVOCADO TOAST YOU'LL EVER EAT IN YO LIFE!!!! If you're in San Francisco this is a must stop. Tiny space with no place to sit really except a few seats but that toast is phenomenal and you won't regret it.", "author": "Razan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Such a simple concept of coffee and toast and it is SO dang good!\n\nWas walking around for some coffee and randomly stumbled upon this cute little gem. Immediately my eyes read \"avocado toast\" so of course I had to have it and got myself a nice burnt caramel latte.\n\nAvocado toast was EVERYTHANNNNNG! The garlic oil and the hefty amount of pepper was right up my alley and the bread is from the baker that used to work at Tartine so how can this not be a win?\n\nCame back two days later and ordered the cream cheese toast and the spicy pb and blackberry jelly (they have some interesting spicy jellies but I wanted something sweet) and both were so good!\n\nPlease do yourself a favor and stop by this place -if not for the good coffee but that avocado toast!", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "Another one of those \"hmm i wonder what's good to eat around here? Let's see what's on Yelp.\" This place is small...practically just a store front really, a few bar style seating spaces as you walk in, but it's nice and cozy. We ordered a Welsh Rarebit with Ham, Cheddar, topped with Fig and Ginger Chutney..also we ordered the Smoked Trout.\nThe Rarebit was pretty good and having the Chutney added a nice extra level of flavor..have to wonder if a different flavored Chutney would've been better, maybe I'll find out next time, maybe. TheTrout was a surprise for us. At first it didn't seen like much, only an upgraded tuna sandwich..but the more bites we took the more we enjoyed the flavor of it. Not a bad place overall, but not too memorable.", "author": "Orlando J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "One of my favorite breakfast places in SF! The bread that they use to make the toast with is amazing, and the ingredients are really fresh. \n\nIf you're looking for a quick bite in the morning this is the spot to go. If you're looking to sit down and take your time with breakfast this probably isn't the right spot - as it's pretty small and limited on seating. I usually get it to go and walk home to eat. My favorite is pictured - the spicy pb&j! The coffee is also really good.", "author": "Drew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Coffee (burnt caramel latte) was delicious. We didn't get any food on this stop, but the roasts that were coming out of the oven was amazing. We ordered a cup of milk for our daughter, even the milk was awesome.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Scullery offers SIghtglass coffee, pastries and toasts in many flavors.\n\nfriendly greeting, legible, understandable posted menu, quick service.\n\nbrew: 12 oz sightglass (3)\n-so smooth. fav light brew, easy sipping\n-thought i outgrew sightglass for bold brews. Nope! still love sightglass.\n\ndrips:\n-just a few seats inside. outside none?", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "Such a cute little hole in the wall place in the Tenderloin and fantastic toast (lots of chutneys to choose from, and avocado toast), and coffee. They use high quality products (the chutneys), the bread is delicious with filled with seeds and other grains, and they have sweet and savory choices for the toast.\n\nThe place is really tiny with only about 8 seats so if you're planning to come here on a date or with more than 2 people, you may want to try somewhere else. There's not a lot of seating and it's all bar seating along the wall/window, so it's not somewhere to come and eat/do work for hours on end.\n\nIt's not necessarily cheap but the ingredients are all excellent, so it warrants the higher prices. The burnt caramel latte ($5) is made with Recchiuti caramel - you can find their shop at the Ferry Building and it tastes delicious - so unlike the syrupy, overly sweet caramel lattes you get at Starbucks. If you like caramel and coffee, get this latte - you won't be disappointed.\n\nThe avocado toast ($8) was really good - I liked the bread a lot: pretty hearty with seeds/grains for more wholesome bread. The avocado was sliced and there was a generous amount - it was tasty with the garlic oil, salt, and pepper. I'm still partial to the avocado toast at Jane because I love the pickled onions and the poached egg. But this is a close second or third to Jane -- I also like Provender in Potrero for avocado toast.\n\nI'll definitely come back here again for coffee and toast. Can't wait to try the one with cheese, and chutney - there are so many different variants to try. I'd give this 4.5 stars, taking off 0.5 stars because it's a little cramped/crowded and the food will take 5-10 min to make (so plan accordingly if you're in a hurry). But excellent & cute and a great addition to the Tenderloin.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Cute little place. Love the yellow chairs and coffee cups. I will definitely be back and being friends.", "author": "Andrea N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Perhaps the most memorable coffee I've had in recent memory. A delicious burnt caramel latte, where you could actually taste the flavor of the caramel without being too sweet. Pair this with some delicious avocado toast, and you've got a grand start to the day! \n\nMy only gripe was that there was perhaps too much avocado (gasp!) on the toast. It was perfectly ripe and topped with salt and a garlicky oil, but I ended up scraping off 1/3, just so I could fit it in my mouth.", "author": "Josh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "How cute! A little hole in the wall coffee shop on Geary. Pick up some coffee and bakery goods here before you gallery hop your way up and down the street!\n\nBaristas are radical, coffee is great.\n\nBonus--They serve pastries from Jane, which is an amazing bakery and cafe in its own right. The toasts at Scullery look absolutely unique and delicious.", "author": "Kathy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Such a nice place! Highly recommended! Food and coffee is great and prices are fair. A small place but if you are lucky you can find a place to sit.", "author": "Lars J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "Deargod!!! WAiting so ridiculously long for ONE vanilla latte. There were maybe three people ahead of me.  I'm watching the one guy at the espresso machine moving at his own pace and making one drink at a time...and BTW there were like 3 or 4 people back there. They were chatting at times...I felt bad after being frustrated it took so long when those three that were there ahead of me didn't get their drinks either till just before mine.", "author": "Jess L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Slow service: three people in front of us and waited at least 5 minutes for my drink. Went next door and ordered cooked food which was ready at the same time. My mocha was tepid when I got it. Nothing special on my first visit.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "So there is a Tenderloin God:\nNitro coffee\nAvocado toast with garlic oil\nFloor to ceiling glass window to Geary st without the crazies coming in\nDog friendly\nNice people\nThree chutneys and two jellies!\nLess than a block away\nYasss", "author": "Samia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Scullery's is a must go, great service, coffee and the avocado toast is PHENOMENAL (The Spicy ABJ with passion fruit jelly is great too).\n\nLimited seating space, but you can order to go too.", "author": "Miko F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "I'm loving this place. The coffee is great. The staff are friendly. The toasts are delicious. I've had the avocado, trout, and spicy chutney/almond butter.... so good!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Diamond status!! Great coffee and the avocado toast is fantastic ! The staff was super friendly. I will def be back to this little gem when we return to S.F", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "MUST GET:  Welsh rarebit with chutney!! So good. The chutney I chose was the tomato bacon, it was light on the bacon but I didn't care it all tasted yummy, it's more like essence of bacon :) lattes or point.", "author": "Casie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "I love this little coffee and toast shop! Service has always been friendly and prompt, the coffee fresh, and the plethora of toast topping choices is sure to overcome even the pickiest of toast-eaters. \n\nI highly recommend the PBJ or ABJ with passionfruit jelly! I nearly always get the avocado toast though, but I do think the garlic can be a bit overwhelming. Sometimes that's just what I need though. But honestly, I think it's the bread that impresses me the most- it always tastes fresh, it's packed with grains and seeds, and cut at the perfect thickness. \n\nAll-in-all, this is a bright breakfast joint in the TL that I can't help but keep coming back to.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "It's hard to elevate toast. It's hard to be memorable amongst the numerous coffee shops in San Francisco. Scullery manages to do both. It may have been the lights made with repurposed rulers or the quaint and cozy store front or the friendly service that left me with this impression, nonetheless this tiny toast spot stuck with me. \n\nThe toast itself is solid, but in all honesty it's hard to mess up toast. Having said that, I've seen it be done. I applaud Scullery for their decision to focus on a small number of dishes, but this may be due their space limitations. Still, the toast comes out well done and mine had a nice crunch. I had mine topped with raspberry jam and salted butter. There was a proper jam to butter ratio allowing for a great balance between the two toppings and the bread. The grain filled bread was the true star. It tasted like a wheat sourdough mix filled with lots of grains and seeds. \n\nThis shop is built for a light breakfast. It a true grab and go type shop.If you find yourself in this area and are looking for a light breakfast then head to Scullery.", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "$10+ for toast. really? I am a millenial, but I do not appreciate this place for a number of reasons: \n1. walked in, the crowd was really rude, we were trying to figure out what to get, and politely asked this guy if he was able to move over a little-- with a snarky look and a bit of an angry demeanor, he moved over, only to step back into his original location as he engaged in a convo with a friend of his. The owner(?) watched this go down, and did nothing. They do not have menus that can be read off of a piece of paper, which makes this process very difficult. After finally ordering our toast, we paid $28 for 2.... and waited about 45 minutes for toast... you can see why I am angry. This is the slowest moving restaurant I have been to thus far in SF.... I have been to a lot of slow places, but this takes the cake. \nWe left the establishment, vowing that we will never return, and we definitely have not looked back at all. (this post was supposed to go up a year ago)", "author": "Anonymous T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "My wife and I recently visited a long time friend in San Francisco and found ourselves at Scullery two out of the four mornings we had in SF.  The burnt caramel latte was a touch of heaven.  No need for sweetener, but also not too sweet.  It had a rich flavor without being overpowering.  \n\nThe avocado toast was good on our first visit...it does not soggy up the toast as it is neatly sliced and placed the toast and seasoned with cracked pepper and sea salt.  It also checked the box on \"white boy hipster who loves avocado ate avocado\" which I was hoping to do since I booked my flight.  My wife, however, hit it big by ordering the Welsh Rarebit.  It is a simple dish - thick whole grain toast with melted aged cheddar.  The wife threw a curveball and asked for an overeasy egg on top.  You can also add ham or turkey.  I had one bite and was sold.  Our first visit was great as we had a long chat with Mauricio and Chow and they gave us great recommendations for things to do and places to see around the many o.  Side note - it's not in the heart of skid row, but it is right on the edge of it.  RIGHT on the edge.  You often see seedy characters walking by and even peeking in to ask for money.   We were thrown and upset by the homeless situation.  Aside from that, we would highly recommend this place to anyone who loves great, unique, and delicious food and drink served with a smile.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Amazing coffee and toast, basic menu but everything is so flavorful.   This place is smaller, but a must stop on the way out to explore beautiful SF.", "author": "Rob H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "One of my favorites in San Francisco. Avocado Toast and Spicy PB&J (with passion fruit/mango/habanero) are must tries! Latte was perfectly crafted as well!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-08", "description": "The only reason I'm giving it two stars instead of one is because a) you have to be pretty shitty to only have 1 star. That means service and food are both very poor; and b) because the man was nice.\n\nBut for a $4 americano, I expect greatness. A well-balanced roast, with hot ass water, ready to go.\n\nIt was far from that. And so was the $3 drip. Watery as can be. \n\nI should have stopped myself from buying a croissant too, which, at $4.50, wasn't BAD, but I could get a dozen from Costco that were better. \n\n(I'm literally struggling to tear one apart as we speak.) \n\nI'm so sorry Milkbean, I won't cheat on you again.", "author": "Tiba G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Tucked away gem! I particularly love Toffee Nut flavors and was shocked to see fresh made toffee as the special flavor option. I ordered an americano with toffee nut and it was one of the best I've ever had. The fresh toffee is very unique, I'm sure it would be incredible in a latte. If you avoid dairy, it goes very well with an Americano.", "author": "Jody M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I happily found this local coffee shop! It's a perfect easygoing place. The coffee is great and service is better.", "author": "Raelynn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Looking for a quick breakfast and yelped this place. Had the welsh rarebit with ham and avocado toast. Simple and tasty. Great coffee too.", "author": "Dean Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Wow. Whata latte!   Burnt caramel. We happened upon this tiny eatery while grabbing a breakfast sandwich next door.  As I told the friendly gentleman behind the counter, if I had only seen his sign before we ordered. Everything on the menu looked wonderful I did get the burnt caramel latte and was SO WORTH IT. Don't miss it.", "author": "Ginny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Stopped by for the first time after reading all the great Yelp reviews! It's a great little spot to have in the Tenderloin. Of course, there's the pricey toast and coffee but it's worth it if you are looking for quality. I had the:\n\nWelsh Rarebit Toast\n$7.00+ham \nwith Grilled aged farmhouse cheddar and yummy Chutney on top. \n\nAlso, the very tasty:\n\nBurnt Caramel Latte\n$5.00+\nMade with Recchiuti chocolate.\n\nOverall, it cost me $14.50 but like I said, it's for the quality. Customer service was fantastic as well. Will be coming back.", "author": "Leila H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Delicious coffee located near union square. Ordered their burnt caramel latte which was perfectly sweet! They also have a variety of toasts which I will be back to try!", "author": "Kat T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Still my favorite spot in the neighborhood! I used to walk to Jane every Saturday for breakfast, but I've switched it up and made Scullery my coffee shop of choice. I also grab a latte on the way to work once or twice a week. \n\nThey've expanded their menu, but I rarely stray from the avocado toast (without butter - makes it vegan!) and soy latte. I've tried the burnt caramel latte and it's AMAZING, but I save it for a treat every now and then. The welsh rarebit it delicious and they get pastries from Jane, if you're ever in the mood for a croissant, they stock the best.\n\nEveryone who works here is really nice and I just generally enjoy the atmosphere. Things may take a bit longer sometimes, but it's worth it. It's great to see them doing so well! :)", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Best find in years!  \nWho knew toast could be this good.......\nI stumbled on this little gem while trying to find parking.  \n When i say toast you might think easy we all make toast at home.  Well your wrong.\nNever have i had  tasted toast this good. \n I tried the avocado toast because i was trying to be good.\nWOW!\n  To be honest it sounded a little weird but OMG i am addicted.  I've tried to recreate\nthis masterpiece but just can't find any bread that comes close.  \nCoffee is great too.\nThe smoked trout rocks too.", "author": "Georgette S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-22", "description": "This was supposed to be the best cappuccino I've ever had. The portafilter was meticulously cleaned for a couple minutes between drinks, the grounds weighed three times ensuring the perfect shot. Everything is going great - the barista even warmed up by making drinks for a couple people who ordered after me - the scale is placed under my cup and the shot starts to drip. I've been watching intently for the last 15 minutes, anticipation building, as this magnificently detail oriented barista prepares what looked to be the ultimate espresso drink.\n\nMaybe I built it up in my head but what I got wasn't the drink I had been waiting a lifetime to experience. It wasn't even the drink I had been waiting 15 minutes for. It was the cappuccino that I'd expect at an airport kiosk - sloppily pulled and poured, neither wet nor dry.\n\nIf you're going to treat coffee like a middle school science experiment the least you can do is make the drinks in order, even if they leave something to be desired.", "author": "Otto Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "5 stars for service \n3.5 stars for food \n3 stars for value - see my avocado toast pic. \nOverall a lovely cafe in the TenderNob. Though prices are too high. Avocado toast and small coffee for $11? Better go to Jane and get a well crafted avocado toast with an egg and a latte for the same price. I've had their rarebit and their", "author": "Miriam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Good espresso (sight glass beans) but barista is moving slow and managed to forget my order. 20 minutes to get a one shot espresso even though she only had to make 2 drinks before mine, barely an apology.", "author": "Vincent M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "The best little coffee shop in the neighborhood. The staff is so kind and super friendly. The avocado toast is soooo good!!!! And of course my favorite the latte:)", "author": "Izzy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Awesome neighborhood cafe.  The deco is very unique and chic. Service is great too.  Love the pain au chocolate croissant!! Will def come back again soon!", "author": "Jen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "It's not as good as it seems.  Their avocado toast is not that special, you can easily make it yourself.  I wouldn't walk all the way there to get their coffee and eat since they are not that special and it's located in tenderloin - a very dangerous area.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "This cafe is small but super cute! It's on my way to work which makes it convenient - and it's close to a lot of hotels in the Nob Hill area. It's away from the rushed busy-ness of Union Square. You order at the counter - menu has all the coffee drinks you'd expect but I usually go for a cup of PG Tips tea. If there's a stool free to sit at, say you want your order 'for here' and your hot drink comes served in a cute yellow cup and saucer with a little spoon that looks like it came from your granny's silverware drawer. If you're hungry do not miss a chance to order a Welsh Rarebit toast - and you get to pick from a half dozen yummy chutneys they'll add on top. They also have avocado toast and PB and J. Everything is quick and scrumptious. Totally recommend you stop here when you're in the neighborhood!", "author": "Sonya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "Nitro cold brew on tap, fat avocado halves on thick toast, savory-sweetest jams and chutneys; yes, please! This newly opened and newly discovered gem is my jam! \nService with a smile: We enjoyed casual conversation (and passion fruit, habanero jam samples), while the breakfast baristas whipped up a little magic in a cup and on a platter. \nWanna get a smile slathered on your face?! Start your day with Scullary!\nPS- The space can be a bit too cozy at times, as the cafe fills up fast", "author": "Peter W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "It's Sunday morning..I'm sitting up in bed listening to Phillip Glass and All Things Considered Morning Edition. The suns' warm glare is shining through the window and leaves flutter outside.  I just had a cup of rich, full bodied coffee and a fabulously delicious, generously sized slice of fresh bread slathered in butter and cinnamon + sugar.  WHAT a lovely way to spend a Sunday morning.  \nScullery just opened it's doors on the floor level of my apartment building.  On the corner of Geary and Leavenworth, this cafe is an oasis in the Tenderloin.  I've only found two other really good coffee shops in the TL, and they're a significant walk away (too far for a lazy morning when I'm not ready to fully engage with the city).  Most cafe's in the neighborhood offer overpriced, Folgers grade coffee, and stale and underwhelming pastries (Egregious, really). \n\nThus far I've only tried their drip coffee and cinnamon sugar toast.  Both were amazing- the toast is on par with (maybe even better?) The Mill, Jane, Philz, Dottie's True Blue, etc. I look forward to trying every other thing on their menu.  Next on my list, the Tenderloin Cold Brew and Avocado toast. \n\nTo sum it up: Super Stoked (!!) this place is here.  Quality (and pricing) is competitive with the best and most notable cafe's in the city, honestly.  \n\nOwners: PLEASE offer larger sizes of coffee. Pretty pretty please. I will legit promise to buy coffee from you 3-5x per week if you begin offering a large size.  \n\nThank you! 5 Stars!", "author": "William M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Great cappuccino, delicious sourdough cinnamon toast and pastries from Jane's, a local bakery that is outstanding. This little hole in the wall is funkily decorated with lampshades made from old school yellow rulers, which match the lemon yellow coffee cups. Pricey like all the good coffee shops in this area but has an extra touch of charm.", "author": "Esselli D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "This tiny place makes a very tasty breakfast. Limited menu, but the two egg dishes we had were both delicious. One was flavored with pesto, and the other with sun dried tomato. The bread was fresh and delectable, and the coffee was good and strong. An economical and good place. We will be back.", "author": "Zelda Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Best café in SF! Not because the coffee and food is good, because IT IS GREAT!!! Instead, it's because of the people that work here. The owners  work alongside their employees. Employee is the wrong word, because it like they are one big family. \n\nThe atmosphere here is like I've been transported to another country, but in a good way. \n\nCome support this place. They treat you like family. \n\nOh yeah, you have to try the Nitro-infused Tenderloin. OMG!!!!!!!!!!  #LifeChanger\n\nOh, and Sharon is awesome! I want to adopt her as my aunt!", "author": "Kenneth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "I literally am obsessed with this place since they opened. One thing I really like is that they really know their coffee . In addition to this, their avocado toast is to die for. I definitely recommend this place if you are in the neighborhood.", "author": "Jackie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "First customer and first review!! Great staff and great coffee! So happy to see this place open right around the corner from where I live! Would like if they opened just slightly earlier-I leave for work at 630a!", "author": "CeeCee W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Super cute cafe with lovely staff and delicious toasts! Also the best cappuccino art I've experienced in person.", "author": "Marisa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "I had the avocado toast and the ABJ. They were both delightful, especially the avocado toast, which has a delicious garlic oil on it. The place was clean and the people were very friendly. I would definitely go back!", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "My husband and I were excited to try The Scullery during our weekend getaway in San Francisco. We came across this quaint cafe while searching nearby breakfast spots on Yelp. It's a tiny spot in the Tenderloin district of SF (only seats about 8 adults) with a small, yet varied coffee/tea and toast menu. \n\nWe each ordered Sightglass coffee and avocado toast. Though pricy ($8 each + extra to add an egg), the avocado toast comes with a hearty portion of avocado with a nice hint of garlic oil and salt/pepper. The toast typically comes buttered, but I ordered mine without. I really enjoyed the bread from The Midwife and the Baker...yum! The coffee was well brewed. \n\nWe sat right near the area where the toast is made and could see that it was cramped quarters for the workers and looked a bit messy. I noticed that some of the products they use (i.e. almond butter) are Trader Joe's brand, which isn't a bad thing though would make me think twice about paying for toast I could make at home! \n\nOverall, I'm glad we tried it and a good spot when in the mood to splurge on toast.", "author": "Erica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Fantastic new coffee place, friendly service and cool styling. Toast was tasty but a bit pricey for what you get.", "author": "Edward L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "My companion and I, as Italian were in hight need for a good coffee. I looked up on yelp and happily found this local shop! It's a perfect easygoing place where have a break or take away. We had delicious croissants and nice chats with the cosy stuff. We also had great tips about old local restaurant in the city.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "The best gluten free toast I have ever had...the avocado toast was so fabulous I had to return 2 times in a three day stay.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Come in here if you do like good customer service, great coffee and awesome toasts. \nIt has just opened and we can't help coming here every weekend. Keep it up guys!", "author": "Neil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Split smoked trout toast and avocado toast with hubby. Both were fantastic. The bread by itself is heaven. The burnt caramel coffee was possibly the best cup of coffee I've ever had in my life. Hubby very much enjoyed his cafe au lait. Be aware though that there are only about six seats in the place so if you are eating there you might want to go early. I think they do take out but the coffee presentation is worth having it there.", "author": "Jeffery M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Had a short line on a Sunday morning, but was well worth the wait. We each had a Yorkie (Yorkshire pudding) that was great. Our Americano was well made and their version of an iced New Orleans cold brew was more subtle less sweet than others - which made it more refreshing.", "author": "Joe K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "LOVE this newish neighborhood spot! My go to's are the Nola Kola with almond milk (wish they had larger sizes so I could get more of it at one time) and the Avo Toast. Recently tried the Pesto Egg Toast which was yummyyyy also appreciate that they are consistently bring in new menu options. I live a block away and call ahead to get my toast made so its ready for pick-up when I get there! Staff is friendly and the interior/branding are spot on.", "author": "Raissa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "A great little find. Extremely friendly and sweet woman working behind the counter, presumably the owner. Great coffee. The Yorkie popover of sorts was good, albeit a little under flavored.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "This is very convenient tiny cafe. The toast was delicious and the staff was super nice. I will definitely go back there again.", "author": "Lola P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Excited about the opening of Scullery - love the cold brew and (of course) Welsh rarebit with chutney (especially the tomato!). Look forward to trying the entire menu...", "author": "Alison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Really great coffee and their toast is AMAZING!!! Had the almond butter and apricot spicy spread and the avocado toast both were so good!!! The staff was super friendly and helpful and explained their ingredients and actually knew about the coffee they were serving. Would definitely stop by again when I go back to the city.", "author": "Brenna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "We tried the Avocado toast and Welsh Rarebit w/ham and spicy tomato chutney! They were both equally delicious. Definitely will be back again.", "author": "Maxine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Great little shop. Without Yelp we probably wouldn't have found this place. Great toast with avocado or cream cheese. We got a nitro iced coffee and a latte that were amazing. Great friendly staff and great vibes", "author": "Hayley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Super cute place. Quick for all of the orders we placed and the fact that they make the toast fresh. The toasts were all great. We had the plain, the cinnamon, the peanut butter, and the avocado. They were all amazing!!", "author": "Michelle U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "Weak and bad coffee. Expensive tea. Barely any food choices... Not sure what this place is.", "author": "Ashwin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "Literally a toast and coffee place and it's fantastic! The avocado toast is so good!  Highly recommended must try place.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "I was a little thrown by the description as a breakfast/brunch option.  It is a very small coffee shop that serves pastries/toast, and by that I mean pretty substantial toast, like thick cinnamon, spicy PBJ, avocado, etc.  So I was a little disappointed, but the coffee was great (cappuccino), the very substantial French toast my husband had looked delicious (and was according to him). Everyone behind the counter was super friendly and business was steady, with obviously lots of regulars. We'd definitely go back for coffee and toast.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Best damn cappuccino!! Absolutely awesome! The organic coffee they used is very good  and the barista takes his time to \"hand carve\" it:)", "author": "Banu G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "Their toasts are delicious and their coffee carefully prepared. You need some extra time if you plan to have breakfast here but it's worth the wait. I like the fact that they don't have WiFi, it invites you to watch the streets, the passersby... The music selection is wonderful to start the day with.", "author": "Elia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Amazing! My husband and I got the cream cheese toast, black coffee and the burnt caramel latte. The toast was phenomenal and decadent. The latte had great flavor without being overly sweet. The black coffee was delicious! Picking a toast was challenging because they have so many delicious looking options! Best of luck to you in making a selection. I think you'll win no matter what.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Went here with my friend and we loved it. The service was good, the place was cute, the coffee was good, and we both enjoyed the toast! We will be going back!", "author": "Allie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "I'm excited that this place opened. Happy to have a new place to get a good coffee and a quick snack on my neighborhood. The coffee was fantastic, and I really enjoyed Welsh Rarebit, especially with Allison McQuade's chutney (both her are her chutney are the best!) . However, I'm sorry to report that their Avocado Toast left something to be desired, mainly ripe avocados. The avocado was completely hard, so much so that I didn't want to eat it, and when I told them they didn't offer to make me anything else or give a refund. It seemed like they were aware of this problem because he admitted that they are still trying to figure out where to source their produce from. I hope they are able to figure this out soon because I am very hopeful about the place. When charging $30 for two coffees and two toasts... i think they should step up their 'cado toast game a bit!", "author": "Drew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "I was in grey mood but Scullery picked me up a notch. I had a latte alongside welsh rarebit with tomato chutney. Their tomato chutney is a great balance of sweet and savory. The space is pretty small with stool seating for ~10. Most people order to-go. Nice offering for the area.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Love this place! Great coffee, super friendly and the toasts and sandwiches look so good!", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Amazing coffee, delicious toast (especially the ABJ with raspberry), and great customer service. A bit small if you're looking to sit in, or if you're in a rush... But great for takeaway.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Delicious toast, good coffee, and friendly service. Best shop in the neighborhood for sure!", "author": "V V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Wow! Just tried the Tenderloin cold brew coffee and the spicy pb&j toast and they were both extra delicious! This is definitely the best new addition to the neighborhood. The staff is super friendly as well. Great coffee shop, excited to keep going back to try all the unique items on the menu.", "author": "Marissa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "ABJ toast - Almond Butter and spicy pomegranate jelly toast is my jam!! I'm so hooked on that and the coffee. The owner and baristas have been great. They put out a water bowl for my pup. Try the spicy jellies and toast. Delicious!!!", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "The cappuccino I had was served at the perfect temperature and the design on top looked amazing. Great new place across the street from my studio. 5/5 recommend trying it!", "author": "Noah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Scullery is a brand new cafe that offers premium coffee and Scottish breakfast cuisine.  Both the coffee and the food are outstanding.  Try the cold brew coffee and Welsh Rarebit with tomato chutney.  Also, the service is very friendly.  Definitely recommend this place!", "author": "Johnathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Great, brand new coffee shop!  I tried the peach chutney habanero and cheese toast... so good!  Thought they served beer, it's actually coffee on tap in a nitro keg.  This place is a great addition to the neighborhood!  Great, new locally owned business.", "author": "T. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "We're 2 Aussie coffee snobs who fell in love with this amazing, quality coffee. These guys know their stuff.. Food was simple but delicious - would highly recommend!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I am a regular here ever since they opened. They have got awesome espresso, sandwiches and midwife and the baker breads and pastry. My favorite sandwich is smoked trout. Sharon, the owner and the sweetest Scottish lady and her team really make this place homey and their guests feel welcome.", "author": "R C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "Cute place but super tiny.  I had a chai latte with the smoked trout toast. Very, very tasty and prices are average but the wait was FOREVER.  I wanted to like this place more because small spots are the norm in SF but the super long wait for a chai and toast with no one else in line deters me a bit.  Maybe one day.", "author": "Angela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Cool little spot for a quality coffee and quick bite. Hip, modern decor; bar style seating; and friendly staff.  Seems like they use quality ingredients and specialize in a variety of toasts.  Owner there says her best one is the salmon.  Have yet to see about that,  Americano was great!", "author": "Rob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "I drink only espresso. The espresso here is very good, high quality and delicious, and a at good price. Also, the staff were very pleasant and helpful.", "author": "Benjamin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "My everyday morning coffee place! Never disappoints and the staff is always super friendly.", "author": "Isabelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Very friendly staff, good electronic music playing, and delicious nitro cold brew. Great place to grab a coffee and a bite, I saw toast and other good stuff on the menu.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Great avocado toast. Strongly recommend the Gibraltar. I'd go back just for that.", "author": "Nandini V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "This place was great!!  Amazing atmosphere, friendly people, and great drinks and toast!!!", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Avocado toast-amazing.  \nSmoked trout toast- amazing. \nTheir sourdough bread they use for toast- kicks butt! \nAnd their staff is so friendly. \nHighly recommended. Don't be fooled by the neighborhood- top notch place.", "author": "Leat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Was walking by here yesterday and noticed they're whole menu was all toast - which is one of my favorite things to have for breakfast. Came back today and ordered the cold brew (which comes out of a nitro tap) and the smoked trout toast. Soooooo delicious. The owner makes the smoked trout herself from a recipe she got from her mother-in-law. Very cute place, and super good. It might seem a little pricey for just toast, but it's delicious and hardy enough that it's worth it.", "author": "Mary F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "This place is amazing! The coffee is perfect and decently priced for the quality. Definitely recommend the tenderloin coffee and the avocado toast! So excited to have such a great little place in the neighborhood!", "author": "Kristin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "average . nice to have options in the neighborhood but dont expect too much from this place .", "author": "Jj N."}
