{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "I live a few blocks away. I would be several pounds lighter had Tony's not opened this satellite store so close to my house. This is the best place to get pizza outside of north beach, by far. I salivate just thinking about it, and I am not really a pizza fan unless it is REALLY GOOD pizza. \n\nI get the Grandma's slice every time. I'm not a fan of the N.Y. style slices, but this is THE BEST!", "author": "Brad C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "True story of how this review came to be: I was taking a workout class next door at BodyRok and I think that Slice House was baking a batch of pizzas...which should be illegal. Because all of the delicious aroma from baking a fresh batch of pizza wafted into the workout studio and when I was trying to hold one more plank or do one more crunch, all I could think about was the delicious smell of baking bread. I knew that I had to check out Slice House.\n\nSo a few days later when I was looking for something to munch on, I stumbled into Slice House. I had always heard of Tony's Pizza in North Beach so I was interested in trying his NY/Sicilian version in the Haight. There are a few regular types of pies available each day with one special Sicilian-style of the day. The slices are pretty pricy but they are very generously sized so sometimes I can even fill up on just one slice. My favorite is the Purple Haze--purple potato, pancetta, rosemary, pesto, feta, oregano, romano, and garlic oil. I know some people may cringe at the idea of potatoes on pizza...purple potatoes no less, but I love the addition! It's definitely a different flavor but the pancetta and pesto and herbs mixed with cheese just really pulls it all together! It's my go-to order!", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-21", "description": "Mediocre at best.\n\nI decided to order dinner because I'm going to be working all night, I wanted something comforting and convenient, and I was super hungry. Most of the photos of this place looked decent enough, the reviews I skimmed were good, and it's less than a mile from me so I thought I could count on a quick delivery for something I could've driven to in 5 minutes or walked to in 15. I ordered Pizza and a Salad and it came out to ~$45. Pretty steep, but I'll try it.\n\nAfter my order was an hour late I contacted GrubHub, because there's no way I'm aware of to get status on food without calling them. I spent about 20 minutes in chat with them for them to call my driver and have him say he was \"5 minutes away\". Um, the pizza place is 5 minutes away. Literally. When she told me this, I googled directions and it gave me a drive time of 4 minutes. By this time, I've been waiting for an hour and a half on an order that had a delivery estimate of 45-55 mins at a pizza place less than a mile from me. She offered me a credit for less than the cost of the tip I'd given when I ordered. Whatever, I just want my pizza.\n\nThe guy delivers it. The pizza is NOT in a hot bag and the lid is all popped up. He's wearing a motorcycle helmet. So he's delivering food on a motorcycle and, beyond that, it's not temperature-controlled. I'm super irritated and a little concerned that the lid wasn't fully closed when he handed it to me, but I'm starving. I go to eat the pizza. It's ice cold. There are a bunch of unexpected random loose fresh tomatoes in there; 2 on top of the pizza and the rest are congregated in a corner, like they slid off. I start to suspect that the delivery guy dropped it. I open my salad. The bag is crushed and the salad is upside down. The balsamic vinaigrette they included with it is a full 2 ounces of olive oil and about a half of a teaspoon of balsamic vinegar. I taste the oil and it's of reasonable quality and not rancid like a lot of pizza places, but there's so little balsamic in there that it's never going to emulsify so it's pretty useless. I contacted GrubHub again to complain. My super-convenient pizza order I decided to pay $45 for out of a desire for comforting convenience? Well, it was a 2 hour ordeal, almost an hour of which was spent chatting with GrubHub support.\n\nSo now you're thinking, she's just giving a 2-star review because of a terrible delivery experience. Not so, gentle reader! Regardless of the coldness, the pizza is tough and mediocre -- It might've been worth 1 more star if it were hot. The crust was dry and had no depth of flavor (cardboard-y is coming to mind). The toppings were overloaded and dumped on in a way that was muddying. The parts of the salad I ate were OK and the cheese (some sort of Gorgonzola variant) was probably my favorite part. The ingredients themselves were of a reasonable quality, but there was no apparent care or attention to detail put into it. I was almost thinking about stopping by and giving them another shot to try actual HOT pizza from them, but then I saw some comments that the owner also owns the pizza place at The Market. I've tried two slices of the pizza they serve there and it was every bit as mediocre. I think it says  a lot (of not good things) about a restaurant group when everything of theirs tastes the same. At least they're consistent at delivering mediocre-negative experiences?\n\nRecommendation: Save your time, taste buds, and maybe some money too, by going somewhere else.\n\nSide rant:\nAre the people calling this NY pizza tourists who went to NY and ate at a Domino's or Sbarro's? I am genuiely baffled as to why people would review this as anything comparable to NY pizza.", "author": "Aly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "The best slice in the haight, hands down!!! And the employees are great, Berry is super friendly and accommodating :)", "author": "sarah i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "It's simple.  This place has good pizza.  In particular I am obsessed with their Sicilian options: they usually have a mozzarella and tomato sauce option and also a special of the day.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "I can't (and won't) give Mr Tony Gemignani any less than 4.0 stars.  The man, the legend, the 12 time Champion of Best Pizzamaker in the World (and counting), master instructor at the International School of Pizza (in Italy), two-time Food Network gold medalist, restaurateur, author and reality television personality -- face it, he's a ROCK STAR.   Whew.  You want a mouthful, I'll give it.\n\nLocated on Haight, mind you, and I like very little about the whole Haight Ashbury area (too many street people, homeless, druggies -- it's dirtier and grittier than Venice Beach).  But to me, this place is like an oasis in a sea of dirt.  A cute little hipster cafe with counter ordering and seating for about 25 folks.\n\n6 types of pizzas in the front case, and a chalkboard full of salads, burgers and meatball sandwiches, a couple of pastas, and full range of whole pizzas with illustrious names to eat here or \"to go\".  Boo yah.\n\nStick with what you know and do best!\n==============================\nI got a slice of Purple Haze [5.0 stars, $5.75] -- mozz, purple potato, pancetta, rosemary, pesto, feta, oregano, romano, garlic oil, and a whole lotta ooh's, ah's, and oh my's.  It was nothing short of fricken fantastic.  It's pricey, yeah, but it doesn't get better than this -- even in New York.  The plain crust was phenomenal.\n\nBurger, huh?  Why not!\n==================\nHaving proven himself with Pizza in North Beach at his full restaurant, I was excited about trying a burger.  Yippee Ki-Yay is with homemade BBQ sauce, cheddar, a fried onion ring, and bacon.  Well, it fell kinda flat.  Maybe too of a expectations for me, or maybe for them.  Patty good, but bun (homemade) was too crispy/hard and the onion ring had no crunch (warmed up in microwave).  Either way, no.  [3.0 stars, $13]\n\nStill, it's a winner!\n=============\nNice service, casual, no line, served very hot and very fast.  Bottom-line, amazing ZA.", "author": "Randy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Solid place! \n\nWhat I tried:\n* Sweet grandma \n* Purple haze\n\nOverall thoughts: \n* The dough and crust is perfect, crispy, not dry with a chew\n* Pizza toppings and dough portions are on point \n* Huge slices\n* Good place for quick, cheap meal\n* Good service. The first time I came here they overheated our sweet grandma slice and offered to bring over a new slice if we wanted but we didn't bother and instead came back to try it again a different day. Although I'm not a fan of thicker dough, it's definitely a unique slice and worth a try", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Yummy pizza! We ordered the combo special which gives you a small side salad, soda drink and a cheese or pepperoni spice for $9.99! But you can pay an extra $1 to upgrade to a specialty slice. We ended up doing the latter and tried the grandma's special which was like a foccacia, margherita pizza. I also got the purple haze which has pesto, garlic, cheese and purple potato. Both slices were delicious! The tomato sauce was really fresh and sweet while the purple haze had a nice garlic pesto flavor. For the price and taste, I would definitely visit again. Fast service and food good. \n\nNotes: \n-Lots of metered parking; not a lot of residential. Saturday parking cost $2.50/hour. \n-There's lots of public transportation in the area and nearby shops for a stoll after your meal. \n-No TVs. \n-They have a hot pepper olive oil using Caribbean peppers you can try as a condiment on your pizza! Made in house.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "I came here for a slice tonight, and I just wanted a cheese slice. It was thin and delicious, but like $5.50. Slices of pizza even if they are just cheese are inflated in price!", "author": "Denise C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Since they opened I was super excited because it's on my block. \n\nBut now the crusts are soupy and limp! What happened? \n\nSo sad Tony, are you aware of this? \n\nSend a friend in any day to get a plain slice. It's not up to standard. \n\nSo I'm happily back getting my slices at Escape From New York down the street. \n\nKeep it up Escape, ya won me back with the crispy, firm NY crust. \n\nFolks a good slice should hold itself up by the crust. For real!!", "author": "B K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "This has become my new favorite pizza place, it is just so darn good!\n\nI love the classic pepperoni pizza! The dough is delicious, the cheese is crispy and good, the sauce has just the right amount of sweetness. The pepperoni curls up when it cooks and is extra crisp. The pizza will make you thirsty though- so grab a beverage!\nThe crust is thin, so if you like thin crust this is the pizza for you! I have no complaints- its so good!", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Only 3 bites into a slice of cheese pizza. It's giant, and it tastes perfect. Haven't had this good of a slice in CA up to this point. Wow. Combination of the cheese crust and sauce is blowing me away. Mexican coke available. The other pizza looks great. I judge all pizza based on how they do a slice of cheese", "author": "Jacob Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Five star pizza right here every bite was amazing! I recommend their combo deal you can even upgrade to specialty slice for just $1. Their Sicilian pizza was amazing and loved the ambiance of the whole restaurant. Great place for a quick bite!!", "author": "Zach H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Hot stop for a casual bite. \n\nBucatini pasta was the winner tonight. Terrific gravy, tasty meats, good flavor, al dente pasta. \n\nPies by the slice are pretty bomb. Not as bombastic at the downtown location- but still good. Pepperoni is a classic done right. Meat lovers was my favorite. \n\nPizza pie crust is billowy and fresh. Thin crust with a bubbly edge. Not too much red sauce (some could argue for more). Hearty portion of toppings. \n\nHealthy options as well as crowd pleasing sammies, burgers, salads and Italiano-Americano style appetizers sure to please anyone. \n\nThe sisters working were nice. Decor is hip and cute. Tables are clean and napkins plentiful. Streamline service. No nonsense. \n\nPro Tip: Punch that punch card playa", "author": "Rosalyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "Food -------------------- 5\nService ----------------- 4\n\nA larger place than the one in North Beach.\nThe quality of the slices are top notch ... as expected from Tony.", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "The good...pizza is delicious. Salad is too, Very decent prices. Friendly customer service. \n\nThe bad...no restroom, limited seating for larger parties (greater than 6), no alcohol if you like to drink. \n\nThe ugly...parking can be tough unless you are within walking distance. Lots of homeless people. However, homeless don't steal from their corner. So don't worry about your car. It's all SF. Homeless pretty much anywhere.\n\nBonus round...but a pizza for the homeless. You'll feel better about yourself.", "author": "Brett H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Solid, solid pizza. Reminded me of New York.\n\nI'd decided that I was going to try vegetarian the next month, so I was getting my meat on when I popped in here, starving after not eating all day. I had a slice of the meat lovers, and it was MASSIVE, quite satisfying for the $6, and they have olive oil and some other good condiments at their tables. Will keep this place in mind the next time I'm in the Haight.\n\nPro-tip: if you get pizza with pepperoni and it's curled perfectly upwards into little cups of grease, you're at a place that knows what they're doing.", "author": "Jade M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "A MUST DO! NOTHING BETTER THAN EATING A PURPLE HAZE SLICE OF PIZZA LOOKING OUT ONTO JIMMI HENDRIX'S APARTMENT IN HAIGHT AHSBURY.  \nThe shop is small but has a  really cool vibe & great eclectic decor including the tin ceilings. \nFamed Pizzanista 12 Time World Champion Tony Gemiganini  has a location here on Haight St. the birth of the 1960s Counter Culture. \nPURPLE HAZE Slice 5.75 has \nMozzarella, Purple Potato, Pancetta, Rosemary, Pesto, Feta, Oregano, Romano, Garlic Oil . \nPurple Haze is Very Very interesting combination pizza which we enjoyed. There other pizza & pasta offerings that Looked good but didn't try them as we weren't that hungry. But we had to try a slice of that famed Purple Haze,  Hendrix's signature song. We enjoyed the view of his apartment & the mural. It's a great people watching place too. There are lots of interesting characters walking up & down in the Haight. \nt used to be, you had to have mega bucks & be really rich to have the Good Life, not anymore. The Game has changed. You've been Upgraded. Now You Can \nLive Like a King on a Limited Budget!", "author": "Stephen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Dang this pizza is super delicious. I love this place , the slices are ginormous, you can only eat 1, unless you are a beast.", "author": "dan m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "I have the chicken veggie pizza.  Cant wait to visit San Francisco. Just come back to this spot", "author": "JD W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Dropped in on a whim after checking out the Haight-Ashbury Street Festival on Sunday.\n\nI had the Grandma's which is the Sicilian version of a burrata or margherita pizza. The boo got the Purple Haze which looked delicious with purple potato, caramellized onion, and pancetta to name a few. He enjoyed his slice, and I liked mine too.\n\nHowever, my slice was not hot enough. When the boo took a bite of it he said it was lukewarm and asked me if I wanted them to heat it up a second time. I just thought it was warm, but it definitely wasn't hot like a delicious pizza should be. They have lots of add-ons per table like red pepper flakes and parm. Napkins galore too! \n\nThey don't have any restroom...so pizza without a place to wash hands is a no no in my book. The service staff are all super friendly and work fast! All of their pizzas look very yummy, and pretty too...no problem there. I just think that the no restroom thing and overpriced basic pizzas like simple cheese or pepperoni are not very fair. Otherwise, just a great pizza place, but not one I'd specifically go out of my way to come back to.\n\nCool rad art work though. Power to the tatted Wonder Woman!", "author": "Jodi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "My girlfriends and I do a book club every month or so. We normally spend about five minutes talking about the book and then it's all about wine and food. On Wednesday, May 17th, we decided to order pizza for dinner during book club. My gf placed the order in the morning for delivery at 7pm via Caviar.\n\n*Burrata, Lemon, & Arugula: tomato sauce, mozzarella, prosciutto, parmigiano, peppadew chiles, lemon, olive oil, sea salt, pepper, 12\" ($23)\n*Tartufo Pizza (White Pizza): mozzarella, wild mushroom, arugula, goat cheese, and truffle oil, 12\" ($23)\n*20\" Classic Pizza: Pepperoni ($33.50)\n*Meatball & Ricotta Pizza: tomato sauce, grande shred mozzarella, sliced meatballs, garlic, ricotta, oregano, romano, and garlic oil, 20\" ($33.50)\n\nI love Tony's pizza so I was super happy! So much so, that I basically ate one slice of each. My favorite was of course the pepperoni. The crust was nice and chewy and all the toppings just melded together nicely. The tartufo was also delicious. I adore truffle and arugula. I don't normally like pizza crust, but something about Tony's crust just makes my mouth water. The love the chewy softness.\n\nSo glad my gf decided to get Tony's. Writing this review actually makes me want his pizza again. Yum!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Good pizza, crazy price for a slice. \n\nGot the purple haze. It has thin purple potato slices, feta cheese, bacon, rosemary. Delicious!!!! A little too oily. This slice was $5.75, I think. Cheese pizza I saw was $5.\n\nIts a cool little spot to grab a quick bite while you're shopping around on Haight.", "author": "Steffi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "we can eat it in the SLICE HOUSE\ntry to make them charge the price out\npizza with my eats uh\nlemme chew the whole box\nwas my lunch was my lunch was my lunch!\n\ni wanna, mozzmozzarella from yo crust to yo dough\nn i wanna, order the app down to the down to delivero\nthen i wanna, omnom u bake it so good that i wanna eat\nbut i gotta, popoPOPEYE was was kinda da da deece", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Love Slice. Thin crusted New York style pizza....dripping with goodness. Really reminds me of pizza from the east coast.", "author": "Naomi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "When World Cup Pizza champion Tony Gemignani opened his first restaurant in North Beach almost eight years ago, I thought I had gone to goombah heaven with his luscious Neapolitan pies like the Cal Italia which is still my personal favorite (photo: http://bit.ly/2pGsqQM). Alas, it was bound to happen: Tony's a conglomerate now with subsidiaries like Pizza Rock and Slice House popping up everywhere from here to Vegas. When he sticks to his original concept of wood-fire pizzas like he did with Tony's Pizza Napoletana and Capo's, he makes some mighty fine pies that linger in the palate as well as the memory. When the pizza is ready-made like a Cybelle's and just warmed in the oven, the art disappears.\n\nI was initially thrilled that Tony opened a spot in The Market on Market because that whole operation struck me as a hipsterish tech-head congregation area where working class flavors were verboten. There were a lot of pizzas on the menu and on display on pizza tins behind the lucite panels. The Picante looked good with serrano and banana peppers sitting alongside the linguisa, chorizo, and mozzarella cheese (photo: http://bit.ly/2oBeBnF). The Purple Potato had, yes, slices of purple potato, pancetta, and feta cheese drizzled with rosemary pesto oil in concentric circles (photo: http://bit.ly/2oNDhet). Carb overload. Pass. The Sicilian pizzas looked hefty but awfully tasty with all those ingredients piled on.\n\nThe Fratellanza must be the kitchen sink pizza of Palermo with pepperoni, salami, sausage and mushroom competing with all those cheeses on a square piece of doughy real estate (photo: http://bit.ly/2ogoRk2). Because the slices were only $6 a piece, I went for two slices, first the Meatball & Ricotta because it looked meaty and gooey (photo: http://bit.ly/2oNvE81). The second was the Funghi which combined hen-of-the-woods and crimini mushrooms with Kalamata olives (photo: http://bit.ly/2pmZPU2). Now the sad part: It tasted warmed up from the day before with overly chewy crust. In spite of the creative, once fresh ingredients, there was barely any difference between what they served here and what they package up at Cybelle's. Kind of a bummer, don't ya think?\n\nFOOD - 3 stars...Tony's paisan artistry buried by the fast-food concept\nAMBIANCE - 3 stars...guess there are worse places than eating in the produce section\nSERVICE - 2.5 stars...on automatic\nTOTAL - 3 stars...Tony, Tony, Tony...mamma mia!", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "When you don't want a long wait for a speciality pizza at Tony's Pizza Napoletana in North Beach or just want a to-go pizza, Slice House is an excellent option. I prefer this location over the North Beach one because if I'm there I might as well go to Tony's for the full menu.\n\nAt the Slice House, there's still a large selection including salads, pasta, and antipasta, but the pizza focus is on Grandma slices, Sicilian slices, and (I believe) gas-oven-baked pies.\n\nWe ordered a Grandma slice and a Sicilian slice to share, loved them, and ended up ordering another Grandma slice plus a whole pie to-go. End to end: the dough, sauce, fresh mozzarella, fresh ricotta, fresh toppings = amazing. This is definitely one of our favorites now for pizza in SF.", "author": "Lindsey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-16", "description": "Overly sweet, doughy, soggy, bland pizza. Come on SF, get your act together! Ordered the wiseguy pizza that was described as having hot pepper oil on it. Not a hint of heat anywhere on the pie. The sauce was sweet, the sausage was sweet, the ricotta cheese was sweet (expected that one at least). At the very least the $5 delivery fee got the pizza to me hot and fast and it looked delicious, but the center was soggy and the crust tasted like yeast/under-cooked dough. I put it back into the oven for a quick reheat before eating, but the tomato sauce tastes like it was made with candy. Why are people raving about such a crazy sweet sauce?! I can't believe I have leftover pizza in my fridge I don't want to eat. Maybe it was an off-night, but I definitely won't be ordering a pizza from this place again.\n\nMaybe I just need to give up on Pizza in the bay area...", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "the pizza is awesome. One star less for not caring about our environment and giving out plastic knife/forks to the customers even if they stay to eat at your place. That's ridiculous if you think about the condition of the earth nowadays.", "author": "Lenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-25", "description": "I was not impressed by this by the slice place. I ordered one of their special pizzas by the slice. In the glass, it looked fantastic with heaps of cheese. But I found it to be extremely greasy and bready, and the sauce to be overly sweet. My friend got just a plain cheese slice and that was the way to go. It was much better than what I got. I also tried a cookie from here. They also looked great in the window but were quite bland and flavorless. The consistency was good but taste was meh. \n\nIf you must go, go for the cheese or something simple. Or just go somewhere else.", "author": "Grace A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "All the pizzas I've tried here are fantastic. Fast, friendly service and hip interior. Bonus: they deliver via Grubhub!\n\nTwo 13\" pizzas were more than enough for 3 people. Love the Cal Italia - the combination of fig preserves, prosciutto and balsamic reduction is so yummy. Tasted like dessert! \n\nI've also tried the Crazy 8 (my 2nd favorite) and Wise Guy. Both are delicious. I love the fresh ingredients and the hot olive oil!", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "This is a hole-in-the-wall pizza place in the Castro District. The interior is clean, dimly lit, and warm. They have nice marble-like tables and wooden decor, along with an interesting collage on the wall. Our cashier was friendly and welcoming. There are no bathrooms here or places to wash your hands, so you might want to bring some hand sanitizer!\n\nWe ordered a 13 inch The Wise Guy pizza for around $24, which had perfectly seasoned sausage, pepperoni, ricotta that melts in your mouth, amazing marinara sauce, red pepper olive oil, and green onions to top it all off. If you're wondering how big a 13 inch pizza is, it's about the size of a steering wheel. It was enough to satisfactorily feed two young adults for lunch!\n\nTheir individual slices, while pretty big, are expensive and average around $5, so I would recommend coming with a large group and ordering some 13 or 20 inch pizza pies (13 inch pizzas are divided into six slices). If you're in the Castro District area, this would be a great lunch option, and make sure you try The Wise Guy!", "author": "George L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "These slices are divine! \nHigh quality, thin crust, not too greasy perfection.\n\nSoft, crunchy, and chewy crust - Delicious slightly sweet sauce. \n\nWe ordered the Genoa, it was absolutely perfect. Pesto drizzle instead of covering the whole slice, perfect balance of acid from the cherry tomato, and feta cheese that I was concerned would make it too salty but actually added the perfect amount of silky smooth.\n\nAmbiance, service, and speed are good not great, otherwise I'd give it a 5.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Alright this pizza spot is good, but I was pissed. I called and ordered 6 pizza's, my colleague walks in to our showroom after ubering there and back with 3. I had to uber my butt back to get 3 more pizzas. Hungry contractors are not cute guys. ENJOY!", "author": "Darlene Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "I don't understand why some people feel the need to comment about the ambiance or complain about the fact the pizza is reheated. It's damn cash register with premade pizzas inside an adjacent glass case. What you see is what you get. \n\nThis is some of the best food you can get for $6 bucks in this area. The meatball and ricotta pizza is killer. You should get the Fratellanza if you looking for something meat-heavy. No regrets with any of the choices here.", "author": "Huey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Great affordable place to grab a bite to eat in the Haight-Ashbury area. Thin crust pizza available with a variety of toppings. You can order by the slice for around $5 to $6 (huge slices) or get an entire pizza for $25 to $35. Service is friendly. No public restroom, but if they're not too busy and you ask nicely they might let you use theirs.", "author": "Chad K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "The pepperoni pizza was so amazing! I don't think I've had as good pizza in San Francisco and that is spoken as a New Yorker! The delivery was also early and very much appreciated. I definitely recommend this place!", "author": "Tara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "I haven't tried the original Tony's in north beach yet because every time I wanna go, they're always closed. When I found out that they opened up a new restaurant near my place, I immediately rushed here. It's literally only a 5 minute drive away, win win for me!\n\nThe place is very well decorated, very fitting for The Haight. They've got cool and retro art on the wall, kinda hipster, totally instagram worthy if you're into that. THEY'VE EVEN GOT WHITE MARBLE TABLES! WE LOVE WHITE MARBLE TABLES!\n\nOn to the pizza, I'm more of a thin crust NY style pizza so the sicilian slices didn't really intrigue me, however, I did try their sicilian slice of the day which was bbq chicken with bacon and scallions. Even though I said I wasn't a fan of the thicker slices, I kinda liked this one... now if only it was on a thinner slice. Haha. I've also had their pepperoni pizza, it was pretty standard, a little greasy though. \n\nTheir fresh squeezed lemonade with mint was mind blowing though, it's extremely refreshing. I highly recommend! I'd come back and try their other pies, especially the entire one.", "author": "Yen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "probably the closest thing to a slice you can get on the street in Manhattan. \n\nthat's a compliment, by the way.\n\nAlso looking forward to one of the enormous calzones next visit.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Very good slice of house pizza. Awesome if you eat vegetarian. $6 a slice. \n\nWould visit again.", "author": "Atif J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Came here while on a bike tour through the city. I ordered a slice of pepperoni- one was enough for me. It was delicious! Not THE best I've ever had, but pretty close. It's definitely worth a stop if you're in the area. The price was pretty reasonable I thought as well.", "author": "Kathleen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "Recently tried two of the \"personal size\" pizzas, the Pepperoni/Sausage and the Margherita.\nBoth were very good.  Not quite at the level as Tony's out in North Beach.  But a lot more convenient on a workday.  However, service was sketchy at best.  With no line and at 4:30 in the afternoon on a weekday, the first pizza was boxed and ready to go in about 20 minutes and the second pizza took nearly 10 more minutes to emerge from the oven.  \n\nGo figure.\n\nBut who am I kidding - I will be back for the yummy pizza.  And hope the service is better.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "delicious pizza and friendly staff!! Location is much closer to me and go glad I can get great pizza and not have to go down to north beach.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "THE GRANDMA!! \nIm going to start with that exclamation! I was so curious to try a pizza with that name (had never heard of it before) and since I always embrace my inner granny I felt it was the choice for me. \nWhen I received that square of pizza goodness I was so happy I did choose this flavoring! Crust is what usually turns me off from pizza but this place knows their crusts. The grandma had a \nDeliciius crisp crust and not to thick...dough was cooked thoroughly and the sauce was delicious! I'm not a huge pizza fan, but I would return specifically for this pizza. \nMy other friends ordered a classic cheese and they were also very pleased with their choice! \n\nRestaurant is small in size but arrive for lunch on a weekday and seating is still available. Neat ambiance in the heart of Haight St. !", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-08", "description": "Very few veggie options. The Grandma Sweet was too sweet & burnt. Disappointing tourist trap.", "author": "Kay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Some of the best pizza I've had in SF! I ordered the Cal Italia which is one my favorites! Great combination of toppings and the crust is delicious. Also had the caesar salad with homemade croutons to die for! Staff was very friendly and accommodating.", "author": "Kristin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "The Purple Haze Pizza was FIRE!!!! First time here, was caught by the vibe as we were walking down height street, sat down for a quick bite....I'm GLAD we did. The food and service were Amazing!", "author": "Alfredo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Oh my god. The pizza in this place is amazing! Coming from nyc, great pizza is something I really miss. This place hit the nail on the head. The pizza crust is super thin. The sauce is real italian tomato sauce. The cheese is a super thin coat of salty mozarella deliciousness. The topping ingredients are typically amazing fresh California veggies. If you are in sf and want pizza, resist temptation to go to almost any other pizza joint in the city. You will pay out the ears for very low value bready flavorless pizza. Come here!", "author": "Anne S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "Ordered a simple pepperoni and mushroom pizza for delivery and ended up with a cold tiny pizza that I could have bought little Caesar's.. heck I've had better quality slices from the ballpark which is extremely msss produce than what I receive from one of their brick and mortar locations. Very highly disappointing of this location. I did honestly expect a better pizza for the higher price point.", "author": "Jared V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Come for the pizza, stay for the contact high! Came in tonight with my husband and two kids. Everyone left full and happy. I had a \"grandma\" slice and it was delicious. Thick crust, sweet sauce, big pieces of mozzarella and basil.  Crust has crunch on the outside, chewy on the inside. Also had a side salad with ranch. As a ranch connoisseur, you'll never find better ranch. My boys gobbled up their slices of cheese, crust and all. They never do that, FYI. Hubby loved his pepperoni and chicken parm style pizza (can't recall the name). Biting into the chicken parm made your mind do a double take. Is it pizza? Is it Nonna's chicken parm?! Is it the best of both worlds?! That's what it is. The place was buzzing. Lots of delivery cars and motorcycles coming and going. Sometimes you get bored eating pizza have way through the slice. This was delicious to the end. Casual Haight-Ashbury vibe. Sit at the window and enjoy the people watching. They also have a special: slice of pizza, salad, drink for $10. This place is a no brainer. Better than Tony's.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-18", "description": "Is it fair to judge a place on the basis of a single slice? Maybe, maybe not, but here goes.\n\nTony Gemignani's North Beach restaurant serves some of the best pizza this side of New York. His Slice House in the Market Hall at 10th and Market is also first rate, with just the right combination of ingredients.\n\nBut the slice I had at the Haight Street Slice House is a *big* drop from those two: dry and chewy as if it had been sitting around for quite a while. So my recommendation is that you enjoy Tony's pizza elsewhere and take a pass on the Haight Street location.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Finally I found a place that has a good meatball sub. I've been on the hunt ever since I moved to Bay Area and could only find subpar meatballs. This place gives me my fix. I've tried a few of their pizzas they have out but I think their pepperoni is the best. The garlic fries are too expensive for what they give you but I'm not sure if that's because this place is on the Haight. Overall good pizza, excellent meatballs, and friendly staff. Oh and they got this hot sauce that I can smother my pizza enough with.", "author": "Ted Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "This place is OH SO convenient and the pizza tastes as if were made from the heavenly hands of the Pizza God himself. So everyone knows Tony's Napoletana (next door, owned by the same owner) is AMAZING and of course the wait for a party is notoriously the longest wait ever. Why? Well, they don't take reservations. I live in OC and have made 2 separate trips down to SF and tried Slice House and Tony's Napoletana and ordered The Newyorker at both places, and yes... They taste amazingly the same.\n\nGreat news people. Instead of waiting 1-2 hours for the restaurant, run next door and get pizza by the slice (or boxes) for a way shorter time frame, you get the same quality pizza! We only waited about 30 minutes, which is TOTALLY WORTH IT. Among three of us, we finished 2 boxes of The New Yorker pizza and 1 box of the Mozzarella pizza. Absolutely divine. Dollups of ricotta cheese and sizzling sausages dressed to perfection with every bite. \n\nI call it the pizza curse. Every time I make a trip to SF, this is now a mandatory duty on my to-do list. I'm a fairly healthy gal, but sometimes you just gotta live and smile with every bite.", "author": "Meggan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-17", "description": "We always order from here and don't usually have a problem, but tonight we got a cold pizza that was clearly flipped over. When we called Tony's to report the issue, we were told to call Grubhub. Unacceptable. We won't be ordering again from Tony's or Grubhub until we don't have to resolve the issue ourselves.", "author": "Jared C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Owned by the same guy that owns Pizza Rock in Sac. Many of the same great crusts, and the same great product. It's a bit small inside, but I was there during Bay to Breakers, so I am sure that it was packed to capacity due to that. If you like pie, and who doesn't really, then you'd do worse than to stop here for a slice. BTW I prefer to try new places by the slice if I can, to see if I will like the whole pie, and this place didn't disappoint.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Great place for lunch. $6.75 for a large slice of pizza that's filling. They have a menu next to the cashier but it didn't list the ingredients so I had to ask what was in them when I got up to the cashier. Next time I'll just go around the corner to where they have the pizza's displayed to check out the toppings. They also have cupcakes and mini cakes for $2.99 by where you stand to pay. I would come back.", "author": "Vinkin Ken T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Lots of competition in the Haight area from other pizza places, but this place is pretty good! I definitely recommend eating here than taking out so it's fresh!\n\nI ordered the lunch combo -- a super great deal for $10! A slice, drink, and house salad. The meat lover's (extra dollar) had the perfect amount of meat, and I wasn't yearning for more! My coworker and I went when there were a bunch of high schools kids, so it was super busy, but the line moved through pretty quickly.\n\nThe menu was pretty large, so ideally there should be something for everyone. :)\n\nFood: 9/10\nStaff: 9/10\nAtmosphere: 9/10\nValue: 9/10\nOverall: 9/10", "author": "Evan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "$5 for a slice of cheese+peperronie. On a piece of paper. You have to be joking. A $5 slice of cheese better come on a silver platter. What a joke. Save your time and money. For $4.50 you can", "author": "Steve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "I've been trying to make a concerted effort to peel my face away from my work computer to take real lunch breaks. Once or twice a week, I'll trek around the civic center area looking for a good meal but somehow end up at the salad bar at The Market in the Twitter Building. $12+ later, I regret not bringing my $4 box of salad from TJ's.  \n\nNot a fan of The Market but it's one of the few healthy options in the area for a quick lunch. In the coming months, they'll be scaling down their grocery section and subleasing their space to individual food vendors. \n\nToday, Tony Gemignani, the 12th World Pizza Champion opened his 5th Bay Area outpost of Tony's Slice House inside The Market: http://bit.ly/21d6av3. \n\nTony, himself was there churning out the pizzas today. There's 8 different pizzas offered daily ($5.50 - $6 per slice): http://bit.ly/1XSE8Ty. Whole pizzas (20 inches) are also available. \n\nI ordered a slice of the Purple Potato Pizza: Grande shred mozzarella, purple potato, bacon, rosemary, pesto, feta, oregano, romano, garlic oil: http://bit.ly/231vQdu. I'm usually not a fan of carbs on carbs but I fell in love with Escape from New York's \"You Say Potato\" pizza when I first had it. Of course, Tony's rendition is a lot more refined with purple potatoes, feta, and smoky bacon. The crust had a good toothsome chew but was on the harder side so folding it was an issue. The pizza was a bit too oily from both the pesto and garlic oil. Then again, no one eats pizza for health.  \n\n$6 for one slice of pizza may seem steep but the slice was H-U-G-E (two slices worth) and very filling. It's a good deal for the Twitter building especially since the former pizza tenants were charging $16 for a terrible personal size pizza: http://bit.ly/26pbiQG. \n\nNo doubt Tony's Slice House is going to be a popular vendor at The Market, if not the most popular one. That cashier lady though. Sheesh. I don't know if she's employed by The Market but it seems like she hates her job. As Janice C. says, \"Smile while you still have teeth!\" =D", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "I recently moved fairly close to Slice House and have been going frequently for the first few weeks of living in the Haight. \n\nFirst, let me get it out of the way. Great pizza. Inventive choices, quality ingredients. Lots of love goes into this pizza and that alone qualifies it for at least a lunch stop. \n\nWhat I really wanted to write about today was the service, and attention to detail. My roommates and I decided to order a 20\" pepperoni pizza to bring back to our house for a night in. When our pizza was ready, the two women behind the counter brought the pizza out, opened it up, and asked us if we were satisfied with the doneness. They said that they had recently had some criticisms about the doneness/crispiness of their slices, so they wanted to make sure that we were satisfied. Turns out, we did actually put the pizza back in for an extra 5 minutes, but that made us leave with a more satisfying product (and oh boy was it.) \n\nI find that attention to detail and response to feedback very admirable for a small business. To directly implement feedback and go the extra mile (even at the cost of an extra few minutes of operational time) to make sure that their customer's pizza was perfect shows that this store is very well managed. \n\nWe'll continue going to Slice House more often than we should each week. It's worth it. Now I know -- not only for that pizza, but for the people.", "author": "Kenny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-02", "description": "Why would the delivery person ask \"Why did you order from us? We are so far away, you could've ordered North Beach area, it's closer. Hmmmm...Well, I sorted my options by star rating, as I always do when I don't normally order take out. This place popped up, didn't READ the reviews. For someone who used to throw pies for a living in another state, I was hard pressed to find ANY pizza delivery in the area that had above a 3.5 rating. Next time I feel like having a pizza delivered, I'll do better research. Thanks for the recommendation.", "author": "Ann M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "So excited that Tony's famous pizzeria finally came to Haight! The original is in North Beach and basically impossible to get a seat, since it's so popular. Their famous NY-style pizza has won awards, and is a SF staple. I've only ever tried the Cal-Italia (gold ribbon award winner) because it's so delicious (proscuitto, gorgonzola, fig compote, balsamic drizzle) and it's the perfect combination of sweet and savory. \n\nThey also have delicious garlic fries, a perfectly seasoned salad, and pasta (I have yet to try). The Haight location is pretty small, only about 6 or so tables, and it's a simple order and eat place, but there's no wait, which is a pleasant departure from the North Beach location.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "Pizza by the Slice here is great. I had the meat lovers and the mozzarella. Both were great and cooked to perfection. You must try the hot pepper olive oil topping... it's amazing!\nThe inside of the restaurant is fun. Not too big inside but, it was pretty empty with plenty of seats available.\nParking is metered parking through the Haight. About $6 a slice.  $25 for a small pizza and $33 for a large. \nI would recommend stopping by for a slice!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Super excited to finally have made it into one of the brick-and-mortars...because I used to go to the ballpark for a couple of slices and fell in love.  I grew up on NY-style but it's been hard to find it on the West Coast (& Midwest).  \n\nCheese slice = delicious, perfect sauce and seasoning.  NY-style, FTW!! $5\n\nService = friendly and efficient.\n\nSeating = mostly 2-tops and 4-tops, but you can rearrange for larger groups.  \n\nI'll be back.  Or alternatively, get delivery!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "It is near impossible to find great pizza in SF. This is the best I've had. And believe me I've been searching!", "author": "Carson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "When walking through Haight Ashbury, there are many options to choose from for food. I walked inside and was immediately greeted by a very nice gal who was very welcoming. The pizza was delicious! I added extra spices and topped it off with oil... I was surprised and you will be too! This is the spot if you're in town.", "author": "Becky G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "First of all, this is my first time giving a bad review :(, and the girl who served me was really cute and sweet but still, I was picking up a garlic bread and they told me the food is not ready yet and they asked me to wait for 2 or 3 minutes, this fine, ( I thinks they went to Mexico by the flower to make the bread ) because I wait over 45 minutes for the Garlic Bread!!!! They keep telling me that the food is going to be ready in 2 or 3 minutes, it just make me feel bad about myself, I was setting there and watching people coming In and finish their food and leave.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Slice House is located in the first floor of the Twitter building inside The Market. It can be accessed by way of Market Street or the back entrance by SF Fitness/Blue Bottle Coffee. They have a variety of pizzas that you can purchase by the slice or as full pies. They've got a few thicker varieties and some regular crust pizzas. \n\nI usually go for the pepperoni or one of the thicker varieties. A slice will run you $6-7 and they'll heat it up for you and give you a to go box if you want. Pepper and cheese packets available on the side. If you want to pour some chili oil on your pizza they've also got that on the side in a bottle if you want to try it. The pizza isn't anything amazing but it's solid if you need to pick up something quick or are feeling pizza for lunch/dinner and don't want to order a whole one.", "author": "Saachi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "I've been a fan of Tony's since their original Slice House opened in North Beach.  As a former NYer, I was seriously disappointed in the slice offerings in San Francisco (though some of those bougie made-to-order personal sized whole pizzas are solid).  But as far as heating up a simple slice to go, Arinell & Tony's Slice House are the only decent options.  Since I'm very familiar with Tony's cheese slice, I decided to give the more exotic ones try.\n\nFratellanza Sicilian Slice: I'm usually not a Sicilian slice fan, but this looked too meaty to resist.  The pepperoni, sausage and salami added all sorts of umami goodness.  Could have been saucier.  And the crust wasn't as good as Golden Boy.  But hey, who cares with all this meat?\n\nPurple Potato Pizza Slice: Potato on pizza really wasn't a thing in Manhattan.  Though I remember several tipsy nights in the Castro concluding with potato covered pizza, so apparently San Francisco likes their carbs covered with carbs.  Purple potatoes don't really taste any different from regular potatoes, they just look cool.  Lots of nice spices and cheeses and bacon!  I'm normally a red sauce guy, but this was tasty.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "Had a slice of the \"Funghi Pizza,\" it was HUGE and super flavorful. Seriously, the slices of pizza are a meal unto themselves. There are several pizza options, all are tasty with fresh ingredients. The cool thing is that your pizza doesn't just sit at room temp and then get handed to you cafeteria style. Yeah, the pizzas are ready to go when you order, but then they are heated in the pizza oven right before being served to you, so you get food that is both conveniently quick and fresh. I think my slice cost me $6.75. I was completely satisfied. Love The Market and all it has to offer. Oh! And I saw a guy flipping the crust, and it was a pretty impressive display. The crust was beautifully thin and stretched, and he still managed to get really good height on the toss. They clearly know what they're doing!", "author": "Pamela O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Delicious, NY-style pizza. Big slices. Perfectly cooked crust. Awesome decor (Hitchcock and Dylan on one wall, I mean come on. That's awesome). Though it should be noted there's no bathroom. Even so, highly recommend.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-22", "description": "I must say I was disappointed by the service. The Pizza slices were good, was expecting a WOW and was like \"eh\". We had also ordered garlic bread and rosemary garlic fries, which we received last after about 15 minutes of placing order. We never were informed it'd take longer than our slices. The slices were not fresh, I think it was just the Purple Haze slice though, was lukewarm. The rosemary fries had a small clump of rosemary/garlic seasoning. I gave this place a 2 star for service and food not coming out together, I agree I should have asked for both together instead of assuming they'd give us our order together. Not a raving fan and pizza slice was decent.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "Tony's Slice House was a YUGE disappointment due to my poor choice no doubt. place was empty unlike Walnut Creek. should have gotton veggie \"Grandma\"(6), went for \"Silicaian Slice of the Day\"(6)\n\nfour different  slices seen, not displayed as well as walnut creek. ingredients not all named. just eyeballing slices doesn't translate to good eats.\n\neats: \"sicilian \" slice(6)\n-rectangular in size, \n-fried bacon, roast chicken, mozzarrela cheese, sauce, ketchup drizzle?\n-chewy, doughy crust.\ndidn't like the ketchup nor the doughy crust.\n\ncrumbs:\n-service ok, pizza not heated enough, seem just a minute.\n-lots of seating unlike walnut creek.....\n-metered parking.\n-checked into wrong place. (prada?) slice house not immediately available, had to \"search\"\nthough it was slice house, wasn't (same problem with many new places.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "This place takes FOREVER!!! We ordered when we arrived and it still took about an hour. I feel bad for the people working here because they deal with large crowds of unpleasant people. The BIG plus is that the Pizza was AMAZING.", "author": "Cecilia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Can't believe I haven't come sooner! I didn't even know it was in this location and I was surprised at how empty the restaurant was at dinner time. The ambiance was really cool but unfortunately it was pretty cold inside because the door wouldn't stay shut!\n\nI'd give the Purple Haze a solid 5/5. Maybe 6/5. It was so delicious!!\nThe Grandpa was also really good, but so thick that it was not heated all the way through (unless that was intentional?) so I would give that a 4/5.\n\nI also found the pizza pretty expensive ($5 for one slice of cheese? *Insert scream emoji*) but I'm excited to come back and try the other menu items.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "The pizza here may seem kinda pricey to many people in comparison with other local \"joints\", but the slices are always huge and are always made with top notch ingredients, so you definitely get what you pay for when you dine in or carry out. The pizzaiolos at this pizzeria come up with some excellent combinations for their slices and whole pies, and not only do they pay attention to fine detail when they marry together toppings like eggplant and prosciutto or pesto and whole mozzarella, but they also come up with pretty memorable names like \" Purple Haze\" or \"Grandma\". the overall atmosphere is excellent here, not only do you receive quality food to fill your belly, but you also always have plenty of interesting art work to satisfy your visual sense, all in all, this place is definitely worth visiting over and over again :)", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "The best pizza I ever ate. Seriously. This is pizza heaven. So tasty, and the staff is so nice.", "author": "Leonard J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "Paid $50 for 3 slices and no restroom....what is going on here? Told by attendant that seats less than 25 people and doesn't need a restroom. To avoid serving the transients.", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "I've eaten at Tony's other locations and was excited to see different options at the Haight Street location. I had a slice of Purple Haze on Wednesday. While I was eating it, I kept thinking that I didn't want it to end. It was so good! And now, two days later, it's all I can think about. *drool face*", "author": "Jacquee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Ordered a pizza and meatballs. Both were some of the better food we had while in town. I would suggest both.", "author": "Chad E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "That \"Grandma\" slice was delicious! I like the convenience and prices here, of course, too. It is perfect for a quick bite while being a total tourist on Haight St, haha", "author": "Kelly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "This was the best casual \"to go\" type pizza I have ever had, hands down. We went about 2 weeks ago and I'm still thinking about it. The dough was crunchy, but soft at the same time. The flavor of the pepperoni and sausage was so perfectly seasoned. Service was fast and friendly. I seriously can't stop thinking about how perfect that slice of pizza was.There was also a chili oil on the tables that I drizzled on my slice, and it made the pizza that was already amazing, phenomenal. \nI very highly recommend grabbing a slice here! You will feel like a changed person.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Yes, another Slice House from the famous Tony Gemignani\nTony's Pizza is the best. And I am so happy to have his pizza\nnow in The Haight !!\nI live on Haight st. Slice house on Haight st. That is as good as it gets! \nBeen there twice already and cant wait to go again.\nReal NY style pizza the kind you can hold up and will not wilt :)\nJust the right amount of olive oil. \nGreat menu too more than just pizza.\nhttp://www.slicehousehaight.com/_pages/menu.html\n\nGood luck Tony. Love your Pizza !", "author": "Simon The Cat -."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "Slice house reminds me of an ex-girlfriend. Looks hip, sounds cool, good location and I really wanted to like it. But the employees were trying so hard to be hip that they came across as indifferent. The pizza was like day old pizza that ends up dried out. Oh, and they burned the crust when they re-heated. Don't do it, just don't. \nYou will feel like you have to eat the pizza because you paid so much for it but you will end up feeling sad and little used.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "My favorite Pizza in San Francisco! I can't get over the delicious crust! The grandma is amazing! Delicious thick crust with slices of fresh mozzarella melts in your mouth :) The wings are so good! Tried many other things on the menu, everything is tasty and generously portioned. Great customer service and cool interior. My boyfriend is so picky and he loves the pizza here. He enjoys the pepperoni and the purple haze. Wether your in a mood for thick or thin crust this place is a must. Don't forget to try the meatball sandwich, so yummy !!!!", "author": "Izzy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "As a New Yorker, this is the closest I have had to NY pizza. \nSo good we had to go back twice while in vacation in SF.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-11", "description": "Got a cheese slice. It's large. Tastes like gas oven. Cheese is tough. Crust is greasy. Sauce is good though. Not for me. It's the end of the night though. But still.", "author": "Kiai K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-24", "description": "I tried contacting the restaurant directly before voicing my complaints publicly, but unfortunately they never got back to me...so here goes.\n\nI visited Slice House a couple weekends ago with my roommates. They ordered pizza slices, I ordered the veggie burger. After over 20min of waiting, I went back to the register to check on my food. I can only assume they'd forgotten about the order, because they asked for '3 more minutes.' (And disappointingly didn't offer anything else edible to make up for the wait.) In fact I waited almost 10 minutes more, and by the time I got my food (after nearly a half hour wait), my roommates were basically finished. And while the honey on the bun was a nice touch, the burger was most definitely a frozen patty--extremely disappointing for $12 plus tax. \n\nNot a good experience.", "author": "David Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "So far so good, I headed in on the opening evening so I have to give them some credit for having just started up a new location. I'm not a fan of the pizza (yet) or the music (stuck in the early 00s) but the ambiance is good, the space is clean, the decor is cool, the staff is great, service was quick, and it's a big improvement over the previous tenant, \"Big Slice\", which was not great.\n\nThe food is so important and central in a new review, I'd really have given them 3 stars but that doesn't feel fair when I want to give them a chance and a running start, and I can see lots of potential. The menu is awesome. The \"Purple Haze\" slice that I had is a great concept -- super thinly sliced purple potatoes and pancetta over plenty of good quality cheese and pizza sauce on a crunchy thin crust. The two places it fell short: the star ingredients (potato and pancetta) were sliced so thin you most of the time can't taste them over the cheese; and the crust is really just a bit too crunchy, like almost cracker crunchy in places (all over, not just the edge) which is distraction when you're trying to enjoy chewy cheese and veggies and meat.\n\nSo, I'll be back and I don't plan to worsen my review unless they just don't live up. They get time to improve and I see major potential. But it was a little alarming to know that Tony's an established pro and I already didn't like my first slice even though the ingredients and concept were so right. I can chalk that up to equipment adjustment and staff practice and I'll be back!", "author": "Eric O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "This pizza is out of the world amazing try the grandma!!!!!\nLike very very good you should definitely come here if u can't decide", "author": "Seth F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "I'm not a local to San Francisco at all, I actually live in so cal and was on vacation there this past weekend. I have to say I loved the vibe of this place as well as the deco. The pizza was awesome had a great flavor to it. The staff was friendly as well. I recommend it if you're in the San Francisco area.!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "It's with a heavy heart that I write this as I do not like to write negative reviews but, due to the poor customer service we received I feel that this should definitely be addressed. \n\nOn Saturday 1/6 my son and I walked into what we thought was a cool looking pizza place. As we approached the counter we were not greeted, even though there were twin ladies at the cashier. The hostile attitude we received by the first lady (rolling eyes; attitude as if we're wasting her time; huffing and puffing because we're deciding what to order, even though there was no one behind us), before we even uttered a word, was so prevalent that the second twin had to step forward after an uncomfortable silent whole minute. It honestly felt like a bad valley girl routine.\n\nI ordered a slice of Sicilian and a slice of cheese. The Sicilian slice was only warm while the cheese slice fine. There are a handful of other pizza places around that offer good pizza sans the bad attitude. For the sake of your digestion chose wisely.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-10", "description": "Nice attempt at a New York slice but not quite there. We got a meat lovers and a cheese slice and both were acceptable but the crust was a little doughy and the cheese and sauce not sparkly enough. There are many other options including burgers, sammies and sides. We got a simple side salad with their delicious homemade vinaigrette. I'd go back just for that. It's a nice, clean takeout, order at the counter and pick up place. There's plenty of seating if you're not getting it to go. The folks that work there were really nice and helpful.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "I love the high-quality pepperoni and the crust is great. Highly recommend. One delivery order was lukewarm, otherwise delicious pizza!", "author": "Laura S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Slices are solid but the kitchen closes at 9pm - with slices until they run out - not 10pm, so plan accordingly. Purple Haze and Cheese are my recs :)\n\nAmbience is cozy for a slice house.", "author": "Britt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Love the Slice House ! Just moved to the Haight and I've had escape from NY before but the Sicilian here is the bomb!!!! Love their choices in daily slices and pretty friendly people too!", "author": "Desiree K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Excellent slices of pizza. The purple haze is super delicious and so are almost all the other flavors. The only weird thing is their tomato sauce is a little too sugary.  Still love it though! Staff is really nice and the decor inside is amazing!! So creative and cool.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "No whole Grandma pizza made at the Haight street location. If you want 6 slices of grandma it will cost $39 instead of the whole pizza price of $23. Mr. Gemignani Please make a whole GRANDMA PIZZA pie for the Haight Street location!!!.. Then I will change to 5 Star rating.\nPs Clean your ovens! The last slice I got for $6 tasted like a dirty pizza oven.", "author": "Derk L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Some of the most delicious pizza by the slice I've had.\n\nWe wanted to pick up dinner to-go for a night in, and the whole time my boyfriend was complain that \"Escape from NY\" was closer and \"just as good\".\n\nWe got the purple haze and grandma slices, and they absolutely blew him away. Slice house is the pizza place to go to in the Haight. \n\nTheir cashier was super friendly, and everything was fast and hot, even after walking it home.", "author": "Kitt V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "as close to NY pizza as you can find in the city. 'nough said?\n$6 for a cheese slice is a little steep IMHO, but they are huge so that almost makes it worthy.\n\n$38 for one pie delivery?!?!", "author": "Wendy X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Probably the best slice in San Francisco, and the Upper Haight location is clean and convivial w/ very friendly, helpful staff.\n\nBut I am going to deduct a star as it's a) a tad pricey and b) not great for vegetarians.", "author": "David H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-29", "description": "Oh man, I wish you guys were better. Great location, spent a lot of money on decor, good music, but mediocre pizza - which is hard to do. If you guys simply tried harder - at any part of the pizza - there'd be no complaints.  But the crust is flavorless (which is actually a secret of good pizza), the sauce is boring and liquid, and cheese and toppings are only \"decent\". Try harder on your execution and you have potential beyond just a trendy pizza slice spot for drunks who can afford you - otherwise you'll be just another shitty Haight pizza spot.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "I tend to be in the Haight a lot and my quick go to meal is a slice and a beer.\n\nI really wish I could get both in one place, but that's another issue.\n\nThe selection at Tony's is similar to Escape from New York a couple of blocks away, and the ingredients are comparable. If I were ordering a whole pie, then hands down it'd be Tony's, but for just a slice, it's pretty similar to EFNY.\n\nThe thing that threw me was, since they don't serve beer (but you can bring it in), I ordered a can of soda. That was $3.  Let me clarify, $3 for a can of Diet Coke. Not imported, not cane sugar, the same Diet Coke that you get at the corner store (and overpay) for $1.  \n\nAll things being considered, I'd rather have my slice at Escape from New York a couple of blocks up and pay less than $2 for a soda, or more likely, grab my slice and head to Murio's to add a pint of Pliny.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "The latest Slice House in Tony's growing pizza empire, this location occupies the same space as the previous pizza vendor at The Market (housed in the Twitter building). I've been to most of the Slice Houses, including the original in North Beach, the ballpark version at AT&T Park, and even the one at Green Valley Ranch outside Las Vegas, so I was excited to hear a new location was opening in the rapidly evolving mid-Market area.\n\nSo how does the newest Slice House stack up? I arrived just after opening at 11am and tried out a cheese slice and a Grandma slice. The verdict: solid -- much better than the Slice House at AT&T Park, but not quite up to the standards of the North Beach original. The slices were a bit dry -- surprising, as they had just come out of the oven. However, the tomato sauce on the Grandma slice was as amazing as the sauce at the other locations, and the very fact they offer Sicilian-style Grandma pizzas will forever cement Tony's place among my pantheon of favorite pizza places.\n\nWord on the street is that this Slice House will introduce its full menu soon, and I look forward to a return visit for more lunchtime pizza goodness.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Really good pizza-by-the-slice restaurant. The service is fast and friendly. This is a great spot to grab a bite to eat as you are out and about along Haight Street. I recommend the cheese slice and a bottle of root beer.", "author": "Ward S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Honestly, not a lot to say.  We popped in during the Haight street festival just wanted a quick, simple and fast slice of pizza. They delivered. I ordered the meat lovers which was so large it draped over the paper plate. Thin slice with a nice doughy crust and just greasy enough. While its no golden boy, which is near and dear to my heart, it hit the spot and fit the bill on an otherwise crazy day. Would love to try the Sicilian slice next time.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Tony's has the best pizza in SF hands down. \nThis location has a great vibe, good art, and amazing pizza. \n\nWaiting for the alcohol to get there :)", "author": "farah b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Best burger I've had in a long time. Everything made in house. Pepperoni slice added to my order......for science.  Almost as hard as getting pepperoni pizza wrong, is getting it to taste as fresh and unique as it does here. \n\nEat here", "author": "Tim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-03", "description": "Pizza here is fine, but I'd rather go to escape from  New York up the block. My pizza was just lukewarm\nAnd it took forever to get our very small side salad. It took at least 10 min and we had almost finished our slices of pizza. Then after spending $20 they wouldn't let me use the bathroom. I won't be back!", "author": "La H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "LOVE!! The dough is amazing and the owner is super nice! Go and get your pizza on and support\nLocal business! ;)", "author": "Yasmeen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Delicious, authentic pizzas. My favorite pizza is the Wise Guy, it's absolutely delicious, give it a try! The purple haze is also a good pizza if you're looking for something less traditional. You can't go wrong here: from the crust, to the sauces, to the meats and cheeses...everything is delicious and authentic.", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-26", "description": "7 dollars for 7 pieces of garlic fries.....really? come on, up the size of the box and this place would be great.  The pizza itself was hot n fresh to almost perfection so i can't knock on that but DAYUM waaaay over priced for the fries.  If pizza only then definitely 4-5 stars but if you factor in the fries you end up with a 3.  Don't get me wrong the fries were good though, just up the serving size please!", "author": "Vince L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Great pizza and almost as good as Pagliacci's in Capitol Hill Seattle, however it's a bock away from where I live, so can't complain.  Pretty good size and always had a good experience with their customer service.  Must try them all.", "author": "Justin I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "This pizza is super lit! I favor the thin crust. But I tried both. I'm not a fan of such a doughy crust. But both were equally delicious but in different ways. The thin crust allows the toppings be the star of the show. And believe me they shine! The thick crust is a fluffy comforting pillow for all the toppings. It all depends on what you prefer. Both are equally amazing in their own special way. When I return to San Francisco I will make my was across town if I have to go feed my craving for this amazing pizza. And next time I want to try the Tacos! A must try. Take note if you're a out of towner such as myself, this restaurant is located inside \"the market\". Which I passed because I didn't know it was inside a market. A amazing market at that! The hot food they sell there was just as delicious. Idk if Slice House cooks that food too. But it was just as good!", "author": "George R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Finally decent Pizza in the Haight! No longer will I be forced to go to the crappy slice only offering dumps in this neighborhood. Tony's  offers an amazing array of different kinds of pizza slices not to mention sandwiches, salads, Burgers even and tons of awesome sides like house made onion rings, meatballs and pancetta fried french fries.\n\nThe decor inside is super cool and goes with the Haight Vibe very well. There are not a lot of good places to eat on the Haight now we actually have one more.\nThe Purple Haze slice and the Fig balsamic slice are some of my favorites.\n\nIf you like the other locations I love this one too.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "This place was recommended to me by someone who works near the 2nd st. location. I ordered the Cal Italia pizza for delivery. I gotta say, it was tasty and it had so much promise, the ingredients seem to work well together. I have to give only 3 stars because it took 2 hours to arrive and it was ice cold when I got it. The cheese had that cold pizza congealed texture, so I had to re-heat the pizza before I ate it. Prosciutto doesn't do that well when you run it through a toaster oven. It loses its tender texture and all that nice marbling just renders down to grease. I wish I could have tasted this pizza fresh, and I will definitely do that in the future, at which time I will update my review. FYI they made it right and (through GrubHub) refunded my order. I appreciate that a lot and it's why they didn't get 2 stars. Not a great first impression, but I'll be back.", "author": "Traci R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "This is my favorite pizza in the city. The award winning fig one is unique and delicious. The grandmas slices are a favorite too!", "author": "K A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-24", "description": "Portions are large but it doesn't matter how big of a slice you get if the pizza is super average. If you just want to eat a big portion then this is the place to go. If you're here hoping to get a great tasting pizza then go somewhere else.", "author": " Don N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "5$ + slices but they are straight up huge. \n\nSo happy to have some good pizza in the area finally. Excited for the delivery. Easily one of best slice style spots in the city.\n\nI would appreciate if when ordering a whole pie, they did not leave the giant slices! haha. Had to cut each slice in half again. \n\nFriendly staff.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "I was first introduced to the Slice House at AT&T Park, where it remains some of the best food in the ballpark. Open at 11:00 am on a Saturday got it delivered in under a half hour just in time for lunch. Love their classic pepperoni pizza.", "author": "Dennis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "The sauce is quite good. And the pepperoni. The crust is really what stood out for me. It's got a great flavor and texture, and really comlements the sauce and cheese. \n\n:)", "author": "Kelli-Jean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "The slices are large and crispy. I normally get the pepperoni. The Silcilian​ (sp)slice is large and very good as well. The prices here are a bit higher probably due to the Twitter building.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Mushroom slice was awesome . Just the perfect amount of sauce, cheese and mushrooms . Quick and fast service", "author": "Joe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-12", "description": "Cool lunch spot. Always get the sweet grandma. I think this place is the cheapest place to get food at in \"The Market\". Not much to say since its a grab and go place for me. \n\nGet the Sweet Grandma (yes, most of my lunches consist of pizza).", "author": "Janet K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Delicious pizza! Stoked to have another pizza place in the hood; especially this food. I balked at the $5.25 for a slice, but it's easily two slices at most other places. And brings a much nicer ambiance than Escape from New York which I also love. \n\nLemonade on the counter looked a little rancid - with what looked like moldy leaves and gunk in there, but hopefully it at least tasted good - I definitely wasn't going to try. Also, all but two options for by the slice were sold out at 715pm - Glad to see people checking it out. \n\nLooking forward to coming back and trying the Purple potato option!", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "nothing re-heated can be that great.  plus toppings too salty on the Fratellanza.  not very balanced.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "Pizza is ALWAYS bomb. Some of the best in the world (see rewards). Garlic bread, is award winning for half assed crap. A 20 cent roll with butter/olive oil and half cooked garlic cloves. DO NOT PAY $6 FOR THIS TASTELESS OVERPRICED BREAD", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "So first off, the pizza definitely is excellent. But even with counter service, they need to dial-in their customer service and presentation to justify the prices. We came in off the Haight and ordered a nine dollar Caesar salad and a 13 inch crazy eight pie at $24. We requested dine-in. The Caesar salad was brought to us as chopped romaine in a paper basket, with two anchovies and sliced Parmesan on top, with a heavy dressing delivered in a plastic to-go container. After waiting far too long for our pizza, we checked in and the server, and she told us \"we just boxed it up.\" Open paren never mind the fact that we had ordered this for here). Alas, it had lost that fresh from the oven heat.", "author": "Wally S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Well this has really made my day. Just so happy I don't have to travel to North Beach to get Tony's, which of course means excellent.\nThis new place is decorated really well, from the wallpaper to the ceiling. I had the Sicilian but also tried bites of the pepperoni and cheese. One word, amazing!\nFolks these slices are definitely worth the calories, wait and the price. \nThe people who work there are super friendly. If you're visiting SF, don't leave without trying a slice or two.", "author": "V S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-15", "description": "Pizza was ok not the best the only reason they get 2 stars is for the food. The lady the ring me up and gave me my pizza was rude and she deserves no stars . I won't be going back there when there is so many more places to choose from", "author": "Channing M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-27", "description": "Mediocre pizza , red sauce is oddly sweet. I'm sure there is better. I would find it if I was you , for 5.50 a slice it's overpriced.", "author": "Issac L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "big yummy slices of pizza at a decent price and cool decor/wall art! Yay! I'm a fan!", "author": "Terra C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-17", "description": "Worst pizza I've ever had. Chick behind the register had a mean girl persona. The CHEESE pizza is $5. I don't care how big it was, I had to dab it with napkins to get the puddles of grease/oil off before taking a bite. The pizza tasted like they hadn't cleaned their oven in forever. I didn't finish it. I'll never eat here ever again... I only picked 1 star before I couldn't post this otherwise...", "author": "Grace A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "Made the mistake of asking for one too many things with my order. Got glared down and snickered at by the entire staff of four to be told no, there isn't a problem. When you don't look the part in Tech Gulch, expect to be served but with back up.  While dining, three security guards were dispatched to check on me. \n\nOh and the pizza? I had the sweet grandma. Tasty but not warm at all.  Never again.", "author": "William W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Such good pizza!  I especially like their dough, and their casual space with no long lines on a weekend night.  Slices are about $5.  Cheese is safe, but Purple Haze is really good!  I would love to try the other flavors which unfortunately come in only whole pies.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-06", "description": "I love love love pizza. When I cheat its with pizza. So with a heavy heart in my opinion this pizza was just ok. I had high expectations after trying the Walnut Creek location with my friends on ordered extra sauce on my pizzas and they were still dry. We had a 20\" Combo Americano with pesto ( up charge of $5 for pesto) and that was delicious, we also ordered 20\" pepperoni with extra sauce and pesto. This pizza was dry (no extra sauce) and the swirl of pesto was so not worth the $5 up charge. The garlic bread (cheese) was dry and had no dipping sauce. Not impressed at all. Sad that was my cheat. Next time I'm having a beer.", "author": "Ginger G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "Pizza isn't that great\nIt is a huge improvement to what was here before \nIt is the best to go option at the market\nSushi place is bad\nMexican is even worse\nI live next door so it's nice to have a quick option", "author": "Kelly A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "I was lucky enough to somehow get great parking on haight on an busy saturday afternoon .\nWalked in and the place suddenly got super quiet. The older lady at the register said hello very bitterly I felt VERY UNWELCOME to be there. One girl was staring into dead space as if my presence was annoying her, but back to the customer service.\nThe lady was an older lady maybe mid maybe late 40's and she was extremely rude and her voice was sharp and quick as if she needed to hurry up and complete my order so I can hurry and leave. I asked to purchase a soda after deciding from the many already cooked pizzas she showed me the selection and I asked for a can (not bottle) but before I could tell her which flavor/brand she sharply exclaimed \"but what kind!!\" It was pretty degrading to do that in font of a fully packed pizzeria. She then gave me the receipt to sign as I reviewed my purchase and was about to begin to sign for the pizza slice and can of soda she quickly jerked her head at me and looked down at the area to sign for the charge (the same area where a tip can be included) and  checked to see if I was leaving a tip or not. I thought she was the manager so I would think that she would need to worry so much about if I was tipping or not (which I did) but it felt very much like it was forced. $13 for a slice of pizza and a can of Coke seem a bit over priced not to include the bad customer service skills but the cashier was out of control.\nI wont ever be back and will be emailing the owner of the chain. This felt much like profiling or racial mistreatment or discrimination as if I was not allowed in the establishment as my presence was bothering her customers. The bay area has very bad issues of social/public mistreatment of people of color and ethnicity. This is just another prime example. I wont be back", "author": "Average C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-31", "description": "Went here on a whim today because I was craving pizza and I happened to be passing by the Twitter building on Market. Ordered a slice of the pepperoni because the pie in the display case was still whole and I assumed it would be at least somewhat more freshly made than the other options. \n\nAlas, it was *incredibly* greasy. Even after using several napkins to blot my slice, I still had grease dribbling onto my hand while eating it. I also ended up with a huge pile of grease-soaked napkins by the time I was finished with my slice. Yuck. I think I went through at least a dozen napkins and felt wasteful about it but yeah, it was THAT oily.\n\nThe crust was actually quite good -- not soggy at all despite all the grease on the surface. That was the best part and why I'm giving them two stars instead of one. The pepperoni tasted off (had an unpleasantly stale/oxidized flavor). \n\nThe tomato sauce was just okay. I'm not a fan of oregano and I tasted too much. I prefer a cleaner, brighter, fresher tomato sauce than what I got in my slice. There was also too much cheese, at least in the sense that the cheese/sauce ratio was out of whack (based on my own personal preferences, anyway). I ended up picking a bunch of the cheese off. \n\nI may give Slice House one more chance based on the quality of the crust, but if I do, I'll go to a different location next time and choose a slice with different toppings.", "author": "Maya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "Great presentation! Interesting combos.\n Sweet Grandma uses a sweet tomato sauce with large pieces of mozzarella. \nYou can order slice $6 each or whole pie about $33.", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Today was the Grand Opening and had to check it out \n\nGreat Decor fits the Haight Perfectly!\nAwesome and Gnarly pies!\n\nI had the \"love me 2 times\" slice and it was amazing.  Pesto Mozz Sun Dried tomatoes with added red sauce \n\nMust check it out!", "author": "Majid P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "This place is incredible. We were looking for a pizza place on Haight Street and stumbled across this place's excellent reviews online. Not only did it live up to the hype, but it far exceed our expectations. The pizza was insanely delicious (and that's saying a lot seeing as I was born & raised in NY haha). Also, everything is house made, including their delicious homemade ranch dressing. The environment was quaint, but cool & quirky, and the young woman taking our orders seemed to genuinely love her job & the quality of the food. I definitely recommend this place!", "author": "Meghan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Amazing pizza - can't go wrong. Had it delivered via door dash and it was still incredible. Pasaeno is what I recommend", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "We're here often because it's an easy walk from our house and the pizza is delicious!  It's wonderful to have the Slice House by Tony Gemignani on Haight Street.  \nOur go-to pizza orders are slices of cheese or pepperoni, extra crispy. Purple Haze and Grandma are favorites, too.\nOur vegetarian friends were happily sated with their mixed greens salad and Gemeli pasta.\nIs everyone happy?  Absolutely!  The staff is always welcoming and friendly.", "author": "Geri S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-31", "description": "Don't bother with this place! Terrible! Waited 45 min. for two whole pizzas. Rub insult to injury, they are COLD. $62 wasted. Thumbs down!!! Terrible! Waited 45 min. for a whole pizza and I'm still waiting. Thumbs down!!! Terrible! Waited 45 min. for a whole pizza and I'm still waiting. Thumbs down!!!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-11", "description": "So disappointing. I've had north beach's slice house pizza a few times & liked it. This Haight St. location is nothing like it. The crust sucks, its not cooked thoroughly & it is pretty flavorless. This review is for The Wiseguy & Crazy 8 pizzas. Maybe the basic pepperoni or non-specialty pizza is better. Add this to the long list of horrible pizza in SF. Believe all the negative reviews. Don't order from here.", "author": "San X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "$5 for a slice of cheese would make anyone think twice. The slice is huge! Pretty much two slices in one. This spot is located inside the Market and has some tasty looking pizza  selections. Service is quick, ingredients are fresh, the quality is there. Stop by for a slice or a box!", "author": "J M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-30", "description": "I don't appreciate going to a restaurant that doesn't keep their advertised hours. I went by tonite about 9:30.  The place was supposed to be open until 10.  The place was closed and the chairs were up on tables as if they had closed quite awhile before and had already cleaned up.  Can't comment on the food, but obviously no concern for their customers!", "author": "Dan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "We walked down Haight last night with some out of state family and this pizza place caught our eye! The 5 of us all raved about how delicious this place was and how we'd definitely stop by again while in the area! We had the Meat Lovers, Purple haze and Grandma, all perfectly seasoned, crispy, cheesy and delicious! We also shared a side of garlic fries, that were freshly made after our order..garlic perfection, grab some lemonade too! You need to stop by and have a slice to understand the hype!", "author": "Ámbar B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "The cheese slice was tasty. The pepperoni was way too greasy. $5 for a slice of cheese pizza isn't good enough value for this local to come back. You need two to be full, which including tax and tip puts you over $12. I can get a great sandwich across the street at Haight Ashbury market for $8-9, and that will have much more diverse flavors.", "author": "Thom N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "I have been a fan of Tony's pizza for years. I've been to his places in North Beach & by the ballpark. This location is true to the high level of quality at Tony's other restaurants. But this one is near my home AND once they start delivery, I'll be in their delivery range - hurray!! One this first visit, I got multiple single slices of pizza, they were all delish but what can I say - I loved the classic pepperoni slice so much. Look forward to coming back for the meatball sandwich AND ordering pies for delivery.", "author": "Rochelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Cool space! The pizza was great and the service was stellar. It's Haight-Ashbury so kind of touristy.", "author": "Jennifer V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Give it to me baby. Give me that stuff that awesome stuff! Had a couple of slices on a rainy night. It wasn't busy cuz of the weather. Hot and crispy out of the oven (not so much at Escape from New York. lukewarm pizza is a drag). One had potatoes on it (wonderful!) and the other one had jalapenos and it was killer. Spicy oil on the table if you like it even spicier. I'm not a crust eater, but with that oil, fab. It's a little more expensive than some places but it's so delicious and they're big slices. The space is clean and looks like a restaurant, not a fast food joint. This is my new fave. (There's a reason this guy wins pizza making contests).", "author": "Nini M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Girl and I got a whole \"small\" Wiseguy Pizza to share and brought in tallboy beers from the Liquor store nearby (Pizza needs beer). Hopefully Slice house can get some beer up in this joint! Pizza was tasty and we had leftovers for later!", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-25", "description": "I've been coming to this spot for a good 10 years when it was fat slice now that it has change I am very disappointed the old recipes were way better and the service was way better I heard the cashier tell a paying customer they had to walk down the street to a public bathroom when I have been in there bathroom in the back many of times I know they wanted change to accommodate a higher paying customer base or that's what they told me the 1st time I came after the change but like I said I would have gave the old place 5 plus stars this is not good pizza for returning customers", "author": "Jeanine F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Best cheap lunch in mid-market: a slice here. Everything I've had is good, but my two favorites are the sweet grandma and the purple potato. Not nearly enough seating, but it's not a big deal.", "author": "Jack P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Best New York style pizza in SF. I ought to know. Every time I walk by The Market my mouth starts watering.", "author": "Patrick F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "The Cal Italia pizza was excellent. I'd definitely eat here again! Awesome crust! Different flavors than usual!", "author": "Simon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "California Dreamin. I know it's mostly about the pizza here but you have to try this sandwich. Just enough peppers to make it spicy, but not so hot that you can't taste the chicken and bacon. Plus the very courteous young ladies were very patient with me. Hope to be back soon.", "author": "Alberto D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "It's Tony's and without the two hour wait like the one in North Beach!", "author": "George M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "Ate there yesterday. Food was good, but it took way too long to get our side salads. We got them after our pizza slice, which doesn't make sense. Non soda refills either.", "author": "Gretchen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Wonderful delicious pizza in beautiful place Very pleasant atmosphere. Fast service and nice prices. Kind and friendly staff.", "author": "Finley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Great Grandma slice!  And a wonderful spicy pasta too boot.", "author": "Benjamin I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Came in for lunch the other day because I heard Tony G had a new Slice House in the neighborhood, and it was top notch pizza! The decor of the restaurant is awesome and fits great in the Haight Ashbury neighborhood. Try the Purple Haze and the house made lemonade, both are excellent! Don't forget to leave without a cool Tee shirt as well. Great job Slice House!", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "If you've ever been to one of Tony's pizzerias before you know what a treat you're in for. If you haven't, her there now. Amazing pizza made with the upmost respect for the craft. This new location is decorated to fit the Haight district and it's awesome. Another home run for Tony. And grab a shirt while you're there.", "author": "Angie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-08", "description": "Solid slice.  If you're expecting it to be as good as their brick and mortar location in North Beach, you will be disappointed.  $6/slice, a bit on the pricier side.  The funghi is usually well-balanced but on occasion is overwhelmed by the olives.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Excellent in every way! The pizza is of exquisite quality--crisp, with a crust that balances sponginess and hardness perfectly--and is ready virtually instantly. The atmosphere is great, too: friendly staff, retro decor and appealing background music make for an overall great experience.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Everything I've tried here so far is amazing! The pizzas are great. The pastas were the surprise. Add the amazing meatballs to the pastas and it's a satisfying meal.", "author": "GK S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-03", "description": "Yawn... This place is a mess. There is always confusion when ordering just pizza. It's changed over to Tony's but I don't see it as the same quality as Tony's should be. And a slice is $6+! That's way to pricy. Pepperoni pizza is always full of grease. Need napkins to soak it up before eating. I wish they had chicken pizza. Or a pizza punch card. Get your 10th slice free.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "There aren't really any good pizza places in Mid-Market for weekday lunch and this place hits the spot. The slices may be pre-made and warmed up, but the NY style thin crust is oh so good! Their deep dish slices are also tasty.", "author": "Doug V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Love Tony's Pizza so much! So excited to now have it in The Haight! I love that they have different styles of pizza. My favorite is The Grandma... SOOOOO GOOD!", "author": "Megan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Great atmosphere, amazing pie! Coming all the way from way up north and this will be my main stop in SF.", "author": "Jeff E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "This place is great! Super friendly staff (manager greeted me when she came out and was so kind), fast, well priced and really great food! Highly recommend checking this place out!", "author": "Becky D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "The food, ambiance, and service was excellent! We'll definitely be eating here on a regular basis! Thank you!", "author": "Laura V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "Great Pizza - but if you order to go, there's a high probability you won't get what you ordered.  The last three times I've ordered to go, NOT ONE of the orders was correct.  I think the crew there is taking breaks on Haight street and the second-hand smoke is getting to them.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Best pizza in the haight! After living in the mission I ended up moving to the food desert that is upper haight. Along came this spot and we finally have an oasis! Meat lovers is my personal favorite but it's all great!", "author": "Brian W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "I was anxious to try this place because I'd heard good things about Gemignani.  I ordered a slice of \"Grandma.\"  They put it in the oven for a few minutes.  It had about five little pieces of Trader Joe's stick mozzarella and about six little green things, like blades of grass, and some itty-bitty, sparsely-placed pieces of tomato.  It was covered with what tasted like lard with sugar in it.  NASTY!!!  POO!!!  Two bites and it was in the compost bin.  I hope the worms don't get sick.  For $6.50 you can get TWO slices of almost always delish and interesting pizza at Arizmendi on Valencia.  As the Jewish people say, \"Never again!\"", "author": "Robert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "We tried the Picante and Pepperoni pizza. Both were good and slices are big. However still somewhat expensive at $6 for a slice.", "author": "Renan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Been here 8 times in 3 months. This is arguably the best NY style pizza in San Francisco. It is insane that it doesn't have a line out the door. Come from the Marina; come from the Dogpatch; christ, come from the Peninsula. This place is worth it.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "Happen to stop by this place out of chance and wow the pizza is good! Definitely recommend it, if you happen to be in the area.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "Ordered a slice of 'grandma' today and it barely had any sauce. It had plenty of mozzarella but it was barely warm. That's a great slice when its actually hot and more than a single drizzle of sauce.  I paid over $6 for a thick piece of bread with room temperature slices of mozzarella. Super disappointing. Will just have to wait for whenever I go to the east bay and go to the WC location. Was never let down there.", "author": "Brooke F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "I had previously eaten at Tony's restaurant in North Beach, and always found it to be exceptional and among the best pizza places in SF (which is saying a lot, as we are home to some truly great pizza makers -- the New Yorkers who say otherwise are in denial).  I tried his new slice house on Upper Haight.  Wow!  I ate one of the best slices of pizza I have ever encountered.  The crust was perfect -- thin, just crispy enough, mildly charred (but not too charred).  And the toppings were fantastic, including some truly delicious little ripe, sweet tomatoes.  I can't wait to go back.", "author": "Tony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Hands down best pizza slices.  Easy to order and pick up.  The extra large pizza is 8 slices but really huge.  Think of it as 2 slices = 1 tony's slice.", "author": "around town e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Amazing pizza Lemonade off the charts . Probably the best I've ever had !!! There hoodie dedicated to their restaurant is an amazing design very Haight street and unique. Hoodie $40 Tshirt  $20. Service was decent and Pizza was fresh and sooooo good . Had to wait 10 minutes as they just ran out of the Sicilian but worth the wait , my only complaint:)", "author": "Athena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "I work on Haight street and come here all the time, this is just what Haight has been missing!! I don't understand any of the negative reviews, everything on this menu is completely customized. From what I understand, every Slice House has a menu that is customized to the neighborhood. I'm not going to go to Tony's in North Beach or on 2nd and write a negative review because they don't sell burgers at those places. It's weird that people care so much about menus. Let see some reviews about the customer service and food quality because everything here is AMAZING! :)", "author": "Dilan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Walked in, ordered an extra large cheese...ten minutes later pizza heaven for 4 people.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "I just came in after hearing all the buzz about this place. The manager recommended the slice Love Me Two Times which was so good! I was eyeballing the grandma slice and the purple haze for next time. The atmosphere was great, cool 90's music playing and very haight street style wall art. So glad we have a great pizza spot on haight!", "author": "Diyar Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Tony Gemignani does it again! Best pizza in the neighborhood! The Slice of the Day this past Saturday was the single best Slice of pizza I have ever had! A welcome addition to The Haight!", "author": "Trevor H."}
