{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Hunter's Point landmark brewery now. Closest one to the new Shipyard development \n\nFriday nights pop-up restaurant with Keith. Great local atmosphere. \n\nMeet your neighbors here. Good tasting brew and friendly staff.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Glad to see the Taproom is up and running again. I sincerely hope that they can make it work this time around because they have a great space + the beers are well made\n\nOverall Thoughts\n\nKeep pouring out the great beers!", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "What a find! Once you step into the door, the ambiance hits you and boy does it feel good. Seriously this is the coolest place to grab a beer or two with the homies. There is a great selection of brews to enjoy. It is nice when there is something for everyone. I really enjoyed the refreshing Hunters Point Pale Ale. Did I mention there are other libations to enjoy, such as classic bottled Coca-Cola? Well there are. Plus, a bag of chips or a pretzel can be snacked on while chillin' and enjoying a refreshment.\nIt is really cool that events can be hosted here. The events are posted up at the bar. Some events involve food.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Great beer selection!!! Cool vibes! Great atmosphere! The bartender Nick was sooooooo amazing though!!! He was so knowledgeable and gave a few samples of his favorite beers so we would really enjoy our experience! Thank you!!", "author": "Staci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Great beer & friendly people. They recommended  Brewery's in the area since I told the bartender that I LOVE IPA's!", "author": "Karmela Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Brett and Matt the bartenders were AMAZING in helping us pick some beers that would satisfy us. We later met NIck the manager who was also as kind and as hospital. The best part about the amazing brewery for us is they have a DOG FRIENDLY PATIO. Not to mention their amazing beer selection that caters to each individual person. I am planning on returning at least once a month from Big Sur from this awesome experience", "author": "Sara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "Awww, I'm sad to see that a quality craft brewery in the form of Speakeasy has bitten the dust, or is about to, as it appears that they haven't closed entirely yet and are looking for a sale. You could easily find their Big Daddy IPA and Prohibition Ale all around town, and at their gorgeous tap room you could find more of their tasty brews.\n\nI personally enjoyed Speakeasy greatly, and they had big, fun community events at their brewery from time to time. I hope Speakeasy's closure isn't a sign that there's too much capacity in the craft brewing industry and that a mass wave of closures is imminent. RIP.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "One of my favorite beers, great place, very welcoming and great for groups. The staff is very friendly really good IPAS and stouts. My go to beer is the Double Daddy and the Old GodFather. Cant wait to go back.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "I wanted to do a beer tasting and I typically like Speakeasy type of places. I came on a Friday and the place felt almost empty which I kind of like since I don't really care for crowds. The inside of the place was warm and cozy. They had several selections of beer that you can do a flight of. They do not have any food inside of the place which I like to have food if I'm drinking.  I tried several types of beer and didn't care for the beers except the darker ones and the Porter with Philz beans. I'm not much of a beer drinker! This is an ok place but I prefer sour beer and cocktails!", "author": "Courtney Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Awesome little find after Archimedes Banya! Wish it was a bit closer to the city but will definitely be coming back. Awesome decor as well!", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I would rate these beers above average for craft beers. And they better be good, because while people do live around here, for most this is way out of the way.\n\nBut if you are going to go with the speakeasy motif, ditch the TV above the bar, it kills the vibe. You don't necessarily have to adopt the whole secret password stuff, but at least make the inside coherent by not having bright electronics.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "I was looking for some craft breweries to try out - and found a few that were not far away from my hotel by SFO. \n\nI visited Speakeasy on a Thursday night - it's a small place inside, not a lot of seating, and there was a good number of folks on hand enjoying their brews.\n\nI ordered a tasting flight of four brews:\n\nTallulah Extra Pale Ale (5.6% ABV)\nVendetta IPA (7.6% ABV)\nDouble Daddy Blood Orange Imperial IPA (8.5% ABV)\nCalifornia Love Imperial Red Ale (7.9% ABV)\n\nI very much enjoyed the first three ales. The Imperial Red was kind of bland compared to the first three Ales. It's also possible that my taste buds were wrecked after the first three ales and I could not parse out the flavors...\n\nThe Double Daddy was super skunky - and I mean that in only the best possible way. It was my favorite of the four, followed by the Vendetta and then the Tallulah...\n\nIf you plan to pay via credit card - I believe the minimum is more than $10.00.\n\nCool little craft brewery! I'd visit here again!", "author": "Neal E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Wait, there is a brewery in Hunter's Point? I need to leave the comfort of the city? WORTH IT!\n\nFinally made the trip to Speakeasy Ales & Lagers this past Sunday and was completely blown away by the experience here. My fiancé and I decided to take a nice bike ride out to Speakeasy to see what all the buzz was about.  Located south of the Dogpatch near the loading docks and old Piers Speakeasy is a bit off the beaten path.  Luckily, we came on an afternoon when they were holding a cool fundraiser and we were greeted at the front gates with blasting jazz music, people dressed up in 1920s style costumes, an outdoor magic show, oh and a bounce house! I was instantly hooked. From the moment we rode up the property the staff here was out of this world friendly.  The door guy greeted us and said we could safely lock up our bikes by the entrance of the brewpub and even suggested that they would be safe overnight (if we indulged in one too many). \n\nThe property of the brewpub is quite large, a massive outdoor space with picnic tables, high tops and some corn hole to keep you occupied while sipping on some great beers.  Inside, this spot has a truly authentic 'speakeasy' decor.  Dimly lit bar with old wood paneling and some mix-matched vintage chairs and couches to lounge in.  The bar itself is quite small, only about 8 seats so get there early if you want to snag a table.  The bartenders inside were incredibly friendly, immediately handing us menus, answering any questions we had about various beer styles and all chatting/having a good time at work. I always like to see bartenders that actually look like they enjoy their job and this group of guys had a smile on their face all day, joking, chatting and having small talk with all the customers in the bar during the day. \n\nFor beers we had the Vendetta IPA ($6), Blind Tiger Imperial IPA ($6), Tallulah Extra Pale Ale ($5), and Double Daddy DIPA ($5).  All were fantastic.  Speakeasy has a rotating selection of about 10+ drafts and you can purchase a handful of their limited release bottles at the tap room to take home and enjoy. Speakeasy also has a shuttle service on Friday of Giants games (with proof of ticket) you can grab some (more affordable) local beers before headed to the game in the complimentary shuttle. Also, they are part of the SF Brewers Guild Beer Shuttle - every third Wednesday the free shuttle takes you to a handful of local breweries including hosting events like meet the brew maker, etc.  A truly enjoyable experience at this gem of a tap room this weekend. Speakeasy has quickly become my new favorite brewery in the area and I can't wait to go back.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Speakeasy, the first beer that made me fall in love with beer. Before that I was a naive and stupid girl who drank Heineken because that's what Asians usually bring to parties. I was not living until Big Daddy came into my life. Ever since that, Speakeasy has been my favorite brewery. \n\nSomeone took me here for my first visit as a surprise and from then, I fell more in love with the brand. The bar, though small, is quite nice to chat with new people who love the beer as well. There's awesome decor. I wouldn't really recommend this place as a \"first date\" place, save this for a few dates in. Two communal-like room or for big groups then only a few seats in the bar area, but the outdoors area is open when there's an event!\n\nI really like the option of having tasters. 5 tasters for $7 or so. Good way to taste all those beers you're on the fence about buying a 6pack/giant bottle over. \n\nThere are a few snacks you can order, I haven't tried any yet, except a sample of the pretzel once. They also sell merchandise! \n\nIf it's your first time, no matter what beers you choose as your tasters, choose Metropolis as one of them.", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "On point local beers  sweet of da grid spot !! Would definitely comeback ... cute gear!! Yeah I'd recommend it.. worth checking out.", "author": "michelle r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "My first time visiting the brewery and I loved it! We showed up around 430 on Friday afternoon. It was already busy but we were able to snag a seat in the corner at the bar. The selection of beers were awesome! And the environment was top notch. \n\nIt was the brewmasters last day so the celebration all night was continuous with shots flowing. \n\nThe staff were all friendly and helpful. Probably some of the nicest people ever. Didn't get thrown off as the crowd kept coming. Handled everything very well. My favorite was Molly! She was funny, filled up our drinks when we were getting low and had this attitude about her that everyone loved. Even the security guard outside was great. We were one of the last to leave and car was parked solo, he made sure to check on it and make sure it didn't get broken into. Two thumbs up for looking out bro!", "author": "Erica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "I'm partial to anything 1920's themed, so this place grabbed my attention right away when I was visiting San Francisco and looking for local breweries.\n\nThe location, according to our Uber Driver, was a little off the beaten path. It wasn't in the best part of the city. I honestly feel like that added to the secretive \"speakeasy\" vibe.\n\nThe decor was SO amazing- a slot in the door in true speakeasy style, a man to check you in at the door with a flashlight, some nice one-man-band music going on, low lighting and private room areas. It was love at first sight, really.\n\nThe beer made everything better, and of course this is the most important part of a brewery, really. Every beer my husband and I tried, we loved. I especially appreciated the Pop Gun Pilsner. Go for a flight, you get to pick any you'd like to try!\n\nDefinitely try this place if you are looking for breweries in San Francisco- you won't be disappointed!", "author": "Desirae E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Really cool taproom and some of the best beers in the city (especially for that price!!). It's a little out of the way but kinda makes it great since they aren't that crowded. They also had a taco vendor outside last time we went.\nFavorites:\n- Baby Daddy session IPA\n- Saison (only sold at the taproom)\n- Popgun pilsner", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "The new remodel is great, place looks sharp!  \n\nNice spaces inside to sit, as well as some park benches outside to sit/drink/eat at.\n\nBeers, of course, are great.  I was already a fan before coming here, so the usuals that I drink were on point (had samplers): Baby Daddy Session IPA, Big Daddy IPA and Prohibition Ale.  The new release of the Blind Tiger Triple IPA was outstanding, very smooth and easy to drink for a ~10.7% beer; was only going to have one, but had to have two 10 oz. pours of the Blind Tiger since it was so good.\n\nYou can get beer to go (cans/bottles/crowlers etc.), so some good take home options after you find which ones are your favorites.\n\nService was friendly and good.\n\nWill definitely return.", "author": "Deon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-03", "description": "There beers are kinda like the neighborhood the brewery is in. Soulful, strong, big bold flavors just a real quality product. I had some seasonal pumpkin ale and some ipa's. There was a hot dog cart if you were hungry. \n\nCame in for their Friday happy hour, dollar off (already great prices of their beer). Parking was plentiful and pretty easy. It's more in the industrial part of Bayview so you don't have to worry about any riff raff hanging out on the corner. \n\nThe taproom isn't that big and since there was a warriors game it got crowded quick. The only women there were the bartenders so it was a major d.....ude fest. I mean, I went to the only all boys high school in the city so I know how that goes. Most of my friends then were from the Mission/Vis Valley/Excelsior/Cow Palace area (not exactly the Marina) so I'm used to kinda hoodish crowds. Here the crowd just wasn't my vibe, some were even more hoodish and some.... yeah just not really my crowd. \n\nSpeakeasy is kinda in the middle of nowhere and more of a destination, you can't really barhop/pubcrawl from it but I might return to do a brewery tour or when they have live music in the summer.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "I guess I am lucky that the Speakeasy Ales & Lagers is not within one mile from my home... because if it was, I would be here every other day sipping on delicious crafts and obtaining the beer belly, which definitely doesn't help the case for my nonexistent new years resolutions.\n\nAs I am a sucker for stouts, I just HAD to come when they hosted the Yelp event here last month. I really liked the vibe, and loved the cat that lurked around here. I believe I tried everything on their beer selection, and I have to say my favorites were Syndicate, Scarface and Black Hand (chocolate milk stout)... obviously, biased because I like strong stouts. My friend's favorite was the BBA (barrel aged) Scarface because she likes the strong taste.\n\nThe staff here was so nice and accommodating. I will definitely be back, if I find someone who is willing to make the trip with me here. \n\nRecommended? Yesss, don't come with a big-ass group though. I think 2-4 is a good number.", "author": "Solongo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "This is a really cool place to get beers! Very positive and fast paced environment. Went on a Saturday and it was packed! They have a lot of corn-hole games set up outside, and there is a lot of seating inside. \n\nThe beer here is great! The blood orange one was super tasty :) we also got a pretzel, which was good but it wasn't warm like I thought it would be. If you want mustard you have to buy a whole jar of it too-$5(but it's made with there beer in it- and looks pretty yummy). \n\nLove the little black cat that was wandering around!! \n\nThey also have parking!! Thank god! I hate dealing with street parking.", "author": "Hayley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "We have been here several times and it's always tough to leave. Love their set up, their pourers and the changing seasonal offerings. My favorite is getting a sampler and then finish with Double Daddy. Be sure to eat before you come because that will certainly give you a good buzz. \nM-F happy hour and Firkin Friday is on point. Haven't made it here on the weekend but they offer tours and other events.", "author": "Damaris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-05", "description": "They just started doing beer tours again at Speakeasy Ales & Lagers so while in SF, we went.  It's all the way out in Hunter's Point but the tour is less than $8 and you get 2 tasters of beer while you're there.  You also have the option of sitting at the bar and ordering beers as well.  We rode the MUNI out to Hunter's Point from Union Square.  It's about 45 minutes by bus so if you have alternate transportation, take that.  We were dropped outside the building and walked up.  For a Saturday afternoon, the place was still empty but I imagine that's because it's in the middle of nowhere.  They have corn hole out in the parking lot if you're so inclined, and the tasting room and bar area is dimly decorated.  I tried a pumpkin ale for both of my tasters, and one was actually served out of a giant pumpkin!  It was okay for beer but again, I'm not much of a beer drinker.  \n\nThere were a few people at the bar when we arrived and some of them went on the tour with us.  It wasn't my first brewery tour but it was cool to see and hear about their process.  Our tour guide admitted that it was his first day giving tours but welcomed any questions we might have.  Our tour group had a few questions but we were fine just listening.  We didn't stay long because we wanted to be back in Union Square to go back to Mikkeller and finish out our stay in SF.", "author": "Trina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Beer is good, decent price for the pours. I just wish they allowed dogs inside the brewery. I love beer, but love my dogs more. My favorite thing is to bring my dogs to breweries, however, with speakeasy, this isn't possible unless you want your dog to sit outside. For dog lovers there are other breweries which are much better.", "author": "Nicholas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "I recently rented out one of the small rooms to host a birthday. The tasting room manager, Nick, was awesome to work with. It was a great space, great beer, and the price was excellent. Would definitely recommend as a spot for a small group.", "author": "Laurel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Great job on redesign!  Staff is great and beer is on point.  It is a new favorite neighborhood spot.", "author": "Brad L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "One of my favorite places in this part of town. The workers and basically everyone there are always very friendly. Just a really great vibe. Very dark in there but nicely decorated. They offer a nice selection of beers. Usually I just order the big daddy or the double daddy IPA. Those two are probably my favorite ones. They also have beers for purchase and even refills in growlers. There's also outdoor seating and games that people can play. Simply a really great place to hang out with large and small groups.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "I've been spending a bit more time at Speakeasy and I've got to give an additional nod of respect to Jeff and Xavier. These guys make this place feel \"like home.\" Further, they have extensive knowledge about the beer, and about beer in general. I love hearing about what I'm drinking, and these members of the team will lend an ear and offer their expertise, which is much appreciated.\n\nSpeaking of beer.... I've noticed they frequently rotate the taps here. I was legitimately excited when I saw Metropolis was back on tap this week. I like knowing that there might be a surprise on the tap list when I walk in the door. I will continue to visit Speakeasy with frequency.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "Beer, beer, beer, I love beer. \n\nBoy does this place make some great beer. Plus they have a super cool speakeasy style tasting room. Belly up or hang out on a comfy couch and sip on some tasty suds. Go on a quick tour, grab some bottles to-go, and chat it up with the staff, everyone was quite friendly. I've been here a handful of times and each visit has been great.\n\nDrink up San Francisco, you've got one great brewery here.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "By far my favorite place to grab beers. I look forward to coming here on Tuesdays because it's a hit or miss on how busy they are. The bartenders make my day they are all goofy, fun and knowledgable of the beer selections.  They play roll the dice on Tuesdays, you roll the dice and whatever number you roll is how much you pay for your beer. They have seasonal beers and barrel aged. Great experience overall. Recommended to come if you are looking for a chill spot :) \n\nDOG FRIENDLY !!!", "author": "Gabriela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "LOVE this spot! The decor/ambiance is completely on par with the brews. Fantastic IPAs for days & bourbon barrel aged stouts/ales", "author": "Lindsay K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Blessed to be able to live right down the street from this place. Love the vibe. Beer is incredible!!", "author": "Mikey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Came here twice. Once was several years ago when it first opened and we were able to drink and walk through the actual distillery area and there were food trucks outside. Fun times!\n\nSecond time was much more recent and was still a great time. The actual bar/lounge area was dimly lit and it wasn't overly crowded for a Saturday night. Easy to find a table, easy to find parking. It's great!\n\nAnd, there are board and card games. We ended up playing Cards Against Humanity and that was fun. We stayed for almost 3 hours, drinking and playing. It was nice and chill.\n\nThough, to be honest, it's kind of in the middle of nowhere. At least for now. So if you're going for a beer at Speakeasy, you're basically *really* going for *several* beers at Speakeasy.\n\nFun space. I'll definitely be back.", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "The San Francisco Brewery Tour...STOP #1\n\nThe owner, Mr. Blackcat, was kind of a punk and did a swell job of ignoring me and my bros...but his staff was nice enough.  Yeah Mr. Blackcat...go crawl back into the hold you came out of!\n\nBeing MLK weekend, I started off with the four black beers: Porter, Milk Stout, Imperial Stout, and I think a Black IPA? Am I drunk already? They were all tasty, though all kind of tasted the same?  Also tried something called \"Unbroken\" and some of their Belgians...IT TASTES SO GOOD WHEN IT HITS YOUR LIPS!  I'll stop shouting...I'm only about 20oz of beer in so far...\n\nGo home Chun...you're drunk!", "author": "Chun P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Really nice space and friendly service. Their beers are good although I'm more into light ones so the saisson hit the spot. It's nice to come after work, especially since 12 oz. pours are $4 and 16 oz. are only $5.", "author": "Naomi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Ricky is so nice. I this place is my favorite brewery in SF. I can't remember the bouncer's name, but he's great too. Lots of IPAs here. The outside portion of the brewery has corn hole and picnic tables. The door to get in is just as you'd expect.", "author": "Kaz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "I was recently fortunate to stop here for my first-time at a Yelp Elite event. I had always wanted to check it out, but being on Evans Ave it's not exactly a place I walk by on a regular basis. \n\nSo glad I went to this event, as it exposed to me a super friendly staff and delicious selection of beers you can't always find at your local haunt. I tried some more common brews I had been holding off on (Prohibition and Double Daddy) but also some varieties I wouldn't normally go for. Everything was great and I came out with a pleasant buzz after the fact.\n\nI may not be able to make it over here on a regular basis, but will definitely bring friends this way if they are beer aficionados.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Although this place is a little out there, I would definitely recommend coming here! The staff was so super helpful and nice (shoutout to the bouncer who shares the same birthday as me and was just delightful). The beer is very good and the interior and decor is super cool as well. I would definitely check this place out", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I got to check this place out as part of a Yelp Elite event.  It was certain located in an area that  looked more like an industrial complex, so it definitely had the \"hidden away\" feel to it.  The brewery had a good selection of beers that were more hops-centered than other types.  I tried most of what's available on the list and all were pretty smooth and flavorful. The chocolate-milk stout was my favorite of the bunch. \n\nAs for the atmosphere the brewery is definitely dark, but feels private.  It's not a place for large groups, but well-suited for a pair of people. We also were given samples of sandwiches by Dusty Buns, which was a nice compliment to the event that day. \n\nI'd certainly come back again to check this place out.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "So happy Nick and team is breathing new life into this place! Great vibes, very well done decor and of course DELICIOUS and solid selection of beer. Great outdoor area to hang if you want some fresh air too. I just stopped in for a quick beer but was completely welcomed and so happy to come across this gem", "author": "Caitlin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "8/31/14: Came here on an epic beer run over the Labor Day weekend.  And after hitting up many breweries starting Sat and ending Sun, including Lagunitas, Russian River, Rogue, Mikkeller, Monk's Kettle, Cellarmaker, this place was our last stop.  That was a TON of beer, and to be honest I was looking forward to drinking some soda instead ha ha, but here we were...\n\nAfter an epic weekend of drinking, this beer was still AWESOME.  Yeah, some of the flavors I didn't like so much, but all were very flavorful, and some were extremely good...\n\n1. Double Daddy: a very flavorful IPA with a very rich body.  This was my favorite.\n\n2. Harvey Milk: smoky as expected for a very dark beer.  Medium richness and very satisfying.\n\nI also got, but didn't know which was which in the tasting lineup:\n\n3. Tallulah\n4. Metropolis Lager\n\nAND... all of this was SIX DOLLARS!!!  WTF!!!  I have never heard of a sampler that cheap.  Crazy.\n\nAnother noteworthy event happened: the 49ers were there on Sun hanging out it appeared, to celebrate one of their buddies' bday.  Sorry, I'm not a football follower so I dunno who was who, but I just wanted to say that when we walked in we didn't know they were pro players--but many of them came over to say hi and have a few drinks and gave hugs and stuff.  Some very pretty girls also came over later on and told us we needed to try these beers and gave us glasses.  We honestly had no idea who these people were 'till later, which goes to show how amazingly friendly and humble they were.  I think one of them even told my friend, \"we should hang out.\"  Ha ha, k.  Oh, and one of them was really good at piano!\n\nSo... beer was excellent, the price was simply out of this world, and the company--the best.\n\n5/5\n\n#pub #bar #beer #brewery", "author": "Dean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Dropped by Speakeasy upon arrival to SF. \n\nCreative decor. Isolated location with parking. Friendly staff!", "author": "Elaine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Speakeasy Ales & Lagers seems like it is in the middle of nowhere, with a relatively empty parking lot. As you walk to the entrance you will feel like you are about to enter a real Prohibition era speakeasy, sliding peephole in the door and all. The tap room itself has a dark and mysterious vibe, and is relatively quiet compared to most tap rooms.\n\nThe beer itself is very tasty; most of the brews are very hop-centric. Some of my favorites include the Double Daddy Imperial IPA and the Baby Daddy Session IPA. The Big Daddy IPA and the Prohibition Ale are also very good.\n\nPrices for a pint of one of the many Speakeasy ales and lagers are extremely reasonable, probably being the cheapest I have ever seen for craft beer. Check out Speakeasy Ales & Lagers if you have a car in the San Francisco area and are a fan of hoppy beers!", "author": "Lindsey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Friendly bartenders and brewers, good beers, reasonable prices for SF, Speakeasy is an all around win.\n\nOn Saturdays they have lawn games, brewery tours, and tasty snacks available. This is just a tap house, so if you are looking for a substantial meal, look elsewhere. However if you want good beer and good company, definitely check this place out. \n\nThe inside is dark and cozy, not a huge place. But on a nice day or night, they have picnic tables outside if you prefer some more room.", "author": "Meredith H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Not the coolest brewery I've ever been to, but it's hard to compare places in San Francisco to places down in San Diego where everything is cheaper and more spacious.\n\nSpeakeasy is definitely worth checking out, though!  Hunter's Point is supposed to be sketchy, but it didn't seem like it at all when I went.  There's PLENTY of room for parking, so take your car!  I took the bus, but it wasn't quite as close to the muni as it looked on a map.\n\nMy favourite beer was the Scarlett Red Rye. The Big Daddy IPA was another favourite, but the rest were a little forgettable. Whatever. I don't know that much about beer anyway. It's a nice weekend activity, so just swing by!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Love Speak Easy beers why...why not, it's great.\n\nSF brewery, great flavors, right here on Evans stret!\nBig daddy\nBaby daddy\nPop gun\nOh damn...GOD FATHER !\n...\n..\n.\nGOOD NIGHT..LOL", "author": "Matt J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "First time at the new taproom and the service still measures up to the quality. I have loved speakeasy since I turned 21 and they haven't missed a step since. Speakeasy is undoubtedly one of the best American breweries that can be found on the west coast.", "author": "Dallas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "great environment. \n\ngreat staff. \n\ngreat beer.\n\nparking is easy. \n\nlocation is in the middle of nowhere which is a relief not having to be in the mess of san francisco. \n\nsuper clean. \n\nthe end.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "I can't believe I haven't reviewed them yet! I love their beer! Payback porter is always my fave go to here. That is one seriously delicious beer! I was pleasantly surprised by Talullah and Scarlett. I can't say not to a Big Daddy and the Prohibition. They had a special brew back in May, I think it was international orange? Can't remember the name but it was amazing. I'm really just in love with their beer.\n\nThe only reason I dock them a star is how dark the new tap room is. If you come in from the sun, it takes some time to actually see anything inside. If you go on a Sunday, it will be pretty empty so the risk is minimal. I've also seen people dump a beer when they put it on a table with a very uneven surface.\n\nYou can walk there from the T which is nice but it's not in the best hood so keep your eyes open.", "author": "Tera K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "My fiancée took me to speakeasy for a my birthday and i must say, this has got to be one of the most enjoyable brewery experience. Ive been to numerous breweries and have never felt so welcome. \n\nAs we walked in, it was pretty dark, well coming from outside. Once your eyes adjusted, Speakeasy was pretty interesting, lots of things to look at. They have a bar and about 3 or 4 small type living-rooms that people can sit at. \n\nMolly was the friendliest beer-tenders I have ever ran across. She was very knowledgeable with the beers speakeasy was serving, with molly being experienced with beer, she even spoke about Different spots and beers in San Diego, since she had resided there before, she gave us some good spots to visit. \n\nIts cool that both beer-tenders were giving us the history of the Black cat, named BrewCat.. or something.. but the cat being there for 13-15 years is pretty cool. The protection of Speakeasy. \n\nFlights were for any 4 for $6 ( pretty decently priced for \"any\"). \nMy flight:\nDouble daddy- imperial ipa\nSuspect-belgian golden\nOld godfather -barley wine\nPayback - porter.\n\n**all the beers i had were good. they were all tasty and not watered down or even had the slightest taste of \"eehhhhh\". My favorite was the Barley wine(old godfather) i just loved the taste and at 9.5% ill give it my thumbs up. \n\nCheck out the medicine cabinet for good deals too.. =)\n\nWhen in SF, i would definately make speakeasy my first stop. Thanks Speakeasy and Molly, Definately started out my birthday right!", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "My all-time favorite brewery that produces the best IPA: Big Daddy and Double Big Daddy\nSurprisingly in the nicer area of Hunter's Point. If this will be your first time going here and you are taking an Uber out there. Don't think your driver is taking you to the middle of no where and is about to kidnap you. This location is in the cuts!\n\n+The tap room is a really cool spot to hang out with friends.\n+Bartenders were friendly.\n+Variety of IPA's, stouts, and other types\n+I went to their anniversary last June, and got to try different IPA's and other types.", "author": "Ron D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-11", "description": "Infamously known for brewing the Big Daddy Prohibition series of beers, this spot is definitely a go-to for any beer lover. The squad and I came here for a birthday party and not only did we enjoy ourselves with an excessive amount of beer, but we got to go on the \"tasting\" tour as well. For 7 bucks, I would definitely suggest to skip the tour and stick with the consumption of the beer in the drinking areas. \nAs for the facility itself, I found it to be a tad bit cramped on the inside. There's 3 different vintage parlor type seating areas where you can sit on couches. Luckily, our group was large enough that we were able to snatch one up for ourselves. The bar also has games like Jenga that you can borrow to keep yourself entertained. I would suggest at least putting in one more restroom, because just having a single occupancy restroom for guys and gals is not cool. Overall, this spot is definitely worth checking out at least once in your lifetime.", "author": "Cristal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "When it comes to atmosphere & theme, Speak Easy takes the cake! The dim lit rooms & decor just add to the experience, makes you feel like you stepped into a time machine straight to the 1920's. The staff is super friendly, definitely comes in the clutch pre-gaming before a Giants' game. When available, the \"Payback Pumpkin Pie Porter\" is one of my all-time favorites! You just can't go wrong taking a trip to Speak Easy.", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Great little place for some really tasty beer! We're drinking a Suspect and a Suds. Yum! Will be back when I'm in San Francisco again.", "author": "Susan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "This is hands down my favorite place in Hunter's Point.  They have an amazing tap collection.  My personal favorites are the big daddy and double daddy IPAs, although the baby daddy IPA is also good.  I'm an IPA guy, myself, if you can't tell already.  They also offer flights, growlers, and cans for sale, as well as a tour you can do.  \n\nThe staff is super friendly, from the bartenders to security.  I've received free beer shots on a couple occasions.  They also have 2 big rooms that you can use and even rent out.  Sometimes they'll have live music and corn hole too.  They're dog/cat friendly depending on temperament of course. \n\nIt's called Speakeasy, so there's also a little red button hidden on one of the walls, just in case of any police raids.  DO NOT PUSH THE BUTTON! I know you want to push it now, but don't.  Bad things happen if you push the button.  I can't even begin to describe the terrible things I've seen when someone pushed it.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "After a failed attempt at playing mini golf at the pier couple of friends and I decided to drop by speakeasy for a drink. It was around 8pm on a Thursday and the bar was fairly empty. They had good selection of beers on tap as well as bottled, ranging from fruity beers, coffee beer and even chocolate milk beer. Great atmosphere, great beer, friendly crowd and they have two corn hole games out front! Such a simple game but I gotta say it was pretty fun.", "author": "Linz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "What a cool, low key place! It is totally tucked away and in a random building. Pretty much like an old fashioned speakeasy! \nMy boyfriend is in love with speakeasy and drinks the big daddy at least once a week. I was looking forward to the chance of trying some other beers they make. \nI got a sampler which is a pretty good deal at only six bucks! The beers I had were all good, however none really knocked me off my socks. Although, I absolutely hated the coconut smoked porter. I couldn't even drink it! It tasted like liquid ribs. Gross...\nThe beer-tenders were pretty nice and funny. Service was a tad slow, but it was busy in there. \nThe winning star was the bar cat named kitty. He was an awesome little black kitty with a voice. Such a cool thing to have in a bar.", "author": "Issy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Really nice set up. Great for coming and having good conversations with friends and just chill.\n\nThey have jenga, cards, chess, and dominoes you can play.\n\nGreat beer selections and they have a sampler tray you can request your favorite kind of beer and they bring you a variety.\n\nReally friendly staff. I asked for pins, they didn't have any but they have me awesome stickers! \nLooking forward to coming here more often.", "author": "Kat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "It may be located in the middle of nowhere-SF, but it's dark and mysterious inside with many a nook and many a cranny. They do tasting flights and a tulip glass is $5. That's a pretty good price to while away a morning I mean afternoon. Oh, and I'm a fan of their BBA Scarface. \n\nThere is also a beer cat who lives here.", "author": "Jonathan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Best bartender best security guard ever. This was my first time visiting San Fran and this place was on my bucket list and they totally nailed it with their beer and customer service. \n\nI walked out with a jug of beer and posters and a great smile on Fourth of July :) look forward to coming here again in the near future.", "author": "Daisy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "Speakeasy is a great place to come by if you're in SF. Be warned though, you'll be a ways out. \n\nBig Daddy and Double Daddy IPA are two of my favs! I've grabbed a couple growlers here before as well. Reasonably priced. They have some great seasonal beers that come out - just check the website!\n\nYou can also buy 24 packs here - my brother and I have done a price comparison and its relatively (understandably) cheaper than picking em up at the grocery store. \n\nAmbiance: I really enjoy the front end of the space, it's dark, has little private areas to sit with a group of friends, definitely gives you that speakeasy feel. The back has a lot of open space and an additional bar as well - just be forewarned, it's not very warm back there so if you come in the evening or the winter time and get chilly easily like I do, make sure you got some layers (you're in SF after all). \n\nParking: they have a lot that is small, but I've never not found parking. \n\nNot much in the way of food to go by around here so be prepared. Also you're not going to be walking around to other places, Speakeasy is somewhat isolated in that regard.", "author": "Tania K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Awesome beer factory tour. Speakeasy makes the very popular (in 30+ states) Big Daddy IPA and other varieties.\n\nThe tour is $7 and can be booked online ahead of time. I recommend it to learn how beer is made. It only lasts 20 mins ish and you only get 1 free small shot of beer (wish they gave more), but the beer they serve before and after (in a great environment and setting) is really good and really cheap. $3 prohibition IPA's all Saturday. $6 for 4 you pick it tastings, great deals. \n\nPlus, they have food (specialty sausages) come in on site too, and cornhole outside.\n\nLearned a decent amount about how beer is made in the vats, kegging, bottling, etc. Plus, good drinks and an awesome staff.", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Good beer and good ambiance. I have been seeing this beer in San Diego and never tried it. I'm glad I had the opportunity to visit the brewery. The bartender was super nice and helped me coordinate my flight. They had a biker event there and there were two bands giving much funk. I thoroughly enjoyed my visit and the beer!", "author": "Rin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Who would have thought that a great little tap room would be situated in this neighborhood of industrial parks? They have lots of parking, but seeing as there is not much to do around this area, I would recommend just going with a tour or something, that way you can just get in and out. We didn't realize the location was not great so we got stuck here for longer than we wanted to be while we sobered up to drive. \n\nWe came here mid-day during the week and the place still had a good number of people in it. Overall, I was pretty satisfied with all of the varieties that I tried. I tend to go for the light belgians and theirs did not disappoint (forgot the name of it though). \n\nThe prices were pretty good for SF, service was friendly, and the place was nicely decorated. I would probably go again!", "author": "Samantha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "So I've been wanting to try Speakeasy brewery for several years now! I've been drinking their beers for almost 9 years now, started with the prohibition ale and double daddy IPA. \n\nWe we found ourselves in the Mission so this place wasn't too far from the area so we too, a quick Lyft over to the brewery. Once we were dropped off we found ourselves in a small, dark, very crowded tap room. That was the worst thing about our experience was how small it is and it can get busy very quickly. Lucky for us everyone was nice enough and I made my way to the bar and orders a few beers. Fell in love with their pumpkin porter and their black IPA. Which they would bottle or can these, they were that good!!\n\nMet some really cool people at the bar while we're there. The good thing about a small bar is it kinda forces you to talk to people. That was a good thing. They had a tv in the bar and it was tuned to the Warriors game which was real fu when everyone was cheering them on. \n\nOverall Speakeasy's tap room was small and dark, but the beer they were serving has to be best in town.  I would love to come here more often on my SF trips and try more of their speciality beers!", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "One of the best breweries I've been too. Love that the beer here is very affordable and bartenders are friendly.  It's just kinda out of the way, but that's part of its charm. \nThere use to be brew kitty but she has passed away. :( super fun having a cat around tho! \nMy fav drink is the baby daddy and syndicate no. 3. Check them out! I usually do the flights for $7 (5 five or 4 drinks? In a flight).", "author": "Kat C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-17", "description": "I stopped by on Saturday afternoon for tour. Speakeasy is a brand new brewery with stainless steel and titanium tanks. Clean and sparkling, Italian made brewing system. The taproom is a little small but has a good vibe for Speakeasy. I was disappointed that they only gave one sample. I expected a few since most breweries try to showcase their different styles and usually include a sampler flight for paid tours.", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "I love the feeling of walking into a brewery for the first time. I came here with my friend on a Sunday late afternoon, and it was practically empty. I parked in the lot out front, which is probably the best way to get here, since I'm sure public transportation would take much longer.\n\nI was not overly impressed by the decor or the bartenders at Speakeasy, but I'm glad that the awesomeness of the beers made up for it. You can sit at the bar or on couches and benches around the place. The baristas were engaged in conversation with apparently more interesting customers and made it seem like serving us was an interruption to their laughing fun. That was annoying. Even the \"bouncer\" was the friendliest guy in the whole place. But really, I'm here for the beer.\n\nDouble Daddy IPA is my favorite. Well actually any of their IPAs are good. I love the whole theme of the Speakeasy series. If you love it enough, you can even get bombers or growlers to go! I hear they are planning to expand this place, so their tap room is currently unavailable, but I can't wait to go back and check that out.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-19", "description": "I was really sad that my brief experience here was less than stellar. My husband and I were in downtown sf for vacation and I really wanted to stop here and try some tasty beers. The tap room is in a industrial area with nothing else around; our taxi driver continuously warned us that the area wasnt safe. When we walked in, the place was totally empty except for a few customers bellied up to the bar. I understand that the giants game was on, but there was honestly no music or friendliness or any type of \"ambiance\". We felt really out of place and didn't feel quite welcome. We had one round of ipas and left.\n\nThis place gets two stars because the beer was really good, too bad the place felt unwelcoming.", "author": "christin f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Ruben loves his beer and luckily, so does his Bay Area-local cousin. We visited on a Saturday afternoon and there was a good amount of people in the Tap Room. Fortunately, there was a high table and large comfy chairs available near the entrance. Otherwise, we would have been standing. The beers on tap available was written on the chalkboard door behind the bar. None of their \"Usual Suspects\" (the beers they brew year-round) were on tap, but available via bottle. \n\nThey offered two beers from their \"Limited Series\" (small batch releases) and all three beers from their \"Infamous Series\" (brewed in single batches and they boast are their \"boldest and most elusive releases\"). Ruben got a sampler of The Informant (Elderflower Saison), Double Daddy (Imperial IPA), Scarface (Imperial Stout), Untouchable (Nelson IPA), and The Suspect (Belgian Golden Ale). They also ordered pints of The Blind Tiger (Imperial IPA) and Harvey Milk (Milk Stout). Ruben's favorites were the two Imperial IPAs: Double Daddy and The Blind Tiger.\n\nThe Tap Room is a really cool hang out! Along with the bar area, and high tables, there are two separate rooms with comfortable seating as well. There's also touring available via reservation (information and schedules on the website). And if you visit on Fridays (4-9pm), you can hang out in the Brewhouse Bar which is all ages (Tap Room is 21+).", "author": "Amelinda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Great beer overall! \n\nOverall we all ordered:\ndouble daddy imperial IPA\nProhibition Amber Ale\nBig Daddy\n\nThe above beer hit the spot! We will be coming here again!", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Speakeasy - home of the Big Daddy. \n\nCame by here during the Yelp 10-Year Celebration weekend as part of the SF Craft Brewery Tour. We were treated to a tasting of about 4 different beers and given a quick tour of the brewery. \n\nAs a brewery, you have a lot of things to chose from. I'm not going to get into the exact beers as they've been discussed a lot in other reviews (and let's face I'm not an expert anyway), but needless to say Speakeasy is more than just being the place that makes \"Big Daddy IPA\". While there I tried the Bourbon Barrel, Untouchable, Prohibition Ale, and Tallulah, and I'd say my favorite was probably the Prohibition, though the Bourbon Barrel packed quite a bunch (10.5 abv!). \n\nAs a bar, Speakeasy is a pretty intimate setting, as it's a little on the small side but really makes up for it by having a bunch of friendly bartenders who really know their beer. Their decision to open up a taproom in front was definitely a great idea, as I'll fondly think back to my experience there anytime I'm drinking one of their beers. \n \nBayview-Hunters Point is definitely out of the way - but as bartenders here recommend - just take an Uber. If you split a ride I'm sure it's not too bad, and the upside of having a different kind of HH/drinking experience seems worth it anyway. Plus it's always nice to support a local brewery. Definitely would recommend.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "This place is cool! I wish it wasn't so far away though. There's a back bar that has less people if you want to bypass the line.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Love the new remodel for the tasting room.  It's a little on the small side, so can get crowded at times.  But, the vintage/rustic decor looks great and fits well with the industrial environment. Like many brewery tap rooms, there are always special beers on offer that you can't get anyplace else.  Of course, it's still in Hunter's Point and a bit out of the way.  There's nothing else in the area, so Speakeasy is really a destination that, unless you have a designated driver, requires a Uber to get to.  But the beer and crowd are great, so it's worth the effort to get there.", "author": "Bryce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "Hit up this spot on a trip to San Francisco. \nFriendly, knowledgeable bartenders and friendly patrons. The guy next to me offered us a sip from his Bourbon barrel aged beer...I forgot what it was called, but it was delicious.\nThe brew is amazing quality. We ordered 5 beers. \n2 Big Daddys and an Old Grandfather, Pop Gun, and a Double Daddy ran us only $22!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Love this place ! wanted to check it out for a while. At least 15 different bees on tap that you can try 4 for $6. HH until 5pm. CC accepted. \n\nGreat staff, ambianace and energy, fun crowd.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "I came for a Brewery Tour during SFMade week. When I saw there was a tour there, I was excited as I thought they never have tours. When I got there I asked when they started doing tours and they said they started when they opened their Tap Room about a year ago. \n\nThere's a parking lot and ample street parking in a very industrial area. The entrance leads you into their Tap Room which I loved the love decor of. It has cool wallpaper, decorations, and Speakeasy elements like a sliding peep hole in the front door and a red emergency buzzer in case of a raid. It all throws back to their origins of how they started up w/o any proper permits and starting selling their beer to local bars under the table. \n\nThe brewery tour was super informal. The bartender mentioned that someone called in sick, so when we asked where we should go for the tour, it was news to him that there was even a tour. He ended up leading it and it started quite a bit late, which he said was usual since most people don't arrive on time. \n\nThey have Happy Hour on weekdays from 4-6 pm with $3 pints for their flagship beers. They also have some of their seasonal and specialty brews on the menu. \n\nYou can bring your beer on the tour and you'll see the staff all have a beer in their hand while working. This has a real authentic feel vs. other more corporate breweries. You can tell the people here love their job and the casual relaxed atmosphere. \n\nThe only bummer was that unlike most other brewery tours, there's no free beer tastes included. The tour is free though. \n\nOn Friday, they also throw a weekly food truck party from 4 -9 pm with often times live music. They occasionally throw Saturday parties as well. There's even a disco ball in the brewery.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "My friends and I were there when they opened on Sunday.\n\nWe got to try all beers, and I felt like I couldn't decided which one was favorite because everything was equally great (okay.. I lied. I am a IPA lover and loved their Big Daddy and Double Daddy... and unfiltered one tasted best in my opinion.)\n\nDecoration inside was really cool. There were two separate sitting areas plus bar. Maybe it was too early, because instead of any music, they were playing inception on TV. I kinda wish they didn't tho... the movie was way too loud.\n\nThe guy bartender was nice, but the tall, dark hair one was really really nice (she totally looks like Deborah from Dexter... maybe she really was? haha just kidding). We were buying some of their merchandise, and she was helpful and patient with us trying out some shirts and asking a bunch of questions. She wrapped everything nicely for our plane ride, and even hooked us up with some free posters and stickers. Thanks again!\n\nI wished I could stay there all afternoon... had to buy bombers to bring back home some goodness. Hopefully I can go back one day.", "author": "Ann H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "This place is awesome! Although it may be a little out of the way, it's definitely worth the extra drive. We stopped in on a rainy Sunday and it wasn't super busy. We got our beers right away and were able to snag a whole section of the place to ourselves away from those watching whatever football game happened to be on (sorry - I'm a hockey fan). The decor is dark, cozy, and in-line with their whole theme.\n\nThe employees (I wish I remembered their names!) were so friendly and more than willing to talk about beer - even ones from other breweries! I ended up buying one of their shirts that the female bartender happened to be wearing. \n\nI'm a big fan of Amber Ales so I tried the Prohibition, but I found that I liked Scarlett just a tad better. I was also able to try some of the Black Hand Chocolate Milke Stout...yum! \n\nI wish I lived closer so I could come here more often!", "author": "Katie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "I hadn't been back to Speakeasy since they opened up the taproom and now it's better than ever!  In the dimly lit taproom, you get your beer in a glass and grab a seat either at the bar or in one of the 2 adjacent rooms (great for groups), while listening to a good selection of classic rock.  Alternatively, on the other side you can still get a beer in a plastic cup and mingle amidst the barrels or out on the patio (though there's no more free popcorn).\n\nOf course the beer was good, as usual.  $5 during non-happy hour.  I've always been a fan of the Payback porter and decided to try the Scarface imperial stout and the Double Daddy IPA.  The Scarface was fine - didn't pack as much coffee flavor as I had hoped, but the Double Daddy was excellent!  Hoppy, floral, aromatic, and crisp.  My only regret was ordering it too late so I couldn't savor it for longer before they kicked us out at 9pm.\n\nAnd lastly, I wanted to mention that I biked here and was able to lock up to the handrail right at the entrance, so I wasn't too worried about theft.  Not that Evans St appears shady anyways...", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Had a fabulous time.  Great company and the Syndicate 3 was amazing.  Very friendly brewery and dog friendly.  Have to go back soon.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "Five stars for ambiance.  They have really done a lot with this space, making it look like a true Speakeasy (or at least what I imagine one looked like).  There are a few semi-private tables where you can enjoy a beer with your lovah, or a group of friends.  There is also a nice bar area where you can chat with the friendly and knowledgeable bartenders.  A lot of the pictures here on Yelp are from before the remodel.  It no longer has the \"industrial\" look that appears in the photos.  \n\nDespite what people say, I don't think it is hard to get to at all.  There is a bus stop across the street, and the muni station is only .5 miles down the road.  I didn't feel unsafe walking around in the area at all.  Plus, there is plenty of parking (if you actually own a car in SF).\n\nThe beers are all good, but I didn't think any were a stand-out great beer.  They are all something I would drink if available, but not something I would seek-out. \n\nMake sure to check the website for the hours before you go, they are only open limited hours- mostly in the afternoon/early evening.  Closed Mondays.", "author": "Jocelyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "Though my 1st time ever out to Speakeasy was for the Yelp Field Trip Launch Party, I learned quite a bit about this place that night. A lot of what I picked up was because I arrived early & stayed well after the Yelp party was over.\n\nGetting in early, I went to their taproom. Decked out in deep rich wood accents, this is the type of taproom that Ron Burgundy would admire. With a few featured beers being on $3 Happy Hour special, it was a place my wallet took a liking to as well.\n\nAfter the Yelp event in their brewhouse, which makes a fine event space, I ended up talking to some longtime regulars of Speakeasy. It seems the handsome taproom is relatively new & part of recent expansion. Growth can be good.\n\nThe regulars also reminisced of a simpler Speakeasy where taps were only in the brewhouse & how there was a token system for getting beers to drink. The beers were cheaper back then too. Growth can have some growing pains.\n\nFrom the stories of back then to what I experienced of the now, I think Speakeasy is heading in a good direction. Ideally, they add some kind of permanent on-site food option (it's OK to bring your own food) while keeping the $3 Happy Hour beers.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Nice place to hang out with friends for drinks. This place is strictly a bar and they don't serve any food. They have a variety of beers on tap, so I would suggest ordering a flight to try a little bit of everything. The Double Down knocked me on my ass!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "Ahh yes, Speakeasy as in das speakeasy deustch.\n\nWhich of course is German for do you like beer? \n\nI'm kidding but they are not, their beer is no joking matter. They got the good brews out here in Da Bayview in a locale that is intimate yet industrial and all jazzed up for a trip to the Roaring 20's.\n\nThey got different kinds of beer for all lovers of micro-brew. Porters and stouts for the dark beer lovers like myself. Belgium browns for those that want it rich and malty. Extra Extra Extra Pale for those that like to be round-housed to the face with hops. \n\nThanks Speakeasy.", "author": "R J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "I am definitely a fan.  I loved the prices of the beers and they were good.  My only complaint was some of the staff were a little standoff-ish. I just moved to the neighborhood and had been super excited to check it out and didn't feel the neighborhood welcome.  \n\nI will come again with my fiance and let her decide.  Can't beat though the $6 - 4 taster flight.", "author": "Raja D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "So what's up.\n\nThough I don't drink beer - I am all about Speakeasy Brewery.\n\nIt's soooo San Francisco  - from the Speakeasy Speakeasy designed by Kelly Malone, to the hands on tours provided by their incredible and personable staff - Speakeasy knows what they're doing and they excel at it.\n\nSpeakeasy has truly cultivated an outstanding community in the area with their frequent events and accessibility to the public. Not only do they produce award winning beer that is made with unbelievable amounts of love - but they are all about listening to their customers and are truly excited to hear what their customers have to say.\n\nSupport your local brewery. Support Speakeasy.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Speakeasy is the rare brewery that executes a variety of styles very well.  I've started to become jaded with double IPAs (they have a tendency to be too hot and unbalanced), but the Double Daddy Imperial IPA blew me away with its delectable combo of tropical fruit and pine resin.  The Bourbon Barrel Scarface Imperial Stout also excels:  it seamlessly meshes the chocolate, coffee, and booziness.  Other highlights:  the Belgian dark ale, Payback porter, and imperial stout.\n\nI love the vibe of the brewery as well:  a very friendly staff and chic lounge area.  I only wish that Speakeasy had a second location in Santa Barbara (where I'm from)!", "author": "Jason Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "Props to Mike D. for showing me the way to tha Speakeasy. I heard about the Happy Hour at Speakeasy but it was Mike Deezy that actual brought a fan here. \n\nWe came here for a little pre-gaming before hitting AT&T. Hell it's on the way, right. Dressed in my Giants gear, I naturally ordered the Fear the Beard Ale (or whatever it's called). Kinda Orangy, like I like it. \n\nOutside they have food vendors. Taquitos, Burritos, tacos and on the otherside, Good Foods Catering with the super good BBQ. I believe the two best match ups for beer tasting.\n\nGreat crowd and that day they had a live band, too bad we missed the show - but we had priorities MAN - GO GIANTS!!!!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Great hidden treasure in SF. My boyfriend is a big fan of their beers so we decided to check this place out since it's relatively close by my neighborhood. Speakeasy is borderline ghetto Third street, but it's a great place to go if you're looking for great beer in a spacious bar with sexy 1920s prohibition vibe. They have the bar with two mini rooms if you have a large group to go with. They also allow you to wander to the back where all the magic happens. This place has become my favorite place to go because it's honestly really difficult to get great beer in SF for cheap. \n\nPros:\nPlenty of parking\nLarge selection of their beers available on tap\nSexy am-Beyoncé \n$3 Happy hour (1-6pm\n\nCons:\nNot open for late night", "author": "Mable N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "If you're a fan of Speakeasy's Big Daddy IPA or Prohibition Ale, you need to head towards Bayview despite the trek and make it to the Speakeasy brewery. \n\nA true SF brewery, you'll easily find the afore mentioned brews in most bars in the city but it truly makes a difference to come straight to the source and be taken on a tour of the facility and given some inside scoop into the brewing process. The tour is super casual and our guide was very knowledgeable and hospitable. Folks here in general are really nice and more than willing to answer your questions. Pair that with pints of their harder to find/seasonal brews like the Vendetta IPA, I was one very happy camper. \n\nThey have a new bar as featured on Thrillist as one of \"The Eight Greatest Craft Beer Openings Since Last Summer\" and I can't wait to be back for more.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "I was able to get a tour around here and wow, the craft of making a beer is great. Will be coming back since the beer was fantastic and the staff were so kind!\n\n*update. Try that Philz beer collab. I went to heaven as soon as I took a sip of that!", "author": "Sweets N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "This place is awesome! You can just stop reading the review now (or go on for more details).\n\nThe location is a little odd, but it is a brewery and you've got to be located in a place where you can operate your business. That said, it does have parking and the tap room is pretty cool. A little dark, a little mysterious, and plenty of taps serving up the Speakeasy offerings.\n\nThe beers are great. They have a nice selection of several different beer varieties, but in my view the strengths are the IPAs (the big West Coast thing these days) and the dark beers. My personal favorite was the chocolate milk stout, but all were excellent.\n\nBest of all, we were there in the middle of the day, and happy hour is $1 off all beers from 1-5pm Tue-Fri, which makes it an exceptional deal.\n\nMaybe next time I go I'll take home some 22 oz bottles or a growler, because the beers are seriously good and most of the groceries around only have a small selection.\n\nDefinitely check it out.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "John the rep is down in so cal at burger house sharing his knowledge of his awesome craft beer. The flight sample was so awesome and he knows his stuff.  Double daddy rocks. A great craft beer now on my list.", "author": "Kathy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "Beers and vibe totally rock. This place is one of those Jewels that the typical tours I will never find, and I've gotta say that's ok by me.\nTheir beers are uniformly excellent, and span a broad variety. They don't serve food, but at least during midday the Rodrigues Brothers taco truck was just down the street and the burrito was wonderful.\nBehind the bar, Mollie was queen. She was engaging, helpful, friendly, and handled a busy bar with aplomb and still found time to answer beer geek questions.\nI was able to try only 8 of their beers this time, but I will be back and I will look up their beers in my local stores!", "author": "Arizona J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "This brewery has been on my to go places for ages! I traveled all the way from Orange County just so I could experience this place. I've been a fan of this brewery and enjoyed all of their beers. SPEAKEASY brewery, you were the highlight of my San Fran trip. I wish you had food though!", "author": "Monse A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "They make some of the only beers I can drink.. Turns out I like dark coffee-like beers -- the payback porter and the scarface are good for that. They do tours and and have a sweet bar on the other side, speakeasy-style.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Amazing beers. Had their seasonal pumpkin pie porter and it was one of the best pumpkin beers I have ever had. My husband hates pumpkin beers, but he liked this one so much that he kept steeling my pour and drinking from it. I call my husband a beer snob because he usually finds something wrong with a beer, but not here. After a glass each and sharing two flights to sample all that was on tap, he was speechless. While it is a little \"off the beaten path\" it's completely worth it. We are heading back tomorrow to pick up some beers to go.", "author": "Rene R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "My wife and I just had a blast here, this was our favorite brewery on our San Francisco trip.\n\nWhat made it so good?\n\nPros:\nThe staff was excellent, we interacted mostly with Kevin and John. They were both very engaging, patient with our questions/orders, and made sure our experience was superb.\nThe beer was top notch. We ended up walking out with one of their unique growlers as they had a saison that was unreal, I gave it a 5/5 on untappd. it was the first saison I really enjoyed to that level.\nIt was less busy than the other breweries and tap houses we went to. So we had no problem finding comfortable seats.\n\nCons:\nMaybe we drank too much and then bought too much goodies. :) Not necessarily a con.\nMaybe some out of towners will think it is further away than other breweries - (this might be true - but just take a uber - it will be worth it)", "author": "Nate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Having a pretty awesome time. Love the variety of beers and what have you. Wish there was food. Happy is at 1pm to 5pm", "author": "Selina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Speakeasy Ales is a great place to be with friends. The ales and craft beers are outstanding. They have tables inside and outside also. The prices are a bit high.", "author": "Jeffery K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "I came to visit a friend in SF a few weeks ago and she suggested we come check this place out, as I was looking for local breweries to visit while there. I was far from disappoint from the 1920's style ambiance, to their great beer! Ricky was the one to serve us and was more then helpful and informative in helping me pick the right one for me! I too work at a brewery, so it's really nice to receive that impeccable service you'd expect from any other in the industry. I absolutely will be back again on my next visit!", "author": "Breanna V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "It's a brewpub in a not-very-trendy, downright industrial part of town that serves beer, some snacks, and growlers to go.  The bartenders are nice people, willing to answer questions about the beers they have in their medicine cabinet as well as what they have on tap.  Decor is in line with the company's name.  Some of the beer in the medicine cabinet can be pricy, but you can get out of there for under 10 if all you are interested in is a pint.  And don't forget to say hi to Brew Kitty when she decides to come out of the office to say hello--she loves the 4505 Meats chicharrones.  This is good place for a group to meet and hang out.  They offer brewery tours on the weekends, and it's pretty nifty to see how they brew the beer and move the ingredients around.", "author": "Herb L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "BIG. FAN.\n\nThis place...this place!!  Where do I begin.  So as an east bay resident, I've wanted to check out Speakeasy for sometime now...but for one reason or another (ahem, bart fire, cough) I have been halted in the process to make it there.  I was poking around on the speakeasy website (which, btw, is goodbeer.com .  AWESOME!), and saw that they were hosting their upcoming 16th annual blockparty.  Sat Sep7, 1-6pm, $35 unlimited pours...well that there is a no-brainer, but add in live music and food trucks? Sold.\n\nWe found out you could buy tickets at the door (good to know next year) and that they were in no way going to sell out of GA tickets (VIP admission however had sold out.)  So anyway, we parked in the shade nearby a little after 1pm and saw that there was a line to get in.  Hubby was none too pleased, he hates a line.  so we got in line and it didn't take too long to get in, so no big deal.  One dude checking IDs and distributing bracelets, it was all pretty smooth.  Also, if you do bring kids, they will charge a Designated Driver type price/fee, which is kinda bogus but I guess keeps the adults partying and kiddies at home :)\n\nSo we get our tickets scanned, a second wrist band (weird), and our 6oz tasting glass.  They were super cute glasses with the 16th annual block party logo plastered on it.  We would be on the hunt for leftovers later!  Got in and went straight for a beer tent...they had 3 total, some with different offerings than its counterparts.  New beers I hadn't tried in the past were... Buthertown Blake Ale (Black IPA):, Witness (witbier), a new SFBG Common (lager), Double Daddy Imperial IPA, Big Daddy Wet Hopped (IPA), and a Tellulah Extra Pale Ale.  The old standby's that were yummy were their Payback Porter, Prohibition Amber, and Big Daddy IPA.  No stout, and their Vendetta Red is coming out mid-Oct, yay! \n\nWhat a glorious day, 5 hours of drinking enjoyment (last call was shouted around 5:40pm).  The only complaint would maybe be the length of the beer lines...thankfully they moved super quick, yay.  The tap room was awesome as they had it setup for live music that penetrated (yeaaah) the entire brewery/parking lot.  Lines for the porta potty as well, but also moved quick.  It was a warm September afternoon in SF, but at hunter's point it was breezy and pockets of shade to help get you through the hot afternoon.  But by 5:30pm it rapidly cooled off and it was so wonderful.  They also had some really cool schwag/merch to purchase so that was cool.  Water for everyone to keep hydrate is always appreciated.  4 food truck/tents to choose from, but nothing really stood out.\n\nSpeakeasy, you'll see me next year...but hopefully much sooner and more often now!", "author": "Sara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "The place is not huge, but it's quite nice - very atmospheric, with wooden things around and nice decor. Good selection of beers, very nice staff, a perfect place to spend a couple of hours on a lazy afternoon.", "author": "Pawel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Whoa! A review could not wait! To put it simple and clean, this place is awesome! The staff is really friendly and accommodating, and the bartenders are on point!\n\nAnd the beer is... Just whoa! Need I say more? Okay, so far we've had the the witness, the talulah, and the scarface ( 2\nPints and 2 four oz samples). The verdict: amazing! I've never tried so many beers and be so satisfied at the same time :).\n\nOverall: Speakeasy? Yes, it is, especially when there are a selection of good beers to try at 3-5 dollar per pint! This one is a no brainer, definitely coming back here when I'm in San Francisco.", "author": "Jan Jeric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Great place to drink and chill with friends or meet people just hanging out at the bar. \nVery cool room and we took a brewery tour with Veronica who was super sweet and informative. \nA definite hot spot to chill anytime and enjoy excellent local brews!", "author": "Mark N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "After having called the Taproom throughout the day on a Sunday and not getting anyone to pick up I imagined they must just be busy so I took off from work early in order to make it before the 9:30 PM Last Call, as it is advertised on the Speakeasy website. To my chagrin, when I got there and asked for a beer the first thing the lady behind the counter said was \"how did you get in?\"! \nApparently they had only had a few customers that day and decided to close early in spite of the website hours... why they didn't pick up the phone if they weren't busy beats me... what really gets me though is that at 9:30 PM there were still 3 employees there just killing time, while I as a customer couldn't even get one beer! \nOn my way home I then managed to pick up a bottle of Speakeasy's Imperial Stout from Whole Foods and found it to just be ok... was looking forward to trying the barrel-aged version but I don't think I will bother going back to the brewery.", "author": "Larry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Who wouldn't want to ride on a revamped old school bus with other beer lovers and visits a bunch of SF beer rooms?! People I don't want to associate with! Kidding, I love everyone! This was the first stop on the Yelp Field Trip Beer tour I went on with Justin C. and other really fun folks!\n\nI have been to Speakeasy before for another Yelp event a year or so ago and this tour was a little different. We were put into the small walled off area inside the brew house, it was very cramped, and given small pours of some of their beers. I feel that this closeness brought our beer tour group a little closer, literally. We were also given an impromptu expansion into the actual brew house and tasted some more beers. We later went into the bar area and had more beer. This place has great brews and the staff are really welcoming.\n\nWe left to hit up the next place but not before we bought a great beer with a waxed top, I don't know what it was but it looked pretty!\n\nThey have a pretty good sized parking lot and there is still great street parking!\n\nYou have to stop by yourself and experience Speakeasy!", "author": "Constance D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "I was lucky enough to have a weekday off in the city on a day when Lyft was 50% off, so I took advantage of the situation and visited an out-of-the-way place. Speakeasy Brewery is in an industrial park in SF between The Dogpatch and Hunter's Point and they have a tap room set up like a prohibition-era speakeasy (of course!). It's pretty small, but cozy with comfy couches and lots of corners to hang out in. They don't sell any food other than some snacks and there weren't any food trucks nearby, so don't come hungry; however, they were re-upping with their pickle and mustard supplier while I was there and they were cool, so snacks are definitely worth trying. They have 12 taps with all of their regular beers plus a few special brews, so if you're a fan of Speakeasy beers, it's definitely worth a visit.", "author": "Rob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "$4 pints!\n\nAs if I need to say anything more...\n\nGreat vibe, comfortable seating, patrons low on the obnoxious scale. \n\nNot exactly a convenient location, but that will hopefully keep the riff raff away. \n\nParking isn't a problem with the large lot and street parking.", "author": "J. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "This is one of my favorite California breweries. They have a nice selection of ipas and a quality barrel program. Last time I came here I had the big daddy ipa on cask and came back with a bourbon barrel aged stout The Syndicate.\n\nNice atmosphere and friendly staff, its worth a stop for a few pints.", "author": "Taylor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "I love this place.  Speakeasy has a great selection and their barrel aged beers are to die for.  Keep it up guys and looking forward to the next time you \"open up the cellar.\"", "author": "Shane F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "Went here over the weekend for their little fundraiser event \"prohibition party\".  It was very makeshift but we had tons of fun anyways.   \n\nWe did manage to wander into the bar.  Love the speakeasy look and feel of the decor but without the frills  and pretentiousness of reservations, passwords, and secret entrances  of the bars in the city.  Just a great place to hang out and try some of their beers on tap.", "author": "Bianca P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Went on a brewery tour and spent time at the bar area with a small group of friends. The brewery tour was fun and very informative. The guide gave a lot of insight on the process and was helpful to all of the questions asked. As a fan of dark beers, every dark beer they had was high quality. Definitely would come back.", "author": "Raymond D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Great brewery in SF! I had been buying their beers in stores for a while, and finally made it out to the source. It's a small place with friendly bartenders and solid beer. No food or liquor. One time I came and the bartenders gave us a tour of the brewery because it was a slow night. Really enjoy Speakeasy and look forward to going back.", "author": "Ryan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Staff was friendly, and drinks were great. The beer was by far my favorite of all of the breweries/pubs that I have gone to while in San Francisco. Here are a list of my favorites in order for reference: Speakeasy Ales & Lagers, 21st Amendment, ThirstyBear, and Public House. (I also went to Southern Pacific while here. It was not my cup of tea. The beer there was mediocre at best, and the atmosphere was awful. Most of the staff was not friendly or attentive to concerns. I wouldn't recommend anyone to go there. Hence, that is why I didn't even put it in my list.)  \n\nBut back to Speakeasy, go there during the week from 1-5 p.m. They have great happy hour prices-$3 pints and $4 for belgium pour. Sidenote, BigDaddy IPA is by far my favorite. One detraction from the place is that it is in an industrial like district. You will not just be walking by for most people. You will need to make plans to go, but doing so would be an intelligent choice.\n\nP.S. Tell the bartender Kevin hello.", "author": "Trey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "Came for the SF beer week event.\n\nExcellent beer, nice new tap room.\n\nI was a little disappointed having shown up at 8:30pm, paid $30 at the door, and they turned the beer off at 9:15pm. I misunderstood it to be until 10pm, wish I bought beer tickets instead =(", "author": "Doug R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Really neat tap room. All their beers are well balanced. I really enjoy their Pilsner and Lager. The bartenders were super friendly and let me try anything before buying it. Definitely worth checking out. Decent amount of parking in the area as well.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Whoa!\nI just got on line to say how much I have enjoyed the PROHIBITION ALE. My first choice in dark beer. Not bitter, real smooth. I really did not know there was actually a place in SF to go and drink one right at their brewery. So thumbs up for this beer and I will visit the Brewery very soon and rate it. Love out of the way places.\nChris", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-12", "description": "We came here for their Barrel Aged Scarface release for SF Beer Week. The bar was already packed when we got there so we grabbed seats in the smaller rooms. The newly renovated tap room was dimly-lit and its speakeasy decor gave it a wonderful, intimate atmosphere. The bartenders were friendly and the service was excellent.\n\nI got a flight of the following beers:\nDouble Daddy- One tasty double IPA\nThe Black Hand- This milk stout was a little thicker and I could definitely make out a slight creaminess.\nPayback Smoked- Drinking this smoked porter reminded me of eating smoked bacon. You can't dislike that.\nScarface(current)- This imperial stout had great aroma and flavor but not my beer of choice. The other beers in the flight were simple more interesting.\nScarface 2011- Could not taste the difference between the two years\nBarrel Aged Scarface- Aged for 18 months in bourbon barrels. I enjoyed this one the most because the sweet taste of bourbon lingered on my tongue between sips.\nUnfortunately, they were out of the Green Death malt liquor.\n\nI followed the flight with a pint of double daddy. Its hard to resist the hoppiness and spice!\n\nThe prices are very reasonable. For example, the flight of 6 beers was $9. I just wish they offered some sort of food, because that would have allowed me to stay and drink more.", "author": "Alfred L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Love this local brewery because it just down the street from my house. All the bartenders, brewer, and security are awesome and friendly to talk to. I come here on weekly basis because it's that awesome!", "author": "Tam J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "Came to have a tour and have some good catered bbq. Called the day before to reschedule and confirmed moving it back by two hours. Showed up and tour guide was extremely rude and said we were not on the list. Did not make any attempt to apologize or reschedule us to another time. Said another group was late and they moved them back but the guy we talked to on the phone didn't tell her he moved us. Bbq was good but service was terrible.", "author": "Damon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "honestly a neighborhood highlight - it's inexpensive, parking isn't a problem, nice staff, and a divey but tasteful, clean atmosphere. I'm pretty obsessed with their chocolate milk stout, wasn't a fan of their pop gun (pilsner?)... either way, 3 beers racked me up $14 so there is absolutely nothing I'd complain about. Well, maybe the red lobster commercials that kept showing up on their TV - cheddar bay biscuits, anyone?", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Great, old-timey dark lit ambiance. Plenty of seating. Terrific beers. Cornhole outside. Dogs allowed outside on the patio. My favorite is the Blackhand, a chocolate milk stout. I'll be here again.", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Yeah, I know it's a brewery, but I wish they had anything alcoholic that's not beer. The person who was with me isn't a beer drinker. Well, but that didn't really matter, because service was so good. And I'm not a person who likes outgoing waiters and bartenders. I prefer to keep it discrete. This was a whole other thing, though. Molly was probably the naturally nicest bartender I've ever met. She helped us through the beer problem, too. Beers are good, of course. I like the looks of the place too. On the small side and cozy. Lots of wood going on. Or some imitation, I can't tell.", "author": "Lucas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "I love this place. The beers/variety they have is so much more than at the store and everything is tasty! Really cool layout, live music on the weekends and even a poke guy! You buy a tub of poke and they pair it with beer and it is delicious! wish I was closer to this place!", "author": "Zara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Gayle and I paid a visit to the Speakeasy as part of our Yelp Field Trip. I like their beers, especially the Big Daddy IPA and the Scarface Imperial Stout.\n\nGayle later posted an outside picture of me on Facebook with the following comment: \"Naturally, we are the oldest people here. Waaaay oldest!\" Not entirely, although maybe my relative impatience with beer lines might be age related. Plus Yelp crowds are always fun, and I enjoy the conversations, whether I've met folks previously or not. It's also enjoyable to have Gayle with me, as my writings often put her in an \"famous\" light for those who read my reviews. \n\nThe Speakeasy facilities are a little funky out in this light industrial part of town. And all during my visit, I kept putting on my professional hat and wondering how these guys do when the Fire Marshall or Cal-OSHA show up. It's definitely a labour of love here, the quality of the product speaks for itself, and after Gayle made me zip my compliance comments, I decided that their safety commitment was just fine.\n\nThe first 8 ounces (or so) was free, and maybe in hindsight we should have gone to the pay line and cut the suspense short. The color ticket system for the Brewery Tour was also a little confusing, although we enjoyed the table where the various hops and grains were on tactile display and tasting. Also available were related goods for sale, and a food stand with some decent looking BBQ. Speakeasy was also smart to provide some Security as a couple hundred young adults and beer don't always mix together smoothly. We found everyone working the event to be friendly and helpful.\n\nAll in All, it was a pleasant event and well worth the drive over from the East Bay. Many thanks to Jessica and Ruggy for making this event possible and to Speakeasy for opening their doors and their kegs for many of us to sample and enjoy.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "God I love this place. Returned a few weeks ago for the 2nd time (it's far out from SF), on a Sunday night. It wasn't too busy, and the bartender (German woman) spoke to us for the whole hour. It was really laid back and we enjoyed sampling all the beers during the chat. Would come back here any day", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Went here last Saturday for a nice afternoon. Loved the vibe of the bar- dark, a couple rooms with tables for larger groups, fun decor. There was a solid group there that day, but not so crazy that you couldn't sit or easily get a beer. The 4 of us each got a beer and we headed outside to enjoy the weather and grab a barrel table. After 15 minutes it was time for our tour. We were with a guy that was doing just his 2nd tour ever. He was a fun, laid back guy. Sometimes he wasn't super confident about what he was telling us, but he'll get better with each tour he gives! It was neat to see their facility and we were able to grab a couple empty cans to take with us. After that, we had 2 tastings (a stout and an amber) and we were done! We grabbed another beer and a picnic table and stayed a while. They had a DJ out there and some corn hole sets. Overall, a nice way to spend a couple hours on a Saturday!\n\nOH, they also had a BBQ place there selling chicken, pork & ribs. It smelled SO amazing, but by the time we were done with our tour at about 3:00, they were sold out and packing up :( Guess it was just as good as it smelled.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Awesome beer, lovely bartenders!\n\nI've been to the tap room at this brewery a few times and I have never been disappointed! My favorite beer has to be the Black Hand (the chocolaty one), I never fail to get myself a few glasses of it every time I go. The ambiance is relaxed, casual, and a little mysterious ;) The bartenders are also really nice people, that make you feel welcome the minute you walk in. They also go above and beyond when the occasion arises. The last time I went, about 5 days ago, it was my boyfriend's birthday and chance has it that 2 other customers were also celebrating a birthday too. The bartenders were warm and even gifting us 4 oz tasters so that we could toast and sing \"happy birthday\" to the 3 birthday folk. I thought it was really nice gesture that most places wouldn't have done and it really made the occasion special for the boyfriend.\n\nThank you!", "author": "Sandra H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-10", "description": "Pretty good. A smaller inside venue, that is dark, mysterious, and rather nostalgic. Speak easy beers are a big aggressive for my palette, but having them fresh lifted the experience. The servers here were friendly, and they had great music playing.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Loved everything about this place. It is very creatively decorated inside, although the outside looks a little sketchy. The bartender was so friendly and very informative on the selection of beers they had. There's a small lounge area towards the back of the bar and a small store right at the entrance. I would definitly recommend this place to beer lovers.", "author": "Kitty D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Chill prohibition atmosphere, composed primarily of local, return guests. I've had their beers from Total Wine & had to check out their brewery while I was in San Francisco. I was not disappointed, great selection; from their prohibition ale, big daddy ipa, & payback porter to their newer Massacre (which is soo smooth) that I fell in love with it. \n          The smell of hops in the air that hits you every now & then is like a siren's song. That will be one of my fondest memories of this brewery. Relatively inexpensive will be another reason to return. Personable bartender Clay made my experience super chill!", "author": "Jeffrey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "Some friends and I went to Speakeasy Brewery on a Saturday night. We arrived around 4pm and stayed until about 830pm-9pm. The area is safe as it's located in an industrial part of HP. I appreciated that they had their own parking lot, which is convenient. It's pretty easy to locate and the outside is clean and the landscaping is well taken care of.\n\nGeneral Info: The bar itself does not sell food, but there was a food vendor outside. People are welcome to bring in the food and eat inside. The décor matches the image of the beer-dark, mysterious, yet comfortable. They have a couple nice nooks and benches to be more intimate. The ambiance is casual and the crowd is laid back. The restrooms were clean the entire night and the bartenders used clean towels. The bar itself was also very clean, which is important to me personally. \n\nThe customer service: The bartenders were super friendly! They enjoy their job and engage in conversations with customers. They do not get stuck in one conversation and ignore other customers completely. They were very attentive-clearing glasses, checking in, and describing the beer and brewery. They were knowledgeable, but not arrogant. \n\nLast but not least: THE BEER. My group and I tried every single one on tap through flights. They were all delicious and aromatic! I am not a beer guru of any form, but I know what I like. My favorite has to be the Prohibition Ale. It was soft, yet flavorful. I also enjoyed their Tallulah Seasonal brew. Their beer is delicious and they have something everyone can enjoy. \nIn closing: If you like supporting San Francisco, enjoy craft beer, and are looking for a laid back ambiance-this is a great choice!", "author": "Natali R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "My favorite brewery! Love the people and location. The employees are awesome. Great selection of beer and decent prices.", "author": "Jeanine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Nice tavern-feel to the taproom. Dark lighting. Very small, therefor fairly loud given it's a popular place. The beer is good. Random location that is a little off the beaten path, but worth the drive!", "author": "Kyle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "Nice place to hang out with friends for drinks. This place is strictly a bar and they don't serve any food. They have a variety of beers on tap, so I would suggest ordering a flight to try a little bit of everything. If you enjoy a game of jenga, they have a small game room where you can play with jumbo jenga  blocks which is pretty fun.", "author": "Frances V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Great beers, great atmosphere. It's even got its own parking lot, so you don't have to worry about finding parking in the city.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-26", "description": "You have to love living in a place like San Francisco where we're surrounded by some of the best craft beers you'll taste anywhere in the entire country. Possibly outside of Portland and San Diego, there are more delectable suds flowing from our little slice of California than just about any other part of the world. And while most of the local beers you'll find on tap are coming from places in the Russian River and other surrounding areas, Speakeasy is one of **8 breweries doing the deed right here in our own backyard, and they might be one of the best of the bunch to boot. \n\n**The others are Magnolia, Beach Chalet, Gordon Biersch, Anchor Steam, Social Kitchen & Brewery, 21st Amendment, and Thirsty Bear... just in case you're curious. \n\nTell me a brewery with more refreshing libations, and I'll treat you to a swift kick in the rear to get you out of my face. Their libations taste like 1,000 John Tesh's have arrived on my palate to serenade my soul. Some of the standouts include their black IPA, their signature Prohibition ale, and a whole host of delicious special releases that always prove to be winners.\n\nAt the actual brewery itself, they just started doing a series of Friday night parties where you can head down to Lo-Do (new microhood you're hearing here first... Lower Dogpatch) and see the facility first hand! It's a hell of a good time that should be enjoyed as often as possible.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "The warehouse has great events, great  beer, and the prices are on point.  There are so many awesome beers to sample and I love that these awesome beers are SF brewed. The brewery tour is a fun date idea and worth the hike out to HP Bayview area.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Hands down coolest tap room in San Fran. Me and a friend made a full day of visiting the popular breweries in the city and both agreed Speakeasy was our favorite. The beer they make is amazing, didn't try one I didn't like. Highly recommend the Butchertown Black!", "author": "Will W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-13", "description": "i LOVE what they've done with this place!\n\nthey have a lot more choices of beer now since when i first started coming here couple years ago. \n\ni really enjoy variety so i love how they have 4oz tasters. i had to get one of EACH :D", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "LOVE this place!\n\nCame here for HH with my coworkers and I did not leave disappointed! I am already a fan of their beers, but the venue is amazing. They have couple large rooms for big groups, seating at the bar and several chairs/tables for your use. The way they decorated inside is awesome.\n\nThey also have a cat roaming around, which I was a fan of :)\n\nUpstairs looked like a bunch of offices, which I think is kind of neat!", "author": "Heather R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-26", "description": "Hubby is a beer aficionado so we made a point of dropping in for their 15th birthday bash yesterday.\n\nRude awakening - he enjoys a cold one but not standing up and not being able to slam it as these beers are very stout.\n\nWe tried three different ones and ended up pouring  a lot of it into the garbage.\n\nHe does better with the right setting. So maybe he's not a beer aficionado after all.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "We went here and did the brewery tour. It was only six people on a Saturday afternoon. The tour was very informative and laid back. Took about 25 minutes to go through it and then you can buy some beers on tap and sir around at the bar. My husband really enjoyed it. It is easy to find and park.", "author": "Raven J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "Cute place to chill and grab a couple of cheap beers before heading off for the night! \n\nDo I see myself becoming a regular and hanging out often? Definitely not.\nDo I see myself coming back to take the tour of the brewery? Definitely a possibility!\n\nLocated in the HP, I was initially really nervous about the neighborhood. Once I've arrived though, all those thoughts went away. The brewery has it's own parking lot with ample parking close by!\n\nOnce inside, the whole place is basically a giant warehouse with plenty of beer, food and people. What they lack, however, are seating areas. So I highly recommend you to be ghetto and bring your own seating!\n\nWhile I am not too big on beer, even I couldn't pass up the 2 beers AND a souvenir glass for $10! They also have free popcorn and a little tamale stand.\n\nI'll most likely be back one day for more beer and to check out the tour! Yay!", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Really cool spot! Beers are strong and delicious.  No food at the bar though.  Really wanted some fries!!", "author": "Shauna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Stopped by for the first time yesterday and it has a great vibe and of course great beers. There was an outside vendor selling BBQ so that was great too. Only wish they had more food selections.", "author": "Glenn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Speakeasy has tasty beers, and their tap room is warm and inviting. I've been there a few times over the past year and always had a great time. The bartenders are nice, and the \"Medicine Cabinet\" is always stocked. You can get bombers and growlers - the growlers are especially convenient for those limited edition beers on tap that you can't otherwise get. Though they don't have food on-site, they have a food truck schedule on their beer menu, for those of us who like to snack when we drink. However, if you're there during the week, be sure to grab a burrito or something in the Mission on your way out there! Otherwise, you'll be SOL.\n\nI'm not giving it 5 stars because of its location and my latest experience there. It's in Bayview, in a spot that feels like it's in the middle of nowhere. Getting there by bike is somewhat of a chore, and I can't even imagine having to take public transit there. For those of you with cars, it's no big deal. \n\nI went this past week with a friend for a couple of drinks. Normally, the bartenders call \"last call\" well before they close, but they didn't this time around. I couldn't recall if they closed at 8 or 9 on weeknights, and since my friend was able to order us each a beer at 7:45, I assumed they closed at 9. I was wrong. At exactly 8 p.m on the nose, the bartender started making comments about us leaving and them closing. I was forced to basically chug an almost-full beer (with help from my friend) and scoot out the door before the bartender literally pulled the stools out from under us. I understand that they don't want to hang around any longer than they have to, but it would have been nice to get a heads up before we were ushered out the door.", "author": "Tracy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "Folkin' Fridays! Brews and Bands, love it!\nCasual folks hanging around drinking beer while listening to bands jam!\ngreat prices on beer there, and to go if you have growlers.\nfood- ehhh eat before coming here or bring something to eat.  The taco stand they have set up is great and all, but not filling.\nMusic- changes all the time.  I'm not a fan of playing indoor since the sound is bouncing off everything and it is LOUD.\n\nAmazing and super chill. Recommended on for a friday!", "author": "Bobby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "Off the beaten path, the tasting room looks and feels like, well, a speakeasy. \n  The beer is outstanding. Big fan of the Big Daddy, Double Daddy, and Prohibition Ale. They sell awesome looking growlers, bombers, six packs, and pint glasses.\n  Don't think they serve food, but remember this is a tasting room, not a bar. The atmosphere is laid back, not a tv to be found. Keep the cell phone tucked away and soak in the great beer, atmosphere, and company.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "I came upon this place when a friend and I decided to walk to the bay (from Bernal Heights :0). The walk was industrial and pretty deserted, and then we came upon this in the middle of an area that was basically industrial parks. I wasn't sure if we were allowed to go in from the outside, it's pretty nondescript and I thought it might just be a wholesale outpost or something...\n\nMy friend and I came in and were transported to another world. The've got it decorated like an old speakeasy, complete with old fashioned looking light bulbs and a little button on the wall that you're supposed to press if the speakeasy gets busted :)\n\nTheir flagship ales (three choices) are $3 until 6, which is pretty darn cheap, and their beers are tasty. They've got cute sweatshirts and tshirts for sale in the front. \n\nIt's a nice ambience, and was definitely a welcome respite on our walk. I forgot it was daytime while we were there, and was pretty much blinded when I walked out (there are no windows and the lighting int here is quite dim).", "author": "Meryl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "We biked here during SF beer week. I love Big Daddy and was excited to try more Speakeasy beers. However, its was soo crowded, hot and loud. I could barely get to the bar to order a drink. There was standing room only (or sitting on the stairs). They had food trucks outside, but you couldn't bring beers out there, so it felt discombobulated. Speakeasy, I still love your beer and will order it elsewhere, but the tasting room needs some improvement.", "author": "Leah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-17", "description": "First stop on a brew crawl.  Kinda out of the way, in an empty neighborhood, large free parking lot.  It was the only place we had to uber it, but not too bad.  Cool looking place, several nooks and crannies to hang out and relax for a bit.  They only sell beer, which was pronounced very good.  Friendly bartender.", "author": "Lola K P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Great on a Sunday. BBQ truck parked in the lot out front and $3 beer specials. \n\nIf you can, grab the private room off the main bar and park it for the afternoon and sip beer and eat food truck BBQ.", "author": "Lee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Came for the open Yelp event. There's plenty of parking nearby, probably because it's located in the less than desirable Hunters Point neighborhood. Tried their Double Daddy IPA, the Prohibition Amber, and the Big Daddy IPA. I especially enjoyed the Amber, which I thought would make a nice beer to drink after a long day of work, when you've kicked up your heels. \n\nThey don't have food available for purchase on site, but there are usually a few food trucks where you can get some grub. Bring a coat; this is basically a giant warehouse, and while they have a few heaters, it's definitely chilly inside!\n\nThe brewers here obviously love what they do, and it especially came through on the tour. Support local beer!", "author": "Leslie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "This place rocks! It's a brewery not really set up for entertaining but they do and they do it well!\n\nYou buy chips at the door and go in and buy beer from the keg master. Last Friday they had this double down strong beer that was rich tasting and delicious, their prohibition, a blonde, a stoudt, and a belgian style. All delicious. People bring their kids - so there were about 10 cute little kids running around playing - give's it a picnic family vibe that's surprisingly cool. \n\nSince they're only open Friday evenings - everyone is appreciative that they open it up and it's easy to talk to anyone.\n\nVery Cool.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "I absolutely love this place. When you charge $4 per pint in San Francisco then I'll definitely be back. Not only is the price good; their beer is absolutely amazing. You can never go wrong with their Big Daddy IPA. Their porter was also a good one. Personally, I have to be in the mood for a porter but it was definitely not a mistake to try it. I also decided to try their Wet Hopped Big Daddy; that was definitely a tasty beverage as well. It was nice patronizing this place talking to people who enjoy good beer.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "Now this is a friendly brewery, I mean it this place rocks. The friendly bartenders go above and beyond to size you into the right brew :) I just love this place, Ambiance, amazing. Brew's on tap, the best...even the seasonal bottles are well informed by the bartender. I just want to stay in this dark brewery and enjoy my pint. San Francisco is engrossed with pretentious bars, fortunately this gem is not like the others. Spend some time at Speakeasy and enjoy the boozes and company because, nothing tops this place. Cheers.", "author": "Sneakrs 1."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "Came here for the Speakeasy Brewery's Saturday Beer Blowout. The event said it would start at 4pm, so got there at 3:30 and there were already a few people wondering if they could go in. At 3:50, hoped in the line and the doors opened at 4:10. It was nice from 11am to 6pm that day and by 6:30pm the rains started coming hard.\n\nInside they had 2 areas serving beer. The first is the original place for their tasting. The second was a makeshift bar that had for the event. By 5pm the 1st bar was completely packed and people had to go to the 2nd to avoid the 30 minute wait. \n\n The event itself was a good idea, just the amount people and the amount of space available was bad. There was only one food truck that bother to come out, so the lines were really long. I am sure, Saturday's event was a fire hazard. \n\nWouldn't go again unless they put a cap on the amount of people..", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "The Bay Area is craft beer heaven. It s a beer blessing to live in San Diego, craft beer capital of the world, but the Bay Area comes a close second.\nThe taste room is open on Fridays, you pay for these tokens and then you go exchange those for beer! Beer is cheap, plenty, delicious. I usually stick to the Double Daddy and Big Daddy IPAs but they have everything for every taste from Pale Ales to Stouts and Porters to Lagers and Brown Ales. \n\nIn other words, friday afternoon beer heaven.", "author": "Claudia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "I went here one Saturday & had a very interesting experience. There was only 1 bartender working - her co-worker had some car issues & wasn't able to make it to work til 3 hours later. I forget the bartender's name, but she was cool. She had to run the bar by herself & it was getting busy. \n\nInteresting thing happened...a homeless guy ended up coming into the bar & started bugging a lot of the customers. The bartender tried to be professional & tried talking to the guy to make him leave, but he wasn't really listening to her. Around this time there was about 20+ people in the bar & the bar tours where coming in. She was holding down the bar on her own & did her best to chill & stay cool.\n\nMy bf & I ended up chillin at the bar for awhile & helped her deal with the homeless guy. We ended up having to call the cops on the guy to get him out, but the customers seemed to be understanding to her situation (working the bar alone) so most people we pretty chill. \n\nThis location is not anywhere near busy areas, so I can assume on the weekdays it's pretty chill. \n\nBeer is good & if you want the samplers, they're only about $1.50.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "The staff was great. Fun and happy personalities, knowledgeable about the different beers. Beer was delicious! We tried Big Daddy, Pop Gun, California Love & Double Daddy. We  had a great Thirsty Thursday here!", "author": "Jayme C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "Reminder: Consuming copious amounts of beer without food available leads to early drunkenness.", "author": "Dora C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-11", "description": "The Tap Room here is great! I've tried several of their beers and each was excellent. $4 beers and most are well above the average 5-6%. If you like dark beers, the Scarface was a standout and 9.5%! They have a large area in the back that is open on Fridays as well and have someone from La Laguna selling food which is really nice.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "Pretty stoked about this place due to it's Awesome reputation. It was a hidden gem among industrial buildings. The area was quite large and very welcoming. When you order your beer be aware that they use a \"Beer chip\" system in which you purchase chip tokens in one window then take it over to the bartender. Kind of strange, I assume it's to relieve the chaos, but it seemed like just an extra person to tip. The beers were pretty good (And only $3!), the reviews about the Double Daddy were correct as it was very good. But The witness smelt like ham. In fact it tasted like ham? Weird..\n\nThere were a bunch of free stickers and pins with their logo on it, which was cool. But their shirts didn't have any pictures of their logo with the eyes. Bummer.\n\nEvidently the brewery is only open to the public on Friday nights, which seems to follow the trend of a speakeasy. The placed was packed, their were even kids running around! I mean tiny babies and toddlers. I guess there's no complaint for that, as it was a friendly environment, just kind of makes you nervous as it's a dangerous area. Very friendly customers and approachable staff. \n\nOh and they have a brewery cat!! Awesome cat!!! Big black cat with a huge belly that every one thought was pregnant. Apparently she's just an excellent mouse hunter.\n \nI did hear a rumor that they will be opening a tapping room which will allow for more business hours. I'm excited for that!. Oh and be aware that they only do one tour on Friday so get there early!!", "author": "Kayla D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "This place is off the beaten path but definitely worth it. The staff is awesome, especially Molly and Jeff. The beers are amazing - a must try is the Blind tiger while it lasts. They're down to their last keg", "author": "Ravi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "Best kept secret in the Bay View!!\n\nWalk in, get tokens, go up to the bar and grab a beer.  As someone who doesn't drink beer often, I really liked it!\n\nTIP: Bring a chair! You are literally drinking inside their brewery and surrounded by barrels.\n\nMy Giant and I were a lil' scared to be going to the area at night, so we did not know what to expect for the first time.  But never fear, they had bouncers bigger than my Giant on staff that night.\n\nThe lady selling Mexican food at a little table inside was so nice...and the food was tasty according to my Giant. :)\n\nFree parking, no cover, CASUAL (I was a lil' over dressed...) and smoker friendly.  iPod is blasting some good tunes through a lil' beatbox.  \n\nSeriously such a great place!", "author": "Stacey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "We made the trek to Speakeasy not knowing what to expect, but being premium beer lovers, we figured it was worth a try. We were not disappointed! We love the vibe at Speakeasy, the warm wood interior, chairs to lounge and, of course, great beer! We had the Vendetta IPA, Big Daddy IPA and, my personal favorite, Double Daddy IPA. I highly recommend a trip to Speakeasy next time you want a great experience and fantastic beer!", "author": "Cheri K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "SF's nudists should embrace Big Daddy as their official beer. (-:\nWhy? Because it's awesome and because the crowd @ Friday's brew tours are so chill, I doubt they'd notice the occasional nekkid nebbish.\n\nOf course, you can wait months to get on the Anchor Steam wait list.  Or...you can haul over to Bayview at the end of every week for Speakeasy's Firkin Friday from 4-9 PM.  A $10 spot gets you two pints and a souvenir glass.  Additional pints are $3...just be careful about doubling down on the Double Daddy IPA!\n\nWas afraid the neighborhood was going to be sketchy, but it was totally fine. We even walked the pup around beforehand and she had a nice nap in the car while we toured.\n\nThere's a taco vendor who sets up inside...snacks were muy bueno!  If the onsite snacks aren't enough, check out SF Guardian's recent foodie recommendations for Dogpatch/Bayview...they look pretty solid.", "author": "rhonda s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "I'm not much of a barfly, when i do go for a drink i like cozy spaces and decibels that allow me to hear my companions. Used to be speakeasy was one large crowded room with few scattered chairs and catered food. Well, times have changed! A warm and inviting pub-like space was carved out of the building and features a bar with stools as well as two cozy, upholstered alcoves and tables and couches to spare! Nice!! Much improved space and the always great beer has even more teriffic varieties to choose from. Thank you workshop founder kelly for designing this clever and welcoming brewery/living room.\nNow i'm glad to visit and enjoy the vibe unlike pre-remodel.\nSee for yourself, speakeasy is better than ever!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Went for my birthday and had sooo much fun! I went on a Friday, just in time for happy hour, so there were a fair amount of people there, but it wasn't crazy crowded. Seating sucks, but they let people chill in the back, which is spacious. They offer some finger foods in the back, but not much, so if you're vegan or vegetarian I recommend stuffing your face before going. Great vibe and a friendly staff, I will def go back.", "author": "Vanessa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Get a tour on Sat. And Bourbon cask beer on tap :)", "author": "Oleksandr Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-02", "description": "I've been twice now. \n\nOnce for the Friday evening party and the second was for the anniversary. Both times the vibe set right with me; good music, great food stands/trucks and how can you go wrong with 2 beers and souvenir glass for $9.00! \n\ni had a blast", "author": "Jade W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-03", "description": "Pretty cool speakeasy/bar. It's pretty far out from central SF which has a ton of things to offer so I don't know if I'd make the trip out here again but I enjoyed it while I was there. Pretty small variety of beers but they quality is definitely there. Each person has their own preferences on beer so i won't say anything except that I liked them. \n\nIf I'm ever in the area i'd stop by but it isn't so amazing that i'd go out of my way.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "I never imagined a speakeasy brewery....but this is it! Dark, intimate, cool decor with leather couches, and lots of seating, all in a funky industrial area. I was impressed with the tasting and even more so at the price! $6 for a flight tasting of four IPA's. The bar was packed for a Tuesday happy hour. I can't wait to come back. There is no food so don't come hungry.", "author": "Marie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "The new tap room is worth the trek to Bayview just to see. Darkly lit with the neon \"shhh\" sign and wooden panelling, friendly bartenders... I'd hang here everyday if I could! Payback smoked porter and a number of other \"rare\" speakeasy brews yum! Be sure to try their SF beer week beer...it tastes like malt liquor. Brings back college memories.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "Racist! Racist! Racist!  My niece wanted to try several of their beers. My sister and her began to drink there beers. When the real nice black security guard told us in the future please do not bring children. We were not there to get wasted. According to there website it is a tasting room not a bar. My niece addressed this to Mike the bartender. She researched the website to confirm this. I did called to get the Managers name Mike said Alexa\n        My impression Mexicans are not welcome to there? (were not white washed dude! were Mexican)!!! \nUltimately they asked us to leave!! We explained that we are from Los Angeles.\n        Mike was very adamant that we were not welcome there!! I felt Mexicans should not visit this place if you to be on alert!! Mike gave my niece a courtesy glass for asking us to leave the glass was dirty when she unwrapped it.\n        As we were gathering our things to leave Mike sent the security guard to get our glassware quickly as if we were going to steal them! Never again. 1+ hour drive from hour hotel to get there. what a waste \nPor favor no vas a visitar este lugar son Racistas!!!.", "author": "Alicia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "A friend of mine has been here quite a few times. He was the one who suggested a longtime-coming reunion with he, I, and a friend of ours. We showed up at about 3pm and didn't leave until around 8 that night.\n\nThe Tap Room is, in terms of size, the sort of bar one would expect to see in the front or side of a nice restaurant. It's not very spacious, but I imagine you aren't expected to stay long (as opposed to me and my friends). The seats are all comfortable, even the stools. The only concern is showing up at the right time to find a seat, otherwise you'll be standing.\n\nIf you have the time, you just might find yourself having pints of the entire Speakeasy collection and picking up a few collectibles to take home. Though I don't go to Bayview often, I'm glad my friend showed me the pub in this place. We're already planning when we can go again.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "DRINKS:\nSpeakeasy beers are all very ... tasty. On the menu were many that were higher than average alcohol by volume \n\n\nSERVICE:\nbartenders were very attentive\n\n\nATMOSPHERE;\nVery cute, speakeasy feel, with the speakeasy door, and old looking bar. Apparently there's BBQ trucks on Sunday and occasional live music. The live music makes it really awesome. At least when we went for the Google City Expert event, it was swanky prohibition kind of band. The only thing is this is so far away from downtown SF, it's in the middle of BayView/Hunter's Point.. Felt like I was back in the suburbs of South Bay. Not very SF feel. Maybe if they opened up a tap room in the middle of downtown/SOMA, that would be perfect. :D", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "On a whim, set forth from smoggy LA to SanFo & chanced upon this brewery. with a rustic decor and a round the corner friendly feel, Loved the ambiance & people, its a place to go & enjoy brilliant ales.", "author": "PiaCabs C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "Awesome place! This is what I'm expecting at a brewery. Great atmosphere and delicious beer!", "author": "Alex P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "Best bar I have been to in a long time. Everyone is very friendly. Shout out to all the guys that let join their game of Bones. Great times guys. Can't wait to come back", "author": "Alan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "Seriously Speakeasy, ENOUGH WITH THE KIDS RUNNING AROUND! I would give you five stars because I love your beer. But the screaming kids running around has to stop! Definitely other breweries to go to close by that don't have this problem. By the way is it illegal for anyone under 21 to be in the tap room area?", "author": "Scotty M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "I've been meaning to go here for quite a while, but I'm always working during the time that their 'taproom' is open so the second I had a free Friday evening I jumped on the opportunity to go here.\n\nTip: Don't get off the bus two stops early. Or drive. Driving's probably your best bet because in most cases it is going to be a very long and very packed bus ride.\n\nI was quite happy once I made it in the brewery. The system inside is you go up to the counter to purchase poker chips ($3 a chip) and you go to the guys pouring tasty brews and trade a chip for a pint. The guy at the counter hated my guts for some reason (was it because I wanted to buy a hoodie?), but the dudes pouring were pretty awesome. \n\nI'll need to come here again with some friends. There is a huge amount of space to hang around.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Once you get over Bayview, this is an intimate tasting room with nice, attentive bartenders and tasty beers!", "author": "Kellen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Visited them yesterday for their SF Beer Week open house.  For years we have wanted to visit, but were always hesitant by the location. It was no problem and they have lots of parking close by. \n\nThe place was packed but the staff was on it and organized. Seriously props to the staff for controlling that many people.  Beer is bought through tokens for $3. I would suggest bringing cash because the line can get long otherwise. Not sure how many beers they normally have pouring on Friday nights, but there were a lot of seasonals and classics, about 10. Double Daddy, Payback, and White Lightning were wonderful. Wide range of people enjoying local beer and they even had root beer for those under 21. They had beer and live music inside their warehouse and an outside area for relaxing/smoking and food trucks.  Oh...the food trucks were good.\n\nBeen brewing since 1997...they are doing something right and it shows.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "Came here for an free art event. It was awesome. Their always having some type of free event for the public, and it always brings out a good crowd. I like the beer here and it's close to home so it's a win win for me. \n\nI will be returning every time they have something going on, and so should you.", "author": "Louis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Speakeasy Ales and Lagers has been around for a long time, but their speakeasy themed tasting room has not. Put in a little over a year ago, it is the best speakeasy themed spot I've seen. Great attention to detail. Great ambiance. \nWith $3 happy hour beers, and $6 tasting flights, it is the most affordable place in the city to get fresh local craft beer. And beer is best fresh. \nThey also have free parking in their lot...I don't always want to drive, but it is nice to know it is there if you just need to stop in and get a growler to go.", "author": "Melinda E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Its tough to find a place that combines good beer, friendly people and outstanding prices. Somehow, this warehouse out on Hunters point has managed to do all three. \n\nI love that I can not only indulge in fresh Speakeasy beer for three dollars a pour, but occasionally in live music and fresh food, ranging from burritos to barbeque. I love the clientele, many of whom are remarkably friendly, especially considering that you get a true cross-section of people, ranging from hipsters to recent transplants from the wilds of Texas. I love the back patio: great place to enjoy the sunshine that seems constant in this part of the city, smoke a cigar and enjoy a delightful beer. \n\nOne of the only downsides is the location: not only is it the brewery in a bad part of town, but its also a schlep from most parts of the city, and without a car can be quite difficult to get to.\n\nI look forward to the Fridays when I have the time to make the pilgrimage to Speakeasy.", "author": "Casey U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-29", "description": "I came for the SF FunCheap's Speakeasy Brewery's Saturday Beer Blowout event (https://www.facebook.com/events/415884448428671/).  It was kind of a glorified beer tasting... except with insane lines.  They had giant Jenga and a large Connect Four game.  And giant checkers.  Sadly, giant games do not equal giant fun.  Except for maybe the Jenga.\n\nI should've known better than to go to an event for a beer I wouldn't drink if I was at a bar.  \n\nThree stars for effort though.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Love the $2 beers every last Friday of the month. Nice that they feature a new or exclusive beer during that time too. I recently had their Scarface Stout--very coffee-like and smooth. Double Daddy is pretty solid too. \n\nI like the atmosphere and environment of the brewery. People that are there are always chill, including the staff. Last time I was here, the bartender filled up my pint cup with their 12oz-only pours instead of giving me a 12oz cup--dope!\n\nSeems to be a family-friendly environment considering the youngins running around or strapped to a parent's chest. \n\nCome out here if you want to enjoy cheap, delicious beer in a friendly, relaxed spot!", "author": "Norwin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "Great place to have some beer and enjoy the company you bring with you.  They have a very cozy environment inside that really brings out the \"Speakeasy\" feel.  I enjoyed the beers and look forward to them doing tours.  The price is extremely reasonable for their beers especially when you compare to the City.\n\nI highly suggest checking them out.", "author": "Lance P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Shhhh, Speakeasy:\n\nWhite Lightning ~ (6/10)\nBig Daddy IPA ~ (8/10) \nProhibition Amber Ale ~ (7/10)\nDouble Daddy Imperial IPA (9/10)\n\nGreat beers all around. I wish they had wider distribution!", "author": "Gary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "I'd never heard of Speakeasy before going to happy hour on Friday. Not that I'm a brewery encyclopedia, or a fount of malt & hops knowledge, but it's a little surprising to find out that apparently I've been missing out on really good beer for quite some time.\n\nSpeakeasy's in the Bay View, right next to a toxic treatment plant I believe, but do not let either fact deter you. Their happy hour is such an incredible secret! Every Friday, 4-9, $3 tokens to get a 12 or 16 oz pour (depending on ABV) of one of the approximately 8 selections they have on tap. There's food available, but why waste valuable belly space on food when you can drink delicious beer? I tried the Butchertown Black and the Prohibition Ale, both excellent and quite strong. I also sampled the red ale (I forget the name but it was excellent) and the Betrayal (free!) upon the urging of the President/CEO, Forest.\n\nBut the beer's not the only great thing. Everyone in attendance - company employees and the varied crowd - was extremely nice, very open, and fun to talk to. There was a real sense of community and pride in the operation. If you want to impress your friends and make them envious of how in the loop you are, take them to the Speakeasy happy hour! One of the best events I've ever had the pleasure of attending in the Bay.", "author": "Corinna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "For awhile I was intimidated.\n\nI'd heard you could only come on Friday, the servers surly and newbies beware.  After finally checking a map and noticing that it wasn't completely out of reach, I decided to catch a cab out here and experience it first hand.\n\nSpeakeasy built it's reputation here in San Francisco with their deliciously hoppy ales including Untouchable, Godfather, Double Daddy and the awesome White Lightning.  Visiting the brewery it was nice to see that I could enjoy the old favorites as well as some new exclusives.  The Butchertown Black is a limited black ale that drinks like a hoppy stout.  The Sutro Stout was addicting and flavorful.  The Vendetta, an IPA brewed with orange, was also incredibly enjoyable.  \n\nYou know you're getting quality beer when you come here so let's look at the other facets.  The vibe is chill and laid back.  People from professionals to families to people just looking to start the weekend right are here enjoying suds.  At $3 a beer for most pours (12-16oz), this is one of the best happy hours you could probably find in SF.  There's some light munchies available and a proper bathroom.  The size of the space is just right, not seeming empty yet with enough room to spread out.\n\nAs most lament, the ride to and from here can be dubious.  Thankfully the T-Line is only a few blocks away and it you're feeling stranded or impatient, you can always duck into a few of the bars on 3rd Street before deciding on your trek home.  Overall worth the hike for a quality experience.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "You gotta check this place out it is awesome! Highly recommend for happy hour.", "author": "Erin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "Kicked off Beer Week at Speakeasy. A bluegrass band played on Friday evening. They had a hollowed out mobile home/bus that they transformed into a food truck which served an amazing beef brisket soaked in one of their brews. Their fries weren't too bad either! A bit salty but that only makes you thirsty for more beer :) A Speakeasy mug and 2 additional chips for a couple more drinks for $10 inside the brewery. The bartenders were fast and until they shouted last call the crowd was tightly knit near the beers on tap!", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "I'm not the biggest fan of their beers, but the brewery is a great punk rock place to hang out. Haven't been back since they opened their tap room, but prior, Friday afternoons, punk bands, putting green, smoking on the \"patio\", perfect place with little crowds. Can't wait to check out the full taproom.", "author": "Lupolo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "Hubby and I are regulars here on Fridays. This is one of the best breweries we are lucky to have in San Francisco. \n\nThere's always something for everyone, I love their porter and their stout. But they also do a great IPA. There's free popcorn! and each pint is like $3!! Yes it's a bit out of the way but trust me, it's worth it. \nThey sell you tokens at the door for each pint and if you don't use them up that night you can save them for next time! \n\nWe like to go get a pair of Ike's sandwiches and head over to this place and just scarf down one of the best sandwiches known to man along with a few pints of the best beer in the bay! =)", "author": "Ireri L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-29", "description": "Speakeasy is one of the overlooked breweries in SF that lies in the shadows of Anchor Brewery. Sure, it's not in a great, convenient neighborhood but at least you don't have to book reservations like at Anchor to enjoy the beer and the facilities. You are, able to grab drinks up at the bar, in one of those cozy, private booths up front or in the back area. At times, there will be local food vendors serving food or bbq during the summer. The beers are great, the venue is spacious, and the patrons are true beer enthusiasts.", "author": "E E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "In response to my previous review: great customer service. Problem resolved, thank you Speakeasy. In the process got to visit the taproom, awesome little space to grab a beer. Weird location though but the beer is worth it.", "author": "Christina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-22", "description": "Fantastic place to come to get the weekend started. I can usually only find 2 of their beers in stores (Big Daddy and Prohibition) so come here if you want to try all the great brews they have!\n\nHours: Friday and Saturday from 4-9pm\n\nPrice: 2 beers for $10 and a pint glass with their logo on it to keep (great deal)\n\nBeer: Great beer for everyone. Lighter beer (White Lightning), IPA (Big Daddy), Amber Ale (Prohibition), Imperial IPA (Double Daddy) and the Payback Porter on tap last time I was there, amongst others.\n\nScene: Complete mixed crowd here. Everyone is welcome and everyone should feel comfortable. People start rolling in when it opens but it really picks up closer to 5:30. Music starts up around 6 or 7pm. There is a small outdoor area just off the side of the warehouse.\n\nFood: Not a place to come and eat but every time I have been a local Mexican restaurant has come in and set up to sell some pretty good and well priced food. Taquitos for $1 each. Tamales and mini burritos for $3 each. Not a full dinner but something to soak up some suds.\n\nOther: Grumblers, T-shirts and other schwag for sale. Also, Chicharrones from 4505 Meats for sale - awesome!", "author": "Frank J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "Experienced my first Friday Happy Hour tasting on 12-30-11 and WOW, what good times shared by all. I went with my wife and 8 year old daughter. This particular night the tastings from 12oz on there specialty beers to 16oz on there house brands was only $2 Usually it is $3 which is still a great deal!.\n\nYes, you are in a warehouse but they crank up the ceiling heaters. The crowd is very easy going and no attitude. Maybe it changes? later in the evening after a few more beers but we got there at 4:00pm and left around 6:30pm I think it stays open till 11:00pm? so maybe then the beer takes effect on the crowd?\n\nIt can be boring for little people. They only serve water for under 21 (It is a brewery after all) I did not expect Sarsaparilla. There is Mexican vendor food served which is a good deal and free pretzels this night.\n\nI was drinking the Godfather IPA and the Scare face Stout. This is a beer that you eat more then quaff down. The best compliment is I will be back!", "author": "Rawley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "First time being at this location and it was great. $3 beer and great people just hanging out and having some fun.\n\nOnly thing i don't like about the location is that it's located not to far from Hunter Point area.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "Awesome staff, great beer.\n\nSo. I've recently learned that I sound totally ignorant when I say, \"I'm not a beer person.\" Apparently, I'm told, there's a beer for everyone. And CRAFT brew is the way to go. \n\nUnconvinced, I STILL decided that a beer tasting networking event sounds like much more fun (and far less intimidating) to most people than wine tasting. So I went ahead and booked a private party at the Speakeasy Brewery.... on short notice.\n\nDid I say short notice? RIDICULOUSLY short notice. Like 2 days. AND. I needed the event on a day they were doing production and NOT normally open. \n\nThe ROCKSTARS at Speakeasy pulled it together and seriously knocked it out of the park. GREAT beer, VERY cool staff. (Like you kinda want to hang out and be part of their little indi brew/\"in a band\" friend group.)  AND the caterer they suggested has become my new go-to. They were fast, flexible and totally reasonable. They knew my budget and came in under. Seriously. Who does that?\n\nThe one and only ding is that yes, the location is a bit of a hike... and a bit hood. I think we scared people off by saying that it was near HP/Bayview. From now on we're going with SOSOMA. (South of SOMA.... Deep south.) Our attendance FOR SURE suffered because of the location. And while they DO have ample parking, with those kick ass beers... who wants to drive? \n\n100% will use these guys again. I'll just rent a party bus to get people there and back. And I'd hire a band... Make a night out of it.\n\nAnd humbly, I admit, I found a beer I kinda liked. White Lightning. \n\nI LOVED working with Speakeasy!!", "author": "Robyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "This spot is for the grown...don't need to be sexy kind of crowd.  Just cool and wanting to unwind on a Friday.  Cheap beer as far as the price but doesn't taste cheap at all.   2 of my very good friends and myself hung out here for a few hours just catching up.  \n\nWe're in a warehouse surrounded by the brewing machinery, free popcorn, a few chairs, tamale vendor and folks wanting to have a good time.  This place is so chill and relaxing people bring their kids here.  \n\nyes...for all you peepz with kids..your kids are welcome at this spot.  \n\nI'd definitely come back here again.", "author": "Blue S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-23", "description": "Their beer is quite good.  That's for sure, and they have a lot of varieties here they don't distribute to stores.  \n\nBut the atmosphere is a carved out area of empty cement slab inside their warehouse, a lot of their specialty beers aren't actually that amazing, and it just doesn't feel like a destination type place.  Maybe if they sold food, or did tours, or had more chairs, it'd get a fourth star.\n\nThey also have an odd payment system -- you buy tokens at the front door, which you use to buy beer inside; I prefer a standard pay as you go type system, but I see why this is more efficient for them.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "A fun place to go to, great atmosphere, local area to drop by after work, and some good people to talk to. They are getting a pretty good selection of beers so there is always something for someone in case their choice is very particular.", "author": "Billy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "One of the best breweries in California.  Great beer at great prices.\n\nMy wife and I attended the event they had for SF Beer Week on February 17th.  It was our first time there and the experience was great.  It was a great atmosphere and the beer and tacos were delicious.\n\nI left with a case of the Double Daddy IPA and I can't wait to go back.\n\nIf you're in San Francisco on a Friday evening or Saturday evening, I recommend Speakeasy for good priced, good quality beers.", "author": "Santiago U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "Things I love about Speakeasy: \n- It's a great stop on the way to the city.\n- The neighborhood doesn't seem too bad, despite the Hunters Point location.\n- You don't have to buy the glass, like you do at Devil's Canyon.  $3/beer w/o the glass! (I don't need anymore random beer glasses!)\n- Unsuspecting location and very casual. \n- Indoor, real bathrooms. \n- White Lightening beer. \n- 4505 Chicharones are sold here sometimes!\n- It's every week, not just one a month! \n\nMy biggest gripe:\n- There aren't any signs with names and descriptions about the beer. There are some special taps that the guys pouring the beer could be better about talking about. They just expect you to know what you want.", "author": "Rachelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Cool place, great beer. The only reason I'm not giving it a five star review is because its resident feline sits on the bar. Maybe it's just me but I'm not too keen on setting my drink where a cat regularly puts its anus. Also was a little \"ugh\" when I saw it put its face in one of the water pitchers meant for the customers.", "author": "N J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "The time to go here is Friday afternoon when they have food and everyone is hanging out trying beers and socializing.  For $5 you get a pint glass (souvenir) filled with whatever beer you want and refills are only $3.  \n\nThey give a tour which is quick, fun and informative, then it's beer time.  \n\nYes there my be a few kids running around but its not a medical marijuana dispensary, its a brewery.", "author": "Sloppy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-08", "description": "This is how cool all microbrews should be. What a fun experience! Headed up to SF for dinner, I happened to find Speakeasy on Yelp and quickly directed the car that way. Parking was ample. People were nice; one great thing about SF (as opposed to the south bay) is that there's all kinds of people at every event. The beer was new, refreshing and relatively cheap.\n\nSo $10 for a Speakeasy pint glass and two beers? That's pretty good. I tried the White Lightning and Prohibition first. Both were good. Tried some Big Daddy (hoppier than I like, but I'm not an IPA person) and whatever the porter is called, and both had distinct, refreshing flavors. The bartenders were helpful and very patient.\n\nDid I mention the free popcorn? How about the random stand selling mexican snacks? It's just a cool, laid back atmosphere.\n\nMy friend actually said the stop at this place made his night; no matter what happened next, he would have gone home happy!", "author": "Akash K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "Wow what a treasure for west coast beer fans. With a killer, purposely DL setting and location, speakeasy's tap room delivers fresh, hop-oriented beers for a great value. Cool-assed speakeasy gear as well as bottles and growlers to take with you also available. Beer specials til six everyday.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "I almost want drinking to be illegal again after visiting this taproom. Old-school feel with modern amenities and of course, delicious beer. The bar is one option, but there are also three rooms off the main for more privacy. Altogether well-done.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "Such a good spot.  Really 4.5 stars.\n\n I went with a group of friends for a Frickin' Friday, and I felt like I was surrounded by a bunch of hearty regulars who were happy to see new faces.  All the beers are solid, and it seemed like such a good deal for beer of that quality.  \n\nMy favorite part: the cute mom/daughter selling taquitos and burritos (for a whopping $1 a taquito or $3 a tamale or something).  To advertise them, this guy would periodically shout out like Will Ferrell's Harry Carey \"HEY!!!  HEY!!!  We've got taquitos here!!  I KNOW you're Hungry!  HEY!!  Come over and eat!!\"\n\nAnd even though my ears felt blown off, it invariably worked, and a few people would buy them.  I eventually was one of those people.\n\nAnyway, good vibes, great deal for quality beer.  Only downsides - it's far away from me, it's only on Fridays, and it's FREEZING.  Bring a jacket, scarf, whatever.  They have to keep the doors open so 'nuff said.", "author": "Annie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Speakeasy put out for SF Beer fest. Can't go wrong with the strong Scarface Imperial Stout or the aptly named Massacre (Black Wheat) and at over 9% you better pace yourself. Those $3 beer tokens are so well spent. Though it was a little crowded, it was mainly the typical eclectic crowd- everyone from parents with super young ones, to grandpas and everyone in between. The taco stand outside was fairly tasty as well, decent prices to match the beer. Though it was cold out (as SF fog usually goes) they kept the mood light with entertaining bands and a friendly crowd.", "author": "Naomi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-24", "description": "I can't believe I ever used the excuse of \"it's too far away.\" It was literally a 15-20 min flat bike ride from the mission to beer wonderland. Beers are fantastic. Their new tap room is gorgeous as well. Speakeasy is definitely now on my weekend go-to list", "author": "Whitney W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "I wasn't quite sure what I was expecting but I was definitely not expecting to drink beer in a warehouse. And I definitely was not expecting to have fun drinking beer in a warehouse. For $10 I got two pints and a souvenir glass. The souvenir glass is awesome because it has the mysterious speakeasy eyes... ooOOoo ....\n\nThe beer itself took some getting used to because I'm not a big fan of hoppy beers. Hence, I ended up drinking only four ounces of each of my 2 beers and making my friends drinking the rest of the beer =)\n\nAnd I definitely loved getting a free Hansen's Cherry Vanilla Soda. I love cherry vanilla soda.", "author": "Kay A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "Double Daddy's are my poison of choice here, but after 4 cups I'll start seeing double! This place kicks my ass every time I come here, but it's a fun way to spend a Friday night with some friends! If you go hard here, don't plan anything crazy after, or you'll wake up not remembering what you did the night before!\n\nIt's pretty obscure and random to find, I honestly did not know what to expect when I first came here, but they make it work!\n\nYou buy chips at the door and you can trade in the chips inside for beers. The free popcorn is a nice touch too!", "author": "Tien P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-14", "description": "Pros: Great Friday happy hour! Excellent beer!\n\nCons: Kind of out of the way, so have a sober driver or take the bus -  as taxi's will not come out here to pick you up (I learned the hard way).", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "I talked with Melinda (I accidentally called her Melissa in our emails and looking back I was so embarrassed) while planning a birthday event for 28 individuals.\n\nShe was extremely friendly and let me know about the brewery bar hours/rates. She also said that she would let security know our large party would be arriving on 7/13, and this allowed entering to be much easier.\n\nI think that GoodBeer offers a unique, unmatched spin on the bar/brewery experience. It's a great place to take any sort of group - big or small. Also, the beers are only 3 dollars on Fridays from 4-9 pm in the brewery. That's such an awesome deal - especially for quality beer.\n\nIf you are an event planner, or about to become one, I would definitely consider stopping at Goodbeer at some point in your party's trip. It's an easy way to bring people together without having to walk through the hassles that reservations, bouncers, etc. that other bars and clubs frequently present to planners.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Great Environment to sip on some beer. I ordered their beer sampler, which is pretty cool because you get try a bit of each of their beers. They have happy hour here. I think it is around $3 for a pint. Worth it, definitely coming back here to enjoy the good vibes again.", "author": "Dilys Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "Even though located in the edgy and shabby industrial neighborhood, this brewery/bar is unpretentious and as good as it gets. \n\nFree parking, no cover, hidden, not yet experienced Asian Invasion (nice blend), large smoking patio, unique blend of beer and a very friendly staff.\n\nA nice change from the usual chic HH places in fidi.", "author": "Catalina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "The legend of the infamous Speakeasy Brewery Friday Happy Hour from 4-8pm had been on my brain for a while.  This event promised to be the stuff legends were made of.  \n\nImages of cherubim fountains spewing streams of beer and joyous folk diving headfirst into frothy pools of ale and lager billowed through my mind.  I fancied myself sipping a pint whilst comfortably lounging on a fluffy cloud of wort.  \n\nPerhaps it was the delicious pint of Hunters Point Porter that I drank the night before at Broken Record still coursing through my veins, but on this particular Friday the draw of Speakeasy was unavoidable.  My future existence in the world was contingent upon it.  When I woke up in the morning, I knew that today would be the day myth would become reality.\n\nAfter kidnapping workaholic Lauren Y., tying her up with duct tape, and shoving her into the hatchback of my PT Cruiser (with the help of Brooke G.), I started driving furiously toward Hunter's Point.  Successfully dodging a number of lovely Bayview gentlemen driving \"cars\" with busted out windows, licking their lips and honking at us all the way down Evans, we pulled up to the Speakeasy warehouse around 5:00pm.  Greeted by the creepy Speakeasy eyes and the glorious stench of beer and cardboard wafting through the air, we walked through the door and saw beer boxes and kegs as far as the eye could see.  \n\n                                        :::queue angelic hymn::: \n\nThe signature happy hour special is 3 pints + 1 pint glass for $10.  Sweet deal!  If you're a lightweight, you don't have to drink all of the pints that same day.  The bartender administers casino chips that can be redeemed for your choice of brew anytime.  Also, for you lightweights, they have a popcorn machine so you can put a little something in your stomach if you opt for the Double Daddy (double hops, double malt, 9.5% ABV) and feel yourself getting a little tipsy. (*cough*Lauren Y.*cough*)\n\nThe atmosphere was so refreshingly casual - you're free to roam around the warehouse, chill at the bar, go outside, whatever - and everyone was hanging out, enjoying some GREAT beers, and chatting.\n\nBesides the really phenomenal brews (I was VERY impressed by the complex, strong flavors, high alcohol content, and well-balanced taste), the highlight of the whole visit was something that could only happen to four 20-something girls drinking pints of porter.  Amen to that! Some guys also frequenting the happy hour invited us for a ride on their Burning Man, chick magnet, 4-seater bike/surrey/contraption/definitely-not-street-legal (even if we were sober) \"vehicle,\" complete with chain-link cup holders.  While dodging buses, laughing hysterically, and pedaling as fast as my legs could handle with my two best friends and a beer close at hand, I thought to myself \"How could my life get any better than this?\"\n\nBig thanks to the stellar brewmasters at Speakeasy.  I'd also like to thank the geeky LARPer engineer who built the \"contraption,\" his hippie Seth Rogan look-a-like friend, and the creepy old guy with the double-pierced ears.", "author": "Erin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "In honor of the new Ken Burns documentary \"Prohibition\", I went in search of the secret establishment in the Bayview that served up those sweet ales and lagers that needed code-word clearance during those years in the 1920s & 30s. \n\nAlright, that's a boldface lie. I didn't know about the Ken Burns documentary. I just wanted people to think I watch PBS. I was really just looking for a place to hang out on a Friday with some good beer. Luckily, Friday nights at Speakeasy Brewery fits that description. On Friday afternoons starting at 4pm until 9pm, Speakeasy Ales & Lagers opens its doors to the public to enjoy their beers. We didn't get there early enough for the tour, but the warehouse looks pretty small, so I imagine that the tour is fairly short. \n\nSo we showed up around 7pm and the place was packed! Parking in the lot was full, but there's plenty of street parking around there. Look for their trademark neon eyes staring down at you, daring you to order a Bud Light. Don't be confused. You'll be drinking in the warehouse. Nothing fancy. You walk in and buy some tokens for the beer. $3/token for a 12-16oz pour, or for $10, you get a Speakeasy pint glass and 2 tokens. I personally loved the pint glasses. They also have plenty of branded clothes to take home as a souvenir. Trade in the tokens to try out some of their brews like Prohibition Ale or Big Daddy IPA. They also had a few of their lesser known beers like the Double Daddy and White Lightning. I would have liked to have tried some of their specialty brews, though.  In terms of food pairings, they have a popcorn machine popping out batches of buttery popcorn and a small stand selling Mexican food (flautas and stuff?). Popcorn's free (woot!), Mexican food is not.\n\nThe crowd is surprisingly mixed. More kids than I expected, but you got your after-work 9-5ers, saggy pants Giants fans, skinny jean hipsters, and possibly local SF City College kids. All milling about on the brewery floor. A few tables and chairs are spread out, but most people are standing. I would say it's a cool place to hang out with a group of friends who are into the Speakeasy beers, maybe not so much for meeting that special someone. \n\nPassword not necessary to gain entry into this Speakeasy, but you'll need an ID.", "author": "Saunders C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-02", "description": "I dropped by Speakeasy last Saturday for the 10th Anniversary party and had a fantastic afternoon. $5 for a souvenir glass and 2 fantastic, delicious, frosty beer?  Yes, please!\nAwesome party, I'll definitely be back to check out one of the Friday happy hours.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "I'm happy to support the local little guys. And their small tour/operation here is definitely worth a visit and a return visit to the tap room as well. Walked away with a growler full of SF Lager. Looking forward to coming back in the future.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "I came here for the yelp event recently (my second time at the brewery) and I have nothing but positives to say about this place. \n\n1) The atmosphere is chill, it's all about hanging out with your friends and having a few great beers. The staff are all really friendly, and the Head Brew Master is really chill, and has a sense of humor abotu questions on the tour even if they are silly (ex: my friend asked to be hired). \n\n2) The beer is excellent, they have lots of varitey, and the staff make good recommendations about when you might like. At the yelp event I was able to try a flight of three tasters, and I liked all of them (although the White Lightning is my favorite). Also, full beers are only $3 a piece, and you can't beat that. \n\n3) The food trucks are great, especially the bbq. I had the pork belly sandwich, and it was awesome, I almost went back for seconds. Basically Speakeasy knows what it does well (beer) and find other people who do food well (the trucks) to help them make a great event. \n\nI love this place, and I plan on going back for one of the Saturday night openings.", "author": "Leslie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "This is not your typical place brewpub.  That's because it's not a brewpub.  They don't make food.  They only serve their beer and invite a food truck or two... at least, that's what they did for the one time I was there.  Their 2011 Halloween Party.\n\nMy wife and I loved it.  It's super industrial inside and out.  They roll out a portable bar / kegerater and start pouring their beer.\n\nAs a sidenote, I'm not a huge fan of their beers... although I love their Double Daddy which unfortunately was only served from bottles that night.\n\nThe atmosphere and overall coolness still forces me to give them 5 stars despite their good (not great) beer.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "Fridays from 4-9. Limited hours I know, but a good time to drink your week away. Like everyone else, you get 2 drinks and a glass for $10, or for your next round 3 drinks for $10. \n\nI came for the beer and left with the Who's Your Daddy? tee shirt.", "author": "Drake F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "I love getting my beer straight from the source! I'm a fan of their porter, though I'd like to, for once, be early enough for the coffee porter.\n\nYeah, it's way out there, but that is part of the charm. \n\nYou can either buy a souvenir glass + 2 tokens for $10 or $3/beer. \n\nThey start shuffling you towards the doors around 9pm. That's not too early though as the beer would have already kicked your ass x 3 by then.", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "AWESOME place to hang out with great beers at reasonable prices and very knowledgeable staff. It's cozy and unpretentious. Too bad the brewery tours don't start until July. I will definitely be back for it.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-21", "description": "If these guys served beer out of the depths of hell, they'd still deserve five stars because, yes, their beer is THAT good. I've been drinking Speakeasy and visiting the brewery since before they had a liquor license to sell beer for on-site consumption, and could only GIVE beer away. Those were the rough days that guys like me had to go through so that guys like you can enjoy 3 beers and a pint glass for $10!\n\nThe brewery is definitely chill. There's no froo froo tasting room setup, just a warehouse with lots of beer making \"stuff\", lots of cases of beer, lots of kegs, and a long counter top with several taps pouring all the Speakeasy favorites you see at the store/bars, plus lots of \"specialty\" brews that you'll most likely never see anywhere but here. Its beer heaven.\n\nIf you can get over to the brewery I can't imagine a better way to spend a nice Friday afternoon after a long week of work. If you CAN'T then at least go pick up a six pack of Big Daddy - you won't be sorry!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "These folks make my favorite beer. Big daddy and the coffee porter are my tops for the last year or so.", "author": "John O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-20", "description": "Simply the best off beat hidden secret in the Bay!! \n\nLocation: \nSpeakeasy is in the cuts of the ghetto of the city. You know your there when you see those giant eyes staring you down. Plenty of free parking. Was a Little leery of the sprinklers all around the torn down building next store's we enter a sigh of relief. Really cool big venue Would love it a little more localized but it was a great time, Super friendly staff. They are only open one day a week \"Happy Hour Friday's\" from I believe 4pm to 9:00pm. Now on Saturday too!!!! \n\nBeer: LOVE the beer here, yummy stuff go for the Big Daddy which is about 6.5% alcohol and the Double Daddy which about 9.5% alcohol. \n\nThey only take tokens, as you walk in you see a big sign for the prices three dollars a token which given you one pint or you can do the 2 tokens and a souvenirs glass for $10.00. which gives you a $5.00 cool speakeasy glass and two tokens which gives you two pints. \n\n\nPeople: a wide variety of people. I saw a good amount of hipsters and family which was surprising and some suits mixed in with the casuals \n\nService: Bartenders are suppose to be serious to go with the theme but they are really friendly. The bouncer Jesse and Ronnie are awesome. \n\nFood: They have popcorn and A Mexican food booth to help you wash down the cold tasty beverage. \n\n. \nPros: Cheap delicious beer which a great staff, big location free parking, no lines. They do a free tour in the beginning of the open happy hour, hour's \n\nCon's: a boom-box as music, need an option for water, I know I said it but I want a safe DD drive. Oh and it's cold so you need a jacket.", "author": "Raquel O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "Came here for my friend Randubious' birthday. Its located in the more Industrial part of the ghets, so if you're afraid of location, this place is pretty damn isolated/safe.\n\nThe inside is pretty awesome... its a warehouse stocked with boxes of packaged beer, and what I am assuming are 6-10k or larger fermentors... it pretty much looks like what I do at work, but done in a warehouse atmosphere.\n\nThey have a chip system for getting beers.... i believe its 1 chip for a pint, 4 chips to fill the growler. We opted for the 10 dollar deal which got us a souvenier glass and 2 tokens... that is a freaking DEAL right there! Apparently, this happens on Friday's every so often.\n\nThe staff is very friendly, and one of the keg masters helped me pick some beers despite them not having what I was looking for.\n\nFrom what I've had in the past and my friend from worked confirmed it, the porter can be inconsistence. We happened to get a really good batch of porters this round, so I was pleased. \n\nThey didn't have the DD on tap, which killed me because I love IPAs and Speakeasy's Double Daddy  is really really good. I opted for the Big Daddy and was pleased, but still really bummed.\n\nThe Tallulah Blond was good... nothing too striking, but then again I am a fan of ales, porters, IPAs, so something light doesn't really make my toes curl.\n\nThe beer at Speakeasy is good, but not the best I've had (huge fan of Stone and RR).  I still would give this place 4 stars but since they didn't have the Double Daddy, I docked it.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "Awesome place with amazing beer. Big for me to say because I'm not a beer drinker myself, but this is a good stuff! My boyfriend and I had such a good time here, the beer tenders and the patrons add to the overall awesome experience.  We will be back for sure!", "author": "Daina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "Nice, intimate tap room with a larger garage-like back area where they store their beer. Huge selection of their beers on tap!", "author": "Will D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-03", "description": "I was here in 2007 for the first time and since then, I've had couple more pints at this place that always always always ended up with lots of fun with my friends - meaning, we just got, let's say, socially tired :)\n\nThey have Open House every Friday from 4pm-8pm, I believe.\n\nI got only three things to say about this place:\n- GREAT BEER, that for some reason tastes way better than at any other bar I've ever had Speakeasy - this beer just kicks in right away..\n- $10 for 3pints?? which also means $10 to get buzzed!! what??\n- never-ending nonsense talk with my friends about everything and nothing at the same time..\n\nThis place has its own special vibe and something else that I can't really describe - it's all about great beer-friends-and something else!!\n\nPS: I highly recommend not to play piano after your fifth :)", "author": "Keli K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "Booked the free tour. Tyler is a funny and informative tour guide. Getting there wasn't too bad. Although your driving through the ghetto, then end up in an industrial area. Easy to get to. Tried the samplers of their brews....Man do they got flavor!!! Strong Porter tasted like it was described Drk. Chocolate & espresso. $1.50 for each samplers. It was pretty crowded, but it seemed like everyone stayed a bit, drank then headed out, other ppl came in to take there place. BUSY! The bartenders managed the crowd. Lots of places to sit is always a plus!! Great Experience!", "author": "john C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "Nice place to pre-game prior to hitting downtown or something. Cheap beers ($3 a pint) and some free-tours done sporadically throughout the evening. \n\nThey had some mexican food, mini-burritos and taquitos. Not sure if more food would've appeared as the evening wore down. \n\nBut nice big space to chill. A group of people brought their own food/snacks and just ate.", "author": "Ray J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "So much fun, had spent many a friday after work down the way gettin our weekends started right.  Good people and potent beer.  I really like the mix of folks too as it brought all walks of life in SF (students, professionals, families, dogs)  and it works!  Solid mexican food from the local taqueria off 3rd and sometimes live music.  A great place to unwind and let loose on Friday afternoons", "author": "Clark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "I mean...what more can be said of Katie and the crew at Speakeasy?! We were more than delightfully surprised by the atmosphere and beer here and can't wait to come back for more. If you're an IPA fan, try as many as you can...flights are easy to come by and the growlers are easy to love.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "What A Great Place To Enjoy Some Great Beer. Service Was Awesome, Every Beer Was Explained To Us, and It Was Some Of The Best Beer I've Had. A Must Visit For Hop-Heads.", "author": "Walt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "Speakeasy is the best beer in the bay!  Clay served us on a Wednesday afternoon. Super friendly guy, wonderful atmosphere, AMAZING prices.  $3 happy hour pints! I highly recommend this place to any micro enthusiast.", "author": "Keenan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-07", "description": "This is hard, the beer is great but its a manufacturing facility in the Bayview, its a cool place to see where they make GREAT beer but its a factory so lets get off this and rate what is real like places they serve more than just Prohibition on tap.\n\nPlease keep inviting me to the anniv parties please", "author": "G R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "I liked about 2/9 beers on their sampler. The rest just weren't my taste on that particular day. Sometimes you just have a craving for something particular. I'd say go, it's definitely worth the trek out there and they're all good beers. Pretty complex, tasty, potent, what more could you want? The place is really cozy and dark, I love it.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Hidden gem way out in Bayview. Easily accessible by muni 19 line from Russian Hill. Lots of space. Cheap drinks. Good snacks. Good times!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-13", "description": "ok - it all fits into place if you understand this is a brewery in an industrial warehouse, in an industrial park, in the BVHP.  No charm..nada.  It isn't the Route 29 of the craft beer world.\n\nBeers generally very good.  Crowd a bit iffy, split between \"ooh we're white people in the Bayview - aren't we rad..!\", and local stoners.\n\nAnd me.  Ahem.  I work two blocks away so it's my local, oh joy.\n\nOpens Friday at 4pm.  Three bucks a serving (bit less than a pint).\n\nCheck it out!  The brewery tour is pretty bleh (guide is killing a year before heading off to grad school and is way smarter than you'll ever be..) but your call.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-09", "description": "I can see this place being a great place for fans of craft brewery. The White Lightning was pretty good. \n\nThe only thing I did not understand about the tasting was that there were quite a number of small children running around--that's just strange to me for an environment like this.", "author": "Alyssa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "Hands down one of the greatest tap rooms I have ever been to. Great atmosphere...(I was greeted by a cat when I walked in). Classic music, friendly relaxed environment. My bartender Clay knew the beer better than the brewer himself, real personable guy. Go here!", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-03", "description": "Firkin Fridays at Speakeasy are such a fantastic experience. Show up, pay $10 for two beers and a take home pint glass. You also have the option of plastic cups (which are $3/beer). The space is packed with equipment so don't look for any fancy seating... or really any seating. \n\nWhat you will get is an incredibly knowledgeable staff, a tour of their set up, and pretty great beer. This coming from someone who isn't a huge beer drinker, either.", "author": "Half P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "A brewery turned into a bar on Friday nights. A very cool concept. Very cheap, tasty beer. It's always a sight coming here as this is the only place you will see mothers bringing their five year old children. popcorn is free to nibble as you get drunk with good company. a good place to come to unsettle the long work week and to start the weekend right", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "I came here for the 1st time for SF Beer Week and I am wondering what took me so long to make it here.  Friday from 4-8pm is when the brewery is opened to the public. Tours of the facility and beer making process are offered. I was loving the $3.00 a pint cost.  There is a private lot but there is also ample street parking. There is a stage for some musical entertainment. There are a few snacks also. I will be back on a warm Summer Friday... I can't wait.  Cheers for Beers!!", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "If you're looking for Fantastic Friday Fun, you've come to the right spot. Totally 5 stars for beer week, and even above average 4 for a normal Friday. The warehouse atmosphere is pretty bomb.\n\nI actually wasn't a huge Speakeasy fan before visiting the brewery. For some reason, the regulars, while tasty, fall somewhat short of my relatively high beer expectations. I'd take a Dogfishead 90 minute or Racer 5 any day over the Big Daddy.\n\nBuuut their specialty beers rock. What's better than one daddy? Clearly,  triple the daddies (okay I think technically it's called The Don, but I prefer triple daddy).  And the Old Godfather Barley wine is pretty rad. \n\nI pretty much try to steer clear of any beers under 10% when I go. \n\nUsually some form of live music, ranging from acceptable to awesome. The same goes for quick bite options.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-29", "description": "If you like good beer, you can't beat happy hour here from 4pm -9pm on Fri and Sat.  I sampled their Prohibition Ale and it was very tasty--a nice roasty, toast brew with a clean finish.  All pours are $3 a pint.  Beer doesn't get much fresher since they brew it on site.  You can buy bottles to go or get a growler. I liked the warehouse atmosphere too.", "author": "Shane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-29", "description": "Oh, how I love thee and all your glory. Great spot and so glad it's close to our house. Keep on keeping on.", "author": "F.f. Durst D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "Huge fan of this local brewery even more so now with the tap rooms . Had a wonderful time celebrating my graduation here (all planned by my lovely girlfriend). Friendly and knowledgeable staff and an ever growing list of brews.", "author": "Wei W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "I was drawn out by some friends to experience the warehouse in early 2012 on a rainy Friday night when beers used to be $3 per beer token. What a blast! Still love this place today. I feel like I come for the awesome smell of all the brews-a-brewin' when really, the beer is delicious!  I just wish I could find their same selections in my local markets. Today I enjoy the new lounge and informative friendly staff!  Always a great time.", "author": "Samantha Ray M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Came here on a Friday around 430 pm. Easy to find, cheap beer right from the source. Pretty casual, my boyfriend and I were dressed up, we felt a little out of place, but we were going to a nice bar in SF later. \n\nWe bought a case for about 40 bucks. Not a bad deal for good beer. And a little poster for our kitchen. Can't wait to come back again.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "This place reminded me of microbreweries in Texas, with its laid-back vibe and seemingly middle-of-nowhere location. While it's a bit too far to be a regular destination, I'll definitely be back for any special events. They have a great selection of brews and the taproom is a comfy place to enjoy a few.", "author": "Brett B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "It's a very nice and clean taproom. bartender was nice and atmosphere was great, I will be back!", "author": "Mary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "Cheap and tasty beer in the Bay view.  However, this is not a bar.  It is more like a warehouse filled with kegs wrapped in plastic bagg and a giant tank of beer sitting outside in the back.  They have a decent selection of beers for only $3/ full cup (or you can pay $10 for 2 beers and a glass pint to take home).  This pretty much summarize a good place to come hangout after work.  You get drinks at a happy hour price without having to show up early during the weekday.\n\nBesides beers, they also have some snacks such as tamales, burritos, and enchiladas for sale....not to mention free popcorn.\n\nSince this place is located in a not-so-hip area of the city and kind of way out there, parking is never going to be a problem even on a Friday evening/night.  In case you have way too much to drink to drive home safely, you can potentially leave your car here overnight and come back to get it on the next day with the car being intact and untouched.", "author": "Numrin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "My friends came from San Diego and wanted to check it out. Although we were touring the other side of the city, we made the long journey, and it was absolutely worth it. Even though there were fewer drafts available than usual after SF Beer week, there was still an impressive selection. Most of our group went with the Double Daddy (delicious), but one of my friends had the Belgian White IPA, which I also thought was  really good. There's no food here, but they make up for it with an intimate and interesting atmosphere. The speakeasy theme and decorations kept it cozy, split rooms kept the experience private (but there is a public area and bar if that's what you prefer), and board games kept us having a great time. Shout out to the giant Jenga game that we played to the ceiling in one game. The best part by far though was the hospitality shown to us by Ronnie (security) and John (the bartender). They made this a truly unforgettable experience. We will be back and this is a need \"must see\" on our list for visitors.", "author": "Elizabeth Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "This is a San Francisco gem. World class fresh beer, cool folks, and snacks from La Laguna Taqeria. When the weather is nice, as it often is in this side of town, you can freely hang in the outdoor entry area and chat as you sip the liquid gold they serve for $3 per cup. Easily accessible by cab or public transit on the T Third line if you don't feel like driving. Seems like all walks of life congregate here, from Noe Valley baby-stroller pushers, to blue collar types from the many warehouses in the area, to Dogpatch hipsters. Everyone can freely enjoy themselves in this comfortable spot to taste serious quality. We highly recommended this place for happy hour!!!", "author": "Jones E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "$3 for a beer on practically any evening, including a weekend. You can't beat that- I don't care what you say. It's pretty cool. The space is pretty basic and feels a lot like a standard warehouse, but you can stand around a barrel with some friends and enjoy this spot before heading around to other bars in the city.", "author": "Nathan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "place is pretty cool.\n\nthe night i went there was the friday before st pattys.\n\ngreeted by chill bouncers.\n\n$3 a chip...1 chip for 1 beer.\n\nthat night i hadnt eaten any dinner and for some reason ended up getting 8 double daddys, and 3 other ones.\n\ni most likely was \"that guy\" that was drunk.\n\nluckily my homie was randomly there and i guess i left with him.\n\nbetter that then walking from hunters point to downtown!!!\n\ni dont see myself coming here every friday.\n\nhowever i do intend on making many random visits.\n\noooh cant forget the cheap snacks and good tunes.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "Strong Beer, Laid Back, Free Popcorn! This is the way to enjoy life. \n\nThis place feels like a gem among the sketchy neighborhood.  We didn't feel scared walking from our car to the warehouse since we seemed to be in an office/industrial area with nobody on the streets.\n\nParking was easy.\n\nBring Cash - the card machine was broken the night we went and we had to venture out in bayview to get to an ATM. Also - you might want to eat a taquito or burrito from the table that had them for sale. \n\nHuge plus - it wasn't that crowded. I highly distaste bars and drinking establishments that I feel like a canned sardine or where I feel pressured to hurry up so somebody else can sit down and drink right after me. \n\nStanding room only - with a few random tables - but mostly for the folks who brought their young toddler kids! \n\nStrong Beer - eat something before you go if you're going to enjoy it. Especially if you're a light weight like me.  Two beers, no food for 6 hours, equals very tipsy evening and me falling asleep on the car right home. . Yeah for my husband restraining and being the DD! Thanks honey.", "author": "Tina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "Went brew tasting with my son, Andrew, while visiting the bay area. Speakeasy Ales and Lagers, a brewery,  opened at 4 PM and when we arrived there were a lot of people waiting to taste brew. Turns out they were have a Halloween Party (Friday preceeding Ghoul Day).  Pints are $3 and they were offering 2pints plus a logo'd pint glass for $10. \n\nReally enjoyed the Double Daddy and the Satchmo Stout.  Great people, great beer. Very enjoyable time.", "author": "Jay K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "Live music, $3 beers, and in the middle of a brewery and their equipment. It is in the outskirts of Hunters Point, but not near any of the scariness. Honestly, I have no other words for this place other than: THREE DOLLAR BEERS! Why would you rate them anything less?!", "author": "Anita W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-29", "description": "I am a believer, a kool-aid drinker - whatever you want to call it, I just love this place. I came in for the first time not really knowing what to expect and left one truly happy camper. Here is what you should do:\n\n1. Walk in when they open at 4pm sharp and get an awesome pint glass (to take home) and 2 beers for $10 (yes, that's right). \n\n2. Make sure you've got plenty of time to grab a pint and then get in on the 4pm tour where you can learn how they make all of their oh-so-wonderful beers. And they know what they're talking about, my chemist friend and I (a bioengineer) agreed.\n\n3. Time the tour to finish your pint and grab another. I suggest the Hunter's Point Porter (totally amazing but be sure to try the different porters they have aged, for example in a Zinfindel barrel).\n\n4. Wander the eclectic crowd...have some interesting conversations. \n\n5. Repeat steps 3 and 4 until you get kicked out at 8pm. Additional beers are only $3 (no, that is not a typo).\n\nAlso, be prepared that their beers have a pretty high alcohol content. from about 6-7% to the 13.8% Godfather. Pace yourself, and savor each sip of the wonderful tasty beer.", "author": "Amber P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "Their beer is good. If you go there to visit, don't expect some kind of fancy tap room or restaurant. You'll be getting your beer right from a keg hooked to a tap, you'll literally be in their warehouse next to pallets of beer, kegs and the actual vats. In that way it's cool - you can show up on a Friday and get to drink all the beer you want for $3 a pint (or 2 for $10 plus a free pint glass). \n\nI liked their probation and brown sugga beers, and my girlfriend loved their IPA and Double IPA (big daddy and double daddy). They only have about 10 or so beers at any time, since it's a smaller place, but they really cover the different kinds of beer and the different flavors. Most breweries I go to have a lot of the same type of beer, and focus on doing what they do. If you don't like that kind of beer, you won't like the brand. But Speak Easy doesn't do that - from their IPA's to their Wheat to the Brown Sugga, they run the beer gambit and do a pretty good job at it.\n\nIf you have never been and are a beer purest, I think you would enjoy checking out their brewery on Friday nights. I'm not a huge beer freak, but I enjoyed myself and the few pints of beer I got to enjoy - and the best part is I got a few hours of fun for less then $20!", "author": "Erik B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "I have to say, I had one of the radder dreams in my life after getting midday tanked on the Barley Wine some time ago. There was this dragon, see... and I was running along it's back as it sped along through the sky. As I ran, I had to dodge the spines which protruded from its stony skin and when it finally turned, hovering with such might that the sky seemed to shake, it stared at where I stood and steadily began to reach for me.\n\nI woke up drenched in sweat with the meanest case of painful stand-up wood. It was pretty amazing.", "author": "Roy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "I can't believe I live soo close to this place and JUST found out about it recently. Be warned that they brew some serious beer here and its not for the faint of heart. A good tip is to eat before you come because the Big Daddy IPA and the Double Daddy will get you drunk! \n\nIt's a cool place to go with a group of friends, a very relaxed environment, there isn't anywhere for you to sit so you just have to stand around and mingle! A unique thing about this place you have to purchase poker chips when you first walk in and trade off the poker chips for beer, 1 chip is 3 dollars and its good for one beer. I will definitely be back for more =)", "author": "Karena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Truthfully not the biggest beer drinker, but I am definitely working on it.  This was a great place to encourage my pursuit in liking beer.  My girlfriend and I decided to do the Yelp field trip event here and had a great time.  Though it was a little packed and chaotic at first it also seem to run together smoothly enough.  We got to try flights of beer (I fancied the wheat one the most)  and got a nice personal tour of the place.  The people working there definitely are knowledgeable and seem to share a genuine love for the product they create.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "Excellent beer. Place was really cool initially, but lately the times I've gone it seems to have gotten way trendier and snootier plus the stench of BO is rather off-putting. Would prefer to drink their delicious beer at a bar that has a better atmosphere.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-17", "description": "You have to love a brewery that opens up its warehouse on Friday nights to families and friends. For 10 bucks you get a pint glass and two tastes. You can buy some tamales from a local vendor if you get hungry but I prefer the free popcorn. \n\nI love a place that welcomes the community like this and everyone that works there is very friendly. Bring some cash for some swag - they have a good selection. After a couple of beer, a shirt printed with \"Who's Your Daddy?\" just makes sense...", "author": "Layla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-15", "description": "Another great bay area brewer doing what they do best -- brewing beer. The location is a bit out of the way and not that appealing from the outside, but once you get inside it's a great way to spend a Friday afternoon happy hour.\n\nWe got a private tour from Kush, who spent about an hour walking us around the operation -- we're total beer dorks so plenty of questions. Meanwhile, the Big Daddy fresh from the tap tasted perfect.\n\nThe crowd is a random mix of people, so anyone can feel right at home. It's certainly not a classy endeavor -- the only chairs looked like castoffs from my 3rd grade library and the music was a random hodgepodge of classic rock from someones iPod. Most importantly however is the beer -- and Speakeasy makes some FANTASTIC beer. Get some.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "This place was the third and final stop on my tour of SF breweries. Looks like a cool place to stop by on Fridays after work. They serve beers right inside the warehouse/production area and give really short but informative tours as well. I think they're only open to the public on Fridays from 4-9. \n\nIf you like to eat something with your beer...I suggest you bring your own food. When we were there, they had a popcorn machine. Good enough for me. I wouldn't recommend drinking their beers on an empty stomach...because as others have said...these beers will knock you on your ass!\n\nPaid 10bucks to get a souvenir pint glass and 2 tokens for 2 pours. Got the Double Daddy IPA which was very good and STRONG. I believe it's either 8 or 9% alc. Second beer was the White Lightning. Tasty.\n\nGlad I wasn't driving because I basically passed out in the car on my way back to our hotel!", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-18", "description": "It's pretty fun to go have some drinks in a brewery.  It's also pretty fun to have some beer creation with a very high alcohol content that leaves you giddy.  We went for the deal where you get two tokens and a glass for $10 or some amount like that.  Some of the beers I really didn't love but after I got a buzz on it mattered less how bitter they tasted.  We also went back for a few more tokens.  We didn't get to really take a brewery tour because they were done before we got there but we peeked around anyway.  This is a fun alternative to a bar, especially if you are showing around a tourist *ahem*.", "author": "Jess K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "was here for a friend's bday... awesome place they have lots of games including Giant Jenga", "author": "Astha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "Beers are good but I was here for the SF Fun cheap event.  What a fucking shit show.  Lines galore.  There is a line for getting in.  A line for getting tokens.  A line to get beer.  A line to scratch my fatty balls.  A line to find a space in the corner.   I was in line for 2 hours.  If I was smart like some tards that went to this thing I should have just cut in front of the beer line.  The event was very disorganized and straight up a shit show.  I would maybe go back on a normal day.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-09", "description": "When we became parents, Friday afternoon happy hour became a problem. Speakeasy solves the problem perfectly. Leave work a little early, grab the kiddie and Mrs., and head down to Evans Ave. There's plenty of kids and parents, as well as plenty of everyone else. \n\nAnd it goes without saying, the beer is terrific. As I write this I'm enjoying a growler of their India Black Ale, which I got at their Firkin Friday yesterday. It's probably one of my favorite beers of all time, and only available at the brewery.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "I promise you one of the happiest happy hours you will ever have!!!\n\nThis place is awesome!\n\nEvery Friday they open their doors for the weekly brewery tour + happy hour. \nThe tour is optional, so if you want you can just go to drink. But you can also drink on the tour of course.\nEvery Speakeasy beer from tap for a very reasonable price. But be aware, if you try 'em all you're head may hurt the next morning. \n\nI recommend: Grab all your friends and bring 'em to the Speakeasy brewery at 4pm on Friday! Every Friday!", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "What else could you expect from the makers of Big Daddy. Came on a Sunday, almost the whole place to myself! Cheap tasters @ 1.50 each.", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "Came here for Butchertown Hoedown, rather late but there was still plenty of food, beer, and people around. Having been drinking their beer since I converted from Coronas, it was nice to check out the actual brewery. Food trucks and live music were great, the lines for beer were never too long but... the line and state of portapotties at the end of the night - eeks!", "author": "Tatyana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "$3 quality beers. Love their IPA's. Very fun place to go and drink a few. Bring friends!", "author": "Mark K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "This place is nuts! It's a little far out of the way (I live downtown), but it was a lot of fun. Beers are super cheap and the atmosphere is very fun. It's literally located in the brewery and you're drinking $3 beer amidst cases and cases of it.  The security was very nice, although some of the clientele were less than desired (belligerent drunks...)", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-10", "description": "Great BEER! Crowd was a little dead but the beer was great. Disappointed they don't sell growlers but I will be back.", "author": "Jesse M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "You must be strong to drink this beer. Otherwise it will kick your ass....\n\n\n...but it will do so in a lovely warehouse with great happy hour prices and a tour to boot. Only on Fridays though so stop being such a pansy ass and practice your drinking in anticipation early in the week.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "How fun is it to drive out to Hunters Point and get loaded?\n\nLots!\n\nI do believe this is the only spot on earth that puts Double Daddy (the 9.5 percent APV shit-kicker) on draft and lets you double-fist said shit-kicker as you stumble around a working brewery, banging your fist on giant tuns, sticking your nose into jars of hops and asking all sorts of dumb questions. It's beer. It's good. Shut up and drink it.\n\nOf course, it does create a 7:45 p.m. conundrum, when they kick your shitfaced ass out onto Evans Ave. But that's your problem, not theirs.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-02", "description": "I don't give too many 5 star reviews, but Speakeasy deserves its high rating.\n\nThe first time I went here with friends on a foggy Autumn Friday night, we overshot where to turn (look for Keith Street and a pair of cartoon eyes on the side of a warehouse building), and kept driving on Evans... further into Hunter's Point.  I think we past a sign that actually said \"Welcome to Hunter's Point.\" The 'i' might have been dotted with a bullet hole.  And the further in we went, the more it looked like we were heading into Silent Hill or an abandoned Raccoon City.  Just make sure you know where this place is.\n\nYou purchase chips at the front, uh, desk that can be exchanged for the the beer inside.  $3/chip.  And the popcorn is free, so don't be afraid of grabbing some for yourself and friends.  There's other food options there, but I never tried any as I'm there for the beer.\n\nAs for the beers, they are nothing short of delicious and strong.  I'm usually a chatterbox, and I definitely was while I was there drinking there.  But 3 beers later (1st. Big Daddy, 2nd. White Lightning, and 3rd. Double Daddy)... and I was pretty much out for the night and ready to crash.  Even my friends were asking me why I was so unusually quiet.  Any beer that can make me shut up in awe = magic elixer.", "author": "Mercutio k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "Great beer, laid back atmosphere, set in the warehouse, with friendly staff , easy parking - what else could we ask? I tried their barrel aged porter for the first time and it was quite good. Unfortunately, I got there too late for the brewery tour. Oh well, maybe next time when I can sneak out of the office early enough.... \n\nFridays only and you do have to drive through no so happy neighborhood, but it is definitely worth the visit.\n\nBy the way, you can actually have Speakeasy beer in Tokyo (at Bulldog Pub in Ginza)!!!    Only in bottles, but still pretty amazing that somebody is distributing their beer in Japan..", "author": "Yuko K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-01", "description": "If beer is love then I've found my wet, belch-inducing soulmate and its name is Prohibition Ale. \nCame down on a beautiful Friday afternoon, hoping the crowd wasn't full of Mission dicks or monied douches.  Instead found what I now think of as \"my people\": hip, casual and beer-lovin'\nLove the chill warehouse vibe, the $1 snacks and the incredibly fresh beer.  But please bring back the Speakeasy growlers!", "author": "shane o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-06", "description": "Where else in this city can you get a pint of 10.5% beer for $3?  And then take that beer with you on a free brewery tour?  \n\nOk, Ok so maybe Anchor brewery gives out samples of their beers on their tour, but good luck getting a Friday reservation there.  \n\nThe catch (of course) is that Speakeasy is only open on Fridays from 4-8pm.  The tour starts around 4:15, but don't worry if you miss it, you'll still be able to enjoy all the $3 pints and free popcorn you want.", "author": "dan d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-25", "description": "Dear Speakeasy,\n\nIn the past year i have paid for your salaries, your advertising and half of your R&D dept. \n\nI have even helped to fund your \"Secret Anti Ninja Device\" that is located \"In an undisclosed location.\"\n\nAnd when you needed the help of myself and the Global Diabolical Shitstorm Inc, to fend off dinosaurs that had been genetically engineered to turn beer into the urine of a lhasa apso, i was there.\n\nAnd i have to admit, YOU were there when i drank alot of you and i looked in a mirror and said \"No....not tonight, youre way too fat for that dress.\" \n\nAnd your Big Daddy IPA was there for me the night i was playing Gran Turismo 4, and too many of you enabled me to simulate shitfacingly driving an 800hp Nissan Skyline through the streets of Tokyo at 226 mph.\n\nAnd finally, when no one said that time travel was possible, i drank 12 Double Daddies and in an instant, i was at my prom, crying about a rumor that my date was \"manually administrating\" a tweaker in a 1987 Dodge Caravan.\n\nAs i smash this empty bottle of Stella on the ground (well yeah, i drank the whole thing (well, 3..ok?...its still BEER) i curse the fact that nothing tastes as amazing as your IPA's.\n\nI salute you Speakeasy, for always being by my sides, and in my insides.\n\nLove, Your friend Mick.", "author": "Mick F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Seriously, why the hell are you in bayview??\n\nOh yeah...to go to speakeasy. It is pretty impossible to spot. Look for giant eyeballs on the side of a building. I swear, you really aren't making those up, no matter how much weed you've had. All the same, you'll pass it like 15 times if you aren't paying attention, so *pay attention* drunky.\n\nThe best part *ever* about this place?? $3 *good* beers. Wow. That totally makes it a superb happy hour place. The lamer parts are the lack of tables, and the total kick your ass out the door policy at a incredibly early 8PM...yeouch. Free popcorn, and cheap mediocre mexican food is available too when you realize that you really should have dropped some ballast before doing a ton of 7% beers. Bring out of towners here, they will be blown away that you know of some really sweet out of the way place, and you might even get laid.\n\nNo liquor (duh, its a brewery), but for this liquor guy, I've always left tanked enough for the beginning of a wild night out (just like I am right now...). Time to do some coug hunting...where the hell is my safari hat and whip?", "author": "Sean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "\"One of these things is not like the other\"\n\nThat's what me and the bf (Filipino girl/white guy) looked like in this Hunters Point/Bayview area.\n\nBut deep within this neighborhood, lies the Speakeasy brewery, which is only open to the public from 4-8 pm on Fridays.  We were scheduled to take a tour of the brewery, but missed it due to personal reasons.  \nBut we did get to enjoy a beer there. The beers are STRONG! (double daddy- about 9% alc.) and for $3/pint, what an awesome way to have a gangster party. \n\nAnd if you have the munchies they have a mini popcorn machine that you can get popcorn from.", "author": "Valerie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-09", "description": "Happy Hour in Heaven. Go to Speakeasy\n\nWhile a packed bar with no happy hour specials full of your colleagues and other FiDi folks along the water front might sound dreamy. Mine is a giant warehouse. Stacks of kegs and cases of beer provide the decor and seating. Rocking music, a good BBQ or tacos. And excellent prices on the best beer in the area. You know what? Stay at your bar.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-07", "description": "If you're looking for an excuse to visit the Bayview, this is it.  No doubt the employees here were looking for an excuse to stop working early on Friday, and so they open up the brewery (which is basically just a warehouse with some beer vats and lots of beer cases) to the public from 4-8.  Yes, you can walk around on your own and check out the bags of mystery ingredients (diatomaceous earth?) and the whiteboard keeping track of how much beer they made this week (now that's the job for me).\n\nAt the bar they had the usual beers for $2.50 a pint, plus the \"Street Sweeper\", a brewery-only, 10.5% ABV wheat beer that's really more of a barley wine.  As I was the DD, unfortunately I had to stop drinking after just one of those babies.  You can also just pick up any of the cases of beer laying around and buy it.  Oh, and there's also free popcorn, chips & salsa.  When the salsa bowl ran dry, we had the following exchange:\n\nMe: \"Hey, you guys got any more salsa?\"\nBartender: \"Yeah, there's a big jar of it in the fridge in the office over there.\"\n\nSo, I get to go into the office and fetch the salsa.  That pretty much sums up the DIY experience here.  Someday, when Speakeasy becomes a big, slick operation, with reservation-only tours that are a major tourist attraction in the trendy neighborhood of NoHuPo, remind me to bitch about how it used to be.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "Holy cow! Mapquest's directions almost made me shit in my pants! It told me to go past the brewery and around the neighborhood down the block. So, just a warning for dummies like me, make a right onto Keith St from Evans Ave! \nI really enjoyed being scared shitless then coming to calm down my nerves with fresh beer. I tried the White Lightning and Big Daddy. Both were good and the Big Daddy one was strong and weed tasting like. The Double Daddy one intimidates me but I'm planning to try it on my next visit along with the Prohibition Ale. Anyhow, this place is a pretty kickback place. There's some seating, but minimal. Everyone just stands around barrels chatting it up. There's also little kids running around. Quite interesting I must say.\nFYI, minimum for credit cards is $20 or something along those lines.", "author": "Lee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Good beer, friendly people, cool space, chill vibe = 5 stars", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "Tips for a successful date at the Speakeasy Brewery:\n\n1. Do not show up to this place expecting an actual eating/drinking establishment. This is a warehouse. With beer. With people who make beer. WIth people who enjoy drinking beer. With people who enjoy standing in warehouses drinking beer. Dress accordingly.\n\n2. Brush up on your washer playing skills. Hint to the uninformed: Much like the game of horseshoes, but with washers. Rules can be amazingly complicated for such a basic game.\n\n3. Brush up on your aim with said washers, as when thrown while drinking $2.50 microbrews, the pitch can be a bit wild and dangerous.\n\n4. Dogs like to chase washers because they are playful and excited about running around in a warehouse. Bring some sort of treat for the dogs to entice them to return the washers so you don't look like a complete ass in front of your date when chasing these playful suckers around the warehouse to retrieve your washer.\n\n5. Enlist the aid of a designated driver. When delicous beer is $2.50 and there are happy people, dates and dogs you can get carried away.\n\n6. Bring some type of food. Popcorn provided, but really, how impressed would your date be if you randomly pulled out some spectacular cupcakes that you baked specifically for the beer drinking occassion. Nothing says \"let's get it on later\" like beer and cupcakes, am I right?", "author": "Elissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Visited the Brewery thank to an sponsored Yelp Field trip. The trip included a free beer sample plus a guided tour of the brewery. The tour of the small brewery was well conducted and the guide very knowledgeable of the brewing process. As other reviewers have pointed out, they sell no food inside except that yesterday they had the Fogcutter food truck and a sandwich stand at the entrance. It was a mixed crowd considering the fact that it was a by invitation only event. Lots of hipster types which looked to me like Yelp employees. The beer is bought by tokens only and you have to do a line to buy them. They also sell six packs and growlers. Big Daddy without doubt, is their flagship beer and I would have love to buy a growler but yesterday they were not filling the growlers so I did not buy one. \nThanks to Yelp for the invitation but the drive from the Outer Richmond to the Bayview  is a complicated one and I can get their beers at my local market.", "author": "Frank B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "Found this place via Yelp! Amazing place. Microbrewery that opens thier warehouse on Friday nights to the public. Full on neighborhood vibe. Amazing IPAs. Stood out cause I was by myself and not dressed in black from head to toe. Ghetto neighborhood place my arse! Crowd was ok, but not the most welcoming.", "author": "Sig K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Fridays at Speakeasy should be a ritual in any young beer-lovers life.  Warning: come for the beer, not the environment.  This place is just a big open space with little seating.  Conveniently located close to UCSF if you want to pre-party before/after beer hour.  The Big Daddy is one of my favorite malty-IPAs.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "Smaller Speakeasy brewery.  3 dollars a beer or 10 bucks for 2 pints and keep the glass.  Located in the heart of the ghettos of SF.  Worth coming once but that's about it.", "author": "Allen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-13", "description": "I was kidnapped yesterday at 3:42PM by Erin R. and Brooke G. who had apparently come looking for me at 10:31PM the previous day. Unfortunately for them, they did not write down the directions or address for their planned destination and we drove around aimlessly in Hunter's Point (aghhhh!!! it wasn't even on the tourists map we had in the car!) This however worked out perfectly because we arrived just in time for Speakeasy's happy hour. $10 for 3 pints of beer and a Speakeasy pint glass! Sweet. The beer was excellent. Between 4 girls I managed to try them all and I really can't decide what was my favorite although the Double Daddy did knock me on my ass. Double the hops and double the alcohol content. Note: I still have my 3rd token. \n\nMy outing at the Speakeasy turned out to be a huge success. We met some guys there that arrived in the most ridiculous contraption I have ever seen in my life. (Pictures will be posted as soon as I locate my camera.) Erin R. described it as a surrey. But think of it as a 4 person bicycle with a central steering wheel and cup holders. We rode this thing down Evans and somehow managed to not get hit by a bus, involved in a drive-by shooting, or pulled over for a DUI. WHew.  I think I was screaming the entire way but it was quite a ride.", "author": "Lauren Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "So we checked out this joint this Saturday, just the girls. Located in a warehouse.People inside and out. We walked up and it looks like a beer lovers paradise, that is if your willing to stand in line for ....along time to get tokens, first. Then gotta wait in another long line to get your beer ( Scarface was pretty good if you like real dark) But have no fear there is a band playing and lots of cool people to spark interesting conversations with. You can't help but mingle and drink which always makes for a good time. There is a food truck, but only one. Its completely laid back and chill so a good way to spend an early evening with hours from 4-9pm. I had a good time but once is enough for me.", "author": "shirley c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-17", "description": "Warning - If you do not like hop-py beer, this is not the place for you.\n\nA friend of mine was visiting from the UK.  He's a microbrew fan, and has enjoyed Magnolia's IPA for several years now.  Thankfully, Yelpers pulled through and told me about a few other possibilities in SF for us to enjoy new beers.\n\nArrived at Speakeasy on Friday around 6:30 pm.  Happy hour was going strong - looked like a bunch of regulars.  I didn't realize that the happy hour actually happens INSIDE the brewery!!  Great deals on beer (3 pints for $10 including glass worked well for my friend).  While I don't care for hop-py beer (even the pale ale was quite hop-py), my friend was in hops heaven!!  He loved Big Daddy and even tried the Double Daddy (9.5%) and stated it was the first beer with that percentage of alcohol that he could actually enjoy drinking.\n\nThe people who worked there were very friendly and it was a great, casual atmosphere.  We walked ourselves around the brewery and I even tinkered at the piano for a bit.\n\nDefinitely a place to visit if you're into this type of beer.  It is a bit \"out there\" in terms of where it's located in San Francisco.  But don't let the Hunters Point/Bayview region listing scare you.  This area is very industrial and seems quite safe!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "Hey it's me the Taco Chick!\n I'm here every Friday selling Chicken and Potato taquitos.  If you guys like the food here, you should definitely come check out our restaurant La Laguna on 3rd and Fairfax.  Tell them I sent you!\nSpeak Easy is the perfect place to hang out and not worry about any type of drama.  Straight chill, have a good time and meet some really cool and interesting people.  I'm not a beer drinker but damn they have good beer.  White Lighting!!!", "author": "Ayde C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "I love speakeasy beer and their events are a lot of fun.\n\nHowever, I am giving them 1 star on principle because they don't belong in the top 5 night life options on yelp, seeing as how they are not open to the public 99% of nights.\n\nThey are open on Fridays from 4-8 and other infrequent special occasions. I've never had a bad Speakeasy beer, and the brewery is well worth a visit (especially at one of their anniversary parties), but it is miscategorized.\n\nChange the categorization to reflect the fact that Speakeasy is not a place to visit for \"nightlife\" and I will adjust my rating accordingly.\n\nEdit 11/27/08:\n\nI can now give Speakeasy 5 stars with a clean conscience, knowing that they are no longer bogarting a coveted spot at the top of the SF nightlife listings! Really, Speakeasy produces some of the best beer in SF. You can't go wrong with $3 pints straight from the source!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-06", "description": "Good clean fun for the whole family.\nFriday's happy hour is a such a good deal and a great chance to hang out after the work week.  There were lots of kids there too, and I appreciate places where parents can relax that also welcome kids.\nBring a coat if you are coming out during the winter months since it's basically just a brewery warehouse with a big open door.\nThey'll fill any growler for you too.\nYum!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "Most of their lighter beer is more bitter than I tend to like it, but the black, and the maibock, and the stout!  Oh, the sweet, sweet stout.  godDAMN that shit is good.  And yet, you refuse to bottle it!  You bastards!\nOh, and they throw a mighty fine party too.", "author": "Don H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "Great beer! Pretty awesome place to come to after work on Friday for a cheap beer and some snacks.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "Got a little sunburned sitting on the curb but it was a fine event that late Saturday in August and the pulled pork sandwich was divine!", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "Awesome place for amazing beer for cheap.  Wish it was open later.  Free popcorn is helpful after even one Double Daddy.\n\nDrinks: 5/5\nAmbiance: 4/5\nService: 4/5", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "This place is awesome. Good beer, good folks, good food. what more can you ask for. every friday from 4-9 they sell $3 pints or 2 pints and glass you get to keep for $10. and every last friday of the month, on top of all the great beers they already serve, they put out new ones they are trying or are about to release, they have other vendors there serving food, and they also have live music. Definitely one of my favorite spots to hang out or at least start your night at.", "author": "Mark Shane B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-23", "description": "$5 each (thats 2+ pints) and my friends and I were all stumbling around wondering who was going to drive home. \n\nSpeakeasy provides the awesome beer, some fun toss the ring into the hole games, tours if you call ahead of time or ask nicely, a piano, music playing over the loud speaker, some outside space either in front or out back next to the trash cans...\n\nTo improve your experience - have a designated driver, cabby, bus fair (T muni line, 19 and 44 bus will get you there)\n\nBring some pizza or burritos or something with you - they'll have popcorn or cookies out sometimes but bringing some food will make all the other drunkards at the joint mighty jealous.", "author": "Inna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-20", "description": "Great spot to check out at least once and probably more.  It's basically a warehouse with beers available for your consumption.  \n\nI went with a friend last week and the night we went, it was actually a benefit party so we paid a $10 donation and they provided food with the donation.  Some Hot Links, salad, coleslaw, chips and cookies.  And of course, they always have the free popcorn that I've been hearing about.  \n\nFor the drinks, since me and friend were newbies, we went with the combo deal.  $10 for 3 beers and you get to keep the Beer Glass with the Speakeasy Logo.  I think the next 3 times I come here, I will get that deal so I can get a set of 4 glasses.  LOL...  After that, I will probably go with their regular pint price, which is $2.50 per beer.   \n\nSince we didn't come here on a regular happy hour night, I am not sure if my next experience might be different here.  Since it was a benefit night, they actually had live music, some people were giving dancing lessons and the crowd seemed to be a little older.  Then again, since I have never been here, I'm not sure if the age demographics that night is normal for them.  \n\nDefinitely will be back and bring more friends.  One thing that was cool is that we met one of the workers there and he was able to tell us a little more about them and also some other great breweries in the Bay Area.  So we actually received a Free Education on Beers, brewmaking process, etc. etc. etc.  You could tell he loved his job.  Beer seemed to be his passion!  Very Nice!  Getting to work in a place that is your passion.  \n\nAnyhow, the brewery started in 1997 so they had their 10 Year Anniversary recently.  In terms of these Friday Happy Hours, they've been doing it for almost 2 years.  Thanks for all the info Mike!  You helped enhance the Happy Hour experience for me and my friend.  \n\nBut what really enhanced it was that Double Daddy IPA.  Wooweeeee.....  After that, I was a goner!  I think it was a 9.5 on the Beer Richter Scale.    \n\nSo the only thing was that there wasn't really any seating or bar tables to set your drinks on.  Or very limited.  Not sure if they bring out more chairs and tables on regular nights.  But then again, this IS a warehouse so maybe it should just stay the way it is to keep the ambiance appropriate for its surroundings.\n\nHAPPY HOUR DEETS: \n$2.50 pint\n$10 combo deal = 3 pints + Keep the souvenair Speakeasy glass", "author": "Mark W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-14", "description": "Why the legendary 5 stars of booyahness?\n\nWell...\n\nBecause my poker buddies Steve Bruce and his bro Mike own the place (actually I dunno if Mike does... but Steve does for sure).\n\nWhat? Not good enuff for you? Losing credibility am I?! Well you can take that credibility and shove it up your *censor*\n\nFine fine fine.\n\nGood beer. Great IPA. Gets you drunk real fast. Support local breweries!!!!!!!!!!!! Down with the MAN!!!!! Now go read the other reviewers about Speakeasy Ales & Lagers, and they'll tell you everything you need to know about why this place gets the 5-star of booyahness. Nuff said.\n\nNegatives:\nIt's seriously, in the middle of BFE.", "author": "Seiji N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "I made it for the tour this evening, and I'm glad I did. The employees are friendly, the vibe is positive and the beer is really good. I was very impressed with their Scarface Imperial Stout. It had just the right amount of sweetness, very smooth and creamy texture and great color, job well done fella's! I did the tour which was really cool. If anyone is interested in seeing how beer becomes beer, or is a beginning homebrewer, you should definitely do the tour. The brewmater, Kush, gave the tour, and not only was he a good guide, but he didn't mind hanging out afterwards to talk a little bit more about the company and beer making. It was a very cool thing for him to do. So to sum it up, good beer+ good people= good times. Thanks for the fun Friday Speakeasy!", "author": "Jason A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-13", "description": "Speakeasy is definitely the place to be for happy hour on Friday evenings.  But, I don't think everyone knows that yet.  There was quite a few people there, but it wasn't packed.  The warehouse/brewery has a good set-up for going to hang out with friends and drink a few beers.  It has a very laid back atmosphere.  The beer was very tasty and the price for the beer was really good.  $10 for 3 beers and a glass to keep?!  Awesome!  Even if you don't want 3 beers and a glass, the prices are still good.  If you're hungry, they have yummy tacos with spicy salsa available.  Beer and tacos?  Could it get more perfect?!\n\nI will definitely be spending more Fridays here.  Highly recommended!", "author": "TK B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Great spot to meet up with friends after work or what have you. Prices are great and l couldn't complain about service. Just more places to sit would be cool. Parking was easy too. Have fun! Its worth it.", "author": "Zachery H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "This place was great!  We went on friday night.  The beer was awesome and chep, they had good mexican food and we got a brewery tour.  Very impressed.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-26", "description": "First off, I have to admit, I've been a Speakeasy Mobster and shareholder since the late 1990s - so I am a little biased. As much as I love the current lineup of bottled beers: Big Daddy IPA, Prohibition Ale, Double Daddy Imperial IPA and the Untouchable Pale Ale (and the elusive Godfather Barleywine), it's the keg-only and the dearly departed brews that made this brewery tops in my book.\r\n\r\nKeg Only:\r\nThe Bootlegger Black Lager holds up to the classic Sapporo Black and the archetype of the style: Kostritzer Schwartzbier. Malty and a little sweet, but also refreshing. There's a reason they're commonly called black pilsners.\r\n\r\nThe Shylock Maibock is also a great example of a German spring bock beer. Strong but balanced with a sweet malty character.\r\n\r\nEven the Satchmo Stout, which should be bottled as there is a real lack of good local stouts, is a fantastic beer... nice and roasty and proof that stouts can aspire to be more than a Guinness.\r\n\r\nHowever, the three best, most unique beers are ones that are unfortunately not being made any more.\r\n\r\nWhite Lightning - their attempt at a berliner weisse, a sour beer that had undergone lactic fermentation. Even though it was a pain to produce and a bigger pain to clean out of the tanks and pipes, it was an amazing beer when stored and served properly (the trick was to make sure some live yeast made it into the glass like with a Belgian beer)\r\n\r\nCommon Beer - The San Francisco Common Beer was quite possibly the best beer produced on the west coast when it came to pairing with food, and it's a shame that restaurants all throughout the Bay Area didn't stock it. Maybe it was the name, or maybe the restaurant industry lacked the vision to pair a domestic beer with food the way they do now with Belgian brews. Either way, it is sorely missed.\r\n\r\nFinally, the best of the bunch: Untouchable Lager - a perfect Maerzen beer, and possibly the best California-made lager I have ever had. This beer was fantastic, but unfortunately suffered in sales because the local market is biased towards ales.\r\n\r\nThe city is much better for having Speakeasy supplying its bars with fresh, local brew.", "author": "Avery G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-25", "description": "To the makers of Speakeasy....\n\nDamn you* for such tasty ales. Damn you for having a lovely chill happy hour on Friday (from 4p to 8p) where the pints are only $2.50. Damn you and your anniversary party where I was out for the count the second my drunken head hit the pillow at home (at about 6pm). Damn you for assuming that since I had to wait for 2 keg changes in 2 rounds I didn't have to pay for the 2nd round. Damn you for being so cordial. Damn you for believing in quality. Damn you for keeping it local. Damn you for having such cool logos. Damn you for being so farkin' convenient to the 19 line and Muni T line, which are accessible in either minutes or steps from my place. Last Friday, damn you, I was so blissfully unaware of my surroundings after I left you, all I can tell you for certain is that I went to Giants game and I ate a cheesesteak. I had to check the news for the actual score and highlights. \n\nAnd damn you for making me love you.\n\n*-By the way, all those damn yous can be replaced with thank yous", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-12", "description": "If you have a personal chauffeur, Speakeasy is the place to be for Friday Happy Hour.  Located in Bayview- where even the cabs don't venture- you're unlikely to find transportation there and back (assuming you live in the city).  Driving is out of the question as well.  Why go to a brewery and have to worry about drinking responsibly? \nThe best thing about going to Speakeasy is the absolute unstructured, laissez-faire attitude of the place.  The tour starts, eh, whenever, and lasts until, eh, whenever.  Cheap, quality beer, trademark bar games and some grub.  \nOh, and be sure to bring some dog treats.  I guarantee you'll make a new friend.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-05", "description": "I have never been more wasted off happy hour in my life . . . FIVE STARS \n\nThe beer is great-- I loved the IPA and the Porter especially. Of course no one remembers to take their free 'Speakeasy\" beer glasses home because after 4 of these suckers, you can barely remember your name.\n\nIf you take the muni T on a Friday, follow the line of confused twentysomethings toting shoulder bags and wearing corduroy pants  . . . they are definitely not locals and are making the pilgrimage all the way across bayview in pursuit of good beer. \n\nThe only slight confusion to this otherwise beer-mecca experience, was the abundance of small children in the warehouse. Maybe we unwitting came on \"pre-school Friday\" (or more likely, these are friends/family of the brewery staff), but in general I prefer not to intoxicate myself whilst under the intense and watchful gaze of a 3 year-old child.  Ah well.", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "San Francisco's pride.  The beer here is great!  Blows Anchor Steam outta the water.   Double Daddy is twice as strong as Big Daddy but also twice the flavor in my opinion.  \n\nIt's a warehouse that has a nice rotation of Friday events.  Mellow, easy going, and diverse mix of San Franciscans in the know are here.  Fun crowd, I hope it stays that way.  I hesitate to write a review to keep this one a secret.  Oh well, if you suck please don't come here.  Did I mention there's Free popcorn!?", "author": "Izzy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-26", "description": "I've been literally attending \"the Speakeasy\" every Friday...well before Thanksgiving..the holidays require me to be out of town a lot.Great beer and great people!! My coworkers invited me to one of their open house/happy hour things about 3 months ago and once i stepped inside and had a taste of their wonderful beer I knew I'd becoming back many Fridays there after. A pint of one of their flavorful ales or lagers is a cheap $2.50. And if you dare to drink Double Daddy's all night (or day since happy is from 4-8) then prepare to spend only about $5-$10 to get wasted. \n\nI've never had a dull time at the Speakeasy but keep in mind, it's just a warehouse with a bunch of packaged kegs. If you're lucky you'll find an empty seat. \n\nOverall, Speakeasy is fantastic! \n\nJoe is awesome!!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "Yes, the white lightning is my beer of choice.  The others are really strong and they will get you drunk after 3 pints!  But hey, that's only $10!   I was pretty disappointed with the taquitos as I expected tacos.  They definitely need more food, and longer hours!!\n\nBTW, do not be scared of the neighborhood.  It's nothing you'd expect once you're inside.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-07", "description": "You immediately have the feeling you're crashing a party you weren't invited too.  There wasn't a ton of people, no chairs for sitting, and very mixed ages.\n\nNormally you'd think these things wouldn't make a 5 star review.  But within the first 2 minutes of being there we felt at ease.  We ordered our cheap beer deal (Don't remember the numbers I didn't pay).  They gave us our chips to use (3 each) when ordering our beers. (I thought that was cute.)  The guys that work here are so sweet.  They answer any questions about their beer or if it's your first time there.\n\nThey have a guy in the back BBQing the most amazing burgers and free popcorn.  There was a band playing and a cute dog named Kaya running around.  We had a great experience, would definately go back.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "My introduction to Speakeasy:\n\nAfter looking at the first apartment I was going to rent in San Francisco, I headed to Chow on Church Street and asked the bartender what local beer I should have.\n\n\"Speakeasy Prohibition Ale\" he answered. \"Its local and its gooood.\"\n\nI followed his advice, and loved the beer. The same bartender told me to take the apartment I had just seen (around the corner from Chow) and I did that too. Come to think of it, he was the Yoda of bartenders, as both the apartment and the beer have served me well.\n\nFast forward almost 8 years - on hubby's convincing, we headed to a Speakeasy party on a sunny Saturday afternoon. $2 beers (including the mind-altering 10.5% beer not available in stores and a killer porter), punk surf bands, and an amalgamation of scooter enthusiasts not seen this side of Italy. \n\nNot only did I enter the scooter contest as 2nd in command, I was invited to join an all-female scooter club! The locals are friendly here, people....head to a party, drink lots of beer, and enjoy.\n\nAnd designate a driver because the 44 doesn't seem to come that often!", "author": "Priya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Dope spot, reminds me of getting to the Pound back in the day. They are now doing every Friday & Saturdays at the brewery. If you like craft beer & haven't been here, you should.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "Who doesn't love drinking in a brewery? Mike & Joey serve the six Speakeasy beers  (Prohibition, Big Daddy, Double Daddy, Hunter's Point Porter, White Lightning & Untouchable) on tap every Friday from 4:00-8:00. Pints are $2.50 and taste so fresh!! \n\nThey used to put out a food spread but recently they've started selling tamales, taquitos and the like. They also have free popcorn.\n\nThis is a brewery in a warehouse, so don't expect fancy decor and plush seating. You will however witness a small batch stainless steel brewing facility where you can talk with the brew master (Mike).\n\nFridays at Speakeasy draw a very diverse crowd: suits, union workers, hipsters, bums and everything in between. As a bonus everyone seems to get along.\n\nThere are smoking areas in the front and back.\n\nThis is an excellent venue to kick start your Friday evening festivities", "author": "Peter O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Wow.  This place is awesome!  Scarface 9.5% solid.  Double daddy 8.5% solid.  Brewery in the back with food stations, solid.  Back space is good for big parties (which is what I came for).  Staff is super nice and easy on the eyes.  Parking lot with tons of easy parking on a Friday night.  Can I give this place 6 stars?", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "A fantastic Friday Happy Hour.  Great beer at a reasonable price and an astonishing mix of people.  Don't go there for the food because it is not always available.  (Bring your own if you wish.)  The crowd and the beer can not be beat.  Joe, the usual bartender, is a riot.  People like him are one of the reasons that I love SF.\nDon't expect anything fancy.  This is drinking great local brew with down-to-earth people in a warehouse brewery.  There are limited seats and often no music.  They used to have great bands but apparently they got lazy booking them.  They are only open Friday, 4 to 8.", "author": "Larry W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "I love that it is in the warehouse, its a totally different feel. The beers are delicious, even if I only got to try the blonde ale because I was driving. I'm definitely going to go back and would recommend it to any of my crew.", "author": "Morgan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "Always loved Prohibition Ale and that led me to take the brewery tour.  It was cool.  Had some beer, got a glass and the tour was pretty damn good.  The brewer who led it had some cool insight and reaffirmed why mass produced beers are usually bland.  The actual warehouse was neat and it was easy to find and park.  Glad to have had to opportunity to check it out.", "author": "Sin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "Neat, cool, wow. Free parking..that is all I need to say. It is definitely a different type of venue given are literally in the brewery but it makes an unique atmosphere.", "author": "Stephen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-13", "description": "The music was insanely loud and the line to get a beer was extremely long, and almost put me over the top of having a bad night, until I got a pint of beer and 2 taquitos in me, then it was half tolerable.  I think they were changing out kegs, so it backed the line way up, but there's no excuse for having music that loud.  Seriously, I'm not that old, 28, but I felt like my mom must have when I was in high school blasting my music and yelling \"TURN THAT CRAP DOWN.\"  Oh no, I'm getting old aren't I?\nBeers $2.50, 3 beers and you keep the glass $10, Taquitos $1", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-20", "description": "Thank you, Speakeasy, for your wonderful 9th anniversary party.  We drank $2 beers ALL day.  The beer was delicious, the day was beautiful, and the people were friendly.  Excellent!  \n\nThe bootlegger black lager is yummy and a little lower in alcohol (good for an all day event).  The Double Daddy (9.5%) kicks your butt.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "Its hard to believe  the last 10 years  went  by so fast..... but good  beer has kept me socially lubricated  and happy.\n\nCheers to Speakeasy  for  making  excellent  malt beverages  and keeping their  eyes  on me  at all times.", "author": "dan s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "How can you go wrong with fresh/great beer on tap with free popcorn? My dad took me here awhile back and i had no idea what I was getting into. I keep hearing people mention about the area, I mean dont get me wrong its not exactly the best surrounding area, but once your inside, your worries get less and less with each sip. They have my favorite beer, the double daddy! Great beer of choice to prime the pump. They offer live music from time to time and definitely a great bargain for your buck with the poker chips being your currency. There is also a little mexican food stand that looks pretty good, but I have yet to try. For a place that's tucked away and only open on the most crucial day of the week (fridays) you cant go wrong after a long work week to unwind with a couple of great beers. Highly recommend this place and definitely will be coming back.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-07", "description": "this place is in the most RANDOM area...but my friend always goes there practically every friday so i decided to give it a try...\n\nthis place is definetely a brewary...it reeked of beer as soon as i walked in and all you see are giant kegs everywhere...but i must say say the beer was pretty cheap and were not as bad as i thought it would be seeing how im not really a fan of ales...\n\nbut 2 beers later and your night is definetely a big blurr", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-05", "description": "I just went to a bbq here the other day, and asked if I could find it again I would have to say no. It is far out there, but kind of like a little oasis on a back road. \nI think my favorite beer was Prohibition. There were some of the cutest kids dancing to the live music, i especially appreciated the boy dressed as Peter Pan. They were bringing the finest of interpretative dance to the world. \nHopefully these bbq's happen regularly, as we had a blast.", "author": "Erin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-22", "description": "Jenny K., thank you for the introduction to this great place!\n\nI was a bit disappointed with the mis-advertisement of tacos and they only had taquitos ($1) and veggie burritos ($3) only but I'll let that slide because 3 pints for $10 is a deal I'm enjoying. The pale ale \"White Lighting\" is the way I go down.....yea, I'm weak like that.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-24", "description": "The beer is f*ckin awesome.  Prohibition has always been one of my\nfavorites as well as Big Daddy. I cruised out to the brewery on a Friday and got a chance to try the Double Daddy for the first time. This beer is definitely not for amatuers.  After a couple of these and we were all much drunker than expected. The guys who work there seemed cool, one of the assistant brewers gave us a  tour and explained the brewing process. He probably was ready to go home because it was Friday around 5 but he stuck around and didn't seem tomind. There is no food if that is what you are expecting. Just a big wharehouse that has some awesome cheap beer. I will definitely be back!", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "If you have a chance, definitely check this place out.  It's a funky, down-to-earth brewery, with a little \"backyard\" and plenty of parking.\n\nAs another reviewer mentioned, they have happy hour on Friday afternoons, and sometimes they have other events.  Bring earplugs though -- when they have live music, the \"acoustics\" of the brewery mean it's going to be LOUD.\n\nGreat beer, though!", "author": "Doublejack X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "I love it!  \n\nIf you've never been there, here is map: http://www.indiabasin.org/map.htm\n\nYou can see them at the top right (off Evans Ave) before the closed PG&E power plant).\n\nThey rock!", "author": "Tori F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "when i worked down the road from the speakeasy, this was our friday end of the week release.\n\n$3 beers, free popcorn, mexican food from the local taqueria, all while you drink in amongst the vats in the brewery.\n\nbabies, dogs, and all walks of life hang out here, and let their hair down on fridays @ the speakeasy.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "I've been here a couple times and this place hasn't failed yet! The beer is great and its reasonably priced for a night out (or start of) in the city.  The crowd is usually pretty friendly and low key but there's always a good turn out. On New Years Eve they had a live band playing, but I'm not sure that they do that very often. I usually drink the prohibition or the double daddy. Double daddy is tasty but can get crazy for anyone with a low tolerance since its 9.5%. You are literally in the warehouse, so don't expect a super fancy experience. Oh and free popcorn!", "author": "lerman m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-17", "description": "My buddy works at the factory, and i applaud his attempts at securing outside friendship by supplying free big daddy at their band practices while fellow cavorts that we didn't know prior to the popping of the top. \nTheir product is a symphony of spices, this is true. They get docked a star for stopping said band from performing during the friday 4-8 slot, because \"the easy listening lush brigade\" just wasn't in the mood for some molten goof-metal hijinks. When i grab a 16 ounce of double daddy now, i get a little bitter before i drink the bitter. A few shards of disgust the way down the gullet, nothing too detrimental.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "Awesome Beers. Love the Big Daddy. Love the Double Daddy. Love the new one - what's it called, 'white lightening\" or something like that. Don't really love prohibition, but everyone else does, so it can have thumbs up in my book too. \n\nLove the happy hour, love the staff, love that they sometimes give me free beers. Love that they give me tours over and over of the brewery, because I love brewery tours.\n\nSpeakeasy is the best.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "Simple, unpretentious, friendly layout.  You will pay less for better beer and receive it faster than any other establishment you can think of.  Seriously.\n\nFor fans of lighter beers, try White Lightning (similar to Hoegarden).\n\nFor fans of darker beers, try Hunters Point Porter (similar to Guinness).\n\nShit, for $2.50 a pop, try them all.  \n\nNext assignment: start making excuses as to why you have so many speakeasy pint glasses and poker chips laying haphazardly around your house along with one for that tattoo of \"Bubba\" in a heart you don't quite remember getting.", "author": "Pickles T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "Just tes..tasted \"The Untouchables\" ...\"Un Believable\".  You nailed it with this one.  Cheers.", "author": "Bill R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "Friday Happy Hour = no frills, cheap beer, with \"regular\" folks in the crowd.  If that's your thing, then come on down (but don't bring your friends... we like it when it's not too busy.)\n\nThey basically set up a bar on the loading dock and people hang out and sample the wares.  For $10, you get a Speakeasy pint glass and 3 drink chips.  Want more than three drinks--they're $2.50 after that.  Not a bad deal at all (especially if your Ikea glassware collection needs sprucing).  Meanwhile, the crowd offers a bunch of mostly unpretentious folks loitering with beer in hand.  It's a good, mellow start to your Friday night.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-21", "description": "Words cannot describe my love for this place. My favorite happy hour anywhere. Yummy beer. A nice crowd. Just close enough to Hard Knox for dinner. Life does not get much better.", "author": "Cameron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "I can't believe I haven't reviewed this place yet, as they were for a while probably brewery I had visited the most. I've been on the tour here 2 or 3 times, and each time I learn something new about the process. I've had a great time at the Friday open-houses and was thrilled to see them trot out experimental and new brews beyond the usual (and super strong) regular releases. And I'm sad to say that I'll be missing this year's anniversary party, as that's become a SF tradition for me as well. Check it out if you get a chance, bring a DD or take the T-line.", "author": "alejandro p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-06", "description": "I've actually written this review a couple of times and then deleted it because I feel like I need to put in my two cents but want to be diplomatic about it. I am not a fan of their beer but In this case I don't want my opinion to influence anyone. This is an independent brewer and I like to support this kind of endeavor. I suggest you get down to one of their happy hours and try them out for yourself. You might try to limit yourself to 2/3 of the amount of beer you usually drink because this stuff is scarily strong; I honestly think they under rate the ABV.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "Sitting in the Speakeasy warehouse sipping a fresh Double Daddy out of a plastic cup for $3 on a Friday afternoon with popcorn and friends is well worth the trek to SF\"s shadiest neighborhood.  If only they had better seating and more food this would be heaven in a warehouse.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-16", "description": "Lived in SF for nearly 4 years, and this was my first experience of Bayview/HuntersPoint. And hey, it was a good one!  I didn't get shot or worse. Coworkers went down for the Friday night happy hour, and I tried a few of their beers (including the Big Daddy). No souvenir glass though last night (3 beer chips for $9). I like that you're just hanging out in the middle of the warehouse/brewery.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-17", "description": "finally came here for my birthday!  $3 beers at one of my fave breweries.  live music, southern sandwich serving up some sweet tea and brisket sandwiches.  a little bit of eye candy, and a lot of good times.  probably one of the best things to do on a friday afternoon.  ps, they're open saturday afternoons now, too.  i saw a flier and then felt like my day was less special. hah i'm crazy.", "author": "jennifer l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-22", "description": "Before you come out here, let it be known that it's out in the ozarks of 3rd Street! Any farther, I would've freaked out from being too far into Hunter's Point. You keep driving thinking that you've missed it, but once you see the \"eye\" on the warehouse, you've hit the jackpot. Open only on Fridays for happy hour and for the awesome price of $3 a beer, you can try all the goodness that Speakeasy has to offer in their shipping warehouse. A little unorthodox, I know, but after having gone it's a great time and one of the more interesting and cheaper happy hour deals in SF. Hungry? No problem. They serve popcorn. But if you're want something a little more solid, they serve taquitos or burritos to snack on.  I suggest knowing who's going to drive in advance. These beers are tasty hard hitters.", "author": "Grace V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "$3 beers! Speakeasy, you are the reason I look forward to Fridays!  I love the Hunter's Point Porter - last week I found out a limited edition is available that was aged in oak barrels - yummy!", "author": "Erin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-04", "description": "There beers are easily available throughout most of the city...and the double daddy is simply a phenomenal double ipa...even the big daddy is pretty freaking good...good stuff", "author": "Francis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "disclaimer: i drink bud light.  because i like it.  \n\nthat being said...i love the small brewery concept.  i love do-it-yourself brewers that have a good enough product going that they can make a living off it.  i love local, small batch beers with quirky names.  i will support a brewery any day over mass produced, water down crap beer.  but i will still go home every night and drink bud light.  sorry.  \n\nthe only beer i really like at speakeasy is the white lightening.  the old man loves hunters point, which they used to have on tap at the broken record but have switched it for big daddy.  we have been to the brewery a couple times for parties or friday night open house and always have a great time.  \n\ngreat space...great people...great beer.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Amazing beer.  Dirt cheap.  Laid back atmosphere (that's possibly an understatement).  I love this place.  Love love love love love.  I have leftover poker chips from this place laying around my house and its always a good reminder to go back next Friday and see whats on tap.  Special releases run out early but they have stuff you'll never find bottled, totally worth getting there early.  Just don't drive home.  $3 a pint plus very potent beer (i'm looking at you, double daddy) = you need a taxi.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-08", "description": "I love this beer!!  If you like hoppy beer and strong beer then you'll love this stuff!!  The guys that run this brewery is awesome.  I was going away on a houseboat trip and needed to find some Double Daddy IPA.  I gave a ring to them and they told me where they recently stocked a store.  I went there and bought enough for the trip.  The other great thing about these guys is the Friday BBQ and live music.  Probably the best deal in town!", "author": "Timmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-14", "description": "The Speakeasy Brewery is without a doubt the best reason to go to the Bayview part of San Francisco. Their beers are only $2.50 a pint and, of course, damn tasty. Being able to walk around their warehouse is pretty interesting - I'm dying to know what was in the 'spill kit' that was hanging on one of back walls. There's also a piano out front near the office and I certainly like me some piano playing when drinking.", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "I love this SF brewery.  They make bold authentic beers and have a laid back attitude.  If you've ever attended their Open House Friday happy hours you know what I'm talking about.  Every Friday from 4-8 they open up the doors to the brewery and kick back with anybody who'd like to come on down.  They setup a small bar, put a few speakeasy kegs on tap and sell pints of deliciousness for $2.50.  Free popcorn and dogs are both to be found on all Fridays and the brewery isn't that far out of the way especially if you're in the Mission, SOMA or Portrero Hill.", "author": "Ed B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-30", "description": "Love this Friday happy hour!  $10 bucks gets you 3 beers and a pimp-ass pint glass, bbq was bumpin' and there was a band playing surf rock.  What I totally have missed out on by going to typical SF bars are the bar kiddies!  There were all these little kids there with their hip 'rents, dancing around to the band and showing off... we even got therm to put our dollars in the tip jar.  I was so one of those kids!!  My dad always gave me quarters for the jukebox and I just rocked out!  I attribute all my dance moves to being a bar brat : )  Very cool crowd, dogs are allowed, and GREAT beer... no better way to end the week.", "author": "Tara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "This place is a diamond in the rough! I love to come to come on Fridays and enjoy their great beer for a great price! You can't beat this deal and you get a glass too.  Just a great atmosphere, not pretentious at all.  However, you better have a DD because it's tough to get a cab to go out that way.  One time my friends and I had to get a ride from an employee to downtown because no cab would come pick us up.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-09", "description": "There Hunter's Porter is bangin and it can't be found at too many other places outside of the brewery. The Double Daddy is fresh and on point. 3 cups of that will have you feeling real loose. There is also a taco vendor inside the brewery. The brewery is open on Friday from 5:00 PM to 8:00 PM or 9:00PM. $10 gets you 3 beers and a Speakeasy collector's glass to keep. Have fun. Oh yeah, don't trip off the neighborhhood its no biggie.", "author": "C G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "really great beers -- many of higher alcohol content, which i love.  $3 for each beer -- what's not to like?? ambiance is fun, and becomes increasingly bougified and well-dressed as folks get off work.  transition is fun to see.\n\nrecommend biking there!", "author": "sean m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "me  & myhusband  come here last tgif for his workm and happy hr.; \ni dont like  beers but thhey have burito that was  ex cellent.\n\nnow i find there aniversery event this week end  so we muight have to come back on sat", "author": "Farajaqua S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-10", "description": "Place is awesome...highlight is walking here from the T and having a car pull over and ask if i know where I am going and then circle back to ensure my safety.  It is in an industrial area but i didnt feel unsafe until that moment. Anyways beer is great, love the white lightning and big daddy...and sometimes there is someone selling homemade taquitos with really good salsa for $1! Hell yeah! Great place to catch up with friends and have good beer for cheap.", "author": "Alana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-17", "description": "damn avery got in depth here. this brewery tour was a little more leisurely and much more informal than anchor. the place is much smaller than anchor and we were drinking while touring.\n\nbeers after the tour are $2 each which is a damn good price for such rarities. i just wish i had brought my own glass so i didnt have to drink out of plastic cups. you also get to taste their seasonal brews and they usually bbq on fridays i hear too.", "author": "Victor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "This is my favorite place to drink in San Francisco, hands down.  Their beer is AMAZING.  The varieties they offer in the brewery are very diverse, and change frequently.  The price of $3/beer is heavenly in this city.  I took the tour, which was SO fun.  Lead brewer Kush led the tour himself, and imparted detailed information in a very personable manner.  Afterwards, the place started filling up, but since it's such a great huge space, it never felt crowded, especially with their outdoor area available.  I really enjoyed the vibe too; there were some really fun people there!  I will definitely be back with more friends.", "author": "j s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-06", "description": "The atmosphere is high ceiling warehouse.  The crowd is chill down to earth people trying to knock back a few after a long work week.  Plenty of space to park outside for free and enough room to walk around inside.  I only tried two of the beers there, the IPA and the Hunter's Point.  Both were solid.  Definitely coming back considering I live a few miles south by Candlestick.  Avoid the happy hour crowd downtown every once in awhile and hit up Speakeasy.", "author": "Law C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "The reason why I gave this brewery 5 stars, is because everyone is really friendly, and laid back crowds only come here. I can't wait for Friday's to enjoy Happy Hour at Speakeasy's. $3 beers you CAN't go wrong with that, and don't forget to bring your growler or buy one. Fill up the growler for beer at home :) Pet's used to be allowed, but are now banned (boo) Kid friendly spot, which is a plus for me (yay) Please watch out cause after  2 beers, seriously only 2 you are feeling the alcohol. Awesome!", "author": "Monica O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "The Friday night happy hour here is unbeatable. We took a group of 20 from my office, and started out with an awesome tour given by the head brewer himself. According to one of my coworkers it was \"ten times as detailed\" as the Anchor Steam tour. The pints are super-cheap for quality beer - you can get obliterated for less than $10. (Particularly if you're drinking Double Daddy - watch out for that one.) They had burritos and taquitos when I was there, which were decent for what you pay. Minus one star for being in such a random, out-of-the-way, close-to-sketchy-places neighborhood. It is not a great place to have to drunkenly find your way home from. (Somehow we thought we could get off the T at 24th street and walk to the Mission...oh wait, those are projects. Oops.)", "author": "Kristen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-09", "description": "Quite simply, they make great beer. Speakeasy brew beef for enthusiasts nationwide, and limited-production boutique crafts for local consumption by those in the know. The brewery is run by a team of no-nonsense barley and hops specialists, Californians through and through, that clearly love doing their job and doing it well. In-house tastings on most Fridays. Call in advance for reservations.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-23", "description": "Speakeasy beer is not for wimps, this is real beer, real good that is!!  On Fridays they have an Open House Barbecue from 4:00pm-8:00pm, with a live band usually playing!  The Speakeasy crew are really welcoming always willing to answer someone's (mine) stupid questions about the whole brewing process!", "author": "Cassie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-18", "description": "Beer that drinks like a meal, and people you'll love drinking it with. Try the Friday Hour and be prepared to call for a ride home.", "author": "t h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-16", "description": "The beers are good.  The guys are cool.  They have very chill happy hours with good Speakeasy beers, a basic bbq and cool merchandise.  Speakeasy hoodies, bumper stickers & thongs, oh my!  Unfortunately the happy hour is only  a few hours on Friday nights, but it is still really good. They also have the harder to find beers on tap on those nights.  Also, you can get a case, growler, keg or pint.  I have a growing collection of Speakeasy pint glasses from these nights.  And a few Speakeasy poker chips. And the hoodie... and of course I've had plenty of the beer.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-03", "description": "I love this place!\nthe vibe, atmosphere, beer, entertainment, and most importantly...friends", "author": "geneva d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-06", "description": "awesome.  not a lot going on here.  just beer and washers, but it's good.  real good.", "author": "Angie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-30", "description": "Speakeasy. Double Daddy IPA flows through my veins. I worship the shelves it sits on. If I was homeless I would sleep outside of the warehouse and just breathe in hops all day.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "Delicious beer and great crowd.  They have a very good happy hour on Fridays and when there is live music it is a unique venue.  Good cheap Mexican food to soak up the beer and free popcorn doesn't hurt.  Some people bring their kids which is....different and a little disconcerting when kids are running around people drinking.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-10", "description": "The 9th Anniversary celebration was the first time visiting this brewery. It was really cool - almost like going to a friend's house for a BBQ. Tons of friendly people (I was suprised to see all the little kids running around) and good beer. I wish I had gotten the names of the bands that played.", "author": "a a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-04", "description": "This place is insane.  Its like walking into a college party in a brewery... piles of wheat, hops and kegs and everyone standing up drinking out of plastic cups.  I was surprised that I loved this place but great beer for 2.50 a pint in an unpretentious atmosphere... I have no complaints.", "author": "pauline e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-25", "description": "what can i say? the beer is fuckin awesome, the bbq's are fuckin awesome, the bands that play are always awesome and the employees are always kool and friendly even though one guy(i'll leave his name out) is always trying to pick up on my girlyfriend. it's always a good laugh when it comes time for last call and we all have her get the beers after they stopped serving.", "author": "Ausewaldoe J."}
