{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "Visited 08/20 around noon. \nCashier was very polite and nice. \n\nService extremely slow considering there were 3 people behind the counter.\nCounters were messy, no napkins, lines moved very slowly. :-(", "author": "Sam C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "Friday 21st 2018\nMe: 4 shots over ice in a vent a cup\nand sausage, guda and egg sandwich\nBatista: We low on Venti cups so I'll put it in a grande cup for you\nMe: Make it 3 shots then, so I'll still have\nroom for cream and sugar\nBatista: OK your new total is... $xx\nMe: I'll also need to reload $20\nBatista: OK let's cancel all this and reload first.\nLong story, short...\nChubby girl with black frame glasses don't know nothing. They have Venti cups but want to save it for other customers and not me? Oh, and I also walked out to realize later that she gave me bacon and egg sandwich", "author": "Royce Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "Got trenta iced coffee. Was a bit watery. Service was decent. Would only come back if necessary.", "author": "Wesley K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "Worst Starbucks ever. I will never come back here ever.\n\nI placed a mobile order at this Starbucks around 6pm on Sunday, October 7th. When I arrived to the stonestown mall to pick up my order, all the doors to the mall were locked and I saw security escorting people out early, still around 6pm.  The mall was closed but the Starbucks still accepted my mobile order.  \n\nI did not want to be charged stars for a coffee I didn't even drink (through no fault of my own), so I came back today 10/10/18 to let them know what happened. I told the barista that my mobile order was accepted, but the mall was closed so I could not pick up my drink.\n\nThe female barista with glasses and a beanie told me that it was impossible because the mall closes at 7pm. She told me that I was probably just trying to get a free drink and there was no way to tell for sure if I actually came and picked up my drink that day. \n\nWHY and how could I make this up!? How rude to claim that I was lying just to get a free drink! She ended up calling her manager who told her to make me the drink. I drink Starbucks almost every day. Why would I go through all that trouble just to get a free drink! I literally just wanted the drink I ordered and do not appreciate being ripped off. This barista was the most clueless person on planet earth!\n\nThis whole situation is completely ridiculous. Horrible customer service and the rudest barista that I have ever seen at a Starbucks or anywhere for that matter. Starbucks, please do not accept mobile orders if you are closed and rip off paying customers.", "author": "Bernie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-30", "description": "Came here ever since it opened. Service has been really bad to OK. Being in Stonestown the location is often very popular for shoppers. Now that there is a Peets it has made the line a bit shorter on some days.", "author": "M C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "ZERO stars!!!!Employees last night looked really tired and their service of course was really lousy.  I have to wait about 5 min in line while they talked to the person in front of me and after they finished talking, they did not take me in, they started chatting with themselves.  I left for Peets after waiting for 10min.  Not worth it!  The whole idea was to shut down the service.", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "They always make my order of Very Berry Hibiscus just right. The only downer is it always takes a good minute to get my order. It takes just as long to get your drink through mobile ordering as opposed to getting in line and ordering from there. This location does get busy especially since it's inside a mall with heavy foot traffic, but I've noticed the Starbucks inside the Target at the mall isn't as busy.", "author": "Donna M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "I ordered my drink online, when I went to go pick it up i found that cup was EMPTY. There was a woman there making drinks and a man standing at the register doing nothing... when I asked why my cup was handed to me empty the woman making the drinks yelled out \"she wanted almond milk, and we don't have it\" Uh ok? I don't understand why that wasn't addressed when I got there instead of handing me an empty cup...\n\nAfter, the man looked at me as if I was the one that was supposed to make my own drink.. mind you, there was no one there but me and another person waiting for their drink.. I wasn't told anything no one apologized for anything. Instead, the guy grabbed my cup and started taking other peoples orders while the girl making drinks started making others drinks.. \n\nSomehow, my drink was given to me after waiting for hella long with ALMOND MILK. So even tho I ordered my drink ahead I still had to wait until everyone else's drinks were made who were after me, for them to walk to the back and grab some milk...? and still no one apologized for how poorly they handled the situation.", "author": "Cassandra F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Out of napkins...really. staff is goofing around and rude.  Had to repeat my order 4 times...is it that hard to remember ice.\n\nCoofee was 3/4 full and tasted burnt.", "author": "MickYee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "I'm so sad. Like everyone I've frequent Starbucks at various locations and have noticed the level of service gone down considerably. This time it really bad and I feel that I've to say something. We happened to be at the Starbucks at Stones-town, SF mall in the food court area about 10:30 am. It wasn't busy at all we ordered our beverages and pasties. The cashier was nice but doesn't seem to remember our simple pastries order and ice request which we had to repeat a couple of times. \nThe barista was rude when we (me and other customers) tried to ask for napkins since the napkins dispenser was empty, he just gave a shrug \"no napkins \".  \nThis is unacceptable customer service not to mention the kiosk just opened less than an hour!\nThe staff working there didn't seems concerned that they are out of napkins and brown sugar how disappointing. If there's a ZERO star I would have selected that option", "author": "P C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "Oh Lord have mercyyyy!!\nI ordered a Vento soy chai with NO ice, once ready to get my order I realized that half of the cup was filled with ice.I politely asked the man at the bar to remove the ice.He got upset and gave me all type of attitude and said to me \" whatever\" while rolling his eyes at me.\nI mean...he is a MAN...a grown man.it is not cute all all.\nThis is a business and the least they should do is to provide a good customer service.\nThere are coffee shops at every corner of the city and if I have to be treated like that then I will not go back...i actually never went back.", "author": "Imelda G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "So I came to buy some overpriced corporate coffee from Starbucks because my kids have,  well start drinking the Kool-Aid. The place was a wreck but I figured they were busy. My 12 year old hates whipped cream so he ordered without. Now some history, he has ASD, social exchanges are difficult so we have worked hard for him to be able to interact like neurotypical people, and to advocate for himself, so when they added whip cream he wanted to ask the barista to fix it. He purchased the counter and says to the barista, \"I ordered without whip cream and this has whip.\" As he hands it to her she looks down in disgust and says, \"can you remove the straw?\" I thought that was odd, she takes the drink and removes the lid and begins scraping the whip cream into a trash bin , then she takes a spoon and begins to spoon the cream off at which point I ask her to just remake it. She stops throws the cup in the trash violently and says, \" Okay but I have to make ALL the other drinks before his!\" I'm sorry but didn't they make the mistake? She was so fucking rude it was unbelievable. To a 12 year-old? Dirty, incompetent and unfriendly I won't be back.", "author": "Cheri W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "This by far has been the worst Starbucks I have ever been to. Completely and utterly off Starbucks branding expectations! There were 5 workers in their little module and only 2 were actually doing their job. They had a male barista doing all of the drinks while close to about 8-10 customer were waiting for their drinks. As this was taking place, the other 3 female workers were too busy yapping amongst each other. \n\nAt one point, a customer returns their empty milk canister to the cashier and she states \"um, you're supposed to return this to the drink area!\" Oh, that makes perfect sense... give it to the guy who trying to catch up on everyone's drinks so you can continue to chat with another coworker and act like your busy. In addition, why are you correcting a customer about where to leave YOUR empty milk canisters??? \n\nSince the barista was overly busy making drinks, he couldn't even properly refill the canister, but instead hands the customer a cup of milk to be used. Below customer service expectations! I really felt sorry for that kid as he had no back up help whatsoever.\n\nThen as I was leaving, the workers were playing rap music. I'm not against any sort of music but, when you have to abide by a brand such as Starbucks, this is completely unacceptable. This Starbucks in particular has some employees that don't give a crap about work efficiency or their fellow employees that actually do their job. I can't believe what I witnessed all in the 15 minutes to get ONE iced coffee!!! \n\nSomeone needs to visit this location and get rid of the low hanging apples or you're going to keep losing the good ones! Seriously!", "author": "Sarina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "Inside the Stonestown Galleria shopping mall, set up like a kiosk but is almost the size of a regular Starbucks. Drink orders are quick considering there's always a line. Can't ask for much more from a Starbucks.\n\nI also liked how it's perfectly located at center of the mall food court: easy to find for anyone; near restrooms; convenient to grab a drink around a meal. No wonder I'm there onalmost every visit to this mall.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "I go to bought a coffee around 12:30pm-12:45pm today, the coffee maker was so terrible, when I ordered the coffee I already paid the extra caramel dressing on the top, when I got my coffee it seemed no caramel dressing on the top, When I ask the coffee maker add more, he In a bad temper and he said \"if you want more caramel you should paid when you order\", the problem is I paid the extra already, why should I paid again, the coffee maker's name is \"Abe\", that was so so so bad service , I think Starbucks should be pay attention to !", "author": "Eric H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "I am trying to understand why this Starbucks is always out of Napkins, straws, sugar dirty and very unfriendly. Service is the worst from all the Starbucks in the area. Why is that?? The fish stinks from the head!!", "author": "Michael P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "I've been to this location a number of times and each time, the wait time has been around 10-15 minutes after ordering.   On a Saturday, I ordered my drink at 5:18pm though their mobile app. I got there at 5:28pm but didn't get my drink until 5:42pm.  The barista was looking at her phone and at some point, got herself a snack.  She had, what looked to be a muffin, in one hand and was making drinks with her other. If she needed both hands, she'd hold her snack with her mouth while she poured drinks.   Another employee headed on his break and with about 10 customers waiting for their drinks, they stopped to make that employee his drink so that he can go on his break.   This Starbucks is just a circus show.", "author": "Milton W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Worst location... everytime I order a sandwich/pastry I've had to say something after my drink is made. Today they say \"they should be making it over there....\" I walk to the other side & watch him put it in the oven. This is the first review but 4th time it's happened. I only go here bc I work in this mall. SMH", "author": "C. F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-10", "description": "Normally I don't have any issues with this location but today I was pretty annoyed. I made my order through mobile at 9:40 and waited near the tables since I got there pretty early. The app said my drink was \"ready\" by 9:45 and when I went to ask the barista where my drink was NONE of them had checked mobile orders. And instead of getting my super delayed drink to me as soon as possible. The barista stacked 5 drinks on the counter instead of setting them OUTSIDE of the station where customers could actually get them. By the time I got my frappuccino, all the ice had melted so it was super watery. I know ice melts ya ya but I didnt expect to get my drink with already melted ice. Didnt get my drink until almost 20 minutes after ordering.", "author": "Susanna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "Came to Olive Gardens across from Target to celebrate my nieces birthday. I wanted something to keep me awake for the long drive back home. Very disappointed this place stops making fraps at a certain time.", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-03", "description": "One of the worst Starbucks I have ever been to! Dirty, slow, and nasty tasting drinks. Baristas there look like they hate their lives which obviously effects how they treat customers and make their drinks. There is not effort or happiness in anything they do. Baristas there are EXTREMELY slow which I think they do on purpose. Consistently have to wait 15 minutes  or more for a simple drink in the morning. This is NOT a one time thing, it happens every time.\n\nOh yeah! Never any napkins in stock. I always laugh at that.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-23", "description": "Sorry, but this is 3rd time I need to wait 20 min for my frappuccino at this location.  The first 2 times, there were something wrong w/ their connection.  The 3rd time I ordered in person...20min waited...came asked...the payment didn't go through...waited another 15 mins since I need to get in line again.  I dont like their services.  Duh, I have more than $20 in my account.  The drink is ok, not as good as any other ones in town.", "author": "M P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-10", "description": "I wishi could give this Starbucks 0 star. Jesus Christ i paid for my drinks. I did not ask them for free drink and they gave me such an  bad attitude. So so rude sevice. Every starbuck that i have been they always have whole milk, non fat milk half and half. Im the one can not drink half and half. And i ask for my non fat milk. (Where different place they can give me another full cup of milk) The lady work here told me i have to pay for my non fat milk. Wt... never wanna come back. Piss me off. Starbuck u can do better than that.", "author": "Hana N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "Ummm... how do you run out of ice and then tell your customers to go get ice from a different food court shop?\n\nNot cool man.", "author": "Betsy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-10", "description": "This mall's (stonestown) starbucks is not good. The employees are rude and wouldn't give us what we ordered. They are racist to Asians (they gave a person my American friend water but not my Asian friend. My Asian friend asked for a cup of water and the worker told her that she could  not order it. Soon after, My American friend asked for water and the worker gave it to her without hesitance. Overall, I do not recommend buying from here.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Ordered strawberry Acai with light ice and I got more than half cup of ice. Not satisfied! After confirmed with an employee, he also agreed it was not less less as I have asked yet did nothing.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-24", "description": "I've had it with this place and Starbucks in general! This Starbucks at Stonestown has and have always had mostly rude surly employees who do minimal to acknowledge you whether they're the person taking your order or the barista making your overpriced drink. It's understandable to a certain point as they are very busy and pumping out drink after drink and need to go fast but even if you're that busy, firstly do your best to try and be cordial to the costumers and try to make their drink to their liking each and every time. \n\nI am no longer a regular Starbucks costumer and have never bought 1 or 2 drinks every day, but I would say that I started patronizing Starbucks in the early 2000's and depending on different times and eras would buy an average of 2 or 3 drinks a week when all averaged out over the past 15 years or so with the exception of the past 2 or 3 years when I have not patronized Starbucks unless I have a gift card. So I figure I have spent minimally $4000 (star)bucks at various Starbucks since my first visit, probably much more! There are probably a lot of people who have spent $30,000 or more at Starbucks and everybody gets the same crummy service. \n\nMy sister in law gave me two $50 Starbucks gift cards on my last birthday; I've actually asked her not to give me Starbucks gift cards and suggested other gift cards she could give me including other coffee shops but she keeps forgetting. So I have only been back to Starbucks three times since my birthday last August and of course two out of three drinks were not made to my liking and if they are not I usually just have my drink and not complain or ask them to remake it unless it's really really bad. Once in a while, every two or three years I'll call up Starbucks costumer service to complain about only my very worst experiences there and the most they ever gave me was a $20 gift card and they used to send out a couple of free drink vouchers, I think over all I've gotten back a total of 50 or less including the one time I got a $20 gift card. Last time I called to complain about my recent unsatisfactory drinks and also the new Starbucks at Target Stonestown never having the stopper plugs in spite of them having only been open for a month at the time I complained and being out of them for three straight weeks,( I also often bring my mom a latte in the morning and need the stoppers to keep the drink hot and from splashing. ) The guy on the phone didn't even offer me anything in compensation at all! I was there like \"um .. OK .. \" waiting for him to offer a couple of vouchers but never did and said \"Is there anything else I can help you with today? Well okay now, have a nice day\" Whatever! I don't need the the $10 in vouchers, especially considering I have spent thousands of dollars at Starbucks. It's just the thought, the acknowledgment of understanding a valued costumers frustration and wanting to do something to make it right. \n\nI recently had a one time problem with a small business to which after reading a negative update which I downgraded from a five star to a 2 star rating from a bad experience with an Art School/day care business, the owner reached out to me and my nieces parents and was extremely friendly and apologetic taking full responsibility and wanting to make things right again, and actually offered us a package of 4 hours of FREE art lessons on the house as a kind  act of benevolence and a very sincere apology worth about $100, Now THAT\"S the way to rectify a mistake! And that is a very small business compared to Starbucks.\n\nOh yeah, about my last bad experience here and why I decided to write a 1 star review. Yesterday I ordered an iced white mocha with no whip cream and light on ice. First I waited for 15 minutes, a long wait even for Starbucks. I noticed that at least 4 people who ordered behind me all got their drinks before me, I kept looking over from the side and kept seeing a couple of plastic venti cups just sitting there near the register not moving for at least ten minutes. I saw the guy finishing a drink to which I thought it was the other persons who ordered a cold venti drink because the guy filled the cup with \"a little more\" than half with liquid content which is not \"light on ice\" As the other costumer grabbed at my cup asking if it were his soy milk latte or whatever, the barista said no, it's a white mocha to which I said \"I ordered a white mocha light on ice and he rudely says \"that IS light ice\" to which I knew he was wrong but wasn't going to stand there and argue, so I took it and left! tasted like shit too! after finishing my drink which is really less than a tall in actual liquid content I clearly saw that half \"HALF\" the cup was filled with ice which is in no way a light on ice drink, and that's with ice in the drink melting down over 10-15 minutes as well. The blond guy with facial hair needs to be retrained! He sticks his dirty hands inside the cups, doesn't know how to properly make drinks and is rude.", "author": "David A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-14", "description": "Got in a long line to try the Christmas Frappuccino because it's Dec. 14 and Xmas season and all the other starbucks seem to be serving them.  I get to the front of the line only for him to tell me they no longer have it. Okay. Then I also watched as he dropped the tongs used to move pastries ON THE FLOOR. He was frustrated and threw the tongs in the sink in dirty, soapy water for 3 seconds, took them out, haphazardly dried them on a paper towel in a non-thorough manner and proceeded to use them on people's pastries. Ewwww.", "author": "Laq Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-13", "description": "The slowest Starbucks in San Francisco, they really need to expand this location and hire more baristas. I can see this location is a kiosk which gives no extra room for additional baristas. They do have the potential to expand this location. I usually get Hot or Ice Coffee at this location, but they are very slow in getting orders out. Hot Coffee is standard, but the wait in line to order is very long and mobile ordering does not help. It seems to me that when I order Ice Coffee, they tend to not add the milk and would normally tell you to add it yourself. This location is very busy and is usually understaffed. Don't bother ordering Frappuccinos here, it seems that their blender is always \"broken\", but it's more like they don't want to wash the blender after making Frappuccinos. I understand from what most Starbucks baristas complain about is washing the blenders. There is another Starbucks location outside of the mall inside the Target with plenty of seating and is well staffed. I think there was a reason behind the ice water signs and the policy of giving only tall sizes. I would frequently see kids hangout at the mall and they would often go to Starbucks to get Ice Water without making any purchases. No joke, I saw 5/10 orders were ice waters and they would also run out of Venti cups. There's a reason why they enforced the policy of giving only tall sizes. I think they need to expand this location for more space for the baristas to make drinks.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-06", "description": "Poor customer service. The staff is not friendly at all. They need to work on being more efficient.", "author": "Sammy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "This Starbucks by far was the worst service I've encountered at any location I've been to. I asked if they had dairy free milk, he says we don't give away free milk. Then I said do you have any lactose milk, he says you want a latte. Omg, so I finally said what kind of milks do you have, he finally told me. I got a chai with soy & it was not tasty at all. So I also got protein box with eggs & I didn't see any salt & pepper with the packaging like usual. I asked if they had salt because mine didn't come inside the box like it normally does. The guys said, no they changed the packaging now & it doesn't include salt anymore. So I go back to my egg & realize under the grapes low & behold there was the salt & pepper packets. Omg, seriously they are just guessing stuff. So then I opened the packet & the packet was empty, absolutely no salt in it but there was pepper in the packet. Oh and when I went to check out he rang me up, I scanned my phone & he just walked away & started cleaning up. Ok so I left, he comes over to me & says I didn't pay. I said you walked away when I scanned my phone. Derrr!! And they had no sleeves for our cups, no idea why. Don't know how they ran out. Not a good way to start my Sat morning!", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "I ordered a venti passion tea lemonade today around 8 PM. I placed my order and went to the restroom. When I came out, the barista place my drink on the counter ..less than 5 seconds later a Chinese/Taiwanese (idk) looking women snagged my drink. What?!\n\nShe literally walked up to the counter. picked the cup up for a glance, and walked away.. The barista watched in disbelief as he tried to holler at the lady who walked away..\nI rushed up to the barista and told him that drink was mine! He's like \"yeah, I know! I'll make you another one.\" \n\nI guess I shouldn't have walked away for two minutes? Luckily the barista saw everything, but still ..wth!?!?", "author": "Danae L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "I ordered a small vanilla frap , it took the workers to finish my order in 10 mins. The customer service at this place is literally the worse.", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "This is the one other Starbucks in a kiosk, that I've been to, which the exception of the one at a kiosk at the Great Mall.\n\nBeing in the area, in the mood for shopping, and convenience, we visited this particular Starbucks. \n\nService was quick; there were about 5 to 6 baristas at this location. Again, because of convenince (shopping), I got a short green tea latte, when we first started shopping. Then, ordered a tall very berry hibiscus, right before we left.\n\nThe service was great, waited less than 5 minutes for both my drinks. My friend, on the other hand, opted for Quickly's downstairs from the Starbucks. I mean, boba is great, but what I'm used to, and have been frequenting for the longest time, is Starbucks. Regardless of location.\n\nI almost felt like tipping them at a certain point, but that's just me. I like giving people credit for good work.", "author": "Stephanie O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "I'm super pissed right now especially being a mall worker  who constantly gets coffee for every morning shift. I legit always get jacked for my espresso shots. I usually let it go except just righ t now at 1:15pm where I paid two extra shots I'm exhausted and needed the extra caffeine for my 8 hour shift . So I legit watched to make sure she's had them and got two exact drinks except one with two extra shots tell me why they taste th e same and are f2f h e same shade when one is supposed to be more intense!! So I asked knowing she hadn't ,mindful I'm right there watching so she says it's righ t and fine so I go back to my co workers we taste both and thgey are the same. This means constantly being robbed when asking for my espresso shots which are 80 cents each I'm a student that's adds up real fast I'm pissed and annoyed th at these rude employees are allowed to work here and like to customers faces", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-26", "description": "If I can give a 0 I would. The cashier has an attitude problem. If you want to work in the customer service industry get your attitude straighten out.", "author": "Sally H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "I ordered a cherry mocha Frappuccino on the mobile app and when I arrived there, I waited and I realized that they must have forgot my order. They said that they never got my order, but I showed them my receipt and they made my drink immediately. They gave me my drink and the cup was all dirty and covered with the Frappuccino. The guy who made me my drink was rude and didn't apologized to me. Plus they gave me a regular mocha instead of a cherry mocha. I didn't feel like telling the barista because I didn't want to deal with them anymore.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "2 stars ONLY for the customer service and Fraps. Starbucks insults me with their bad tasting drinks and poor quality coffee beans. Why y'all trying to play me like that. NOT COOL. Sometimes I pass by this starbucks and shake my head. They need to hire more people at this location as well. Plus, I realized today that they want to give every.customer diabetes. Yes, that's right DIABETES! Have you read the contents on.their drinks, specifically the SUGAR! It is insane how much they put in their drinks. Shooooooo....no.way...I don't need a heart attack...  not me. They med more sugar free stuff and then we can talk. I ordered a Frap and saw the calories...I almost passed out!! Be warned people. This place will mess up your health.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "I came today morning to get refill for 0.50$ but the dude-the cashier asked me the recipe which is weird, the first time since I started to drink Starbucks, i have been asked to show him recipe which seems like he didn't want to give me the coffee or ignore to serve me!!!! Looks like time to switch to Peets Coffee and Tee", "author": "Navfal A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-06", "description": "Rude service and over charge customers. Never again. Starbucks, you need to do a test customer service here.", "author": "dddd h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-26", "description": "I am a regular Starbucks customer at several locations, so much so that I have run through several gift cards that my friends and family have given me. Everything from the lunches to yogurt, sandwiches, baked goods, and various coffee and tea drinks. I love the place. However, I felt compelled to write this review because of my first bad experience ever, and I think it should be noted.\n\nI went in earlier this week during the afternoon to the Starbucks to get a yogurt and some iced tea. I happened to get an important text while I was ordering, so I was a little bit distracted. The cashier asked me if I wanted my receipt, and I said no. She said your drink will be waiting at the end. I saw an iced tea there and picked it up. Went to a table and proceeded to eat my yogurt when all of the sudden an angry woman came up to me and said \"that's my tea! you took my tea. the baristas think you stole my tea!\" I was like - omg I must have picked up the wrong drink!\n\nI went to the barista and told her I picked up the wrong drink. She said, what did you order, and when I told her, she said, \"no you didn't. You stole a drink.\" I said \"no, I ordered an iced tea just a few minutes ago and I ordered it from that cashier. I just picked up the wrong iced tea\". She said, \"where is your receipt?\" I didn't have it. Ugh! She continued to dress me down as a thief and refused to help me at all until someone I assume was the manager came up and asked what was happening. Within a few minutes it was resolved - he had the cashier look up my order and confirm to everyone that I did indeed order a drink. While they were making it, this barista was back there talking angrily to the manager. I assume she still thought I was an iced tea thief. \n\nWhat bugs me about this experience is the unfriendly atmosphere and automatic assumption that a customer \"stole\" something instead of looking into what happened and assuming that it was just as I said it was, a misunderstanding and accidental pick up of a drink. Whether this is due to poor management of the orders, I don't know. Whatever the case, I was truly offended and will AVOID the Stonestown Mall Starbucks after this experience, sadly. It was a favorite place but now has a really bad vibe after such a nasty accusation. Too bad.", "author": "Mary Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "Slow and shitty ass service. I came here during a typical lunch hour so obviously there was gonna be a long line which is understandable but it literally took 30 mins for my order to be ready. I was also buying food from other places nearby at the food court while waiting for my order and I still managed to get my food before I even received my drink...and the girl who took my order made it so obvious that she didn't want to be there and sounded so unenthusiastic when she was taking my order. I understand that some customers get super demanding but the least you could do was be nicer. And the lady who handed me my drink didn't even say thank you lol like where is the customer service man???????? Anyhow my drink was good but the service here ruined my experience.", "author": "Cee H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-07", "description": "Fast service but quality is lacking. I ordered an iced green tea latte and the drink came with soooo many little powder bits. Not sure if that's standard quality, the person before me got an ice green tea latte and the same thing happened with theirs.", "author": "Elina T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "Small little Starbucks that always seems to have a line. I like that everything is visible. Wi-Fi is available, but not from Starbucks. Use Stonetown's free Wi-Fi. Currently listed as .FreeWiFi-TheClub just enter an email address. \n\nNot super fast, but fast enough and the employees seem nice. Most of them anyway.", "author": "David K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "Fast and covinent but the coffee drink quality is not there. Average at best. Staff is not super friendly.", "author": "Kobe J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "Very bad customer services, the barista didn't admit their fault and pass the buck to the customers.", "author": "Fransis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Love the barista in the morning that has a limp. He is such a nice man. Every time I go in it seems like he remembers my drink or try's to suggest things that actually make my drink better! He needs a raise! Or at least some recognition! Get this I come in at least once a month and he remembers me! Wow!", "author": "Mouang S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Mariam is the sweetest Barista!! Such great customer service. I work at the local mall and I look forward to my visit at this Starbucks! Thank You", "author": "Amanda D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "This is the worst Starbucks I have ever been to. The only reason why I go to this Starbucks is because it's the only one near by my work but their baristas don't know how to make drinks properly and they're very slow on making the drinks. Every time I ask for \"light ice\" they put extra ice and some baristas just don't read the special requests on the cups. Yes this place gets very busy but they should still make their drinks the right way instead of rushing and just making them shitty.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "Fast, Friendly and Efficient. \n\nThis is probably one of the smallest Starbucks around and one of the busiest since it's located smack dab in the middle of the food-court. Even if when the lines stretches beyond the dining area, the Baristas here churn up coffees like hot potatoes. \n\nTo say they're quick is an understatement. \n\nI always order a double espresso with a splash (or two) of steamed soy milk. I have recently found out that what I've been ordering has a name, and that name is called a Doppio. \n\nThat's a DOPE ass name. \n\nBut recently, I've been ordering their Soy Latte here and it's by far the best Soy Latte I've ever had compared to other Starbucks. It's creamy, thick, rich with an extra boost of caffeine to give it that extra kick that I need. \n\nDa Bull says DOPE!", "author": "John G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-01", "description": "I figured making my breakfast sandwich was gonna take forever because the line was long but omg they completely \"forgot\" about it. I asked barista where it was and someone else had taken it. Then I reminded him to make it and he brushed it off. And never made it. So I asked a different worker and they made it fast. Not cool though.", "author": "Carissa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "If there is zero point for opinion, I would give 0 to the cashier, her name started with K.\nAnd I wonder why, how come they don't have name tag on it.\n\n1. I have stood in the line for two minutes, she was adjusting a payment. After she finished, she said, are you ready? I did not know she was talking to me because she did not make eye contact. NO smile, NO apologize.\n2. I wanted to order pink drink, she asked, what that is? I said, it is on secret menu. She said, but what that is? We never have that. I said, I DID order at here before. It is the strawberry drink. She looked like very impatient. I said, that's fine. Cause you don't know what that is.\n3. I had left and came back ask for her name. She said, I take your order. I got confuse that if she doesn't know what is that, why she takes my order. Or she doesn't want to take my order, then she said she don't have it.\n\nThere are pink, purple, green, yellow and orange drink on the secret menu. As a Starbucks employee, even though she doesn't know the recipe, she can get someone to help her.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "Came into get my last point too get another free coffee. Line is not that long. Not too load and the staff pumps out the drinks as fast as they can. They do have the wireless chargers for you device. Not as crowded as other locations closer to the convention center", "author": "Bin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "Lol gasoline dark roast, ive been a barista for years and i love a DARK roast, and theres is just very watery and all there other espresso drinks taste the same :(\nSorry :/", "author": "Sunny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "I've been to this Starbucks for 5 years now and it is my favorite Starbucks....not just because it is the closest one, but also because of the lovely people. \n\nA lot of reviews are saying that this Starbucks has the worst customer service, but as a person who also works in the customer service/food industry, I can say this without being biased...it's hard to always have a smile on your face especially when it's one of the busiest Starbucks. They've been there all day and they ARE serving you. Did you ask them how their days are going when they asked you? I feel like being nice is a 2 way street.\n\nAll the baristas are different from 5 years ago, but I know most of them and most of them remember my name and my drink. They're always happy to see me and are very nice. And yes, maybe some of them are rude sometimes even when you're being nice, but come on, we all have those days.", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-06", "description": "I was meeting with some students for a marketing project and needed to grab a pick-me-up to start the day. Stonestown's Starbucks is luckily open early before the shopping day so I stopped in for a quick latte.\n\nI ordered a hazelnut latte and it was exactly as I expected it, piping hot and delish. It was at one of those kiosks at the mall and there was already a line early in the morning but service didn't suffer at all. Not a bad start to the morning I'd say.\n\nI don't normally come to the mall so early, but it turned out to be a good place to get some work done and grab coffee since there were very few people around. There's tons of parking but no WiFi. Just make sure you don't get caught heading to campus from here because they will tow!\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "One of my favorite Starbucks ! Love coming here !\n\nI've been coming here for 4 years and love the service! All baristas are very nice,helpful and super fast! Love it", "author": "Naira S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "Terrible Starbucks! QASA violation EVERYWHERE. The employee was changing the trashcan and then serve my drink/food afterwards. DISGUSTING. Also, the manager is very inconsiderate.. There was a line and he was busy chattering with his employee. Dude, take your chattering somewhere else, not when it's busy.", "author": "John F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "Why is there an inconsistency with Starbucks service?   This location always hassles me when I get a coffe refill. I'm a gold customer and also a coffee lover drinking lots of coffee daily.  They ask for a receipt and the Chinese girl even scrutinizes it.  Starbucks should give her a huge raise since she is making very sure we don't get Statbucks ripped off with a refill.  When I didn't have the receipt someone else, a blondy lady this time, actually asked if I remembered who I bought my first cup from.  Guess she was going to double check.  I think she needs a raise too.  \nBy the way the lines are too long.  It's not set up well in the food court since too many table apps are on the right. It's a crunched area.  Long wait. Not polite servers.  I give two stars because they actually do have coffee there.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-02", "description": "No complaints at all.  Whenever it's cold and I'm dying to get out of my apartment and relax/study somewhere else, I head on over here and get a nice hot cup of Joe or hot chocolate, depending upon what I crave.\n\nPros:\n\n+ Friendly employees\n+ Quick turnaround time\n+ Not that crowded (at least when I'm here)\n\nCan't think of any cons at the moment.\n\n5 stars all the way", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "I love coming here! They're super fast and can whip out 4 drinks at once. They are not stingy when it comes to extras too! Yeah there's a long line but they're a small kiosk with only ONE BLENDER. That's practically insanity considering how many high school students come to order Frappuccinos. The employees also remember you if you come by frequently and they treat their regulars well.\n\nSide note: The employees at this Starbucks are among the nicest I've ever ran across and it makes me sad that they hardly make anything on tips. TIP THEM THEY TOTALLY DESERVE IT. You can tip on your phone if you use your Starbucks card.", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "Don't keep your expectations too high because your hopes and dreams of a great tasting cup of coffee/latte/whatever will be smashed within the first few sips if not the first. You're in a MALL and this is a chainstore.\n\nIt seems like every time I come here for a drink, something about this place is broken. Whatever. \n\nThey're drinks are fair. \nWhat I really love about this place is the bucket of \"swords\" the plastic thing you can put in your cup so it will not leak in car. I grab a few-couple-extra of these and dump it into my purse then I transfer them to the car. \n(Refer to picture)\n\nIf you plan on getting a cup of ______ make sure you're wearing comfortable shoes. It might be awhile.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "Disgusting, didn't even wash the blender all the way for my Caramel Frap. Literally tastes like the drink made before, which was a strawberry and cream frappe. Ended up throwing away my drink. Ugh", "author": "Angie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-30", "description": "Super slow at making drinks... They have 2 people ringing and one on bar. Shouldn't take almost 10 minutes for a white mocha.", "author": "JoJo Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "This now deserves zero star on yelp. I have never been to a Starbucks that ask you that you owe them money after you placed your order. I've been a regular Starbucks cumstomer due to the proximity to San Francisco State University where I'm studying. I have never had any problem with scanning my Starbucks card in every of my order. But today, this Cantonese employee asked me to scan my card twice, which I believed to be normal because I encountered many times. However this employee said to me that I owe him 61 cents, and his POS says that the price is over 7 dollars. Excuse me? I ordered a Cappuccino that is supposed to be around 3 dollars, and I have to pay more than twice for a Cappuccino? He treated me like I'm an idiot for the whole time, and why does an order need to be that complicated? I never had this negative experiences with Starbucks before. Well yes I cancelled my order and left. From now on, I would rather go to a farther Starbucks away from SFSU campus rather than the one here at Stonestown. Dear Starbucks, please fire all of the employees there, I never deserve to be treated like this.", "author": "Leo W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-08", "description": "My friends and i came here for a pre-work starbucks run. We each ordered chai lattes and when we got to work and tried our lattes they had a sour taste. Almost like if it was fermented. It even smelled sour. We couldn't even finish it and one of us got sick. Never going back to this Starbucks.", "author": "Liz E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Poor service. Don't expect your mobile order to be accurate.  I ordered two breakfast sandwiches and they only had one ready at pickup.  Instead of putting me ahead of the other food orders, due to the mistake, they made me wait.  Pick a different store.  Also, it's not a convenient location in the mall for fast mobile orders.", "author": "Carter T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-11", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star: free mall parking lot. 1 minute wait. \n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n0/1 Star: fast food style. Drink maker spills a lot. Saw some unhappy people with dirty cups. \n\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n1/3 Stars: I ordered a caramel apple cider and I saw the guy pour the remaining apple juice in the container knowing that it wasn't enough, but went to on making the drink anyways instead of getting another bottle apple juice. On top of the drink being short, he used just a touch of caramel for decoration on the whip cream. He didn't put any in the cup like all the other Starbucks. \n\n_____\n\nOverall Experience\n\n2/5 Stars \n\n_____\n\nLast Words\n\nNot up to Starbucks standards.", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "service is slow, and employees focus on talking to each other instead of making drinks. all i asked for was a cup of water.", "author": "Rena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Friendly and fast service\nThey should get paid more because they are just SUPER fast and get things done. Unlike other location just let you wait for loooooooooong time and dont give a fxxk. I dont mind to wait, but some other location just terribly slow.\n\nGreat team working together\n\n\nDrinks are delicious. Love my coffee Frap frap with whipped cream\n\nReally appreciate it Guys", "author": "Che K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "To the barista working at 8:40 am on a Friday morning. I did not catch her name but it wasn't Emily. She was very professional with her job and made sure that she was paying attention to the long line, even though she was dealing with a difficult order. She definitely made my day start off a little better than usual. Thank you Starbucks.", "author": "Collin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "As of today...1/22/14\n\nThis Starbucks location is immensely awesome.  Yes, I used the word, immensely.  \n\nI come here almost every single morning and I truly adore the team at this location.  They are the most friendly, and down to Earth individuals.  This is definitely the main reason I come to this location.  \n\nI personally feel that the drinks here are very good.  \n\n\"Sometimes you wanna go, where everybody knows your name...\"\n\nAnd that's how I feel when I come here.  \n\nThank you all so much!", "author": "Bernie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "Trash mocha frap (w a blend of banana)  don't want to be that asshole that returns the drink but won't be coming back .", "author": "Sol R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-08", "description": "I know they're busy, but their attitude is the worst. If you wanna get a drink, go to other Starbucks for nice and fast services.", "author": "Akiko Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "To the sour cow with the nose ring and long brown pony tail thanks for the worst Starbucks experience ever...", "author": "Waldo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "No matter how long the line is during lunch hour, they are fast, efficient, and friendly. I got to order in less than 5 minutes in the line. The staffs are energetic, love coming here!!!", "author": "Zisele N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "I visit here every time but today I am not happy with the service of lady this morning9:30 she gave me coffee and then when I asked her for sugar she told me there's no more sugar and this is not the first time it's more than twice time so i decide to write on Yelp , she told me to grab sugar from PEET'S coffee and talk so rudely,others everything is good", "author": "Mamta B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "Rude customer service. It was busy and I understand if you need a moment before you take my order just say I'll be right with you. Thank you also to the employee that said um excuse me the line starts on the other side of the divider. Although I was standing in the first spot any ways. There was a nicer way to say move to the other side of divider and that would have been fine.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "The most disengaged sbux employees I've ever met. Not a single smile. Just robots \"serving\" drinks.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-23", "description": "Easiest location to find somewhere to sit for afternoon coffee. We've tried Serremonte and Tanforan but there just isn't enough seating. Starbucks is pretty much an equivalent to a McDonald's; decently priced drinks (I guess) and everyone frequents the place like McDonald's. Can't say this place has the best coffee in the world but I like their seasonal specials like the Coconut Mocha Frappacino and Mint Chip Frappacino.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-28", "description": "Always busy considering it's inside the mall. The employees are usually nice and drinks come out nice. But there is a tall caucasian guy who gave me a little attitude last week 5/2015 by requesting for caramel for my frap.", "author": "Rose P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-23", "description": "During the break between shopping decided to get cappucino from Starbucks. Line was huge, but what can I do..\nGuy from service team was standing with cards, asking clients what would they like today - good idea that made everything works faster.\n\nI made my small order - venti wet cappucino (not too much foam). I was surprised that he started to offer me latte (the difference is that latte doesn't have that much foam, unless you'll ask for it). Maybe it was logical, but my order was cappucino + I know which caps can be made (wet and dry, no foam and just pure foam), so I got distracted. After I insisted, he smiled and wrote it down. FINALLY!\n\nBut at the end, they made a mistake and made it with hella a lot of foam. Come on, guys, try to pay attention.", "author": "Olga B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "I love this Starbucks! While the line might get a little ridiculous, it totally beats getting mauled in the parking lot of nearby Westgate in Daly City. When I'm feeling like being a bad car using San Franciscan going to get commercialized coffee products, this is my go-to stop. \n\nThe staff is always nice and quick! There is almost always a line but that doesn't stop them from giving top notch service. My drink is always done in record time and tastes on point. \n\nIt doesn't seem like they have the delicious breakfast sandwiches that are at other locations, but that's okay. It's just a mall kiosk!\n\nThe best part? Bypassing the crowded Stonetown's parking lot and parking in the garage underneath the shopping mall. Hop in the elevator and waltz over. When you're tired/hung over/empty on caffeine, this is absolutely divine.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-28", "description": "Good place to get coffee quick. My complaint is that for iced tea you can only get one refill even if you stay in the food court for a while. I have a gold card and it says you can get as many as you want as long as you are in the store but not at this location. Also remember to get your receipt or else you get no refill!", "author": "Yvonne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "It's starbucks! What's not to love?\n\nAlways go after class for a venti iced caramel macchiatto if I needa stay up to study :) \nOne of the cashier is still friendly probably after a long shift that day. So I don't get all these comment about rude baristas or how it takes too long for their drink, I find that they actually make their drinks promptly. \n\nThe only sucky thing is that they sometimes run out of ice. :( I usually only want a cold drink, so it's usually a dissapointment to hear that they can't make my drink. But nonetheless, I still love this place.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-15", "description": "Make sure to not come in the morning. I seem to have the most problems when ordering from \"R.\" Though I speak clearly, I always have to repeat my order when \"R\" takes my order. Today I chose to try the vanilla macchiato. It's a new drink so I assumed there should be something good to it. No. There is not much to rave about the new drink. Why do I bring up the macchiato? Because it was lukewarm. I don't usually order hot drinks, and I see why I don't order hot drinks from THIS Starbucks. A lukewarm macchiato does not make me enjoy the steamed milk at the bottom. This location just seems to be falling in my opinion. Falling off a cliff? No. Just falling and I'm not really sure where they are heading. They just have my continued patronage, just because of the convenience of the location.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I go to this Starbucks kiosk all the time (it's right next to my school) and I have yet to have any kind of negative experience. The team members have always been totally polite and fun to interact with. If there's ever a long line, the service is still great.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-07", "description": "I attend SFSU and usually have an hr break in the morning so sometimes when I want to kill time I would walk here to get my caffeine fix. It's great that they're open when the mall isn't but when the mall is open the line is super long.  Although with the amount of customers they have, I feel like I get my drink in a promptly manner.  \n\nThey only thing that sucks is that when you go so early in the morning, the escalator isn't on so you have to walk up the escalator. Don't get my wrong, I'm not that lazy where I can't climb a set of stairs but it's more of the fact that walking up a non-moving escalator always make me a little dizzy and I always trip -___-.", "author": "Mimi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Even if it's a long line, the service is always very good. I have been coming her for years and never had a complaint! Thanks Starbucks!", "author": "Manolito J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "I come here ALL the time - to be honest, they're pretty much the one location where I can get my drink made right the first time.\n\nOf course you're going to stand in line people - you're in a fucking shopping mall - HELLO!! What did you think you were going to do? You must be the same ones I hear bitch if there's more than 3 people in line at Williams-Sonoma!\n\nYes - sometimes things are broke and they can not replace them. They don't have the storage space that the stand alone stores have, so they need to phone in replacements.\n\nThe store in the mall has about 3 people working at a time. It's not a big kiosk - and that's all this is. A Kiosk. Unlike a stand alone where you have 1 person in charge of pastry, one or two at the register, 1 preparing the drink and 2 people making the drinks. So yes, it will be a little slower - especially if there's a line with people in front of you (oh the calamity! People in front of YOU!). You're not special. Be patient.", "author": "Ian B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-07", "description": "I honestly really don't like this location because of the following reasons:\n1) REALLY REALLY SLOW SERVICE.\n2) POOR SERVICE.\n3) Long line.\n4) Pastries don't look as fresh.\n\nBut worth the two stars for two reasons:\n1) Close to my school.\n2) Easy access (In stonestown)\n\nHappy Yelping!!! xoxoxoxo", "author": "Kary Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "All the baristas here are really friendly and try their best to get to know you.  The drinks here are usually good, but they can occasionally make a few mistakes.  Service is usually quick, even if there is a long line.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-05", "description": "Sometimes long lines, sometimes its empty. Coffee taste is always consistent. What can go wrong at starbucks? \n\n-SFCG", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "Starbucks in the mall\n\nThe service is super FAST\n\nCompared to other starbucks their service is on steroids!", "author": "Michael m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-18", "description": "I love this Starbucks. I work at Stonestown. So, I am a regular but I have worked at (6) different malls and they by far have the best service out of every mall I have worked at. They all know me by name & are super friendly. So they usually know my order. I love all most the whole crew from shift leader Mandy, Amanda (Asian), Scottie, Dillon, Rudy & both Nieko's. Little Nieko's makes the most mouth watering coffee ever. They all can make a pretty good coffee. I think Mandy, Dillon & Nieko make them the best. There great I would highly recommend them if your looking for great coffee and excellent service. Everyone is so sweet here. Best Strabucks ever! I have worked at Newpark & Stoneridge,  3rd Market, San Francisco Centre (Westfeild) & this Starbucks is by far the best.\n\n-Elena", "author": "Elena A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-11", "description": "So I usually get my AM coffee here esp when I'm in a rush for work (I work in the mall). It just sucks that this location just recently had been remodeled, but can't afford a damn toaster?!! Or warmer?! SOMETHING so I can have a warm bagel to eat with my light cream cheese for breakfast!!! Don't like Starbucks yogurts, bc they're overly sugared with the fake strawberry sauce or w/e they put in there.\n\nAlso, I hate how they're inconsistent with their availability of ice. Seriously?! It's odd when they consistently run out of ice or the ice machine seems to be broken near to closing time...hmmm. \n\nLastly, most of the time there are looooong lines esp during the times when school has ended for the day, since there's 2 HS around. Damn highschoolers and their cravings for frappacinos!!!", "author": "Christine F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-10", "description": "One word: SLOW.\n\nAlthough the line can get long, I've seen lines just as long as other SBUX, and they get your drink to you in half the time that this place does.  I have had many,many instances where it's just me and 2 other people waiting for a drink after ordering (and nobody else is in line), and they took 10 minutes (maybe a bit more?) to get our drinks.  I personally don't order anything exciting (just a plain latte, non-fat milk).\n\nOne time, they almost forgot to finish my boyfriend's drink right in front of us.  As in, they made it half way then forgot about it!  WTH?\n\nNot a huge fan of this SBUX location.  Unfortunately, they're the only shop I know of that makes really specific frappuccinos (bc my boyfriend won't order anything else), so sometimes we're stuck coming here, but I try to avoid this location as much as possible.", "author": "Jenniffer G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Workers are really friendly and nice, but when there are a lot customers, I think there should be more workers so they can take care of the orders faster.", "author": "Andres F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "I can tell you this place is friendly, efficient, and each time my vanilla chai latte no water with whip is PERFECT!", "author": "Makana Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "I always get the white mocha and the white mocha/expresso ratio is always consistent. Plus, the baristas are always friendly. Yes, they can be a little slow but theres only 1 cashier, 1 barista, and 1 cleaning with 10 ppl deep! C'mon people, be a little more patient.", "author": "Jean T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "Really long lines....But good coffee...\n\nThere used to be a guy that knew my drink order...he hasn't been there recently but he was awesome!", "author": "Brendan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-17", "description": "Normally I give starbucks a solid 3 stars for being generally good. \n\nThis one gets 2 stars because service is slow(not exaggerating, 9 minutes for a grande mint mocha) and my coffee tasted burnt.  I still drank it because it's $4 a pop. Not cool starbucks.\n\nTIP:\n\n-DO NOT GET COFFEE WHEN THEY ARE CLOSING.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-03", "description": "i needed a morning coffee fix for a morning class. \n\nordered my usual..  iced tall upside down caramel macchiato with soy and the lady messed it up.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "I'm not even a fan of Starbucks, but for some reason I still keep getting the cards as gifts... \n\nEither way, my friend and I went to this one for some passion something lemonade something, and the hotttttttttesssst guy was working there.  Like, dream-boat status- hair of a hipster, glasses of an old man, face of an angel.  He made our drinks, asked for a name, I got all flustered and awkward, and he ended up writing \"Ramu\" on my cup, haha.  He can call me \"Ramu\" anyday.", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "I was not sure if I should write a review for starbucks since there are so many other locations. One of my main issues with this starbucks is that they constantly run of ICE & other supplies on hot days & those are the days that I usually want starbucks. \n\nOther than that...I've had no issues when it comes to price or service. It may be small..but I understand that it's in a mall.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "Cheeze and freakin RICE, people!  If you read back through all of the negative reviews of the Stonestown Starbucks, all you see is a bunch of freakin whiners.  Yelp has become a place for idiots to congregate and talk about things they don't understand and have any patience for.  Here.. let me briefly explain/address/answer practically every single thing all you complainers have nit picked about this starbucks:\n\n1. \"The prices are more expensive\" -  Than WHAT?!  It's the same exact prices as every other starbucks in the city.  It's STARbucks... you seriously going to complain about this particular locations prices?\n\n2. \"They greeted the person in front and behind of me, but not me\" - Maybe if you showed a smile or some courtesy they'd show some back.  It's called manners, and baristas aren't the only ones who are expected to have them.\n\n3. \"The line is always long\" - Oh.. gee... that sucks you recognize this spot is always busy and yet choose to wait in line and then bitch about it.  Sorry they can't immediately grow the kiosk to a larger size just to address your impatience and bad time-planning on your lunch break.\n\nThat's the problem with starbucks these days... it makes customers think they have the right to bitch and moan about any little detail they don't like.  Grow a pair and, like a grown adult, tell the Barista what it wasn't like and politely ask them to do it again.  If they don't, don't come back.  It's that simple.\n\nIn any case... the employees here are nice, friendly, and if you're polite to them, they'll be nice back to you.   (ps. if you order a frap every single day, particularly with extra caramel/mocha/etc etc, don't expect to get wonderful service since you have bad taste and they're annoying as shit to make).", "author": "Matt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "Quick stop for some coffee while shopping in a mall is a great idea always! I also love having free refills since I am a card member.", "author": "Karina A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-14", "description": "Don't get me wrong, Starbucks is awesome; maybe even more than The Coffee Bean mainly due to its convenience, but we're not reviewing Starbucks as itself right? \n\nMy friends and I got our drinks from here early this afternoon when the girl that took our order gave us an attitude only because of confusion regarding our drinks. Ahaha it's not that we cared for her to build some type of rapport with us, but we certainly didn't want an eye roll, a grunt, and an \"oh my god.\" She didn't even pay attention, so..\n\nAlthough our order came out just as expected, the service we received wasn't particularly decent. I understand that this branch is in a mall and people don't have any other choice in terms of drinks, besides soda and the like, so things get hectic at times, but come on now; shouldn't that indicate how well the baristas are supposed to treat its customers? Maybe not in this case, but they - or one of them cause really, what difference does it make? It's not like we get to pick which barista we want - should at least treat their customers with decency. \n\nGirl, I just hope you weren't expecting tips.", "author": "Jackie b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "These guys put up a solid effort, and can dispatch a long line relatively quickly.\n\nSometimes they have trouble keeping the milk containers full, and it can be a bit dirty where you make your coffee. But overall, it's a good place to get fresh coffee.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-16", "description": "this one sucks. maybe because it's in the mall? too bad i don't have a choice... it's the one closest to me. blah. the line is always long... the employees move at snail speed most of the time. and they're always running out of shit... ie: soy milk... straws... lids... ice?! wtf.. booo.", "author": "Ann T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "I wouldnt bother to review any of the Starbucks in the city, but this particular one I have some issues (good and bad) with. \n\nThe line does get long and the service can feel rushed. Im writing about a specific experience I had last saturday. \n\nI ordered a passion ice tea lemonade. It was almost 80% ice. So not only did i wait quite a while to receive my drink, I was paying for venti to get more ice--wonderful. \n\nIt was so unreasonably filled with ice that for the first time IN MY LIFE! I felt the need to complain about the drink to the cashier. Even in my drunkest states i never complained about a drink--just a drink right? \n\nAs i waited in line again (ice is melting) I started to get worried--what if i cause a scene! over a stupid lemonade--maybe I shouldnt be in line....I started chickening out... \n\nLuckily when I was called up I bravely said \"my drink is all ice\" and I showed it to him, the guy graciously offered to remake the drink and the re-made version was just like how i remembered--delicious!!\n\nWhen I visit these large chains, I expect a degree of certainty--or else why would i wait 15 min to get a drink? I could easily go somewhere else. Thank you Starbucks for preventing an epic pms-breakdown in the middle of the foodcourt.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-08", "description": "Must be THE slowest starbucks in San Francisco. Unreal. Friendly baristas though, just speed it up ppl.", "author": "Junius S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "their pretty cool i went there today at around one and i was all like trying to decide what i wanted and i was ushered over quickly got my order in and out i had to stand there for a lil while though and i was all just like this is a chill experience today so it was good business transactions or something like that a spot", "author": "John V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "The only (can you believe it?) Starbucks in the Stonestown Galleria.  It's a kiosk, actually.  It serves the usual SB cup of joes with seasonal adds (Peppermint Mocha, Pumpkin lattes, etc.) and desserts..  The prices have really skyrocketed. A mere \"tall\" or small to you, Peppermint Mocha is now over $3.00.  By the time you've consumed 3 cups of that, you can buy 1/2 lb coffee beans to make several pots of coffee at home.\nBut, it's the seasonal peppermint mocha I crave that no other coffee purveyor seems to be able to make it the way I like.  Such merriment if you add the snow, Xmas music, and omnipresent Xmas decoratons as soon as Halloween (or before) is over.  Surprisingly, the taste of the PM does vary from Starbucks to Starbucks.  This SB doesn't quite hit the mark but I settled for it anyways.  Beats the Seattle Best coffee at Borders.  This from a weany coffee drinker.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "By far the greatest Starbucks I've ever been to and will ever go to! \nI'm a regular customer here and all the partners know my name, my usual order, often have it ready to go by the time I get to the register, and the drinks are always perfect. The team is all smiles and super friendly, they even occasionally give drinks on the house! I've seen a few partners leave to other locations and new partners come into the team, but it never negatively affects their output, they always manage to integrate the new partner well.\nNever fail to ask me about my day or what I'm doing and they always get excited about things with me, they're just an amazing team. And more props to them because their station is inside a mall, so it's not a full on regular Starbucks store, but they still manage to create the feeling of friendliness and home that's a trademark of Starbucks. Love the team here, wouldn't want to go anywhere else!", "author": "Francisco P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "This Starbucks does its job - to function as a Starbucks. They'll get you your drink, but they might screw it up, and they're pretty slow. They also tend to mess up names relatively consistently.", "author": "Kendall F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-10", "description": "For such a small spot this place is one of the busiest SB. I think they handle more traffic than westlake and Junipero SB combined. This place has a high turnaround of employees but as long as they get my coffee out fast and tasting good, i dont mind.", "author": "Cee B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "Lines can be long and at times the stand is understaffed for the volume of people waiting in line.", "author": "CityGirl C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-09", "description": "I come into Stonestown alot and have never bought anything from the Starbucks there. I decided today I wanted a green tea latte so I stood in line. I gave my order when it was my turn and was upset when I saw my order. The barista totally did not make what I ordered. Every Starbucks I go to I get the correct order and this didnt even come close. I would have given this place a four star but since it got my order wrong, I can only give three. It wasnt even busy when I went there too...", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Funny story. I went to get a frapp. \nMe: Can I get a ______ frapp?\nGuy: Do you want whip cream on that? \nMe: Matthew.\nGuy: Matthew, do you want whip cream on that?\nMe: No... \n\nI didn't hear him!!!!!!!!!! I swear!!!!! I totally failed. I haven't been there since. I'm still terribly embarrassed from that disaster.", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "Thank you for opening when the rest of the mall isn't. The baristas are nice there =) And sometimes they ask if you want a free extra shot in your latte. \n\nDrink-wise. .... I was a caramel macchiato addict before but now I only drink vanilla lattes or chai latte. Remember to ask for NO WATER Chai because for whatever reason, Starbucks put water in their Chai's .. and it really waters it down and makes it yucky. \n\nThe Honey latte's kind of weird. I never liked the seasonal drinks..", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "A HUGE LINE! They should' have gotten two registers going. I just got the Coffee Frap. and a morning bun! I love morning bun! But I wished it was warm. But I do not think they have a oven in that little kiosk!", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-11", "description": "Since I only find a slim selection, slow service and higher prices at this place I stop elsewhere for my caffeine on my way to work in the mall...", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-06-19", "description": "This is by far the worst Starbucks I have ever been to. They are rude, slow, burn the milk, and always mess up the drinks. I've gone back a few times to give them another chance, but it's always the same thing. I will never go to this location again.", "author": "Iliana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-20", "description": "this starchmucks is pretty decent.\nwhen i was at sf state some people i had classes with worked there too.\ni like the way they make their drinks here.  good frappuccinos and pretty quick and friendly young folks.\nnot sure how they do their hot drinks since i rarely get hot beverages at starchmucks.... it just seems like a bad idea most of the time since beans are usually burnt... but frapps are tasty and shouldn't be a difficult thing to make", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-04", "description": "I have been here many times and never gotten a messed up drink, so they are consistent with the quality of the drinks. Its just that the service is slow, especially compared to other starbucks. This place takes a bit longer and the last time i was there, which was on tuesday, i swear it took more than 5 minutes after paying for me to get my drink and there wasn't really a line or a lot of people already waiting. I went to a different starbucks this morning and they were busier, but I still got my drink within several mins of paying. My latte is not complicated and it normally doesn't take that long...", "author": "Steve Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-15", "description": "i've been here twice this week, and both times was a little less than mediocre.  how can you get a tall one-bag zen green tea wrong?  freaking lady gave me a tall china green tips green tea.  which btw people is nasty nasty.  what country are you living in because when i last checked, we were living in america.  i really don't want to get into the whole race thing, but the servers greeted the person in front and the person in back, but not me.  that's fine, i come here for coffee and tea, not because you have good looks, manners or any social skills.  wooshawwwww.......", "author": "Paulina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-19", "description": "The best Starbucks I have been to. The ones closer to me just flat out suck. Props for the mall Starbucks =)", "author": "Nicole L."}
