{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-04", "description": "I find that in reviewing a single franchise of a worldwide están like this can be quite tricky so I'll leave it specifically to things that can be controlled at the local level. \n\nThe customer service at this place was shit. I mean 2 stars. I'm not sure if it's because they are right by the warf and most of the patrons are tourists or if it's just the culture of this neighborhood but the employees seemed very unhappy with their choice in where to work. No smiles, no politeness. \n\nThey messed up my drink in that the cashier thought I wanted it hot when I asked for iced. The barista offered no emotion when I asked them to remake it, no advice offered on the best way to handle said situation and clearly wanted to be somewhere else. \n\nThe ambiance is pretty cool though. It's small inside. I think there are 5-6 tables inside and none outside. It was pretty busy but the vibe of the neighborhood was cool and I'd bet this place would make a great place for people watching. \n\nAlso somehow they did manage to make my drink to perfection. Much better than my local starbs in LA. \n\nSo I'd say if you want a really well made coffee, come here but get in and get out fast and don't expect them to remember you even if you come here every day.", "author": "Fazil A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "It is shocking how terrible this Starbucks is. I live around the corner and so I've been there a handful of times. Tickets get lost, no one is responsive when you nicely ask if your drink is coming up (totally understand you're busy but so am I and I've been waiting for 25 mins AND multiple people who came in after me are getting theirs)... most of the people who work there are rude and seem like they have no idea what they're doing. For such a high-traffic place you'd think they'd train at other stores and then allow employees to work at this one. \n\nAlso ordered a drink today with no whip, it came out half filled with a ton of whipped cream. Go here if you like to be unpleasantly surprised with your experiences.", "author": "Rosie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Steps from Fisherman's Wharf, this location offers up the goodness that you come to expect from Starbucks.\n\nDrinks are reasonably priced and service is quick.\n\nJust wish they ran the AC it was a hot day when I visited and was hoping they had it on as I sipped on my drink and relaxed before hopping back on the cable car.", "author": "Arnel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "During a whirlwind weekend trip to San Fran, we stopped at this Starbucks in the midst of our sightseeing and tourist activities to recharge ... literally. This larger store had lots of places to lounge, so my friend and I sat in two of the larger chairs that were located next to outlets and recharged our phones. We were also super thirsty so we got two Venti waters.\n \nThis Starbucks detour ended up being a blessing in disguise, though. I have a collection of Starbucks gift cards from different cities, and I ended up finding the San Francisco-specific gift card at this store. I was also able to find a cute SF Starbucks mug (I have a growing collection of the \"You are Here\" mugs as well). It was a nice place to stop and rest for 30 minutes before we continued on our city adventures.\n \nThis Starbucks store was pretty clean, well lit and organized, and the employees were really friendly. I wouldn't hesitate to revisit.\n \nEven though we didn't order any coffee during this visit, here are some of my usual orders: \n \nIced/Hot Caramel Macchiato: This is my go-to drink at any Starbucks. It features vanilla-flavored syrup combined with full-bodied espresso, milk and ice. I usually get the iced version and ask for light ice, and I order it with soy milk and asked for it stirred (instead of layered). If the weather is chilly, I order this drink hot, but more often than not, I get it iced because it tastes more refreshing and I enjoy the creamy taste of milk and the caramel drizzle. Getting this drink hot is just as comforting, and I often drink it slower to savor the slightly smoky taste and the hot, rich caramel. During this Starbucks visit, it was winter and colder outside, so given the option, I would have ordered this drink hot. \n \nChocolate Chunk Cookie: This is one of my favorite Starbucks snacks and it's usually in stock during my visits. I like these cookies because they're soft and chewy - I love softer cookies over crispy, crunchy cookies. And, they don't skimp on the chocolate; each sports a good amount of chocolate chunks in each. \n \nCake Pops: Yeah, although cake pops can be gone in 1-2 bites, they're the perfect little bits of bite-sized bliss if you're trying to stave off hunger or just need a pick me up! The chocolate chip cookie dough flavor is my favorite because it reminds me of my favorite ice cream flavor ... and there's lots of chocolate chips in here.", "author": "Kelli S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "I order what I always get, a black tea lemonade with three pumps of raspberry, and it tasted like it's supposed to. Despite being in a tourist heavy area there was no line and I ordered and got my drink in about 5 minutes. The workers are friendly and so are most of the patrons.", "author": "Libby M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "Sign on door says store closes at 930pm..tried the door at 9:05 and it was locked...employees inside just looked and laughed...all I wanted to do was buy a souvenir cup...", "author": "Will H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Not sure what happened to this location but usually it's fairly decent. Customer service is really poor here. Today they barely acknowledge you, and not only got my order wrong and forgot my sandwich order, but made me feel like I was the problem and mumbled sorry for making me ask twice for my sandwich. Is something wrong with Starbucks corporate culture lately? I hope this is not the norm but just a bad day.", "author": "Edward L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "Ordered hot mocha, got hot chocolate instead. I was waiting in the line to use the restroom so I did't grab my coffee right after the barista place it on the counter. When I picked it up minuets later I asked the guy if this cup was for me as I repeated \"hot mocha for Julie\" he looked at it and said \"yes because it's been here for awhile\"!!! I mean, did you get my point? I was just trying not to grab someone else's cup and yes I asked if this is \"a hot mocha\" of course you looked at it and you knew it wasn't. Oh - and I didn't order \"light whip\".", "author": "Dreamm K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-12", "description": "This store is an embarrassment to Starbucks.  The staff is very unfriendly and service is extremely slow.  After waiting several minutes for my coffee, I went up to check with the barista.  Another customer was asking about their order also after waiting awhile.  Neither of our drinks had even been started.  The store was not very busy.  Now I understand why they don't have many customers.  The restroom was filthy and there was no toilet paper.\nWill not be back to this location.\nAfter reading through some of the other reviews, a huge number of 1 star reviews, I wonder how this store stays in business.\nHow can Starbucks not do something about this failed location?", "author": "Scott B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-28", "description": "This location is right at the cable car terminal. So i imagine it can get busy with alot of visitors. The barista & cashier are tortoise speed on the Sunday afternoon i was there.\n\nTables/seating is very limited. No outdoor seating. Indoor seating consisted of a long communal \"bar\" table, and a medium sized round table that can seat 6 or so, and 2 other tables. It's super odd why smaller tables aren't furnished?\n\nOn the day we were there, the door was propped open, which was not optimal as it was a windy day and w/ the round table so close to the door. Bc the garbage hadn't been taken for quite a while and it was on the verge of spilling out, when the wind came in the garbage actually spilled over all over the floor.\n\nAdditionally, i asked for a cup of hot water, which i've done many times at other locations, and was refused, informed \"we can't provide hot h20\" so i asked 'ok, how about ice water\"...and they complied....does he think a grown arse woman is gonna scorch herself ....i mean you sell hot beverages ...duuuuh", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "This location looks pretty spacious but there are two main tables. There is one restroom for everyone so the wait can be pretty long. \n\nI ordered a mocha frapp with no whip (specifically told the cashier that) but he never wrote it down on the cup. Very disappointed because there was only one person in line waiting so being busy and not hearing what I said was out the door. \n\nI wish they can take some time to make the drinks because my mocha tasted like mocha/java chip. Like what?! How does that even happen? I drink Starbucks often enough to know the difference. But I'm fine with a few java chip pieces in my drink since I drink java chip and caramel frequently.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "This place deserves zero stars. Couldn't believe the unprofessionalism i experiences at this store! DISQUSTING! AVOID AT APL COSTS!! The workers have no uniforms, bathroom is disqusting, my drink was sat for 10 minutes before putting it in the cup and they didn't even announce the drinks as they came out. The tables were filthy! They definitely lost my buisness", "author": "Katelynn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "Ugh what he heck happen to this joint ? The bathroom have 30 minute wait due to one of the stalls are out of order. The place is not kept clean like before.  Another site off my list.", "author": "Nanny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "So you know you go to a Starbucks  often and the girl is wicked when you show up to order and the girl points out a coffee on the counter with the scanner in hand ready saying \"it's yours\" and you haven't finished putting in your order...\n\nI said how did you know what i was going to take?! She said Double espresso with a bit of steamed coconut milk , you come here all the time....\n\nI'm a canadian in San Francisco.... @Starbucks Bay st, North Beach SFO....I'm impressed!!!", "author": "Stefanie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "NO POWER OUTLETS! To add insult to injury, they have covered them up with plastic. I bought a coffee, took out all my materials, and prepared to get to work, only to realize I had unknowingly walked into the worst Starbucks in San Francisco. I think it's a terrible customer service decision to not offer outlets -- didn't Starbucks partially build their brand on offering a place for people to study, work, etc.? On top of that, the staff is rude. The barista wouldn't even look me in the eye when I asked if they had outlets. They are obviously trying to prevent people from hanging out here all day, but if I pay for a coffee, it would be nice if I could charge my laptop for 15 minutes. That's an unspoken rule of coffee shop culture, and shame on Starbucks for daring to break the agreement! AVOID THIS STARBUCKS LIKE THE PLAGUE.", "author": "Zoe Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Very poor service Rude staff, lost my order and didn't even apologize  \nBathroom was absolutely disgusting", "author": "Kathy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-04", "description": "Very possibly the most filthy coffee shop I've ever been in. Open just an hour this place clearly still dirty from the previous day. Tables are caked with sugar coffee and cream floor littered with trash. No effort by employees to clean things up.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Consistency is the bottom line. Like it or not, Starbucks has it.\n\nYes, relative to just about any other cup of coffee in San Francisco Starbucks taste burnt but they have bathrooms and you know what you're going to get.\n\nI usually just get a small black cup of coffee.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "This Starbucks is absolutely horrible. I placed my order for an iced coffee with sweetener and room; afterwards, two people placed their orders and they happened to get their drinks after me. I'm not sure what the screw-up was but the barista should have been aware that I was waiting for a drink since I was standing in front of the pick up spot. The cashier behind the counter had the common sense to realize that I did not get my iced coffee and went out of her way to make it. However, she screwed up as well as I requested for sweetener and room. It is really hard to find a decent Starbucks today and this review justifies it.\n\nPS- IT DOESN'T TAKE FOREVER TO MAKE AN ICED COFFEE!!!", "author": "Gerry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "The store employees are nice and helpful, but my mobile order is never correct. Good items tend to be missed.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Awesome Starbucks! I came to Starbucks for a green tea frap with caramel drizzle. I asked for a \"large\" they chuckled and said \"what\" then I said \"Venti\". They gave me a chuckle. I mean which Starbucks will do that. Anyways, I enjoyed my green tea frap a lot! Overall , I will definitely be back if the line is short.\n\nUpdate: Get Venti ice coffee with half/half creme and syrup. It tastes very good when you are tired.", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Let me start by saying if there was a negative star system, that's what this location deserves. Without question, this is the worst Starbucks staff I've ever seen. Note to store manager, you may want to stop hiring children to to run your store. Not necessarily age, but they are poorly trained and have ZERO respect for customers. My last and final visit to this store went like this...... was charged for 3 drinks when I only ordered 2. When I politely asked why my total was so high, Matthew seemed extremely annoyed that I was questioning him. When he realized his error, he rudely said to insert my card into the machine to get refunded. At no time did he apologize for his error. Our drinks were called out and we didn't receive any kind of greeting such as a simple \"thank you\". Finally and the most disturbing part of our experience happened as my daughter and I were finished preparing our drinks at the condiment bar and were walking towards the exit.  Wayland, I believe was his name, made a loud comment for us and the entire dining room to hear \"thanks for making a mess in our store\". At this point, this comment was enough to push me over the edge to reply with a comment back to him. We did not leave a mess. With the way the condiment bar is designed now, you have to throw the trash through the front instead of the top. A few sugar packets apparently fell on the floor. Regardless, isn't it the partners job to ensure the store is kept clean? Which on most of my visits, this store is not kept very clean. As I was explaining this to him, he walked up on me with my daughter standing next to me like he wanted to have a confrontation. I asked him \" are you walking up on me?\"  Threatening me..., really?? He quickly took a step back and just looked at me. By this time the shift supervisor, Kevin, walked up to me and said \" I\"ll talk with him, now get out\". NEVER have I had such a horrible experience. Anyone who decides to visit this location, you've been warned! Spend your hard earned money at another Starbucks. One that appreciates your business.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "Not enough seating given it's location. And not enough plugs. \n\nIs this an anti-loitering strategy? Who knows.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "I know all Starbucks are busy but let me tell you this one is extremely busy because it's at the Warf. They sell out of things fast. It was 9 and we ordered a blueberry muffin and we're told they were out. Got pumpkin bread and a coffee cake , heated fairly quickly for how busy they were , they forgot my drink since the girl never made a cup so that was a draw back but good overall. \n\nThe girl was very fast at making drinks so that helped !", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-14", "description": "Nothing wrong with the coffee at this Starbucks, but the tables and trash could be cleaned a bit. the menu is rather limited with the price of only the grande, maybe the regular coffees could also be listed.", "author": "Jonas F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "The prep area in the store was an absolute disaster. Soy milk, caramel, cups and lids were strewn all over the counter. The drink maker was doing his best but was slinging stuff around right and left, leaving the drinks a pure mess when you received them.  The restroom was a total disaster (see related photos). The store did not meet my expectations of a Starbucks store.", "author": "Tracy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "A very unusual Starbucks as it's in a very spacious space. But as another reviewer noted, notwithstanding the spaciousness, relatively little seating and outlets. Nevertheless, if you are able to secure one of the tables with outlets, it's very comfortable, noise is not overwhelming, good views to the street, and people watching.  All of which makes it one of my preferred Starbucks in San Francisco.\n\nDefinitely has a character you don't find in most Starbucks.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "Horrible customer service. Waited half hour for a microwaved egg bite. It was thrown on the table like they are serving dogs. Other customer was also treated badly. This is among the worst Starbucks I've been to.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "Typical city Starbucks, a little bit dirty (don't mention the toilets), but with fast service. I'm giving props to the cashiers who have to deal with tourists every single day that either don't know how to order or don't speak English. Talking about language barriers.\n\nVerstehen Sie Deutsch?", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "It's a Starbucks.  The employees are nice, but the facility itself was in need of some TLC.  There was trash on the ground, some of which was dropped by an employee who disregarded it.  There are a couple of small tables and then one long communal table inside, and like previous reviews state, it is in need of more seating.  Outside is right by the trolleys so it was jammed with people.", "author": "Fred P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "Extremely rude and inept cashier. I asked for a cup of hot water and offered to pay for a large coffee, and I was rudely told that they're not in the business of hot water. Very sad. Horrible customer service and profiling.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-27", "description": "Poor customer service. Wasn't greeted at all. Messed up my order and my friends. They fixed mine, but when my friend asked to get hers fixed one of the employees said to her \"so you want me to remake the drink so you could have it all around the cup?\" when she paid for extra mocha and caramel for a special drink.", "author": "Crystal S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-29", "description": "This review is for the older (white) male (with black hair) cashier that was working yesterday 3.28.17 in the morning. He shouldn't be working with the general public; piss poor attitude. If people annoy you so much don't take orders at a Starbucks especially in Fisherman's Wharf. I was with my coworker and we were ordering a bunch of drinks and this man totally ruined our experience. He had an attitude because we didn't know our gift card had a low balance and snatched our cash. And kept making comments about how he has to go back on his screen. Wow! That's such a big issue. \n\nI go to this Starbucks frequently because it's so close to work. Two stars because of the baristas least they have a positive attitude. \n\nThe next time I go to this location and if he's working I will gladly walk out and walk a few more blocks down to the Beach Street location", "author": "N M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "There are times when this location maybe busy. Especially since they are not far from Fisherman's Wharf. However, it wasn't too busy and no long line when I came in earlier this afternoon. Holiday Themed Beverages are now being served.\n\nThe team members were very friendly with the can do attitude to prompt and courteous customer service. I came in for a Bacon Gouda Breakfast Sandwich with a Peppermint Mocha. My order was ready for pickup within 10 minutes of ordering. That's extremely fast and good! Positive first experience here so I will be back next time. A lot of my previous Starbucks Coffee patronage concluded with positive experiences. I can certainly count on Starbucks when I need a fast cup of coffee.\n\nReasons for rating:\n- Clean facility\n- Prompt service\n- Friendly team on duty\n- Powell / Mason Cable Car turnaround right outside\n- Trader Joe's on the corner of Bay and Mason\n\nPassing by, running errands? For whatever reason, Starbucks Coffee is here when in need of that cup of coffee.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "The staff at this Starbucks are amazing. They were very friendly and accommodating. We were there with 2 toddlers who were all over the place and they kept checking in. Michael the manager was especially accommodating. Best Starbucks I have been to.", "author": "e w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "This is a busy Starbucks and I think its the only one in or around Fisherman Wharf. Came here to pick up drinks and the city mug. I found the San Diego mug here but not the San Fran. Grrr.... that would mean I would have to go to another Starbucks. Well I asked if they have the San Fran. The server went straight to the shelf and got something else that is not a city mug but a San fran Waterbottle. He said it has the world San Fran and same design as the mug. But that is not what I was looking. Well its a good try and I really appreciate that.\n\nThis Starbucks is quite busy compared to the other ones. Drinks are not bad same as other Starbucks. In terms of gift selection they have quite a few. \n\nThe place is quite clean but because of how busy it is. Seating space is limited. I just grab and go.", "author": "Denise W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "OK, I am a Starbucksaholic! \n\nI needed coffee and some food so found this Starbucks not far from Fishermans Wharf!\n\nAlthough the tables are not exactly clean, the baristas are constantly busy and don't have much time to wipe down the tables because they are constantly serving customers.\n\nI ordered a vanilla latte with long shots and it was just right.\n\nThis is in the heart of tourist town so I don't expect perfection.\n\nThis Starbucks is the closest to the wharf so enjoy it.\n\nThe barista was efficient and my food was perfect.", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "Staff is very rude if you are not a regular customer here. TOURISTS MUST AVOID.  They like to kick around their customers to show who is boss. They had me line up when there wasn't even a line at 7:30 am. You might even get arrested here for no reason. Lots of homeless regulars hiding in here wanting to start trouble.", "author": "George C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-06", "description": "The cashier half ignored me. Rude. \n\nAlso this place has no restroom for customers. I absolutely have no idea how there are people hanging around this place. I would imagine there are better coffee places that serve better drinks and have a restroom.", "author": "Siamrath B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "I went in on a weekday morning. I was able to park on the street just outside the store with ease. Line wasn't too long- Barista was excellent and my coffee was made exactly the way I like it very quickly. \n\nI loved the ambiance of the store. I would have loved to have stayed to enjoy my coffee and do more people watching. \n\nGood location, good coffee. Can you ask for more?", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "This is a very nice Starbucks.    Walked in and it has a beautiful interior.   The service was fast and friendly.    Our drinks and desserts were good.   No issues.   Good stop", "author": "Craig T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Nice location, near public parking at World Market. Very busy but was clean when we went. The baristas were very friendly and made my drink, iced vanilla latte, perfectly! When we take visiting friends and family here before we hit the Codmother and Pier 39. It's also close to the trolley.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-13", "description": "Lazy manager Michael left all the sale signs up well after they expired. You have to read the fine print in teeny tiny type to be able to see that.", "author": "Phil C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "The guy who took my order was nice enough, but the guy making drinks should work in a cubicle away from the public. The milk they had out was bad so my americano tasted sour. I ask for a new drink and fresh milk, and he acted like I was a inconvenience.  Then after waiting for the bathroom the employee comes out and says it is closed for the day, but that's not what they told me at the register when I asked. So no one else knew the bathrooms were being closed?, or did he make it up?  For some people getting to the bathroom timely, is a big deal. Not friendly, rude, and didn't seem to care that me and other customers got a mouth full of sour milk.   Hint: if you don't like your job, quit.", "author": "Lesa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "This was our last stop in San Fran before heading home to SolCal.\nThe store was pretty big. Located on the corner right by the train/trolley station. Im from out of town so please excuse my knowledge on the names of the unique transportation that the city provides. \n\nThe restrooms were clean. There were several one seat couches available.", "author": "Katy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-23", "description": "First time I went in there, I was less then impressed by the cleanliness. I kind of work near by and anytime I drive by, there are always a few spots magically available. Very convenient. The first visit I went in, and found a pretty long line. This location is very busy and lots of tourists are in and out. I waited in line and was greeted by a 20 something year old grumpy chick. No eye contact, and looked very irritated. I ordered a grande pike place. I paid her, and went to the condiment bar to hook my coffee up. The bar was a mess. The garbage was overloaded and spilling out, there was no cream left, and sugar dust every where. As annoying as a dirty Starbucks is, no big deal. They were busy. Probably caught them at a bad hour. \n\nFigured I would give them another shot. Perhaps the chick was having a bad day, and it was super busy. I came back 2 days later, on a relatively slower time frame... Same thing. Cranky less then pleasant Baristas. and a dirty condiment bar. This time, I was going to eat so I used the restroom to wash my hands. dirty restroom. I washed my hands... then shocker... the air dryer was broken. I had to walk out  and use a tree full of Starbucks napkins. I let an employee know the dryer was not working. \n\nI have returned 5 or 6 time after that, and still not a working dryer, and i keep finding the condiment bar dirty as well as the seating areas. I still haven't really had great encounters with the baristas. they look bored or hate working there. I will snap a few pictures next time and add them to this review.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-23", "description": "Except for the coffee,... This store is a mess.   The restrooms tell the story of a store.  This one is a fail.   The restroom had no TP,... Napkins and seat covers used for TP.   No hand soap and no hand towels,.. Only a blower to dry your dirty hands :(", "author": "Plantgarden D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-06", "description": "I know this SB is a very busy place, especially in summer due to its killer location right at the Bay and Taylor corner of the cable car terminal. I know it's hard to keep everything stocked, and the floors clean. I know that there's not enough people to clean everything, BUT is it just too difficult and of little significance to look once or twice a shift at the bathroom, and really not that important to have the tables cleaned now and then? Is getting everything stocked and the drink orders so important that we forget the service part of customer satisfaction, which - more than getting the drinks and orders correct - includes the happiness of your clients and having a clean place to walk into, and having a clean table to put your stuff on, instead of typically having to grab a bunch of napkins and spending 4.2mins to clean your own table?\n\nbleh......\n\nTo add to it, in the 35 mins I was there, I couldn't connect at all to the wifi. Did SB take away the free wifi?", "author": "Tony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-15", "description": "i don't write yelp reviews but everyone who works at this starbucks is either incompetent or has a terrible attitude so i felt obligated to write. except that one girl she was nice and gave me honey.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-26", "description": "I asked the cashier if he could break a 20 for me. But he said I had to make the order first. So funny!", "author": "Kevin X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "This place was very busy when I walked in. It was packed and it looked like it hasn't been cleaned in a while I waited in line for about 15 minutes and ordered my usual: venti iced green tea sweetened.\n\nWhen I got my drink, to my disappointment, it barely tasted like anything. I wish they were able to take their time making quality drinks here rather than rushing on the orders and making below average drinks.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-25", "description": "I drove over from my neighborhood to this location because it looked as if this was the only store open until 10pm. When I got here at 10 minutes to 10 the three employees said inside that they were closed.  One finally came to the door to tell me that the manager said they could close at 9pm.  Would be super helpful SBUX to avoid the guess work and correctly post your hours.  Grumpy.", "author": "Molly C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-25", "description": "Boo I hope Matthew is just having a bad day and not an unfriendly guy. No greeting. I wasn't sure when to start ordering because he didn't make any eye contact or do anything else to let me know he was ready to take our order. As he stared off into the distance I went ahead and took a gamble and placed our order, he never asked if that was all so we let him know when our order was complete. He did ask if we wanted the receipt, no thanks, no response. Cheer up guy, your job is taking orders and making drinks, not the worst gig ever", "author": "Kris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "It's a Starbucks people. You've seen one you've seen em all. This one has a lot of space for tables but not many tables which seems kinda like a waste of space but I guess people don't come to stay at this one. I'm not from here so I don't really know but it seems like there's some wasted space. Great coffee as always though.", "author": "Heidi D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-26", "description": "Probably the worst Starbucks I've ever encountered. It took the cashier about 5 whole minutes to learn how to properly ring up my order, and this is with the manager's assistance. The manager made my drink and just plopped it down on the counter and walked away. I had to ask him if it was mine. My drink tasted terrible and there is no customer service even from the manager (name is Jay?). Yuck. Do me a favor-- find a Peet's Coffee or 7-11 and it will probably be delicious.", "author": "Veda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "A Starbucks is a Starbucks like most other Starbucks\n\nFood? Check\nDrinkage? Check\nSitting/People Watching area? Check\nLittle Girl's/Boy's Room? Check\n\nIn the touristy area of SF right by one of the cable car starting points, keep hydrated whilst roaming this fair city. No city can be throughly enjoyed without an iced tea in hand, so grab and go forth!", "author": "Emily G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "I had my Starbucks charge for the first time. Very smooth and customer service the best! It is! Soilate was also delicious. PC is easy and good environment. It was a bit cold. All right", "author": "Miwa I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-21", "description": "On Sunday and Monday I went to 4 different Starbucks in San Francisco and was told they were out of my order. No almond milk, no yogurt parfaits and no skinny mocha. A busy area and a busy weekend and they weren't getting deliveries until Tuesday. I've been a gold card holder since Day 1 and this is not acceptable. Almond milk is a basic. All of them were filthy!", "author": "Ann K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "I give this Starbucks three stars for the friendly barista and the good music.  Call me a snob. I worked at a Starbucks where the managers whipped us into shape.  We were expected to deliver nothing less than stellar customer service.  We were able to provide fast, efficient service and keep the location cleaned.  I don't see that happening at this location.\n\nSeveral times they have goofed on my order (which is usually a shot of espresso or a refresher).  They are often out of products or don't add enough syrup to drinks. They take forever to prepare drinks and sometimes don't even announce it, so I'm waiting and waiting and 8 minutes later, my cold, flat solo espresso is sitting on the counter.  They are also not good at stocking their condiments, napkins, or cleaning the restroom.  And sometimes the baristas seem distracted; if  I approach one behind the counter, they are usually caught off guard as if I interrupted some juicy conversation.  \n\nI'm trying to not be too hard on them, as barista-ing is not easy.  But if I'm expected to spend a ton of money on their products, the least they can do is get it together. That is all.", "author": "Di P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Needed my cup of java of the day.......\n\nJust like any other bucks\n\nAll look the same\n\nLong line\n\nFriendly staff\n\nFree wifi\n\nCrowded as usal\n\nCoffee taste the same..... ..... ....\n\nPrice is the same........\n\nLooks the same\n\nJust another bucks", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-11", "description": "Avoid that place and go to other Starbuck. It's most filthy and dirty SB I've ever been to. Floor wasn't sweep for months. Table was so dirty and sticky that customers started to clean the parts they wanted to sit at. Disgusting.", "author": "Szymon G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "its a ok Starbucks in a tourist area. Its clean and wifi works.\nJust too bad every time I go there on a Sunday afternoon they always run out of coffee and you have to wait 20 mins or come back later and have to wait in line again.", "author": "Mod Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-30", "description": "save yourself the headache, don't even bother with this location. they messed up my drink on my first visit. they messed up all three drinks on my second visit, it took them three try's on one drink. the worst Starbucks, hands down!!", "author": "Bingham M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-03", "description": "Why are these employees so annoying.  Don't laugh at me for needing a receipt, that is horrible customer service.   Only reason I even go to Starbucks is because my job gives me a monthly voucher.  The two working there today were like Disney-level sad.\n\nAlso Starbucks should be a place with speedy service, not like the glacial pace they move at.", "author": "John C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "Bathroom here is disgusting- stinks of pee, garbage on the floor and no toilet paper. Eww eww eww!", "author": "GracieTheCat H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-16", "description": "Dirty tables and a bathroom that was absolutely disgusting!!!!  So gross and so beneath what I thought was Starbucks standards.", "author": "Murray H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "Slow,  slow, show.  I guess they use this location add the training pod.  But the regular folks who frequent here suffer the most.  25 minutes for two pastries and two coffees. .. and counting.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-11", "description": "Tomato & cheese croissant! So damn delicious", "author": "Court S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "A tad more expensive than other Starbucks because of the area it's in, but the same stuff really with more room to lounge around. There's a giant table to sit around, lots of cushy chairs, and several other smaller tables. Service is a bit gruff, and sometimes, it's actually a little...not sure how to describe it...ditzy? Airhead-like? Maybe it was just the afternoon baristas, but this place gets the job done.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "I went through a break-up at this Starbucks. That was not fun... Maybe that's part of the reason why I don't find it as comfortable as the other Starbucks that I frequent?...\n\nSometimes, you just need a coffee after a shopping trip at Trader Joe's though. TJ's little coffee samples can be a good tease and lead you to want more espresso-y deliciousness. That was the case for me yesterday and I enjoyed a yummy skinny vanilla latte and the nice baristas working at Starbucks on 2/20. Hopefully I'll never have another break-up at Starbucks too...!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "It's a great place to get a quick coffee or something to drink. There are a couple of hours that is consider as rush hours when the high school students are out and they come down to this starbucks and get something to drink. So be prepared to wait between 3-4pm.", "author": "Nick F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-16", "description": "We were standing at the intersection of Columbus and Filbert when bf said, \"I need my iced coffee.\"  \n\nBy that he means, \"I'm only going to Starbucks.\" \n\nImagine being in North Beach, surrounded by a gazillion cafes and he wants Starbucks.  \n\nMe: \"Why not go to one of the cafes here?!\"\n\nHim: \"They don't have my classic syrup.  And it's only 0.7 mile walk.\"\n\n* I hung my head in the air.  Why? why?  *\n\nThis was the nearest location that iphone gave us.  But a 15 minute wait for iced black tea on a warm day is an eternity.  Why does this location only have 2 people running the show on the weekend? \n\nAND the unisex bathroom was a mess.  Ew.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "The product is standardly good, but service is what truly sells and keeps people coming back. The earplugged hottie was on his customer service game today at 6:30am bright eyed, helpful, confirming my order, and pleasant. \n\nThat makes the dreaded \"butt crack of dawn\" more palatable. I'll be back to this one!", "author": "Jesse R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Recently got a remodel which is very nice and now they have a clover coffee machine. As usual very nice employees here.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "How come so many people dislike this place?\n\nwell I guess I can't really say much cause the only thing I ever order here is a Ice Latte..and its actually a very easy drink so I guess its something they cant really mess up on.\n\nAnd the service hasn't been shabby either...\n\nI also enjoy getting my ice latte here because of the parking. There is actually a lot of space not a long walk to the wharf so after i get my drink i can just wander around for a bit and enjoy the people watching.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "Ordered a large lime refresher and got my drink PDQ. Another instance where they got my name wrong. The plastic cup was \"sharpied\" JARICK.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-23", "description": "Crawling with tourists! With that said, the ladies behind the counter were patient, even when there was a language barrier.  My drink was A-OK in spite of the chaos.", "author": "Andreas H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-30", "description": "It's a good sized location but the staff there is awful. Disinterest, practically sneering attitudes. I'm sorry, does this East Coaster bother you? Get bent.", "author": "Cronut C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "Slowest starbucks ever. There was a gigantic line with one cashier that took a extremely Iong time...then everyone was waiting at least 10 minutes for their drinks...how is this even possible???", "author": "Bonnie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "Worst Starbucks experience I've ever had. Lazy and rude staff. Doesn't refill straws and ignore you when you ask politely only to yell at you when you try to get one.", "author": "Alice B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-18", "description": "Worst Starbucks   I've ever been to... Rude cashier too slow barista and got the wrong order I didn't bother to tell to the barista bec she's having hard time of what she's doing...", "author": "Ronald V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "I love this Starbucks. The location is great, the barista is super friendly, lots of seating space. I can stay here for hours on a tall coffee and they never have a problem with it. If you register your Starbucks gift card you can get wifi and coffee refill for free.\n\nThis place is also great if you like people-watch (or tourists-watch) and see the cable car turnaround.", "author": "Novalina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "I like my barista she has brown curly hair.. I shld ask her name so i can commend her for my yummy coffee she makes me. I figured. After going there many times. Her name is TAYLOR\nshe has the best smile to greet you when you arrive and makes the best drinks. \nHands down to taylor- ahem... top dogs...\nshe needs to be promoted*** hint, hint", "author": "Monika T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-23", "description": "ordered 3 drinks...\nPeppermint Mocha\nWCM Peppermint: No Whip\nKids Hot Chocolate:No Whip\n\nWHY did all of our drinks come with whip?  even after the person taking my order joked about giving my PM all of the whip from the other two drinks?  But really why did the Barista who prepared our drinks give me attitude when i asked her to remove(not even REMAKE...) the whip from the two drinks.  \n\nThe restroom code was given as i handed over payment.  The restroom was not clean.  There were 3 workers and they were having gossip session in between orders.  \n\nBoo on this location!", "author": "Vena F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-07", "description": "It sucks when you're swamped with work and management doesn't provide enough staff to allow you to do your job well.\n\nI've stopped at this locatation before and gotten a decent chai latte with not too much wait time. Yesterday I stopped and the line was almost out the door. It's spring break. With San Francisco being a major tourist destination you'd think they might put more people on duty.\n\nOnly two slammed Starbucks' soldiers were pitching drinks to the SF masses. The wait was LONG, the latte was WEAK. If I'd gotten a parking ticket in the bargain I'd REALLY have been pissed. \n\nThis is now only an emergency only stop for me. If I can get it in the 'burbs, I will.", "author": "Novato A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-01", "description": "Are you really checking out the yelp review on a Starbucks?\n\nWell, this one is like every other Starbucks. Average coffee, a lot of flavors to add to your espresso drink.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-17", "description": "my second starbucks bathroom fail in san francisco during my visit, but this time i didn't even get to step into the restroom because it was closed...  uhh?? (apparently taylor b. had the same problem)\n\ni ordered a caramel apple cider for nothing :(  was hoping it'd do my bladder some good but ended up doing it some bad having to chug that cider because it wasn't allowed on the cable car.\n\ngreat location, right off of the final stop of powell and market line, right before you head to the fisherman wharf.  \n\nsizable location with friendly staffs, but wasn't clean to my standards.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "I can see why people can give one or two stars for this location. \n\nThis location is practically bound to have groups of tourists in and out, considering that it is located right in front of the main cable car stop.When I came here last week, there was only one customer was ahead of me. Literally right after I ordered, ten people were behind me. Suggestion is to definitely consider having more employees, as two are simply just not enough for efficiency. \n\nFortunately enough, every time I come here, I am able to dodge those crowds. \n\nWorkers here are always nice to talk to and on cold days out, it feels absolutely amazing to walk into a fully heated store!", "author": "Shirley A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "Love this starbucks cause they carry La Boulange bakery and they actually remember my name and order.  Great customer service at 6:30AM!", "author": "Ying F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-07", "description": "Only come here if you have at least half an hour to spare. They are always understaffed, they really should know better being in fishermans wharf.", "author": "Caitlyn G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-15", "description": "I ordered orange-mango shake, it totally tasted like banana shake. I didnt feel any orange, or mango. \n\nI bought the drink just to sit down and study, and finished a few pages, and I give the stars just because I was able to do some work from my paper. :)\n\nPS. There's \"People love us on YELP\" sticker on their door. With two stars? huh? ))", "author": "Shab A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-31", "description": "Horribly slow service. Took over 20 minutes, during the morning rush, for two coffees and a sandwich and i saw several people waiting even longer and/or having to send their drinks back. I guess they don't really care about customer service since they are located next to several hotels and cater to mostly one-time customers. No excuse.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-26", "description": "Kind of a busy place with tourists hustling in and out, but they play good study music and have great tables for getting work done.", "author": "Megan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-20", "description": "Hands down the slowest Starbucks I've been to. 7:15 on a weekday morning isn't time for pat-a-cake with your coworkers behind the counter; save the small talk for when things slow down. No reason it should have taken 15 min for a cup of black coffee.", "author": "Tommy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-21", "description": "This store is majorly underrated. They're serving demanding tourists all day and stay extremely collected while working efficiently, not to mention their genuine smiles! Well done.", "author": "Jon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-13", "description": "Very nice people , chairs are awesome for couples lol", "author": "Jack L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-22", "description": "This review is based only on the appearance of the store. This location looks like it hasn't been cleaned for months. The floor is covered with crumbs, dust bunnies, and sticky spills. I was afraid to even sit down after seeing the chairs. Obviously the owner has given up. The store smells of mold and sour rags. Gross!", "author": "Brad B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-26", "description": "This one is really slow. Check on drink to make sure it is right, too. They've messed mine up a bit. The do have a nice selection of the standard SB pastries.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "Been here 4 times in the last 4 days.  Service is quick and folks are friendly.  Only got my sandwich order wrong where I asked for it on a bagel and they gave it to me on an English muffin with a bagel on the side.", "author": "Brett P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-21", "description": "I came in at around 6:30pm, craving a latte and really needing to pee. I wait in line practically dancing around, make my order then head over to the restroom. \n\nMe: \"Excuse me, what is the code for the restroom?\"\n\nBarista: \"Oh I am sorry, the restroom is closed for the night. Try across the street at Barnes & Noble. Here's a Venti Hazelnut Latte for Taylor!\"\n\nClosed for the evening? Since when does a restroom close before the store does? Now I get to be the guy who goes into a random business just to use their bathroom. Thanks a lot.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-07", "description": "What nice people !   \n\nFourth of July: we need ice for our party, and all of San Francisco is out of ice.  Safeway is out, Trader Joe's closes early.   The booze shops turn us down because they need ice for the beer they sell.\n\nI grab a coffee at this Starbucks and mention my problem and they give me a HUGE bag of ice and won't take a penny for it.\n\nGive them your business.", "author": "Peggy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-12", "description": "God they are nice at this Starbucks, but unfortunately they are not nice and smart.\nThere are only three sizes at this joint and they still can't manage to work it out...so sad.", "author": "Kathleen E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-11", "description": "I went there with my tumbler and i ordered venti americano. they gave me super sweet americano after i drink that i felt stomachache.  so i went back and told this situation, then they were just trying to argue with me. no respect for customer anywhere.didnt even say the word `sorry.  horrible starbucks ever!", "author": "J P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-29", "description": "The baristas were great here, the drink (americano), was, well, Starbucks quality which is never good.  The place has a strange setup and the bathroom has a weird lock...that confused lots of people...and I was sitting near the bathroom so that caused confusion and ruckus which disturbed my visit.  Also, the place closes at 8:00pm...that's INSANELY early for any cafe, but especially in this part of town.  So, if I were again stuck with only a Starbucks to go to, I'd probably not bother with this one...unless I just wanted some water or something.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-06", "description": "Its a starbucks. um. I get coffee here. It looks like all the other startbucks, It taste like all the other startbucks, it cost about the same as the other starbucks. \n\nI have a barnes and noble card... so there is a starbucks arcoss the street I get 10% off at. Which taste the same... \n\nbleh...", "author": "Roy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-08", "description": "I always hated Starbucks.  I'm from Canada and I felt it was just another southern invader trying to kill my beloved Tim Horton's.  I hated the seemingly insane prices.  I hated the pseudo-upscale, wanna-be sophisticated cafe air about the whole place.\n\nGood:  \"Gimmie a cup a joe\"\nWeird:  \"Double-tall-low-foam-extra-hot-skim-milk-pumpkin-spice-latte\"\n\nThen I was sick and someone suggested steamed cider.  I know it's essentially hot apple juice, but I love it and I'm hooked.  I go to Starbucks all the time and I probably haven't had their coffee for 6 months.  \n\nGo ahead with your crazy 'drinks' that take 2 minutes to just say the name of... I'm not mad at ya.  Just keep the cider flowing.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-01", "description": "3 WORDS:  PUMPKIN SPICE LATTE\n\nOk, just a minute while I hook up my IV....please somebody stop me.  Last year I jetted over each morning for my daily fix.  \n\nAfter getting my regular grande PSL consistently, I was unceremoniously told one day that they no longer served my fine beverage.  It was SEASONAL, they told me.\n\nWell, guess what, the SEASON is back!!!  \n\nAnd I was the first in line, thank you very much.", "author": "Patty S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "Friendly attentive staff, convenient location to tourist attractions, easy parking, good seating, free Wi-Fi. Manager Taylor Brown is a gem.", "author": "John N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-20", "description": "This is not meant to point out just this one location but all of them, especially when we in San Francisco have real coffee shops to visit.\nMy real anger thing is based around Starbucks. An insidious excuse for a cult.  My rage hits surface when I pay 3+ dollars for a cup of  hot water filtered through some weird blend of coffee which has been extracted from the feces of some endangered monkey in the rain forest of some 3rd world  country . by a 13 year old mother of 4 who is earning 13cents per day, and served to me by some \"barrista\" with an MBA and a Masters in endangered art, who expects a tip for aiding to my addiction  and then tells me to\" Have a nice day\"  .   That is just one thing that gets my goat!  But the real thing about the setup that pisses me off is that they take my order and then ask my name.\n\nThey will not tell me theirs in exchange , nor will the wear name tags. They take my name to mock me.  They take my name to sully it to the point where I will be no better than them , my pushers!   They take my name in order to Scream out \"FOUR SHOT  ALL FOAM CAPPUCCINO FOR SEAN!\n\nI have a plan that if there is any doubt, ever, who in the fricking coffee shop is the proud owner of the four shot all foam defib.... then i will give them a name but until that time my name is type triple A personality m****r f**c*r who needs his caffeine!", "author": "Sean O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-23", "description": "I love this place. My friends work here. It gets busy because of the tourists. I am always happy to see my friends working it. This place is also next to Trader Joe's which I love!", "author": "Josef C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-25", "description": "Not so much a fan of Starbucks, but this is the closest to decent coffee I've got close to work.  So on the days that I don't make it to Tully's prior to hopping on Muni or don't have enough caffeine prior to leaving the house, this is it for me.  The baristas try to be friendly.  They have a bathroom for the tourists to use.  Umm, they stock breakfast sandwiches.  And carrot sticks.  And, they gave me a free iTunes card.  And they have coffee, and it's hot.\n\nThat's it.  There's nothing else nice to say.  But please don't close this store -- was this one of the 600?  If it is, please put a Peet's here next.", "author": "Patty W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-01", "description": "This place just opened this week and so far I have been very pleased with the people and the coffee drinks they have been mixing.  I work right nearby and have several choices as to where to go for coffee in this area, but I have been more pleased with the service here.  Maybe the people working there are excited about their super clean and new location right next to the cable car turnabouts and it comes out in their personality.  \n\nNot too much seating around this place but there is this cool little bar area that was set up where you can sit on stools and watch all the coffee magic that happens behind the scenes.  I usually lean towards going to neighborhood coffee places, but in the 15 minute break I am allowed to walk somewhere close, this is my new choice.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-23", "description": "This is your standard Starbucks in a touristy location. But, the drinks are fine and they have breakfast sandwiches, so I can't really complain.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-17", "description": "Do yourself a favor and head across the street to the Starbucks in Barnes and Noble bookstore.  There you will find a shorter line, books to browse, and no problem accessing the restrooms.", "author": "Darren R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-26", "description": "If you are not a tourist... tread lightly my friend.  The lines are horrible and the service lacks the sense of urgency present in the downtown locations.", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-20", "description": "After ordering a grande extra hot, no foam soy chai they then forget my order (there was only one group of kids ahead of me) and then don't make it extra hot. Sorry, some people like hot, like me. After waiting for them to make the drink and then after they asked me to return it to make another, I politely declined and said I would place the drink in the microwave when I got home. And they were perfectly fine with that. No decent coffee house would ever be ok with me microwaving their drink, but then again, this is just Starbucks. No high expectations here.", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "great one but opens lil too late in the morning. 5:30am if they open at 5am i would pass by there everyday  service is pretty fast and people who go there are nice.", "author": "dj g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-11", "description": "Top 10 Worst Starbucks Ever.  I wish I could give this one zero stars, but yelp won't let me be so cruel. And the employees can't help it they work at a crappy, tourist-filled location (right at the end of a cable car line... In Fisherman's wharf... Ugh!).\n\nHere's why I hate this Starbucks.  Multiple times, I've walked out because the service was so slow (example: barista comes to first person in line who is standing with her friend; takes drink order; makes single drink; returns with drink; asks friend what SHE would like to drink; goes to bar to make second drink.  As the person 5th in line, I rapidly deduced I was going to be trapped in that green and black hell for another 5 minutes minimum, and I was already late to class).  Multiple times I've decided against my espresso drink, and changed my order to black coffee or tea predicated on my estimate of how long it would take to make the former.\n\nBut here is the mother of all anecdotes for why, under threat of serious suffering from caffeine withdrawal, I will never again enter this coffee shop: 9:50 on Sunday morning.  Three visible employees.  Seven people in line.  One employee decides it's more important to stock paper towels in the bathroom than get through the line (first rule in counter service: take their money before they can walk out; where was their manager!?).  After changing my order to tea (for efficiency), I got to the counter with one of their floofy salad things and the intention of buying a pastry.  I pay for my tea, salad, and pastry, and after handing the woman $9, she bids me  \"Have a nice day!\" without my Classic Old Fashioned Doughnut (the only real reason I go to S***bucks in the first place).  I remind her gently re: pastry, and she turns to get it.  In the meantime, the drink was ready for the customer behind me, and the fellow barista rang the order into the register.  Register Girl, who clearly should have had a V-8, hands me my snack, and as I turn to walk away, says, \"Um, MISS?  You need to pay for that.\"\n\nReally?  And to think I tipped her a bill, not just the handful of nickels in my pocket.\n\nI have a theory: the high quantity of confused tourists who enter that location in the first place have a \"rubbing off\" effect on the staff, making them more confused (slow?) than they would be otherwise.\n\nHaving worked in \"the industry,\" I'm more willing than most to give the person behind the counter the benefit of the doubt.  Maybe that's why I had kept going back to this location.  It's a good Starbucks for the same reason any Starbucks is good: it's convenient, it distributes caffeine, and it's generally consistent.  But a good Starbucks is also efficient as hell, and this one just is not.  \n\nFor the time being they have officially lost me as a customer, which is sad because I always tip in bills, and I am NEVER rude to a counter person.", "author": "Liesl B."}
