{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "8.50 for a huge portion of chow fun! Beef was not plentiful but for the price. I am a fan. Delicious food. Great service! Free tea. I definitely recommend. Friendly and nice.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Ehhh .. I've had better. Very pricey, ordered to go, chicken wings and chicken chow mein, $18. \n\nFriendly cashier. Food was hot. Chow mein wasn't flavored enough. Had to add soy sauce. Chicken wings were big to much breading. Over all they deserve a 3.5. I'm not returning due to so many other choices around. \n\nFood 3\nPrice 2\nFlavor 2\nService 5\nCleanliness 5", "author": "Paris S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "Let's take a moment of silence to mourn the original Sun Kwong. \n\nLet me explain. Le bf and I loved the place when it was run by the nice old Chinese lady a few years ago. Recently, they have changed owners, and I'm even tempted to say they have changed owners twice in the past year or so. The old Sun Kwong that I knew no longer exists. \n\nI used to associate Sun Kwong with super cheap and delicious Chinese food. Everything now is far more expensive than it previously was (by about $3-5/dish), and nothing tastes as good anymore. The service is also pretty bad, considering there weren't many tables full when we went on a Saturday night. It is also very cold inside, even with the doors closed. \n\nWe ordered:\n1. Sun Kwong Special Chicken rice plate\n2. Hot and sour soup\n3. Fried wontons\n4. Chicken chow mein\n\nThe only thing we liked was the chicken chow mein. That was solid. Everything else tasted bad, in one way or another. \n\nThe place is so bad that I really want Yelp to delete the previous positive reviews that were written when the little old Chinese lady ran the place. This place only resembles the old place in terms of the physical address, but nothing else.\n\nI am so sad to have a lost my favorite cheap Chinese food place in the city. I don't recommend that you go. When I saw the recent negative reviews, I honestly thought people were overreacting and wanted to try it for myself. Those people ARE NOT overreacting. It really isn't good anymore.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "We ate at this restaurant years ago and the food was terrible. We heard there were new owners and the reviews on yelp improved so we decided to give it a try. \n\nThe first time we came we ordered BBQ pork egg foo young, salt n pepper pork chops and a veggie dish. The egg foo young was very good, pork chops were dry and meat tasted old, the veggie dish was just ok. \n\nWe came a second time for the egg foo young and ordered fried chicken wings and BBQ pork chow mein. The chow mein noodles were soggy and BBQ pork was old and dry. The wings were bland and seemed old (skin was dark and looked like it had blood clots). When we bit into the wing it was raw. We showed the older lady (who does not speak english, but nice) and she called her daughter the server and they apologized and took them back. \n\nA few minutes later, they brought back the same wings re-cooked minus the two we tried to eat.  The wings were still uneatable and unappetizing. They noticed we did not want to eat them and asked what was wrong, I told them they look old and dark and pointed out the blood spots, again they both apologized. \n\nWhen the bill came, we were charged for the horrible wings. I could have argued and insisted they take them off but didn't have the energy. We really wanted to like this place since it's only a few blocks from home and there are not too many good chinese restaurants in the neighborhood.  We will definitely not be back!", "author": "Rpm M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "I don't know how I haven't reviewed Sun Kwong before as we used to live down the street, and this was our spot! So this seems pretty fitting for my 500th Review!\n\nSun Kwong is awesome! It's incredibly cheap! We'd usually order about 3 items and it would last us the two of us for two days! We'd get two meals for 2 out of it for about $20. That's nuts! \n\nWe've ordered a variety of dishes, but always a noodle. They do noodles really well! I really like the Oyster Clay Pot too. Plus, the portions here are gigantic. Every dish here is at least decent but pretty much everything is good up to great! I haven't had one like really stand out, must order dish though. I waffled between a 4 and 5 stars, but I just love this place.\n\nWe've ordered here so many times. And the woman who works here is so nice! My husband tried to leave her a tip for take out and she came running after him trying to return the change, and she wouldn't accept it the tip. \n\nPlus after we moved, we were really craving some Sun Kwong, so we drove over. We couldn't find any parking; it's terrible in this area, so I ran in and asked if we could get the menu so husband and I could browse it while idling in the car. The amazing woman who works there, then brought us out tea to our car! HOW COOL IS THAT!\n\nWe placed our order, and she said it would about 20 minutes. Then I figured I'd go in to collect, but she brought it out to us in our car before it was even 20 minutes. This place rules. \n\nIt's our little neighborhood secret.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "This is my neighborhood restaurant. I pass by here frequently and have been meaning to check it out. I went here last weekend with two other friends. We ordered Beef Chow Fun with beansprout, Wonton Noodle Soup, and Beef Chow Fun with Broccoli. The portion of the fb pod is very ample that you can easily have two meals. The price of the food is al SF very nice. I can see why many of neighbors would want to eat here or get takeout. The restaurant owner seems to be a husband and wife. They are very accommodating and kind. In summary, it is s perfect neighborhood mom & pop shop. I look forward to going there again.", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Amazing customer service!\nBarely walked in there and I already had a complimentary soup in front of me.", "author": "Gheezus S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Everything I've order is wonderful. I've had the lunch specials and ordered from the menu.\nI've gotten my friends to dine with me. We have also gotten take out and shared.", "author": "Marcei C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "Meh. Ignore all the reviews.  This place is not good. Skip it. Egg rolls not good.  Noodles okay but the only good thing is it's cheap and BYOB with a liquor store across the street", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "They have some good food here and nice people. Really cheap too. Try their Yang Chow Fried Rice.", "author": "Nial E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Love this place!! It's 2 blocks from my house and I go at least once a week! They have a huge variety and it's a bang for your buck. My go to is the rice plate. You choose your meat dish and it comes on a giant bed of rice with a small hot and sour soup on the side. And it's only 8 bucks! Definitely a go to for a quick, easy, and cheap meal in nob", "author": "Ally R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "LOVE this place!! \n\nI have no idea how the food is at the prices they are, but I am NOT complaining. Entrees all day that are priced ~$5, this is nearly as cheap as cooking for myself.\n\nThe owner is sweet and remembers you. She's to-the-point and gets you what you need.\n\nThe hot and sour soup and sweet and sour prawns/chicken are my go-to here. So good! Love that I can get so much food (the portions are huge) for such a great price. Makes for a good #treatYoSelf meal.\n\nThey charge something like $.50 for take out orders (reasonable, just an FYI)\n\nIf you live in the area, are passing by, or just want some good ol' Chinese food from a mom 'n pop shop, stop by here!", "author": "Jonathan N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-08", "description": "DO NOT GO HERE EVER! I wish I could rate this place a complete ZERO! \n\nFirst off they don't know how to speak English. It was such a hassle just to order chicken WITH pork fried rice. (Theres no such thing as rotisserie chicken here and apparently you cant order chicken wings with fried rice, you have to order it separately) lol They kept getting my order wrong, I dont understand how hard it is... \n\nHaving visited China myself, they act exactly how people act in China it's like they are yelling at you and look at you like you have 2 heads. So she doesnt even tell me how much the order was, just takes my $20 bill. As she's handing me back my change, I simply ask how much was it? And shes like $5.50 for fried rice & $6.50 for chicken wings. And I said okay and I guess the way I said okay, she's like go across the street and they charge $9.50 for wings as if I offended her. Like look lady! No one was trying to offend you. It's so annoying with language barriers, this is why I hated China. This place was so unprofessional! \n\nNow to get to the food: DISGUSTING!!! The fried chicken wings were undercooked!!! And the pork in the fried rice was black, like come on! And the soda cans they gave was FILTHY! This was ordered as take out and I took 5 bites and threw it out, that's how horrible this was! Mind you, I am not a picky eater! Thank God I dont live around here I would never ever go to this place!!!", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "This little local spot hidden gem is my go to place for anything Chinese. All the dishes we've tried have been delicious and made well with generous portions and fresh quality ingredients. Their steam egg is soo smooth and silky all the way through to the bottom. Their Chow Fun has a wonderful wok flavor. Their Mapo Tofu is also one of the best in the city. And ofcourse their free every time house soup is always a great bonus.", "author": "gordon g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-27", "description": "Really excited about trying Sun Kwong Based on all of the reviews. Unfortunately I was very disappointed with the service. Called in a pickup order and immediately after I finished speaking the woman hung up. Did not provide information on how long the food was going to be or any other information about price so I called back to confirm. Woman said food would be ready in 15 minutes. Okay maybe they are just really busy. We have heard the food and service is great.\n\nStarted heading to the restaurant to pick up the order. Tipped the woman, who gave us the food and ringed is up. Once we got home we opened the meal to find string bean chicken (which is really just a massive serving of sprouts) not sweet and sour chicken as we asked. \n\nCalled back in hopes the restaurant would try to rectify the situation only to get the answer that if we wanted the order corrected that we would have to go back to the restaurant in order to get the correct food. Not only was the woman on the phone extremely rude and rushed us off the phone, but when we got to the restaurant to pick up the correct order. The woman completely ignored us. She even pretended not to speak English when we returned. \n\nAdvice to restaurant - serve the customer better. Repeat back and confirm the order. Let the customer know when the food will be ready and how much it will cost. When the customer has an issue don't put the burden on the customer to \"return\" the wrong dish, but provide them with a solution that doesn't involve them coming back to your restaurant and being greeted in a terribly rude manner.\n\nAdvice to consumers - don't put up with poor customer service. Such a disappointment.", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "When I went here they were unfortunately out of chow fun, which was recommended by most reviewers. I tried the beef and broccoli chow mein instead. While the portion size was large (enough for the following days lunch), the meal was pretty forgettable. The beef wasn't the highest quality and there wasn't as much broccoli as I'd like. The service also seemed to be a little lacking. Good prices and serving size but overall it left a bit to be desired.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Waited 10 minutes to order to go at the counter with a menu in hand. No one acknowledged me. I left. Terrible service.", "author": "Baptiste P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "This restaurant used to be a cool hole-in-the-wall neighborhood restaurant. It used to be my go-to for Chinese food and soup. \n\nBut then the restaurant changed ownership. \n\nIt's not to say that new owners is always a bad thing, but this change was pretty obvious, and try really tried to make it subtle--they kept the same menu and the name after all. \n\nWhat changed? The prices went up from $2-3 per dish. Still a cheap meal overall, but not as cheap as it was. The portion sizes changed slightly. You definitely get less, and some of the recipes changed. \n\nThe thing I'm most bummed about is the change in server (I know the old server was an owner and she retired--great for her!). But the old owner Susan used to be so sweet, attentive and pleasant. She would even wave when I'd walk by on my way home. The current service, in contrast, lacks attentiveness and is slightly unprofessional. \n\nOn the upside, they take credit cards now...", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "A few weeks later. I've taken to ordering ahead of time, so not sure if that has improved. But I ordered the same thing as a few weeks ago. It was a little dry, but much more flavorful. Adding a star from last time. My roommate said the quality of their meat has improved. I've also noticed that the shrimp they use is better. Hopefully it will get even better in time.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-04", "description": "Found hair and metal in my food! What the fuck!! This place is worst than a hole in the wall in Chinatown.", "author": "Henry W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "It is uncomfortably cold inside this restaurant to the point where everyone including workers are wearing winter coats. The people who work here yell across the room constantly. The shrimp didn't seem very fresh. There was only one other table at dinner and service was very slow, had to wait awhile to flag someone to get the bill. Two stars instead of one because at least they weren't yelling at me...but won't return.", "author": "Oli J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "I live right beside this restaurant (don't stalk me). I must confess: I'm not actually the biggest fan of Chinese food, and can't actually tell if the food at Sun Kwong is good or not. Also it looks exactly like what you'd imagine a family-run Chinese restaurant to look like. HOWEVER my best friend, who loves cheap Asian food, was so bowled over by this place that I'm surprised he didn't move in on the spot. Here's his Facebook status:\n\n\"Officially my favorite restaurant in San Francisco (no one else will like it remotely as much as I do though, so be aware of this fact). Literally $5 for more food than you can eat, and $8 for the luxury 5-8 course option. As one review puts it, \"Prices for everything seem to be stuck in another dimension.\" Thanks for living right next to this place Ava\"\n\nHe liked Sun Kwong so much he literally organized a COWORKING session here. Because he is insane. Can you imagine 18 techies with their laptops eating Chinese food while they write emails in a (pretty cramped) restaurant? I can. Because it happened. \n\nSo, yes. Great prices. Good food (again, I can't actually tell). The owners speak Chinese. Better as a lunch spot than a coworking location.", "author": "Ava H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "It's a pretty convenient corner restaurant in a sparse neighborhood where you rarely find much Chinese food. Price was quite decent, and the food was loaded. I can't say it tasted wonderful, but it surely had been prepared to be fine. Especially recommended to try out if you live in the neighborhood or happen to be hungry and crave for food passing by the area.", "author": "Junyu Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-15", "description": "This should be more like 2.5 stars. The food wasn't outright bad, it was far from good. Ordered takeout: egg rolls, kung pao chicken and broccoli beef. The egg rolls had little filling and less taste. The chicken had very little flavor, almost no chili heat and the dish was literally just chicken and peanuts - nothing else. The beef was a little better, but still very uninspiring. There were maybe four cuts of carrot with the dish, and they were probably the tastiest part (carrots are so cheap, why skimp on those?!)\n\nAnyway, I suppose you get what you pay for, but I would advise trying any other options first unless you are really close by and pressed for time, or you love super bland dishes that make you appreciate the last Chinese restaurant you went to more.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Today was THE DAY we found a GEM near Chinatown serving delicious Chinese favorites at a more than reasonable price with amazing service. The sweet woman behind the register greeting you with a warm smile is also the waitress. After you're seated you get the menu and moments later served with COMPLIMENTARY hot green tea in a kettle and a scrumptious soup made with bone broth and veggies. I think people that pass by under estimate the view and go elsewhere but I definitely enjoyed the whole experience and will be returning!", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "This great example of a small Russian Hill/Nob Hill neighborhood Chinese restaurant just outside of San Francisco Chinatown. It was crowded at lunchtime with mostly local Asian workers & seniors who live with in walking distance. They are known for their authentic fresh daily \"pork bone\" Chinese soups with various veggies. Their rice or noodle lunch specials had good size portions for $7.50 to $9.50 prices!", "author": "George T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "This place looks like a really greasy, dirty place.  I lived  2 blocks away from this place over 30 years ago and I never was hungry enough to try it.  There were so many great options in the neighborhood at that time.\n\nMom had a friend who liked to get take out here 15 years ago, so she suggested we try it for home style Cantonese food.\n\nGoing inside, it was not too dirty, so we sat down.  The waitress, who is probably the owner, was very welcoming.  She seemed so happy we were there and asked if we lived in the neighborhood.  Mom told her we live far away!  Looks like the menus are 20 years old and prices are really low.  Many dishes for $5.50\n\nWe had Hung To Yee Foo Won Ton, Beef Chow Fun and tomato fish over rice.  Service was very quick.  Portions were very large, but flavor was lacking.   Maybe there are dishes that they do well but that would require multiple visits to discover.  Mom thinks the restaurant has changed hands since her late friend was a regular.\n\nIf I was really hungry and this was the only place open and I was already in the neighborhood and it was pouring rain I might eat here.  Unless you r very concerned with getting a lot of cooked food quickly for a low cost, there are so many other places in the area to grab a bite.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "I love this restaurant. Great prices, fast serving and great food. Fanny is an awesome host too, always so attentive. One of my go-to places!", "author": "Juan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "I absolutely love this Chinese restaurant. The service is superb and the food is really good and cheap! And also, not too greasy and they don't use MSG!\n\nI've been here twice recently and the service has been great! They are so nice and so sweet. They are very attentive and always peak behind the counter to see if you need anything. They bathroom and sink is located in the back and they keep the place tidy and sparkling clean. It's a tidy hole in the wall. Amazingly, this place is really empty. With the food so good and cheap, I cannot believe it! \n\nThe amount they give per dish is indefinitely family size! I'd say enough to feed 4-5 people. \n\nI order my usual:\nChicken fried rice: 4/5\nCould use some carrots and peas but it's still yummy!\n\nHoney walnut prawns:3/5\nThey aren't on the menu but they will make it if you ask. They are one of the few restaurants that still puts a bedding of thinly sliced lettuce underneath and an ample amount of candied walnuts. The thing is, the shrimp are white shrimp so they are small. The breading isn't fried enough and it kinda gets soggy after a bit. For something quite cheap, I'm not complaining. It's still very good. \n\nMy bf loves chow fun. He ordered bbq pork the first time and it was wonderfully delicious. The second time chicken curry chow fun. So different! Something we've never seen on a menu before. It was very good! Not too greasy/curry tasting.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "When you can have a decent lunch in S.F. for $6 bucks....is it really fair to complain?\n\nMy first visit was June 13th, 2017.\n\nI asked them to make my KPC with minimal ingredients. \n\nThey did it. \n\nI wish the cook had laid off the sauce a bit. It was drenched. \n\nHaving said that...it was tasty, prepared quickly, and it was $6 bucks.\n\nNuff' said.", "author": "Walter M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "HIDDEN GEM ALERT!\n\nThis place is a win for me. This is like when you go to you asian friend's family party, they want to stuff you with food and have you leaving with a few more extra L-B's. Large portions are welcomed here.\n\nDon't expect House of Prime Rib service. This is an asian restaurant, come on now, you know better. But the food...that's where its at. If you want entertainment, bring a few friends to laugh out loud all you want. The place has maybe around 7-10 tables, so don't bring the entire crew. Not for large groups. \n\nThere was a table of four with 20-ish year old non-asian peeps that relished in excitement for the meal that is to come. They came in after we had gotten our food and they ordered within minutes. Clearly, this was not their first rodeo.\n\nI got the Sweet and Sour Prawns rice plate for $5.75. Yes, ladies and gents, that appreciate seafood and a dual palate pleasure for a killer deal of $5.75. Mind you, this is not limited to just lunch hours, but all day!! \n\nAlthough, a classic Chinese-American dish, its a dish that is seldomly made well, whether it be at Panda Express, buffets, favorite tv din dins and maybe on the exotic section of your Chili's restaurant. Each large prawn piece was crisp to perfection with heavy latherings of sauce over the battered pieces.\n\nWill definitely be coming back! See you there", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Cheap and good Chinese food. Went here for walnut shrimp while the thunderstorm was happening :3", "author": "Emmett T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-13", "description": "Decided to give this pace another chance b/f writing it off.  BIG MISTAKE.  Dry, obviously premade egg foo yung patties w/ a sauce so gone rotten, it was clear the cooks never tasted it; mealy, gristly, overcooked pork cake - worst version of this dish I've ever had; sad vegetable soup w/ broth like salty dishwater.  What a waste of money for what I wouldn't feed to a dog.  Went to bed hungry after throwing it all out like hazmat.", "author": "Rose B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "I typically only order Sun Kwong for take-out, but the one time I did get caught up in there for more than a couple minutes, they offered me a newspaper to read along with some fresh, hot tea. The food is always good and hot when I get it, and the service is efficient. Not to mention, the prices are unbeatable. Great neighborhood Chinese restaurant! So happy to live near here :)", "author": "Bethany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Yummy Chinese food! The flavors on their noodles is amazing. Definitely recommend this place!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "The price you cannot beat the cost. Quick and simple Chinese food. Check their special for the day like oxtail. Home style cooking.", "author": "LL Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "Sun Kwong is my new go to Chinese food in the area! The prices are amazing and the service is super speedy. The location is nothing fancy, but it is clean and very conveniently located. The family style menus are an amazing choice for a cheap group meal, but the a la carte meals are also very inexpensive. It is cash only so don't forget to go to the ATM beforehand!", "author": "Madison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Quick and simple Chinese food. Friendly service and best bang for buck food to money value.", "author": "Shinji J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Food is ok depending on what you order. Service, not so great. They always leave the door wide open and it's freezing in there. If you ask them to close it they will refuse. I will not come back until the weather hits above 70.", "author": "G A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "This small restaurant punches significantly above its weight. It isn't much to look at, either. With that said, this is my favorite Chinese restaurant in the area. \n\nThe service is polite and attentive, the food is very reasonably priced, and prepared well. I've been here a few times and everything I've had has been great. The beef chow fun and Chinese broccoli with oyster sauce are classics that here are executed perfectly. \n\nI'm looking forward to coming back and working my way through more of the menu.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Very good food! Nice people too! One of the best Chinese food in town.", "author": "Allie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Have drove by a MILLION times, but finally tried it this year and been coming back ever since.\n\nI agree with many reviews that state the food is on the bland side (hence the soy sauce/saricha). In addition, they use very little oil, so the chow mein/fun isn't swimming in grease (like how Kam Po's orders can get).\n\nMy favorite is their American style scramble egg/beef over rice.\n\nOne order of anything is usually good for two meals!\n\nPrices for everything seem to be stuck in another dimension.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Found this great hole in the wall. Reminds me of Chinese restaurants back in the 80s when The prices are good, the quantities are big and the taste is great.   The salt and pepper fish was amazing! We love the Peasprout vegetables, and my son love the beef chow fun. I love to support good mom-and-pop stores. Eight minutes from fisherman's wharf. Thank you for the wonderful dinner!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Family was super hungry for Chinese after some time at the Marin headlands, so of course the trusty yelp community helped us find this place for a party of 7.  The menu had a lot of options but we decided on the family service at $8 per person.  I believe since our party was so big, we qualified for the 8 course option and we were completely stuffed halfway through the 6th course!!\n\nI believe the food came out in this order, one at a time.\nWonton Soup\nEgg Roll\nFried Shrimp platter with red dipping sauce\nFried Rice with Chinese red meat\nSweet and Sour Pork (super yummy)\nChow Mein\nBroccoli Beef\nAlmond Chicken (juicy tender, definitely a winner)\n\nThe lady who helped us was very efficient, since there were several take out orders while ensuring our food and service was fast!  Portions indeed were big  as others have said.  Definitely save room for the Almond Chicken as it was really my favorite besides the sweet and sour pork, although, I did enjoy everything.  I'd definitely like to come back again.   We enjoyed so much, our hostess was smiling too.  She also taught us how to properly pronounce the fortune cookie words.\n\nNice, clean location, but had to park 2 blocks away though.  They take cash only, but there's an ATM nearby.", "author": "bcast b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Sun Kwong is your above average Cantonese restaurant. I'm just glad it exists more in Nob Hill than in Chinatown, although I'm not sure why. Gives me a solid option for low-cost chinese food literally a block from where I live.\n\nAs long as you manage your expectations, this place works well. It's mom+pop, so the interior and seating isn't too fancy, and probably falls under the category of \"acceptably old and greasy\". \n\nThe food is pretty solid, American-friendly Canto fare. That means tasty bean sauce fish cubes over rice, broccoli beef, etc; you get the idea. It's good. Not amazing, but a solid good.\n\nSure, the prices might have gone up a little no thanks to gentrification and all that jazz, but c'mon, are you expecting grass-fed beef below $10? Or organic sweet and sour pork? No? Good. You'll do just fine here and enjoy yourself some comfort food.\n\nMy favourite items are the string been with minced pork and the bean paste fish. And she offers you tea while you wait for take out! Sweet.", "author": "George G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "I love this place. A real old-style (authentic) gem, on the corner, right alongside the Cable Car tracks on tree-lined Hyde Street. The waiter arranged a special dish for me when I asked him what he recommended, and I told him what I liked. Wonderful: prawns, rock cod and vegetables in a black bean sauce. The Yang Chow Fried Rice is great. Five stars.", "author": "Jane B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "I went there last week. It was awesome, they changed the ownership and remodeled last month. The food was great and can't find any better deal except here.", "author": "Eric Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Like Chinese food but hate Chinatown? Come to this nice sweet spot here, away from the hustle and bustle of San Francisco Chinatown.  It's near Chinatown, but far enough to enjoy your food.  The price was very reasonable and tasty! Chow mein was only $5! Sweet and sour chicken white meat was $6! The lady that works there is really nice.  They buy all their ingredients from Chinatown. Try it out, you'll be pleasantly surprised!", "author": "Glen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "Authentic comfort food.  Easy on the wallet, too.  Try their clay pots if you're super hungry.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "I have been a client of this fine establishment for six plus years.   The quality of the food has always been superb while the service is friendly, attentive and prompt.\n\nMy favorites are similar to other reviewers: chicken and beef chow fun, Hung Tao wonton soup and pan fried noodles are great .\n\nNo grease.  ... No msg.  ...  Clean. ... \n\nYou will get the best bang for the buck for old school Cantonese styled Chinese food that is located outside of Chinatown.\n\nSide note: It is important  to support local businesses like Sun Kwong Restaurant..", "author": "Marshal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "This place is a hidden little gem!  I love the chicken wings.  Every time I come here the owner is super sweet, always offers me some \"old fire\" soup, just like mom makes.", "author": "Ti T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Great service and good food (especially for the price!). $16 gets you beef broccoli, pork fried rice, chicken lo mein, wanton soup, egg rolls, and fried shrimp included in a two person dinner value meal.", "author": "-- T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "The owner (at least, I presume he was the owner) was really nice, and gave me my to-go order quickly. Sad to say that the food itself was really bad. \n\nI got chicken chow mein and spare ribs. The spare ribs seemed like left-over beef bits with bone (not the fall-off-the-bone juicy spare ribs you normally think of), and I threw away the entire pint after two bites.\n\nThe chicken in the chow mein was rubbery and fatty -- not good. The noodles were OK.\n\nSadly, will not be back :/", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Great find! A large bowl of soup was served to the two of us for free at the beginning that filled about 4 cups worth. Got the vegi chow Mein and gylon. We were stuffed with left overs for a total price of $13! Maybe not the cleanest place, but coming back for sure.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "I've spent a long gruesome week apartment hunting in SF and was on my way to sign a lease and collect keys. I arrived early and decided to wander around my new neighborhood. I saw these two elderly Asian ladies who looked like my grandma walk into an Asian restaurant. I didn't think much of it because 11:30 is a bit early to eat lunch, but glanced at the menu and saw the dishes were well priced (not even for city standards $5-7). I walked a few blocks down and decided to turn back and snag a small table and grab a bite before my 12pm appointment.\n\nGood thing I grabbed a seat, because the place filled up pretty quickly (before 12noon on a Monday). The phone started ringing off the hook as the clock neared noon, with people shuffling through to pick up their to go orders. \n\nDon't be weirded out if you have to share a table with other patrons - it's a super common thing in smaller Chinese restaurants. \n\nI ordered the Singapore Rice noodles (asked for it bc I couldn't find it on the menu, though I didn't look very hard). I've had this dish time and time again. The color was right, there was enough char siu but it would have been nice to have a bit more of a kick or more green onions. Regardless, $6 for a large portion, soup, and tea is amazing in my eyes. \n\nI'm happy to be supporting a local establishment on Day 1 of my new residency, and will be back again. \n\nCash only.", "author": "Liz Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "I came here by accident when another place I usually go to closed for the week.  The food is great, very generous portions and the price is great!  \n\nVery friendly family owned place.  I highly recommend the chicken fried rice and chow mein.", "author": "Wayne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Amazing waitress and amazing food. One of the best secrete gems in San Francisco. 5 stars through and through. Get the family style and bring your appetite", "author": "Duncan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Sun Kwong! I live down the street and this place is chill as f***!  Super nice peeps up in here.  They always give me this great tea while I wait for my to go orders.  Food is good, typical Chinese food as good as any other or better.  Not sure if it's doused in msg or not but it's delicious enough to make me suspicious lol.  Either way, delicious!", "author": "Dan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "Came for a pick up. I got the everything clay pot as the lady in the front described it and it was super good. The portion size is huge as well. When I was waiting the lady in the front was nice enough to pour me a cup of tea. \n\nI forgot the name of the dish, But the everything Clay pot contains everything including tofu shrimp chicken and mushroom,cooked in black clay pot sauce.", "author": "Ruxin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "This restaurant seems very dumpy from the outside. It is small and there is only one waitress. She did her best to clean our table but there was still some stuff on it from the previous diners. You have to walk through the kitchen to get to the bathroom. There is some kind of leak in the restroom because water was dripping on my head. There is no wash basin it's just a utility sink. While we were eating a guy came through the restaurant with a delivery and we had to move out of the way. But the food was so good! Not greasy at all! The sauces were actually liquid and not a syrup-like consistency (which is a problem in many restaurants). Overall delicious", "author": "Angela A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "I grew up eating their food. \n\nMy mom would get a rice plate or the gravy flat noodles with beef there and my sister and I would share it on the playground after school. \n\nAs I grew older to venture out on my own, my mom would sent me there to order the salt and pepper spareribs for dinner. \n\nHowever, going back there recently, they changed the chefs and the food did not taste as amazing as it did when I was a kid. Everything is super salty now and the food's flavoring is not as good anymore.\n\nGiving this place 3 stars based on how amazing it was when I was a kid, would be more if they could just bring my childhood back!\n\nCan't go wrong with the free fortune cookies either!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "This place has great food for a great price. They recommended I get the sun kwong combo over rice. It came with shrimp, beef, chicken, and various veggies over rice. The portion was large, and although I wasn't a huge fan of the beef, everything else was great. And for about $6 I was more than satisfied.", "author": "Shabnam E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "Ordered lunch take out.  The price is cheap but the food is so so.  We had curry beef over rice and mixed veggie with tofu over rice.  The beef dish is ordinary.  The veggies are soggy and blend.  On the other hand, with a price like this, one cannot complain too much.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "This is my favorite neighborhood Chinese restaurant. They are so nice and make sure to always get your order right. Also the food is a great value! You can't find too many places in San Francisco that you can get so much for the price and it's good!", "author": "Brit M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-01", "description": "The food here blows.  I heard good things about the wonton soup, but I had their special beef short rib (bland and so fatty),  beef and wide noodle thing (so oily), and rice (dry).  Not great.", "author": "Pam L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-13", "description": "This restaurant was a block away from my new apartment and, being new to the neighborhood, I thought it would be a good idea to test this place out. The yelp reviews mentioned it was a cheap, relatively decent restaurant and I think that may have been half true. I ended up ordering the sweet and sour chicken, beef and broccoli, two sides of white rice, and Sun Kwong chow main. The chicken was breaded but either hadn't been cooked long enough or wasn't fried period and the breading was still doughy. Yuck. The beef and broccoli really only had the broccoli to recommend it as the beef was chewy and lacking flavor. The chow mein was pretty much regular chow mein, but that was about all that could speak for the meal. \n\nLong story short, I won't be returning. It may be a block away and the whole meal was only $24, but due to the fact that I ended up throwing everything away but the chow mein doesn't make it a steal. \n\nTwo stars for the amazing service and huge portions though.", "author": "Sara F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Great cantonese chow mein - you know, with the crispy noodles. Excellent prices considering the quality and portions.", "author": "Wes H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Great value!  The portion sizes are huge, especially for the low prices.  The food comes out immediately.  Loved the pan fried noodle with beef and tender greens and the sautéed rock cod was flavorful.  Our go to for Chinese food!", "author": "Anonymous S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Some of the best Chinese food I've ever had! When I walked in I was really skeptical and almost left, but I'm so glad I didn't!", "author": "Bree P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "I used to live about half a block -a stones throw - from here.  Living in SF on your own who has time to cook meals all the time?  But who has the money to eat out all the time either?  This was my solution!!  It was eating out but like ordering home cooked Chinese meals from mom!\n\nI used to come here 2-3 X a week.  Food is awesome and huge portions!  Lasts me a dinner, lunch packed the next morning and dinner next night on 2 dishes & an appetizer.  When my bf came over, a soup, appetizer, entree, rice would last both of us dinner and lunch.\n\nFaves include pan fried noodles, chow fun( I always get mine with eggplant as I don't eat too much meat), salt n pepper pork, wonton soup, hot n sour soup, chow mien, green beans, boy choy, fried wontons, fried oysters.\n\nIf you haven't tried, try the fried oysters.  So good!  I've since moved away but will still travel back on occasion for this alone. \n\nAnd you can't beat the prices!!  Place is always clean n tidy.  It's not dirty, but being open for 30 years with the same furnitures, the tables are a little sticky.  I think if they just got new tables, problem solved.  However, it's not like they stinted on decor and jacked up prices to customers!  They kept cash only so WE don't have to pay double as in other restaurants.\n\nWaitress is owner and NEVER rude!!  She is humble, sincere and honest!  I always tip way over 20%.  She never charged me extra to add or change something in an entree, which most if not all restaurants do now a days just to make an extra buck.\n\nSupport your local honest small businesses!!!", "author": "Diana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Chinese good that is on point for such a great value.  had the Sun Kwong combination over rice.  Was pretty good.  the office tasted so fresh and had great crunch.  I dined in which in turn allowed me to have a bowl of amazing beef bone soup.  tastes like home cooking and was exactly what I needed.  my meal was $6 flat which was even more amazing.  I'm pretty full and satisfied.", "author": "Burry B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-13", "description": "I enjoyed the food here, although it's nothing extraordinary - fairly simple, good, and filling. The portions are enormous - I think the friendly employee tried to warn us that we were ordering incorrectly, but there were in a few minor miscommunications in our ordering (we ended up getting a chicken dish instead of the beef that we had ordered.) The three of us each ordered soup, but she told us to only get two soups - and then we ended up with enough to serve at least six people - so, know that an individual soup order will serve multiple people. The hot & sour soup was a bit vinegary for my taste - we all preferred the wonton soup. I found the chow mein to be very plain but still tasty, and not OVERLY greasy. The klassic sweet & sour pork was actually pretty good - there was lots of nicely cooked meat. \n\nI prefer Sun Kwong to U-Lee, which seems to mainly be highlighted for its enormous, but otherwise not terribly interesting, potstickers. The food was also packed up well here, which was handy for transporting all the soup home.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Hey ah 5thAvedave here from nyc South jamaica Queens .. I'm such a New Yorker and very picky with my food selections ,so humble and so traditional with my taste buds.. everything food I'm a classic Man. Long story short been living in LA now for past few years and I swear I haven't found any decent Chinese food in la at all yet.. on the whim me and my lady drive out to San Francisco to finish celebrating our birthdays and found this excellent homely authentic New York  style Chinese spot.. i order normal new Yorker shit to make sure it's good..Shrimp fried rice with fried chicken wings! And I can't lie it was on point! Facts all flavors and texture and portions were bomb! I'd definitely come back and recommend this spot to anyone looking for real nyc Chinese in San Francisco this is a good spot for me .. only one major problem that I couldn't give 5 stars because they had no Duck Sauce but overall food was the shiznit thanks.!", "author": "Diamond D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "I come back here almost every other week. The food is great, the service is really friendly (both take out and eat in) and the price is unbeatable! Perfect for an easy going evening :)", "author": "Konstantin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "I started working in the area for the last month and I am not shy at admitting that I've eaten here probably ten or more times. Growing up in the Outer Richmond this place evokes my childhood. Delicious, criminally inexpensive Cantonese food that is lightning quick. A slimmer human being (not myself) could probably have their average portion for two meals at the very least. \n\nThis is classic no frills San Francisco Chinese food at its best. If you are looking to be blown away by some incredibly complex gastronomic experience look elsewhere. If you want delicious and simple Chinese food with no nonsense service you've found it.\n\nI love that they give a simple house soup, tea and the newspaper if you dine in during lunch. The woman who runs the restaurant's front of house is no nonsense but polite. \n\nSome of my favorites are the Prawns with Tofu over rice, Sun Kwong Chow Mein (Combo Chow Mein), their Wonton soups are amazing, hell I dont think you could go wrong here. \n\nAn aside: Leafy green vegetable on the menu means Bok Choy, and bean cake is Tofu. I think their menu was last printed somewhere in the early 1980s.", "author": "Max J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "They have really quick service, and the lady at the counter is always patient with my requests for extra chilli sauce! The food is amazing as well :D", "author": "Lakshmi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Great for Chinese takeout! Especially for sharing with large parties. It will get SO cheap. Like literally $3-4 a person. But when I go by myself I get the hung toe yee foo wonton (sorry no English translation!) and it's $5.50 and lasts me two meals. It's the best in the city. My family loves this particular soup and we have had it at virtually all the Chinese restaurants.. This one always wins overall. Also, the owners are so nice!! They know exactly my order not only when I walk in but also even when I just call on the phone they know my voice. Embarrassing? Nope! Just super fast and yummy!\n\nFYI don't plan to go to the bathroom here \n-if you're dining in and you ask for water, it mysteriously comes from a back room that is not the kitchen \n-if you're a youngish Chinese girl there is a high probability the owners will try to set u up with some other single diner that night", "author": "Hilary F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Gotta support the fast fading little hole in the walls. This place is great and really sweet service to go with delicious food. \n\nWe got the family special: $8 per person. For two people we each got won ton soup, egg rolls, chow mein, fried rice and beef broccoli. For real! \nWith this city getting crazier in terms of prices, this is a place that I hope stays around. \nLove it and you should definitely give it a try!", "author": "katrina t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "discovered this little hidden gem in nob hill. Decent portions and extremely friendly services. Price is only half of average SF Chinese food but quality is in no way sacrificed. Very authentically Cantonese.", "author": "Lily Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Excellent value. Cheap, good chinese food served fast by its friendly owner.\n\nRecommend beef dishes with broccoli\nThe fried rice dishes are good\nAlso the shrimp with omelette is fantastic", "author": "Roman K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "I had to stay in SF and Su Kwong was just around the corner. This establishment has been here for about 30years and operated by the same owners ever since.  But I can't say if it's the same chef for that long period of time.  Su Kwong is a neighborhood where the cables cars go by and many tourists wouldn't think of ever trying. A small place with hardly any decor and just your basic no frills restaurant. \n\nThe waitress/owner is very friendly once you get to talking with her. Turns out her sister in law lives also in San Jose so we have something to chat about as I wait for my to-go order. \n\nI ordered a rice plate. Actually, I was craving for tomato beef chow mein but rice was going to hit the spot and I needed to warm up from this crazy SF weather. So, I ordered beef stew with bead thread. Bean thread is derived from tofu and I just love it. The meat was cooked tenderly and it was nicely seasoned. Bean thread was soft. The only thing I would advice is that if you like extra gravy sauce, ask in advance. I didn't so my order was on the dry side...however, still good. I can't complaint for 6.00 including tax. \n\nI hear they serve 3entree dishes  for 20.00. I think if I am in the neighborhood and can snag a space, I will try su kwong again.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "1st introduction of Sun Kwong was when my cable car operator stopped mid track just to pick up his pan fried prawns take-out from there, no joke!  Obviously, that peaked my interest, but I've been loyal to my jumbo pot stickers from U-Lee across the street (for nostalgic reasons) so I hadn't really gotten a chance to try Sun Kwong until my parents were in town and stumbled across them.  \n\nThanks to my parents' laziness not to cook that night, they opened my eyes to a true neighborhood gem.  The owner was so nice, she offered us the house soup before our 3-course family dinner set and a huge pot of rice.  All the dishes has a yummy homemade feel to them: oyster omelet, eggplant w/ Chinese anchovies and pork, and bok choy w/ beef.  It's like coming home to dinner to my parent's cooking growing up.  \n\nLast night, I was craving for homemade Cantonese cooking so I stopped by.  To my surprise, the owner recognized me from the time before.  She not only offered me a choice of Chinese or local newspaper to read while I wait (amazing! service at a hole-in-the-wall?!), she even remembered how much I like their house soup and offered me a big bowl of it while my food is being prepared.  Now you just can't ask for anything better!  I of course offered to pay for the soup, but she refused and even gave me a bowl to go! LOVE SUN KWONG!  This place's got HEART!!!  Sorry U-Lee, your service is just not there :(", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-29", "description": "I lived upstairs YEARS ago when it was ran by another family.  The current owner said she owned it since 1984, years after we have moved out.  Regardless, just being there brings back memories - good ones when life was simpler.  \n\nWe walked in when it was right around 5pm when they opened.  The lady was still mopping away in the back.  It looks dingy but the place is well kept and clean.  Besides the menu, there are specials on the white board but I think they are in Chinese.  One item caught my eyes - beef tongue over rice.  \n\nAfter we ordered, we were given a complimentary bowl of soup - seaweed w/ pork.  It was tasty and really hit the spot.  What we had:\n\nbeef stew wonton soup - the beef stew is tender but a tad salty for me.  the wonton was ok.\n\nbeef tongue over rice - delicious!  the beef tongue was very tender and the gravy over the rice was super yummy.  definitely our favorite dish.\n\nsingapore rice noodle - it didn't have the yellow color as expected and only a hint of curry flavor.  \n\nWe already planned on returning or at least get some to go orders.  The lady is super nice and I think some people take advantage of it.  As mentioned by other Yelpers, she is very thankful to all her customers.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "I've been eating Beef Chow Fun here since I was 5. My mom used to live across the street, and when I moved nearby I had to come back. Tastes and costs the same it did 25 yrs ago. The Chef's Gourmet Chicken is a nice surprise with its sweet sauce and freshly crisped wontons.\n\nSure it's not the cleanest place, but the hostess is endearing, the food is perfectly greasy, and you can't beat the price.\n\nFull disclosure, I'm half Chinese...", "author": "Omar M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "There has been a restaurant named Sun Kwong here (& named U Lee along w/ the grocery store at opposite corners across the street) ever since I was a kid growing up in the neighborhood over 55 yrs ago but I haven't eaten here for almost as long.  \n\nWas walking along Polk checking out the shops as I do periodically  do when I'm in town but didn't like the restaurant options there.  \n\nRemembered Sun Kwong & decided to walk up the hill to revisit the place & reminisce.  The place may have changed owners over the past 50 odd years but it looks just the same as I remembered it -- 9 tables of varying size in the small space w/a high ceiling in front & a drop down ceiling in back.  The walls & ceiling looked clean & recently painted in contrast w/the greasy & yellowed walls as I recall from my childhood.  The old stick-on floor tiles also looked clean & regularly swept & mopped. These are big pluses for any Chinese restaurant dive like Sun Kwong.\n\nI arrived \"late\" for lunch around 230 & the place was pretty much empty.  I ordered a pai gwat fan (spare rib rice) plate wc was listed on the menu for just $4.25 ($5 w/tax) This dish is in the class of my \"go-to\" Chinese (more specifically Cantonese) comfort foods.  The pai qwat was sauced a little too heavily (too much soy) but it wasn't too salty for me & the meat was fall off the bone tender as it should be.  Not the best pai gwat I've ever had but it was eatable & certainly worth $5.  \n\nAdd the atmospheric milieu of the sound of the traffic coming & going, the drone of the cable car cable running underground, the occasional clang of cars running over the cable hatches in the road, listening to Cantonese being spoken by the staff and the sound & sight of the cable cars (the clang of their bells & the rumble of their wheels on the tracks) passing by & you've got one of the purest San Francisco experiences.  \n\nIt's certainly worth a 2 block walk up the hill (wc allowed me to take a peak at the Spring Valley Elementary school yard wc brought back even more memories because it was the 1st school I attended way back in 1955. Spring Valley is also one of the oldest schools in SF (having been built in 1910 after the 1906 fire burned pretty much everything down west of Van Ness) & was virtually 100% Chinese until the 1960's when de facto discrimination was finally abolished in the City.  So, there is some historical significance in taking the walk up the hill as well.\n\nSo, if you're looking for some passable, cheap & authentic Chinese food & want to experience the uniqueness of SF, a little time spent eating at Sun Kwong will be well worth your time.  Enjoy!", "author": "Martin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Pretty good beef chow fun at a great price!  You can really taste the heat from the wok. Their seafood crispy chow mein was okay. No red vinegar.", "author": "Kris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Really good.  Dinner for 2 for $11.00!!  Food delicious.  Pleasant neighborhood by cable car route.  Local Chinese people eating here.", "author": "Jeanne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "I've been going to Sun Kwong for quite a few years for certain dishes and U-Lee across the street for other dishes.  When U-Lee closed, I began  trying other items from Sun Kwong. I particularly like their beef and shrimp dishes.  I agree with other reviewers that their noodle dishes aren't their forte.  I especially like the shrimp and scrambled egg over rice and shrimp with tender greens.\nSusan, the owner, is the nicest woman.  She's always pleasant, accommodating and hardworking.\nI am always surprised by the price.  Just last night we got two takeout dishes for under $13.", "author": "Jane G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "My Chinese father introduced me to this place so I was not expecting to be disappointed...and I wasn't! The pan fried noodles, beef chow fun and war wonton soup are AMAZING. The soup is so good I crave it weekly. They also give you a bowl of complimentary soup to try (great service). I love this place, and even my 10 year old (picky) son and 6 year old daughter love this place. It's very authentic so make sure to bring a translator or your good pointing at the menu skills. ;)", "author": "Elizabeth I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Amazing soups. Very fast to go, and they give you tea while you wait. The veggie and the wonton soup with shrimp are both amazing. A great pick me up if you're cold or feeling under the weather, or if you're just looking for a delicious quick meal!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-19", "description": "I consider myself a beef chow fun connoisseur of sorts. This place does NOT do it well. First off it is too greasy, I get that noodles are supposed to be oily during the cooking process but it is overall too much oil, more than average. The flavor would be OKAY if there weren't charred bits/remnants of dirty-wok in my food. This made it taste a little bitter. Again it'd be fine if my noodles themselves and the food itself was charred but there were actual little bits as if you were to scrape up a dirty wok. The noodles were also not all separated there were pieces that were still together and stacked 4-5 pieces. Sauce was not completely covered on all noodles... the list goes on. Anyway for $5 and a less than 10 minute wait time for take out I guess it's a quick fix.", "author": "Curieux V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Great value & great food. Definitely recommend this hidden gem. The wonton and beef brisket is really good!", "author": "Michael Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "Best flavor, portion, and value comfort food:  beef stew won ton and Hung Tao Yee Foo Won Ton.", "author": "Geri S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "This place is a must. The waitress is the nicest person around. If you can't decide, she will help. My favorite is the tomato beef chow mein. Not to saucy, but rich in favor. Try the Mandarin spare ribs, a favorite of my mother.  If you don't order soup, she will bring the daily special for free! The prices are amazing for San Francisco. Even the bathroom is clean, a rarity for a Chinese restaurant.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Definitely the go-to spot for Chinese food in the area! I ordered the beef stew won ton, and it was really tasty. The won tons were stuffed with filling, there was lots of tender beef, the soup tasted good and savory, and I got my greens in with the included bok choy. The price was good, $6, and the employee who worked there was a super friendly person.", "author": "Peach F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-21", "description": "This is the only chinese restaurant in telegraph hill i will go,2 times a week for lunch. There curry beef-stew over rice, is so tender, it is so good. Another must have recommended items are the pan-fried noodle,salt & pepper pork chop over rice, and potstickers to name a few tasty items. Also there wonton soup is fresh. \r\nIf you visit for lunch, come after 1pm. It is packed with chinese painters and construction workers. They will cram this small corner restaurant. Yolanda, the gal who runs the traffic controlled restaurant, is extremely nice.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-26", "description": "The food is really good, prices are great, bathroom is extremely clean, this would be a five star but the lady comes across extremely rude. But if you are looking for really good chinese food and don't mind the service this is the spot.", "author": "Carlos R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "A few doors from my house, and my Chinese food go to. I prefer Sun Kwong over U-Lee across the street.\n\nThere is nothing fancy about Sun Kwong, classic criteria looking Chinese joint, but the food is good and VERY cheap.\n\nThe lady at Sun Kwong is so friendly and always offers me some tea while I wait for take-out... I have never dined in!\n\nDaily specials on the board, but personal favorite is the Oyster Clay Pot.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-24", "description": "This is the best place ever! A guy working at Lombardi, just down the hill, recommended it to two of my friends and I. We went in and decided to get take out and the two very kind waitresses served us tea. Tea when you're getting take out? AMAZING. Usually tea is super hot when you poor it and you have to wait before taking a sip. This tea was at the perfect temperature! \n\nWe ended up eating in instead cause one of my friends really wanted to. The food came out fast and was hot. I had the beef stew wonton noodle soup and it was stunning. The beef was glistening in my bowl and my friends just had to get some. \n\nMy friends both got rice plates, and both were extremely delicious. The sweet and sour CHICKEN was extraordinary. Our total was $13.25 but we gave $17. I will definitely be back! (:", "author": "Chantal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "Fun, family friendly, neighborhood restaurant that serves residents and tourist alike.  A intimate location that has many great dishes some of which my favorites are: Beef stew, Sweet and Sour Fish, Honey walnut prawn, Beef Chow fun, Peking style pork ribs.  Come sit down, have a great experience and watch as huge portions of food come to great you.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-27", "description": "I hate being the one who writes the negative review in a sea of great ones, but I want to be very honest.\n\nMy headline is, \"I live for noodles.\" I've had lots - good and bad. The noodles in the beef stew noodle soup were not designed for my taste buds - weird, overcooked texture.\n\nThe waitress was incredibly sweet and helpful, however, even though I was dining alone. For that reason (plus the fact that there were only Chinese people eating there, so it must have redeeming qualities), I would consider going back and ordering a non-noodle dish. Oh, and it was $5!", "author": "Jeena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "3 dishes for $21 for two people. \n\nGet the beef w/ dry bean curd clay pot, the beef was delicious and tender. Probably my favorite dish. The wonton soup was also pretty delicious, very generous on wontons.\n\nThe beef chow fun was just horribly bland to the point that it tasted like nothing (is that even possible?). More soy sauce and salt needed. \n\nStill giving 4 stars for value and price, we just got bad luck on the chow fun that day.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Checked Yelp to find a chinese restaurant to eat with the family while visiting Frisco Chinatown. There were a few big restaurants with over a thousand reviews, but enough bad reviews to make me second guess. Walk up the hill and go to Sun Kwong. Not a large fancy restaurant,  but the real deal. The locals (including three mailmen, 2 asian and 1 caucasion) were eating here! Small place, super friendly, authentic as it gets, and great price! The lady cannot be more nice. She interacted with the kids, always smiled, and even gave my wife the house soup for free. If you like a small hole in the wall with great food and even better service, you won't be disappointed!", "author": "Marc A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-28", "description": "Not very good. We ordered chow mein, fried rice & egg rolls. The Egg rolls were good; definitely the highlight. The rice wasn't too bad, just greasy. The chow mein was pretty terrible. Had just about nothing in it & was bland and terrible. I really do not know how this place gets 4 stars.", "author": "Joel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "Seemingly a great value. They were very nice and I got a huge order of chicken fried rice for $ 4 75! Good stuff.", "author": "Kevin M. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "This is a cool little restaurant in the Russian Hill district of San Francisco.  This is how I remembered Chinese food used to be when I was a kid.  Surprisingly, the price hasn't changed as well.\n\nThe beef chow fun tasted as good as I remembered.  Right amount of wok hay( the amount of heat and flavor from a well seasoned wok), chow fun is not overcooked and mushy, the beef wasn't the higher grade beef but for roughly 5 bucks what can you expect.\n\nThe potstickers, personally, was not up to par.  A little too doughy for me and the stuffing weren't as full as I would have liked.  San Tung, So, U Lee have some amazing potstickers.\n\nThe beef tongue over rice was fantastic.  The brown gravy and onions was a great compliment to this dish. I loved this dish and I would go as far to say that this is the best beef tongue in the City..  I would definitely come back here for this dish and for 4.75?!?  Are you kidding me?!?  I would buy an order just to leave in the fridge for a snack.\n\nThe scallop and snow peas over rice was great.  Again............for 4.75.  What a deal!!!\n\nCheap eats and very easy on the wallet.  For all four dishes, it came out to 21.50.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "This gem of a restaurant can be accessed by the Powell-Hyde cable car line, a short walk from Lombard Street.  Portions are generous and the menu options are very affordable.  Owners are very friendly and every visit is enjoyable.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "If you want to be the only non-Chinese person, this is the place to go. \n\nThe cheapest entree is about $5 and the most expensive one was about $8.\n\nI came here for lunch and ordered my standard not-really-chinese food-chinese food (orange flavored chicken) and left satisfied having only spent $6 on an entree and rice. \n\nMost of the guys there seemed like they were working construction locally and all spoke Chinese, which I thought was awesome. \n\nI'm still a fan of U-Lee across the street, but this place is good stuff too.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "I live practically next door to Sun Kwong and get their take-out fairly often. Their prices are possibly the cheapest among most Chinese restaurants in the city. The majority of their entrees are under five dollars and generally are enough for two meals. My personal favorite is the curry chicken chow mein.\n\nThe women working the register is unbelievably friendly! The last time I was in waiting for carryout, she seemed to notice I had nothing(ie. my smartphone that I left at home) to read while waiting for the order. She went outside and grabbed a SF weekly from one of the stands in front of the restaurant just so I could have something to do while I waited. I didn't ask or suggest for her to do anything like that. I was shocked. I've never seen that sort of service and warmth in any SF restaurant before. As you can tell, I highly recommend Sun Kwong for a quick, inexpensive meal and will continue to frequent it.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "This is not a fancy establishment but the food is great for take-out.  The lady there is super super nice.  She sat us at a table and served us hot tea while we waited.  \n\nWe ordered the scallops with vegetables, an side of bok choy, and the salted egg with mustard green soup - all were tasty.  The food was prepared in the more traditional way where nothing was over salted or super saucy - huge fan of this and the fact that they offer a number of more authentic style chinese dishes.\n\nDid I also mention that the prices are cheap?", "author": "Sandy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "super authentic home-y food.  I like this spot, it's not crowded and the family who works here is super nice.", "author": "christopher h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "I checked this joint out bc a friend said they had amazing wonton noodle soup!\n\nLiving right around the corner, I had to check it out...and I must say, I was sold.\n\nTheir wonton noodle soup is quite amazing, I always get BBQ Pork. AMAZING portions (could feed two) for $5!\n\nI've ordered some of the other foods, not the best I must say but I will always return for some yummy wonton noodle soup.\n\nAnd I completely agree that the lady is really really nice and welcoming.", "author": "Jung-Ah Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "This place is awesome! I live a few doors down, and I've never been disappointed. The food is delicious, it's super cheap, and the woman who runs it is the sweetest person ever.", "author": "Tali L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Best food for super cheap, fast and efficient. I love this place!!!!!", "author": "M Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "This place LOOKs like a greasy spoon, but somehow ... it's not.  The place is kept clean ... neither the table nor the floor was sticky.\n\nThe owner or was it waitress was super nice.  We ordered a noodle dish, an appetizer and a soup.  She suggested that we order another noodle or rice dish and she'll throw in free soup for us.  We did and the free soup turned out soooo good.  Watercress with pork, just like the way mom used to make it.\n\nDidn't have the fried rice, but the noodle dish was full of nice carmelized \"wok flavor\".  Can use a bit more soy sauce for flavor though.  The deep fried appetizer was done just right AND it wasn't sitting in a puddle of oily grease.", "author": "Winnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "I haven't lived in SF for 14 years so you can imagine my joy & happiness when I revisted my old neighborhood to find that Sun Kwong is still there!!!  So what else would I order but my usual from way back when.  NOTHING about this place has changed.  Not the food and definitely not the prices.  Tomato Beef chow mien, Black Bean Spareribs over rice & Beef chow fun with an order of potstickers on the side for $20.25?  And the boxes were filled to the gills.  That's almost unheard of these days.  I stopped by for a lunch pick up to see that the set up was exactly the same.  Make sure you take a peek at the specials on the board on the back wall.  My order didn't take any longer than 15mins.  In the meantime I was given hot tea and house soup.  And get this, their house soup is not just a rice bowl of broth.  Its an actual soup bowl with generous portions of whatever the \"house\" has in store for the days customers.  Thank you Sun Kwong for not going anywhere.  I shall return again", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-02", "description": ". . .  I swear I reviewed this place B4. . .\n\n- not your run-of-the-mill hole in the wall.  It's well-lit, altho a bit spartan; but, we do not go for the decor.  Husband-wife operated.  .  .  (not old enough 2 B called Mommen Pop), friendly and family friendly, regular stream of take-out traffic, not jammed/line- out- the- door.  -BUT don't let that fool you.  The food of its category is TOP-notch. *\n\n- ordering our favorites, limited only by reason we were just 3, the Comfort Food Club:\n                      Hoong Toa Yee Foo Soup\n                      Tomato Beef Chow Mein\n                      Clams in Black Bean Sauce\n                      Pepper Salt Pork Chops\n                       Pay Pah Dowfoo        -plus, you get courtesy house soup!\n\n*  amidst retro conversations, the wife-waitress joined in when we mentioned Kan's back in the day. . . in our 20's. . .  finding out the husband-chef was one of the jr. sous-chefs!  THAT's Y the food is so good.  We trained CONSISTENCY -  Every single dish out of Kan's kitchen was indistinguishably excellent.  -We're talking 35 - 40 years ago!\n\n[Y dint I order to go 4 late night? !!]  btw, UNder $25/person!\n\nSukkum UP!  LICK THE PLATE CLEAN!/ Hella good.\n\nAloha grind,\n\nC", "author": "Clifford L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "I love Susan. This is the best place in SF to be a regular.", "author": "Da Wei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "Wow! Talk about cheap delish food! We stumbled here when u-lee was closed.The salt pepper cod was perfect. We had a mix of food recommended by owner that included double fried chicken in sweet lemon sauce, sautéed veggies and Mongolian beef. My new fave local take-out spot!", "author": "johanna a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-15", "description": "This place is a hit or miss. I went there a while ago to get curry and I remember it being pretty good, but the next time I got it, it wasn't. The most recent time I went, I got the flat noodles with beef and I have to say, it was pretty gross. It was like my noodles were cooked for too long and when they realized it, they just put it in the container without mixing it completely with the sauce. The prices were pretty cheap. I'll probably come back to try something else because I really want to like this place.", "author": "Cicily C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-11", "description": "One star for 2 reasons\n\n1. Food tasted dirty...not fresh ingredients.  Found rubber band in the black been sauce. The soup tasted like dirty water with mysterious bones.\n\n2. Tables, chars, menus were all sticky.\n\nOne star for cheerful friendly waitress", "author": "Chie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "Take out ONLY! Yes, its a hole in the wall. Yes, its kinda gross. Yes, it looks like the back of the restaurant extended to the front of the restaurant. But the food....the food is what makes this place great. Fast an cheap. You can eat dinner under $5 and feel satisfied. The wonton soup was great. The soup base tasted natural and not oily or salty. Was just right. Rice plates are cheap and filling. The chow mein was good, kinda oily, but typical of most places. \n\nI'm scared to read the review about the rubber band in the black bean sauce. I guess it could be a hit or miss when it comes to sanitation...then again, its like that for most restaurants. It just depends on how much you care.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "I live about 4 doors down from the intersection of Hyde & Jackson so I've tried both chinese places a few times. Sun Kwong gets the nod, first for the price, second for the outstanding service and friendly owners and third for the food. \n\nIn my experience, the food is pretty much the same at both U-Lee & Sun Kwong. However, Sun Kwong is about 2-3 bucks cheaper on every item. \n\nI usually get take out there and they always set me up with today's paper and tea, which is a nice touch. The owner, who is a really sweet lady, ran my food out to me at one point when I had crossed the street to a corner store to scoop a six pack instead of waiitng inside for my order. \n\nAlso, they didn't mind when I brought my cocktail in with me when I went to order some take out on another occasion.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "This is my favorite Chinese takeout place in the neighborhood. Their house soup is delicious and tastes just like how mom makes it: slow cooked pork broth and veggies varying depending on the day. I love their chow fun. It has the perfect amount of wok flavor and balance in seasoning and noodles-to-goodies ratio. I also like their hot & sour soup, salted egg and mustard greens soup, fried rice, and various rice plates. The lady who hands me my order when I pick it up is so sweet and so nice, it always brightens my day.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "The service here was awesome! Susan is the owner and only sever and she couldn't be nicer. She brought us out the house soup for free, and had a huge smile the whole time we were there. Ordered the fried squid, which was pretty good. Dipping sauce was super tasty. Then the beef chow fun and chefs gourmet chicken. The chow fun was actually pretty disappointing, the only flavor was a char flavor from the pan. The chicken was amazing though, and the rice was great. also the food is extremely cheap! Great local spot with friendly service and good food if you order right.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "Amazing food, great prices, and friendly staff. This is your typical less-than-fancy but more-than-delicious Chinese restaurant. Walking by you wouldn't expect much but after you finish your meal you'll be stuffed and incredibly happy you went in. Definitely recommend! If you're going with two or more people, get the family special. God damn is it awesome.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "friendly and personal service. very aggressive prices, and delicious food.\n\ni'll be going back.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Went there for lunch this afternoon and ordered kung pao chicken, bbq pork with broccoli, shrimp fried rice and hot and sour soup. All of it was delicious and way more than enough for 2 people. Something else of note is that the entire restaurant was full and we were the only non-Chinese people there.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "The Food is 10 star quality, one of the best chinese restaurant I ever been. The service is wonderful, and the food is incredible cheap and deliciously out of this world. Highly recomend to come hear.", "author": "Manuel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "the owner is super sweet.  she said thank you a bunch of times and was very attentive to us.  the place itself is divey but i felt right at home, reminded me of some places i used to frequent in chitown.  the menus were basically falling apart but the prices on the menus were a huge bargain!\n\nentrees here range from $4-6.50, thats a steal if you ask me.  we had the yang chow fried rice, chicken w blk bean sauce chow fun and beef briskets and dry bean curd in a claypot.  the bbq pork in the fried rice was sweet and the rice was cooked in  some hot woks as the rice was a somewhat burned.  BUT it definitely added  a nice flavor, the same thing with the chowfun, good stuff.\n\nthe beef brisket was very good too, flavorful and tender.  ill definitely be back, the food was pretty good and so was the service.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-18", "description": "Every once in a while, I get a itch for Chinese take-out.  After reading many nice reviews and walking past Sun Kwong numerous times, I decided to give the restaurant a shot.\n\nAs many reviewers posted, it has a very nice woman in the dining room and many Chinese were dining in the dining room.  Always a good sign.  \n\nI purchased Chicken with Snow Peas.  With rice, my dish came to $5.00.  Quite the deal I thought.  And I was offered tea while I waited...a very nice touch.\n\nOn the positive side, the dish was hot and there was plenty of rice.\n\nOn the negative side...There were a few snow peas and other assorted veggies that were not fresh looking nor fresh tasting.  The chicken was not very tasty and had a rubbery texture.  The dish's sauce had no flavor.  The dish felt like a grease bomb half way into it.  \n\nOverall, the food disappointed.  I wanted to really like Sun Kwong.  I get it...it isn't a high end restaurant and I went in knowing.  Perhaps I bought the wrong thing.  But I won't be going back to find out any time soon.", "author": "Curtiss C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "Overall:\nGood food, good price, and they are sooooo sweet - they give my girlfriend complimentary tea as she waits when we get take out.\n\nPros: Chow Fun! The service is great, and they are really fast.\n\nCons: None that I have experienced.\n\nI live down the street and prefer going here over U Lee! The food is good and they prepare it fast. I love the Chow Fun, they make it perfectly - not greasy and there is lots of it.", "author": "Leo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-23", "description": "Went here last night for the first time. I had high hopes because 1) everyone who eats here is asian 2) the prices are pretty darn cheap 3) the menu selection is humongous (like abc cafe/washington st cafe big).\n\nI really wanted to like this place, because the food came out looking absolutely delicious and i really liked the waitress who clearly was also one of the owners.   \n\nWe ordered the fried chicken wings, the house combination chow mein (hong kong style, which means fried crispy thin yellow noodles), and the shrimp with lobster sauce.\n\nI'm kind of convinced I ordered wrong, because the food at the other tables came out piping hot and looked amazing. Our food came out smoking hot and looked almost as good too, but I was underwhelmed by the taste.\n\nFor starters, the ice water they served tasted funny. Specifically, it tasted like vegetables had been washed in the water. I can't imagine a scenario in which that could have happened, but it was a distinct and unmistakable taste.\n\nnext came the free house soup. little more than a chicken broth cooked with lotus root, its a lot like other house soups you'll often get at other authentic chinese restaurants. warming but almost by definition, nothing to salivate over. \n\nThe fried chicken wings were undercooked in the center. had a nice crispy outside, but the inside still had an undercooked look and taste to it (bloody, etc). Additionally, they were just fried with no spice to it, so the only flavor was the sweet and sour sauce served on the side. \n\nThe house chow mein was well cooked, but had a funny taste to it. Like the pan it had been cooked in still had detergeant residue on it and seeped into the food. Couldn't quite place it, but it was definitely there. The gf mentioned that MSG tastes funny to some people - since she couldn't taste it - but since i assumedly eat msg like its my job and have never had a problem before, i don't really think that was it.\n\nThe shrimp with lobster sauce looked good, although I've never seen the dish served with a brown tinge to it. maybe soy sauce? black bean sauce? whatever the brown, I was looking forward to it making it particularly tasty, but it was surprisingly bland. Needed both salt and pepper. Tasted pretty yummy with white pepper though. \n\nEgad! I am really tempted to try this place again since its so cheap, and the food comes out so hot (which imho is half the deliciousness for cheap food!), but two different items came out with a chemical-like taste to them, one came out undercooked, and one came out bland! no hits! sad. \n\nOn the plus side, the fortune cookies were better than usual (who knew that was possible?) also, it gave me a really awesome fortune saying something great will happen to me in exactly 3 months from yesterday). now that's a fortune.\n\n20.05 before tip for two people with leftovers, which cements this place as a cheap eat.", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "This place is such a gem.  The lady treats you like family when you walk in.  She's all smiles and will bend over backwards to give you whatever your heart desires.\n    And the food is practically free!  When I go in for lunch by myself I look at the menu and order something that's like $6.75 and ala carte, and she gives me free soup and tea (of course) and says \"five dollars please!\"\n    I like that whenever I go in there or walk by and look in, it's full of 65+ year old Chinese people.  I take that as a good sign.\n    My husband and I go here for dinner fairly often too and the price is always amazing, as well as the food.  Everything I've gotten here has surprised me with its tastiness.  I highly recommend the special of scallops and vegetables over rice for $5.75.  The egg foo young is also incredible if you don't mind eating pretty heavy.  I only wish they were open later and had delivery service.  Also be aware they are cash-only.", "author": "Sierra G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "Great neighborhood chinese joint.  Quick and easy.  I always grab take out there.  Beef chow fun out the door for $5.00 even; great value.\n\nLady is always nice.  No delivery though.", "author": "King D M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-23", "description": "I tried Sun Kwong yesterday because I saw all of the good reviews and I live a block away. I'm Chinese so I think I know good Chinese food. It was \"eh\". The only reason I'm giving it three starts is because it is really cheap and the waitress was nice. Which is actually really hard to find in a Chinese restaurant. But I agree with other reviewers below. The food kind of tasted metallic. I got the Hong Kong style seafood chow mein and chinese broccoli with oyster sauce. The noodles in the chow mein were fine, but the seafood tasted like it was old. And there was a lot of bean sprouts in it for filler. The chinese broccoli was fine, but I think you have to be a moron to mess that up.", "author": "Kerry K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "I just moved out of the Nob Hill/Russian Hill I'm-not-sure-which-neighborhood-this-block-really-is area, and this (along with Bob's Donuts), is what I already miss most.\n\nSun Kwong is FANTASTIC for either dine in or take out (and much better than the place with the softball-sized potstickers across the street).\n\nPRICE: Can not be beat.  Large, delicious portions for insanely low prices.  Cash only is not uber-convenient, but the low price is worth the trade-off of convenience.  My boyfriend and I could order an appetizer + 3 entrees and not cross $20.  Insane.\n\nSERVICE:  For both take-out and dine-in, I have had great experiences.  The woman who is the owner/host recognized me after going a few times and was always very friendly.  When I picked up for take-out, I was always offered tea ... and often times, when I dined in, I would get soup + tea on the house.  \n\nDECOR: This place is not known for its extravagant or lush interior.  The focus on good, inexpensive food, and the decor is quite sparse.  I enjoy dining in there but can see why it's more of a take-out place.\n\nFAVORITE DISHES:  Anything I've tried has been good.  A few favorites: pot stickers, beef w/ broccoli chow mein, salt & pepper pork, bbq pork with veggies, curry chicken chow mein.  Fried rice and won ton soup also solid.\n\nOVERALL: LOVE this place...and wish it had another location in NOPA/Western Addition. :)\n\n(Note that it's closed on Sundays, which I would tend to forget.)", "author": "Kathleen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Best hole-in-the-wall Chinese restaruant around. Good authetic Cantonese food with some of the all time favorites similar to growng up in Chinatown in the 70's, most notably their Hung Tao Yee Foo Won Ton, which  has a good thick broth small chunks of meat, just as I remember back in the day.  Their chow fun/mein and rice plates are all good as well.  Its a place where all the contractors and mailmen come to eat...and they know all the good places. Adding to the ambiance are the sounds and sights of the Hyde Street cable cars rolling by...\"Only In San Francisco!\".  Even though it's a no frills hole-in-the-wall, it is a clean place. Good food at good prices.", "author": "Stanley H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "Sun Kwong was a nice drunk treat. I think what I ordered was the standard meal for Americanized diners (Combo A consisting of an egg roll, pork chow mein and sweet and sour pork) and it was okay. It was no Panda Express, but it was okay.\n\nThere were other Chinese diners there so I'll bet there are some really great authentic dishes there you just need to know what to get.\n\nSome white guys told us we should try U-Lee next. Should have known not to trust them! In the epic battle between the two, Sun Kwong comes out on top. (See U-Lee review.)\n\nAll in all a very mediocre place to eat but I'd gladly eat here again for fast, cheap food, especially if I'm drunk. \n\n\nQUESTION (4/9/13):\nHas anyone else who gave this place mediocre reviews get harassing \"compliments\" from this guy?\nhttp://www.yelp.ca/user_details?userid=5ouztxdsa-PW_hWYx-oTfQ\n\nReally hope he isn't affiliated with Sun Kwong. He told me I have a fat face, won't find a husband, and some other lewd and random things. All that from my profile picture and review about Sun Kwong. Yeesh.", "author": "K C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "I have been going to Sun Kwong for most of my life. If you want good, authentic Chinese food at a cheap price, this is where it's at! You can go there with your whole family and some friends, eat tons of food, have leftovers, and still not break the bank! \n\nHere are some family favorites..\n~ gin du spare ribs\n~ beef stew\n~ fatty pork\n~ fried shrimp\n~ fried tofu balls\n~ beef chow fun\n~ fried rice\n~ black bean shrimp\n~ gai lan\n\nOkay, I could probably keep going on good food there, but those are pretty much our \"go to\" dishes. Plus, you always get a complimentary bowl of house soup to enjoy while you wait. The server is so sweet and knows our family. The tea is good, but we always ask for it to be hotter. \n\nAs for the great debate between Sun Kwong and U-Lee??? I say they are not comparable! Yes, they are both Chinese restaurants, BUT my family has gone to both FOREVER,  and usually for different dishes. So, where we decide to go, usually depends on what we are in the mood for. However, if you want to base it solely on authentic Chinese food and great price, Sun Kwong is hard to compete with!", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-08", "description": "You swore swore swore swore swore my prawns and veggies were steamed. Swore. I think they were. Not 100% sure. There was some unknown coating of something on the prawns, and to be fair, dabbing with a paper towel didn't reveal the usual oil blot. Not sure what it was, but a little suspect.\n\nNot suspect was the price ($7), the size (a lot) and the educational opportunity (sharing with my sister chinese doesn't always mean oily mess).", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-28", "description": "This place is in the middle of the neighborhood that I grew up, but I admit that the appearance scared me, for years.  After seeing numerous, positive Yelp reviews, I had to try.  I'm not afraid of \"greasy spoon\" eateries, but this place is very drab, slightly reminiscent of Mariposa Cafeteria (one of my favorites), without the 400 pound truck drivers.\n\nThe place is actually quite clean and your elbows don't even stick to the tabletops.  The waitress is friendly and helpful (she spoke to us in \"Chinglish\"), and translated the Chinese menu specials.  One order of beef tongue over rice and one order of pigs feet over rice.\n\nThe lunch menu includes a really large bowl of the \"house\" soup; this one was lotus root soup (just like Grandma's).  The specials were tasty, plentiful, and CHEAP ($4.50/ea)\n\nThis place is definitely a neighborhood jewel for the working class.  Lots of Chinese workers (house painters and construction workers), Muni drivers/conductors, SFPD, and DPT traffic control people (parking in the red zones!)", "author": "Collin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "This is my go-to neighborhood Chinese place. They're always friendly, quick, and cheap. What more do you need from a Chinese restaurant?\nAlways accommodating when I drop by a little late after work, which is a bonus.", "author": "Tash T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "Great food, hospitality, and service!  Plus the lady that works there is super friendly, offering water and a newspaper while I waited for my order to-go.", "author": "Josh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "Small local 10 table Chinese restaurant. We had the curry chow fun, combination chow fun, fried rice, gourmet chicken (which is kind of like a cross between Sesame and orange chicken). The meals were excellent, although not as spicy as I had hoped. But I give them a four star for flavor and I spiced them up with the srichacha sauce on the table. It is a huge quantity of food for the amount of money. Many of the dishes are five dollars or under and can easily feed one hungry person or two normal people.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-06", "description": "If you enjoy Westernized Chinese food more, then go for U-Lee, not to say it's bad, just different preferences. However, if you want to experience authentic, home-style Chinese cooking, then give this place a try, Susan won't let you down.", "author": "C J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "I feel remiss for not writing this review sooner. This is my standard choice for the kind of Chinese mama home cooking I never had, but would have if I had a Chinese mama. This is the next best thing though. They treat me like family. \n\nIt is dirt cheap with no decor to speak of (oh yeah there's a cheesecakey Chinese hottie calendar hanging on the wall) and a chalkboard with the same daily specials that are never erased - scallop with snow peas, pot stickers and a bunch of stuff in Chinese I can't read - imagine.  \n\nI tend to order from the same rotating 5 or 6 favorites - cod fillet with tender greens rice plate, spare rib won ton soup with plum sauce, prawn with lobster sauce rice plate, bean curd with minced pork and tender green rice plate, tofu with mixed veggies and a tasty seafood combination clay pot. Meals always come with a big bowl of the daily house soup - anything from seaweed with egg, to barley with white fungus mushroom, sometimes a simple, wonderful, homemade chicken broth with bits of meat and carrot. It is very down home. Avoid the lunch rush from 12-2 when it is swarming with local workers and a madhouse. \n\nThe sweet woman who runs the place with her husband always brings me the paper to read, toothpicks and fortune cookies at the end of my meal, and occasionally something special to share from their table when they sit down to a family meal and I happen to be in there. My Chinese home away from home. Never fancy, always warm and welcoming.", "author": "wendella a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "YUMMY is all I have to say for this place. Not just great bang for your buck but the customer service is excellent. We have always had a great experience and great food when coming here. ENJOY", "author": "Maria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "Sure it's dirty.    The menu in the window is stained with... something.    Pay this no mind.   This is good stuff.   You're rarely going to spend more than $6 for a take-out dinner and you'll plenty of value for your money.  \n\nI've lived in this neighborhood for 6 days now and I gotten dinner here 3 times.    There will be plenty more in the future.", "author": "Beau G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-19", "description": "Sun Kwong is a really great neighborhood restaurant with friendly waitstaff, and I've been coming to this restaurant for years. It's cheap, authentic Chinese food, and I'll continue to be a loyal patron.", "author": "Storm T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "VERY IMPRESSED- great food, great service, authentic and healthy!", "author": "anthony e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-20", "description": "Words cannot describe how much I love this place.   I don't know how long I've been going there but it's hovering around 30 years.  I moved down to LA years ago and make trips just to eat there.  \n\nDon't expect any fancy ambience when you go.  Do expect yummy food for less than $5.  Everything is delicious and made to order.  \n\nMy family has gone there so long that they already know what we want and they get started on our noodles as soon as they spot us.  The family that runs this place is super nice and will make you feel at home.\n\nCops, cable car drivers and meter maids eat there so you know it's a good place to eat.", "author": "Cathie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "The cheapest entree here is $4.\nThe most expensive entree here is $6.25. \nThe owners are incredibly friendly.\nThe portions are large, and the food is better than its price would suggest.\nThis place is exactly one block away from my house, and downhill to boot.\n\nI had the seafood clay pot and was not disappointed; it didn't absolutely blow my friggin' mind, which would be all this place would need for the fifth star, but the price point and convenience factor are more than enough to ensure that I'll be back. \n\nI'll take Colleen L.'s advice next time and go with her second suggestion, although I'll have to either write its name down beforehand or bring one of my two Mandarin-speaking roommates. Hell, I'll even buy them dinner - I've bought beers for more than these meals cost.", "author": "JR H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "what can i say about this place other than \"Want a FULL meal for $5?\"\nand by FULL MEAL-i mean enough to feed you for a full day? breakfast, lunch and dinner?... yeah, that's the place!!!  theres a sweet old lady at the front, always takes care of us \n\nsucky thing is - i want to go there on Sundays, while i'm watching football....  but they're closed on Sundays!! honestly!! who closes on Sundays?!!??!? that just aint right", "author": "Ken T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Good food for a great price.  Their menu is surprisingly expansive, with traditional Cantonese comfort food as well as standard Americanized Chinese fare.  Lunch specials go for $5.00 even, and offer a healthy serving size of food that will leave you satisfied.  It may not be a destination spot, but I recommend this hole-in-the-wall to anyone in the area.", "author": "Alan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-21", "description": "My roommate recommended this place to me and I thought I'd give it a try since its across the street from my house (1 star).  Its super cheap (1 star) and the food was good.  I feel like Chinese food in the city is so touch and go.  Its either too authentic for my taste, too greasy, or the meat is shady.\n\nWe got pot stickers, chicken fried rice, sweet & sour chicken, and beef & broccoli.  The pot stickers were pretty good.  Not amazing, but nothing to complain about.  Chicken fried rice was really really good.  Not too greasy and not that much chicken.  I hate it when its loaded with chicken, that might be weird.  But yeah, perfect amount of chicken.  My boyfriend got the sweet & sour chicken and he said that the chicken still had skin on it.  But he really enjoyed it.  Finally the beef with broccoli was meh.  The beef was pretty nasty.  But the broccoli was good.  \n\nOverall I liked it and I will definitely go again!", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "This is the restaraunt that inspired my joining the yelp community. \n\nThe food and service are both fantastic, but the price is ridiculously cheap!\n\n\n\nI live around the corner and foresee this being a once a week dining destination\n\nMy pallet, as you will learn if you follow my reviews does not give many restaraubts 5 stars\n\nThis is truly a uniqe combination of affordability and quality authentic Chinese", "author": "Mark P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-05", "description": "Yelp needs a half dollar sign rating for the priciness of this place.\n\nI had sun kwong beef, which appeared to be what the place was named after.  The waitress asked if I wanted it on the rice or separate.  I only initially understood \"on the rice\" and went for that.  In Taipei everyone eats rice separately from a bowl in their left hand, which is the way I prefer it too.  Sadly, my moment of understanding came too late.\n\nFirst came a barley soup (on the house?) with a huge chunk of beef joint (oh so Chinese) sitting in the center.  That was decent.  Very little meat involved but it wasn't introduced as such.\n\nNext, I got my main dish, your typical beef with all sorts of vegetables. It instantly fogged up my glasses.   After a while I realized that the reason was because the rice was blisteringly hot, not the food.  In Asia I scarcely remember having blazing hot rice, anywhere.  I think it might've been to warm up the food (the food on the edge of the plate was quite cold).\n\nNonetheless, when the waiter brought out the check, it came to $4.75!  I couldve sworn it was more on the menu, but I'm not complaining.\n\nAll in all, mediocre food, stunningly cheap, friendly service (Cantonese sadly though, I only speak Mandarin).  Also a block away from where I live.\n\nIf I can find something I can palate on a regular basis, I'll be back... The food is practically free.", "author": "Ben N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "Perfect. This lady is so nice - one time I had a really bad cold and came in to make a takeout order and she insisted that I sit down and drink some tea.\n\nThe Mongolian beef and egg drop soup are my faves.", "author": "Leigh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-21", "description": "This China Girl is verrry picky about Chinese food. Very few dishes live up to my mom's. Well, I rediscovered this little family owned restaurant and  it has become  a Friday night habit.  My hubby, and I often order the following:\n\nSingapore style 'curry' chow fun w/ shrimp\n''pay pau tofu' - tofu mixed with scallions and bits of bbq pork, fried to perfection!\nsteamed Chinese broccolli w/ oyster sauce\nblack bean rock cod\nand seafood clay pot\n\nEverything is delicious!  Can you say 'HAPPY STOMACH'??\nIt's an added bonus that the waitress is sooo pleasant and remembers her customers!", "author": "Lorena W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-28", "description": "I have eaten or gone to this place my entire life(25) years. It was a staple when i visited my grand parents. Its the standard by which i judge restaurant chow mien and chow fun.\r\n\r\nA must try is the kung Tao Yee Foo Wonton, its an old school Chinatown dish that you can't find anymore, and they do it pretty darn good.\r\n\r\nThe chow Fun is beyond good, the noodle are the perfect texture of chewy and soft, oiled to perfection and cooked with beef I could eat that till I die and feel bad for doing so.\r\n\r\nShame there is no parking, but don't let that stop you!", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-18", "description": "I haven't sampled too many of the items in this restaurant. What I have had has been delicious. I love the fact that I am offered tea when waiting on takeout.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-05", "description": "I've eaten at this place more times than I can count. I grew up near here and my family would order from here at least 5-7 times a month. Multiply that by 20+ years = some kind of figure I can't fathom. Now that I moved back to the 'hood, even hubby who is new to this area quickly made it one of his favorite take out places. I'm not going to lie and say this is the best Chinese food you'll ever eat, but the overall taste and price make it worthy of  4 stars for a take-out joint. The food is cooked home-style which is tasty, cheap, substantially portioned, and not too greasy. The owners (the wife is the server; the husband is the cook) are super friendly and will always offer you a cup of tea while waiting. \n\nI think I've eaten every thing on the menu at least ten times - maybe eleven?  - and it's an extensive menu - but these 5 are my top favorites which I order time and time again (they're all only  $5-$6 each). Generally everything is A-OK but the beef can be hit or miss:\n\n1) Salty fish & chicken fried rice - Another yelper said they make the best one in town, and I would second that! The dish comes out with a beautiful smoky flavor filled with lightly seasoned bits of chicken and salty fish. I like that they chop up the salty fish small enough so that the whole order has a consistent flavor. Other places keep the bits bigger, but then you either get a mouthful of plain rice or a mouthful of just salty fish - ick! Here, the entire order is perfectly blended and every bite tastes as good as the next. They also add in some shredded lettuce which keeps the smoky flavor in check. An indicator of a good Cantonese restaurant is if the food has wok \"mei\" which = a smoky, wok essence. Hard to define, but essentially it's when the chef has cooked the food on a very high temperature wok (you should see actual flames shooting up under the wok) such that the flavors are sealed in with a slight smoky taste. Few restaurants master this, but Sun Kwong does it great on this dish.\n\n2)  \"hung toe yee fu won ton\"  I don't even know what this is called in English, and it's not listed on their menu. Basically, it's a soup where the won tons are first fried, then added back into a soup made out of swirled egg, minced bbq char siu/pork and minced shrimp. It's garnished with cilantro and green onion, but I usually ask them to skip the cilantro. Overall, it looks like a red colored egg-drop soup w/ wonton. I like this dish because the wonton skins take on a different texture and get a distinct yet mildly smoky flavor when fried first. This soup is so good I once saw a group of Chinese workers come in with their own metal pots (some big enough to qualify as vats), and literally ask Sun Kwong to fill up their pots with this soup!  I must not be the only one that thinks it's good....    \n\n3) Tomato Beef chow mein - This is a uniquely American-Cantonese (perhaps even only SF) dish. Several times I tried to order this down in LA and they didn't know what I was talking about or it came out horribly wrong. The tomato beef chow mein here is exactly like how it's supposed to be: a sweet, thin yet substantially tomato-tasting sauce. The one at Sun Kwong comes out with juicy pieces of tomato, onions, and red & green bell peppers. I typically don't order beef from here, but this is one dish that I would still order w/beef. The one across the street at U-Lee is also pretty good, but I like Sun Kwong's better. \n\n4) Pipa Tofu  (\"pei pa dow fu\") - I don't know if they list this on the English menu but it's on the Chinese one. They're braised tofu pieces shaped like Chinese lutes, hence the name. The tofu mixture has a little finely minced bbq pork (I'm guessing it's this but never asked) and some cilantro. The mixture is then molded into lute shapes, quickly fried so the outside is brown but the inside still soft & moist, then braised with a light sauce. It's a very light and delicate tasting dish (tofu doesn't have a lot of flavor by itself) but if you like fresh tofu, you'll probably like this. \n\n5) Steamed pork cake w/salty fish (\"ham yu ju yok bang\") This is a very traditional home-style Cantonese dish, the kind your grandma back in the village would make. It's probably best to eat this one there rather than take-out. The steamed ground pork mixture comes out soft and fluffy, has the right amount of spices, and with a nice layer of juice.  The salty fish piece in the center is big enough to flavor everything. As such, it's great comfort-food made especially well here, but if you've never eaten it before, you may not like it. Chinese people would think it looks great, but I've seen non-Asians shying away from this dish based on looks alone. It doesn't look gross, but it just doesn't visually resemble any kind of  known Western dish except maybe a steamed, wet meat patty surrounded by juice.  (See! I told you that it probably sounds weird!) But seriously, if you can get past the visual look, it's a really tasty dish.", "author": "Colleen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "After walking around San Francisco for hours looking for a decent place to eat, my friends and I stumbled into this small resturant.  There was about 20 of us and yet, they managed to have us all in one long table.  We decided to do a family style meal which turned out to be amazing.  The food was good and service was fast considering the fact that we ordered about 10 dishes.  The only problem was the communication with our orders ( couldn't understand their accents ).  5 stars for good food, good service, and exeeding our expectations.", "author": "Andrew V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "My family and I have been coming here for years! It's the only restaurant I can remember going to as a child. I still order takeout  from here regularly. The food is consistently yummy, authentic, affordable, and the  lady who works here is super friendly. Hmmm...  I think I'm craving Sun Kwong now.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "i was walking by on my first day in the neighborhood, and something caught my eye. Can it be?\n\nI walk in, \"i'll have the beef tongue on rice please\"\n\n10 minutes later in my apartment...tongue on tongue action baby!", "author": "tru l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-23", "description": "It's kind of an ugly place, and it may not be the cleaniest but then again what Chinese restaurant is?\n\nSun Kwong is just a couple blocks from my house and I've been eating there all my life. We used to eat there before it was called Sun Kwong. When I was little the waitress Yolanda would always sneak me extra fortune cookies. \n\nEven to this day when my family walks into the restaurant or calls for take out the waitress or the owner knows our order. Tomato beef chow mein, wonton, and foil wrapped chicken. \n\nGourmet Carousel (on Franklin and Gough) used to make THE best salty fish chicken fried rice but for the past couple of years it seemed to go downhill. Sun Kwong who never used to make it well, now makes what I think is the best. It has a nice smokey flavor to it. Yum!\n\nSun Kwong may not be the best Chinese restaurant but it definitely is a neighborhood gem. U-Lee, which is directly across the street, is usually more crowded and most people like it better. But U-Lee is filled with mainly non-Asians whereas Sun Kwong normally serves Chinese families, like mine. Both are good but Sun Kwong has a more homemade authentic taste.", "author": "KayKay D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "You looking for cheap food, you should hit this spot. It got 2 stars from me cause food wasnt good, its eatable but no good. It was like those western movies when a stranger steps into a local bar everybody stops whatever they were doing. When we stood next to the door, we heard all the knifes falling on tables, every single costumer was asian.", "author": "Ekin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "I love the hot and sour soup here.  It's actually hot AND sour.  Just about every place I've been to goes way too easy on the vinegar, leaving out the sour, and in some cases they leave out the hot as well so the flavor is just...brown.  The food is cheap and the lady that runs the place takes good care of me - we drink tea and talk about how dirty the city is while my food is being prepared for take out.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "Okay, the decor is a little mundane (a little?) and yeah the Specials board hasn't changed in ages (I did suggest they might want to liven it up a little) but then that keeps the touristy riff raff away or across the street, the U-Lee potstickers and Aspargas and Chicken in black bean sauce are both excellent but this is about SK so ... they have a daily special, Monday's is OxTail Stew, Tuesday is Chicken Curry with Potatoes, Wednesday is Pig Feet Stew, Thursday is 3 Mushroom Chicken and Friday is Lamb Stew with Dried Bean Curd.  For $5 you realy can't go wrong.  The proprietress is super nice, when I broke my foot she was hecka concerned and would take my order and deliver to my car when she would see me pull in front.  Nice house soup while you wait for your takeout.  I want to try the salty fish fried rice after reading that other reviewer.  Very cost effective place and they are very earnest in preparing good food at an incredibly reasonable price.  Maybe I should 5 star them but that might make it too crowded ... a neighborhood gem.", "author": "Terry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "this is a nice little hole in the wall restaurant.. The food is very inexpensive and the staff are very friendly.. I believe that this is a family owned establishment and im all for supporting family owned businesses. I sat down and the nice lady brought me a newspaper and I ordered beef chow fun and egg rolls. The food was good and different then your run of the mill Chinese food. The egg rolls were very tasty and came with sweet and sour sauce, which I think was made from beets.", "author": "Bradley P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-14", "description": "You know you are in a good place when you can get your dishes Made-To-Order. It's hard to find the right combination of rice noodles, meat and veggies outside of my own kitchen, so I'm glad that this place is so close to home.  \n\nSun Kwong isn't much to look at and not quite a place known for their ambiance. However, if you value a good value - this is the place to go for a quick fix if you're not sure what to do for dinner.  Their Sam See Mai Fun is one of best in the city. Chinese foodies talk about the amount of Wok-Intensity (Wok - Hei) that makes a good restaurant -  the chef definitely has that magic touch- which turns Americanized Chinese food into something quite authentic and tasty!", "author": "Caryn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "This place feeds me at least four times a week.  Eat there.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "Decent food, at pretty much the best price ever? The couple that owns this hole in the wall, have been running this restaurant for twenty-five years strong. I have so much respect for people who start their own businesses.\n\nThe waitress says the business can be slow because parking is so difficult (which I strongly agree). The customers there were CLEARLY regulars at Sun Kwong. So friendly, and sparked conversation with the waitress.\n\nHasd the basic fried rice fix, peppered chicken, and veggie and tofu. It was decent food, and so cheap!", "author": "Melissa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-26", "description": "Five stars for Yolanda alone!  She's awesome!  She always remembers what I like to order even when I haven't been there in a while.  Large portions at low prices.  My friend and I used to go there all the time and order soup (the best hot and sour soup), potstickers, and two entrees.  We would leave FULL with leftovers and never pay more than $20 total with tip (actually, we would usually kick down a couple extra bucks for Yolanda.)  Sun Kwong is definitely a hole in the wall, but is my favorite place for good, cheap Chinese food.", "author": "Sara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-17", "description": "Oh wow!  Home cooking, Chinese style.  Huge, huge portions for dirt cheap prices all served in what looks like the owner's personal kitchen.  Most entrees are huge, good, and under $6.   One time, I dined on a 6 course family style meal with 6 people for less than $40!  And it was all really good.   It is all dished up by a mild mannered, sweet woman who is the owner.  It really feels like home when you are dining here.\n\nSome of the things I have tried and liked are sweet and sour pork, potstickers, wonton soup, chow mein, chef's special chicken, beef with broccoli, and so on.  There are also a lot of really authentic items if you are so inclined. The chef who is the other owner will also cook up special requests.  So, if you have a favorite dish that mom used make (my mom is white as hell, so she only made bland white people Chinese-inspired food), then ask for it to be made.", "author": "t l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-10", "description": "This place is a solid 3-star. The cooking is more authentic than I like although I am Cantonese. I much prefer U-Lee, which is cati-corner from this place. The clientel is predominately Asian here, which attests to its more authentic Chinese cooking. I am just too used to Americanized Chinese cooking, having been away from the Bay Area for too many years. As a kid growing up in SF, I ate all the authentic stuff, but no more. I can't believe all the stuff I ate then...\n\nNote that I gave Sun Kwong only 3 stars because I am not a fan of too authentic, \"down-home\" Chinese cooking. However, someone who is, may well give them 4 or 5 stars. So my rating does NOT imply that their food is not good, just not my cup of tea.\n\nSusan, the waitress and wife of the cook, is very friendly and courteous.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "3.5 stars.  it's hard finding good chinese food in russian hill, but sun kwong is one of them.  there's no great decor or ambience, which is a sure sign of any decent chinese restaurant.  the woman who works there is super nice...soo nice that i ended up ordering an extra entree to go when all i wanted was soup.  prices are cheap,  so the extra dish didn't put a crazy dent in my wallet either.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "It's really worth it . For less than 15$ we had a huge dinner my husband and I. We went the family offer for two and we wished we were more hungry. It's not a fancy place but you know  you will it something tasty and quickly.", "author": "mia m."}
