{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "My bf was craving a breakfast burrito (bb)and saw Sun Rise listed on Foursquare as one of the best spots for bb in SF. We got there around 9:30am and were seated right away. We both ordered the Vegan BB, which comes with soyrizo, black beans, sliced avocado, and potatoes; with salsa on the side.  Let me be clear, were not disappointed! The burrito is about 6\" long and pretty heavy. It has a nice balance of ingredients, and the salsa on the side is perfect for individual adjustment of spice.\n\nThe only negative feedback I could give was actually something my bc mentioned, which is that the yellow paint on the walls is a bit much. \n\nOther then that 5 stars!", "author": "Seumanu D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "A mom and pop shop if I've ever seen one, with all the charming and endearing qualities you'd expect. The atmosphere is home-y and quiet, almost like you're sitting in a grandmother's kitchen. \n\nThe vegan breakfast burrito at Sun Rise is probably my favorite I've had maybe anywhere thus far in SF. It comes loaded with potatoes, black beans, avocado, soyrizo and a side of homemade salsa. It's pretty hefty -- enough to fill my girlfriend and I up and hold us over until lunch time. \n\nThe vegan tamales here are also very good. They're moist and flavorful, perfect if you're craving tamales but having trouble finding vegan options. \n\nI love the menu at this cozy, casual spot and I'm looking forward to trying their other vegan options! Assuming, of course, I can ever bring myself to try something besides the breakfast burrito. \n\nGive this lovely, family owned and run restaurant your business -- you won't regret it.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Great option for Vegans or Vegetarians. Glad that it opens up early\n\nTried the Vegan French Toast and Vegan Burrito and got the Vegan Fajitas and a few pupusas to-go\n\nFrench Toast - Did NOT really like the taste and it was pretty dry, liked that it came with a lot of fruits which looked fresh.\n\nVegan Burrito - Had beans, fries, avocados, tofu and was very tasty\n\nVegan Fajitas - This had Tofu with a bunch of veggies in a spicy sauce, served with rice and beans. This was very flavorful but kind of expensive ($16.95) for a vegan dish.\n\nPupusas - These were not that great. I got 1 each of the Vegan options which were spinach, zucchini and lorocco with beans. But the pupusas were 95% beans and tiny pieces of the other ingredient. So was not a fan of the pupusas.\n\nBut I loved the fact that they have several vegetarian / vegan options.", "author": "Umang D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "Vegan Breakfast Burrito was delicious! Service was fast. No wait around weekday breakfast time. Clean bathroom. Friendly staff.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Sun Rise is the type of restaurant that makes San Francisco awesome.  A small, family run business, with delicious dishes and friendly service. They even have several vegan dishes, like the soyrizo burrito that is delicious.  I was sad to see that their landlord increased their rent by $3,000/month recently.  \n\nIt was be a great shame for Sun Rise to go out of business because of the rent increase.  I hope everything works out for Sun Rise!  Please go eat their to help support a great local business!", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Best vegan breakfast burrito in the city!\n\nPlatanos, papusas, french toast vegan options as well.\n\nWelcoming vibe and kind staff, we will be back regularly.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "Beware!\nThis place is a royal rip off.! We checked out their online menu and ordered 12 pupusas  ; when we went to pick up , they charged us almost double the price , stating that they had recently \"updated\" their prices. We were hungry so we just paid- The place was empty, we should 've known, this is the last time we order or go to this dump.! The pupusas were greasy and small. \nDon't dine at this place!", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "Eggs, chorizo and black beans.  A bit pricey for what you get.  $15 for what seemed like a kids meal and not much egg in the chorizo.  It was tasty and a quick hunger fix.  Not a place I would make my regular stop.", "author": "Cyprian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "My partner and I stopped here will visitingnSam Francsico. I am vegan and my partner is vegetarian, and we had multiple options. We ordered the vegan french toast and the vegan tofu scramble (pictured) and split it. The tofu scramble was amazing.. well-seasoned tofu with spinach, zucchini, tomato, onion, mushroom, and peppers. It came with some big homefries (about 1 cup worth), 2 slices of toast with an amazing strawberry jam, and was garnished with orange and apple slices (I also used the tapatio hot sauce provided yummm). The french toast was made with soy milk and came with diced fruit on top (apple, orange, banana, strawberry). This little hole-in-the-wall was a great find, especially after finding it tough to locate a vegan breakfast place in San Francisco that also offers multiple nut-free options. It can be frustrating being a vegan with a nut allergy, so I was extremely pleased to come here. The food was delivered in a timely manner and the waitress was attentive, kind, and accommodating (e.g. brought me soy milk for my coffee). Great place!", "author": "Whitney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "I just went here tonight for the first time to watch my friend play music. The food was so delicious-- Really fresh Mexican and Salvadorean cuisine prepared with care. Also had some great vegan\ndishes, like fajitas with Tofu and very flavorful black beans. There is something for everyone there. \nThe staff is also very friendly\nIm going back soon!", "author": "Sophie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I love Sun Rise Restaurant. I went to elementary school a few blocks from Sun Rise, and considering how much the Mission has changed and been gentrified, the existence of Sun Rise is a both a blessing and a testament to their fantastic food and community importance. As a vegan it can be difficult to do breakfast (yes, even in San Francisco), but when I feel like going out I always want to come to Sun Rise. I'm a huge fan of the vegan breakfast burrito, and having some plantains on the side is that much better. I haven't been back for lunch but I really want to!! Vegans, there are explicitly vegan options available for vegan breakfast so COME HERE! No frills, authentic, super delicious, filling, and reasonable prices. Put your money where your mouth is and support places like these!!! Unfortunately they're a dime a dozen in the mission now a days.", "author": "Becca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Platano frito on point! Salvadoran horchata hella good.  Pupusas melt in yo mouth. Come support this awesome local business.", "author": "Edith C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Vegan burrito \nHuevos rancheras\nChan drink\n\nWe loved the food\n\nIt's too expensive", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Delicious Breakfast burritos and pint glass mimosas!!!!!! Plus it's close to my house so I can roll home after", "author": "Ali E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This amazing find has the best sopa de\nres and gallina w / fresh veggies and bone broth. They are plagued by doubled rents and need folks to support their new evening hours.", "author": "Annette G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I still dream about vegan breakfast burrito here from last week!  Fantastic place that I would frequent if I was a local", "author": "Caroline D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Cheap, tasty, vegan options! What more could a girl want? \nCozy atmosphere like a diner breakfast experience you want on a chilly Saturday morning in the mission. Quick simple service. \nNothing fancy! Just yummy! \nTry the Vegan Breakfast Burrito with a double espresso! Woohoo!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Hell yeah VEGAN TAMALES AND PUPUSAS!!! Go here! Great place, super friendly staff, delicious vegan food options. SO glad I stumbled across this on yelp!!!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "This hAs been my local gem in the mission district. Authentic food and very welcoming friendly staff and service. I hope it stays here forever, pleAse support this local business.", "author": "Julia .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "the ambiance is very homey and intimate, it feels like you're eating at your abuelita's house. the food arrived very quickly and was delicious! the tofu plates are perfect for vegans and vegetarians. the vegan pupusas are fresh, savory, without grease, and definitely not salty! the owner was very kind, and considerate/attentive for vegan diets. the food was plated very well, and everything was made with delicious, fresh ingredients. overall it was one of the best breakfast experiences i've had! highly recommend for omnivores and herbivores, if you're craving a delicious latin-inspired meal.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "This is a hidden gem. But the crowd is mostly non-Latino/a. The restaurant staff seem to be mostly Salvadorean. On a recent visit, most people seemed to be ordering regular breakfasts. We were the only table having Salvadorean food. My GF likes rhbecause the pupusas aren't greasy. My family prefers a legit Salvadorean place and prefer the greasier pupusas. I shall take my non-latino, vegetarian friends here (lots of vegetarian options) and my family to La Santaneca de la Mission (Mission at 24th).", "author": "Rude G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Sun Rise is a little restaurant with friendly servers and very fair prices. The owner has high standards for cleanliness and healthy food. She offers a variety of vegetarian and meat dishes and uses fresh ingredients to serve up dishes that are not greasy. She is a humble and hardworking chef whose health-conscious approach to delicious food is born not of any culinary trends but her love of feeding her family in that way.", "author": "Doriana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Delicious El Salvadorian food, and very vegetarian friendly. Warm environment with a really nice owner. They're now hosting private parties too!", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Great food and great place. They also really cater to vegetarians and vegans, which I really appreciate. We had pupusas, plantains, and a vegan burrito, damn, so good!", "author": "Bradley A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "It's hard to find vegan pupusas and tamales and they offer it! Nice selection of meals and side orders to pick from.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Such a great brunch experience! The vegan breakfast we ordered was delicious, filling, and was very affordable. Our host who is also the owner was kind, attentive, and considerate of our vegan needs. The atmosphere is inviting and feels like home. It was delicious and one of my new favorites!!", "author": "Lulu K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-15", "description": "Their website has not been updated in 10yrs, according to the owner lady. Online my breakfast said its $6,50 and when I got there i was shocked that it was 8.99...plus tax. When I asked why the website has different pricing she said \"its not been updated in 10yrs\". Good to know to bring extra money so you arent short when you get there.", "author": "Isa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Been going her for years.  So sad that because gentrification , her rent has been raised $3000 A MONTH and she will probably end up closing just like everything else in our home. It's hard being an sf native these days.  :( huevos al Gusto is my fav go here and support plz", "author": "Georgia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Exactly what you would expect when you walk in! Somewhat slow inattentive service, but overall friendly. Food was decent; I got heuvos rancheros. Would eat here again!", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Cute little breakfast spot in the middle of Mission. Had huevos Mexicana with a glass of horchata. The horchata was fantastic and one of the best I've ever had!\n\nPerfect for a quick breakfast or lunch. Highly recommend if you're in the area. Definitely try some of the \"Sabor Latin\". Enjoy!!", "author": "Matt B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "I came here for the first time today for brunch and I was so glad I picked it out of all the other places we were looking at in the Mission. They have all the Latin breakfast staples, as well as classic Salvadoran dinner entrées, including pupusas. They have also an expanded breakfast menu to include omelettes, benedicts, and the like.\n\nI got the chilaquiles and they did not disappoint. It was perfectly flavored which help me get over the fact that it doesn't come with chicken at this spot. Friends got pupusas, huevos a la Mexicana, and tamales and all liked their dishes as well. \n\nI was a little sad to see that they have things like different vegetarian pupusas, but didn't have some other typical options like loroco. Perhaps catering to their usual crowd! Understandable in the Mission.\n\nAll in all, love this spot and can't wait to come back.", "author": "Neda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Went here on a weekday morning because I read they have vegan-friendly​ options. The restaurant offers Latin​ and American​ cuisine for breakfast, lunch, and dinner. The owner was very nice and greeted us as soon as we came in. We ordered the vegan french toast, huevos rancheros, side of hash browns, and bacon. I enjoyed my french toast and my fiance enjoyed his food as well. It all taste fresh and homemade. I noticed there's a sign on the door asking for donations to keep their business running. Their landlord raised their rent to $3,000 a month which is the equivalent of an extra $36,000 a year and on top of that the owner has to have surgery soon. That made me sad, I hope the owner can keep this business running afloat; it would be a shame to see this restaurant go out of business. Support small business owners! Come here and try all the delicious food. I will be coming back as often as I​ can and will bring visitors here as well. Next time I'll try their vegan burrito and vegan pupusas.", "author": "Cristal F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "Stopped by for an early morning breakfast on Sunday, and while the place was very charming and the staff very nice, my order for two eggs and sausage was very poor; first off it only appeared to be one egg and the sausage was a giant chunk with fat on the bottom so that it was difficult to cut. Tiny portions. Maybe I just came on an off day but cannot recommend at least for breakfast. Very disappointed.", "author": "Danny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "This place is a sweet local favorite for brunch (I almost hesitate to blow their cover but why not share the wealth?!) I take vegan friends here for the papusas and although I'm not vegan. The plantains are not to be missed. Their black beans have flavorful subtlety that should be noted. The staff are super sweet and kind humans. Treat yourself to this little Mission spot soon.", "author": "Carey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Great place for breakfast. Eggs rice beans hot tortillas all good. Loved their pupusa revuelta lots of filling.", "author": "L C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "So I was with my children on the Day of the Dead celebration and by the time we got to the 24th Street Mission drag of the march we were famished.  Surprisingly it wasn't crowded and we took our seats and ordered their famous pupusa platters (thick deep fried handmade tortilla filled with, in our case, spinach.)  It took them a while to take our order and were even glacial in bringing-out the food. But once we started digging into the spinach pupusas we realized that it was well worth the wait.  The black beans were so tasty and salty and my family dipped their pupusas into the salty bean sauce as a sort-of dipping sauce - decadent.  Their curtido salad (lightly fermented cabbage slaw with red chilies and vinegar) felt light and healthy and digestibly spiced nicely.  The pupusas themselves? Tasty and above average but not phenomenal.  The biggest problem I had with the place was the price.  These platters would normally go for much, much cheaper in an authentic hole-in-the-wall central American restaurant in the mission district, probably 1/3 the price if you find a low rent family run operation.  We ordered three pupusa platters with, after looking at their prices on the menu, water... and it still came-out to $45.  We contemplated standing up and leaving because of the value restaurant impression bait-and-switch bit didn't.  The price may not seem so bad by normal standards I guess, but simply by the look of the place you thought good value/good food; looks can be deceiving.  So in a nutshell:  tasty but a semi-ripoff.  If they want excellent marks, and repeat customers, all they need to do is charge 6-something for your platters not 9-something.  But I have to give it to them: they have a lot of vegan options, serving breakfast all day, so props.  Also, the servers were nice.  \n\nThey squeak the third star because of their menu diversity but the restaurant pricing leaves a lot to be desired.  If you are a hole-in-the-wall, even a cute/clean hole-in-the-wall, on 24th Street, you need to price as such.  I can imagine that if we ordered drinks the bill would have been in the $60 range.  Their pricing removes it from the category of \"daily cheap-eat/frequent order\" restaurant like Poncho Villa burrito-like everyday food and places it in the rare special occasion restaurant category.\n\nNote to Management: Pupusas are not supposed to be pricey.", "author": "Khash C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Excellent vegan chorizo burrito! Very cozy spot. Nice artwork on the wall! The prices are very reasonable. Friendly neighborhood and the service was great :) thank you!", "author": "Kristofer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "I just ate their vegan breakfast burrito & thought it was delicious!  Their tortillas are slightly chewy, the soyrizo was tasty & the addition of home fries & avocado to the black bean base was just right. Price was right too!", "author": "M O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "I got the vegan pesto scramble which was pretty good but smaller tofu bites and some bigger veggies Microsoft fed them n would have been nice.  My co-eater got the vegan chorizo burrito was terrific. I almost ordered it but love pesto too, glad we shared!  Both plates seemed a bit sparse looking when served, other non vegan dishes served seemed to be a bit fuller with sides. This isn't to say we didn't get enough food, was totally stuffed.", "author": "Vegan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Sooo good! Came here with my boyfriend for brunch and we got the breakfast burrito and the huevos con chorizo.\n\nPros:\n-Fast service\n-Great coffee!!\n-Cool area\n\nCons:\n-Smaller portion than anticipated, but still a great deal. We both came out full from our meal.\n\nWe would definitely come here again!", "author": "Michiru K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "My go to breakfast when I don't want to go far from home. I love the Huevos Al Gusto - eggs your way :D comes with plantains, beans, rice and tortillas to wrap everything up.", "author": "Joel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "Food was ok. Cute inside. I got a breakfast burrito and side of bacon. Bacon was bomb.", "author": "Gabby O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "I liked this place the moment I walked in. The yellow-colored walls are filled with sunshine. I ordered the veggie burrito. It was really delicious and perfectly sized. They have a variety of Latin-American dishes here.", "author": "Guillermo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "I used to work at the General. That's how I stumbled upon Sunrise. When I first moved up to the Bay, coming to Sunrise reminded me of home cooked meals at my best friend's house in LA (beans, chilaquiles, burritos, plantains, oh my!) I never had a bad experience before today's visit -- and I could not be more bummed about it. First, the food itself tasted fine (we ordered chilaquiles and plantains) ... but it took a tortuous amount of time before our food came. \n\nWe arrived to a short wait (about 3 parties of ahead) and were seated after 15 minutes. We had a game plan (let's share chilaquiles and plantains so we can stop by Philz after) ... but no one came to take our order for over 10 minutes. (We were seated next to the register, so this isn't a \"you're seated in the corner and I will conveniently ignore you situation.\") Ok, that was weird, but I suppose the restaurant is busy. We order. \n\nAnd now the waiting game... I kid you not ... at least 40 minutes passed before we got our food. Now I've been trying to live a more zen life, where I don't do things like, stare at all of the plates leaving the kitchen angrily and anxiously hoping that they're mine -- and I didn't ... for the first 30 minutes. That last 10 minutes (or however long it was), I had run out of resources and boy, was I hungry and anxious to be fed. At the rate that they were serving food today, I really thought that 90% of their kitchen was not functioning. \n\nBut even then, it took forever to get our bill (even though most of the restaurant was gone by then...) and even longer to get our change. No sense of urgency from the staff and no basic customer service provided (\"how was your meal? Everything ok?\"). I can't say that the food is good enough to endure almost an hour of unnecessary, impatient, confused waiting. With so many other options in the Mission (and in SF, in general), I probably won't be back :(. Bummer.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Delish!  Their menu has many American and Latin choices.  They also serve breakfast all day!  Not to mention the prices are very affordable.  They also serve barista style coffee and wine/beer.", "author": "Frisco T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "The food is so yummy and the people are so warm and friendly. The menu has a really great selection and everything I've had is delicious. I eat here all the time and will continue to.  Eating here is a great way to start your day!", "author": "Win A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Went for breakfast. Lots of vegetarian and even vegan options. Ordered papusas. Fast and friendly service. Overall really good! And they open early!", "author": "JV V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "We were a little worried because no one was in there. But we decided to try it anyways. Delicious and friendly! I had Huevos Al Gusto and a side of plantains.  My son had the breakfast burrito.  He loved it!  Homestyle vibes.", "author": "Kristine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Had the lomito plate with a cup o joe.  Large portion, good veggie-Meat ratio, tasty.  Sauce was a lil salty.  Black beans were good, too.  Coffee was freshly brewed.  V happy they threw in some queso fresco.  Nice atmosphere and friendly service.", "author": "Gonzalo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "This place was super cute and small( which makes me feel like a found a diamond in the rough!) they are a Latin based restaurant but we went there because they offer several different vegan options! I got the vegan breakfast burrito and it was AMAZING! San Francisco has some of the best vegan chorizo I've had! My fiancé had the vegan French toast and it was also amazing! They have like one or two more vegan options as well! We also ordered mimosas and they were HUGE!! Everything about this place was awesome! The women that waited on us was so nice and fast and the whole experience was great!", "author": "Kelsey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "If you've got a hankering for home cooked food - but miles away from Momz, Tia or Abuelita - Sun Rise will surely satisfy that craving! Un cafecito con cremita to start your order and you'll be knock, knock, knockin' on heaven's door. Also, their huevos rancheros is the closest I've ever come to Momma's cookin'. It hits the spot EVERYTIME! Dare I mention their vegan burrito? Even if you're not vegan, this burrito will leave your mouth watering for more. \n\nIt always feels like famila when I make my way in here. From the decor on the walls, to the friendly staff, to the panaderia right next door, Sun Rise is most definitely my home away from home!", "author": "Flor K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "This restaurant is amazing, very cozy, good prices and portions. The location is perfect and the staff it's really great", "author": "Ernesto R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "Bad service, not on top off coffee runs or refill water, food is not great way better spots in the mission  don't waste your cash real talk... give it 2 stars because I like the carnival pics on the wall...", "author": "Antonio V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "Where can I start?  Oh yeah,  20 fucking minutes to get take our order in?  Are you kidding me?  Tried to get the servers attention  several times,  a someone came by to clean the table next to us and asked for assistance to no avail.  \n\nHad  to walk away from this place hungry due to them serving people who arrived after us and their staff completely  ignoring our table that was next to the window...  Never again for this place,  there is no excuse for lousy ass service in the city.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Absolute favorite place to have breakfast. Really reasonably priced and absolutely delicious and authentic.", "author": "Kassi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Y'all. This place does not advertise as being somewhere you can eat if you are vegan and gluten free, and the online menu doesn't even have the full menu. I got HOOKED UP. Fried Plantains, black beans, veggie corn free papusas made with rice flour, breakfast potatoes, avocado - I was able to order so much, I can't even remember it all. And the price was so affordable. 10/10 would recommend!", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-28", "description": "Seating: Plenty of room. ****\nService: ** ok. Took awhile for food to come for 4 people, no one else in the restaurant, after we were there for about an hour we were offered seconds on coffee.\nSpeed food to table: **\nCorrect Order *****\nPresentation *** Portions were very small\nTaste:  *** fair\nAmbience: ***** Very homey, great paintings.\nCoffee: *** Served from Giant coffee thermos\nPotatoes : **** Pretty good\nOverall Rating ***", "author": "Jj K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Stumbled upon this place and decided to go in because it was full of people. Kinda reminds me of a homier version of a diner. Lots of options, friendly service. Ordered the huevos Mexicana. The cheese and beans are super good, and the eggs were excellent. Tasted a bit of my friend's steak meal, and that was insane! Kinda wish I had ordered it myself. I also got a chicken tamale, and I really liked it. I think I'd go back. Prices are quiet reasonable.", "author": "Jen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "\"Sunrise, Sunrise. Feels like mornin' in your eyes.\" As Norah Jones once stated in her eponymous song, I'm pretty sure she was talking about Sun Rise Restaurant when she harmonized those beautiful words.\n\nI can't think of a better way to wake up when you are craving a delicious Vegan Mexican inspired breakfast. I can't believe I had this place bookmarked for nearly a year before my sweetie and I had the chance to sample the soyrizo-fueled goodness.\n\nThey don't only specialize in south of the border dishes. I had their Vegan French toast on my mind for quite some time since I first browsed their menu online. http://www.yelp.com/biz_photos/sun-rise-restaurant-san-francisco-2?select=EBX4ZIu43NiGocJSaJ-poA#VG81GjehrQ28oFRGfzSSdA I can't remember the last time I had a Vegan French toast in a restaurant. My only experience is with the homemade variety. I have to admit this one is more authentic than my homemade version, if less substantial. I feel I've gotten used to the heavily battered Vegan version, thus I prefer it. (Sidenote: I know I just created myself some work because my girl knows I can make French Toast now) Not saying I wouldn't order this again. Just saying don't come here expecting to get full off this alone. I would like to see them use a thicker bread to make the French Toast.\n\nIn fact, skimpy portions seem to be par for the course here. This tofu scramble looked downright meager. http://www.yelp.com/biz_photos/sun-rise-restaurant-san-francisco-2?select=EBX4ZIu43NiGocJSaJ-poA#HcA_Y3RfmtezxAfHpifJ_w I think I'm used to seeing huge plates served for breakfast/brunch that it's a bit disappointing at first. In the end, after finishing it all, we were quite fulfilled without being stuffed to the brim. I can't hate on a restaurant that is trying to look out for my girlish figure... What I CAN hate on is the flavor. Much more bland than most I've had. It wasn't terrible but if you're gonna choose quality or quantity, you need to choose at least one of them. \n\nI was hesitant to order their full soyrizo plate, believing it was the usual stuff you'll find in TJ's or Whole Foods refrigerator section. We got a side order to go with the scramble. http://www.yelp.com/biz_photos/sun-rise-restaurant-san-francisco-2?select=EBX4ZIu43NiGocJSaJ-poA#eug8ozm5p1p5r-jpilXZdw I'm glad we did because it ended up being the best thing on our table. Nicely spiced and quite homemade looking. I'll certainly opt for the full plate with beans, rice, & salsa next time.\n\nTheir Mr. Espresso coffee is seriously \"wake the heck up\" strong. I'm sensing \"espresso\" isn't just a moniker. I normally drink my coffee black. That wasn't happening with this one. I had to make liberal use of the soy creamer provided. \n\nService was really good except for the fact she couldn't deduce that we are Vegan based on our order. She brought out dairy cream with the coffee. No harm as we asked her and she apologized while bringing the soymilk. I just figured with the amount of hipsters that come through here, she would know by now. Over all, the service was actually really good.\n\nWith a breakfast burrito on their menu, we'll be back to try that as well as the soyrizo plate. If that's as good as I'm thinking, consider this a full 4/5 star review. Until then it's 3.5 for now, but I feel like rounding up today.", "author": "John B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-24", "description": "For some reason I expected the mushroom omelette to be spectacular but unfortunately it wasn't. All I got was below average and no love was put into the food. The plate is overpriced for its bad quality as well. I am not judging the whole menu just because one item was terrible but as far as this plate goes, it's not so far. The restaurant's atmosphere was okay but nothing too interesting. The service was not too bad but it did seem as if it were lacking some organization.", "author": "Yobani G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "First day of school for the kids meant a breakfast date with Daddy! I came for the chilaquiles! I've never had it before.  They did not disappoint! \n\nGreat service and a well known neighborhood spot! My husband knew half of the patrons! \n\nThe orange juice was fresh and the breakfast burrito hubby ordered was pretty tasty! We will be back to try other items!", "author": "Candy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "I love their breakfast burritos, but do I wish they had more? Yes! The pupusa's are also great.", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "One of my go-to spots when I don't want to wait in long lines for brunch! \n\nThe pupusas here are my favorite non-pizza way to satisfy my pizza cravings. Although I suppose you can make the argument that they are akin to an ancient Mayan pizza (move over, Naples!). Basically, pupusas are a thick and crispy pan-fried masa tortilla stuffed with meat/cheese/veggies. I'm a huge fan of the loroco (a slightly bitter-tasting flower) + cheese as well as the revuelta (mixed) pupusas. Definitely order 2-4 of these as a side dish to share.\n\nI usually don't order vegan at restaurants but their soyrizo is actually quite good. The odd thing is that they serve the vegan breakfast burrito on a huge plate with just a side of salsa. Really makes the burrito look smaller than it is and they definitely waste a lot of precious plate real-estate. Wish they would also serve some side salad or avocados with their burritos!\n\nIt's usually easy to get a table for 4 on weekends without much wait, but you end up losing that gain due to their slow service/long cooking time.", "author": "Arushi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Delicious vegan American and Latin American breakfast treats. Probably have come here a dozen times now. You can't go wrong with anything on the menu. When I'm feeling extra hungry, or I have a friend who likes to share, I get the vegan chorizo scramble with a side of plantains and avocado, a side of vegan French toast, and a pupupusa to round it all out.  The ambiance is simple and cozy. Coffee and chia juices are delicious. Love their service and the fact that you can stay for as little or  as long as you want.", "author": "Danielle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "I would give this a 3.75 if I could.  The only thing keeping me from giving 4 stars is because the place is small, decor is not great and could be done so much cuter.  However, the food was very good.  But I try to reserve my 4's for places that really, really impress me.  I was definitely impressed - but not wowed.  : ) We went for breakfast on New Year's Day.  We had to wait about 20 min to be seated (3 of us).  Service was good - bringing food out however, was a little slow.  With all that said, here's what we ordered:\n\n1. Huevos Rancheros - this dish came with black beans, queso fresco (would have liked a slightly larger piece) and steamed tortillas on the side.  The slightly fried tortilla that came under the eggs was probably one of my favorite parts of the meal.  It was slightly fried, not soggy at all and gave the dish a really nice flavor and texture.  l also liked the fresh and pleasingly light sauce and cheese that they placed on top of the eggs.  It wasn't too tomatoey - which I liked.  Sometimes when I've ordered at other places it tastes like they poured a can of diced tomatoes on top - but not here.  Sauce was nice and had good flavor.  We also ordered a side of fried plantains which went really well with this dish - so - go for it!\n\n2.  Chilaquiles - had a bite of my daughter's meal and I have to say..it .tasted WAY better than it looked.  Yummy chorizo flavor and overall just really tasty.  She ordered a side of avocado and fried bananas and seemed to enjoy this addition to the meal.\n\n3.  Horchata - we all got the horchata to drink.  It was good, nice and cold from the ice.  A little sweeter and less \"spicy\" than most horchatas but good.  Spicy isn't really the word I'm looking for but those who drink horchata probably know what I'm trying to get at.  We had coffee too - which was fine.\n\nWould definitely come back for either of these breakfast meals and everyone who worked there was very nice and accommodating.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "This place is close to my apartment and it's great! \nThe authentic Mexican dishes are fresh and healthy and the service is great! \nThe prices are also very reasonable, so I go here multiple times every week.\nI would love to see some more dessert options though aside from just the Salvadorian cake and the sweet corn and milk drink that they have.", "author": "Sahil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Sunrise is BY FAR one of my favorite places to eat. It's cozy, the service is AMAZING and the food is so.ridiculously.good!!!! Mmmm mmm Mmm!! So grateful for the vegan options!", "author": "Victoria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "At long last, a restaurant in SF that understands that tofu scrambles need fat, too. And salt. Give me hypertension, or give me death. \n\nFor my boyfriend specifically (and others like him), they have chicken dishes to order at 8am and also, inexplicably, keep wood in the back of the joint. These are his two primary interests (i.e., chicken dishes, wood) so needless to say, we won't be leaving for a long time (hence the reason that I am writing this Yelp review now, still seated at the table as he considers woodworking projects).\n\nAlso, I didn't need to sell my firstborn to get a reso and/or pay the bill; that's a rare plus, too (I have sold a lot of firstborns from dining in this town, is what I am saying).", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "I loved the pupusas and chicken tamale, really very fresh and authentic mexican flavor, I was nicely surprised!! Coffee muy bueno too!! \n\nI would highly recommemd it and will love to come back in another visit to SF ;)", "author": "Claudia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "The family had breakfast at the Sunrise Restaurant and it was great. Service was friendly food portions were just right and very well done. Atmosphere was fine for a small family restaurant. No complaints", "author": "Ted B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Have you ever believed you would like a restaurant before you even try it? This was the case for Sunrise. It did not disappoint. \n\nEverything is on point. As a vegetarian, there's many tasty veggie options. The tofu pesto scramble is very good! I think Los Panchos in bernal heights has the best papusas. The papusa here is okay. \n\nThe service is great and the ladies are sweet. I can't believe people complain about the decor. What do you expect on 24th st?! People are seriously first world. I think the decor is adorable and takes me to another place not in Mission, in San Francisco. \n\nTry it out. Really good", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-10", "description": "I may not be giving this place a fair rating since I just went in randomly for lunch and just got a simple set of pupusas - bean and cheese and spinach. They were hearty, greasy, and delicious and came with a side of cabbage slaw. Love the home made quality of the food. \n\nThumbs up for the vegan menu items. Still, I can't echo the enthusiasm everyone else has for this place. Definitely good, but not great.", "author": "Clare B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Literally one of my favorite restaurants. I've had nothing but good experiences and I love the area. I originally came here because Yelp helped me find vegan French toast. Turns out they also have vegan breakfast burritos, vegan tamales and vegan pupusas. I've brought a few people to eat here, all of which were non vegans, and everyone loved their food. It's a little under the radar but I enjoy the low key vibe and the friendly service. I very much recommend trying it out.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Good vegan options, decently priced, and reasonable sized portions. These three things made me very happy when I took my visiting friends here for breakfast. It's not easy to find good vegan breakfast options in SF, let alone on a weekday. But Sunrise had fresh, well-seasoned dishes that we all enjoyed. And better yet, we all felt like we had the perfect amount of food.\n\nI'm excited to come back here and try out some of their other options.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-28", "description": "Decent place. Not outstanding. Liked that it had vegan choices on the menu and still was Latin American. \n\nI've never seen vegan pupusas before and they were quite good. I usually don't order pupusas anymore because of all the cheese so was happy to see a vegan version. \n\nMy husband's tofu scramble (also vegan) was pretty standard. But again, nice to have that choice on the menu. \n\nPortions are a bit small for the price. But this is the Mission after all.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "When it comes to eating out, I am an extremely harsh critic. I love to cook and often feel like I can make things better at home. But not this time. \n\nSun Rise is my new favorite hearty breakfast spot! Huevos con chorizo y platanos were delicious! Everything was perfect including the friendly and fast service. Salsa music plays in the background at just the right volume and the golden walls are warmly lit by the sun. Will definitely be back with friends in tow.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-14", "description": "Good food! Cheap food! \n\nYes, this place is a great find. Especially since they serve their mimosas in a big water glass and not in your typical flute glass. I have to say for $6 bucks, I scored big with this one item alone! I ordered the Huevos Revueltos con Jamon which came with hand made tortillas. Gotta love that it's hand made. We also got plantains which you can never go wrong with and my friend had vegetarian tamale which was really delicious. \n\nThe place is a bit small so be prepared because when we went it was busy. They had nice decorations and a purple christmas tree which i loved. The service could pick up a bit especially since the place is small so two servers should be good. We had to ask for water and cream but the ladies were friendly.", "author": "Zara-Maria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "Everyone was really friendly and the food was great. The eggs Benedict, pancake combo and French toast were all very good. \nThe sunrise eggs were good but it has way too much spinach.\nThe breakfast burrito was probably my favorite. \nDefinitely get the papusas! The pork ones were very good. \n\nIt's a nice atmosphere but it was a little slow and you can only split the bill with 2 cards. Great Sunday funday brunch place where you don't have to wait for a table.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "Love this place, best huevos rancheros in the Mission hands down, and I love how this place is run by women. You can taste the love and care in every bite.  \nThe prices are great,  the music unobtrusive and the walls are decorated in an interesting assortment of art pieces. They don't skimp you on the mimosa either, each one is served in a pint! Brunch lovers dream almost any day of the week all day long. \n\nThey also have great pupusas!", "author": "Caitlin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "Breakfast was totally on point .Came in today on a busy Sunday morning to give this place a try.\n\nThe service was pretty slow since there understaffed, which my friend and I waited for 15 minutes for our food to arrived. \n\nI ordered the eggs benedict with home fries and two slices of oranges and apple, which it's a pretty good portion size but man, it got me full after eating the whole plate.Cooked to perfection that will make my stomach full.\n\nDespite the long wait, this is a go to place for breakfast and brunch on a good price.", "author": "Cindy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "If you're in the Mission, you MUST try this place. After one visit, I am incredibly enamored with everything about it.\n\nI tried the vegan zucchini pupusa and a side of plantains. They were both incredible! The plantains were so so SO yummy! I could have chowed down on at least one or two more sides of these sweet babies, but I showed some will power and stopped myself. \n\nI also brought home a breakfast burrito for a loved one and was able to sample some of it. The spicy salsa was excellent, and the burrito is a pretty large sucker for only $6.50. I imagine that this burrito could only be enhanced by a cold beer on the side, but I have to work tomorrow morning, so drinking is not an option tonight. \n\nI'm so incredibly grateful that they have plenty of vegan options that are clearly marked as such. Yay, Sun Rise! You're doing it right. \n\nThe lady working tonight was so lovely and sweet. She seemed a little quiet and/or shy. Perhaps I should have broken out what little Spanish I know, just to break the ice. Would that make things more awkward? I never know what the proper etiquette is. \n\nIt's also SO affordable. We ordered a bunch of snacks and the bill was just over $20. Very reasonable! \n\nI'm tempted to return sometime this weekend to try their breakfast items, like vegan French toast. Sounds fan-freaking-tastic!", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "Service was terrible, chilequiles were soggy and bland, sour cream had turned, and they screwed up our order. I have no idea how this place is so highly rated.", "author": "Carla C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "One time I found a screw in my food and never came back after that. Luckily I noticed it before I had taken a bite!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "This is where I go for a solid breakfast. The huevos al gusto is both hearty and moderately priced. The women who work here are always friendly and hard-working.", "author": "Jolly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Best vegan soyrizo I've ever had! Way better than St. Francis down the street. I also ordered the vegan papusa and it was amazing. Super authentic, tasty, fresh food. It's so nice they have vegan options. I lived in the neighborhood for 6 years and walked by this place a million times but never ate here until today. I will definitely b back.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-21", "description": "It's a cozy family restaurant. We were there for brunch we were concerned about the noisy crowd (see pic) in it. The noise was overwhelming! A few customers also seemed annoyed, but no one said anything. A huge relief came when the crowd left the restaurant. In general, the food was okay. It's easy to tell from the portion and menu that the restaurant caters to a specific kind of clientele. But the close proximity between customers makes any loud noise unbearable...If it is going to be that kind of noisy crowd, I won't eat there.", "author": "K T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-27", "description": "Came in for a quick bite to eat.   I ordered an egg dish and a flat rice tortilla.  I waited 40 minutes  for the egg dish which I couldn't find because the dish had a bunch of soggy chips covering a dollop of meat and sauce.  The rice paddy was charred on the bottom, and had that carcinogenic burnt taste. The meat filling again was measly in portion.\n\nAFTER the long wait I was disappointed at the food, but the service was a joke.  I asked for water and was never served.  How cheap is that.\nOne of the worst dining experiences I've had ever.", "author": "Tiki D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "This place is small, but does have quite a bit of tables inside and 2 tables on the outside. I came here on a Saturday morning at around 11am and it was full! But only waited about 5 min for a seat! \n\nMy friend and i ordered:\n\nPapusas (one spinach, one zucchini) with cheese: BOMB! I love the cabbage slaw it comes with and the tomato salsa!!! So light and refreshing!\n\nChilaquiles: It was pretty good, but still doesnt compare to the chilaquiles I've had in Mexico! This one was more chippy, the chips were crunchy. Lots of sauce. Chorizo and egg was too crumbled. Felt like I was eating soggy chips and salsa but the taste was very good. Still better than any other restaurant I have had chilaquiles in the States!\n\nBreakfast platter with beans, avocado, eggs, and fresh tortilla. SO GOOD!", "author": "Annie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "We tried this place for breakfast.  The restaurant was nearly empty so we were seated immediately by a very nice server.\nMy partner had a ham omelet with hash browns and cranberry juice while I had chorizo scrambled with eggs and black beans.  My dish came with three small corn tortillas and little containers of salsa and sour cream.  There was also a slice of nice queso on my plate.\nI liked my meal very much.  The chorizo was not oily and very tasty.  The black beans, tortillas and queso were fine.\nMy partner said his meal was okay but nothing special.\nOne small disappointment - I wanted decaf coffee but all they had was decaf expresso.  So I had a glass of milk.\nThe food is pretty good, the service was excellent and the restaurant was clean and comfortable.  We might try this place for lunch or dinner.", "author": "Philip C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Amazing food. First time having vegan French toast after 7 years of being vegan. The vegan breakfast burrito was by far my favorite item on the menu. Best soy chorizo I've had anywhere! The service is very friendly and the atmosphere is casual. We came towards the end of brunch on Sunday around 2pm and it wasn't too busy although I've heard it is earlier in the day. Good for smaller groups 2-4 ppl.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "So so so delicious and an amazing value!\n\nThe revueltas pupusas are perfect with the cabbage slaw and spicy red sauce, and the platanos with black beans and crema were the perfect side for it.\n\nCan't wait to go back.", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "It was warmer outside than it was in my dark Victorian bedroom, but it was so cold in the latter that, on trying to wake and start my day, I instead burrowed back into bed and turned on the electric blanket, fearing the chill of the unwarmed bra, wondering if I could fashion a tracksuit from the blanket itself. \n\nThus ensconced, I spent hours tweeting across time zones about a short-lived British show called Sex Box, in which a hapless couple does it in a sealed box on a sound stage while a team of sex pundits discusses their relationship before they emerge, satiated or not, to be quizzed about their intimate feelings about their intimate feelings, the idea being they'll be primed toward honesty and insight by their temporal proximity to carnality. Apparently it flopped. Apparently a version is coming stateside anyway. \n\nThe takes & jokes & quips tapered off, and I realized I hadn't eaten. An image sprang forth in my mind, so vivid I could have practically snatched it out of the air and tucked into it with an ethereal knife and fork and been corporally fed with real caloric sustenance. \n\nI threw on an array of clothes from the cleanish pile near the laundry hamper and hustled myself over to Sun Rise Café, a treasure I hope remains untouched for as long as I am ambulatory and sentient in San Francisco. \n\nI took a seat at the window. The sun came through the window and lit my copy of Harper's. The waitress remembered me although it had been several months since I met a series of first dates here for brunch on an OkCupid spree. \n\nAfter a cursory glance at the menu, I ordered the Sun Rise Eggs, which after a short enough time emerged from the kitchen on a winged platter borne by a cloud emitting internal, gold-blue light. \n\nSun Rise Eggs are the house take on eggs Benedict, the English muffin topped with bacon, spinach, avocado and a poached egg. The egg, my God. It's as if they carefully scooped a slotted spoon into a classic cookbook and retrieved the poached egg attempted by students for centuries, and placed it upon the aforementioned delectations arrayed atop the English muffin. Perfect in form, exploding from the fork's touch onto the tower of luscious food, the egg beheld itself, and it was good. \n\nSun Rise's house potatoes are similarly the pinnacle of house potatoes, each bite-sized chunk perfectly crisp, but not dark, seasoned just so, and as fluffy inside as a mashed angel. \n\nI ordered a side of black beans to dip the potatoes into. This was my wisest choice in decades. \n\nThe coffee is fine. The walls are cheery. Everything in the world is more sublime now that my belly is full of Sun Rise Eggs. \n\nFour stars, because 2 slices of apple and a wedge of orange is hardly \"served with fruit,\" and the waitress, though otherwise excellent, does not visit the table to ask if everything is all right.", "author": "Tarin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "The food is delicious, affordable and the music and atmosphere is authentic Mexican. They offer Vegan options and the waitress is nice. Food came out quickly.", "author": "Margaret P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "My husband and I have been going for 5 years and it's our \"go to\" breakfast joint! The food is delicious. My son loves their beans. The service is great too. Five stars for sure. I'm happy to know it's also a Family owned business", "author": "Gloria N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Went for breakfast here after looking at some of the trendy well reviewed offerings in the neighborhood. Happy I made the visit. Coffee was strong and delicious. Vegan food was fast and yummy.  Server was sweet. Place was quiet. Hipsters should take their heads out of their truffle infused butts to check this local spot out.", "author": "Vittorio A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Really tasty food - everything delicious  but especially breakfast, platanos frijoles & cream, and of course pupusas. Good value. Sweet owner that supports community, neighborhood artists & social justice movements. Good longtime community place to spend money if you're gonna go out to eat on 24th. They are a small place so if they're busy and you're in a big hurry maybe not the best time to come, although once my boo needed to get to work & we told them & they were awesome about speeding things up. Overall highly recommended.", "author": "Carrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "Sun Rise is the best. The women that work there are so nice and honestly are one of the main reasons I go. I just moved to LA and I am sad that I don't have Sun Rise anymore :(", "author": "Allie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "Cheap brunch place in the Mission, but really nothing that special. You can get an eggs Benedict for $10 where other places might charge like $13/14, but everything is pretty standard.  I got the sun rise eggs, which include poached eggs, spinach, avocado, and bacon on an English muffin. Plus potatoes and like 2 slices of fruit. I wasn't blown away by any means and the portion of bacon/spinach was kind of sparse, but it satisfied. The poached eggs were done very well, too - perfectly round and runny. \n\nSo basically, food is cheap but portions can be smaller than usual, but it offers many different, non-standard brunch options (I just didn't try them). The store itself is quite small and pretty stuffy, but with character. Oh, and an unrelated tip: check out the little bakery next to this place for an after-brunch dessert - 65c pastries of all types that are baked fresh in the mornings!", "author": "Cissy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "This is my favorite spot in the whole Bay Area for vegan breakfast. I recommended the pupusas, always. They're amazing. Order your hash browns extra crispy. And the soyrizo is AMAZING. Yay everything!", "author": "Anna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "First off I just want to thank Yelp for existing because if it weren't for Yelp I wouldn't have had such a wonderful experience here. \n\nI am from LA and was visiting family in San Francisco. On our last day we wanted to have a good breakfast for our long journey home. Being Salvadorian my parents wanted to have the typical Hispanic breakfast eggs, beans, cheese, and all that good stuff. Thank god I was able to find Sun Rise on Yelp. \n\nTheir place was small, nice and cozy. Their service was a bit slow but then again it was a Sunday morning and only one waiter. But from the beginning the service was excellent. The waiter being Hispanic herself and most of the people eating there were white she made my parents and family members feel comfortable by speaking Spanish to them. \n\nAll of us were satisfied with our meals. I ordered huevos con chorizo and a side of platanos and it was delicious!!  My mom ordered a mushroom omelet which was also very good. We also ordered a quesadilla, a salvadorian sweet bread which had a different taste to it then a typical quesadilla but was still really good. \n\nOverall my family and I enjoyed our meal and I would highly recommend this place to anyone looking for an authentic central American meal!", "author": "Nidia E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "Came here for dinner on a Sunday night, we were the only people!! But we were pretty determined to get breakfast food that night so we tried it anyway. We're not quitters. Chilaquiles was delicious! Never had anything remotely like it :) but even tho we were the only table in the restaurant, our server took a while to come take our order (probably forgot about us), and our food took a while.. I do recommend the food tho!", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Food is wonderful, service is excellent. I have taken so many friends there because I know they will love the food. Prices are great and portions are large.\nGuadalupe Amador", "author": "Gusdalupe A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Great place for those generous Latin platos that you crave. \n\nFound Sun Rise on Yelp, around the corner from my boyfriend's. No food in the house and I was starving and needed to have a good meal before I headed out for a four-hour training (no lunch break).  I'm vegan-ish and was pleasantly surprised to see that the menu has vegan options. \n\nI had the Vegan Chorizo plato - soy chorizo, beans, rice, nice warm corn tortillas, and salsa. It was simple, delicious, and generously portioned for under $10. It was more than I would normally eat but I chowed it down and kept me fueled from 10:30 am until dinner! \n\nService was prompt and friendly. Plain but cozy decor. Neither crowded nor empty. Food came out in a timely manner. I would come again, perhaps with the boy or friends.", "author": "Jung F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "What a great find! \n\nWe were visiting SF and as a vegan, I'm always looking out for great vegan/vegetarian spots to eat. Not only did finding this place give me some exposure to the very awesome Mission area, I also got to eat some truly delicious food.\n\nThere is a very authentic feel about this place and our waitress was lovely, informative and although there may have been a slight language barrier; we got everything delivered to us beautifully.\n\nThe food was delicious and reminiscent of something you'd find in a regular Mexican household. I had the vegan burrito and it was full of flavour and spices - unlike anything I'd eaten before.\n\nDefinitely worth checking out if you're in the area.", "author": "Evan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "My girl and I breakfasted here for it's vegan options.  She'd heard about the vegan French toast in particular.\nWe each ordered a mocha with a shot of espresso and it was made to perfection.  Never had a better mocha.  She was all about it at first but said it was too sweet later.\nFor eats we got the French Toast and the breakfast burrito (both vegan).\nThe french toast wasn't the best *looking* french toast in the world but tasted as good as any I've ever had.  Served with little bits of bananas, clementines, apples and strawberries not to mention some quality syrup.  Brown sugar at the table too!\nThe breakfast burrito was stupendous.  I never had soyrizo before but this was better than any chorizo I had before my conversion.  Just the right mix of flavors, avocados black beans etc.  Nice salsa too.\n\nBeyond that it's a nicely put together place and not busy at all for lunch on a weekday.\nWill certainly return, many times.", "author": "Milo I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "Found this little restaurant after a rough night and a subsequent search for some mazda wheels the next morning caused by a run in with a curb...\n\nThis place turned out to be a pleasant surprise and I've been back several times since then!\n\nGreat food and great ambiance.  There's all sorts of nifty paintings and sculptures and stuff on the walls and the restaurant has a great airy feel.  Makes me feel like I'm eating in South America.\n\nHeuvos Al Gusto.  2 eggs, rice and beans, and some fried plantains.  Simple but delicious.\n\nPupusas are delicious as well, stuffed full of cheese.   You ever see on TV when someone pulls a slice of pizza up and all the cheese forms strings? Yeah same thing here.\n\nIf you're in the mission and aren't in the mood for mexican, this is the place to go.", "author": "Tu T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "I love this place because its never crowded and the service and food are excellent. I always get the Huevos Rancheros and its no surprise that the cook knocks it out of the park. These are really nice people that serve great food with no attitude.  \n\nTOP SECRET TIP. The burritos are huge, delicious and the least expensive breakfast item.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-30", "description": "Five stars for the vegan French toast...three for my husband's unimpressive meal.  The vegan French toast was so incredible I actually had to make sure it was vegan!  So grateful for the many vegan options and nice service.  Sorry the picture posted I already ate the yummy fresh fruit off the top of the French toast.", "author": "Vivienne V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Living in NY by way of Texas, I don't often get to enjoy chorizo and black beans and homemade tortillas, which made this quite the treat! Get the soyrizo - even if you're not a vegan, it's delicious! Can't wait to visit SF again and have breakfast here!", "author": "Sydney K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-01", "description": "Sun Rise has fallen far from it's former glory. They used to be excellently-priced Mexican/American fare with ok coffee and decent food. \n\nWe had some funky orders (substitutions, vegetarian, nothing super complicated) and it just looked like the cook was having a really bad day. The one with substitutions came out in a pile, and the vegetarian eggs benedict was covered in bacon. Our friend asked for a new one, and they simply removed the bacon. \n\nThe good: it is cheap, this is true.\nThe bad: food is meh.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "The muy authentico Central American B-Fast!  \n\nBeans,...perfect.  Hot, fresh tortillas? Yes please. One of the best chicken tamales I've ever had. Oh, those tamales are only $2.50!\n\nMy girl had ye olde huevos rancheros and the eggs were cooked perfectly. \n\nI would definitely come back here for my farmer cheese, eggs with ham and black bean fix anytime.  Just like my fantasy Honduran Mom down south makes.", "author": "Dusty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "Cutely designed! And the food is super amazing! Very homey, and the staffs are such gems from South America - they serve you with their hearts and smiles.", "author": "Yany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "WOWOOWOWOWOWIWOW!!! Was looking for a quick breakfast and I stumbled onto s treasure. Affordable, authentic as hell and delicious. Great service and nice place, reminds me of the Yucatan peninsula. Check this place out, do not miss!", "author": "Alma A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "The lady serving the restaurant is seriously so sweet. She has one of those genuinely happy & caring demeanors that reminds you of your favorite grandma and just makes you want to hug her.\n\nThat and an entire meal for $11 including tax/tip! This was with half the table getting beers too - we just split it evenly so I probably even overpaid a little.\n\nI tried:\n\n* Pork & cheese and spinach & cheese pupusas (corn) - 4 stars\nTheir pupusas overall are good! Both sides have a nice crisp to it, burnt just barely enough to get that slight browning without going overboard. There is a decent amount of filling - and the pork was pretty good. I'm not sure if I tasted the spinach (though later I asked for beans in there as well and she may have thought I wanted to replace spinach with beans).\n\n* Huevo con chorizo - 4 stars\nPretty dang good as well. I like that all their brunch options are available at dinner! The beans were a tiny tiny bit starchy, but overall really delicious.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-30", "description": "Given the slow service and weak food, I was pretty surprised Sun Rise had such a high rating. Two simple dishes, poached eggs and a salad, took over 30 minutes. Then the salad had a hair in it, and the poached eggs were well overcooked. I don't plan on coming back.", "author": "Ben W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "Sun Rise is another denizen of 24th Street that favorably contributes to the seemingly endless array of dining options in the area.\n\nAlthough I am usually not a fan of sweet & salty meals (Hawaiian pizza and pineapple fried rice come to mind), Sun Rise's Huevos Al Gusto with plantains has begun to gnaw on my stance.  \n\nThe Al Gusto's plantains are perfectly cooked, tender to the bite and not mushy from overripeness  - each of the 3 pieces lends a natural, sticky sweetness that does not overpower the other flavors.  The over easy eggs are solid enough to be transported into a fresh tortilla, where it can then be broken for the yolk to trickle throughout the self-made taco; the slab of crumbly homemade cheese is subtly yet powerfully salty; the plentiful black bean & rice mixture provides a gluing foundation that holds the other fillings together; and the slightly spicy salsa only enhances its companion ingredients.\n\nBe sure to pack each tortilla to capacity, since the filling to tortilla ratio is overwhelmingly in favor of the fillings.  Paired with a refreshing, simple iced coffee, the Al Gusto makes for a rather satisfying lunch.\n\nNote: Minimum charge of $10 to use credit cards\n\nWill be back for more!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-28", "description": "This place gets the job done, no complaints.  Prices are cheap, and the food is pretty good.  \n\nThe typical breakfast stuff (eggs, toast, bacon) is standard diner quality...nothing to write home about, but fills you up nicely.  However, their Latin dishes are more flavorful and interesting.", "author": "Heidi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Frickin' delicious breakfast. I had huevos al gusto. How to they pack all that flavor into rice and beans? Insane. Good coffee too.", "author": "Arthur G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Good for breakfast and portion size hits the spot, enough to hold me until around 1, 2pm.  Their breakfast burrito was delicious and recommend others to try their other Latin dishes.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "This place is yummy for your tummy! Very nice and smiley staff. Food is amazing. I usually get the breakfast burrito and for the price, its fantastic. Great way to start any part of your day.\n\n The cheese and zucchini pupusa  is amazingly refreshing. Yea that's right, its refreshing. Something about it when you put the moist cheesy hand made corn tortilla in your mouth that it just slips around on your tongue and when you chew it, a burst of soft cheese flavor explodes your taste buds. When your ready to swallow after all the excitement, you get this freshness feeling down your throat to your stomach. You WILL say, \"mmmm\".  I recommend the pupusa, with or without the zucchini.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "I went with two of my friends last night for dinner around 7pm. There was one other person dining when we arrived, otherwise it was super quiet for a Saturday night. We asked to have some music turned on and our server put on some tunes and then came over and walked us through some recommendations. She was super sweet, genuine, and made us feel at home. I ordered a couple of papusas and fried plantains and my friends got the típicos salvadoreños, which was pictured on the front of the menu. The food really hit the spot and I would absolutely go again. It's not hip, but I'd rather eat something delicious in a place that feels comfy and homey than somewhere modern where they miss the mark on food.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Get the huevos al gusto (which is gluten-free) if you like eating eggs, or they have a bunch of vegan choices if you don't. \n\nStick with the Salvadoran food selections! \n\nThe maize/corn pupusas here are gluten free too (unlike many other places in The Mission that add wheat flour to the corn mixture) and include flavors zucchini, loroco, bean, spinach, various meat options and any of which can come with beans or cheese inside.\n\nThe food is always good and easy to spend $10 or less on a decent meal.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "Came to this place to try out the vegan fare.  They had a surprising number of options, Vegan French Toast, Vegan Breakfast Burrito, vegan soy chorizo, vegan pupusas, and perhaps 1 or 2 others.  I ordered the Vegan French Toast, and spinach vegan pupusas.  They weren't necessarily bad, but I definitely wouldn't say they were good either.  Everything tasted quite bland.\n\nI actually live 2 blocks from this place, and even with that convenience, I don't think I'd come again unless I really need to.  I'd rather walk about 7-8 blocks to the Herbivore grill (which interestingly has a lower rating).  Mission Pie is nearby for some great vegan fare too.  There are just better vegan options in the Mission.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Sunrise has an awesome breakfast at a great price. Would highly recommend the breakfast burrito - there was a plethora of bacon inside!", "author": "Abby B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-23", "description": "Despite the slow pace of service I appreciate that Sunrise has so many vegan options.  I have been a few times and have come to love the breakfast burrito.  It is filling and stuffed with vegan soyrizo and potatoes.  The vegan spinach pupusa is good and it is fun (as a vegan) to enjoy a culturally specific, Salvadorean, dish.  \n\nI only gave 3 stars due to the chronically slow service and low quality sides.  I have been unimpressed with the home fries and hashbrowns, and the tofu dishes leave a lot to be desired.  \n\nThe price is a good value for the amount of food you get and I will continue to go when I have some extra time to wait for the check.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "Solid place, but since we didn't try any off the vegan options that everyone's raving about, maybe we missed their specialty... The food was pretty decent (spinach omelette and breakfast burrito), and the coffee was ok. Nice little place, but by the sounds of the other reviews I think I'd probably try the veggie / vegan options next time...", "author": "Kiera S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "I usually run in here for takeout Pupusas and Tamales. If you call ahead, it usually only takes them 15 minutes to cook and it's good snack on the way to the 24th Street BART. \n\nThe Mixed  Pupusa (Beans, Cheese and Pork) is by far my favorite, the Pork Pupusa is fairly dry in my experience. The tamale was good, but be prepared for a lot of oil. My advice is to ask for a handful of napkins, they won't put any in the bag . The prices are what you'd expect in the Mission. \n\nI plan on coming back for a sit down breakfast in the future. Sun Rise seems pretty full on the weekend for breakfast which seems like a sign of good things.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "I have stumbled upon this cute little neighborhood restaurant and now have eaten here a few times. The lady, presumably the owner, always greets me with a smile. She is the sunshine of the place.\n\nOn the few occasions I have Huevos Al Gusto, fried eggs over hard and scrambled. The sumptuous breakfast comes with choice of avocado or plantain, and I opted the latter. The beans and rice are cooked together to a stew of perfect flavor. I also like the three corn tortillas that come steamy hot in foil.\n\nThe restaurant is very clean and tranquil. Pieces of arts decorate the yellow wall. Breakfast with bottomless coffee $10. I'll be back for sure--to try other Latin-style breakfast plates and the pupusas.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Vegan Popusa  are very delicious and vegan chorizo , vegan French toast are amazing !!!!!!!!!!!", "author": "Juan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Don't know where the family is actually from, but the entire breakfast experience reminded me of Guatemala and I loved it! The lady was so nice and patient as I tried to communicate and have a conversation with her in my horribly broken Spanish. and the food was great. homemade, and hit the spot. Definitely a place to frequent.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "I feel deceived by yelp. I have no idea how this place got 4 stars.\n\nCame here w 2 girlfriends before a bread making class at La Victoria on a Sunday late morning. Did not get greeted even the waitress saw us. Took a long time to get seated, get our drinks and orders. On top of the bad service. The food was mediocre. I had the spinach scramble which was indicated as a new menu item. The portion was puny, the presentation unappetizing (the eggs in the scramble looked hella \"grainy\") and the hash browns slimy. Plus the menu said it comes w home fries, not hash browns. My girlfriends' one lets looked much more appetizing but they said the taste was mediocre too. Maybe we should've stuck w the Latino themed dishes.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-12", "description": "My dinner was awful!! Bad chicken, in-ripe tomatoes, terrible white rice (was expecting some good authentic Hispanic rice). Will not be going back.", "author": "Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Lovely chefs, delightful clean space and really, really good Mexican food. You cannot go wrong here people. Many vegan choices, they really cater to the customer.\nMy buddy had the chiliquiles and I had the spinach scramble, both delicious. Just right portions and a sweet staff.\nWe'll be back.,", "author": "Natasha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Wow this place is so delicious, I wish they had a location closer to home. Amazing food - great quality, VERY fresh, and they don't douse their food with oil (because they don't need to, with all the natural flavors from the spices they use). We were so pleased with the vegan options!! It's hard to find decent vegan options (that actually taste good), but Sunrise did not disappoint! The vegan breakfast burrito is so good, I'm still thinking about it. Also, it is VERY authentic latin food, so even non vegans will be pleased, I'm sure. One last thing-- some people mentioned that the prices are high.... I completely disagree. I feel that they are fair for the quality of the food you get. We got 2 meals, 2 sides, 3 beverages for about $40.", "author": "Lexi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "This has become my favorite breakfast burrito in the city. It's kinda phenomenal!  Eggs, fried potatoe, cheese and either bacon or chorizo. The chorizo isn't the greasy ground up stuff fom most places, it's a large sausage split in two and perfectly fried. That said, there's still a bit of grease - go for bacon if you wanna stay on the drier side. \n\nOtherwise, aide from the burrito, I go for the plantains, the mimosa, and the warm atmosphere.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "One of my favorite spots on 24 st. I am a fan of any business that supports social justice causes and this place is amazing!Also the food is great!! Tamales and pupusas are under $10!", "author": "Adriana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Amazing amazing brunch! Had amazing eggs Benedict with salmon and Plantains. I defiantly recommend", "author": "Mitch A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Keep going back and finding the same great food. Really enjoy this place, has good Latin and \"America\" breakfast options. I especially love that they have good vegan options. I hope this place continues to be a part of the neighborhood.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "This place is pretty good. Service is friendly but not fast. Food is pretty standard cafe food. I got an omelet which took a little while to get here but was piping hot and fresh. Coffee tasted a bit burnt but was quickly refilled after I finished it.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-07", "description": "You know that scene at the end of Goodfellas when he is living in the suburbs in witness protection and complains that he ordered spaghetti and got egg noodles and ketchup? That is what the chilequiles are like here :( Soggy chips with what seems to be pureed tomato sauce. No flavor at all. \n\nI poked around and took few bites but it was so unappealing that I just gave up and then went to San Jalisco for delicious chilequiles :)\n\nThe pupusa was okay so I am giving them two stars instead of one.", "author": "lisa g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "Great find! Came here with the wife after her graveyard shift and had a quick brunch. Didn't really know what to expect (and didn't know so much about the vegan options until browsing the reviews after our visit), but was surprised nonetheless. Had myself a chorizo scramble. It tasted great, rich flavors, a wonderful, dirty red ripe with flavor. And filling too. My wife had corned beef hash, which was equally crusted with sear. Nom.\n\nThere was something else about this place that was just a little magical. The lady behind the counter was really nice. And even some of the people walking in and out would say \"Good morning.\" In a city where people often go from point A to point B with their horseblinds on or spend 80 plus minutes waiting for the trendiest brunch spots in the city, it's nice to find a quite eatery that's a respite from both.\n\nVegan or not, I look forward to coming back and trying few other things on the menu.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "This hidden gem has authentic central American food with plenty of vegan and vegetarian options with a quaint, non-scene vibe and super-reasonable prices. Food is served by lovely and sweet Latin American women and you hear as much Spanish as English here. It feels like you're in the Mission of 20 years ago. Highly recommended.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Loved it for one big reason: It reminded me of home and mom's saturday/sunday morning breakfasts :)  I got Huevas al Gusto which came with two eggs, rice/black beans (we call this casamiento), plantains or avocado, sour cream, and salsa.  I also ordered a coffee and a chicken tamale.  The food was just like mom's, which I loved. \n\nMy only issue was the service: very, very slow.  Not on the kitchen end but it looked like there really should have been another worker (either taking orders or working on coffee).  Also, the coffee isn't particularly good. \n\nI'm eager to go back and try their pupusas.  Beware tho, they say that their tamales pisques are vegan but usually the masa used to make the tamales has chicken stock in it.", "author": "Banana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "We ordered eggs dutchess , chilaquiles and granola with fruit and yogurt. All three things were yummy :) service is excellent and before I forget try the quesadilla pastry with hot chocolate! Heaven! Total bill $30 so not so expensive.Will be back.", "author": "Rishabh J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "I love the crap out of this place. It's little and tucked under an unassuming sign on 24th St. The only time I've ever managed to make it here is around noon on Saturday or Sunday, post-hangover/pre-drinking. It never fails to deliver. I'm always 100 percent better when I leave than when I arrived. That's not to say I'm 100 percent, but hey, I'm not expecting miracles. \n\nThey have a monster of a breakfast burrito for 5 dollars. Five dollars! And it taste good, too. I almost always opt for the huevos rancheros, though. It cost, like, 7 bucks. Well worth the price. Two people can eat like kings here for less than 20 dollars, and the food is awesome. If you live in the area and you aren't already coming here, there is probably something wrong with your brain. I don't mind though. It makes is easier for me to get a seat when it's packed. Which, at the time of day I've managed to make it here, is always.", "author": "Elias A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "I live too close to this place- The reason why I come back is because of the warmth and home-like feel of this restaurant. From the dining room decor, to the people that work there, and to the food. \nIt feels like I'm in someones home. They make you feel warm and fuzzy. Food is delicious and the options are great.", "author": "Mario M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Opened late for breakfast but food was really good.  Nice menu selection.  Good fresh ingredients.", "author": "Joel V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "REALLY yummy vegan options (we had the spinach pupusa, vegan french toast, and vegan breakfast burrito!), warm atmosphere, + welcoming & friendly service!", "author": "Zo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Love this place! The breakfast is my favorite, especially the huevos al gusto. The rice and beans will melt in your mouth.\n\nWriting an update. I come here now weekly to treat myself to a good, Latin breakfast. The pancakes are some of the best I've had in the city - try the ones with strawberries, they sautee them so the berries are nice and warm! The pupusas are also very good. And you really can't beat any of the breakfast items\n\nGreat assortment of vegetarian and vegan options - plus it's really inexpensive.", "author": "Priscilla M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-12", "description": "I tried this for the first time this week after reading lots of good reviews. I ordered the vegan breakfast burrito and liked it- but wasn't blown away. Perhaps next time I will try the pupusa or plantains. There wasn't much service- our coffee was never refilled, and I had to get up and go ask the server to pour out my cold coffee so I could refill my cup. It's definitely a no frills place but I would definitely give it another try though.", "author": "Sky B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "yum. yum. yum. chilaquiles are super tasty here. tamales, delicious and filling. order these two, and you're set to go!", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "This place is amazing!!!!!!!! Vegan pupusas. So many vegan/vegetarian options and the food is delicious and authentic. Yes yes yes!", "author": "Raquel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Very cleanly prepared food in a home style way.  I like the various egg options along with the white cheese and avocado on the side.  Beans, rice and plantains are good too.  The Papusas are not very good and there are much better places in the neighborhood for those.   Service is \"home style\" too so if you are in a hurry or expecting formality, this isn't the best place.  I find I usually have to get up and go to the counter in order to pay my bill.", "author": "Neal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "On our quest to try new restaurants, this morning we had breakfast at Sun Rise Restaurant. Arriving before 11am, we found a parking spot right in front AND there was no wait for a table. Half an hour later, there was a line out the door!\n\nI had scrambled eggs, pancakes and bacon. One friend had vegan breakfast with \"vegan chorizo,\" and commented that the hot sauce that came with it could have killed her. Our other person had tofu with pesto, and a bagel with cream cheese. This place has something for everyone! Prices are very low and portions are small, so if you want the \"lumberjack breakfast,\" go somewhere else. \n\nOnly two servers, but they were fast enough before the place got too crowded, and the food was quite good. Tables and floor were very clean!\n\nIt was noisy, and there was a football game on the TV.", "author": "Gretchen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "I came here for breakfast and really enjoyed it.  It was about 8am on a Saturday and we had the place to ourselves for the first little bit.  Sooooo nice and tranquil compared to the hustle and bustle of some of the breakfast places in the city.  \n\nI was really impressed by all the vegan options, but was craving a salad (I know, I eat salads for breakfast :oP)  So that's what I got!  \n\nBasic Salad:  was pretty much exactly as described, a nice basic salad.  It came with a TON of walnuts though, about a full cup, YUM.\n\nSide of Platanos, frijoles negros:  A side of plaintains and beans.   This were both very simple and very good.  I mixed the plaintains with the walnuts from my salad.  Sooooo yuuuum.\n\nThe owner?/chef was this really sweet lady.  I ordered a decaf coffee and they didn't have a pot brewed so she brought out an Americano.  I asked for two refills and it was no problem at all and no extra charge.", "author": "Evelyn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "I was out in the Mission with a friend after a rough day.  We had a craving for some breakfast food and stumbled upon this little place.  I had the Sun Rise eggs, and they were absolutely perfectly done.  Hot and nice and gooey on the inside, making that first cut into the egg a really happy experience.  The orange juice was freshly squeezed, and the coffee was pretty decent.  I have no idea where they get their jam, but it was addictive and had me keep eating the toast even when I was full.\n\nThe only thing that was disappointing to me were the sides.  The potatoes were really bland and the fruit was somewhat browned.  My sides were also given in really small portions, compared to the nice big couple of eggs I was given.  It would have been nice to have freshly cut fruit.\n\nOverall, this was a great cheap breakfast place.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "This place is tasty, cheap, fast, and the women who work here are the sweetest!! Come in for some delicious pupusas and friendly faces.", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Officially my favorite place to eat in San Francisco! Although SF is pretty vegan friendly as it is, Sun Rise is a gem to me.  The service was amazing and the servers themselves were so friendly, that it definitely felt more like I was over at a friend's house for lunch, which is something not many places can achieve.  The food was so good, it's ridiculous.  I ordered a vegan breakfast burrito, and it was possibly the greatest thing I've ever had the privilege and blessing to consume.  My friend ordered a vegan tamale, which was just as good! You really can't go wrong with their Menu, there's something for everyone :)", "author": "Angela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Been here a few times with friends and family. The vegan pupusas are off the chain! And they have great, big mimosas for a good price too. I usually get the pupusa plate with rice and beans and the coleslaw (amazing) and it's only $7-$8 and totally fills you up.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "One word: PERFECTION.\n\nMy husband and I were recently in SF and had brunch at Sun Rise one morning.  I had the vegan breakfast burrito with soyrizo and it was easily the best breakfast burrito I have ever had that didn't come out of my own kitchen.  It's insanely cheap at $6.50 for a massive burrito.  I also had a mimosa as big as my head that was also very low priced.  My husband had an egg dish that he also enjoyed.  The space is really casual, warm and inviting and the service could not possibly be friendlier.  If I lived in SF, I would be brunching here at least once a week.  What a little gem of a restaurant.", "author": "Tara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "We went here for breakfast on our way out of San Francisco. We were suprised when we pulled up that they serve vegan food, but gave it a try! Man were we happy we did. \n\nWe order the vegan breakfast burrito, vegan french toast, and a vegan tamale. All 3 were great!! It was pretty cheap too compared to what we had been paying for vegan food all weekend. It was $20 for entire meal, and we both got drinks. The staff was really friendly, and service was quick.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-22", "description": "I found Sun Rise after finding our normal restaurant for pupusas (Santaneca by the BART station) was closed for Wednesdays.  The pupusas here are good and cheap.  Lots of flavor options -- though the revueltas (beans/pork/cheese) proportion was a little off -- most of which were pretty satisfying.\n\nWe did have a few stomach issues afterwards that I'm not sure were attributed to Sun Rise, but until then this is an adequate solution to your Central American cuisine cravings.", "author": "Jeff Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "It was going to be a tough day filled with a massages, Red Bulls, and trip to Monterey.\n\nIt had to start right. So I had the breakfast burrito and Horchata. \n\nVery fast service & friendly. The burrito was filling and delicious. The drink was cool and rehydrating.  Enjoy.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "The nicest staff and a solid breakfast burrito. Exactly what I was looking for after a long night out. Burrito and coffee for $10.", "author": "Anand J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-09", "description": "My husband and I are vegans and we had plaintains, hash browns, pupusas and vegan chorizo. The food was average, but we couldn't enjoy it because of the ambience. Flies over the food and the wait time was long", "author": "Sri S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "The breakfast here is outstanding! We had the huevos al gusto-- poached eggs were perfectly cooked! The loroco & bean pupusa was also delicious.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Hands down THE BEST vegan burrito I've ever had in life! The coffee was on point as well. I'm so glad I found this cute, family owned restaurant. I was there first customer this morning and they treated me so well. What an awesome find! I can't wait to come back.", "author": "Bailey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "A 5 star rating may seem a little overboard for this place, but the reason it deserves 5 stars is because this spot is exactly what I want it to be. I get the Huevos Al Gusto with plantains pretty much every time. This place is just so comforting to me. Every meal is equivalent to a hug from your grandmother. Coffee is good too (Philz is across the street so I guess you could go there and get better coffee if you don't like the coffee they have here). Hands down one of my favorite breakfast spots in SF for something cheap, consistent, and solid. Screw Flanders.", "author": "Eucalyptus J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "awesome breakfast place with authentic Latin food. Great vegetarian and vegan options. Soyrizo was seasoned superbly. Prices good compared to other top rated places! We would come back!!!!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "So many vegan choices! I ordered the vegan breakfast burrito. It was amazing! We also got the plantanos, vegan French toast, sun rise eggs, and a soy mocha. Everyone LOVED their choices! The mocha was yummy, but really sweet. I want to return and try the papusas and some other vegan  dishes.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "PRO TIP: FOR BREAKFAST, ORDER ONLY FROM LATINO MENU. I know they have an extensive American breakfast menu, and I know that you may be craving some pancakes and bacon, but I swear their Latino breakfast dishes will blow you away so much, you'll forget about pancakes and bacon. The fried plantains are fantastic, and they do something to their black beans that makes it really tasty. ALSO! Order Chai Tea. You won't regret it. :)", "author": "Trisha D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-28", "description": "I'm a little mystified by all the great reviews for this place. \n\nWe had breakfast here on Sat. morning, and were almost the only ones there. That should have been the big tip-off. Especially since the other place we almost went, (and wished we had) Red's, had a line.\n\nEven though the place was nearly empty, service wasn't great. \nMy coffee was served cool, and I had to send it back and request a hot cup. \nTo add insult to injury, our server never returned to offer refills. \n\nI had the breakfast burrito, with ham, queso fresco,eggs, and potatoes. \nWhile I appreciate that it wasn't greasy, (as can happen with burritos) I expected it to have some flavor. Unfortunately, it was really bland. \n\nIt wasn't inedible by any means, I was just expecting more. Especially after reading such great reviews. \n\nOn the plus side, it was pretty cheap.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "I loved this place! If I lived nearby it would be a regular spot on my brunch rotation. We had a few different kinds of pupusas, black beans, avocado, and plantains. The plantains were as good as any I've had while traveling in Latin America. Service was good, too!", "author": "Allison A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "The rice beans, salsa, and fried plantains is all you need for your experience here to be delectable.", "author": "Tony P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "I'm always on the lookout for cute little diners for when I wake up at 11 on a typical Saturday and have a craving for some brunch. \n\nSun Rise has quickly jumped to the top of my list. Cheap food (mostly under $10), excellent service and friendly staff all are good signs, and the food didn't disappoint. \n\nI've always ordered off the Latin American portion of the menu, and both the breakfast burrito and huevos rancheros were solid. The soyrizo on the vegan breakfast burrito was a little boring, but the included salsa made up for it. \n\nOverall, Sun Rise is one of my regular standbys and an easy recommendation.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-10", "description": "I have a new favorite thing to order at Sunrise.  A side order of plaintains with a side order of rice and beans.  It comes out as a big plate for like $5.00!  Vegan yumminess!!!\n\nAlso, the vegan tamales with that special red sauce are so yummy.   I must admit, I get the vegan tamale every time, no matter what I ordered as my main entree.  It's just one of those things in life that is not negotiable.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "The food - delicious\nThe service - incredibly slow\nOur stomachs - feeling a little weird after eating, and for my friend, hurting a couple hours afterwards\nThe selection - they have vegan options, which I really appreciated that\n\nOverall an okay place to eat (besides the mystery stomach aches). I'll stick to my other brunch regulars.", "author": "Tasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "What a way to start the day! I had the plantain plate with cheese pupusas. They seasoned the black beans to compliment the sweetness of the plantains. Nice portions, vegan options, mellow vibe and good service.", "author": "Lulu M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "Hello San Fran! I'm sitting here now at this adorable little hustle and bustle cafe in The Mission. I like it because I can sit here in the corner at a little table for two and spread out with my bacon, eggs, toast, and laptop. It's sunny and cheery, feels like (and is) a neighborhood cafe. It's loud-ish, which adds to the fun and vibe. This is a weekend brunch-time that I'm writing, so might be a bit quieter during the week. The staff is friendly -if just a tad stretched thin! But I've been a server before, so BE NICE TO THEM -they gotta make a living, right? ;D I can't super review the food, cuz only had the classic scrambled eggs, toast, bacon, and potatoes -but it was good. Solid, cooked as I asked (well done, crispy, etc.) and not too greasy. The coffee is hot and freshly made!", "author": "Annie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "Had the huevos al gusto with plantains (chose scrambled eggs since easier to work with tortillas). Dang everything was good and hearty - very filling without being stuffed. The pupusas were good as well, just ignore omelettes. The coffee was okay, more on the warm than hot side, and there was no refill or an offer. But, the waitress was the only person working at the time. No worries, since this was during the Mission Street Food fest and there were bound to be waits everywhere.\n\nThe place is warm and inviting, with a yellowish paint wall-to-ceiling decor with art \"blocks\" of all shapes and sizes everywhere. Would return, yep. Only a few blocks away from the 24th St. BART station.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-11", "description": "Came to this place on a whim with a friend after reading their menu online; the chilaquiles seemed to beckon to me, and having been raised on chilaquiles every other Sunday at my mother's house, this would be quite the mark to meet. Chilaquiles, by the way, are typically crispy tortilla wedges cooked in a mildly spicy red or green sauce, then mixed with (usually) scrambled eggs, some sort of cheese (queso fresco here), and often times one might see lettuce, shredded meat, and/or beans. Here, they are served with just eggs, cheese, and a bit of chorizo.  \n\nThankfully,the mark it was met. The chilaquiles were slightly crispy, mildly sweet and salty (a good salsa), with a hint of chorizo, and generous eggs. I ordered it with a side of beans for old times sake, and they partnered with them quite well. Paired with a hot cup of coffee this couldn't have been better. The Huevos al Gusto my friend ordered were good too, with the plantains tender and sweet. A winner as well. I highly recommend the chilaquiles... \n\nMy only gripe was that for a friday morning, there was only one person on the floor and 2 big groups besides us, so the service was a little slow, but not bad.", "author": "Vittorio L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-17", "description": "After all the great Yelp reviews this place got, I was expecting a much better meal. I had the chorizo and eggs with black beans. It was ok. It seemed overly salted and there really wasn't anything remarkable about it. The decaf espresso I had was awesome. If you're stuck drinking decaf, you can appreciate how hard it can be to find a decent cup of it. My husband had the breakfast burrito and didn't really like it. I don't know, maybe we caught this place on an off day?", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-28", "description": "Pretty standard local neighborhood restaurant.  Everything on the menu is good.  The breakfast fare and the standard burgers/sandwiches/Mexican food.  They even have papusas!  Come here to get some breakfast food after a long night out.  I got a breakfast burrito which was pretty good. The chilaquiles were a popular item in the restaurant but it seemed like my friends all got standard breakfast fare which all look good. It's hard to mess up eggs, toast, and sausage. \n\nThis is a place to eat at if you're in the neighborhood but not somewhere you would make a long drive towards.", "author": "John N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "I was looking for a quick quality breakfast and sunrise delivered. The omelette was cooked right and quite tasty. The service was adequate though it seemed like one more person would have been better, and it was kinda my own fault for choosing the seat I did but I wound up sitting right next to a window where they prepared checks and I didn't love having people standing right over me while I was eating. Never-the-less, I'll probably be back soon. Thanks for the nice breakfast", "author": "Justin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "Cute breakfast restaurant with great vegan options! \n\nOh my, what a gem. The menu was fantastic and clearly labeled vegan options. I went with the soyrizo which came with black beans, rice, and tortillas. The soyrizo was flavorful and crispy yuummmzz and the coffee was delicious. \n\nTwo people in my party ordered hot chocolate and said it was good. Other members in my group had egg dishes and french toast with no complaints. Parking was tricky and watch your meter. Otherwise, the place was run by two people so do not be in a hurry (hence watch your meter!). \n\nIt was really nice to see vegan options outside of  tofu scrambles.", "author": "Hollie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "Saturday morning, hangover in full effect, desperately in need of sustenance. What better than a Mexican breakfast to kick-start the day? Lucky for us, Sun Rise was just a short walk away!\n\nI opted for the chilequiles, while my friends opted for just some eggs, bacon & potatoes and the Sun Rise breakfast, which was very similar to eggs benedict, but without the hollandaise. The bacon & eggs were nothing spectacular, but the potatoes (which were requested as \"extra crispy\") were spot-on. The Sun Rise was pretty bland, definitely not up to its tasty description. My breakfast was the clear winner, and lucky for my breakfast companions, there was more then enough to go around! \n\nThe chilequiles were a huge portion of crispy tortilla chips, mixed together with scrambled eggs and chorizo, and all smothered with a delicious red sauce (like an enchilada sauce), and some queso fresco. It was a truly outstanding dish. Between the 3 of us, we practically licked the plate clean!\n\nWord to the wise - don't stray from the Mexican breakfast portion of the menu and you won't be disappointed!", "author": "Eve C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-07", "description": "Decent quality but tiny portions.  My omelet was smaller than my hand with only 12 homefries, 3 thin apple slices and one butterfied orange slice.  Yes I counted.  Tiny burnt toast too.  I felt like a giant Gulliver.  The place was so cold that I had to wear my coat the entire time and was still cold.  There were no paper towels in the bathroom.  The only good thing I can say is that my omelet had good flavor.  Yes, all 3 bites of it.\n\nMy friend who I ate with said that his food was lousy and I could see it was all watery, and it wasn't soup.\n\nAnd the final ringer, the price was outrageous for what you got.", "author": "Scott A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "Love Sun Rise Restaurant!  Convenient to BART 24th St. Mission Station ...  Delicious vegan breakfast options .... Wonderful staff ... Indie art on the walls ...", "author": "Brian W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-16", "description": "I'd love to tell you how I enjoyed (or didn't) their food, but to do that I would have to be able to actually enter their restaurant, which isn't possible when they aren't open when they say they are. Yelp says that they are open at 7AM on Saturdays, their sign in the window says that they are open at 7AM on Saturdays, but twice now I have tried to go there and they've been closed at 7:10AM. I peered in the window this morning to se if it looked like they would be opening soon, and all of the chairs were up on the tables and a lady in the back looked at me as if I was the biggest fool in the world for trying to go to their restaurant. I've tried twice now, but probably won't bother with a third attempt.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "A much needed yummy breakfast! I ordered both pancakes/eggs and frijolitos/plátanos maduros/crema. Great taste for an even better price. Service is courteous. Only downfall, ordered eggs well done and they arrived over done making it tough to eat.", "author": "Monica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "I absolutely love this place.  The vegan fajitas are off the hook.  Very filling.  The vegan french toast is also quite good.  The place is great for breakfast food all day.  Unless you speak Spanish pick up orders over the phone can be challenging.", "author": "Naomi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "So good! My husband and I came for breakfast here twice in our 4 day visit to SF. This place is inviting and everyone working here is very sweet...and they cook up a delicious vegan breakfast burrito.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-18", "description": "Eh, uninspired review here... \n\nHere's where I stand on this place:\n\n1) the prices are relatively cheap you can leave here for $20 (for two).\n2) I tasted too much soggy spinach taste with my sunrise eggs.\n2a) the eggs were fully cooked no yoke left...\n2b) the chips were good... \n3) service seemed a little lacking, one girl at another table actually got up to get more coffee, not the sign of awesome service.\n4) This isn't a place with big lines... bonus.\n\nI've had much better breakfasts else where on 24th e.g. st francis fountain or papalotes, even last supper club was better although that's on 23rd...", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "My new favorite breakfast in San Francisco. Muy autentico. Muy sabor! Had Huevos al Gusto, which came with corn tortillas.  Lovely family run business with authentic Central American style breakfast. Just wish it/I were a couple thousand miles south.", "author": "Ian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-01", "description": "I love this place. It's just one of those simple pleasures in life. The staff is really friendly, the food reliably good, the interior is warm and comfortable, and I've never had a problem just walking in and finding a seat. Walk across the street to Philz coffee, and you will definitely have a great morning.\n\nMy favorite dish is the Huevos al Gusto.I've posted a photo of the dish, so you can see it above the review.  It consists of eggs (your choice on how it's done) a rice-black beans mix that's tasty, a wedge of cheese, and sweet platanos with sour cream for dipping. Wash it down with a glass of sweet horchata and your in heaven.", "author": "Lucky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "Totally delicious vegan pupusas and breakfast burritos at really great prices. Non-vegetarian/vegan friends also give this spot a thumbs up! Friendly service. Horchata was too sweet.", "author": "Jolene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "Excellent! Tried the Huevos Al Gusto and it felt like I was home having a home made breakfast prepared by my mom!", "author": "Rudy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-29", "description": "I can't believe this place has four stars. After an all-night long coding session, we hopped on yelp and saw a Latin American restaurant open at 7am Sunday morning. The pictures looked appetizing, and we were hankering for some good ethnic food, so off we went!\n\nWell, the food was NOT appetizing. It was the opposite of appetizing. It was off-putting. While the other three orders were just sub-par, one of our orders was absolutely revolting. Somebody ordered the mushroom omelet and we spent the rest of our breakfast trying to describe how disgusting it was, wishing we didn't taste it. \n\nI was revolted. It was like, as if I was giving a BJ to a mushroom. And then the mushroom had climaxed and squirt tons of little spores into my mouth. And then spores tried their hardest to impregnate my tongue. \n\nThat's how bad this tasted. \n\nI even offered a friend $20 cash to finish it off. HE DECLINED.\n\nWe were the only four people in the restaurant, and even then we got ZERO service. The waitress took our order, and that was all that we saw of her for the next 45 minutes. No refills on water. Nothing. We had to get up to get her attention. Once to get the check. Once again to pay. And even when we paid, she wouldn't split the check among our cards, forcing us all to pay on one. Next time, I suggest that if you go here with more than one person that has a card, you all sit at different tables. \n\nActually, I don't suggest you go here at all. \n\nP.S. After we reasoned that there is some possibility they didn't know they were serving their customers spoiled mushrooms, we thought it'd be a nice gesture to tell them. The waitress said, in exact quotations, \"You didn't like it? I'm sorry.\" And then we left.", "author": "Gravity S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-26", "description": "I read about this on a best benedict list and was intrigued.  Also, it apparently has great yelp reviews and fans on facebook (but then again so does Panchita's #3).  So when I say that I think it's overrated, I don't mean it exactly in an insulting way.  The place is super cute, the service is friendly, and the food was solid - the hype is just a little more than warranted.  I wondered as I was eating whether people just want to show they're down with the community by raving about a local hole in the wall non gentrified restaurant.  \n\nAnyway, I thought the chilaquiles were ok, and its cool that they're willing to make it with vegan chorizo, but they're better at San Jalisco (formerly Los Jarritos) and the benedict was adequate but wouldn't make my top 10.  The potatoes were not very good and I dislike Mr. Espresso coffee, so we went over to Philz after for coffee.  \n\nI'd be interested in trying the rancheros, breakfast burritos and maybe a few other items on the menu, and am open to being more impressed.  Go early if you wish to avoid hipsters.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "These folks have a really interesting and unusual approach to their meals. I order the chilequilles, the ones offered with scrambled eggs, chorizo, queso fresca, tortilla chips and sour cream with fresh salsa and the waitress brings tortilla chips with salsa, sour cream and did I mention tortilla chips? Lots and lots and lots and lots of tortilla chips?\n\nI tuck in believing the eggs and chorizo to be hidden somewhere under that plate-breaking mound of chips and.....nothing; no eggs, no chorizo. Perhaps they are on the other side of the platter, I surmise, wanting to believe the chilequilles of my childhood are somewhere to be found amongst all those tortilla chips. Rotating the platter to begin my quest afresh, I tuck in again from the new angle AND......... still no eggs, still no chorizo.\n\nI attempt to catch the waitress's eye to no avail. She was too busy serving some damned fine looking breakfasts WITH eggs and damned fine looking eggs they were. Oh, and what is that on that young fellow's plate??? It's my missing chorizo!!!\n\nI give up. I surrender. I retreat to the cash register, pay my bill and exit the door to check the menu in the front window, hoping, praying the folks in the kitchen mistook me for some overgrown, very tall, very Texan vegetarian and served me their vegetarian version of chilequilles. My heart sinks as I read the veggie version contains black beans. Whole or mashed, you ask? Why I would have no idea since the special Texas vegetarian version not listed on the menu contains nary a trace of a bean of any stripe, not a single one, zilch, nada, none nestled anywhere among that vast plate of chips.\n\nThere is always a first time and a last time for me. Rarely do the two coincide. At the Sun Rise Restaurant, that rarity became reality.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "This is a great standard breakfast place. Nothing over the top, but it was fresh and delicious! French toast was tasty and the potatoes were yummy!!! Their bacon was even cooked just right - not too crispy, but not too soft!\n\n I'll definitely be back.", "author": "Maggie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-06", "description": "Not seeing my beautiful friend Amie K in a long time, I jumped at the chance to meet her for lunch; especially at a new place w/ a good brunch. I patiently wait as she gets all cute (not that this cute girl needs any prepping). \n\nThe place is packed so I'm anxious to try their juevos con chorizo. The wait was worth it once I see my lovly brunch mate approach our table for two. \n\nChit chat about the latest __________, and that one time ___________, and who said what to whom. Finally the food comes out. \n\nI get the juevos con chorizo w/ a side of hash and Amie gets the vegan breakfast burrito w/ a vegan papusa. The portions are average (definitely don't expect to take stuff home for another meal). But the food is good and worth coming back for. \n\nThe juevos con chorizo came w/:\n\nThree fresh steamed tortillas, good mexican cheese, salsa, sour cream, black beans, the eggs were scrambbled w/ the chorizo. \n\nHash was a golden brown and crisp; perfect w/ tap and ketchup. \n\nI did have to ask for water a number of times though before inally getting it. \n\nIt was great catching up w/ Amie and we made plans for dinner when I return from HI. Can't wait to regale her about my mis-adventures on the black sand beaches of Kona.", "author": "Angelo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "This is just a breakfast burrito review FYI...  So this place is charming.  Low key, and homey feel inside, and the staff are polite.  I got the bacon breakfast burrito this time and it was pretty damn good.  The eggs are nice and fluffy which makes a big difference and the bacon is pretty good.  The cheese wasn't totally melted in mine, and the inside was a little dry, which some of their salsa cured.  It's not a grab and go place, so it's more sit down style, but I did dig the breakfast burrito and wanna come back to try the other goods.  Nice neighborhood spot!", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "Amazing food. I had the huevos al gusto with plantains. I've been on a two month road trip eating my way across the country in all the foodie cities and this was the best meal I've had. Stick with Latin dishes.", "author": "Michaela R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-25", "description": "Patient and alluring are my biggest qualities and both was tested quite greatly at this latin usa restaurant. All i wanted was to smoosh plantain and bean into my little mouth after hearing hoop dream hype about Sun Rise. It was only after a long wait to sit, a longer wait to order and flirt, and a gut achingly longest wait to get my foods that i could do so. Oh it was treacherous and cruel of them to make me wait and stare at my neighbor's plates for extended periods of time. even my neighbors seemed to sympathize by giving me strange looks, so even they understood. the mashed black beans were satisfactory after some salting and the sour cream was down right delicious.\n\nmaybe i will give them another taste if i have hours to waste and can get that waitress' number ;)", "author": "Merland S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "Overall, the food was really good! The restaurant itself is pretty small and it was packed for a weekday morning! We had a large group and shared all our food. I realllly loved the block of fresh cheese that came w/ everyone's food. I'm not sure what type of cheese it was, but it was good! Close to SFGH!", "author": "Yumi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-06", "description": "Great ambiance. The art and music and service were great, my eggs were just way overcooked. would not return.", "author": "Evan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "This past mother's day, I wanted to take my mom on a brunch outing.  We're not big fans of the traditional brunch plates (pancakes, french toast, eggs benedict, sausage/bacon etc.) and wanted something with a Latino flare.  Sun Rise is small eatery, but there was no wait time upon our arrival and our dining experience got started fairly quickly! Their menu showed a great variety and typical Latino breakfast items that my mom enjoys; she opted for the Huevos Rancheros which she hasn't had in months.  She really enjoyed the ranchera sauce, plantains, casamiento, and the quesito fresco.  So simple, yet so delicious.  I chose the Huevos a la mexicana which was scrambled eggs with bell pepper, tomato, and onions; the plate came with a side of black beans and queso fresco.  So yum!!  We can make eggs at home, but these plates oozed with the comforting latin flavors we craved.  This was our first time here, and we left with the hope of coming again to try their lunch/dinner items.", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-25", "description": "This is a classic 3 star. The atmosphere is humble, but clean. There is one waitress. The prices are reasonable. My breakfast burrito was a good deal at $5. Best part is that the food wasn't greasy. Overall, I won't crave it, but will pass it and say \"that place is good!\"", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-05", "description": "The atmosphere is amazing - the vibes are great, and they donate 20% of thier proceeds to local non-profits, like Critical Resistance!  Every Thursday is this awesome event, \"Lengua en Salsa\" where they donate food proceeds to orgs in the community. Awesome.\n\nThe chorizo eggs were AMAZING - but $7.50 for the amount they gave was kinda pithy. My friend ordered two Papusas, which were both PHENOMENAL (Vegetarian). The platano are great - make sure to get em w/ cream + Black Beans!!!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "We just ate here for brunch about 1pm, the food was amazing! I definitely recommend definitely recommend the pancakes there! My boyfriend had the vegan breakfast burrito and it was delicious! Also, there was no wait and great reasonable prices!", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "The dr.'s arm has been in an industrial looking sling for a couple of weeks now and it's funny seeing people's reactions but the best was the one from the mariachi at Sun Rise who told us that the last time he was in a sling like that was for trying to hit his wife.\n\n\"What?\"\n\n\"She ducked,\"  he said.\n\n\"Umm...what?\"\n\nSometimes it's easier to laugh, slip the guy some singles and continue inhaling the vegan french toast in front of you.\n\nTales of spousal abuse, scattered tables of hipsters and mexicans all dining as one made Sun Rise feel cozy.  This place is right at home on 24th St.  \n\nWe had traveled here from reading tales of vegan pupusas.  They did not fail.  I've never even had a meaty pupusa (why does that sound wrong) from my omnivorous days.  Eat them while they're hot because when they cool down they start to lose something in flavor.  Be forewarned, they are not afraid of salt in this joint.\n\nThe dr. and I split the french toast and the breakfast burrito and both were satisfying.  I don't know how they got the soyrizo crisp.  In my experience, it's stayed mush no matter how long i cooked it.  While I would have added a tad bit more avocado, the burrito was good.  \n\nQuick, easy, no hassle breakfast.\n\nPlease note that if you try to punch your wife though, you will pay dearly.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Went here for the first time the other day with a couple old friends. And I'm really glad we decided on this restaurant. \n\nGranted, it wasn't crowded at all when we went, so the service was excellent and everyone there was incredibly nice. Ordered the vegan fajitas, which were SO GOOD, and incredibly fresh too. Friends had a breakfast burrito and fajitas with prawns and beef, all of which went over great.\n\nI would definitely go here again. Well, I'm definitely going here again.", "author": "Amber B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-22", "description": "I am so happy to have found this place!\nEating here feels like home!\nHuge flavorful dishes (like the \"bistek al jugo\") served with beans, rice, cheese, and HALF AN AVOCADO!\nThey are just NOT stingy!\n\nEvery plate comes with fresh thick hand made tortillas and the servers are very kind and patient.\nThey have art hanging on the walls and is a warm and homey environment.\nALSO, where else can you find VEGAN pupusas?!?!? THEY ARE DELICIOUS! Made with zucchini and black beans! yay for pupusas with no cheese!\n\nWill come back many times! It's my go to place now!", "author": "Anais A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-29", "description": "It's an unusual taqueria because it has vegan options like soyrizo and tofu scramble. I had the breakfast vegan burrito and it was palatable but difficult to finish. Not to mention the service wasn't very efficient either. They never brought out the water/condiments until we asked. I'll give it another shot to try other vegan options but for now you get 3 stars.  \n\nThis place is very inexpensive so I might be expecting too much for what I pay. But definitely don't get the coffee here. Go across the street to Philz.", "author": "saurabh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "Really enjoyable breakfasts on the weekends. Plantains? Queso Fresca? Eggs? Yes please!", "author": "Sam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Yummy vegan Latin American food in the Mission! I went for dinner with a friend when I was back in town, and I had really, really tasty tamales! They had to have been the best tamales I'd ever had. I also had a vegan pupusa and vegan fajitas. It was way too much food, but I had wanted to try both the vegan pupusas and the vegan tamales. And boy am I glad that I tried those tamales!\n\nI haven't been for breakfast or brunch, but it looks like they have great veg options for those meals, too! I'll definitely be stopping by the next time I'm in town!", "author": "Rose K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "After coming back from Costa Rica, we wanted to ease ourselves back into the grind of the city. We looked up a place that would serve Latin breakfast and went with it. A Breakfast Burrito and  Huevos Al Gusto - 2 eggs, mix of rice and black beans, fresh cheese, sour cream, fresh cheese, salsa and choice of avocado or plantain. Not quite what we experienced on our trip, but still our bellies were happy. The prices make my wallet happy too.", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "I'm glad I went here a second time before writing this review. The first time I ate here was on on New Year's Eve with a group. It was crowded, the service was slow, my meal mediocre, and they forgot to bring out one of the dishes we ordered. We'd already waited too long, so we left without it. What kept me from writing a bad review was the potential I saw in the place, and I'm glad I waited to see that potential realized.\n\nSun Rise seems to have hit their stride four months later. On my second visit, my boyfriend and I shared their vegan breakfast burrito, vegan fajitas, vegan pupusas with black beans and loroco (flower buds that taste sort of like artichoke), and fried plantains. Everything was super tasty! Aside from the food, it's a great space, wasn't too crowded when we went there for dinner on a Saturday night, and the staff was friendly. The service was still on the slow side, but that was really the only negative. Sun Rise is a lovely little low-key, down to earth spot for vegan (or regular) Central American dishes; a great alternative to Gracias Madre.", "author": "Jill H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-30", "description": "I really was looking forward to giving Sun Rise five stars. I went for breakfast a few months back and absolutely loved how this unassuming, friendly latin spot served up parfaits, egg whites and a house made soyrizo. All delicious. Not to many spots you can get that in ye old Mission. In fact this might be the only one.\n\nFive stars seemed assured until I returned tonight for dinner. I have no complaints on the food - tofu fajitas that were bursting with flavor, perhaps one of the best mixes of tofu, veggies and refried black beans I've ever had. But they totally lost me on the price. $12 + tax for about as much food as you'd get inside a burrito at any number of other Mission joints. And the three mini tortillas that came with it seemed a little conservative.\n\nAbsolutely love the food and delicious veggie options, but I can't give a better rating with prices so high. Get that fajita down a few dollars and I'd be happy to add a star or two.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "Food and service were both wonderful! I got a two eggs breakfast plate with a side of fried plantains, and my gf got the pancakes w/ fruit and powdered sugar.  everything tasted like it was homemade and I was pleasantly surprised when the bill came :) I will be back the next time I'm in the bay...", "author": "Mikey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "This is a great place for breakfast, lunch, or dinner.  I had their brakfast this morning - huevos al gusto, and it came with gallo pinto (rice and beans), avocado, Mexican cheese, and sour cream and salsa. Plenty of tortillas as well. Authentically Central American.  The decor (bright colors and photos) on the walls makes it a homey place to eat.  Salsa music in the background definitely brightens your day as well.\n\nWe have had dinner here as well - beef steak with tomatos and onions and found it delicious as well.\n\nPrices reasonable.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "Oh my dear Sun Rise, thanks for the lovely vegan pupusas and tamales you serve! \nIn fact, your food is so divine, it has inspired me to write my 1st yelp review! You're warm and comfortable, just like my great-grammy's kitchen used to be...\nSo far we've tried: black bean and zucchini pupusas (great!), vegan tamales (yum!), and the vegan breakfast burrito w/ soyrizo (big and tasty!)...\nAnother great thing about you is your huge variety of dishes- plenty for carnivores, vegetarians, and vegans alike. \nSee you again tonight   =)", "author": "Cherilyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-23", "description": "I got the background on the lack of staff here at Sun Rise from a friend. But it's not fair to the waitress to have to work an entire cafe by herself on a busy Saturday afternoon (especially while the street food fest was going on...). I know she's working hard, and trying hard but that creates for bad service. We met up with some friends who were already eating here and asked to get menus and order...this was a very long ordeal...and then to get our food took even longer.\n\nI got the pork and cheese pupusas and the fried plantains. come here for the plantains, seriously. soooooo goooooood.\n\nbut expect to be here for a while, seriously.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "We were planning to go to Wise Sons Delii for lunch, a few doors down.  But, there was a super long line and we didn't want to wait.  So, we tried Sun Rise instead.  Super cute with \"Latin and American cuisine,\" the menu said.  Thanks for a delish late breakfast--coffee, Heuvos Rancheros (vegetarian) and Chorizo (not vegetarian, although they have vegan Chorizo!). And, no wait to be seated!!!  :D  Service was just a little slow.", "author": "Allison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "This is by far my FAVORITE restaurant in the Mission.  The food is superb, the folks are nice and the prices are good.  I feel good giving these folks my money. They have great Latin American food, breakfast, lunch, pupusas, brunch, American stuff like pancakes and vegan options.  It's kind of on the slow food tip so don't go expecting to rush in and out.\nI always get the Huevos al Gusto with plantains, beans and rice and avo, salsa, and this really good fresh cheese.  The pupusas, pancakes and tacos are great too. And good coffee.  And they have really weird, good, random art on the walls.", "author": "Hilarooo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "This is a great find...luckily the line at Wise Sons was too long.  Sun Rise Latin breakfast dishes are great! Healthy breakfast Burrito, Huevos con Gusto, Huevos con chorizo!  They were all good!  The place is also unbelievably easy on the wallet. Good service too...they're just 1 person short on weekends when it seems to get plenty busy.  I'm a fan!", "author": "Ramon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-22", "description": "Whenever I think about the soyrizo breakfast burrito at Sun Rise Restaurant, I want to move to San Francisco. The soyrizo, the crispy potatoes, whatever else was in there...definitely the best breakfast burrito of my life.\n\nPlus, Sun Rise Restaurant is adorable and makes me happy to be inside, and they have plantains. What else could you possibly need?", "author": "Maeve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "The other day I was wishing I had a breakfast burrito genie and then I met Alba, the owner of Sun Rise Restaurant. Wish granted!\n\nI love this neighborhood place. For reals. The food is amazing and generally will take a hot minute to get to the table, but its totally worth it. The chilaquiles and breakfast burrito is so tasty and can be easily shared with another person if you add a small side like the platanos fritos. My suggestion is to order them \"maduros\", extra ripe with a side of crema (sour cream). \n\nMs. Alba and her staff are super sweet and make you feel like your at home even when the place is packed.", "author": "Maria A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "Solid food, great prices, comfortable environment\n\nWould not go here for the coffee, but Im spoiled.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "Stopped in here in whim and was not disappointed.  Not a taqueria, so be ready to sit down and order.  Place appears to be family run, great assortment of dished both \"Latin\" and \"American\" so all tastes can be met.\n\nWill def go back when in the neighborhood.", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "Sunrise is spectacular! I go here on sundays for breakfast as often as I can. The food is great and the service is even better. They have a young woman serving the approx 15-20 tables in there all by her self, and she's always attentive, friendly and never mess up your order no matter how busy they get. \n\nThe interior is always interesting as they feature new local artists all the time. It seems every time I go in there they have new art up. This place is a goldmine on those sunday mornings when you want your grease fix, and don't want to deal with the hour long waits everywhere else good in the mission.", "author": "K D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "An excellent choice for brunch in the mission. \n\nGood prices, generous portions and great service.\n\nI highly recommend the Huevos al Gusto with plantains.", "author": "Spiferina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "Yea, this place is awesome.  Brunch on a Sunday with no wait to be seated?  Cool, inspiring, and fresh art on the walls?  Smiling service and a relaxed atmosphere?  And a robust menu sure to satisfy everyone in your party.  I'm probably going to end up being a regular since there were quite a few dishes that sounded great.  Besides, the interior is just comfy.\n\nMy friend had the chilaquiles, I had the sunrise (poached eggs, tatos, spinach, bacon), and my friend's kid had eggs, pancakes, and bacon.  The portions were generous and the food tasty.  The bill was easy on my wallet, too.  Oh, and their horchata is great, too.\n\nYea, I had to go to the counter to pay, but so what?  I thought the service was just perfect, really and truly.", "author": "Criz S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-13", "description": "Three stars. It was a delicious vegan breakfast burrito, but the presentation was lacking, it was literally a giant log on a plate, no salad or even attempt at making the plate look nice. It was cheap, it came out to 7 bucks for a really big portion. I passed on the coffee as a snobby coffee fan (I saw Mr. Espresso though, which is an average roaster, so it's probably not terrible). Ambience was a perfect relaxed Sunday morning feel, not fancy whatsoever, but when you're eating a breakfast burrito or eggs who wants fancy?", "author": "Patrick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "The trick with this place is simple: order Mexican food, not American.\n\nThe first time I went here I tried one of their regular American omelets.  It sounded yummy but was bland.  The next time I had a vegan soyrizo omelet, and woo hoo, it was so freakin' yummy!!!\n\nI highly recommend the papusas (the bean and cheese and the cheese are particularly yummy).  And they are cheap!!!  \n\nBut really, everything I've ever ordered from here that was Mexican food or Mexican-inspired was delicious.  The regular old boring stuff you can get anywhere leaves much to be desired.  When in Rome!\n\nAlso, really yummy coffee.  I had a latte or something and it was one of the best I've ever had.  Though, of course, Philz is right around the corner...", "author": "Sivan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-09", "description": "I had a godawful breakfast there this morning. Horrible, greasy hash browns, avocado had \"turned,\" and they really do not know how to poach an egg.  Next time we go for a mid-week before-school breakfast, we'll just return to the excellent Red Cafe.", "author": "Kathy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Mimosas are effing huge!  6.50 but made with fresh oj and are fairly strong.  They come in what appears to be a 20 oz glass!\n\nWe had the huevos al gusto with plantains, and an order of flautas, both were fantastic!  Good crowd and cool mission coffee mugs!  Wish my food came a little faster, I woulda given them a 4.5 or 5!", "author": "Shawn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "All the food I've had here has been delicious. This morning I had the best pancakes evar with bananas and walnuts. The chilaquiles were great too. I'm not so hot on the coffee-based beverages though. You're better off waiting until after breakfast and going across to Phil's IMHO.", "author": "Rowan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-10", "description": "I've only been for breakfast and pupusas and it's never disappointed! Conveniently down the street from BART too.", "author": "Maria F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "This place was pretty crowded on a Sunday morning, which was a good sign. The bad sign: Only one waitress and two chefs. Which meant that it took forever for anything to get done. I never got my water refilled once. The breakfast food was good, but just your standard Mexican brunch food , and nothing special, and certainly not worth the wait.\n\nIt's not as popular, but I would highly recommend El Delfin right nearby for real Mexican home(y) cooking.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "They have the BEST chilaquiles in San Francisco. I like the fact that the eggs and chorizo are spread out throughout the tortillas rather than putting them just on top like most restaurants do.\n\nThey have pretty good vagan options and a nice selection of beers. \n\nYou can get a 24 ounce beer from El Salvador called Regia for $7. good stuff.", "author": "Rigo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "Was turned away from St. Francis down the street, (they were too b.z.) so ended up here, and glad I did.\n\nThey have traditional american b'fast fare, which I was going for even though it was close to 2:00pm, but opted for the chilaquilas...\n\nI used to make this mexican dish which resembles kind of a mashed up\nenchilada. I did order this at another mexican restaurant which i can't remember the name of (off 23rd and Valencia???), and theirs was good but a bit too spicy.\n\nBut Sun Rise's was a bit different, the tortilla chips retained a bit of crunch that complemented the meal well. My date's chorizo satisfied, and our side of plantains, i say \"platanos\", (i'm half latino), were sweet and scrumptious.\n\nSo many good places on 24th!!!", "author": "wayne s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "Best breakfast berito I ever had and it was vegan as well.  The pancakes were incredible and I am looking for reasons to go back as soon as possible.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-22", "description": "I loved this place.  I had lunch here with my good friend, Linda the Great.  How great is she?  She's so great, she makes Alexander the Great look like Alexander the Wuss!  We usually have lunch once a month, but we've both been busy and haven't had lunch for awhile. It was my turn to pick the restaurant, and I found a Mexican place on Yelp(Valencia Street).  We went there and her Greatness took one look around, and said that it didn't look clean, and it smelled bad.  Hey, when I'm rich and famous, she's going to be my food taster!  So, we wandered down 24th Street(and who doesn't love 24th Street???)  We looked into windows of restaurants and checked out their menus. Sun Rise Restaurant was packed, and the menu looked great!  I had the Huevos a la Mexicana(Mexican eggs) and her Greatness had Lomito al Jugo(steak, rice, black beans, avocado and salsa).  Muy bueno!(very good!).  They gave us hot, freshly made tortillas that were soooooo good!  The service was wonderful!  And OMG, the prices were so reasonable!", "author": "Blondie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "This place is amazing! It's a tiny hole in the wall with great food! My boyfriend got a vegan French toast made with soy milk & tofu, delish! I got the mushroom with Brie omelette. The food is fresh and has vegan dishes, amazing. This place has the best soy lattes I've had in a very long time! It was so good I had to order another one to go! If you're around this area, definitely stop in for some delicious grub or at least a latte!!!", "author": "Shana O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-30", "description": "Good food in good portions for a good price. That's what I like! \n\nCame here for brunch and I had the Huevos al Gusto because it had platanos and I love that stuff. I enjoyed everything else it came with (mmm.. beans.) and cleaned up the entire plate. I arrived hungry and left feeling like a fat-ass. I don't know about ordering the classic American stuff on the menu but I'd probably come back for the Latin American breakfast, and probably order the same thing.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "The vegetarian chilaquiles were stingy on the soyrizo, but hey, it's chilaquiles.  You can't beat crispy tortilla chips topped with cheese, eggs, salsa, refried beans, and sour cream.  It's every bit as delicious (and bad for you) as it sounds.\n\nThe most striking part of the meal, though, was a bright red drink called fresco de chan.  It's kind of like strawberry juice, with seeds in the glass.  So sweet it felt like drinking smooth candy. (I mean that as a compliment).", "author": "angela n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-12", "description": "THIS IS MY NEW Q.\n\nFirst morning in my new neighborhood. I am EXHAUSTED after my moving weekend. Hardly able to get out of bed. By 3:00, boyfriend and I are ready to move our asses out the door to find some breakfast.\n\nWe didn't just find breakfast, though... We found the Mission version of Q! BETTER than Q!!! They have mock meat, and multiple tofu scrambles! Veggie and vegan fare all over the menu! \n\nOh, and regular stuff, too...\n\nAnd they're just about halfway between the bf's and my new place! With no special ordering involved! Which is GREAT because I have a feeling I'm going to be coming here a LOT on mornings when my brain can hardly handle simple tasks like speech and involuntary muscle and organ coordination, let alone SPECIAL ORDERING!\n\nHoly exclamation points.\n\nThis is the kind of joint where a dietarily challenged girl and her meat-and-potatoes guy can enjoy a meal together without wondering if the other is going to run right home after, crouch by the refrigerator, and binge like a ballerina (see Cafe Gratitude: http://www.yelp.com/biz/GGgBRSa6saWrWNUtjdgHsg#hrid:A2ZjbfYHKSmURmaUyYhlSg).\n\nHooray for happy breakfasts. Eaten with scantily clad Latin ladies dancing around on flatscreen TVs in the background... \n\nWait... WTF?", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "Hence the name, their breakfast menu is the highlight, offering standard American and Latin American influenced dishes.  Surprisingly, there's a few vegan options, including vegan chorizo.  I enjoyed the art on the walls, but the waitress kindly noted that they were merely for decoration, not for sale.  \n\nAn anomaly of sorts, lacking the usual line and hipster vibe, it's what makes Sun Rise an excellent choice for that down-home weekend brunch in the Mission.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "No waiting for a table on Sunday Morning.\nNo problem bringing in our coffee from down the street at Dynamo.\n\nChilaquiles for my girl and me, veggie for her, full of chorizo goodness for me. Sides of spinach and plantain to modulate the flavorsome excellence of the main dish. Attentive, friendly service even as the place filled up.\n\nInexpensive and delicious. We'll be back here.", "author": "Lex L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-29", "description": "I trust the opinion of my friends. Unfortunately, sometimes friends have conflicting tastes.\n\nA sweet charmer had some business to attend to at Philz, so after I wandered around the Mission for a while (hello Aquarius Records!), we reconnected and aimed ourselves toward breakfast before hitting the road for lands southern. As it was right in the neighborhood and highly esteemed by a friend, we stopped at Sun Rise Restaurant for a bite.\n\nBeing in the Mission, I decided to do as the Missionaries do. That is to say, I ordered a Mexican breakfast with eggs, black beans, corn tortillas, queso, and salsa. She ordered a tuna melt with fries, not being in the mood for breakfast.\n\nMy food was passable. Unremarkable, and certainly not bad, but passable. Her sandwich smelled like the tuna had come from a can opened and left on the counter the previous day... and the tuna was completely ungarnished. Hint, folks, a little mayo or something? The fries, well, let's just say that multiple impotence references were made. Greasy, salty, and completely flaccid. No, really, I've seen dead fish with more rigidity and structural integrity. After finishing what we were going to eat of our meal, the waitress ignored us, making it difficult to pay our bill and leave. I eventually went up to the counter to pay there.\n\nWe left wandering what the appeal of Sun Rise is. Perhaps the vegan options are their strength. Perhaps we were there on amateur cook day. I'm not sure, but neither of us was impressed. So I don't plan on going back to Sun Rise. But that's OK, I'll keep my friends.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "I'm vegan, and it's so difficult to find brunch options for vegans.  The vegan french toast w/ fruit was really good! The staff was very, very friendly as well.  It gets four stars instead of five just because of the wait for our food and for the bill.  Overall, great experience!", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Sun Rise has a great breakfast with a Latin flair.  The black beans and rice and the plantain were delicious!  The coffee was better than most breakfast spots.  We're going back for dinner---", "author": "Barbara P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-11", "description": "I got the Chilaquiles.  I really didn't care for it at all.  The eggs were hard to spot and when I did locate them, they looked like sad little tatters of some flag.  Perhaps I like a different style.  And I wasn't so keen on the service.  My friend never got her diet coke.  I had to ration sips of water because I clearly was not getting a refill.  My side of hash browns had to be requested again after my meal arrived.  Overall, a lackluster experience.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-27", "description": "Yo! This place have some very delicious vegan options!\n\nTry the papusas and chilcinas (sp?) (elaborate nachos).\n\nService was helpful and friendly. Atmosphere is laid back. \n\nGreat Sunday morning date, with a beautiful lady.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "Delicious! Get the mushroom and Brie omelette with a side of fried plantains. Coffee is good too!", "author": "Savannah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "Another great , inexpensive place in the mish for breakfast and ginourmous mimosas (16oz)", "author": "G K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "I just had a great breakfast here, and I feel so lucky that Sun Rise is a block away from my house.  I had the huevos al gusto with plantains.  Eggs over medium and really cooked to perfection, the yolks ran all over my black beans and rice yum yum. The plantains were sweet and crispy and the salsa accompanying the dish was lovely as well.  My husband ordered the huevos rancheros also with plantains.  He loved them as well saying they were perfectly spiced not greasy or oversalted as they can often be.\n OJ was really good and served in a HUGE glass. The horchata was a total revelation, thicker and less sweet than most- also served in a large glass.  The service was very quick and pleasant at about 12:00 on Saturday.  We had no wait whatsoever.  We will definitely be back!", "author": "sabrina m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "i really quite enjoy sunrise.  quite a whole lot as a matter of fact.\n\neven though the oh-so-popular st. francis is much closer to my apartment, i'll always choose sunrise over st. francis.\n\ni've had huevos a la mexicana, the spinach and eggs, egg & pancake combo, eggs benedict... a few other things, too.  and everything has been excellent.  it's a latin american restaurant but they have some non-latin american items if you don't fancy having beans and salsa in your breakfast.  i think this is a great place to eat following a night of drinking because it's just greasy enough to soak up the remaining booze in your veins but still has some good protein and junk to make it seem healthy.\n\na few things to note:\n- you seat yourself\n- have patience as there's usually just one gal working the whole restaurant (this is a good time to practice living in the moment)\n- you'll likely need to ask for your check or just go to the counter to pay\n\nhead to philz for coffee after you eat and wander through the mission if it's sunny... duh, it's always sunny in the mission.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Love love Sunrise. Heuvos al gusto and Chilaquiles are my favs. Staff are sweeties too!", "author": "Steph N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "Myself and a few other friends had breakfast here on Saturday, the last meal of my friend's single life before his wedding later that afternoon. That's not likely true, actually, as he's the sort to be constantly eating, and I bet he put down a burrito immediately before the proceedings. But I digress. \n\nThe food here was fair to midland, but what killed me - and why I doubt I'll find myself back there - was the service. There wasn't anything wrong with it, per se; the problem was that there was only one person to attend to everyone in the restaurant. I don't think she was so much slow as overwhelmed. I've never worked in a CA restaurant and never been a restaurant owner, and I know there's more to hiring someone than strictly hourly pay, but is the money you're saving by not hiring someone else worth all the trouble? I doubt it. \n\nI had a pancake combo - pancakes plus scrambled eggs, hash browns, and a sausage that looked like no other I've had - not a disc, not a tube. It was tasty, as were the pancakes, whereas the eggs and taters were pretty run of the mill. They might have been more inspiring had I ever been able to get a coffee refill, but that wasn't worth extending my breakfast another 20 minutes. We had tuxes to don!", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "I came here for breakfast while visiting SF with a friend of mine... walking in I felt like I was walking into a little restaurant in someones house, I felt right at home... food was great (and I'm not a breakfast person - at all) service was great... if I am in SF again I will have this on my list of places to go for sure", "author": "Frank E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "I went to Sun Rise Restaurant immediately after I arrived in San Francisco. It was one of the first places that popped up when I searched \"vegan breakfast\" on the yelp app. \n\nI ordered the vegan breakfast burrito. It was delicious. Inside the burrito was soyrizo, roasted potatoes, avocado, and black beans. For some reason when reading the menu I thought the roasted potatoes, salsa, and avocado came on the side, but they were inside. At first I was disappointed because I just had a burrito on a plate and nothing else, but once I realized they were inside of the burrito I was fine. Not the restaurant's fault... I blame a certain Seattle vegan restaurant who's breakfast is enough food to feed a giant for tricking me into thinking I need that much food. I'm a small lady, not a beast, so a burrito is just fine thank you! \n\nMy boyfriend got the vegan french toast and a vegan tamale which he said was the \"best vegan tamale ever.\" I tasted it and it was very good. I have never had another tamale in my life so I have nothing to compare it to, but I would totally order in again.\n\nFrom my experience, Sun Rise is a good place to go for breakfast. The restaurant was cute and clean and the waitress was nice.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-22", "description": "I'm pretty shocked that no one has a reviewed this place yet! It's a smallish, home-y, family-run type of brunch spot, in the heart of the mission on 24th, right across the street from Phil's Coffee. Honestly, I probably wouldn't have known about it either, but my boyfriend used to live right above it, and he was the one to actually discover it. \n\nSunrise is one of those places that offers a standard brunch menu with a Latin American twist, and frankly, it really works for them. They make great pancakes, and you can order them with fresh strawberries or bananas. I've also enjoyed the vegan chorizo scramble several times, and while I'm generally not big on fake meat, their vegan chorizo (or, \"soyrizo\" as some call it) was truly a cut above most of the fake meats out there.\n\nAs far as I'm concerned, the most note-worthy item on their entire menu is the Fresco de Chan, listed under the beverages...it's this incredibly refreshing fruit drink, and I don't even know what to compare it to...it's a bright fuchsia color, it's full of little floating seeds, and it has a slightly gelatinous texture to it, and sort of a \"tropical\" sweet taste...sounds odd, I know, but trust me, it's DELISH! We could never figure out what the heck it was made out of, so we finally asked our server one morning, and she told us it was just the juice of a popular Salvadorean (?) fruit (for which she could offer no English translation). I still can't really wrap my mind around what it might be, but hey, maybe it's more fun that way!", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-12", "description": "Standard food. Took more than 30 minutes to get my food when the place was moderately busy. Had the eggs dutches. Meh ...unenthused", "author": "Chris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "The boyfriend and I went here for a late breakfast today, around 3, since it's like 4 blocks from our house and was on his way to work. The place was totally empty when we went in, but it was sunny and cheerfully decorated. The menu is relatively small, but seriously: everything on it looks good. \n\nMy orange juice was fresh-squeezed, his horchata was excellent, and both came in big glasses. He ordered the pancake combo: their pancakes are the thin, crepe-esque kind. The bacon was perfectly cooked. The dish came with lots of butter on the side. I got the mushroom & brie omelette, and while it was very well-made, I didn't really dig the combination of flavors. That might just be a personal thing, though. My omelette came with perfectly-cooked hash browns and buttered toast with what I believe was home-made strawberry jam. My only real complaint about my order was it came with a few pieces of fruit, and all of them were overripe and kind of yucky. Definitely not something to remove a star over.\n\nThe bill came up to just about $20, and we left stuffed and satisfied. We'll be back.", "author": "Lynae Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "I've only been here twice, but both experiences were fantastic! Really good food, good prices, a surprising amount of vegan & vegetarian options (vegan breakfast burrito, hollaaaa!), interesting art on the walls, and really friendly service. The second time I was here for Sunday brunch, the place was packed and the entire restaurant was alive with World Cup chatter and friendly hellos. Definitely a great community feel - love it!", "author": "Sam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-28", "description": "An average breakfast burrito with sausage. They seem very proud of their couple of third place contest/poll placements. Something to inspire improvement, I guess.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-15", "description": "Not much to offer at this restaurant, especially with so many better places on 24th.  On my last visit, service was incredibly slow (despite the place being empty) and everything had to be requested twice.  \n\nAnd the food only made the experience worse.  We left full, but entirely unsatisfied, just hoping to be hungry to get that taste out.  It's possible other items on the menu are better, but it's not worth the risk of going back.", "author": "Shanan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-12", "description": "Sun Rise Restaurant is an inauspicious nook on 24th St. that serves up classic American breakfasts as well as some Latin American specialties.  The menu has something for everyone, tofu scramble, omelets, chilequiles, sandwiches, salads, and dinner options that range from tilapia to pork chops and grits to steak ranchero.\n\nAfter tossing back some sun rise drinks up the street during the world cup games, we were in need of some subsentence. I didn't expect much from Sun Rise but they won me over with their yummy chilequiles sin huevos ($7.50) doused in a chorizoy red sauce and toped with queso fresca and crema; they were an ovaphobe's breakfast delight. The menfolk were also pleased with their omelet and  hash browns ($6.95), and combo breakfast that came with 2 pancakes, bacon, and 2 eggs.  \n\nOur waitress was very sweet and tended to our needs while the basic food served quickly (no wait for a weekend brunch table) hit the spot. 3.5 stars.", "author": "Candice L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-19", "description": "I was in town for a day and wanted to try a vegan friendly restaurant, so I went to Yelp and found Sun Rise.  Reviews sounded great.  Menu looked solid.  Then we went there and found the atmosphere very charming, the service somewhat lacking, and the food kind of plain.  I mean, I'm really glad they have vegan options, but it really was a disappointing experience.", "author": "Derek H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "As a Nicaraguan, I'm already used to this style of food, but I think anyone would appreciate its freshness and authenticity. One of my favorite brunch spots in SF. Delicious!!!!", "author": "Anon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "I was REALLY hoping to be the first to review this place but my husband beat me to it.... He'll get it later. I know where he lives!!\n.\nAfter spending so much time on 24th, I can't believe I've walked past this place so many times. Even more shocking....the little place was near empty at 6pm on a Sunday!!\n\nThis is definitely my kind of place. We are both vegetarians and have exhausted our list of exclusively vegetarian restaurants in this city. Especially in the Mission. So, every once in awhile we come upon a place that has a pretty extensive vegetarian menu and dive in this new one, head first! There are even a handful of vegan items such as vegan chorizio and tofu. There are even corn and rice pupusas for those with celiac / gluten intolerance. Their house hot sauce (Tapitio) is also gluten free\n\n\nOverall, there are so many types of options from breakfast, (starting @ 7 am and served til\" closing ) Tofu pesto, eggs benedict,, 3 different vegetarian omelets. The usual type of fare....Chilaquiles, Huervos Rancheros or Al Gusto if you prefer. Pancakes, toast, fruit , granola, eggs florentine, eggs duchess..... There are still sandwiches , salads and for dinner you can get the New York steak for 14.95. Their highest priced dinner on the menu. There is so much variety I could go ON, ON and still ON!!! Camarones, Tilapila, Milanesa.\n\nFor this particular dinner, I chose a cheese and spinach pupusa and I think it may have been the best damn pupusa I have ever had in my life. For one thing, I ordered a rice pupusa and was not charged extra. Another, they were extremely generous with both potion sizes and better ingredients used. Many, many other pupusa to choose from too...\n\nBoth food and beverages are priced quite well.  \nBreakfast & 2 pupusas = $11.50\n2 beers & 1 coke =          $7.00\n\nTwentyish with a nice tip came to \n$30.00..... Not too shabby\n \n\nOne more cool thing....Every 2 months the owner participates in the 2nd Saturday art walk and the walls of the restaurant are covered in eclectic art, all by local artists. This restaurant is very cute, clean and simple but with a very homey and comfortable feeling.\n\nEmbarrassingly enough I did not get the owners name but she was our food server as well. She was on it!! Very accommodating, very personable and seems great overall. I guess I'll get her name the next time we head back to Sunrise", "author": "Tamara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "Consistently good food, good value, and super friendly service. Food is in fact \"Latin American\" as I cannot put my finger on which country influences the menu the most. But it's great.", "author": "Fattfreddie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "I stopped by Sunrise Cafe to grab a quick breakfast burrito.  The food is amazing and the burrito was huge!  I split it with my roommate while we swapped stories of what happened the night before.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "Love this place. They have a really good and fresh breakfast burrito. I've been coming here for the past 3 days. Try the sausage breakfast burrito! The women who work there are really nice too. Really an great place. Would love to try it for a later meal sometime.", "author": "Sean P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "Waitress is hella nice and doesn't give my friend and I a judgy face for getting drunk off mimosas at 7am on a Tuesday, plus there are vegan options.", "author": "k h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-08", "description": "Got breakfast on a whim. I ordered their 'Sunrise Eggs.' 2 poached eggs, bacon, avocado and spinach on an english muffin. As many reviewers have cited before, the wait for food was pretty long. So long, in fact, that by the time my eggs came I was hungry enough that I was ready to eat whatever, rather than complain that my eggs were overcooked, and the rest of the food was cold. For nearly $10 I would expect at least one egg of two to be poached correctly. Food aside, the interior was charming.", "author": "Jake W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "when i first saw this places i didn't exactly have the highest hopes for it given that its basically a hole in the wall you wouldn't think of going into. but it completely took me off guard and blew me away.First the places was very clean and welcoming inside, The service was great. And the food was absolutely amazing. I had the vegan sopas and the vegan tamale. They were both exception. Im not the big fan of mexican food but their food changed my mind.", "author": "Cheyenne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-27", "description": "no frills, latin american home-cookin'.  the asada steak could use a bit more flavor; i'll be back to try other items on the menu!", "author": "Dennis D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "As soon as you walk in, you feel right at home. Service is friendly and the place is very \"homey.\" And the food quality will not let you down! Seriously a wide variety of hearty plates. Recommendations: the SOPA DE POLLO comes with big delicious chicken pieces and vegetables. The ZUCCHINI PUPUSAS are really cheap ($2.50) and taste sooooo good! Highly recommend =D", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-19", "description": "I don't know what the hype is all about, but I've tasted better food (at least Pupusas) from other Salvadorian Restaurants. The service was mediocre but the personality of our waitress leaves something to be desired. Not once did she say hello or thank you or asked us if we needed anything else... this from a waitress lacking in looks. A great personality can do wonders when short on looks. Go to La Santaneca de la Mission..much better place.", "author": "Will V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-24", "description": "dear sunrise, i. love. you. \n\nyes, there is usually a wait. yes, the service is slow. yes, it will take a while to get your food. is it worth it? HECK YES. \n\nif you are impatient, just avoid this place, really. no one wants to hear your whining and moaning especially on a lovely sunday morning when the place is at maximum occupancy. this is not a place to get all holier than thou, snap your fingers (who does that? really?) or expect some special service that only you seem to know about. the waitresses have never been anything but extremely friendly to me and fellow diners.. i would even go as far to say that i sometimes feel like a guest in their home;  it's that comfortable in there. \n\nand if you go on a sunday super stressed out, leave it at the door. just relax, WAIT, and prepare for your palate to be rewarded with some of the most amazing latin american food. well, the best vegan latin american food.. hands down. \n\nattention vegans!\n\nthey make the best soyrizo ever! i always get the veggie tofu (tofu scramble type deal with veggies, toast, and homefries), a side of soyrizo and a vegan tamale. my boyfriend gets the soyrizo burrito every time and we've turned several of our non-veg friends onto it.\n\ni try to come every sunday after dance class, and every sunday i end up looking 4 months pregnant after all the food i stuff into my poor (but totally happy) belly completely voiding the hard work i did in class. again, is it worth it? most definitely.", "author": "darcy a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-26", "description": "Noon on a sunny Sunday: Biked past the 20-minute wait at St Francis, skipped the 45-minute wait at Boogaloos, walked into a virtually-empty Sun Rise, had a killer brunch: eggs, beans, rice, cheese, plantains, tortillas and coffee for $10. Seriously great and seriously underappreciated.\n\nTo the folks who are giving this place low ratings: Look, this a Latin-American restaurant! Order Latin-American cuisine! Do not order the mushroom omelette. Do not order the granola yogurt. You will not be happy with the outcome. This is not a Denny's. The Mission is not the suburb you came from. Wake up and smell the huevos al gusto, or go home.", "author": "Tim J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-09", "description": "The food was delicious, plus you can get really tasty Vegan food.  I ordered the Vegan fahitas and my friend said that the vegan pupusas were delicious!  Check it out!", "author": "Lily B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-08", "description": "So my GF had just arrived on an overnight flight from DC and wanted to get some BK in the MD. So we hit up the yelperooni and sure enoughh got this reco. As always we trusted our fellow yelpers and rolled out to the sun rise spot on a nice sunny afternoon.\n\nBIG MISTAKE! \n\nDO NOT get the eggs benedict! Its more like eggs orange sludge coveredness! My GF was all like OMG WTF?! IT was sooo disgusting we couldnt handle it!\n\nthat and the food came like 5 hours late!\n\nIm sorry, Im sticking to the Fountain for my brunchy munchies!", "author": "Bobby F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "Great Price, Good people working with the community, art, vegan friendly and the best pupusas is Northern California!!", "author": "Jesus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "One of the best breakfast burritos in the mission. Nice service as well. The ingredients are good and it comes through in the taste. Not as greasy and fatty as most mission burritos. \n\nAnd it's right across from Phils!", "author": "Jakob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "chilaquiles are pretty much breakfast nachos.  you know that right?\n\nso so good, the nachos stay crispy even in the salsa type juice and the soyorizo and egg combo is just heaven.  not greasy at all!  it was my first time and i've been thinking about it ever since.  i compared it to the real chorizo my friend was having and couldn't tell the difference!\n\nsurprisingly, their lattes are also really oustanding.\n\ni'm definitely coming back!", "author": "Josie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "Nice brunch spot in the Mission.  Laid back - in a good way.  Tasty and crispy morning potatoes.", "author": "Becky G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "I don't want to rave too much about Sunrise on 24th because I love that I can always walk in and grab a table with no problems, but really, I love this place. \n\nI've had breakfast here many times and pupusas for dinner once-- never had a bad experience. I recommend chilequiles (think breakfast nachos--yum!)  or huevos al gusto with platanos for breakfast/brunch. They have a wide range of options on their menu, making carnivores, vegetarians and vegans happy.\n\nThey have local artists featured on the walls and the waitresses are very sweet and accommodating.  The crowd is unassuming and I like the tables by the windows because the sun comes in and warms you up as you watch passerbys on 24th. A comfortable and comforting place.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Service is friendly- like you went to breakfast at your aunt's house, and the food is delicious and simple.  Huevos al Gusto- delish.", "author": "Allie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-26", "description": "Would definitely eat here again!!!!\n\nIt's a 1st come 1st served situation - sometimes there's a wait, but they move people in and out quickly.\n\nMy friend had the Hueves a la Mexicana - so yum!\nI had the Platanos, frijoles negros y crema - so perfect, just what I wanted!\n\nGet coffee at Philz then come over here :)\n\nAlso, their mimosas come in pint glasses.  I truly enjoyed watching the waitress pour the thing halfway full of champagne, then top it off with some fresh-squeezed OJ.  Highlight!!!", "author": "Sara P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-16", "description": "I have been a regular at Sunrise on saturday's ever since it opened.  However, it seems that the quality of the food is gradually on decline.\n\nFor example:  A few weeks ago, the lettuce on my salad was starting to rotten.\n\nOn different days:  My pancakes had a sour taste to them. My chilaquiles had been salty to the point where I could not enjoy them.\n\nI have noticed that they have a loyal clientele on weekends.  Mostly local families of 4 or 5 per table.  However it seems that the owner does not realize this because she has not hired a helper and there is no way that two cooks and herself can run the business alone on weekends.  You can easily be waiting 20 minutes for her to take your order and another 35-45 minutes to get your breakfast.  It is also a task to get coffee refills.\n\nI really do hope this place improves.", "author": "Carlos M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-20", "description": "The service is friendly and fast, the owners run the show. Open at 7am, unlike the other 24th St breakfast restaurants. \n\nMany items are homemade. Especially all soups (although none are veggie) and the strawberry jam for toast.\n\nThere are TONS of vegetarian options, and the prices put it less than 50% of the bill at the St. Francis. Vegan Chorizo, tofu, and the usual bevy of meaty Salvadorian and Latino foods spot the menu. They are not limited though; Hollandaise sauce appears with Smoked Salmon to round things out. \n\nWe had a great time, an omelet and Spinach Pupusas for dinner, 3 drinks and the bill was 20 bucks!\n\nReally worth checking out!", "author": "Freud R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "How can you not root for a little Salvadorean dive that decided to paint the walls yellow and serve breakfast all day (bless their hearts)?  The results may not quite best Los Jarritos, but then, they're not going for the hearty, raucous diner vibe either.  At any rate, you'll find lots of vegan options (like soyrizo breakfast burritos), and great tamales and dinner dishes as well (case in point: the shrimp fajitas).  And don't forget some fresco de chan (basically fresh-made strawberry juice).  Easily overlooked in the jumble of odd and colorful shops on 24th St, which is probably why it still has a hipster-free, family-oriented clientele of locals (for now, anyway).", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "Love their pupsas! I would recommend their vegan fajita plate. Very tasty! The vegan breakfast burrito was kind of boring. They had a few other vegan options... vegan french toast and vegan tamales. Altogether a good brunch!", "author": "Philip R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "Really, really great experience. Wonderful vegan food, and a ridiculously nice waitress. The prices are something to watch out for, but overall it was a really enjoyable breakfast.", "author": "Eva J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "I can't help it.  Yes the service is still slow, but they are really nice people and you almost feel like you are hanging out at their kitchen at home, and you can't expect restaurant like service at someone's home.  The food is still very yummy, and they do a good job of providing veggie options.\n\nDeal with the wait and enjoy the food.  :)", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-21", "description": "This place is awesome and opens at 7am on Sundays. Great b-fast burrito and my eggs with chorizo were awesome.", "author": "Richard I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "Wonderful neighborhood breakfast cafe. My kids and I thoroughly enjoyed it (and they are often hard to please). The food was fresh and delicious. My kids are not vegan but I am and I loved that they offer vegetarian and vegan options on their breakfast menu! What a treat!", "author": "mara t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-13", "description": "The pupusas here are delicious and cheap, there are lots of vegetarian and vegan options, and everything tastes great. Awesome restaurant, laid back atmosphere, and a good place to watch the World Cup while you eat. Highly recommended.", "author": "Will M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "This is it - have only been here a couple times and yet, some of the best pupusas I've had, SUPER nice service and delicious other dishes = 5 stars, yo. They also have a special during mission street fairs on first fridays - $3 for 2 DEELISH pupusas (not like they really need to be cheaper). Go for the loroco with cheese! Only downside is that the sauce is not as spicy/garlicky as I've liked it other places, but that is seriously the *only* downside. Enjoy, folks!", "author": "Ara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "We hopped out of the house without any breakfast, on a donut mission, and on the way back, decided to try Sun rise, because I remembered it's supposed to be good for breakfast. It was probably around 1pm on Saturday, and we were seated right away. This place is a mix of latin American and American food. There were a lot of egg options and some vegan options too, for you vegan people. I noticed they even have vegan French toast. Both of us had the huevos al gusto, which I thought was an egg scramble or an omelet or something, but it wasn't (I liked it anyway). Honestly, I picked it because it was the only thing that had plantains in it (although you can order them as a side). You get laid out separately on a plate: two eggs, made whatever way you want, plaintains, fresh cheese, sour cream, salsa, and some yummy beans and rice (that beans & rice was soo good). Plus a side of 3 hand made tortillas to eat them with. I didn't have a big appetite and by a little after the first tortilla, I was getting full, but I pulled through and ate almost everything. Roomie ate all of his and felt hungry still. He liked it, but felt maybe it was a bit too homestyle for him, like we could have made it. I reasoned that we probably could, but when do we ever make beans & rice, or fry up some plantains? Never. He conceded my point. We both did enjoy the dish and prices were very cheap ($8 for that egg dish), it cost about the same for 2 breakfasts here as it did for half a dozen donuts up the street. Service was friendly, and there were other things I'd definitely try. The one thing neither of us liked was the chai. It was too sweet, it tasted like it was a mix. I couldn't finish it. There was no spiciness, no bite, although they did make it with soy for us. Do go there, do try the yummy food and friendly service, don't order chai. Oh, and I think they serve breakfast all day, but not only breakfast. There is regular lunch/dinner food here too, I should have tried their papusas.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-05", "description": "Meh-inspiring breakfast for a not so cheap price. Potatoes were bland, \"fresh fruit\" means more like 1 apple slice and 1 orange slice. On the plus side, the serving of orange juice was healthy and the coffee was decent. Over all, would not recommend.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-09", "description": "This place is great.  The food is super tasty and affordable.  It's a great breakfast joint if you want to skip the wait, and the woman who runs it runs all sorts of benefits for causes in the area.", "author": "Gabby G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "love, love, love this place! went for the first time and the soyrizo burrito was amazing! everything on the menu looks delicious and I'm definitely going back!", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-28", "description": "This is by far my favorite place to eat breakfast, brunch, or lunch. I've never had dinner there, but I'm sure it's just as delicious and well priced as the other meals. This is my 'go to' place for friends in town, and where me and the roommies go for brunch on the weekend. There's great options for all dietary needs meat eaters, vegetarian and vegan. Beware the breakfast portions aren't huge, but definitely enough. Fried plantains best I've had in the Mission. I've never had a problem with the service, it's always been speedy, but I always pay by walking up to the counter. Extremely friendly service, and great ambience, I love the paintings on the wall, that I think are done by locals and are switched out every so often.", "author": "Jocie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "My SO and I had walked past this place a million times and finally stopped there for breakfast a few weekends ago and have since been back with friends.  The food was delicious (everything we ordered both times), Including the vegetarian food that I ordered.  I was impressed with how many vegetarian and vegan options there were on the menu.   The food was an excelled value for the price, and best of all the place felt sunny and cozy even with the rain pouring down outside.  I can't wait to share another breakfast with friends at this place.", "author": "Katie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-30", "description": "It had a nice atmosphere and the service was nice, but the breakfast burrito I ordered was kinda small and not that good.", "author": "simon m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-12", "description": "I think I found my new weekend brunch location when I'm hung over and in no mood to fight the crowds at St. Francis or Universal. We walked in here around noon or 1ish on a Sunday and there were only maybe 2 other parties in there. Service was a little on the slow side but they were always happy to refill my coffee. I ordered the Sunrise Eggs, which was poached eggs with avocado and spinach on english muffin. Light and satisfying. The homefries could have been a little crispier but that's a personal preference. My roommate ordered a dish with eggs, plaintains, beans, and tortillas and that looked really good. Definitely planning on going back!", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "The food is really tasty, really reasonably portioned, and really sensibly priced. The server (maybe also the owner), Alba, is so very sweet. I usually get pupusas (minus revueltas) which are, to be fair, delicious as all get-out no matter where you go. Sometimes tamales. Today I had chilaquiles with soyrizo, topped with a little sour cream and a good portion of some very enjoyable queso fresco, plus a glass of horchata. The place is rarely crowded, and even so no one hovers over you. It's a very peaceful little kitchen to which I find myself returning time and time again.", "author": "Hannah V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "This is hands down one of the best breakfast places in SF! Anything from the Latin American side of the menu is sure to be outstanding. Lead chef and co-owner Alba created her menu to also be very healthy so you won't find this food overly greasy! The Pupusas are especially good because of this.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "Incredible find in the Mission. Went for Sunday brunch at about 11:45: sat right down, service a little slow with ordering and drinks, but the food came out quick and hot. Had most of the vegan items on the menu: amazing breakfast burrito (do not miss the soyrizo), french toast with fruit, tamales, spinach pupusas and plantains. I thought we were ordering too much, just so we could try lots of different things, but the sizes are smallish, so it turned out to be the perfect amount for two hungry people. Incredibly delicious across the board. Definitely worth the trip.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-04", "description": "i got the chilaquiles and a side of plantains. so amazing!! and all these prople complaining about service? impatient! the chilaquiles are worth a short wait.", "author": "Wes B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-19", "description": "Came here with brother and a friend of his to watch the semi-final world cup games. I ordered the chilaquiles which came with sour cream and refried beans, and coffee. The menu has some vegan options too, including vegan pupusas made with beans and zucchini. The owner was friendly and attentive, offering to refill my cup of coffee in between my yelling at the screen. All in all the best way to wake up early: semi-final soccer match, black coffee, and a comforting dish.", "author": "X marks the spot .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-12", "description": "Awesome, cheap brunch! The chilaquiles are particularly good. The service was friendly but not exactly with it. On the plus side, the waitstaff doesn't seem to cafe if you bring your Philz in with you :)", "author": "Anonymous F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-19", "description": "I'd call it a best kept secret, but by the looks of things, it looks like the word is out.  Every time I visit  it seems a little more crowded and the day is fast approaching when I'll actually have to wait for a table.  While my selfish side finds this a little upsetting, the people who run the place are super-sweet and they do a great job, so I wish them all the best.  \n\nThis is a perfect spot of a quick (for now) yet filling breakfast when the rasberry rosemary bread at Philz(across the street) won't cut it and you don't want to stand in line (or your're not feeling hip enough) for St. Francis etc.  THey've got a fine selection of American and Mexican breakfasts and everything is always delicious, although I rarely venture far from my standby: Huevos al Gusto, which includes, eggs, rice & beans, queso fresco, corn tortillas, and plantains or avocado  It's like 7 or 8 bucks and hits the spot every time.  Throw in a large OJ and you're primed for a good day at around $10.  \n\nMark my words, there will be a wait soon.  GO!", "author": "matthew r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-01", "description": "I had the eggs florentine. They were really gross. everything was soggy accept for the eggs that were like tennis balls. It was wrong on so many levels. The service was really bad which I can generally excuse for great food but it seemed like the only redeeming quality to the food was that there was plenty of it. Too much of a bad thing anyone? My girlfriend loves the huevos rancheros so I may have to give it a second shot and steer clear of the hollindaise.", "author": "Dian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-08", "description": "I went in once when they first opened and was disappointed.  They must have been just getting things figured out, because every time I've been back since has been wonderful.\n\nTheir breakfasts are wonderful.  I had the chorizo scramble this morning, but with soy chorizo.  It was incredible.  A huge portion of black beans and fresh mexican cheese along with it.\n\nTheir pupusas are really nice, though having been to Central America, I'm rather picky.  Fresh salads, nice art, and never too crowded.  I totally recommend this place.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "definetly one of the best latin american places in the mission , food portions for the price are really huge and the quality makes the whole experience amazing , had lomo al gusto i think it is a new dish on the menu , rice is perfect and different thick and moist , amazing black means, they have home made french fries ,yes you heard no costco bullshit, ceasar salad had a whole chicken on it for not even 7 bucks , great great place will definetly go for breakfast , heard good things about that", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-07", "description": "Arrived at 9:15 in a rested mood. Was not acknowledged at the door. After ordering, server forgot to bring the OK coffee and water to our table. I could had made better coffee with my jar of Classico Nescafe. Latin breakfast include too much beans. Had to eat tortillas to fill me up. Maybe we showed up before the owners arrived. Looked to be busy as we left. Could be just a bad meeting. Never had a bad meeting at El Taco Loco or Chez Maman. My father felt bad and it was not his fault. Will do better next weekend at another place.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-04", "description": "Good breakfast.  Only thing I knock them down a star for is service, because it was rather slow considering we were one of 3 tables there. But the chorizo and eggs, plantains and beans were the shiz!  Papusas rocked too.  Just wish we could have gotten water refills sooner, thats all.  Good and uncrowded otherwise.  They take cards too!", "author": "Suzanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-19", "description": "The only thing I've had here is the their pupusas. We used to buy lunch from them every saturday but have since migrated toward El Farolito. The pupusas are good, nothing to rave about. I think we kept coming back because they only charged us $1.00 per pupusa. You can't find a cheaper pupusa anywhere else.", "author": "Erika A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "My brother and I took a morning trip into the mission after having read great reviews of this place on Yelp.  Being a vegan, Maeve C's review about the vegan breakfast burrito really called to me.  We were STARVING when we got there, I ordered the burrito and the vegan tamale as a side.  Very cute little place, brightly lit and a sunny color scheme.  Great service, food came quickly (although not very crowded as it was a Monday around 11:30).  My brother got the Sun Rise Eggs.  I LOVED my food, not too greasy, very filling and satisfying, great flavors.  Bro really enjoyed his too although not as crazy as I was about mine.  Whoever wrote that the trick is to order Mexican and not American must be right.  Anyway, VERY reasonable prices and in a nice location.  I would definitely go back; I don't live in SF but I'm sure my brother will and will take his girlfriend.  Would love to try the vegan french toast next time.", "author": "AnnaKarina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "Sun Rise is great for a number of reasons. I tend to always get their huevos al gusto, which is an awesome breakfast of eggs, rice & beans, corn tortillas, fresh cheese, sour cream, fried plantains, and salsa. DELICIOUS! If you've ever ordered a basic egg breakfast and ended up with a boring plate of food you could've cooked at home, this is the antidote. My roommate got the chilaquiles which was also amazing. Finally: no line, no wait on the weekends, which is greatly appreciated in the Mission at brunch-time.", "author": "Anna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "great pupusas and pastel.. oh ya and yuca!", "author": "Art A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "Fantastic!!  Delicious food, heaven for vegetarians looking for stick to your ribs food.  Had vegan chorizo, plantains cooked perfectly, beans, and rice pupusas.  Yes, you heard me, rice pupusas, which are extremely hard to find unless you are eating in someone's home.  The vibe was mellow and warm, the service was good and did I mention that the food was absolutely delicious!!  Solidly priced and delicious.  I've found my new spot!", "author": "Tonya A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "A for effort with the vegan and vegetarian options. Now if someone could really show them how to make a tofu scramble (with nutritional yeast) and actually spice up the vegan burrito. It's great to see this place transitioning while so many small restaurants on lower 24th are going out of business these days. The atmosphere is really nice and the service is great. If you live in the neighborhood give it a try.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-20", "description": "Great alternative place for brunch.  Good prices and friendly staff.", "author": "David A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-23", "description": "The dishes was small, and the taste very plane... The worse bathroom in the world", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Greatest breakfast in San Francisco! This is a fantastic restaurant, that has a really genuine family feeling to it. Their Huevos al gusto with plantains will knock your socks off. But don't take my word for it. Get your butt down there and say hi to Alba. She'll treat you like royalty and feed you the best Salvadoran breakfast known to man.", "author": "josie b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "oh brunch...let me count the reasons why you really are my favorite meal...i love you for the crispy plantains, the fluffy eggs, the rice and beans and the fresh salsa...what a great way to start my day.", "author": "hollie m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-26", "description": "i went to this place once and i ordered a regular breakfast like sausage eggs bacon toast. when i tried the sausage it tasted like bull crap i only got one egg and my bacon was burned. the only good thing i had from that breakfast was toast. heres a reality check dont be cheap  or people will not come back.", "author": "Roger J."}
