{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Went to SF for my husband's birthday and to visit with my family.  It was a weekday and my brother-in-law picked us up at the airport at 9am as we caught the first flight out to SF.  BIL asks if we want to go to brunch, \"there's this whole-in-the-wall place that I go to all the time, its CHEAP and its really good too!\" He's saying all the right things and of course, we're in, plus this gives us quality time to spend with him before he drops us off at his house to run errands.\n\nBecause of the time of day, we make it from the airport to the restaurant in 15-minutes.  Street parking is the only option as this is a neighborhood joint. People walk from their homes, school and nearby businesses to feast here.  Because this is BIL's frequent stop, we park at the Safeway across the street and like city folk, we jay-walk.\n\nSo we walk in and I look up at the menu and exclaimed how cheap it was as the lunch special beef broccoli was only $3.75! So my BIL was like, no you can't order from there, order from here and points to the menu on the front window of the counter. Which was still a good deal. I opted for the longanisa plate at $3.75 while my BIL got bangus (fish) and my husband got the tilapia plates.  Including, coffee, our bill was $17.  Cash is king here.\n\nService was quick.  My husband went to the market next door to check it out and in less than 2-minutes, our meals were delivered. And the food was good too. I've never had a sliced tomato with longanisa before. Of course my BIL enjoyed his meal as he orders it all the time and my husband did a great job of digging into the tilapia as they serve the entire fish.\n\nBut I still wondered why I couldn't order from the menu up above.  My BIL says that the menu has been hanging there for the past 30-years and through the different owners. They just haven't taken it down or removed any of the menu items or the prices. It's quirky but makes for a good story.\n\nMy BIL told us that this place gets busy at lunch because the high school kids at the school nearby come here for lunch.  And sure enough, 10:30 am, 8 people came in all at the same time.  The restaurant is small, so the 8th person in line stood at the very entrance of the restaurant.  If a 9th person came, they would be standing in line outside the entrance.\n\nThe city in the older suburb areas has many of these type of restaurants. This certainly made for a great start to this visit to SF.", "author": "Edith S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "My Second visit here after hearing a lot of hype from my colleagues... My first time about a year or 2 ago wasnt that memorable... So let start fresh from what i ordered today... \n\nBoneless fish over garlic rice... It comes with 4 chunks of pineapple  and over easy egg...\n\nGarlic Rice 5/10\nBoneless Fish 5/10\n\nThe only Positive when you see their menu, all menu items are so affordable. Pricewise, I gave them 10/10.. and thats the only reason I can give this merchant a 3/5 Stars...", "author": "Dedy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Superstar Restaurant is just a few blocks away from its sister restaurant, Gateway Kitchen. Gateway is closer to my place but since it was closed on a Monday, it was an opportunity to give Superstar a try. \nI was glad I did go the extra mile because I thought Superstar was a bit cleaner. I mean yeah it is small and old like Gateway but the kitchen, floor tiles and windows look cleaner to me. \n\nAnyway, I really like their HK style porkchop. It is 2 pc of porkchop that is battered and fried to crisp. For $4.75, it comes with lots of garlic rice, 1 egg and a choice of tomato or pineapple. I have tried their tocino and bangus but HK pork really is their best seller! \nPork fatty crispy goodness for that once in a while cholesterol craving! \n\nP.S. - Come to Superstar instead if you like tomatoes. Gateway only serves pineapples.", "author": "Nice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Super cheap and tasty rice plates. Ordered the pork chops Hong Kong style, added longanisa, and got it with tomatoes and pineapples. The food was busting out of the box. The pork chops were thin and super fried. Would probably just get the longanisa next time and perhaps try the other items. With a coconut drink, meal came out to be less than $11.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "The front says Chinese Fast Food, but it is Filipino food.  I had spamsilog and bangsilog (they had 3 different kinds: regular with bone, baby bangus, and boneless smoked).  Less then $11 for both.  Don't be thrown off by the plain front facade.  Inside is good cheap eats!", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Update: still hella freakin love this place!! I officially like this place more than Gateway.. yes I know it's the same thing but this place just does it better. The rice taste better and for some reason the batter on their Hong Kong style porkchops is better too! I also like how they serve \"sabaw\" (soup) with the meals now.. not sure how much extra it cost but it adds on to the Filipino type meal. Location wise, the seating is better and more spacious, less dirty looking too lol. But yeah, still can't beat the price and portions at both places.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Talk about a bang for your buck! Any of your favorite Silogs (garlic fried rice, egg, side of pineapple or tomato, and choice of meat) for under $5... Can't beat that.\n\nMy favorite here is the Hong Kong style pork chop. The pork is battered and fried to a beautifully crunchy golden brown. This as your meat choice in your silog comes with 2 pretty large pork chops! \n\nBeen coming here for years now and staff hasn't changed. The tall guy at the front is always so cheerful and inviting.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "I can't believe I never been here before!!! I always wanted a nice, delicious Filipino breakfast but didn't know where to go -- but i do now! I came in here on a Friday morning just before 9am, ordered two longanisas meal to go and it's delicious!!! Super affordable and it's a small comfy restaurant. Would definitely come back here again for breakfast!", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "Hongkong style pork chops, well-done fried egg, oily garlic fried rice, and a side of tomato slices at $5 and change is a guilty pleasure I succumb to once in a while. For sure I have eaten better tasting pork chops at home but hey, this one is instant gratification about 10 minutes after ordering.", "author": "Irene B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Large quantity for a low low price! This is what you call a hole-in-the-wall.  Many of these items on the menu are under $5!\n\nI ordered the order with popcorn chicken, garlic rice, side of pineapple/ tomato, egg, and coffee/ tea. In another order, it was the same combo only with longanisa. This took maybe 15 mins since it was also lunch time. When the orders came, it was huge! The portion sizes for that price is so worth it and a huge plus!\n\nThe restaurant from the outside to the inside is worn down, small, and old but the food and service makes up for it! Definitely come try this place out!", "author": "Jeanette Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Superstar is another good classic hood spot. If you're on a budget or just feel like getting some good Filipino food, go here. All the plates are $5 or less. You get your money's worth no doubt about it! \n\n4 stars because it's not the cleanest restaurant. But it's not so dirty as to scare you out the door. If you can get past the tough exterior, you will see the food is surprisingly good! I will be back.", "author": "Manny R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Superstar has been in the excelsior district for as long as I can remember. One of the local favorites, known for its delicious cheap food. A small hole in the wall that has the same interior since forever! (Literally, the seats are the same they have the same holes I remember when I was younger lol) \n\nSuperstars most popular dish is the Hong Kong style pork chop. For around $5, you get two very large Hong Kong style pork chops with garlic fried rice and tomato or pineapple. The portions are HUGE you really get the bang for your buck. Hong Kong style pork chops are the delicious greasy food you crave after a long drunk night out. It will definitely recover you from your horrible hang over. I highly recommend. \n\nMy second fave is the longsilog. With 2 or 3 longanisas, garlic fried rice and tomato or pineapple, it's a child favorite of mine. If you haven't tried the sweet and savory red sausages called longanisa yet, you have to try! \n\nAlthough superstar doesn't have the beautiful ambiance, locals love this place for the food and it pretty much speaks for itself.", "author": "AJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "I grew up eating this food. It's a small mom & pop style restaurant known for their Filipino silog dishes even though it's run by Chinese folks. What are silog dishes? Your choice of protein, garlic fried rice, and an egg all for a very reasonable price around $4-5. Cheap eats I tell ya!\n\nWhen in doubt, go for the HONG KONG STYLE PORK CHOP. Also, you can choose between tomatoes or pineapples as a side to cut through the grease. I recommend picking up the food because the restaurant is dark and cramped.", "author": "Christene M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "The restaurant is actually a hole in a way. It is right across from Safeway. If you can't find it stand in front of Safeway and look across the street. This is one of my favorite places to go for a quick and cheap meal. It is a Chinese/Filipino restaurant. They are the sweetest people ever. Service is ok, a standard quick service restaurant. It is not the prettiest place and there are not a lot of tables but the food is amazing. They make the food quick and it gets very busy during lunch. People usually order to go. \n\nThey have huge portions and everything is around $5 and under. They have Filipino breakfasts for around $3.50. I like the Hong Kong style porkchop, tapsilog, fried chicken, and bangus (it has bones). Each meal comes with garlic rice, fried egg, and either chopped tomato or pineapples.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "I was trying to get breakfast for my bf and I early in the morning but our usual spot was not open for some reason so i resorted to this place. My friend told me that it was basically the same as my usual so I decided to give it a shot. The price was fair but the food was not good. I ordered the longanisa and the tacino.... The tacino tasted so weird and gross that my bf didnt even want to eat it. Normally tacino is suppose to be rich in dark red color but it was pale brown... the longanisa literally just tasted like a filipino hot dog that you put in the spaghetti. Im a huge fan on longanisa and it didnt taste like it what so ever. I will not be going back to this location.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Cheapest lunch plate you'll find! Plates usually run about ~$5.00. I will always come back to this hole in the wall.", "author": "Ardee A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "5 stars for EPIC and CHEAP meals !! \n\nWho wouldn't want Topsilog w/ Extra Rice and a side Soup (Beef Broth) for like $6.50?! \n\n#WIN\n\nThe place is not clean like most people look for, and the the service maybe too quick and because of it folks/workers can be considered \"Rude\". But we must remember that when t comes to the requests of our stomachs, it is all about the TASTE and the QUALITY! \n\nIf you grew up Struggling Financially, Lived in the Ghetto, or had a hard time trying to find a way to survive, food places like here is what you would call LUXURY! :) \n\nLike I said, the Customer Service or Cleanliness of the place is not all that great, but in terms of QUANTITY and TASTE plus the PRICING of the food, it is a STRAIGHT UP WIN if you know how to be THANKFUL !!", "author": "Erito S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "I been going to this place since I was little . I never really appreciate this place until I got older . Filipino breakfast and it's cheap and it's very fulfilling.  The place is pretty small and street parking ..", "author": "Ciara F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Hubby took me while on our vacay to nor cal. He has been talking about this place for years. ( he used to live in San Fran). \nI have to admit the food is bomb ! The area is a bit sketchy, parking is bad. And if you eat your to go food there, they will charge you. Lol. No biggie. Still worth it. Wish we can find somewhere in Oc that has their hong kong style pork chops but I doubt we will ever be able to find somewhere comparable !", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Forever a gem in my heart!!!! \nYou have to order the Hong Kong style pork chops with a side order of friend chicken. Their prices are still hard to beat and the quality of food never changed since I was a kid. If you like Filipino style breakfast... come and patronize this joint.", "author": "Summer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "If anyone needs their fix of a Filipino breakfast, I would suggest you to make your way out to the city asap. I travel all the way from the East Bay to get my favorite, Hong Kong style pork chops. \n\nIf you thought that your local Filipino restaurant had delicious food, you were mistaken. This restaurant may not be the best looking, but looks can be deceiving sometimes! It's a hole in the wall restaurant that only locals know about. From their longanisa, to the tocino, to the pork chops, to the fish, etc... Everything is amazing.\n\nWhen I first went there, I never thought that I would've enjoyed the food so much. They cook everything perfectly. The pork chops are never dry or over cooked, the longanisa and tocino is juicy, the fried rice isn't too salty. The prices and portions are another favorite of mine! For a plate of your liking, its about $3-$5 at the most. The portions are huge. If you can't finish your brunch, you can always take it to go and it still tastes the same or even better later! I usually order the hong kong style pork chops with a scrambled egg, rice, and tomatoes on the side. I dip my porkchops in vinegar and soy sauce. \n\nIf you're ever in the mission and come across this restaurant, do not sleep on them! If I lived closer, I would probably be there every morning if I could. The only day they are closed, are Sunday's, so make sure you have your back up to go for that day if you're craving needs to be filled.", "author": "Adrianna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "4 Star for Superstar\nFOOD IS GOOD! \nServings is alot cant go wrong on this place.. \nfave is Bangsilog (boneless Milkfish) & porkchop\nits cheap and Delicious \n\nthe location by top of the hill chef & server are the most friendliest Chinese server i have ever encountered lol..\n\nThe missing Star is for the Place, i wish they move to a bigger and cleaner place that is all.", "author": "Prinxez L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "For the price, this place cant be beat.  Hk pork chops n the salty eggs are my favorite.  If your hungry for greasy food and short on cash this is the place for you lol.", "author": "Hugh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "I'd consider this restaurant to be another hidden gem. The food is very delicious and their service is fast and easy. I ordered the Hong Kong style pork chop with a side of salted egg and I really enjoyed it! I would definitely come back here again! I recommend this to anyone looking for some authentic Filipino food.", "author": "Cenon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "When it comes to affordable food, this is the place to be. For full meals under $5, you will not be disappointed. Food entrees include filipino breakfast which is priced at $3.50 and I believe the most popular dish would be the hong kong style pork chops for $4.50. The meal includes 2-3 large pieces of pork chops, garlic fried rice, a pan fried egg and a choice of either pineapple pieces or tomato chunks. \n\nHowever, the food here is unhealthy. Everything is drenched with grease and the food options are pretty much similar basic food items mixed and match. This is something I would come here once in a while but not on a regular. Also the business hours are limited. Weekdays, it closes at 430pm and on Sunday it is closed all day. I think this would be a great location for the late night munchies.", "author": "Auden W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "cheap. delicious. fatty. san francisco staple. pardon me- san francisco native staple. \nhong kong style porkchops are the best. bangus silog if you like fish!!!\nit's a hole in the wall so don't expect anything fancy but do expect a bargain for your buck!!!", "author": "Marian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Wow!\nWhat a place to get good low priced Pinoy food.\nThe staff are the original workers who cooks and serves the food.\nThey are super friendly and fast!\nI love this place!", "author": "adam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Beef Tapa is my favorite ! Garlic Fried Rice , egg n tomatoes.  ONLY  $ 3.75 !!! \nBEST VALUE ANYWHERE. \nFood tastes great n even if you only think it's ok for 3.75 it can't be denied as a must buy.\nWINNER ! MUST GO.", "author": "Pure M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "I was skeptical at first that the items were _too_ cheap: surely these must be appetizers, or really small portions? So I ordered 5 things for pickup to feed 3, just in case.\n\nI could not have been more wrong- we ordered a feast! A very cheap feast. $20ish and we ate well for lunch and dinner.\n\nThe menu is quite simple: pretty much entirely garlic fried rice + egg + [insert meat/fish option] + tomato or pineapple. We ordered a pork chop, fish, chicken, beef and cured pork. Of those, the winners for us were the pork chop and chicken. Those dishes also happened to be the most generous portion sizes. \n\nIt is a bit greasy and salty (which seems on par for the cuisine, not their fault) so it's probably not a regular stop for my health's sake, but definitely on my list when I'm craving a big, flavorful meal on the cheap.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "It makes me sad that this place is only open till 4, but regardless this place is amazing.\n\nHomestyle filipino cooking and crazy cheap!! Great for a quick breakfast or lunch and the service is super quick!!", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Cheap, fast, good, and the portion is more than what you pay for- very good thing! This place has been for years, I always go for the Hong Kong style porkchop with tomatoes, egg, and garlic rice. \n\nI high recommend and suggest you try this place for Filipino breakfast!", "author": "Regina Rose S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-14", "description": "This is a cheap eat place but if you like Filipino food must be good food to you, but am not familiar with Filipino food and ordered a meal they said is fish, think is fish skin, I should have asked before place my order.  The food came, it was fish skin deep fry with some rice.  For me, it is hard to eat but to some maybe is good.  I am not fuss over it after all only $5.50, I left it unfinished. I see lots of people come in, so this must be a good place just that you need to know what to orders.", "author": "Kitty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "This is a little whole in the wall Chinese restaurant that's know for serving Filipino food! This place isn't at all the nicest place too eat but the lady at the register is super nice a patient,  but they got some good food for really good price! I got the Hong Kong Style fried Porkchops which came with an egg and rice. My wife got the tapsilog which was pretty dry I don't recommend, and my daughter got the spamsilog which is hard to mess up lol! I spent less than $14 and my wallet was happy for that. They also serve regular Chinese food here too but I didn't try it, everything is cooked to order so it's fresh too! Anyways for what it is 4 stars for this place.", "author": "Elvin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "I love this place! Before you go, remember to bring some cash and some coins to pay for the meter on the street. The portions are HUGE for the price - it's literally hella cheap. I always go for the hong kong style porkchops with occasional side of tapa. This comes with garlic rice, an over easy egg, and you have the choice of tomatoes or pineapples. I recommend getting it with the pineapples though! You have to dip the hong kong style porkchops using the sauces provided on the table: vinegar, soy sauce, and salt/pepper. I usually just mix the vinegar and soy sauce together and it tastes sooooooo gooooooood! \n\nYou shouldn't expect to enter some nice restaurant - it isn't the best in terms of cleanliness, but their food definitely makes up for it! It's a really small restaurant that seats about 10-15 people, so most people take it to go. If you do order to go and you eat it inside, they charge an extra fee. \n\nI somehow always crave Superstar when it's closed.....on Sundays. I definitely have to make a stop by here sometime soon because I haven't had it in a while and I'm craving it!!", "author": "Sydney C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Still the same as I remember when I use to work in the city 8 years ago! Great complete meals for a great price! Have to try it at least once. Hole in the wall! Always the best places!", "author": "Jose R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "It was my first time to eat there in their restaurant BUT it was a disaster store. As you enter the restaurant, all the tables and chairs are not clean. All the condiments are not also clean wherein you will see the bottles are very dirty. Their menus are not presentable to the customers every time they will place their orders. You will see a lot of papers and other things are inside their see through cabinets as you place your order. There is no special when it comes to their food even if the price is cheap.", "author": "Darem A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Crispy and delicious fried pork chops with garlic fried rice. Cheap and filling. Probably not healthy but was good to eat.", "author": "tomohisa w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "A true hole-in-the-wall type of restaurant! This place is tiny and hidden under the sign from next door. I've passed by here many times but never seen it. I decided to try it out when I found it on yelp!\nThere were any tables open when we got there but one cleared out pretty quickly. The menu is a little confusing, we were looking for the filipino-style breakfast and it was on a paper menu hanging in front of the counter. The food took about 15minutes to come out, which isn't too bad. \nLongsilog ($3.50) came with longanisa, garlic fried rice, egg, and tomato (or pineapple). The longanisa was really good and it came with a decent amount of food at a really great price! Next time I would get two more pieces of longanisa for $2.50 extra. \nTapsilog ($3.75) came with beef tapa, garlic fried rice, egg, and tomato or pineapple. I really liked the beef. It was thinly sliced and perfectly cooked! I loved the garlic fried rice and the over-easy egg was perfect. They didn't ask how we wanted the egg cooked but I like my eggs over-easy so I don't have any complaints!\nI have to come back to try the Hong Kong-style pork chops that everyone talks about! The food here is good at a great price!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "I used to live here in south city 16 years ago use to come to this place all the time after work at FedEx. A buddy of mine took me here and love it since. Moved away been craving it for 16 years finally came back to visit and brought my wife and son and they two agree with me that this place is off the chain wish they had one of these in Orange County. It's great to see nothing's changed as if time stood still Hong Kong style pork chops are the Shiznit's! I left my heart in San Francisco i'm gonna miss you the most superstar Hong Kong style pork chops!", "author": "Leo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "A true hidden gem.\n\nIf you're craving delicious (Filipino style)  food with great portioning and all under $5, this a must go!\n\nYelp only allows ratings of 5 stars, but this place for sure deserves more ! Hence their name", "author": "Derica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "If I had to chose a meal before I die, this is it. I could eat this every single day. My go-to order is the Hong Kong Style Pork Chop with fried rice, fried egg, and side of either tomato or pineapple.\n\nThey actually close at 5pm, not 4:30pm. So you have an extra 30 minutes to race over after work. You can call and place an order too to save yourself some time and bring cash! $5 will get you some good quality food here.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "Been coming here for years and I recommend everyone that is in the area to try out SUPERSTAR. Thank you for the reasonable prices, large quantities, and delicious food. No one can match your garlic fried rice or Hong Kong style pork chops", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "The absolute cheapest silogs you can find in the area. The dishes are good and hits that spot for it's price of less than $4 (yes...FOUR DOLLARS). A few bucks gets you a decent size cup of garlicky fried rice, a fried egg, your choice of either tomatoes or pineapples and your basic main silog dish; tocino, tapa, bangus, longanisa, tilapia, fried chicken and porkchop.  \n\nLazy? On a budget? Wanna just grab and go? Superstar is truly a neighborHOOD dive, hole in the wall type drive-by... but they're quick, friendly, cheap and the food is legit....SCORE!", "author": "Resa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "This secret gem is across from the Safeway on Mission in the Excelsior. It might not look like much, but if often has a line out the door for a reason. I suggest the Hong Kong style pork chop. The value for money is unbeatable, coming in at like $5 for 2 pork chops, rice, pineapple, and a fried egg.", "author": "sean d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "One of the best small family business hole in the wall that serves big generous delicious Filipino/Chinese grub. It's walk-up ordering and cash only for great inexpensive prices. Don't forget to tip the elderly women as servers, and you'll get a grateful smile :)", "author": "Carmel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "For a small restaurant, this place makes the best fried pork chops ever. I love this place, it seriously does fill you up, I always get Hong Kong style pork chops and a side of longinisa. The customer service is alright, I remember when I asked for some more little sauce containers they were seriously so CHEAP about it? Like why? I just wanted two more. It's so tiny... but overall it's pretty good.", "author": "Ritney N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "This place can get crowded at times but it's so cheap and there is no long wait for your food!! AWSOME service!!!", "author": "Josh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "so good + cheap! say no more this is it if ur looking for filipino breakfast food this is the perfect place to go", "author": "Carla N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Amazing. If I were to choose one word to describe this hole-in-the-wall restaurant that serves primarily Filipino and Hong Kong styled food, it would be amazing. This place is affordable and the portions are gigantic, which is a a huge plus for in college, it will only take about five dollars for you to get completely full here! The food although cheap is very delicious, many if not all the options on the menu are authentic Filipino or Hong Kong style dishes made fresh and quickly for you after you place your order. \nThis place also holds a special place in my heart because it was my of choice after a long high school days, even now as I attend college 300+ miles away it still is my restaurant of choice whenever I am back in San Francisco.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "This little hole in the wall restaurant serves up Filipino food with some Hong Kong style. The first thing that pops out is its very old interior and exterior, but looking past that, the food prices are very cheap. For under 5 dollars, you get a fat plate of food. The food itself is very good! Very authentic! I recommend the Ticino and Hong Kong Pork Chop! \nThe staff is very friendly. \nThis is the place I use to go to during high school for a lunch and even now, it is still my go to restaurant of choice.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Hole in the wall, but I Love this place. Been going here for many years. Best bang for the buck! Also, really tasty.", "author": "Mel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Although this is not a filipino owned restaurant they make a good filipino food like tocilog  i have tried here once but will definitely try more of their othe food.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "This place is a whole in the wall that you would not want to miss. Sure, it's not the cleanest but it's so cheap and good! I tried the Hong Kong style pork chop and it was a huge portion for the price. Every order also comes with tea or coffee. The workers are very friendly. They don't have too many tables so the place can get crowded quick.", "author": "Lushi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Eating here for 20+ years, one of the best foods of all time! I eat there for the freshest bites ever! Get a hot sabow with your meal. I get the Hong Kong style pork chop all the time. Everyone must try it and if you don't like pork then try Hong Kong style chicken. Their tapa is also the best. And also their tocino", "author": "Ian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Hole-in-the-wall does not even begin to describe Superstar Restaurant. From the dingy front sign, the old-school menu board, the damaged ceiling with water stains, the taped-up chairs, and mismatched plates and utensil, Superstar is more like the crack in the wall that always leaks, is discolored and rusting, and large enough for your neighbor to peek through. With that being said, you won't find a cheaper, filling, and more complete meal. At $3-$5 a plate, Superstar stands as one of the best deals in the city.\n\nSuperstar serves some variations of Chinese food, but most people come in for the Filipino breakfast dishes. From favorites such as Tosilog, Tapsilog, Longsilog, and Hong Kong Pork chops, Superstar has maintained its clientele with its generous portions and rarely changing prices. And don't be scared to combine certain items, as they are usually really flexible with combinations. Superstar has maintained a good business model, cutting out on most of the extras, to serve their customers a consistent product. Each \"silog\" comes with eggs, garlic rice, and your choice of pineapple or tomato. When ordering, please mention if you want pineapple as tomato is the default choice.\n\nSuperstar closes before most get off work, so plan accordingly during the daytime. Make sure to call in advance as they do get busy, especially during lunchtime. And I recommend ordering for pick-up, especially those of you who prefer or are used to cleaner eating conditions. I have been going here for years, and like the quality of their dishes, some things will never change.", "author": "Carlo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "This is literally my childhood.. In a white carton box filled with garlic fried rice, huge chunks of meat, pineapples and eggs LOL.\n\nI grew up with my mom bringing these back to the homefort. She and the owner actually are friends now because she's a regular. Even until now, I find the kitchen filled with these darn breakfast boxes.\n\nThis place is literally a hole in the wall. The sign is so small and simple that you probably wouldn't even see it if you were driving. But the workers there are really nice.\n\nMaybe it's the Filipino in me, but goodness I la-la-love silogs, even if it's not made from Filipinos. The people here make a mean silog for an amazingly nice price ( one box is like $3 I think) \n\nI've tried practically every silog in this joint, but my favorite is their tapsilog and their bangus sisilog. Salty but it keeps you wanting a crapload more. They always ask if you want tomatoes or pineapples with your order and I opt for pineapples, because I have this thing for pairing up salty foods with sweet foods.\n\nParking is horrible in Excelsior. Either call ahead and pick up or pray to God that there is parking someplace. They only accept cash, so fill up them pockets.", "author": "Jerianne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "I spoke too soon, but after trying Superstar after Gateway, I'd say Superstar is the \"super\"-ior choice lol. Alright, stop throwin' tomatoes. \n\nIn fact, my love for tomatoes is why I rate Superstar better than Gateway. Taste-wise they're pretty similar. I ordered the hotdogsilog at both and they use the same brand. But Superstar offers the choice between a side of pineapple chunks or fresh cut tomatoes unlike Gateway, who only offers the pineapple. \n\nI believe the prices are slightly cheaper at Superstar, too (maybe by 25 cents). They also offer a hardboiled, salted egg for $0.85 and other Chinese lunch plates, which I don't think Gateway has.\n\nHaving a side of tomato and salted egg with my silog plate is how I'm used to eating Filipino breakfast, so that's why Superstar gets my vote, but honestly they're both great, cheap Filipino eats.\n\nIt gets an A from me (4/5 stars) for the big portions they give under $5.", "author": "GG C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "SUPERSTAR! YOU DELICIOUSLY DIRTY DIVE YOU! Superstar is like that 80 year old \"seasoned\" cast iron pan your grandma has - greasy, grimy and delicious! One step inside and  you wonder what kind of \"how low can you go\" game of limbo is being played with the health inspector to keep the doors open.\n\nThen you see the menu & the prices, and you're like.. OH.... $3 and something something cents for a giant box of bansilog?? umm...hmm...ok  give me 6 orders with pineapple. Thank you!  \n\nIf it's your first time at Superstar, don't be scurred... it's delicious and cheap :)", "author": "Jay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "This is the best and cheapest Filipino food ever. We had the chicken dish for $4.30 and it was so good. I love it. It is a small restaurant and not too fancy looking. But it is good if you are looking for something cheap and fast.", "author": "Lien D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Their HK Porkchops are INSANELY delicious! Ultimate comfort food! And dead cheap...less than $4 for a meal with a fried egg, garlic fried rice, & 2 huge fried porkchops!\n\nOk so it's not the cleanest place but they do make good food. I guess you get what you pay for. And the family that owns it are very nice to their customers. Very courteous & helpful.\n\nDelicious food at low prices. Can't beat it. Try the Pork Tocino, HK Porkchops, Longanisa....actually anything except the Tapa (not really the best).\n\nBest Filipino breakfast ever!", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Regardless of some disturbing things I've heard, I'm still giving this place a 5star because it's not good to just go off what you hear. I've been coming here since I came to America (I was 10, I'm 30 now). My dad took me here and at first I was kind of mad at my dad b/c it doesn't look very pleasant from the outside and inside but I was a kid and I knew better than to be an ungrateful little brat lol \n\nWhen I tried their food I definitely was hooked. Their food is cheap. You can spend less than $10 and get full! The only thing is their tocino is kinda oily but it has so much flavor. I love that they serve tuyo (fried sun dried sardines) because no one in my family would dare to cook it at home because it smells bad bad so I'm glad I still get to eat that without having my house smell like strong scent of fish lol I love their jumbo chicken, Hong Kong style pork-chop, sarangani fish (smoked), Bangus fish (fried milkfish marinated in salt, pepper, vinegar and garlic). I just love their food. They may not have chicken sisig but they have so many food I can choose from!", "author": "Raina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "This is the best Filipino breakfast restaurant in the Bay Area. \n\nIt is a little gem! Although the facility is small, their food is amazing! It is so affordable. \n\nMy favorite is the baby bangusilog. It comes with garlic rice, egg, and tomato (or pineapple)", "author": "Samantha N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "The stuffs here are nice and polite, and the price is extremely low! The taste of food is ok but considering the economic price it deserves a five star", "author": "Bo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "The love the food here and you can't beat their prices.  The Hong Kong pork chop is my fave.", "author": "Gil B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "The fact that this place serves hefty combo plates for a little less than $5 blows my mind. \n\nIt also makes it an anomaly in SF where your average lunch, whether it's a lunch plate, sandwich, or even a salad, is $10 (or more). \n\nI was skeptical about the quality of the food coming in at first, but after going there twice already I can vouch for it's tastiness. \n\nI've had the hong-kong style pork chop and fried chicken plates. They give you a lot of meat, flavored rice, a side of either pineapples or tomatoes, and a cup of coffee or tea. \n\nSure it's no fine dining establishment (nor would I go there expecting it to be), but for a hole in the wall place that offers a full meal for cheap and quick, Superstar IS the superstar. \n\nSide note: CASH ONLY", "author": "Derick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Great prices. Big portions. Real home cooking taste. Every plate comes with a cup of hot tea. Garlic fried rice is a plus. Love longanesa and fried egg. Cobo meat is awesome. You really get your bang for your buck. All this under 4 bucks.\nIts a great whole in the wall for sure.\nSame staff since high school and prices.", "author": "Hung L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Pros: Cheap as hell, very tasty, decent selection to choose from, very nice people, convenient location, large quantities\n\nCons: Extremely packed during lunch, greasy, building not aesthetically pleasing\n\nThe first time walking to and into the restaurant, you might be deterred from the old walls and floors. Their taped up menu in the front might look cheap, and their coffee machine old and nasty, but everything is better than it looks! Their building is actually not as bad as it looks and their kitchen is surprisingly clean.\n\nI've been going to this place since high school and it's never disappointed me. What's not to love about this place? Cheap, good, and quick. Perfect for high school and college students that are trying to save money. Hell, it's even great for someone looking for some good Filipino food while in the area!\n\nSuperstar has always been my go-to place when I needed some delicious and cheap food. I live in Daly City currently, but I still make the drive up to this place! The location is perfect for people attending City College of San Francisco as well because it's just a 15-20 minute walk or about a 5 minute drive depending on traffic. There is also a Safeway across from the building which makes it even better! Their food always comes with a buttload of garlic fried rice, an egg, and a side of pineapple cubes or tomato slices. I'd recommend trying the Jumbo Fried Chicken (jumbo is not an overstatement) or the Hong Kong style pork chops!\n\nThe only thing about this restaurant is that sometimes the food can get a bit greasy. I mean, some of the menu items are fried already, and the egg is probably cooked in a good amount of oil on their skillet. If you're watching your weight, you probably don't want to eat here. The building can also look pretty bad at first sight because the owners have kept the building the same way ever since it was purchased. It's not that bad though, feels a little like going to your grandma's old house.\n\nThe last thing is that Superstar can get extremely busy at around noon because everyone is ordering for lunch. There will be people that have 4-5 boxes to-go that have called in beforehand for takeout. They are open until 4:30, so there's plenty of time to wait!\n\nI'd recommend trying this place because it's great, cheap, and in a pretty decent location.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-22", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star: street parking wasn't bad for me but I can see it being bad. No wait. \n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n0/1 Star: fast food service. Dirty. Run down ambiance. \n\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n1/3 Stars: food is edible. You get a lot but it's not that good.  Quantity over quality. Very basic food. \n\n_____\n\nOverall Experience\n\n2/5 Stars \n\n_____\n\nLast Words\n\nHole in the wall place.", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Been coming here since I was little, for over 10 years now and this place never disappoints. Cheap, delicious, and always always ALWAYS hits the spot", "author": "Monica-Leah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "This place is jadeROCKing!\n\nIt's been a decade since I've come here, but the food is the same as I once remembered! \n\nDefinately for the broke azz and bang 4 ur buck folks! Good Filipino and Chinese comfort food at rock bottom prices.\n\nMost people go for the Filipino food, but they also serve Chinese rice plates/chow mien for under $5 as well. NOTE: AS IT TURNS OUT THERE IS NO OTHER OPTIONS, JUST THE FILIPINO FAVORITES :)\n\nThe staff is friendly and the service is fast.\n\nWe got 2 orders of Tilapia, 1 Hong Kong Pork Chop and 1 Fried Chicken for $19.40! Wowzer!", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "If you read any of the reviews then you know that Superstar is cheap, turns out orders fast, has decent food, and that the space comes off a bit dirty / and worn. \n\nDishes are in the prices range of $3.25 - $5- , but the bulk are actually less then $4- \n\nSo what do you get? Amazing value with Garlicky Rice , a choice of fruit though many I saw opted for Pineapple over Tomato, a Fried Egg (Mine was not over cooked but also did note have a Runny Yolk), and a choice of Protein with mine being their Flavorful & Crispy Hong Kong Style Pork Chop.\n\nIt is busy here during Lunch, but the staff turns out dishes really fast, and the street parking here is not as difficult as one might expect.  \n\nSo if your not put off by a restaurant that puts function over style, and wanting some good cheap eats then you can not do much better then Superstar.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "4$ Filipino breakfast. You can't beat that! (Unless you go to the Philippines). Hong kong style pork chops and the fried chicken were on point. Generous combo portions and quick service. You can't go wrong here. There was a small piece of plastic wrapper in my fried rice, but that didn't stop me from finishing it. Next time I'll try the beef tapa.", "author": "Jaime F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-29", "description": "Sold out of fish everytime!! the last time I called to hold an order for me I caught an uber all the way there only for them to tell me they misunderstood me and that they just sold the last batch of what I was trying to order. Everyone there is nice, but I'm disappointed, no accommodations or anything. I won't return.", "author": "Ricky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "I love this place, it reminds me of home! \n\nI love everything, but my favorite is the Hongkong style Pork Chop!!! they have big servings and I can't even finish it by myself. You can choose the sideing from pine apple of tomat, I suggest you choose tomato and order an extra side of salted egg!! YUM!!! \n\nI love dropping by here in the morning for a cheap and great breakfast, the servers are great too.. The place is small, but I don't mid. it's just sad that they close early.", "author": "Pauline P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Only con about this place that it is cash only. But who can beat a four dollar filling and good breakfast. My favorite is the Hong Kong style pork chop and my second favorite is the fired chicken.", "author": "Fernilla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "This review is made from the perspective of a bargain hunter who enjoys hole-in-the-wall type joints.\n\nOdd hours, research them.\n\nBest value in the city, by far. Great for ordering huge takeout orders for your hung over friends.\n\nActually, this place sucks. Stay away from my hidden gem! Shoo! Shoo!\n\nAlso, don't be a turd. Tip the hard-working staff who stand over open flames making their heavenly food. If you don't tip and I see you, I'll call the Cops on you and they will beat you for no reason.", "author": "Sir J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-01", "description": "Are you interested in a heart attack, maybe gout or something heavy?! Maybe you want to treat your girlfriend/boyfriend to a cheap lunch, have no fear Superstar is here!! Get ready for the best poor mans meal. Seriously, Hong Kong style pork chops, itty bitty cat tocino, or maybe some 5 year aged bangus (fish), bomb!! Their garlic rice...phenom... and that greasy egg that has been sitting there for a couple hours and re-heated, to die for!! I could not say enough about this place. They have been here since I was a kid in elementary school and I'm 30 now. They keep their menu small and straight to the point, great breakfast joint!! Don't listen to hate, participate and check it out yourself. This dingy restaurant is located on Mission street across the street from Safeway. They got that Chinese/Pinoy fusion going on. Ask for the rotten tomatoes they pick up next door. Whew! Bomb!!", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Went back for a 3rd time, 2nd time with my boyfriend, and since it wasn't busy at the time, we were served almost immediately.  That's the awesome service and food I remember! This place is now a staple for any visit to SF for me.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Good food and affordable. Some portions are a bit small but it will fill you up. Service is great. The place needs work and I think the place can make lots of money if they invest in the interior and cleaning it up with a nice paint. Other than that i was satisfied.", "author": "Aldrin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Cheap, Good and Quick, what else can you ask for.\n\nPerfect Garlic Rice!!!\n\nI strongly recommend the Tocino and the HK style porkchop. I strongly discourage you in getting their beef tapa, it tastes more like boiled beef in my opinon.\n\nAlso, I think that all of their meats are store bought (just go to an asian market and they are there) except for their tocino (and the underwhelming tapa), so that might be a plus!!\n\nIt just takes some Chinese love to make Filipino silog food, quick and delish! YUM!", "author": "Jan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Cheap food, decent taste and big servings. Can't go wrong with that if on a budget and want something quick.", "author": "Arnaldo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-10", "description": "Got silogs for brunch - tapsilog, fried bangus, and fried chicken. \n\nFried chicken - pretty big piece of chicken, I must say! And was pretty good.\n\nBangus - also pretty good. They did not have the boneless one, but the boned in one was still pretty good.\n\nTapsilog- my beef was dried :( felt disappointed due to such. Should've gotten tocilog.. Tselog had such tender and delicious Tapsilog.. even jollibee! Can't wake up on time for jollibee and too lazy to go to tselog.\n\nRice had a more crunch than I am used  to, but was very good! With the pineapple, it made it sweet, which I enjoyed.\n\nMost of the dishes were around $4 so decently priced, but is by no means a complete and fulfilling meal... would have to eat another .5 to 1 extra plate to get full.", "author": "Yan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Price and portion is 5 stars. \nTaste 4 stars. \nFast service 4.5 stars.\nSo 5 stars. If you are sick, too lazy to cook, want something fast & cheap this is the place for you after you bought your medicine from Safeway across the street.\nJust be ready to come early, they close for dinner.", "author": "Icey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "This place is a SF landmark.\nThe place is run-down af and looks kind of sketch.\nYou can get Filipino breakfast meats, HK style pork chop or fried tilapia with garlic fried rice, a fried egg and your choice of pineapple or tomato on the side (to make it healthy) for like $6 ! Definitely try this place next time you got the munchies! Food tastes really bomb but you might not wanna eat here every day!", "author": "Antonio W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "For the price and food, you cannot ask for more. Good helpings and lots of flavor. Always order the Salongs either chicken or hong kong style pork chops and never regret it.", "author": "Jr D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "Note that this is a HOLE IN THE WALL kind of restaurant. Do not expect anything fancy. Do not expect to be served at your table. But, if you're looking for cheap yummy silogs, you've come to the right place. Expect to pay less than $10 for 2-3 people's meals.\n\nThe types of silogs they have: tocilog (tocino), longsilog (longanisa), tapsilog (tapa), tuyosilog (tuyo - fish), bangsilog (bangus), porkchopsilog (porkchop), spamsilog (spam) and baconsilog (yes, bacon). And guess what? They are all $3-4 and come with garlic fried rice, a fried egg and either a tomato or pineapple. \n\nI usually order food to go here and enjoy my meal at home. I am always tempted to get 2 silogs just for me! It's such a great deal when you're just craving silogs!!!", "author": "Jess D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "Most silog dishes are like $3. I like the fried hong kong style pork chop for $3.50. All the dishes come with garlic rice and either some raw tomato or pineapple chunks.\n\nThis place is a hole in the wall, and cleanliness-wise ultra grimey but honestly those are the places that make the best food.\n\nFrankly, if you grew up in the suburbs and/or never traveled outside to the USA to a second or third world country you probably would think this place looks like an operating health violation.\n\nHope this place stays open forever!", "author": "Doug R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "My friend first introduced this place to me when I was a junior in undergrad, as a place where \"Chinese people cook Filipino food, with awesome results.\"\n\nSuperstar is where I was first introduced to silogs and garlic fried rice. After my first visit to Superstar, I obsessively studied different garlic fried rice recipes to try to replicate that amazingly unhealthy bite that so filled my stomach with joy that one fateful 2009 morning... with very little success.\n\nSo four years later, I visited the store again and decided to get what yelp told me was their most succesful dishes. The place was still a hole in the wall, and still looked dirty as ever, but Garlic Fried Rice with Tocilog + HK Style Fried Pork Chops, all under 10 dollars? You tell me where you can get a heartier breakfast for that amount of money in the city. Your mom's or your grandma's don't count.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "I've been going here since high school. (14 years) Love this place. The people that work here are super nice. If it's your first time I suggest Hong Kong style pork chops. P.S.Don't let the hipsters find out about this place!!! Let's keep the outer mission untouched Please", "author": "Sasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Straight up fire! Food is authentic and tastes like perfection. Not to mention it's dirt cheap.The food comes out super quick too. I got the topsilog with pineapple and coffee which is included. Better than what I eat at home and that's coming from a Filipino herself! I left completely satisfied.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "I love this place. When my Mother Victoria Orea was alive, we would come here everyday for breakfast. Now I share this place with my Filipina Wife, Catherine Romero. Jeff is excellent. Salamat po. Masarap.", "author": "Benny R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-18", "description": "Went here this morning, called 5 minutes before I got there and it was already finished. Oddly, it was around I believe $14 for 2 dishes. The food isn't as great as gateway kitchen, it seems dirtier, cheaper, and food quality doesn't compare to gateway.", "author": "Donnah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "My go-to for my Filipino breakfast fix! They have the best longansia and tuyo and they are friendly and fast.", "author": "R. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Hk pork chop everytime. Small hole in the wall...looks dirty n dingy but its soo good.", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "This place is famous for their Filipino Silog's. I usually get the Tapa-silog (beef)\n\nLike what most say, this place looks dirty. Maybe perhaps the locals from the neighbor leave their artistic markings on the walls. But according to their inspection card they are rated 98/100, which is higher than most fine dining restaurants in San Francisco and Palo Alto. I say it feels greasy from the kitchen. And the smell is really strong. Every table has a large bottle of vinegar and some kind of fish/shrimp sauce? The smell is so strong that I get my food as take-out. I'm not sure how people drown their food in vinegar. When I came this place was super-packed with locals. Then again everything on the menu is super cheap. All silog dishes range from $3.25-3.75. Cheaper than McDonalds.\n\nAfter comparing to Jollibee's, this place is hands down better. It is half the price and less oily/greasy than Jollibee's.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "I've been going to this restaurant for YEARS...possibly my whole life. Definitely a hole-in-the-wall -- the food is cheap, no frills, but the portions are huge and the food is always consistent. I would be so sad if this place ever closed down. It's a true neighborhood staple. Tip: call ahead for pick-up, they'll have it ready in 10 minutes or less.", "author": "Junelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "This place always been popular among Filipinos and those familiar. Their logo used to say Superstar Filipino Food now it's just labeled Chinese food. I heard the owner made lots of money over the years and bought lots of houses. All I can say is after milking all of those money from making FILIPINO food, the owner should at least acknowledge and let it be known that what their customers eat is Filipino food. It's just like how China is currently stealing Philippine lands as I type this, Chinese people wil try to profit off of our Filipino food too? These people are shady and greedy! Hongkong style silog really? And the Filipino guy who taught the owner how to cook Filipino food is an idiot and deserve a smack over the head", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Best hole in the wall hands down. I love this place and I hope they continue to stay open with their ultra cheap prices. This is where you come to get your greasy food after a mean hangover.", "author": "Mick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "5 stars. $5 can fill you up. Free Coffee & tea.\n\nSuperstar is NOT your shining star tourist restaurant. This place has been here since early 80's, maybe late 70's, and the prices are stupid CHEAP. They serve all types of filipino tselog plates, it means everything is served with garlic fried rice, fried egg, and tomatos (you can request pineapple instead). Tapsilog, bangus, whole tilapia, tocino, longonisa, and more. \n\nThis place is really famous for the signature Hong Kong style pork chop. Deep fried pork chop with all its glorified greaazyyyy goodness. I will always make this bad boy a combo, Tapsilog & hong kong pork chop with an extra egg, & sabow on the side (soup broth for melting the greese in my stomach). \n\nDo not come here expecting a classy atmosphere with waiters to seat and serve. Come here, find a seat, and sit. If the place is full, just stand and wait for a table to open up, people here eat fast, and you should do the same. Once you sit down Jeff or his sister will come take your order, so please do not sit down unless you know what you want. The menu is on the wall behind the register. Order your food, and in less then 5 min, they will run it out to you on old school Chinese plates. Every table has hot sauce, vinegar, salt n pepper, and the sauce dipper dishes are behind the counter, just ask. If this type of stuff scares you, ORDER TO GO!!\n\nCaution: Eating here will make you sleepy! but its hella worth it!! \n\nI love this place and everyone that loves old school Filipino food love it too, eversince 1980's.", "author": "Mono L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "I cannot believe I got unbelievable clean price here. The food got no problem  and they are friendly to their customers. Definitely I will come again.", "author": "Kent W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "The food has been consistently good since I tried this place out back in 1997 with the same owner. It's the best Tocino I've tried. Only thing is the portion size is small but the price remains inexpensive so no complaints there. If you're super hungry, I suggest you double your order. Reason for the 4 star is because of the decor of this old restaurant. Tocino is a 5 star dish here, hands down!", "author": "Maggie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Alright, a rare 5 star review. But it's mainly due to just how cheap this joint is. Every dish is between 3-4 bucks and you get a damn fine portion of perfectly dandy eats. Grab a water cup for your beverage and you're outta there without spending much at all and totally satisfied. What a treat!", "author": "Chad O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "All I can say is, OMG. So much food for $3! The service was great and the Tapsilog that I ordered was really delicious. :) \nI'm planning to come back more often after visiting today.", "author": "Amber W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "Finally got to come here to try their food the other day. I got the longsilog. I like the Filipino sausages a lot. It's very inexpensive. The garlic rice did seem a bit bland though. I thought the salted egg was way too salty -not recommended. The owner is super friendly and nice.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "This place has pretty good food for really cheap ($3-$4 for rice, an egg, meat and tomatoes or pineapples). I got the Tosilog with a side of Longsilog and they were both really good. I'm planning on getting that again when I come back.", "author": "Guorui W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Holy ish! My boyfriend took me here a couple days ago before the Beyonce concert for the first time and I have to say I was impressed! \n\nI've ordered the logsilog and the bf ordered the fried chicken. Once we sat down, the food was already done, which I like. Super fast service when I was there during lunch time. \n\nEach plate was about $4 top, which is super cheap. The quality and quantity was just perfect. The sausages was cooked and marinated perfectly. It wasn't too sweet or too salty. OMG just writing this review makes me hungry and wanting more! You will smell the longanisa in your breath and burps long after eating it...that's how you know it was good!  The garlic fried rice also had enough seasoning, meaning it was not too salty.  The bf also liked his chicken because it wasn't over fried like wingstop wings...\n\nI also liked how we can either get tomatoes or pineapples with the meal. Mhmmm\n\nOne thing that stood out was that the restaurant was small, so I don't really suggest coming here with a group of 10 people for a sit in meal. There was about 5-7 tables with a seating of 4 and maybe 2 tables with a seating of 2 people. Most people take take-outs...either way, try this place out! \n\nSuper fast, super tasty, super cheap= happy me!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "Super Star is a Super Star! They are so sweet, food is bomb, and its a cute family owned mom and pop spot. Last of a dying breed", "author": "Lorain C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "This place is a definite DIVE! \n\nHaving said that, they haven't raised prices ever since I first ate here 4 years ago. Imagine, a gigantic piece of chicken leg, fried egg, garlic rice and chopped tomatoes for less than $4! \n\nThey serve a combination of Filipino and Hongkong rice meals for a bargain, service is pretty fast and definitely one of my #cheapeats love!", "author": "Gordon O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Yay! I'm a fan. Why? because their food is dirt cheap and the flavors are there. Where else can we buy this kind of food for it's price? I ate there couple times, not the typical 4 star quality ambience but I guess it gets the job done as far as eating your food while its still hot from the kitchen.", "author": "Eugene A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "This place is good if you love to eat breakfast. Hong Kong pork chop is their signature dish but their tosilog and longonisa is amazing!!! Would go here for their breakfast!", "author": "Nino A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Incredibly cheap eat. For $3.25, I got the Longsilog which comes w/ 2 sausages, an egg, pieces of tomato and garlic rice. Very filling and they make it fast. You really cannot beat it.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "4 star for the food! Cheap, delicious and it's quick. The restaurant itself is a hole in the wall, literally, but the food is amazing! I recommend the tosilog!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "Been coming here ever since I was a kid and I'm GLAD it's never changed, as well as the prices! Hole in the wall, but definitely one of the best hole in the wall spots ever. They used to only have topsilog and longsilog on the menu but I guess they've updated with a lot more silogs! It's a small restaurant so be prepared if you can't find a seat. I usually always order to go and get the tosilog or the porkchop silog. All under $5!! Ran by chinese (I think) but still the BEST silog spot, hands down.\n\nPROS:\n-Variety of silogs that are under $5! \n-Usually quick service\n-The cashiers are always super friendly\n-Mostly to-go\n-Can get busy on the weekends\n-Their garlic rice is THE BEST garlic rice in silogs ever! Compared to anywhere else this place is number one on my list for silog spots! \n-Good amount of portions! \n-Fried pork chops! A definite must try! SOO GOOD! \n-Also chinese food available, but they're KNOWN for their silogs. \n\n\nCONS:\n-Closed Sundays! ANND they close a little early. \n-Street Parking, don't forget to pay for the meter!\n\nWhenever I'm in the area I always try to stop by!", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "in terms of looks, don't expect too much from this hole in the wall place in the mission but it does have some pretty cheap meal combos!\n\ngot two HK style fried pork chops, a good portion of garlic rice, a sunny side up egg, choice of tomatoes or pineapples, and two added longanisa for $5\n\nsuper fatty but pretty good. i wish the longanisas were grilled or cooked a little bit longer though.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "This place isn't the nicest looking restaurant, but they did get a 91 on their health score! (That's good, right?) It's a staple in the SF area, so its def here to stay. Hong Kong Style Porkchops is what I order every time. It comes with garlic rice, choice between pineapples or tomatoes, and eggs, and of course the porkchops (or whatever meat/fish entree you order) \n\nThe best thing about this place is that it's DIRT cheap. Two orders of HK porkchops for under $10, haaaaill yeah! \n\nI wouldn't personally eat there though, take that goodness to go.", "author": "Kathleene E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-14", "description": "Food is good but MAKE SURE YOU COUNT YOUR CHANGE they don't give you back the correct change hence the sign at the counter that says to count your change when receiving because the responsibility is on you AKA we finna rip you off", "author": "Celeste M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-22", "description": "Not sure if you know this, but if I had to eat one thing for the rest of my life without any health consequences it would be fried pork chop w/ egg and rice, preferably Taiwanese style but today I settled for the HK variety. I don't discriminate much when it comes to fried pork chop. Any style as long as it's done well is fine by me.\n\nA buddy of mine who likes to think of himself as a cheap eats connoisseur turned me on to this place. He initially recommended going to Gateway kitchen but they were closed on mondays. Luckily for us Superstar was open.\n\nLet's start out by saying if you order the HK style fried pork chop for $3.50 you get two slabs of pork, an egg, and some pineapple. The price is unbeatable for the quantity you get. The pork chops themselves are decent, but could have been juicier. The meat was very dry in some parts. They aren't the best slabs of meat, but breaded nicely. The garlic fried rice is simplistic, but hits the spot just right and goes with the pork chop well. \n\nThis joint is a complete hole in the wall. The food came fast and I devoured it just as fast as it was cooked. I'm an incredibly fast eater, which my mom still scolds me for till this day. What she doesn't know won't hurt her. More Cheap eats here I come!", "author": "Jack C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "One of the very few hidden gems left in San Francisco, more specifically the outer excelsior district. Superstar is a classic food location when you want to get cheap tasty philipino comfort food. \n\nLocated in the outer part of the Mission District, Superstar Resturant is a small, what you would call hole in the wall eatery that serves some of the best Hong Kong porkchops, fried chicken fried chicken, and other tasty Filipino foods. Don't be fooled by the exterior of the location, it does look rundown but that's part of the nostalgic aspect of this location. Once you go inside it's pretty self-explanatory and easy to order anything from the listed menu. Although it's not the healthiest things to eat, all of the dishes are extremely popular to those who know about superstar.\n\nYou do have the option to take out or sit in but my best advice would be to take out. That way you won't have to necessarily sit in what is otherwise a drab and dry restaurant with no real Decor. Simply put Superstar let's the food speaks for itself.", "author": "Donald W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "It's rare to find a restaurant with so much graffiti on its walls (and apparently no desire to clean it up), so consider the décor to be urban gritty. The tables are sticky, the seats are plastic, and the utensils flimsy. It's a noisy place; every seat was taken.\n\nMost meals are under $5. They have silog plates (Filipino breakfast), Chinese rice plates (kung pao, Mongolian beef), won ton soup, and burgers.\n\n* Popsilog ($3.50): popcorn chicken, one fried egg with tomato (or pineapple), garlic fried rice, coffee or tea. The popcorn chicken was probably made at a Tyson factory. Think breaded chicken nuggets. I was expecting the something different. The garlic fried rice wasn't as good or garlicky as Gateway Kitchen's. Yes, the meal was dirt cheap and filling but the frozen chicken didn't impress since reheating it didn't show much skill or cooking effort.\n\nCash only.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "The joogest place I've ever known since I was conceived.\n\nYou get a very generous silog portion (garlic fried rice and an egg) along with your choice of protein and a side of either tomatoes and pineapples. They serve very quickly so once you've order, you settle down to open facebook and your food is ready as you start scrolling.\n\nA gem/hole in the wall, whatever you want to call it, this place is amazing! For years they've been serving the community around them, which includes the high schoolers/city college students in the area. I first came here 4 years ago and I'm surprised they've stayed in business with the same menu and same price! I hope they stick around for many more years!\n\nTHANKS SUPERSTAR!", "author": "Frank C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "balboa high school 2008! fuck yea! this shit hella good! I mean it might be dog or cat meat. But don't matta! It herra sarap good! Mmmmmmmmmm Sabaw and extra rice pa more!!!!", "author": "Chayse M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "You pretty much pay for what you get, but IT IS JOOOOG.\n\nYou aren't gonna spend more than $3.50/person, and thats for an egg, tons of garlic rice and your choice of entree. They pretty much cover all the -silogs. \n\nThings to just keep in mind\n- It's a hole in the wall, but those are usually the best places to eat\n- Just ignore the mess and the kitchen\n\nAnd you should do so because the food and price are so worth it!\n\nWhat I don't get is how all this bomb Filipino food is made and ran by non-filipinos!? They're doing it right,", "author": "Charmaine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Ordered the hk fried pork chop and ligands plate. Been coming to this spot for the last 6-7 yrs Cant beat lunch for less than $10!!!", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "One of those hole in the wall place near my house that I'd never think of going in, until ONE DAY, my boyfriend dragged me in because he had tried it before and he raved about the prices. \n\nI was in for a surprise, because for the REALLY cheap price, you actually get pretty big portions and pretty good food. I've tried the breaded chicken and longanisa and they're delicious. (Now I'm thinking of that longanisa again... I wonder if I can pay extra for them to add more longanisa on the side)\n\nWould definitely go back", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "This is one of our favorite hole in a wall go to places, for some really good tocino and garlic fried rice! It's inexpensive and delicious. This place has been around for more than 20 years. Never fails!", "author": "Sahira S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "We used to come here often the morning after we went out for a night of drunken debauchery so I can say I have been here a lot in the past lol. You can eat there, but we always got our orders to go. The HK pork chops and any of the silogs are the best. Filipino and Chinese food done right for a good price.", "author": "Giselle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "One of the main attractions to the Excelsior community has to be this humble restaurant located across Safeway. This unassuming restaurant will have visitors baffled as to why there's people standing outside of this location a plain looking building. Not much has changed over the years in this restaurant because whatever they have that's working for them hasn't changed either. Huge plates of food for less than five bucks. I'm going to repeat that. Five bucks. \n\nThe choices here are somewhat limited to classic Filipino/Chinese standard like sisig and Hong Kong style pork chops. All dishes are accompanied with some pineapple, a sunny side up egg, and their popular garlic fried rice.\n\nCleanliness of this place can be an issue at times and for that reason, I usually get my food to go. There are also times where the garlic in the rice gets burnt and almost ruins the entire rice side. \n\nOverall, make the trip here and try out a plate.", "author": "George Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "It's a little hole in the wall. I definitely recommend the hong kong style pork chops or the fried chicken. They give decent proportions with fried rice, your choice of meat, with an egg and your choice of either tomatoes or pineapple for a side. If this was open later or even on Sunday's I would definitely be there. Even though they seem to always be busy they serve fairly quickly. If you're looking for good quality at a great price this is definitely the place.", "author": "Jaztine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "I LOVE this place! Jeff and his Wife are very loving and attentive. I can walk in and they already know my order without me having to say so! I have been eating here for 9 years.The food is wonderful! Very short wait time for your food to be in front of you. Cash only Restaurant, so please come prepared! Large helping of garlic fried rice which is so yummy! I drive from Vallejo to the City only just to eat here all the time! Very well priced, and you get way more food than what you pay for! I love you guys!!!", "author": "Lin E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "Food = delicious.  Portions are hearty.   I had two plates of tocino (okay, so I actually consumed 1.5 of it, and my friend took the rest home, after he consumed his porkchop plate.)\n\nHow do you run out of coffee at 1 p.m. on a Friday?!? lol \n\nPrices = cheap.  A person could leave here for under $5.00 for lunch/dinner.\n\nDecor = circa 1980s...from floors to ceiling.  Yeah.... reminds me of my childhood in NYC restaurants.  Bwahaha.  Falling apart layers.  That's all I'm sayin'.  \n\nGlad that I finally got to try this SF 'Institution'.   \n\nOverall--I'd be here for a quick bite to eat.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "Cheap and tasty are the two perfect words to describe Superstar. Every time I come here I get the same exact thing, the Hong Kong Style Pork Chopsilog...Yummy! \n\nThe restaurant itself is not too nice. It's a bit small and crowded.(that's why I take it to go most of the time :P). Service is not bad, and what can possibly be better than having a delicious lunch for less than 5 bucks?!", "author": "Yamileth O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "Been coming here for years and its still great! I love their tapa, garlic rice, eggs, pinapple or tomato all for about $4 bucks. This place has saved my life a few times after a horrible hangover when i was younger many many years ago lol \n\nPlace is kinda run down, creepy, hole in wall but plates are awesome", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "Good food @ dirt cheap prices. Take the food to-go. Cash only. Cantonese speaking owners, very nice! \n\nDat fried rice.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Seriously.... I have no idea how they make money.... For $3-4, you can have a hearty Filipino breakfast that is served in 1 min. Service is on point and fast. People are nice. No complaints.", "author": "C MH L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "Sooo if you're on a diet or you're super health concious, I'm gonna tell you that this place is not for you. Or if you're a vegetarian, this place is definitely not for you. And if you can't stand being in a restaurant that just don't look clean, don't even think about going through that door. But if none of this applies to you, enjoy and get your moneys worth.  $3-4 gets you a whole plate of garlic fried rice, an egg, and your choice of meat or fish. This is a very popular breakfast plate amongst Filipinos, so don't be surprised when you see my grandparents, my parents, my aunties, or all my cousins there. \n\nMy favorite plate is the Hong Kong Styled Porkchop. It is a must try. I also like the Fried Chicken and the Tilapia. And they don't play around when it comes to portions of the meat or fish. Yes the food is all fried, except for the side of either pineapples or tomatoes, which supports all the saltiness. This place is often packed, but they cook the food so quick and people eat it so fast (because it's freaking good), that you may just end up with a seat.. Please take note it is not open on Sunday, but if you're really craving some of this wonderfulness, Gateway Kitchen, which I believe is under the same ownership, is further down Mission st, can supply you the same satisfaction. And as my sister once joked, maybe this place is good, because dirt is sprinkled on the food. In any case it's freaking delicious.", "author": "April D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "This place never disappoints!!! Sooooo good!!! I've been going here and Gateway Kitchen since high school. Cheap and good Filipino food.\n\nI always get the toscilog!!", "author": "Althea D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "I loved their food but then one day my friends and i went to go eat and i need to use the bathroom so one of the waitress told me where it is and went i went to the door the food was on the ground with a tray but it wasnt cover so when i went back to my seat with my friends i didnt feel like eating their food anymore \nBut the services are nice \nI feel like they are cheating on the food santantion thats why they bavw a higher rate", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-04", "description": "The rating may be somewhat unfair, because the service was okay (for Asian restaurant standards), and the place was just like any other dive-y restaurant.  And the food is cheap.  However, I will never go back. \n\nWhy?  Because the food is BLAND!  If you're looking for Filipino breakfast, there's a significantly better one down the street. But because it's Easter, Filipino restaurants are closed, and we ended up here.  We had the tocilog and the tapsilog.  The tocino tasted okay - but still has a slight pig taste, and the tapa was tender but zero flavour.  The best part was the fried garlic put on top of the rice. But once that garlic is gone, the rice is also bland. Tried putting salt to improve it - still can't extract any flavour. \n\nBeen there, done that, never again.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "If you are wanting a quick Chinese/Filipino style breakfast this is your hole in the wall! I have been going to superstar for some time now and for me it has been consistent since middle school! I order the Hong Kong style pork chops! The only reason I wouldn't give them a five is because of the decor inside. But then it wouldn't be a hole in the wall right? Seating can be important too :). The main server \"Jeff\" is such a nice person if not busy always welcomed you to his business. There are other types of breakt plates to enjoy. Explore your tastebuds!", "author": "Peter G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "From the outside this place looks like a liquor store, but when you walk in you'll see that it's a fast food hole-in-the-wall type of place. The food is of great value and extraordinarily cheap. Most of it is fried and that's why it probably tastes so good. Just don't exercise after or go for a run -- it might slow you down. But certainly a great option for a quick fix when you want to save money. For under $5, you can get an order like Fried Chicken or Hong Kong Style Pork Chops that will fill you up pretty good. Their orders also come with garlic fried rice, egg, and your choice of pineapple or tomato. Everything is packed together quite nicely. A working class meal filled with labor and variety. Service is also very efficient and the employees are kind. Just make sure to go before 4:30 pm if you feel the urge.", "author": "Phillip K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "$3.50 for a fried egg, garlic rice, your choice of Filipino breakfast meat, tomato or pineapple slice and hot tea or coffee?\n\nThe place is a hole-in-the-wall, but what a decent meal for the price.  I ordered the breakfast.  It's cash only, but I didn't expect them to take credit.  I ate in.  Don't expect much from the decor; I won't even describe it.\n\nThe food came out fast.  The tocino, one of the choices of Filipino breakfast meats, comes from the same part of the pig as bacon.  It was good, but it could have been a little hotter.  The fried egg was more done than I like it (over-easy), but there's no complaining from me.  It all went well with the chunks of raw tomato and garlic rice.\n\nCheap, quick, tasty and filling.  I'll definitely come back, but it's not for picky ass people.\n\nI came back and tried the Hong Kong style pork chops that people were raving about and is the most popular dish to order.  There was a lot of food for $3.50, but I thought the pork chops lacked flavor.  It's just a deep fried, thinly cut pork chop.  Hot sauce did help the chops, but I probably won't order that again.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "This place is a hole in the wall joint in SF, so don't expect anything fancy. Their silogs are good. Love the garlic fried rice!", "author": "Charmaine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "The ultimate value meal and probably the most hole-in-the-wall place you'll find in the city. From the outside it looks super shady and run down, and the inside isn't going to change your opinion of that, but once you order a $4 box of food you'll change your mind. I like the big chicken leg with rice here, but they have lots of other combos. The food is all really simple so it comes out really quickly.", "author": "Allen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "Same as Gateway Kitchen???\n\nCHEAP GREASY FILIPINO FOOD YAYYY! Bigger menu than Gateway but same dirt cheap prices\n\nCall in your order so you don't have to wait for your food", "author": "Harry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "Pros - Jumbo fried chicken and hong kong style pork chops. Cheap. \n\nCons - cash only. hole in the whole clean. Closes at 6PM and on Sundays.\n\nI use to come here when i was a little child. After school i would not eat and spend my lunch money here for a huge meal. This place is dirt cheap, so cheap i dont know how they keep the price so low. For close to $3 you can get a huge mutated size chicken (legs and thigh) with garlic rice and an egg. The Chicken is cooked asian style and pan fried. The skin is super crunchy and delicious. The hong kong style pork chops are really good too. They give you 2 pieces, but a lot of it is bone. \n\nA lot of filipinos come here cause they make filipino dishes here but its chinese owned. I always call ahead and take it to go. The place is kinda dirty and you actually get bigger portions when you get it to go. \n\nI really like going to this place! I dont come here often anymore because it is super un healthy. But i recommend it anyone who likes cheap food.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "Pros:\n1) Tasty Soul Foods\n2) Cheap\n3) Convenient in the city \n4) Big portions of food\n\nCons:\n1) Place is somewhat dirty\n2) Fatty Junk Foods :(\n\nTips: \n1) Can park in residential area free\n2) Share your plate of food :)\n3) Call to order ahead & pick up to go", "author": "Juila L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "Before GATEWAY opened in DC i used to come here first. The food was alright. Gateway tastes better. AND i think it is the same owner for BOTH GATEWAY & SUPERSTAR. Not the greatest location, so i recommend take out.", "author": "Rose P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "LOVE this place!!! such good food for the low too! HIGHLY recommend.", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "A good place to get Cheap Filipino Breakfast! First time my friend took me there we had the PorkChopSilog. The meal itself was enough to feed two people. Just had to order a side of garlic fried rice and egg. The whole meal for two including two sodas was probably close to or under $10. This had to be at least 5-10 years ago. prices may have gone up. At that time, Tapsilog (Marinated beef, garlic fried rice & egg) was $3-$4.\n\nThe place is a little dirty, it gets really busy and they have short business hours. What they lack in these areas, they make up with taste, quantity and price! Be sure to know their business hours and be prepared to take a nap or run a marathon after you eat there.", "author": "Richard B. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "So this place is a hole in the wall. Definitely reminds me of those little cafes back in the PI with it's cheap tile and graffiti on the walls. I wasn't expecting much based on the looks and low prices but it had an avg of 4 stars on Yelp. It's not the French Laundry but my mind was seriously blown away at how delicious the food was for such a simple meal. I've paid $10-$20 for meals like this at food trucks and this little place blows them all away.\n\noh yeah, Don't be turned off by the looks. The health inspection rating is 96/100.", "author": "Berto A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-23", "description": "Super cheap good food coming from a hole in the wall. Workers are chinese, serving filipino food -- odd combo but food is food. \n\ngarlic fried rice is always on point, never changes\ni usually get tocino or HK porkchop. \n\n\nthe counter has a looooad of coins (looks like the toothfairy stopped by :D) LOL\nPlace is super janky looking, order food and take it togo. \n\nPS!! this is not a first-date place, just to let you know. you're welcome. :)", "author": "jennifer f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "Food for 5 people for $16 bucks?! Hell Yeah!!\n\n4 Tosilogs + 1 Tapsilog = 5 Happy Campers, 'nuf said!", "author": "Sheena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "Food was cheap and delicious and that's pretty much the draw to this place. 4 stars just because its so cramped and not the most hygienic restaurant you'd hope for.", "author": "Sanz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "I'm not really prissy when it comes to restaurants but the first time I was in this restaurant, I misjudged the interior and walked out 5 seconds later. That was a big mistake! Thanks to Yelp's health score, i gave it another shot and I've been coming here for filipino breakfast ever since.\n\nCheap yet good quality food, fast and friendly service, and a quick fix for my silog cravings. For the price of a frapp, you can get a full meal in this hole in the wall fil-chi resto! And yeah, Chinese folks cooking authentic silog dishes makes it more interesting.", "author": "Michaella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "The only reason I wouldn't write a 5 for this restaurant is because of the actual restaurant itself. The restaurant was filthy and had virtually no space to sit. The kitchen looked dirty and the rice in the back just sat in tubs near the bathroom.\n\nBut why give a four!? Because the food was great! The food, I believe, had very good quality for the price. It's definitely worth a quick lunch to eat for the cheap price. They give very hearty portions of food and the cashier and waitress were very nice even though they probably didn't know english. It's definitely worth the title of Hole in the Wall, and if you don't mind the kinda filthy locale but excellent food, than this is the place. Obviously they go through food inspections like everyone else lol. A definite place to go for a cheap lunch with a very hearty portion :)", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "It's my guilty pleasure, I exclusively get the hong kong style pork. But I have tried the jumbo fried chicken, both are equally good I just prefer the hong style pork. The main reason I come here is I can get a meal for under $5.", "author": "alan n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "This place is pretty cooool! My friend brought me here one day and I am very grateful for it. She explained that this place is a hole-in-the-wall Chinese/Filipino restaurant, which it is, that serves good Filipino food -- the owners are Chinese but apparently they grew up in the Philippines and they speak Tagalo! Very interesting right? I personally thought so.\n\nFriendly staff, decent food for very low prices (bfast w/ tea or coffee could be from 3-5$!) -- overall, this place is very casual friendly place! This goes really well with the seemingly friendly neighborhood that it is located in. \n\n I most definitely recommend coming here and at least trying their food! Try the tosilog :]", "author": "Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Legendary hole in the wall. 3.95 3.95!!!! Hong Kong pork chop can feed 2 people. The garlic rice is hella bomb! If you ever get a chance stop here. Great food greater prices!", "author": "Zachary W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "OMG SO CHEAP, so good and fresh!! I can't believe a place like this existed!!! For less than $ 4.50, you get enough food for TWO meals!! I ordered the HK style pork chops, it wasn't greasy, just right! I would definitely come back for more!! \n\nThe owners and waitress was very nice too! It's self service, but I also tipped the old lady who was the waitress serving and chatting with me. :)", "author": "Sophie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "This is a hole in the wall place that is filling and doesn't dent your pockets. I love this place! I've been going here since I was about 14 years old. I'm in my 30's and I still love it the same. I would've expected them to change the paint or do some kind of extravagant overhaul on the building. But it still looks the same as it did when I first went there, suspect lol! But i truly love it here and the staff is very nice and have always made me feel welcomed. I love the bansilog (fried bangus fish) and tocsilog, mmm love it", "author": "Oluyemi O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-03", "description": "This place is what it is. \n\nWhat is it you ask? \n\nCheap and Tastey.\n\n One of my Filipino coworkers who grew up in SF brought me here and i was a little nervous since the place was messy as hell but i look at it like this: FAMILY BUSINESS my kind of place! Oh and just FYI don't get the fish!", "author": "Matteo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Love this place. I always get longsilog or pork chops hong kong style. The definition of comfort food. Everyone that I've introduce to this place to have become loyal customers.", "author": "Tina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Hongkong porkchop! YUM! On Saturday morning when you are craving for Filipino food this is the place to go. Most of the food here are good!", "author": "Beverly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Love this place, reminds me of the Philippines because the food tastes just as good as in the Philippines. I always order the smoked bangus, my favorite boneless fish! Plus it's hella cheap!", "author": "Carina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "Yummy! \n\nAnother place that looks grimy on the outside but is hella good on the inside! It is on mission so most places look a little old and run down. \nParking was easy for us and it was around lunch time on Saturday! \n\n\nI have heard a few people I know talk about this place, so I was looking forward to go. There was a line out the door when I went, but it moved fast! Everything looked and smelt great when seeing what everyone else was eating! \n\nWe stalked a few people finishing up their meal so we could get a seat. \n\nI didn't get a receipt and I was like how do they know what food I got, or where we sat, or that we were seated inside. \n\nBut I didn't know that this was a magic place, with great, reasonable food, and workers that actually knew what they were doing and remembered everything. \n\nThey brought out food out to us, even the stuff we ordered after we sat. Their staff is also fast with clearing/cleaning table so everyone can get in and out. \n\nAll our silong's were great and not greasy, filling, and fresh! Good garlic rice and meats.\n\nI will for sure be coming back here!!", "author": "Derek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-16", "description": "Yes, it's a no non-sense dive.  Most people order to-go.   Most expensive rice plate on the menu costs $3.99, and that's for fish!  Filipino breakfast rice plates include garlic fried rice, one egg over-easy, tomato or pineapple chunks, and your choice of meat.  One plate is good for 2-3 meals!!!  \n\nMeat choices:\nTocino (sweet cured pork)\nTapa (beef cooked in vinegar)\nFried JUMBO chicken quarter (so crunchy, so huge)\nLongganisa (Filipino-style pork sausage)\nPorkchop (fried)\nHong Kong style Pork chop (battered and fried, and my mom's favorite)\nHotdog\nSpam\nWhole fried tilapia\nDaing (fish marinated in vinegar, garlic, salt, and pepper, then dried, and fried)\nTuyo (dried herring)\nSmoked fried bangus whole (Bangus - Milkfish)\nSmoked fried half boneless bangus from a huge fish (my absolute fave...I always order the head part since I love the bangus belly)\nSmoked galunggong (Mackarel Scad - my second favorite)\nBangus sisig ( it's good but not my fave, I like my sisig grilled but theirs is pan-cooked)\nThey also have a lot more choices but I can't remember them all!\n\nLady in the front is friendly remembers the regulars' orders.  She knows I luv fish so she always lets me know when they have something new.", "author": "Bernadette G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "I have been coming here since 1993. This place is affordable and my fave is their tapsilog.  This place gets really crowded sometimes so I always order mine take out.", "author": "Jingle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-29", "description": "It's a Chinese-Filipino fusion dream team! \n\nIt's as if a broke Filipino cook lived in Chinatown district for said how many years and finally, after discovering the best types of dishes combined with cheap effective ingredients, moved over to the Mission district, paid a $500 renting deposit, and set up this little hole in the wall. \n\nTrue story? Nah, but it is how it is.\n\nThe food here is cheap, dirt cheap! and you get more than what you pay for. For about $4, you get garlic fried rice topped with pinapple (the Filipino kick), a sunny side up egg, your choice of the meat, and soup (also a drink too I believe). \n\nAre you serious? Hell yeah I am! So what if it's a little dirty and looks a little ghetto! If your reading this review, I know your broke so save yourself some time and money and fill yourself up without even breaking a 5!", "author": "Albert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "Place was small but food was great.  Definitely a hole in the wall food place.", "author": "Reggie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-02", "description": "2.5 Stars\n\nFirst time coming here. \n\nPorkchops: over cooked and dried\nPopcorn chicken: Not too bad\nSausage links: Really good, but they only give you two small pieces.\n\nAll came with \"fried\" rice, egg and either pineapple or tomatoes. \nOur came with pineapples and they were yummy, couldn't get enough. It was not too sweet or tart, just the way I like it.\n\nAll under $10! \n\nFor around $3 each , it's pretty worth it. I'm disappointed that they over cooked the pork, otherwise it would have not tasted as chewy.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-07", "description": "Store looks like crap, workers look Chinese but speak Togalog, food is good,\nprice is right. Hong Kong style pork chop over garlic rice for less than 5 dollars.\nGotta love it!", "author": "Wilson Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "I came here at 1:30 on a Wednesday, and there was actually a small line forming inside! There were people sitting down and eating too. :) \n\nIt took me a while to figure out what to get, since there were a lot of choices. I read Yelp reviews before I came and I was thinking about getting the HK Pork Chop, but I figured that I might as well try something new.\n\nI ordered the Tapsilog. It came out to $3.25, and I spoke to the cashier in Cantonese. She was really accommodating and nice, and made sure that my friend and I understood what every dish was. \n\nI didn't get to eat the Topsilog that my friend ordered, but my Tapsilog was amazing. There was less beef than I expected, but the sauce was somewhat spicy (to me) and salty, but there was a lot of garlic fried rice. The egg was done nicely - not too runny and not too solid. I got pineapple and it was just... pineapple from a can. Can't expect too much. The rice actually didn't taste like garlic. I was kind of disappointed, to be quite honest! I would have liked a small hint of garlic somewhere, but that wasn't the case. However, the rice was cooked well and it was good. \n\nFour stars. Honestly, the food was cheap enough to make up for some of the oversights - i.e. the rice with no garlic taste and the lack of beef - because it came quickly, tea was good (and came with the meal). \n\nI actually came back here after this visit and ordered the HK Pork Chop and it was HUGE. However, the rice that time was leftover (I got it to go), since it was harder and  eh. But I got tomato this time and was surprised to see that it was raw. It was soooo good. The only downfall was the rice, but again, for $3.50 or so? I can't complain.\n\nWill definitely come back a third time. Hey, who can pass this place up?", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-23", "description": "Love it.. Original prices and portions.. Can't ever go wrong with this place.. If you're near by you must come here for a good Asian/Filipino breakfast.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Superstar is a great place to go for some cheap Filipino food.\n\nI dined in here a few times, but I wouldn't recommend it. The tables and chairs feel really old and dirty. Nowadays I just come here to order take out.\n\nAt certain times of the day, especially around the lunch hours, the place is packed. Many people are in there dining and many people are ordering to go. If you are ordering to go, I suggest calling in ahead of time to place your order. They make your food pretty quick.\n\nThey serve Filipino and Chinese food. I never tried their Chinese food because I am so satisfied with the taste of their Filipino food.\n\nI ordered their Fried chicken leg before, but it's so oily, I wouldn't order it again. I usually stick with my regular, which is Tocino. I love the meat and it's very cheap ($3.25).", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "Superstar is SUPER dirt cheap.\n\nI have no idea if I have been tricked into thinking the food is delicious because of its bottomless-pit low prices, but I don't care!\n\nThe meats are greasy or deep-fried (two giant pork chops are my favorite), the garlic rice is somewhat lacking in flavor and bereft of actual garlic pieces, and the veggies seem decently fresh.  There is no way I can complain when all of that comes in a regular-sized takeout box at around $3!\n\nThis is not a place to plan a proposal, but it's great for just about everything else.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Ah Superstar. How you're always the Plan C to everyone's kick it spot after seven periods of school. I can't thank Jeff and the rest of his family for all the meals and smiles they have given me. Okay, here's the rundown: Silogs-cheap, Service-good for what it is, Facility-Err.., Parking-Street or Safeway. This place will always have a place in my heart.", "author": "Christian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-25", "description": "Food is great. Came here in the gold old high school days. Not the prettiest but the food is decent and cheap. If you are on a budget this is your spot.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "My Ratings:\nQuantity: 4 - Plenty!\nQuality: 4 - Yum!\nPrice: 5 - Cheap!\nLocation: 2 - Closet space with several chairs\nParking: 2 - Metered Street Parking \nService: 4 - Friendly\nSpeed: 4 - Fast\n\nOverall: If I'm in the area, this is for sure the place where I'll get my silog. I can try all of their silogs and still have enough for gas. It's that cheap.\n\nMy Opinion/Story:\nI think if you order their Fried Chicken or their PorkChops, it's sooo worth the money. But if you get their tosino or longanisa, you get only a few pieces but still good.  I won't complain about their longsilog and tosilog since both are only $2.75 each. You only see that price at Costco or you get 2 tacos for that price.  Their fried rice is done right without the overwhelming garlic and you get one egg. Minus one star for their questionable water and coffee. \n\nI suggest you B.Y.O.Drinks.", "author": "Cherryl D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-30", "description": "The first time that I came here, I was so surprised at the price, it's soooooo cheap, it's half a price you would normally pay for entree and side. $2.75 for longanisa combo and about $3.50? Cant remember, but definitely less that $4 For their hugeeee pork chops. If only I live nearby, I'll have that 3-4 times a week. \n\nThe parking is hard but it's worth to wait for. I'm suprised tho, every time we get there, we find parking. Depending on how lucky you are I guess. \n\nI remember when i would skip class just to get food there, once in a while.", "author": "Wendy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "What more can u expect!\n1. GOOD FILIPINO BREAKFAST\n2. COMPLETE MEAL\n3. BIG ASS PORTION\n4. CHEAP ASS PRICES\n5. ALOT OF OPTIONS\n6. FREINDLY SERVICE\n\nJEFF KEEPS THE RESTAURANT BUMPIN AND UP FROM HIS GOOD SERVICE!", "author": "Brian E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "Love the debone bang us fish & Hong Kong style pork chops!", "author": "Mao X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Great Value. Food is very good for what you're paying. \n\nFrom my understanding is cash only. \n\nThe place is a bit rundown but I personally believe it's part of the flare. It's a no nonsense food place. The place still scores 90+ by the food inspector so the place is clean.\n\nMy only suggestion is to have more choices in vegetables besides tomatoes/pineapples. Just a personal reference. \n\nDef go this place a shot. Parking is a bit tricky if you're driving there.", "author": "Steven Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "where do you go to feed two hungover adults a filling breakfast for under $10, whose name doesn`t start with Mc, is a King, or lives in a Box?\n\nSUPERSTAR!! [even the name sounds promising!]\n\nthis place may be a dirty, greasy hole in the wall, but in my experience hole in the walls always have the BEST food.  some of the best food in the city can be found in hole in the walls in Chinatown, TL, and North Beach [just to name a few].  all i know is, the layer of griminess must add that extra OOMPH to make food oh so delicious!  \n\nyou definitely CAN`T beat the price either!  for $3.25, you get two HUGE HK-style fried pork chops, a mound of garlic rice, an over-easy egg, and a choice of tomato or pineapple chunks.  the pork chops were crispy on the outside, juicy on the inside.  the garlic rice was savory and aromatic, with bits of toasted garlic in every bite.  booboo ordered the fried chicken leg, which was the size of one of my pomeranians!  it was very juicy and flavorful.  however, i found it a bit odd that pineapples were an option to be included with my meal...i suppose you need something vegetable-ly to cut through the grease and luckily for them, i hate tomatoes but love pineapples! LoLx\n\nseating is pretty limited and it gets busy quick, so my suggestion is to order to go.  it`s too bad they`re only open for breakfast and lunch, because i would lovee to come here for filipino breakfast at 3AM after a night of drinking and partying!  oh well, i guess that`s where ling nam or colma cafe come in... :x\n\nbooboo and i got 2 plates of food and two cans of soda, all for around $9.85!  being Asian, i lovee a good deal!  we`ll definitely be back time and time again for some awesomee cheap eats!", "author": "Dee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "First thing everyone needs to do is look at the menu that is taped onto the counter and not the one above on the menuboard. The best food here is the jumbo chicken and Hong Kong Pork Chop. You can't get this portion anywhere else with this price. For the others such as Longsilog, the portions are rather small compare to the jumbo chicken and hong kong pork chop, but again you cant beat the price!", "author": "Wilson P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "I was born to eat at this place. \n\nThis place was opened to feed me.\n\nI'm so glad we finally met.\n\nSuperstar I love you, and I will always love you.", "author": "Spencer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-06", "description": "Super star is a hole in the wall type of eatery on Mission street  that has a sign over the door stating Chinese food to go but it really specializes in Philippino style cooking and for the price and quality of food it's a YuMMy deal. My picky Americanized kids love the garlic fried rice and always mix the semi-soft fried egg over the dish. They offer a choice of  chopped tomato or pineapple bits and for the main course my wife like the fried bangus (called milk fish) and I like the toncino or the fried chicken...The list of food options goes on and on with even Spam on the menu! In our household when we suggest Super Star everyone will show up at the table. I think I'll fire up the jeepney and visit them today.", "author": "Royce B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-28", "description": "If you're looking for cheap and fast filipino food this is the place. But the place looks very dirty and disgusting.  I usually just order to go. It would be nice if they could remodel the place of at least paint the walls. There's tagging and cravings all over the place.", "author": "Betsy X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-17", "description": "This place is HELLA dirty. It's cheap, which is always a plus; but it's GRIMEY.\n\nI got food poisoning. I hate them.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "BIG SERVINGS.\nLove the hongkong style porkchops with garlic rice, egg and pineapple slices.\nBut to attract more customers, they should clean the restaurant because it looks dirty.", "author": "Dee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-08", "description": "Heart-attacks for snacks? Nah, breakfast for champions! \n\nAfter a long night of drinking and watching people throw up out of every window of an 11th floor apartment building, it sounds about right that you would need to re-fuel and re-energize. \n\nThe perfect hangover remedy? Superstar!!!\n\nHONG-KONG STYLE PORK CHOPS. I would say \"enough said\", but for those who have never had Superstar you're probably like \"ZUH?\"\n\nMy suggestion: Hong Kong Style (Deep fried) pork chops on a bed of garlic rice and a couple pieces of tomatoes or pineapple (depending on what location you go to). Pair this with some Filipino style vinegar and you have a match made in heaven! Let's not forget to mention that you get all of this for $4. It's bomb.com/nomnomnom\n\nIt's probably not the healthiest of things, but it's soo tasty! Especially if you've been killing your taste buds with tequila and stomach acid. \n\nThis place is definitely a hole in the wall, but it's definitely worth the try. \n\"Superstar\" is not easily seen - the bigger sign says \"Chinese Food\" so keep your eyes peeled. Also bring cash and get there before 3:30/4:00 because they close early.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-21", "description": "The doors of the Super Star Restaurant open into a dingy looking space.  Sheetrock walls cry out in vain for a fresh coat of paint, while fake walnut paneling along the north wall is loaded with carved sets of initials that pre-date the Reagan administration. Two windows face Mission Street, but fliers, pamplets, and advertisements hinder any light trying to get in.\n\nWhile ambiance is lacking, the grub isn't bad.  The sound of orders sizzling on the grill radiates through dining area, and no steam trays are visible from the counter.  Better yet, everything on the menu is under five bucks, with the vast majority of combination plates selling for under four.\n\nI got the Mongolian Beef, which came with alongside a sizable pile of steamed rice. Bargain-priced at $3.95, it was mildly spiced and unconventionally sweet.  While the super-star's rendition of Mongolian Beef is anything but conventional, it's still tasty.  One might even think of it as Szechwan-Filipino fusion instead of the generic Mandarin you might expect.  The staff is friendly and polite, and despite the wear-and-tear on the interior, the entire place looks pretty clean.\n\nUnless you find yourself deep in the outer Mission, the Super Star isn't a destination that's worthy of inter-neighborhood travel.  But if you're in the Excelsior and not far from Geneva, stop by if ambiance is something you'll sacrifice for decent Chinese food at rock-bottom prices.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "What makes this place great is the very affordable prices.\n\nParking is a hassle.\n\nTry to pre-order before u get there or you'll be standing in line.\n\nService is quick and friendly.\n\nDownside to this place is and I hope they read this review is they need to clean up the place. Greasy chairs and table.\n\nAll in all, I love this place....you can't go wrong in whatever you decide to eat.", "author": "Michael m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "This restaurant is not only a place to eat, but holds something much more valuable. I remember being a kid, and waking up to these styrofoam takeout boxes with happy faces on them on the kitchen table. My dad would get home from work at 9am, and always bring me and my big sister some food for us to eat. So I guess it's safe to say I was brought up with this food, and I still love it to this day.\n\nThe place, as far as I can remember, has the same cashier guy, dealing with all the customers. He is truly a nice guy, and I always let him know I was a kid when I first saw him. \n\nThe food is what's special about this place. Very simple filipino/chinese plates that are extremely cheap. They range from about $2 to $3, from tosilog to longsilog, to new plates they have introduced. The plates usually come with either tomato  or pineapple slices, and an \"eeg\". Some of the regulars might remember this, but they used to have a wooden board that said \"blah blah blah w/ eeg\". They misspelled egg wrong and it always caught my eye. Anyways, this is place very old, and has had the same layout since my early years. I hope the business continues to prosper, as I would be truly saddened if they ever decided to close. Long live SUPERSTAR!", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "This is a hole in the wall restaurant with some really good Filipino food made by Chinese people!  All the meals are less than $4.00!  ITS SO GOOD.  I ordered the Longsilog, which came with two sausages, garlic rice, and sunny side up eggs.  MAN. So SIMPLE, but SO.. GOOD.  Everything was on point and its so damn cheap!  Next time i visit the bay, I'm definitely coming back.", "author": "Allen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-31", "description": "I love this place! I went here 3 years ago with my boyfriend, but I've known about it since high school because my friends used to hang here. Jeff always knows our orders because we always call in advance.\n\nLove the: Hong Kong Style Pork Chops, over easy eggs and pineapples mixed in the rice, the tocino, and longanisa all at very reasonable prices! Being filipino, people of my culture who own restaurants ALWAYS overprice food, and I'm glad Superstar makes the meals cheap.", "author": "Ruby E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "This place is bomb. I've been coming here since 2008. I usaully get the tocino which comes with garlic rice, eggs, and your choice of either pineapple or tomato. Order to go if theres nowhere to sit down and eat :) Its usually packed.", "author": "Yeni K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Real good food.. Soooo cheap too.. Fast service.. This is my dad's fave restaurant every time he visits the US.. He is friends with \"Jeff\" now:)", "author": "Annabizelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "Yes, this place is dirty as hell and stagnant of old chinese food. I can't stand eating my food at this spot; the silverware is never clean, the tables have that sticky feel to them (it makes me cringe to even think of what lurks beneath the tables) and the thought of \"How sanitary is this place?\" ALWAYS pops up in my mind.\n\nBut tell me why you can get a fresh WHOLE fried tilapia, fried rice, eggs and tomato for less that $4?? Or a hearty plate of Longsilog or Topsilog for less than $3?? No matter how dirty this place is, the quality of the food and the price keeps me coming back whenever I'm in town. \n\nThis place reigns supreme when it comes down to a poor man's breakfast.", "author": "Elijah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "Ah this place! I remember going here when I was young and ordering chickensilogs almost everyday. Probably explains why I was so obese.\n\nAnyways! Fast forward to today. A broke college student has to eat somehow! Thank God for Superstar! \n\nParking can be a pain but Safeway is across the street so just park your car over there and jaywalk on to the other side. This place is truly a hole in the wall. It's so old and really grimey. The floors are dirty and it seems as if no one buses the tables, which is why I get my food to go. But once you overlook the aesthetic qualities of Superstar, you'll find that their food is truly what makes them.\n\nPlus one for the man who takes my orders! He's always so nice and seems like he enjoys his job. :) The silogs are freaking $3 man! My favorite, the longsilog is always perfect! The egg looks so smooth and the tomatoes are fresh. The longanisa is amazing! The fried rice is okay.. I've had better but hey! It's freaking $3!\n\nThey're always busy no matter what time of the day I go. Minus one star for cleanliness though.\n\nHole in the wall and cheap eats, go to Super Star!", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "Literally a hole in the wall, just the way I like it.\n\nI always go for tapa (beef) when I'm trying to get my silog (garlic rice & egg) fix, and this place serves up a great one for hella cheap. Only $3.25!\n\nUnlike other places that serve tapsilog, their marinade has that distinct sour, almost vinegar-like aftertaste which takes some getting used to, but still good altogether.", "author": "Juno M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "I would give it 5 but let's be honest it's a bit pokie looking. \n\nFour stars for amazing amazing food!\nPrices are unbelievable! \nAnd service is good as well. \n\nHong Kong Pork Chops are always a must and you can't complain about the place when you have big excellent porkchops for 3 dollars in front of you. \n\n\nHole-in-the-wall. Great food:) love it.", "author": "Shelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "The first time I went here I was a bit skeptical. It looked grimy, it smelled like the Philippines, parking on a steep hill was stressful, and the business had a menu board displaying Chinese cuisine which no one ever ordered from, but I just had to give the $3 silogs a try. Mmmm, and from the greasy goodness of the hong kong style spareribs, to the garlic fried rice and pineapples on the side, I fell in love with this deliciously cheap hole in the wall!\n\nMy friend and I took our orders one time to fort funston for a little picnic and there was this cute stray dog that was just staring at us. We looked away for a quick while over to the hang gliders and before we could even run away, the dog took hold of my friend's pork chop. \n\nSuperstar is yummy, and apparently the dog thinks so too.", "author": "May D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "OK so I know we are trying to eat better for ourselves in this new year but I can never turn away this place and it's counter part. I dont eat pork so that takes most of the menu away for me. However I do not mind. I always order the fried chicken and man it is worth every greasy bite. you pay $3.40 for a huge mound of garlic fried rice, a sunny side up egg, and pineapple chunk then a large serving of yummy fried chicken.\n\nI will say that this is a great place to go when you hung over and want some greasy food.\n\nOh how I love you Superstar, just wish you were open late night", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "Cheap, fast, delicious Filipino food!\n\nHong Kong Style Pork Chops = delicious, melt in your mouth.\nTosino, longanisa, bangus, fried rice = all delicious!\n\nMake sure you get here early on weekends, otherwise it gets bust fast.  \n\nDefinitely a whole in the wall kind of place, may look grimy at times (especially small kitchen) but do not think much of it.  Food is good!!\n\nHow much better can it get to get meat, rice, egg, tomato for less than $4?! YUMMY!", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-21", "description": "CED:  Describe this place in 3 words:  Cheap, great, and portions.  Came here right before going to a theme park, it was the greatest decision.   haha.  So if you're hungry for some great breakfast, just go here if your in the area; or take it to-go.  \n\nPros:\n-SO cheap\n-Decent portions\n-Taste goooood\nCons:\n-Small place", "author": "Cedric R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "This place is the true definition of a hole in the wall. It's right across the street from the Safeway on Mission, right off of Geneva and when you look at it, it's looks like a random crappy Chinese restaurant and I'm not going to lie, the inside doesn't change that opinion. \n\nHOWEVER, the menu is LEGIT! It is a Chinese restaurant, but I have always gone for the Filipino food. IT'S SO CHEAP AND DELICIOUS!! I usually order the Longganisa and it comes with a heaping pile of garlic rice, pineapple slices and an egg and it's only like $3!!! I HIGHLY recommend the fried chicken too. Once you go, you will be hooked, no joke!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-03", "description": "Yes the food is fried and greasy but it's GOOD and it's CHEAP. \n\nGet the HK style porkchops and call it a day.", "author": "mino b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-15", "description": "The definition of hole in the wall.  Ridiculously inexpensive pilipino comport pood, Superstar kept me going in my early starving-college-student days at CCSF.\n\nThe Tocilog rocks, and do yourself a favor and get it to go.  There's an absolutely disgusting ghetto ambiance to this place that for anywhere else I'd dock at least two stars!  But here a charming part of the experience is taking it home and eating straight out of the styrofoam carton.", "author": "Gary D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Been coming here since my middle school days. Which is over a decade ago for 2 reasons.\n1.) Quantity and quality of food.\n2.) Price. Best bang for buck.\n\nYou will not notice this place if you dont actively look for it. You can pass by it every time even if you drive by it everyday. It's a classic hole in the wall. Not the cleanest, but thats one of the reason that make it what it is.\n\nThey switched owners a few years ago and now they serve classic chinese comfort food along with the Filipino food.\n\nThe food is not the healthiest at all, But then again you dont come here for healthy food. \n\nClassic spot for Filipino and Chinese comfort greasy food in the Excelsior district.", "author": "U L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "Tb comes here sometimes while I go the other one. \n\nBut for lunch today we came here,\n\nWe both ordered Bangsilog plus longonisa for him and Tocino for me.\n\nI should have taken a picture of our plates because, we wiped it out...lol.\n\nif you need your PINOY SILOG fix...come here.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "this hole in the wall restaurant is filled with artery clogging goodness for just $3!\n\nit seriously can't get any better than $3.  When ever i'm in san francisco i ALWAYS try to make a stop here.  All combo plates come withgarlic rice, an over easy egg, your choice of meat and either tomato or pineapples.  the pork chops hong kong style are the best way to go.  you always get atleast 2 large pieces, sometimes even 3 pieces.  It's more than enough to fill any appetite. \n\npersonal preference- the pork chops are the best way to go (hk style). the chicken is a good size and less greasy.  the beef tapa is so-so, and the bangus is just like any other bangus.  they have other breakfast foods 'silog' style, but i personally dont eat breakfast so i've never ordered it.\n  \ndown side about this place is that there is no personal parking spaces, but you can always park across the street at safeway.  the venue is also quite small so it's not too good for big groups.  seating is very limited, which is why you can always order togo.", "author": "Cheryl E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "Good, cheap eats. Not stellar or special but not bad at all. It gets the job done. Def a hole-in-the-wall spot that is good when you just want something and anything to eat.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "I have been going here for over 15 years now and it's STILL the best!!  I tried Gateway Kitchen in Daly City and no, they aren't the same.  The prices here are still low and the food tastes as good as it did back then.  I love their garlic fried rice, the tapa and the pork chops.  I also had their tocino and I like it too but prefer the tapa. I always get pineapple with mine, too. The people that work there are also nice.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "I've been coming here since I first moved to SF, 10 years. Their prices are awesome compared to other locations that serve the same type of food. The PORTION of the food is more than enough! The owners are so sweet. Please don't be fooled by how the outside looks, this place is worth your money! I have been coming here for years and will never stop!", "author": "Wonderful L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-03", "description": "Where else can you get a meal for $2.76?!  And the plate isn't skimpy either.  I had a tuyosilog (with at least 5 pcs of fish), garlic fried rice & tomatoes (you can also get pineapple instead of tomatoes).  \n\nThe place is really small & grimy.  I don't think I can take my mom here for lunch, she'll be disgusted.  And this a cash-only establishment.", "author": "Jo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "excellent dirt CHEAP filipino food.  they got all the choices and some chinese food up on that menu as well.  if you got $1.95+tax you can get garlic rice, an entree and some egg/tomato.  it WILL fill you up, no doubt.\n\none of the stars is gone due to parking, cleanliness, and lack of seating.\n\nbut stand in line, pay, and take it home to enjoy.  and then you'll know why this place gets the 4 stars ... at least.", "author": "Pia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-17", "description": "So, I just had some today for lunch. haha. \n\nIt's really cheap and you get a bunch of food. The food is good for the cost. the silogs always comes with an egg, garlic rice, and either pineapple/tomatoes. I'm half filipino, and i think I've pretty much tried most of the filipino silog things there - longanisa, toyo, bangus, porkchop, chicken, etc. \n\nI wouldn't sit in at this place though b/c it's really small and it's dirty. The best way to go is to take out. It's hard to find parking, if anything you could probably get away with parking at safeway across the street. Good place to get cheap, fried, greasy chinese/filipino food.", "author": "Breniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-07", "description": "Super Star has been along time favorite of ours in the \"E\".Food is cheap,quick service and great price.A nice Chinese/American family preparing some simple Filipino dishes.The tosilog,longsilog and Sarangani bangus are so sarap.It reminds me of Gen San.\nGen San is the tuna capitol of the P.I, It is also the hometown of Manny P.\nBe prepared to wait a few minutes for your favorite meal,but it is woth it.\nYou will see regulars every morning seating at the usual table sharing good conversation and food.What more can you ask for in general.\nRemember to \" Live ,Love and Eat\"We hope you enjoy it also.Peace to all.", "author": "Scott Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Fair pricing with delicious food. The HK pork Chops are always fresh and crispy and they don't make the food until you order it. Jeff and the aunties are alway nice and courteous. A hole in the wall, but i love the food here and have been a loyal regular there for more than 6 years. Their 50 cent pork and vegi soups are the bomb too.", "author": "A A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-26", "description": "Herra good!  What that mean?  It means good food for a good price.  I came here after getting hung over for the first time.  It said Filipino restaurant on the sign, but the cashier was speaking Chinese to me.  I was like \"Whoa dude, I'm still kind of effed up.\"  Apparently, I wasn't imagining things though, because I have been here sober as well and the restaurant was still run by Chinese people.  Doesn't matter though, food is food.  These days, people are making other cuisines anyway.  No biggie.  Anyway, back to the restaurant...  \nYou can't beat the price, quantity and quality.  For under $5, you get a great-tasting meal.  I usually order the Hong Kong-style fried pork chops.  Delish.  I've also had their Fried Chicken and my friends swear by the Longsilog. \nEverything just goes so well together: the fried egg, pineapples or tomatoes, and the GARLIC RICE!  Pour some White vinegar on this, and we're good!\n  I'm not Filipino by blood, but every time I come and eat here, I just want to be called the Pacman and knock someone out, sing some karaoke; you get the idea.  \nI'm a San Francisco transplant in SoCal now, and for the life of me can't find something similar to Superstar down there.  The first place I call up my friends to go to when I come back to San Francisco is Superstar.  No lie...\nThe place gets packed quick, so you might have to wait if you're in a big group, which we always come in big groups and haven't had that problem.  Just saying, if you happen to go in a big group and I go with my group, one of us is going to have to wait.  \nParking is street parking.  Either you park on the main street, which are metered or go up the hills to find residential parking.", "author": "Brandon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Yes, word to the wise, get take out and park on the Safeway lot to save the stress of parking here!  \n\nI'm a fan of this place because it is a true Filipino restaurant with really authentic unhealthy as heck food.  This place is cheap, probably the cheapest place to get Filipino breakfast in all of California though!  The food tastes pretty good too, so it's decent quality.  I particularly like the Tocilog, which is cured pork with rice and eggs.  True Filipino breakfast I tell you... go to Ling Nam and you'll get a better dish, at double the cost!\n\nMaybe we can call this the Little Caesar's of Filipino food?", "author": "Rodel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-30", "description": "Well what can I say.. 3 bucks for a Filipino breakfast.. can't beat it if your low on moola. Hong Kong style pork chops were not bad at all.. I'd come back here, but if your looking for the ambiance and a place to take a hottie to impress .. this place it not easy on the eyes. Tapsilog w a side of Sabao! Live a little and try this place if you are feeling like a 3 dollar pimp!", "author": "Winston R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "JUMBO FRIED CHICKEN!\n\nthis place is a hole in a wall in the middle of a busy Mission Street! call ahead to place an order because parking is a pain!", "author": "Karen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "The jumbo chicken was good but  next time i will get the hk style porkchop.. it was good price for food..", "author": "Wilson W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "MEMORIES of my superstar timeline...\n\nMy mom & grandpa first brought me here in the 90's to try their infamous bangus belly, and then during my high school years it evolved into the \"local cut-out spot for lunch\" and then everyone's favorite became the \"Hong Kong Style Pork Chop\" which featured 2 chops, each one the size of your face, and it was so crispy yet tender when you bit into it. OH! And the fried rice is topped with crispy minced garlic that crunches in your mouth but isn't too strong or overpowering. \n\nOver a decade later, Superstar is still serving the same menu, with the same low prices, and they're ALWAYS packed. The only downside is that the environment isnt that clean, you will be sorta suspicious regarding the cleanliness of your food, and it leaves a greasy aftertaste in your mouth that you'll be burping/smelling/re-tasting all day. It's totally budget-friendly, so if you're hungry and broke, this is THE place to go. But I ALWAYS wonder how can they possibly make ANY money selling those gigantic portions at those dirt-cheap prices...", "author": "Joraine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "if i can give them 10stars i will give them... hong style porkchop is the best and their fried rice is sooo good large serving for $4 what?????? i usually get porkchop and their chicken is really good too..", "author": "Gladys D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-20", "description": "My all time favorite Hole in the Wall place. True the place was dingy and cramped but the food is superb! I live in Livermore but grew up in San Francisco but I always make sure I stop by and take some food home every time im in the area. Very reasonable price for a hefty portion of food. You'll keep coming back.", "author": "M Rinna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "I miss those college party nights or should I say the morning afters where we would wake up to stacked boxes of superstar heaven. My awesome friends who weren't KOd would take it upon themselves to venture out and buy stacks of the Honk Kong style Pork chops for the rest of us to wake up to.\n\nThe restaurant itself is pretty small and the cleanliness is very questionable. But the meals are only $3 and they pile it high...to the point that the to-go box can barely close. \n\nThe garlic rice can be hard at times and I hate that they replaced the tomatoes with pineapples...but for $3, I'm not complaining. \n\n\nThis is the best meal to wake up to when you have a throbbing head.", "author": "Bianca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-27", "description": "I can't believe it took me 3 years of living practically next door to this place to finally give it a try. I am something of a Filipino food novice- I don't know a bangsilog from a topsilog- and a little scared I'm accidentally going to order balut, but the menu at Super Star helpfully breaks it down in plain English for whyte boyz like myself. You know exactly what kind of deep-fried meat you're going to get. And that seems to be the MO here- deep-fried meat served with a heap of greasy garlic rice, a fried egg, and sliced tomato. \n\nI had the hong-kong style pork-chop on my first visit. 2 crispy-fried pork-chops w/ rice/egg/tomato for 3$?! That's insanity. Does this place actually make money? Are we sure that's pork underneath that crispy-fried exterior? Do we really care? Whatever it is, it makes an excellent hangover cure, and a very satisfying brunch. Katie H. got the baconsilog which included 7 slices of bacon with rice/egg/tomato for like $2.75. For sheer value that is hard to beat. I will definitely be back to Super Star- after my arteries soften, when I need an infusion of savory greasiness to coax my alcohol-drenched brain cells from their fitful, delirious, morning-after malaise.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "I really don't like eating Flipino food besides my parents cooking cause i'm really picky but this joint was GOOD! i expected this place to be run by filipinos but they're chinese selling filipino food. They sell mostly breakfast foods and their garlic fried rice is BOMB. I love the Hong Kong Style Pork Chop which is HUGE and CRISPY.  I also love how it's so cheap. Me and my boyfriend only spent $6 on food. I hate how it so cramp and everything is breaking apart like their counter in the front.  They even have a sign that says don't eat you're to go boxes inside the resturant which i found pretty funny.", "author": "Janice V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-23", "description": "My monster-sized pork chops and garlic rice w/ eggs and tomatoes truly hit the spot.\n\nThis is truly a hole in the wall type spot...VERY tiny.\n\nYou can beat the price though, me and the bf both ate for  under $9!!!", "author": "Jade B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-31", "description": "There are two places that sell \"Filipino breakfasts\" for $3 on mission, this spot and at Gateway Kitchen on crocker and mission in Daly City.\n\nSince its so cheap, for a little extra you can combine dishes or ask for an extra egg. I suggest tocino and hong kong style pork chops (deep fried battered fatty pork chops) with an extra egg.\n\nSuperstar's garlic rice is too dry and isn't as fresh as Gateway Kitchen's. Other than that the menu/dishes are the same. I still come here though if im closer to it than to Gateway. Cheap is always a plus.", "author": "Albert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "I wanted to give this place the respect it deserves.  It is a small spot that keeps it simple and does it right.  I love the garlic rice that comes with all of the Filipino breakfasts (which is good for lunch and dinner too).\n\nThis place has been good to me since high school ... I remember buying Tapsilog for $2.11 total.  That's right, $2.11.  I rarely had more than $3 in my pocket ... for the price you pay, this is top notch gourmet dining.  \n\nSo, to Superstar, thank you for feeding people at dirt cheap prices.  And thank you, Mission drivers, for not hitting me as I run across the street from the Safeway parking lot.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "this place may look like a hole in the wall but its the BEST hole in the wall to get HK Style Pork Chops and Jumbo Chicken! GOTTA TRY THE CHICKEN! and its cheap and fast too!! i LOVE LOVE LOVE IT", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-07", "description": "I think the ratings are high because the food is so cheap here. A dish with MEAT [looks like it, has the name of it, tastes sorta like it], a ton of garlic rice, and a fried egg for less than $3? An entire fried tilapia for $4? Where are they getting these ingredients? It doesn't even make sense! The quality is definitely reflective of the price, even though the quantity is not.\n\nI suppose you can come here if you're broke or whatever, but I think for the same, I'd rather get a burger at In-n-Out. For all other silog cravings [silogs aren't exactly healthy as it is], I'll probably go elsewhere. I'm sure the people are nice here. The spot is pretty grimy. You get a lot of food for paying next to nothing. So it's really between MEH and A'IGHT since I'm not overly picky.", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-22", "description": "First off, I would like to refute all the negative comments about this place...\n--You guys complain that the food is greasy... but since when was Filipino food NOT GREASY?  \n\nAnyways,\nMy family, friends, & I have been coming here since I was BORN.  My brother went to Balboa HS in the early 90's where race wars occurred & all the Filipinos used to be posted at Superstar. Even today, excluding the gang wars, almost EVERY SINGLE BALBOA STUDENT has dined at Superstar. It's tradition =D\n\nOh, & you can never complain about a $3 meal =)\n\n\n& PARK AT SAFEWAY ACROSS THE STREET. Save yourself a dollar from the street parking. You can get yourself some sabao or an extra egg or something lol\n\n\n\nLAST BUT NOT LEAST,\nif you're a bit low on self-esteem just call the number & Jeff would answer the phone, \"Hello Superstar, how may I help you?\"\n--He makes you feel like a SUPERSTAR. lol", "author": "Kim D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-25", "description": "I went to Balboa High and I remember seeing a lot of people going to either Hawaiian Drive Inn, Dakine, or Superstar. I always went to the first two because I've always heard of Superstar as a Filipino restaurant and I don't really know Filipino food that well.\n\nI actually went in recently and was surprised. The place is literally a hole in the wall and is a typical example of a local greasy spoon Asian-style. The food is quite plentiful and cheap. The restaurant's decor is non-existent because they simply don't have the time to manage it. The restaurant is packed and it seems like they are all locals. It is a favorite amongst Filipinos because I always see a lot of them eating in. The food is prepared really quickly and definitely with its fair share of grease and them some.\n\nFilipino food and Chinese food are both served here and they're both really good. I had the garlic fried rice and it looks like they use an entire clove or two of garlic for the fried rice. Although I may not come back because the hygiene just looks a bit too questionable for me, it was definitely tasty and a good experience.", "author": "Rick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "Lunch plates for under $4. My coworkers got me hooked yo this plates by bringing me here years ago. The owner keeps things simple with a simple menu. They're from Hong Kong but they cook select items with Filipino influence. Their sausage rice and fried chicken leg rice are my favorites. On top of that, the rice they serve is garlic fried rice which is great.\n\nThe one problem is, since they're close to Balboa High, they get a lot if their students during lunch. Too many of them show disrespect for property by writing on and messing up the restroom wall. I cannot blame the owner for mot improving the decor.", "author": "H K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-24", "description": "Cheap tasty mom and pop shop. Had the HK pork chops and they were good. They give you a huge portion for only $3.50. I couldn't finish it so had the rest for dinner. The meal also comes with tea or coffee.", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-16", "description": "I can get down with the ghetto!!! \n\nThe food is goooood! I mean for the price and the size of the servings! It's just what we need in this enoconomy. Starving folks - for $5 bucks you'll get a meal with a can of soda.\n\nHong Kong Style Pork Chops, Bangsilong, Tapsilog with eggs! Ummmm yummy for my tummy. Its comfort food that you have to try. This place doesn't get the award for the best decor, but if you want to fill your tummy with good simple food and generous serving... try them one out!", "author": "Jules V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "Ok I'm real hesitant on posting a review here because I'm scared this place will start upping it's prices and this great cheap eats place will no longer be that. =\\ Oh what the heck.. Yelpers share yes? Here's my hole in the wall place to get to go food. Introduced to me by some friends, they said they could feed me for 3 bucks. In disbelief, they took me to Superstar., We got to go orders of Filipino sausages and rice with egg and veggies for 3 bucks!?!?!?! WTH ummm was I stealing this food? Oh boy 3 bucks?!?! Pricing error? Seriously I didn't get it but whatevers because it smelled so good. We got back home and I opened up my little box of yummy goodness and chopped down. \n\nFood was delish and price was great. I haven't tried any of their other stuff here but I'm pretty sure I'll be back for some cheap good eats.", "author": "Allan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "-1 for having a dirty place.\n\nOther than that...\nyou are a superstar!!\nI have been craving Filipino food for awhile now because I haven't had some since I left home to move here. My cousin told me about this place he said it was really good, he suggested to order the fried chicken.. Ehh I have fried chicken all the time so I decided to try another meal I ordered a bansilog meaning bangus (fish),garlic rice, tomato and eggs. I lalalove it! Makes me miss my grandma's cooking. My cousin got the chicken and it was huge! This place is pretty cheap too! $3 each and it comes with all of this! \nTotal: 8.50! For two meals. Goodbye mcdonalds mini meal!\nYepp. :)", "author": "Anna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "4 stars for the delicious food and super fast service. Seriously, me and my bf only had to wait like less than 5 minutes and our food was done! Good thing too because I was STARVING!\n\nMy favorite here is the Hong Kong Style Pork Chop-silog. I get 2 humongous porkchops, a big helping of rice, an egg sunny side up, and diced tomatoes. All this for $3-4!!!\n\nThe only reason I didn't give it five stars is because the place is a little dirty. I guess since their food's so cheap they don't have enough money for repairs.\n\nFor anyone wondering, they DID pass through the health inspector. They've made some sanitary improvements to the place so I think their score went up. I saw their food score card displayed in the glass counter and THEY PASSED.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-15", "description": "ok I used to visit this spot regularly in my teens would of given it a 5 star rating then simply because of the quantity and the cost. haha been back recently the food is still the same quantity of quality and cheap as hell.\n\nnot a spot to take a date or maybe haha, but if you want something fried or have that itch for some cheap filipino if not chinese food this is the spot to hit up.. I prefer the silog plates that is just me, large deep fried pork chops, tocino (cured sweet pork), longinisa (sweetened filipino sausage), chicken and several other choices that come with garlic rice and i think an egg haha.\n\ninside is how do i say dirty in a nice way haha, runned down chinese restuarant that serves filipino food which is wierd but they make it work\n\nfood *** for quantity 5 stars easy quality maybe just a 3\nprice $ dirt cheap u can pay for yourself, a friend, a friend of a friend, and a cousin and still have change from a $20\nambiance umm no stars", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-02", "description": "Smoked Bangus with egg and rice for under $4?\n3 combo meals for under $10?\n\nThe is like a club line leading to some oh-so-bad-for-you greasy, fatty goodness. Well the garlic rice isn't greasy, and the bangus is boneless and good size.\n\nI don't eat here, just because its always packed and comes off grimy but I love the prices - and we all know that janky-ass spots that stay open for years and years got it going on. Um, the tocino is fatty, but what can I expect for a $3 meal with a few chunks of canned pineapple?\n\nAnd the food comes out quick, flash fried, and I know they must have the rice constantly going...", "author": "Cheryl D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "4.5 Stars.\n\n\nthis place is pretty much a hole in the wall.\n\nyou get what you pay for. and the portions do not disappoint.\n\ni got the hong kong style pork chop breakfast, and tho it was a bit greasy, it filled me up, and if you're broke and have only $3, you really can't complain, and it doesn't even taste bad at all.\n\nits all about the value here. its good to your pockets.\n\nthey should really open up one in downtown san jose. this place could make bank, especially if open late.", "author": "Phil T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "Now this is the place to go if you're B.O.B....a baller on a budget. This hole in the wall serves up huge helpings of either chinese or filipino breakfast food at rock bottom prices. My absolute favorite is the Hong Kong Style Pork Chopsilog...it's great! Battered and fried pork chop, fried rice and a fried egg....usually comes with tomatoes or slices of pineapple as well...but as far as I'm concerned that's just garnish.\n\nCome here if you're feeling the pinch of the recession.", "author": "Derrek O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-13", "description": "Superstar where all the cheap, broke, ghetto folks enjoy eating Filipino/Chinese food\n\nBeen coming to this place for 10 years now.\n\nI tried the Reg Pork Chop, HK Pork Chop, Tapa, longansis, milk fish, and tocino. All of them are great especially the price! Yes it is Chinese run but they can cook a mean meal for hecka cheap.\n\nFunny after many years, I still have not dine in this nasty place. I mostly see old Filipino folks enjoying eating in.", "author": "DVS A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "OMG this place is so cheap! Breakfast for under $3! I live in Carson and you can't get a Filipino breakfast here for that price.  We stop here for a quick breakfast before exploring the city. We got the Tocino and the Longanisa breakfast both for about $6 including tax! The longanisa and tocino breakfast comes with a huge scoop of garlic rice, an egg, and pineapple or tomato. Yes this place is a total hole and the wall and it doesn't look that clean but the food is decent for the price.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-21", "description": "With all the reviews already written about Superstar, this one will be another one of those that raves about the decent food for an affordable price. I've been here several times since being introduced to this place last year, and I still can't believe you can get a full meal for less than $3.00. I've had pretty much the main lunch menu....the Tasilog, Longsilog, HK Style Pork Chop, and Fried Fish, and I can vouch for every one of them. \n\nIn a take-out box, they give you a decent portion of the food. The garlic rice, with sprinkles of garlic on top, is probably what will fill you up the most along with a side of fried egg and your choice of either pineapple or tomato. \n\nThis place isn't the most sanitary place on the block, but people seem to love coming here. Because of this, I've only had take-out and those who decided to sit-in seem to enjoy their food regardless of the environment. O well. If I'm in the neighborhood and looking for a cheap lunch (btw... they're only open during lunch hours), I'll be sure to drop by.    \n\nOn a side note, you're probably wondering why this Filipino restaurant is owned by a Chinese family. My curious gf asked the woman at the register and she told us that they used to work for a restaurant somewhere else and made Filipino food. So... they probably figured they'll make a pretty good business making their own style of Filipino food.", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-08", "description": "Filipino Ghetto Food! I love it a LOT! Great price and food! \n\nEvery time I miss eating Tuyo, I'll go over here and eat!", "author": "Nikkie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-11", "description": "I was here over a year ago during a trip with one of my girlfriends.  Unfortunately, in my own neighborhood we have very little access to filipino eats because there isn't much of a demographic.\n\nANYWAYS.\n\nI fixed on some tocino and got my grub on with a group of 8\n\nIncredibly greasy but not at all disappointing.  The place is of course on the dirty side but i didn't come for the ambiance.  I paid my $3 and got what a I paid for.\n\nIt's a no nonsense place.  You don't pay for the service or the setting when you're a starving college student.\n\nPerfectly affordable grease.", "author": "Cayleen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-05", "description": "My favorite dish here is the Hong Kong Style Pork Chops. Everyone reviews about this dish because it's yummy and filling! It only costs $3.95 plus tax. For the price, it's completely worth it. It comes with the choice of tomatoes and pineapples. I prefer the pineapples over the tomatoes any day. \n\nThe only reason I wouldn't give this place its missing star is because of its presentation. The environment just makes me a little uncomfortable, even though I grew up in the neighborhood. It's not that it's unsafe, I just doesn't feel that clean.", "author": "Angel V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "Got 3 dollars?  Then come to this dirty ass place.  The walls are gross, the ceiling is gross, and the kitchen looks like a slimy chinatown alleyway.  All the menu items are misspelled or missing letters.  The menu has cheeseburgers, fries, and 95 cent onion rings.  They were out of onion rings indefinitely.  I doubt they have the other items too.  But you're not here for that.\n\nYou're here for their 3 dollar filipino breakfasts.  Greasy ass porkchops, 1/4 chicken thigh, or some strange deep fried fish that my co-worker got.  Comes with stale tasting garlic rice, a lightly fried egg and a couple cubes of tomatoes.   Great place to bring your gf if you're low on cash money.", "author": "daniel l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "i came in hungry, can't get out i'm too full. very cheap. thank you superstar for being there to fill our stomachs. been eating here for years and i'm still alive. jeff don't raise your prices.", "author": "Nelson B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-09", "description": "My friend took me here - a drive from Russian Hill- just to get a filipino style breakfast ie tapsilog... This is the kind of cooking grandma makes back in PI- sweet, spicy langonisas, fried chicken and fried pork chops- think of the equivalent salt and pepper pchops... its good and comes with GARLIC fried rice...oh and suka with peppers as a condiment-- u cant go wrong here...tayo na!\n\nUPDATE- 3/25/2007\nI came back recently to check up on the fried chicken- as I remember them being really good- and well I think its good enough to put on my fried chicken list...and well for the price of just over 3 dollars- is quite hard to beat!  Chicken is fried to a delicous golden brown crispy skin and quite tender- its made to order...note this is not the usual batter style y'all r used to- so dont expect that here :-)  I was a little disappointed with the garlic rice- it was on the dry side- meaning it wasnt a fresh batch...boo hoo hoo...\n1-Taste/Flavor 7/10\n2-Tenderness/Succulence 7/10\n3-Crunchy factor 7.5/10\n4-Overall appeal 7/10", "author": "Arissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "Who doesn't like cheap food? $3 for a whole plate, who can beat that?\n\nThis place is small but it makes up a lot of what they serve. There are many silogs and chinese dishes to choose from. Best place to come here when you wake and bake!\n\nThey used to fill up the to go box though ;/", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-04", "description": "Super cheap prices means fishy business...\n\nAte here once with my BF a couple of months ago, with the suggestion of our dear friend. We ordered tapsilog and tosilog. The food came out as expected, greasy and satisfying. When my BF went to the bathroom, he came back with a look of disgust. Turns out they keep their rice and other ingredients stored in bins nicely seated on the WET, GREASY FLOOR. After paying less than $10 for four meals (including 2 take out), we left with a sense of nausea. Not because of the food, but because of what we were gastrointestinally anticipating over the next couple of days. Suffice to say, we were all right.\n\nThough the prices are astronomically cheap, I would have to pass. I would rather pay the extra premium to have my food prepared in a cleaner kitchen environment. I wonder what the Health Inspectors will say when they stop by...", "author": "Carloalexi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-25", "description": "I call this place super farts because the unbelievable amount of farting that ensues after eating here. Going back to class after eating here is a BIG mistake; i usually get the cold sweats during class holding it in and dont even think about going here before a test. I guess my stomach isn't used to all that grease \n\nNothing beats the price at this place, you get a hearty breakfast which will knock you back to bed after eating this stuff. Their garlic fried rice is the best and nothing beats their tiny over easy \"Eeg\" (look at the menu) with a side of delicious pineapple. This is really greasy food, but if you're hungry with 5 dollars in your pocket this really hits the spot. \n\nYes the place is really run down but for around 3-5 dollars for a huge plate you cant expect much. Nothing beats eating a porkchop with a fork and a spoon (tip: you have to ask for the knife).", "author": "Eric N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-22", "description": "Yes, it's a hole in the wall. Yes, it's a bit scary. Yes, it's damn good. \n\nThe first time I went, I had to be talked in to ordering. See, I'm not the hole in the wall type, but if you talk me into it, I'll try it. Once you get past the look of the place, the food is actually delicious! This is food like my Grandmother makes it. Good home-style filipino breakfast for cheap! Excellent for the morning after getting really drunk and needing to eat something greasy and good...and you can feed 3 people for under $10.", "author": "Ron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "Okay, I'm not going to lie, this place is pretty disgustingly dirty compared to these other restaurants in the city. But i would consider this as a hole in the wall type of place. You Can NOT beat the price. 3.50? 3.75? FOR A PLATE OF FOOD?! Are you kidding me?! way cheaper then mcdonalds, or any fast food joint for sure. Especially with the amount of food you get. Only downside is ...its super greasy and fattening. But who cares right? I love filipino  breakfast food, and I always order the hK style porkchop with garlic rice (bomb) and a side of tocino or longanisa.", "author": "Colette P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-03", "description": "I eat here every so often when I crave for Longsilog.  There fried fish is pretty good also.  \n\nYou wont need to eat another meal for the rest of the day, cause its greasy. \n\nIts a good bang for the buck.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "Real delicious and cheap food here.  A small family owned business providing cheap food for the locals.  \n\nOrder the fried chicken, with a double scoop of garlic rice.  Its sure to turn that frown upside down.", "author": "Chai S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-08", "description": "Just a dirty, dirty place.  I just can't stand in there, waiting for my food, while some lady is trying to \"tidy up\" the already stricken ambiance. I feel like I'm in a horror flick as in the bathroom scene from \"Saw\". I get fuckin' scared here. \n\nThough food is decent and cheap, their dirty place can leave more to the imagination. If Super Star possibly raises their food by a buck, they could afford to fix their shabby tables and paint their walls.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "I ABSOLUTELY LOVE THIS PLACE. Thanks to a friend introducing this to me, I can't get enough. This is the place to hit up if you're looking for a cheap, but delicious, fulfilling meal. I ALWAYS get the tosino with hong kong style porkchops. My absolute fave.\n\nThe place may be run down, and a bit untidy. But go here for the food! They definitely have good service. Nothing but smiles and kindness. It's definitely worth the visit.\n\nRemember cash only!", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-18", "description": "They open at 8:30 AM. There are usually people waiting around for them to open their doors.\nFood is good. It might be a little greasy, but it is Filipino food.\nThey pretty much specialize in Pinoy style breakfast which comprises of garlic fried rice, egg and a main meat component.\n\nTagalog Breakfast nomenclature:\nfixed component\nItlog, egg, usually fried\n\nvariable component\nbangus, milk fish\ntocino, pork\ntapa, beef\nspam, processed food product\n\nSImply combine the syllable word for egg, itlog,\nwith a syllable from the variable component.\n\nFor example, Itlog and Bangus\nBecomes, Bangsilog.\nWhich is Fried Rice, Milk Fish and  Egg.\n\nThis is pretty standard fare. Good and cheap.\nThe only caveat, it's a little dirty.", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-17", "description": "My co-worker brought me to this place years ago, food is cheap but good! I always order the tocino w/ Garlic rice, scrambled egg & pineapple, I go here for lunch now & then, the workers are very friendly only thing is that it is literally a hole in the wall! The place is small looks dirty but theyve gotten a good rating as far as an inspection card goes so its safe. Bottom line: It's cheap, good pinoy food!", "author": "Bobby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "I haven't been to Superstar in at least 7yrs and had forgotten about the place to be honest until last week.  My brother texted me at 7:30am and  asked if I was awake and if I was interested in having breakfast somewhere. Being that it'd been a while since I had breakfast with him, I decided to get my ass up and join him. \n\nMy brother told me that he wanted to eat at this fancy place called \"Stacks\" in the Hayes Valley and so that's where we went. We both had the eggs benedict and shared a short stack. It was ok, nothing special. Then came the bill and I saw that my brother paid $60 (including tip)!!!\n\nI laughed and said, \"WTF? Did u seriously just pay $60 for breakfast for two?\" We walked out and I said, \"Thanks Mikey. Tomorrow breakfast is on me. I'm gonna take yo ass to umm...(out of nowhere I remembered) Superstar!\" lol Yeah, that's right. Breakfast for two for $8! We both laughed and started reminiscing about the early 90's when we used to go to Superstars (yea, with an \"s\" at the end!).\n\nThe first time I ever ate here was in 1991. My friends and I were freshmens at Balboa High and we'd cut school to go eat here. I remember a skinny chinese guy who every one called \"Jeff\" behind the counter. I wonder if he's still there? I guess I'll find out today.\n\nBut yeah I love this place! Yes it's a hole in the wall, and yes for some people it's not sanitary enough. But I don't give a shit cause the food is great and I've never gotten sick from it. It makes me happy knowing that this place is still around and still serving cheap, tasty filipino/chinese breakfast. Shoot, they even serve fried Tuyo (dried salted fish). You just can't beat that! LOL", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "Truly a hole in the wall. This is the bomb; price, food and even service! lol. Nothing beats the value of food. Love the wide selection of Filipino breakfast and the soup (sabaw) is delicious! Despite the tiny price hike, it's still truly a value! Before to come here early because it can get packed and parking can be an issue.", "author": "Edgard P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "best filipino breakfast ever.. been going here for ~15+ years.. don't knock the atmosphere.. thats not the reason you go here... you go here for the topsilog.. HK Style pork chops... garlic rice is the bomb... bansilog breakfast.. all great..", "author": "G G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Great for a quick cheap eats when you're hungry and po. Can be a bit greasy but works if you are on the go and need to budget.", "author": "Ro M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-03", "description": "It's not because I'm Filipino that I'm giving this five stars. Puh-lease, there are plenty of filipino restaurants where I'd give one star or none. \n\nBut their food is delicious as all get out. And cheap. \n\nAnd did I mention delicious as all get out?\n\nIt's the most random-ass place you can ever find to get some shit, but I love it. All hail to you, Superstar.", "author": "Thea G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-03", "description": "what i ordered... tocino(sugar cured pork) w/ garlic fried rice and fried egg\n\ni was in the area that i decided to check out the place after more than a decade or two since the last time i've been a customer. low and behold it was still there, including the lines of folks trying to order and to my amazement the unbelievable cost of a meal(a buck more than it used to). Me and ma bud's used to frequent this joint during the times that we were so broke and sometimes we have to walk there to save the paltry muni fair at the time for us to be able to add an extra fried egg to the meal. \n\n...food was so-so, nothing impressive but descent. at a meager price of $3 you get a full meal that'll really fill you up.\n\nambiance... bad(just like a hole in a wall chinese restaurant.... oh it is, just that they serve filipino breakfast meals)\nservice... so-so\ncost... $- (it really really can't go cheaper)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "i've been going to this place since 2005! lol JEFF is the BEST!\n\n$4 H.K. STYLE PORKCHOPS definitely satisfies my fix! whether hungover or just plain damn hungry! \n\ni know i know, the place is this grimey looking \"hole in the wall\" but what's new about filipino food coming from a dirty place. i do eat there sometimes, but yeah the sticky tables are gross.\n\nWORD TO THE WISE:  do not, DO NOT, use the chili sauce. lol i've seen shadiest things done to those.  or go to the bathroom, it's just nasty. \n\nother than that SUPERSTAR is still bomb, no matter how many bad things people say about it. the lines are still long, and forget about seating for parties of 4 or more.", "author": "tinn r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "cheap food but good! plus hella cheap! This joint offers filipino beeakfast food. Meat or fish, fried egg and your choice of tomato or pineapple and garlic fried rice. I always get the hong kong style pork chop and be sure to call in because sometimes they have long line especially lunch hour. This is hole in a wall place thats why i always get mine to go.", "author": "roderick s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "for the price, this place is pretty good. my sister & I got the hong kong style pork chop plus a drink & it came out to about $4.50 each. portions were HUGE! well for me it was because I ended up having to take half of it home & had it for dinner. overall, if you're in the area and on a tight budget, this place is worth trying. \n\nminus 1 star for the cleanliness of the store", "author": "melanie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "If you like a ghetto surrounding, if your filipino, if your wearing chinelas, if your cheap, this is the place for you!!!! Almost every dish is less than three dollars and nothing will go over $5. The quality of the food is good for its price. The fried rice, with egg and your choice of bangus, tocino, longanisa, etc etc cant be beat. Its traditional filipino breakfast that gives you a feeling of being home, especially if your from the excelsior/mission district.\n\n5 stars for superstar!", "author": "AimFee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I used to eat at this place all the time during high school when I still hung around in SF. I give this place 4 stars because the food is simply amazing for the amount you pay. Sure it's a potential heart attack, and yes the place itself is literally a hole in a wall, however you can't complain if you like fatty foods in big portions like me. A guy's gotta eat, so this is good when you're too lazy to cook or just want some fast grub that isn't your normal Burger King / McDonalds.\n\nI love their tocino, longsilog, and their pork chop dishes. I recommend this place if you're ordering to go, otherwise save yourself the trip because eating there is disgusting.\n\nHaven't been in SF in ages, I miss this place.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-19", "description": "Cant beat the price and the quality of food you get. For 3 bucks you can get full pretty easily. This place isn't known for it's ambiance and does look pretty Crappy but don't let it's looks distract you from this amazing deal and hole in the wall joint", "author": "Robert gene R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-07", "description": "you get a plate of filipino breakfast for less than $3 thats actually good\ni always add extras to my plate like \nextra egg & extra meat and i always get a soup for 50 cents with it also\ncomes out to be around 6 dollars.", "author": "Kenneth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "I love this place! Price was affordable, great food and the garlic rice was delicious as well as the jumbo fried chicken I normally get. Definitely a place everyone should check out, you won't regret it.", "author": "Jewels Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-03", "description": "Ok so I was told about this place from a couple of cousins that are from the Daly city area.  Wow this place is cheap for what it is and the portions are a lot. You can't go wrong with the price. I guess they have a similar place located somewhere else in the Daly city area.  So my friend Mark and I decided to hit place up.  Right when we walked it was cramped with a bunch of stains in the ceiling and walls.  The place is really small for being a hole in the wall joint.  I got the hong kong style pork chop which was $3.25. Damn that's cheap.  The reason why I gave this place a two star is because of the cleanliness but I should be giving it a one but I'm being nice.  So I saw one of the ladies who was cleaning the place was busing tables out in the dining area.  She had these rubbermaid yellow cleaning glove on.  After that she went to the back making the fried rice.  She had the same rubbermaid glove on one and was mixing the fried rice with the same gloves on!!!!!! After that I stop eating my food and was just in shock! I told my Mark what I just saw and we both left.  I know a lot of people like this place for being cheap but the owners need to check their  employees!  Yuck!", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "Superstar is another hole-in-the-wall fave. This is definitely a perfect Filipino style breakfast spot. They had an array of -silog choices. They pack on the garlic rice & serve it with pineapple, which is new because I've always had these types of dishes serve with a side of tomatoes or other veggies. I had the lon-silog (longanisa) & my friend had the top-silog (tocino). We shared a large tea & our meal came out to $6 & some change. It was a good, filling way to start our morning.", "author": "Kris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-30", "description": "Holy Shit! This place still exists? Does that skinny chinese dude work at the register still? LOL!\n\nThe last time I've been here was almost 8 years ago!! \n\nThe Silogs are cheap, oily, and delicious...just like mom use to make! LOL! I wanna try it again soon!", "author": "Marc E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "Good stuff!!! If you don't mind the not so clean appearance of a restaurant then close your eyes or have someone order for you... \n\nthe food is delicious and you get a bang for your buck... I been goin since the breakfast silogs were under 2 dollars... Chinese and Filipino Fusion one of da BEST!!!! I have a little creation like that at home my wife and I... \n\nSo the only reason i had to knock off a star was the cleanliness... Yea Jeff, it's ok to wipe things clean and get those windows while you're at it... but if it remains the same... i'm still comin back..", "author": "Money M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "Hello my favorite hangover spot in the city.  Filipino tosilog and lonsilog, garlic fried rice, fried egg.....$2.99.  Large portions, perfect amount of grease to ease the night before.  Neighborhood gem!!!", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-08", "description": "I've been eating at this establishment for 20 years now... and I still enjoy having \"ilog\" breakfast here, to-go or dine in... To this day, it intrigues me to look at all of the stuff they keep in their display case counter... I guess I am nosey like that, but they seem to have receipts and other pieces of paper there, already tainted in that yellow old-age color... I don't think they've bothered to open up that display case in years... ! Anywhoo, if Superstar wasn't the hole in the wall restaurant that it is, then you'd take away a huge part of the experience (at least in my opinion)...\n\nWe usually order the toncilog, tosilog, bansilog (you can ask for which part of the fish that you want btw), tapsilog... and my FAVORITE thing to order is the HONG KONG STYLE pork chop...!", "author": "Chrysantha C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-19", "description": "OK this was a tough review to write mainly because my breakfast of garlic rice, an \"eeg\", a sliced tomato, & some meat cost me two dollars and fifty cents. The meal also included table service and coffee/tea.  So the value here is incredible. But I paid $2.50! how much quality can I really expect?!\n\nThe food was edible - tasty at best... extremely greasy at worst. Definitely a hole-in-the-wall so if you're into that kind of meal, go for it!", "author": "Kevan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Perfect hole in the wall spot.  Their pork chops are awesome.  Either plain or hong kong style.. you will not be disappointed.  Even better that they are served with garlic fried rice. The place is definitely small, and looks kind of dirty, but it's worth it for a meal under 5 bucks.  And the portions are huge.  You definitely get your money's worth", "author": "Kristel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "Wow, a meal for less than $3!!! I love how it is so cheap here, and i always get full. I only get the longsilog here. So, whenever I am craving filipino food, I come here since it is near my house. \n\nThe only bad part is, the restaurant looks quite dirty, and you can see the kitchen when you order the food. And I always try not to look too hard to prevent myself from finding anything I find disapproving. I always get the food to good. \n\nPlenty of street parking outside.", "author": "Willa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "5 stars for affordability, 3 stars for food quality.\n\nI've been going to this place for years and they were always there when you had a mean appetite and only had a couple dollars to your name. For the price, I can't really complain, but if I had to point a couple things out then it would be the way they made their tocino...Instead of it being served in their normal form of meat chunks and strips, it is broken down into mini niblets which is unsatisfactory in my book. The rice is also fried in bulk which is a half-ass attempt to cooking garlic fried rice. Being such a small Hole-In-The-Wall family owned restaurant, I understand that they have to whip those plates out in record time in order to satisfy the masses, so i'll give them points for that. \n\nBut once again, I cannot complain for the amount of food I am given with the price I pay. I must say that they serve the meanest Hong Kong Style Pork Chops and Bangus. Turn those two choices into a combination rice plate and you have yourself a feast!\n\nOne more thing I must mention is that they are closed on Sundays out of all days! They are literally missing out on the potential cashflow they could be receiving due to the early morning church-go'ers and  lazy sunday post-party animals looking for something quick and cheap to eat. \n\nI love this place to death and will continue to eat here but these are just a few suggestions for a great place to make it an even better place!", "author": "Duane R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "Sorry to say this, but small, questionable cleanliness food joints are the best places to eat! =) Ate here for the first time a over a month ago with my sister. We had the silogs (under $3 bucks). She had the bangsilog, while I had the longsilog. They ran out of tomatoes, so they gave us pineapple instead (we wondered why didn't they just buy tomatoes next door at the produce market ?). Loved their garlic fried rice and they didn't skimp!!  As we were leaving, we noticed that a few of the lunch crowd had the huge fried pork chop. Hmmm....might have to come back to try that. Damn, I'm going to have to increase my daily workouts this Summer =).", "author": "Neni E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-17", "description": "I have first say that this is probably the only place in SF that you'll feed two big eaters for under $6, ALTOGETHER. That being said, Yelp should have a new price range called UBER CHEAP (less than $5/person)\n\nSo, my cheap-ass Asian side LOVES that.\n\nAuthenticity-wise, didn't really impress my Filipino boyfriend.  He liked their Spamsilog (but c'mon I have yet to meet a Filipino who DOESN'T like spam) and their garlic fried rice.  However, the longanisa left him wanting, so much that he didn't eat the second longanisa link (and he RARELY leaves uneaten food on his plate)  I was halfway tempted to eat it for him since I hate wasting food myself, but my vegetarian conscience wouldn't let me.\n\nSo speaking of which, once I told the guy behind the counter that I was vegetarian, he immediately gave me BOTH pineapples and tomatoes w/ my garlic fried rice... who knew such simple food could make me so happy?\n\nTo echo previous reviewers, this place definitely does not get famous off its ambience.  Definitely small and cramped, sticky tile floors, but hey overall not horribly dirty.  Having grown up eating at hole-in-the-wall's all over SF, Hong Kong and Hawaii, I'm totally ok with it... but it may not be suitable for the faint-hearted.\n\nOne more thing... not sure if this bothers some hardcore Filipino diners, but the owners and cooks of Super Star are NOT Filipino.  They are a Chinese family who speaks Tagalog and Cantonese (so my boyfriend and I could both pick up bits and pieces of their kitchen conversations).  However, that doesn't seem to bother many of the Filipino locals in the area... many of them seem to be regulars.\n\nSo if you're hungry and broke, this be your place.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "This place is really hole in the wall.  Very little seating area.  And the cashier area was packed last time I was there.  \n\nI never had Filipino food before Super Star, so I let the bf order.  The HK style pork chop was DELICIOUS!  and they did it RIGHT!  CRRRUNNNCHYY and juicy inside.\n\nThe bf ordered two -silog HIS way, with additional Filipino sausages, spam, extra whatever the heck he can think of, with two coconut juice.  Thanks for the coconut juice to CLEANNSEE the heaviness, so I can eat more.\n\nNeedless to say, we didn't finish the two -silogs, and had that for dinner as well.  It was ALL worth it.\n\nTo sum up my Super Star experience:  SUPER satisfying, cheap, good eat.  But i'll be Super Star OUT for the next few days.", "author": "Gigi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-16", "description": "I've been eating here since high school. Thats 1 star. And another star for the prices. But other than that, its straight up grease!!! The rice you're eating is like weeks old. They just let it sit there  and get brown before the cook back for your order. The place looks like shit. I love the sign on the wall thats warns that there are carcinogenic ingredients in the food. But other than that,   Eat here if you like bad cholesterol and shit food!!!!", "author": "Mar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-24", "description": "When on a tight budget, and cursed with a huge appetite, superstar is my SUPERSTAR.", "author": "Sinoeun M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "The best value I know of. You can get made to order Filipino-style breakfast for under $4.00. It's pretty much garlic fried rice, one egg, either tomatoes or pineapple, plus your choice of \"meat\" including:\n\nFried fish (bangus or tilapia), longanisa, bacon, spam, fried chicken, popcorn chicken, or the highly popular Hong-Kong style pork chop.\n\nIt's definitely not the most pleasant looking place, but who can complain with the price?", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-25", "description": "Whenever I am on a budget, Superstar never goes wrong. You get a whole meal, complete with garlic rice and tomato/pineapple for under $4. Superstar is always a win win. Not to mention, the man who works the cashier is always energetic.\n\nI love the tapsilog with a side of Hong Kong style porkchop. Although the place is a hole in the wall, I would recommend you order the food to-go. This is a great spot for college students who are on a budget.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "Hmm what can i say about this place???? When i was a broke middle school student cutting class and hungry. Where would we go..... SUPER STAR... another reason why i love Filipinos.. \"Cheap Breakfast\"...  you cant beat 2.99 for meat, pile of rice, egg, pineapple and coffee.\n\nThe only bad thing which has nothing to do with this restaurant but with Filipino food in general is that count on tasting your food for the rest of the day.", "author": "Alfredo N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "This place is seriously a hole in the wall to get great, cheap Filipino breakfast! You can't get anything these days for $3 bucks! I live in the suburb, and my bf's sister introduced us to this place! It's cheap but I love it! Especially the fried garlic rice, with tocino, and eggs and top it off with tomatoes!!! \n\nI'll take out one star, like the other reviewer, the rice is kind of hard sometimes. I prefer Gateway's Kitchen's rice....its much softer!", "author": "Lissie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "Loved this place during my stay in SF. Wake up, call up the friends, and all we need to say is one word. \"Superstar\" :)\n\nCheap food and perfect for the mornings, it cant get any better than this.", "author": "Andy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-06", "description": "outside had me a lil sketch, but its good, n wont dent your pockets at all, youll prob spend more on the meter outside.", "author": "Pete F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "For the price!? WHO CAN REFUSE!? I was so hesitant when my friend pulled up to this hole in the wall and said, \"here we are!\" I had to stay in the car while he picked up our take out.. I wasn't stepping in there! However when I got home.. I tore that food up! Super good for the price. Now it's not to die for... but for the price. I can deal!", "author": "Deanna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "$2.95 for some garlic rice with an egg on top, 2 pieces of hong kong style pork chop, and some side of vegetable, or fruit?  You cant beat that.  \n\nCheap food if you feeling for some greasy heart clogger.\n\nRestaurant is pretty much a hole in the wall but its good.  They got a score of 98/100 for health inspections.  So.. i guess you cant judge a book by its cover.\n\nBeware: Dont use the bathrom.", "author": "Mabel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-25", "description": "This is definitely one of them hole-in-the-wall places you DEFINITELY need to check out!  Quick services, portion size is HUGE and the prices cannot be beat!  I believe everything is under $4.  My favorite is the Tocino, very tender!  Not much seating tho.", "author": "Janet P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "If I had visited Super Star for the first time recently, I would probably give superstar 3 stars, but every time I come here I get this sense of nostalgia which gives this restaurant an extra star. I've been eating their longsilogs since my freshman year of high school. There is just something about Super Star that keeps me coming back! I think I know what it is--- Cheap, friendly, fast, and there is actually some good food on their menu. I would recommend this place to all the starving college students out there paying your tuition because you can get an entree of your choice (ie. longanisa, tocino, hong kong style porkchop), garlic fried rice, choice of tomatoes or pineapples, fried egg, and a drink for under 5 bucks! Now that sounds like a well balanced meal! \n\nRecommendations: \nLongsilog\nTocinolog \nHong Kong Style Pork Chops\nJumbo Fried Chicken", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "Ok, I'm Filipino and love Filipino food for all its greasy goodness. \n\nThis dingy little hole in the wall joint isnt the most visually appealing place on Earth. Don't be afraid to park at Safeway to walk across the street just in time before the closing time at 4 or 6 or whatever early ass time they close.\n\nThe food here is f'n delicious, its dirty cheap, and will probably clog your arteries, but goddamnit I love it!!", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-21", "description": "IMPRESSION:\n\nI tried to run away from this place when my significant other brought me here one day. Were it not for the tight grip on my wrist and lecture on being snobby, I would have ran back to the car.\n\n Why? Because I couldn't believe a place that dirty was actually a restaurant. Dingy, dirty, depressing. BUT amazingly THE FOOD WAS GOOD.\n\nHowever like someone said, were I to look in the kitchen... it might be another story. I am surprised they passed the health inspection. \n\nFOOD:\n\nThe garlic fried rice is a bit heavy for my taste but it suits most people fine. It would be better to get steamed rice if you're ordering a fried or greasy meat component. I ordered the fried chicken, and it was moist and flavorful inside, not dry like I expected. \n\nThe sunnyside egg and tomato are nice sides that accompany every dish. I liked their Longaniza, philippinio sausage, better than the chicken. I never tried it before and it was savory and sweet at the same time. The flavor was very intense so again, steam rice might be a better option. \n\n\nCOST:\n\nIt is dirt cheap, 3-4$ dollar for a meal. I wouldn't take someone on a first date here though. The food might be decent, but you might be labeled a cheap ass and again the \"decor\" will scare away your date. Would I come here again? I wouldn't go out of my way to come here. If I was in the neighborhood, I will order to go. Maybe. It is highly dubious that I will eat inside again.", "author": "Zelda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "I grew up eating here and it never gets old. The most ghetto restaurant you will ever see but they make up for that with their food. If you are ever hungry and on a budget craving that filipino and chinese food then this is the place to go!", "author": "Karen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "This place is the epitomy of hole-in-the-wall.  Although they've got a tiny seating area, people do not stop coming in to place orders.  The line is usually out the door on weekends.  I'm only assuming that the store was never remodeled, because the walls are completely engraved by different people, there is an old school menu nailed to the wall-- that no one pays attention to and the actual menu is taped up.  Totally ecclectic.\n\nPro's: SUPER cheap.  Finally, a cheap place that serves good filipino food. Plates are no more than $4.00 each.  The Fried Tilapia and Hong Kong style pork chop is pretty tasty. They also provide garlic fried rice, one fried egg and a choice of tomatoes or pinapples with every order. They fill you up. \n\nCon's: Don't expect anything fancy.  Crowded- consider calling order in first.", "author": "Anne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-30", "description": "ummm- restaurant?  no\n\n7 slices of bacon, 2 scoops of rice, 1 fried egg and sliced tomato for $2.99?\n\nyeah.\n\ndone.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "If someone asked me to define 'hole in the wall', I would definitely  take them here. I've frequented this place for quite some time now. The prices have not changed, the staff has not changed, and the menu has even been expanding over the years lol! \n\nAs a broke college student, this is definitely my go to spot when I'm hungry and on a budget.  I've taken a few friends here and all were in disbelief when we ordered two full course meals for under $8. Pork Chop HK style & Jumbo Friend Chicken have got to be the best deal. I can order either the two for lunch and still have half left over for dinner...and each cost about $3.50! \n\nParking is very limited and so is the seating inside. I would recommend taking the food to go but I sometimes eat in to prevent my car smelling like vinegar lol. \n\nThe only negative thing I could say about Superstar would be that their hours are very limited. For years I've hoped that they would convert to a 24 hour spot. Those after-club night dinners, I pay twice the price for half the food over at Ling Nam in Daly City and always eat it bitterly when I think of Superstar.", "author": "True C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "Cheap, dirty, delicious. Just the way I like it ;) Superstar will always have a place in my heart.", "author": "Shirley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "so greasy...but so cheap and so GOOD! very cheap food for a great price. i got the fried pork chop with AMAZING garlic rice, an egg, and 2 filipino sausages! the sausages are the typical sweet goodness you would get from any restaurant. the pork chops honestly arent the best tasting. they are typical deep fried pork chop. i guess im giving 5 stars more for quantity and a super cheap price. this place will not hurt your wallet at all. dungy ambience..get your food to go.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "uhhhhh $3 for breakfast! \n\nlonganisa. two sausages. one egg. garlic fried rice. u cannot go wrong! \n\nthe restaurant itself is small, not much seating room, and its really not that clean and the bathroom is kind of gross. =/ but the food is great!", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "Low price for a huge portion of good tasting food. Somewhat busy most of the time. Just park in Safeway for free and jaywalk across the street and enjoy your meal. All of the employees there are very nice, including the janitor who keeps this place pretty clean even if it looks old. Kudos to her.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "dizzzzzzzam! place is old and run down but, who cares! \nALWAYS hella people in here, and always a line during lunch time.\n\nthe usual orders: spamsilog, tocino,  HK style pork chop, tapsilog\n\noh yeah, gateway kitchen near top of the hill on mission = SAME ONE! they're owned by wife and husband, and they both work at either one!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "OMG! this place is like HEAVEN! I love their filipino food and the super SUPER cheap prices! I got my boyfriend hooked on this so we go when we can!", "author": "Mariane T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "great food for price .. 3.50$ feeds you well .. no where else in sf is this cheap .. I like the fried chicken and pop corn chicken !!", "author": "Micah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "if you are low in cash but very hungry this palce is very affordable for a good meal.  I have been going to this place for several years now.  and everytime i go to stuff my face if its take out, dine in or to feed all my kids i have no complaints.", "author": "Charlotte G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "Went here for the first time, could not believe the prices and how quickly they prepare the food. you really can't go wrong with a menu with everything around 3$. It will be packed during lunch time so either take-out or if you wish to dine-in come off hours. You must visit this place at least once if you're in the area", "author": "Home S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "I live in the East Bay, so whenever I am in SF and crave cheap filipino food I come here. The place is small so I usually order and take it to go. The service is quick and the staff is very friendly. The food is yummy and incredibly cheap. They have everything like garlic fried rice, egg...choice of meat like longanisa, tocino, tapa, bangus, hong kong style pork chop...Good stuff!!", "author": "Celly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "I've been going to superstar restaurant since I came to this country in 1986. The food is very good and cheap. IT is not the cleanest restaurant but i'm not there for that. I went there when I took the bus and walked, i went there when I got my used Civic, I went there for my graduation lunch. \n\nAnd today I still go there with my 2007 Bentley GT Continental, parked right in front of the dirtiest payphone in the City, just to get my $3.00 Tapsilog!  \n\nSometimes it does not make sense to drive to SF from the East Bay and spend $15 on gas to get $3.00 Tapsilog, but then again it is Superstar, they are the best.\n\ndont forget to say hi to Jeff, \"my friend\"!!!", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-31", "description": "Pretty good tapa... and the price is right! Garlic rice is yums! This is the spot when on Mission.", "author": "Janelle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "As good as it gets you a  homemade authentic Filipino breakfast, from your typical hole-in-the-wall spot. My favorite: Tocino (marinated pork), garlic fried rice, eggs, and tomatoes all for $1.99 or $2.99, I think... Wouldn't sit and eat here though as there's only metered parking outside/double parking available.", "author": "Art G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-18", "description": "This place Is really good the people are nice and it's really cheap If you go here I recommend the hong kong style pork chop and the jumbo fried chicken even if you get both it would only cost you around  8-11 dollers", "author": "Gee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "Oh MAN..childhood memories. The crazy thing is that its still dirt cheap. Try the boneless bangus..its soo good. And that fried rice..yes it'll give you garlicky breath but I'll take it. Don't eat here just take it to go..This is the kinda place where you can act like a big shot and treat all your friends for breakfast. I'm telling you, feed a group of 5 for $12..now thats outrageous. Oh yea, I don't care how greasy it is..its SUPERSTAR...", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "so if there was a half dollar sign, i would choose that cause this place gives major bangs for bucks! i got the fried pork chop which comes with 2 huge deep fried pork chops, garlic rice, pineapple, and i added 2 longanisas for about 2 bucks. 5.50! kiddin me?! yeah the food is super oily, but it's a sinful indulgence once in a healthy man's life. the place is pretty run down, and its not even close to nice..so i suggest the food to go.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "Their prices are unbelievable! Definitely good enough for me to drive back when I'm in the area. I liked there tocino, deep fried pork, rice, and eggs.  I had to buy some to go for dinner. Its a small \"mom and pop\" shop. I do recommend it.", "author": "Lynn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "I don't know what I would do without this place. Going to school and being a baller on budget made it easy for my friends and I to love this place. Just don't mind the cosmetics of it, the food is dirt cheap ($3) and the owners are just humble people. It is a lifesaver. I recommend the Hong Kong style pork chop with tomatoes, garlic fried rice and egg over easy. Thanks Superstar!", "author": "Rhea V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-02", "description": "Yummy no? Now try going to the bathroom and spotting all the pre-cooked white rice sitting in plastic bins around the the back. GROSS!", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-03", "description": "One of the reasons I MISS SF!!! I grew up eating this!lmao... Superstar was the Perfect Hole in the Wall Fil-Chinese place. They are quick and just yummy! \n\nMy McAteer days and City College days brings back memories, this was the spot! Ate with friends here during lunch breaks and it reminds you of the \"home cooked breakfast\" \n\nLove the \"Bansilog & Tosilog\" sometimes the \"Hong Kong style porkchops\"...drool! haha.. So not sexy! But omg! Love this place and I can't believe they are still around, I mean, I believe it! They are so affordable and food here are delicious.", "author": "Fannie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "see we do have GOOD EATS in the excelsior!  =)\n\ni love superstar.  BEST silogs EVER and not just because its under $4!!  haha.  but seriously for the amount of food you get, i feel like i'm ripping THEM off.  hehe im not complaining though!  i always go for the hong kong style porkchop-silog!  massive amounts of tasty garlic rice, an over easy egg, tomatoes, with 2 huge porkchops.  YUMMMMM.  you definitely get MORE for your money here.\n\nfor those that have never been though, BEWARE cause its a little bit on the grimey side.  but DONT worry, its REALLY good.  just always order to go like i do!  they make your food in like 5 min!", "author": "Francia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "we been eating here for over 10+ years since high school days... just love the price and the portion but the last time i went there was a few month ago... the size got smaller and lesser, i won't blame it... still cheap for the price and the amount, i don't get why people complaint and leave bad feedback when you paid less then $4 for the meal... some are just under $3... this place get packed quick with people and line, i recommend you calling them ahead.... order thru the phone then pick it up in 15 minutes, way faster!", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-04", "description": "been going there for years.  cheap, fast, good filipino food.  \n\nfor those who don't know, they serve -silogs...a -silog is basically a filipino breakfast plate that includes a meat, sinangag (garlic fried rice), an egg, and sliced tomatoes.  you can get:\n\ntocsilogs - tocino (cured meat)\nbansilogs - bangus (fried fish)\ntapsilogs - tapa (beef)\nspamsilogs - spam\nhotdogsilogs - hot dog\nor my favorite\nhong kong style pork chop silog\n\ni believe their $2.75 for a silog, and they have nice portions\nthe hong kong style pork chop silog is $3.95\n\ni hardly ever dine in as the place is small and even though it seems kinda dirty, i saw that they got a 100 on the green \"sanitary card\", which means they're apparently, clean!\n\ndon't expect fine or even nice dining here.  expect good old fashioned, probably unhealthy, cheap filipino food cooked by chinese cooks! mmmmmmmmmm!!", "author": "Ray R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "one of my all time favorite places, I've been going here since I was about ten, nothing much has changed inside, except for the price inflation, but even with the increase its affordable. the standard to order is the Tocino, but I do like the Pork Chop and the Bangus as well. There is some variety.", "author": "Karl B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "best place for breakfast when you're on an EDD budget. $3&change will get you deep-fried HK pork chops, garlic rice & your choice of tomatoes or pineapple. excellent cure for hangovers btw. portions are huge so one order is good for 2 meals. this hole in the wall is not the cleanest but the ridiculously inexpensive menu makes up for it.", "author": "Grace V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "I usually make Filipino breakfasts on my own and I know how easy it is to make these dishes so it's nice to finally find a place that has low prices on such easy dishes to make.  The setting isn't really nice but the service and food is pretty good for the price you pay.  It's a great place to get full off of what feels like home cooked food.", "author": "Don A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "$3 HK style pork chop all the way! BUT... well, the place is dirty! haha", "author": "Bernice N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "if you want cheap fiilipino food under 4 dollars eat here!!!!! hole in a wall place but it is soo good. Since grandma or parents aren't here to cook me longanisa, tocino with garlic fried rice come here!! it is MASARAP! lmao.", "author": "Iba N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-28", "description": "Their food is good, especially the Hong Kong style porkchops. I would never want to eat there 'cause the place looks disgusting but take-out is always great! And you get full with just a few dollars. ;)", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-09", "description": "this place.... there is no place like this neighborhood gem. If you can scrape 3.75 in change or pull it out of your sock literally like some of the customers, then your set to get a big heavy garlicky, greasy orgy of deep fried goodness, unless you want to play it filipino after church breakfast and get the tocino. But i would recommend the hong kong style pork chop because you get the most food, and chances are if you are coming here you are broke and hungry. Oh and if you are and advocate of writing on stuff that isnt yours (not like me ahem ahem) you are also in for a treat in their bathroom.... SMELL YA LATER", "author": "alex l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-09", "description": "Great place to pick up a \"Filipino\" breakfast for about $3.  You get your choice of meat ... longansia, tapa, tocino, bangus, and something else maybe??  All are served with eggs over easy, and garlic fried rice.  Good cure for a hangover.  As usual, no parking.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "I know GHETTO filipino food!!!!  BAM!  For the price.... this place works...  I won't reccomend this place to white people, hipsters, foo foo Asians, people on a diet, my wife...  I do crave this place from time time....  I do see hard working clue collar crowd sometimes coming in after a hard morning working....  ITS GRUB!", "author": "Demanding T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "Whether you opt for the Filipino breakfast, or the HK style pork chops, this place is unbeatable.  Everything is complimented with an order of garlic fried rice and a side of tomatoes or pineapples.  It's really hard to beat this place considering the value, and consistency everytime I come here.  The fried chicken never fails.  The place is dirty, the tables are tattooed with grease spots, and I wouldn't hesistate for a second about coming here.  That in itself should say a lot!", "author": "Alan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-25", "description": "Great Cheap Eats!!.. but definitely not the spot for a first date. I've been eating at this spot since '93 or so and I think it's a wonderful blue collar meal. If you're not a total snob this is a awesome place for a quick inexpensive lunch or to-go plate. Last time I went I had the Tosilog with a side of bacon for less than $5 (meatanarian's special) .. 5 stars for sentimental reasons and bang for the buck... the place could definitely benefit from renovation though.", "author": "Ruel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "This place has fed me many times.  For probably three years straight I would eat here at least once a week.  My 1985 Ford LTD station wagon smelled of garlic fried rice and gristle.  I dig the way these guys do business and it felt cool to go grab a fried porkchop from a dirty hole-in-the-wall then walk over to the market and grab some scratchers.  It was as if I had aged 20 years ahead of schedule.  Retirement looked good.  Alas, Superstar caught up with me so I allow myself to make it there at least once a year.  This place holds great value and fond memories.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-19", "description": "This place brings me back so many memories when I was growing up in the city. They kept the same hand painted menu stand since I was 6 years old.  I remember when it was $0.99 for Filipino Breakfast. Superstar is the only place in the world where you can have tocino, garlic rice and 1 EEG on your plate.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-05", "description": "the good: the longsilog is $2.30. where the hell else are you to buy longsilog for $2.30? nowhere. IT'S PRETTY DAMN GOOD AND HITS THE SPOT TOO, WHO CAN COMPLAIN? the parking isn't that bad for being on mission. \n\nthe bad: it's a hole in the wall a place, which doesn't bother me, but if you're going to bring people there you better give them a heads up. getting a table is pretty hard sometimes, especially if you go in the morning. they have weird days where their closed, so you should call first.", "author": "T V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-29", "description": "Recession style prices for great food, it has always and consistently throughout the years been the place to eat for a $3-$4 budget.  Tocino, Longsilog, Fried Chicken... the place to be.", "author": "Antonio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-11", "description": "$3 dollar meals, need i say more.  it might not be fine dining and the restaurant not so sanitary but the food gets the job done.  i usually order two different dishes and devour them. i'm glad theres a place for broke people like me. lol. i use to come here all the time when i was going to balboa high, a block away.\n\nfor the price i give this a 4.5 star but for the quality of food i'd give it a 3 star.", "author": "Cedric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-13", "description": "C'mon.... $2.75 for toscino (sweet pork), garlic rice, fried egg, and tomatoes! That's priced from the early 90s! The food is gooood and the portions are generous. My friend always gets either the sausage or HK style pork chop. Maybe cause the owners are Chinese and I'm Chinese, so there's a twist to the Filipino food that hits home for me. Or, it can just be bomb Filipino breakfast! Either way, my Chinese ass loves this place!", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-16", "description": "This place and food totally make me sick! I hate the skinny guy standing behind the counter!", "author": "Kin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-06", "description": "WHATSUP JEFF, CAN I GET 1 TAPA & 1 TOCINO! ....I love this place. i lived in a shitty inlaw up the street and went here every morning for breakfast, back when it was $1.95 (or $2.17) i love it and i'll go back everytime. ....by the way, is his name really jeff??", "author": "MICK E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-07", "description": "There is only one place to go for Filipino breakfast, and this is the place. The thing that really makes this place great is that people of all nationalities love this place. And how can you blame them, you get quality food for under $5. That's right, the average price for a meal here is $3-$4. You definitely can't go wrong here.", "author": "Rommel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-14", "description": "This place is ghetto!!!  But I LOVE IT!! Hole in wall place on the mission. I love their hong kong style porchops served with garlic fried rice and a tomato or pineapple for under 5 bucks!!!  I got introduced to this place by my coworker who grew up eating this food during high school lunch breaks. That was 5 years ago when he brought me here and at times I get the superstar craving. Last week, my coworker and I were talking on IM at work and he asks me, you know what Im craving for? We both responded: SUPERSTAR!!! LOL", "author": "Mark J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "Less than 3 bucks for longsilog?\nA 2 minute wait for my food?\nPerfectly runny egg-yolk to spill over my garlic fried rice?\nFood was still delicious an hour later without being microwaved?\n\nDefinitely worth a trip to the outer mission. Where else can you find a deal that good these days?", "author": "Kirstie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "Great food for cheap.  Park at the Safeway across the street, get groceries, then get orders of hong kong style pork chops or tocino for take out.  The place could use some cleaning.", "author": "My Two Cents E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "Where can you get lunch for $2.50 nowadays? Here at this hole in the wall!  I always order the longsilog.  You get 2 longanisa sausages, an egg, garlic fried rice and your choice of pineapples or tomatoes for only $2.50!!  Other favorites for less than a dollar more includes the Hong Kong Styled Pork Chops and the Jumbo Fried Chicken.  They weren't lying when they say Jumbo... That piece of chicken is ginormous!  Parking is always available across the street in the safeway parking lot, so no driving hour in circles looking for parking. Want great, cheap food with great quantities? This is the place!  It may not be the cleanest place, but for the price, I cant complain.", "author": "Damon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "I come here for the HK style pork chop.  They did a great job infusing chinese dish in a Filipino breakfast. Who would've thought a cantonese owner would make Filipino breakfasts? The place is not recommended for those expecting a super clean restaurant. C'mon now, it's a hole-in-the-wall joint.  Take it to go.  Otherwise, most of their si-logs(fried rice and egg dishes) are under $5 compared to other places that serve them for over $6. I tried most of their si-logs and all I can say is that  the HK style pork chop and the Filipino sausage (longganisa) si-logs are the best so far.", "author": "JB L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-21", "description": "This place has been around forever and their prices have changed only recently and with that only a couple of cents.  Personally, I don't know how they keep themselves open with such low prices.  They give rather big portions.  Upon entering, you look around and start to realize that this is the type of hole in the wall place where you would rather not eat, but rather order to go.  Every time I go there, I get this feeling where it crosses my mind to check the validity of it's sanitary conditions, yet scared out of my mind just to know what I could possibly find out that would tarnish me eating there forever.  I would recommend this place if you're in the area, you're hungry, and you happen to have extra change that you want to spend.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "It's pretty embarrassing to be Filipino, living in the Excelsior and never having eaten here until recently. It's bad enough I don't know how to cha-cha or shop at Serramonte but to have only discovered this place a few weeks ago is completely unforgivable. Like others have said, the breakfasts are BOMB. $3 tocsilog for the win! It's definitely run-down and ghetto but look where it is. But hey, I'd rather eat here than at Poleng... The meals are probably a week's worth of calories but I don't care! Indulging once a month never hurt anyone.", "author": "Janelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-10", "description": "I used to come out here back in tha day when the Longsilogs were $1.90 for the complete meal, and David was still the guy who always took my order.  I dont it's been over 10 years now and I just went there for lunch today and the Longsilog cost $2.50 again for the complete meal exactly like they always made it.  My all time favorite is the \"Sarangani\" Boneless Bangus extra Garlic.  The service is fast, the food is good, the cost is very very affordable.  Masarap & mura. What else could you ever ask for when hungry.  You can treat 6 friends for Longsilog lunch for under $20 bucks.  And they will be satisfied with a complete meal.  Where else in the city could you do that. \"NO WHERE\".  SO I am a customer for life.  The place seats about 20 people and not real fancy, just good food at a very good price.  No, don't take your first dates here.", "author": "gordon g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-10", "description": "Super Star Restaurant is a cheap and nasty place to eat. I ate there about a month ago and I don't think I will be eating there again. First off, The cleanliness of that restaurant is disgusting. Second, The food there is horrible, after eating the tocino that looks barely cooked, I feel dirty and gross for eating it. I'm sorry but this restaurant is not for me.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "$3 for spamsilog.\nawesome garlic rice, sided with pineapples, egg, and, of course, 2 pieces of spam.\n\nit was delicious. the perfect  remedy for comfort food when coming home to sf from college.\n\nthe place is a-hole-in-the-wall--and it only adds character, especially since it's a local restaurant.\nand the food was greasy--but what comfort food isn't?\n\nyeah. i'd go here again.", "author": "Victoria N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-25", "description": "As far as hole in the wall places go, this one beats the rest in being the most obscure. The outside is very unassuming, but inside, the little dingy, slightly unkempt place is usually packed with people eating or waiting for their to go orders. Most of the people who eat there are filipino so I guess that's a good sign while the staff is chinese. My coworkers love the food there and rave about it, but me, not so much. It's super cheap, but the quality is also cheap. You ask, well what do you expect? I know some places that have cheap prices, but good quality eats as well. I'd rather frequent those joints. The food here is greasy and dry. I might be biased because I don't really like filipino breakfasts which is the main dry here, but I've had better filipino breakfasts at other places in the neighborhood.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "Breakfast is craaazy good! Hong Kong style pork chop and tapa! wow. good eats and GREAT PRICES! You can feed two and be satisfied for under $10 !!!!!", "author": "Oh So Fresh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-26", "description": "For under $5 you can get Hong Kong style pork chops served with garlic fried rice, a fried egg, chopped tomatoes and a can soda.  Awesome!  This place looks shady, but the food is good and affordable.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-06", "description": "2 longanisas, an egg, garlic fried rice, pineapples or tomatoes with a fried chicken leg for less than $5?!?!?!?! I'm there! I've been going to this place for over 10 years and all I can say is that I know I will be back for all the years to come!\n\nThumbs up all the way!", "author": "Julie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-13", "description": "when i miss san francisco, i know what i'm missing are three things: ocean taqueria, mr chan's (in daly city), and this place.\n\nit's a cheap hole in the wall with yummyass food.  gotta love the crispiness of the pork chop and fried chicken.  and the garlic fried rice....i'm getting hungry.\n\ndon't go here so we can keep the prices low! hahaha", "author": "vanessa e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-07", "description": "Superstar is the best, the food is great, price is very affordable.And the stuff are friendly.", "author": "Jo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-28", "description": "If you are broke, this is a place to go to fill you up, but if you eat here every day, you will gain 5 pounds in 1 week, guaranteed, cause that's what happened to me when I ate here like 5 times in 1 week.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-02", "description": "Super Stars located on Mission Street is a great place to eat if your on a budget. The food at Super Stars is really cheap because all of the meals on the menu probably cost around four dollars or less. The food is served in a pretty large portion for the price that it is. Each dish is served with garlic fried rice, eggs, tomatoes or pineapples, and then your main dish. Some of  the main dishes that are served at this location are Hong Kong style porkchops, tilapia, bangus, tapa, longanesa, and fried chicken. I recommend getting the Hong Kong style porkchops because they're good, and they serve it to you in a very large portion. I also enjoy eating the other dishes, but the porkchops are my favorite. The food is also kind of greasy, especially the garlic fried rice, but i still think its good.\n\nThe food is great at this restaurant, but the surroundings and the area to sit is kind of dirty. There are not that many tables in this restaurant and only a limited amount of seats. Each table has four chairs, but if four people were to sit in one table then it would be cramped. There is also barely any space between you and the table behind you, and this makes it very hard to back out of your seat. The sitting area in general is very small, and I would recommend taking the food to-go. You are also not allowed to take your food to-go and eat at the tables because there are no garbage cans in this restaurant. If you eat you food there, then they serve it to you in a plate, not in a plastic container. I also think the cups that they serve your water seem dirty, so i don't recommend asking for a cup of water. I also think that the bathroom is dirty, and should be cleaned more thoroughly.\n\nI would consider this restaurant to be fast food because after you order you would probably receive your food within five to ten minutes. They are really fast and quick when they make your meals, but it still tastes delicious.\n\nI would definitely recommend Super Stars to all audiences if they enjoy Chinese/Filipino food. It's a great place to eat for breakfast, and maybe even lunch or dinner. I would definitely recommend this place to starving college students like me that are on a tight budget. You could get a large meal that could get you really full for under four dollars. These meals are authentic home cooked meals if you long for those meals that your mom makes. This would probably be the same price if you were to eat at a McDonald's, but Super Stars is a lot better. It's a good hang out place for a large, cheap, and tasty meal.", "author": "Bryan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-20", "description": "Not for me! After I ate their food, I had a major stomach ache the whole day. Small space. Cheap yes, but not worth the bathroom sickness.", "author": "christine d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "garlic fried rice and hong kong style pork chop! yummy in my tummy. cheap and good. what else can you ask for?! i will more than likely to be back!", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "good food! good service! cheap price! what more can you ask for! great place to go if your around there and only have $3.00 and couple of change. it will fill you up.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "I'll tell you right now...or should I say warn...? This place defines a hole in the wall kinda restaurant but at the same time...probably the cheapest damn breakfast food you can order...filipino at that and I LOVE hearty and greasy Filipino breakfasts! You order one thing for yourself and you won't spend no more than $3! Can you believe that!? You get loads of greasy sininag, a side of pineapples, fried itlog (eggs) and the ulam (dish) of your choosing where it be tocino, tapa, chicken, you name it! I still prefer good ole Ling Nam's Filipino breakfast over this place but you still can't beat the prices here. 2 breakfast meals here is the cost of one meal at Ling Nam. It's funny if you eat inside though. You better not lie about taking it out when your eating inside because they are so cheap about the containers for take out that they get mad at you if you end up eating inside when you say for take out. I wouldn't recommend eating inside anyways.", "author": "Sean E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-10", "description": "This place tops my Hole-In-The-Wall list.  If you have three bucks, you can get a nice Filipino breakfast here... I especially like the Hong Kong style fried pork chops.  You will have cholesterol and MSG running through your veins for days!  However, they do fry the rice with toasted garlic to make it a bit healthy.  This place is great for those once-in-a-while urges to eat something really greasy for breakfast, lunch or dinner...especially when you're broke and feel like eating out. This place is popular with Filipinos, but the cooks are Chinese.", "author": "Raging R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-29", "description": "this place is not cute.   it is not clean.  it's cheap but it'll kill ya! \n\nsure it brings back memories of early college days but thats not enough to give it more stars!!  that just means you went there so many times youve grown an attachment but for reviews sake... that just doesnt work for me, haha.  \n\nanyway it got two stars because if you take out, youll fully enjoy your food... just try not to think of how uncute/unclean this place is.", "author": "Aubrey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "looking for a quick cheap food?superstar is the best.well for us asian this  is a must to go coz is cheap and dammit the portion of the food is huge just dont look on the ambiance", "author": "jack s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "I bought lunch for my department today since I hit one the football pools this weekend.  What better place to go then to Super Star.  Lunch is very affordable especially when feeding large groups of people.  I bought 10 lunches for $38.00.  9 Hong Kong style Pork Chops and 1 smoked boneless bangus.  Usually when coworkers order from here I just place my order and they go pick it up.  This time I went to the establishment and picked up the orders.  This is not a place you want to eat at.  Call it in \"To Go\" and have someone else pick it up for you.  The place is small, crowded, not clean at all.  So why eat here? Because its that darn good and cheap.  The rice can be a bit hard at times but I think its because its steamed first and then fried with garlic and the rice turns a bit crunchy or stale like.  I had the bangus(milk fish) rice and 2 eggs.  The eggs are always over cooked and I wish they could come a bit more runny.  I think it just carries on the cooking while packed and by the time it arrives the office its over cooked.  The fish is always good, perfect smokiness and no bones at all. Drizzle a bit of vinegar and enjoy with the egg and garlic rice.  You cant beat the prices and the yummy food.  Just have someone else go pick it up and you will enjoy this typical Filipino breakfast/lunch specials.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "the food is extremely cheap there. especially fillipino food i havent been there in a while but i am pretty sure the prices hasnt changed. its probably still 2.20 for fillipino breakfast. most of the time i get the porkchop with garlic fried rice and pineapple. with egg. or you can get the chicken. and its only 3.20 thats including tax. the food is cheap but for you \"rich uptight people\" its really bad. most of the time theirs ghetto people there like those hyphy kids. and generally you get all kinds of nationalitys there. but thats not why i go there. its when i am really broke. and i want food that will fill me up.", "author": "Nicholas Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "I suppose people who grew up with silver spoons or camping out at the local suburban mall would find this place disgusting as most hole in the walls are, but personally I love this place.  The food is great and for a starving student just getting out of afternoon class, you can not beat the price.  Keep it up super star, im a customer for life... and dont trip, Ling Nam cant fade you guys.", "author": "eddo l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-31", "description": "the place is one of the best places i've eaten at. the garlic fried rice is perfect. not too strong or salty, HK style pork chops are the way to go. they're like the size of my head. Fried chicken there is huge and delicious. all for under 4 dollars too!?!? crazy!?! yes its dirty, but those are the best places to get food at", "author": "Preston L."}
