{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "This is the place to go for lunch if you work in the Embarcadero and don't want to spend a fortune on sushi. They have pre-made sushi at the counter you can grab if you're in a hurry or you can make custom orders off their menu. Not a lot of seating, but the food is good, affordable and quick!", "author": "Mara P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "If I could give zero stars I would. The one star is for the nice cashiers. That's it. Don't go here. \n\nMy colleague and I both got the lunch box: teriyaki chicken and rice with four California rolls served with miso soup in a coffee cup. Simple enough right? I am in no ways a good cook and I guarantee you I could make something that tastes better than what I had to force down earlier today. The chicken did not look like chicken. The chicken did not taste like chicken. The sauce that it was drenched in didn't even taste like teriyaki sauce. The miso soup was decent, but I'm a sucker for miso soup. The rice was odd to say the least. To be generous, the California rolls were bearable. Imitation crab with rice that felt like it's been left out for quite some time. I didn't know it was possible to mess something as simple as a California roll up. My colleague literally threw up his lunch. I don't usually write Yelp reviews, let alone bad ones, but this place is just that repulsive. Please do your taste buds and stomach a favor by going somewhere else.", "author": "Justin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "Add me to the folks who should have yelp before I help myself to this establishment's grub.\n\nTHE STAFF IS SUPER NICE.\n\nbut still that doesn't save it from being a horrible place to eat and thus the one star. \n\nThe teriyaki isn't even teriyaki. It's some weird day old chicken that no one wants drenched in what I believe is watered down teriyaki sauce. Yes folks. Saving on all fronts.\n\nThe \"California\" roll that had rice, seaweed and imitation crab got squished under the container for the tempura sauce and the tempura...don't even get me started on that.\n\nLong story short. I couldn't finish my meal. I'll chalk up the $13 spent as lesson learned. Avoiding this spot for lunch in future.", "author": "Whitne Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-20", "description": "I should of Yelped reviews before I handed over my card. Based on my love for Lion King this was no where near good. It was simply ehh. I think they had it on standby by because it came so quickly. Over all I'd pass this place up if ever in the area. Clean location, somewhere to sit, friendly staff. \n\nLion King could use some work of love.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-12", "description": "Ugh!  Why on earth did I come back here? Am I a glutton for punishment? I wanted to give this place another chance, and I left gagging.\n\nThat will teach me.", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Sushi Kinta is a small Japanese restaurant in the Embarcadero Center food court. It's a small place but it does have a couple of tables inside to dine-in. I've been here a couple of times to get their Lunch Box (~$10) which contains chicken teriyaki, rice, tempura, California roll and miso soup. \n\nThey are pretty generous with their portion especially for the rice which is of a decent quality. The tempura & California roll are average. The tempura is vegetable and shrimp combined. It is fried correctly and not too oily. The chicken teriyaki is very good. The chicken is soft and juicy but it is drenched in teriyaki sauce (so get it on the side if you prefer). The miso soup comes in a coffee cup (the first time I returned it back saying I had not ordered coffee :)).\n\nPeople behind the counter and courteous and order fulfillment time is less than 5 minutes. Food consistency is maintained across visits. I'm not sure why this place has such a low rating but what you are getting considering the location and price seems to be a decent deal to me. Generous 3.5 stars rounded up to 4 is how I'd rate this place.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "I got the Vegetarian Box ($7). \n\nThe portion size was generous. I got tons of rice on my plate. \n\nI usually like cooked broccoli. I found the broccoli to be kind of raw. The salad was just lettuce and dressing. In general, the vegetables were barely seasoned.\n\nIt seemed like the employees were rushed. I noticed that some of the dressing on the lettuce ended up mixing with the light sauce on the broccoli. The two sauces didn't mix very well for me even though the sauces were more on the plain side. \n\nWhen I asked for more sauce, the employees were quick to hand me a little container of teriyaki sauce. \n\nSince this place is not too expensive, I may come back if I need to but the food was very average to me.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-21", "description": "This place was really bad. Curry was the worst curry I had in the bay\n\nService was slow as well. Curry seemed like grocery curry. SAD!", "author": "Tony W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Agree with the others that food is expensive. Sushi is ok -- not the best or worst I have had. Staff is very nice and pleasant. Service was quick.", "author": "Livernonions P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-31", "description": "Pretty cheap chicken teriyaki ($9 w/brown rice + tax), but I won't be coming back for more fatty sugary chicken... \n\nFriendly service but for the same price - I'd rather go to:\n- Niiji Japanese Grille where they've got white meat chicken teriyaki or\n- Delica at the ferry building for healthier more authentic japanese", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "AVOID\n\nOk. I have been working in Downtown SF for quite some time now and was perusing the area for a new a place to try.  I did not open the Yelp! app and am regretting that now.  I saw a decent crowd at this place and figured I would give it a shot.\nI don't do a lot of reviews but as I was eating the chicken I thought, \"I gotta look this place up and warn others.\"\nI went Premium and ordered the deluxe.\nThe faux crab California roll (which is what I expected for the 12.00 deluxe price) was flavorless and appeared to be pre-made.  I expected the guy behind the sushi counter to have a hand in the process.\nThe chicken, as another Yelper mentioned, was day old and/or over marinated.  I thought I was eating duck.  I had two pieces and discarded the rest (not sure the chicken is compostable).\nI did eat the three pieces of Tempura, which was pretty greasy.  (My burps taste like I had too many donuts.)\nThe rice was ok but not worth $12.00.\nThe Miso soup tasted like the kind you get from the packet, but it was freezing outside, so I drank most of it.\nShame on me for not evaluating the reviews on Yelp!\n$12.00 down the drain...", "author": "pablo p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "The sushi here has too much rich and not enough sushi. Also very pricey. I ordered very standard, simple rolls, 3 of them and it totaled $21. Eh, not great quality, not great craftsmanship and not enough, but expensive. Would not return or recommend. Save your sushi appetite for a different neighborhood with better options.", "author": "Marie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-13", "description": "I wanted to try something new with GF, since we were both in the mood for Sushi/Japanese. We had walked past this place a couple days prior. When we came we ordered the veggie lunch and the deluxe lunch. Our food was done suspiciously fast. \n\nThe teriyaki chicken was disgusting to even look at, hard to break apart, and I was afraid to eat it, I ate one out of ten pieces at most. The tempura was one piece of shrimp and two carrots, I did not feel like they were freshly fried, the California rolls w/ imitation crab meat were o.k, the miso soup did not contain seaweed or tofu cubes (o.k), the pickled ginger had a preservative after-taste (not o.k), the white rice was fine (hard to mess that up)...\n\nThe veggie lunch was mainly broccoli and carrots (lots of variety.. Not!) with brown rice, and a side salad with thousand island dressing.\n\nMy conclusion is: Sushi Kinto is very mediocre at best, 2/5 rating, and would not come back here considering all the options around the Embarcadero buildings...", "author": "Madis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Just wanted to send some love to Sushi Kinta because their ratings are surprisingly low for what they deserve. The service is always fantastic and the sushi is fast & fresh. Sometimes, they even give me an extra \"bonus\" nigiri with my order because they are just that awesome.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-07", "description": "10.05.16 etc.\n\nSolid place for a quick lunch whether you want to dine in or take out. The folks working the counter and preparing the food are nice and efficient.\n\nI thought the chicken teriyaki could have been flavored a little better, but the CA rolls weren't half bad.\n\nhttps://www.yelp.com/biz_photos/sushi-kinta-san-francisco-2?select=XCZ7xmCj92Ra5f6Vov3wSw&userid=tGgTIueZy1JNTzQD9rkZLQ\n\nTempered expectations are sometimes a good thing?\n\nTotal damage: $9.35", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-01", "description": "My office is located so close to this place that I could throw my briefcase at this place.\n\nWhich is kind of how I felt anyways after eating here.\n\nThis is beyond cheap, even for Japanese fast food.\n\nThey have crappy fake crab that tastes like plastic. \n\nCold gummy rice.\n\nUnfresh fish.\n\nRun, run, away.\n\nYou'd be better off getting something from McDonald's down the street.\n\nAnd this is coming from someone who dislikes McDonald's!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "This is an awesome whole-in-the-wall sushi spot. Don't listen or give any credence previous star ratings. Been coming here for lunch Elmo's every Friday for two years and the fish had been consistently fresh and delicious. It's not a \"fine dining\" establishment, it's a quick sushi grab. So yummy!!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "I got a blossom chirashi bowl here with salmon, tuna, and avocado. I thought it was pretty decent for 8 large slices of fish. The tuna melted in my mouth. The food tasted pretty healthy so they probably don't add too much to the sushi rice (salt, sugar, vinegar). You add your own soy sauce/wasabi/ginger. It's especially good if you're going for gluten free and dairy free. I also happen to have a mild shellfish and nut allergy. My only suggestion is to have additional sauces for people who want more choices for their chirashi bowl (teriyaki, ponzu, etc.).", "author": "Jeanne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Sushi Kinta is not the greatest Japanese restaurant around, but it is convenient and provides both a filling meal and comfortable seating.\n\nI came here when the lunch time rush was dying down so I was able to order as soon as I got there. I got the lunch box which they brought to my table. It came with teriyaki chicken, four pieces of california roll, rice, and a cup of miso soup. The miso soup was a nice side to the meal to warm up with though vegetables were severely lacking in the meal. The california roll was pretty good and the chicken albeit a little bit salty, was moist and well seasoned. The atmosphere has a modern and comfortable feel, being a nice, quiet place to read or do other things. Also, their workers are super friendly with helpful attitudes.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "For those of us who work near the Ferry Building, I think this is the best option for quick, cheap sushi. Glad to have them.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Great for pick up and go sushi, which includes a small dining area.  Exquisite cuts of high quality seafood.  I was pleasantly surprised with the top grade fish that you could expect from a trendy sushi bar.  The blue fin tuna special is extraordinary for the price:  $15.60 for 4 pieces of nigiri and several cuts of mixed sashimi.  Great cuts of marbled blue fin tuna and some of the best salmon I have tasted!  They include a small side salad with your order", "author": "Richard H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-29", "description": "I got a premade sushi lunch box the other day and it was just ok although salmon was good! Suitable for quick lunch but I won't have to go back to this place again.", "author": "C M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "Not the most amazing sushi joint, but a good place to get a quick meal, reasonably healthy and under $10", "author": "Alfonso C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-02", "description": "Cash only. They have an ATM inside that costs $2.75 for withdrawal... Might as well walk a block to Walgreens for cash back or to your nearest bank haha.\n\nThey don't have a lot of selections and their prices are affordable. Service is nice. Place is clean but small. I got the California Roll and Rock N Roll.. I have to say.. They are very tiny. Rice was a little dry. The California roll had no mayo/dressing/whatever. Rock N Roll was okkk but lacked some flavor. A coworker ordered an Unagi don. Looked really good. Portion size was decent. She said it tasted good so maybe the lunch boxes are better to order? Definitely not coming back here for sushi...\n\nOdd thing: My coworker's Unagi don came with miso soup... and it came in a coffee cup LOL. She doesn't like Miso so I gave it a try.. The color was not natural... it was some deep mustard yellowish color. The taste was gross IMO.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-23", "description": "Looking to waste your hard earned money for mediocre service and food? Try this place!\n\nEverything here is served in cheap plastic cups and plasticware.\nThe Miso Soup to start off with; was super salty and over seasoned.\n\nTheir Kamakazi and 49er roll was very bland, and looked nothing like what I usually have.\nIt's very expensive for the crap effort they put into making the rolls. \nThe rice is very cold and tastes as if it was made a few days earlier.\n\nI usually finish my sushi. But this was HORRIBLE!  Who knows why it's still here?", "author": "Marina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Quick stop for sushi-to-go -- 49ers and Amazing rolls were both great!  Decent sized rolls, decently fresh fish, especially the salmon (and on a Wednesday afternoon).  Friendly staff, fast service... \n\nNot sure what all the negative fuss is about, but if you're looking for some raw fish at a reasonable price, this place is worth a try!", "author": "Jon K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "Solid sushi for a very good price in downtown SF. If you're hesitant to check this place out due to the low Yelp rating, JUST IGNORE IT AND GO!\n\nI work a couple blocks away and have been coming here quite a bit since mid-2013 when I first discovered it. It's my go-to spot for a delicious and cheap sushi lunch. I've taken plenty of friends and co-workers here, and everyone has really liked it so far!\n\nI've never ordered their bento meals or curries but go straight for their sushi, which is solid. My usual order is a caterpillar roll, a 6-piece order of salmon sashimi, and a miso soup, all for $20.92. (Yes, I've ordered this combo so many times I've memorized how much it costs. Don't judge.)\n\nTheir miso soup really hits the spot on a chilly winter day. I was pretty cold when I headed into the restaurant today and it was exactly what I needed to warm up to a nice toasty room temperature. And their salmon sashimi is surprisingly decent for the price you end up paying...it's definitely the most consistently fresh salmon I've had at any sushi joint in downtown. And considering that I've been here countless times, that's saying a lot! :)\n\nI've heard from some of the people I've taken here that their other dishes - specifically their curry and teriyaki chicken - are really good too, but I cannot personally vouch for them.  \n\nThere is some limited seating inside but it isn't a big space. I think they have enough tables for maybe 10 people perhaps? And then there's some additional bar seating on the side. I usually come anywhere between 11:30 and noon, and I've been lucky enough to always find a seat for two people. \n\nThere is a bit of a wait for your food, especially around prime lunch time, but I don't mind. There's only one guy making the sushi rolls so it's understandable if they're a little bit backed up. \n\nThey used to be cash only, which was the only thing I didn't like about them, but starting in December 2014, I started noticing a new sign saying that they now accept credit cards!!! SCORE!! That might be why I've already been there for lunch 3 times in the last 3 weeks already...whoops!!", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "Decided to drop in for lunch because this place looked legit.  I ordered the Deluxe Lunch Box to take back to the office and was really excited. Unfortunately, when I got to the table to eat the food looked awful. This is the way food looks when the owner/operators have LOST ALL PASSION FOR THE FOOD. Luckily, they have a steady stream of hungry financial district workers but I don't see how they can be proud to serve this food to San Franciscans.  This is a sorry excuse for quality Japanese food. The tempura looked and tasted like it was fried in old oil- It also looked like it came out of a box from Costco or something-Definitely NOT fresh. The  teriyaki chicken tasted over done and the teriyaki sauce was not balanced. I felt so bad because #1 I wasted my money on this plate of garbage and #2 I felt like I contributed to an overall waste of resources to put this disgusting stuff in a plastic box. I barely ate the food and through it in the composting bin. Needless to say, I will NEVER return.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "Came here with some coworkers for lunch. I ordered the salmon teriyaki, which was okay flavorwise (fine, not great), but the salmon was bone dry. I would probably come back if everything nearby has a long line, but I wouldn't set out to come here on purpose.", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-18", "description": "I'm lazy and I'm impatient.  And by this I mean, I'm too lazy to walk my ass to Delica at the Ferry Building despite working on California and Davis, and I'm impatient in the sense that I didn't want to wait in the insanely long line at Chipotle for lunch today.  What happens when these two things happen at the same time? I end up at places like Sushi Kinta.\n\nSushi Kinta gets one more star than it's neighbor, Crepe N Curry, for it's food.  I had their chicken curry rice bowl for lunch today and while it hardly holds a candle to places like Japacurry, it wasn't overly offensive.  I even ate all of it. The rice bowl comes with an absurd amount of potatoes that are WAY too big to eat without a knife, and yes, they use the same chicken that is used in the chicken teriyaki.  And yes, to confirm, they give you miso soup in a coffee cup.  The curry was uneventful, but more flavor than I think what people on here are saying.\n\nWhere it gets knocked one star: There are signs (and Yelp reviews) all over the place that say it's Cash Only.  There's even one of those stupid robot looking ATMs conveniently located right by the register in case you forgot paper.  In waiting for my food, two people walked up to the counter to order, placed an order with the lady at the register, only to realize that they didn't have cash on them and proceeded to walk out.  The woman, who I thought was going to tell them they had to come back since she had yelled behind the magical mystery curtain the orders, proceeded to call them back to tell them they could use their cards after a whimsical credit card machine that was squirreled away underneath the register appeared. So, as it turns out, Sushi Kinta can take credit cards. Unreal.\n\nOk, so, similar to my earlier sentiment, nothing in this corridor impresses me, with the exception of Paramo, who I deeply trust and love for my early morning coffee fixes.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-29", "description": "Uneithical Practices and Horrible food... save your money. My total amount was $11.42 and the charge came out on my card statement as $13.70... wow!!! stole $2.28. And when I asked them about it, they had an attitude and refused to give me my money back. I will never come back", "author": "G R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-28", "description": "I just called the restaurant to place an order for pick up. I started by saying that I had a quick question in regards to the menu. I wanted to ask about their curry bowl and what exactly is in it because there was no description on their menu for it. The guy gave me so much attitude in answering my question. I'm assuming he is the owner because I wouldn't expect a regular employee to have such audacity to speak to a customer like that. After he answered he said with even more attitude, \"you have more questions because I'm very busy.\" I was really taken aback. I get it, you're busy. So I did not make a comment on his increasing attitude & rudeness. I said, \"I would like to place an order if that's okay.\" He goes, \"yeah what do you want, hurry up!\" At this point I was beyond shocked... so I finally decided to say something about his attitude. I told him that I will not be told to hurry up & that it's just plain rude. He goes, \"okay, go buy somewhere else, don't come here, if you don't want hurry up then go somewhere else\" and he hung up. I don't care how good your business is or how many people line up daily to get lunch there, as a business owner you should never think for one second that a customer lost is just a customer lost and that it's okay to blow off a customer since one customer is not going to make a huge difference in your profits... And it's definitely not okay to treat customers so rudely when they have not done anything. What's the time difference between someone asking a question about the menu and placing an order on the phone and someone asking a question about the menu and placing an order in person? Not much, or not at all. But you're just soooo busy right? But it's fine. I will never eat at your place or give it a try because of your nasty attitude. And just know that there's a reason why your business will always be a hole in the wall, replaceable by so many other better Japanese restaurants. Absolutely ZERO stars, Yelp should really invest in that option...", "author": "Hilary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-10", "description": "Anytime there's no line for lunch on a weekday at the Embarcadero Center, it's a bad sign. Service was fast, but I guess that's only because of the poor food quality. Simple udon bowl was literally flavorless, unseasoned chicken (boiled maybe?) with udon and iceberg lettuce. And for $8+... I've never seen iceberg lettuce used as more than a garnish in Japanese restaurants until now. Severely disappointing. Avoid at all costs. If you need something fast, Taco Bell and Subway are close by.", "author": "Rob E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "FOOD: 3 STARS - I ordered the Four Season roll. The roll was very large and filling. The fish had about as much flavor as you'd expect from a walk-up style sushi counter. Unless I somehow get food poisoning tomorrow, I would say the food quality was good.\n\nSERVICE: +1 STAR - I had to run back to my office to get cash to pay. The sushi chef added an extra large piece of tuna to my order to say thank you for bearing with their cash-only policy. \n\nI'm not too sure why this place has a 2.5 star rating... It seemed fine to me! Nothing fancy and the flavors weren't top notch, but what do you expect from a $10 roll?\n\nLocation was also great as I work nearby. \n\nI will be back when I am craving sushi and I'm stuck in the FiDi.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-06", "description": "This place is TERRIBLE!!!!!!! \nI was starving one lonely lunch hour. No input from a lunch partner, and for some reason, no consultation with the yelp app.\n\nI wanted a filling, fast meal. \nMy bento was prepared really fast. \n\nBut here's a rundown of the items in this clear to-go container:\n\n-Boiled pieces of chicken slathered in goopy, sweet teriyaki sauce\n-boiled vegetable that were also chilling in the same sauce\n-normal white rice\n-pieces of lettuce and cabbage with a giant puddle of thousand island dressing\n\nThis place seemed busy enough to be decent! The food appears to look ok but i am vowing to never go here again! YUCK", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "Lots of reviews here for the chicken teriyaki / cooked chicken. Don't get the chicken teriyaki - I've had it and I sort of see the point.\n\nHowever, went today and ordered some sushi and was very pleasantly surprised! Took my ordering cue from a coworker and got a tuna avocado roll and a salmon avocado roll, with spicy mayo on the side. They threw in a piece of salmon nigiri for free!\n\nFish was fresh, and sushi was quite tasty - particularly for the price point ($12). I'd go back.\n\nPro tip: dip your sushi in soy sauce, then spicy mayo, to get the most delicious flavor combination ;).", "author": "Laurel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-28", "description": "First time getting food there. Asked for the lunch deluxe box which is supposed to have teriyaki chicken, rice, California roll and tempura shrimp. Everything was fine until I got to the shrimp. Because there wasn't any. Instead of shrimp it was a breaded carrot", "author": "Mauricio E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "***Disclaimer ***\nI  did not check reviews before I came here. Warning if a place in a busy area is empty or has open seating do not proceed. Secondly, if you are served lettuce in a \"hot\" soup you are already to late. \n\nI had a event near Justin Herman Plaza and decided to go here as opposed to the Ferry building because I only had 30 minutes to spare for a 2pm lunch. About 20 feet away, with no lines and open seating it was the perfect place to have sashimi or an udon bowl. They were out of of most of the sashimi cuts so I opted for an udon bowl. When I received my udon bowl it was covered in iceberg lettuce; a hot bowl of soup covered in iceberg lettuce was very odd to me but I decided to pick around it and try the soup base. In one sip of the soup it tasted like they poured half a bottle of salt in the bowl. My lips were burning from just that sip. I told the staff of the issue and one offered to help however another \"older\" woman stopped her and said that \"IT'S NOT OUR problem, it's Yours...just ask our customers they all have no problems with the food!\" (Mind you the restaurant was empty. )\n\nI was originally willing to give the business a second chance on a different menu item, however after the poor service I received I will not be coming back. They did not offer or provide me another menu item or refund but the \"older\" woman had the audacity to suggest resaling my \"tasted\" bowl of Udon.\n\nLocation: 10\nAmbiance/Seating: 7\nService: 0 \nFood: 0\n\nAvoid this place at all costs! Like the other guy said, \"Go to Subways.\" Anywhere else. I would have rathered coming back late than giving this place my business.", "author": "Haben E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-19", "description": "Bleh. I got one of their prepackaged sushi boxes with a few pieces of nigiri and a California roll. The fish was a little bit on the fishy side.. But I was really craving sushi and this was the closest place to where I work. My coworker got the a bento box and he really enjoyed it. So maybe go with the cooked foods from here instead of raw fish.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-17", "description": "I overall had a good experience here and the food isn't bad! This is not a traditional walk in and dine restaurant. This is located in Embarcadero 5 so much of the seating is outdoors. They take your order at the door and serve it to you in a container. The staff were very courteous and coming here before lunch (around 11am) will probably get your food faster. I've been to similar restaurants that didn't quite emphasize the customer service aspect, so to me that deserves some points. If you need sushi to go, try this place out!", "author": "Destin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-11", "description": "This place is god awful and a disgrace to \"Japanese\" food AND Embarcadero Center. There was a small line at noon time so I assumed it was good enough and I had been curious about this place for some time.  I had the lunch deluxe box. It came with:\n\n-two carrots and a shrimp disguised as tempura. The batter had the consistency of cheap fish n chips. \n-chicken in an all too salty, all too sweet sauce. The inside is tender but the outside is rock solid, so that tells you it's been on a hot pan all morning.\n-miso soup served in a coffee cup that was bland and had exactly two pieces of tofu\n-huge scoop of rice\n-4 piece CA roll. \n\nThey also have premade rolls but rolls at Safeway looked more appetizing to be honest. Its only saving grace is the speed but like other things that come too fast, this place leaves much to be desired.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Good sushi for this price point, just over $10 for lunch. Had an excellent unagi (eel) bowl with big slices of avocado, a steamed carrot and steamed broccoli. It was healthier than I expected. Had a couple of pieces of hamachi nigiri that were very good. Opens at 11 for lunch, for which I am grateful.\n\nThere is limited indoor seating and some lovely patio seating looking out towards the Ferry Building and the SF bay.\n\nThe best sushi in SF is at Kusakabe. Kusakabe is only open for dinner and is $$$. Sushi Kinta is good sushi for its price point, not rock your world sushi for $$$. Please consider adjusting your expectations.", "author": "Vena V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "We did not \"Yelp\" this place before going....\n\nFirst impression was bad, as the sushi chef was extremely rude the moment we walked in literally saying \"what do you want!?\" Very impatient, not even allowing us to look at the menu. We should have took that as a sign to get out, but continued with our order anyway. We asked for take out and ordered the curry chicken bowl and a sushi combo.\n\nThe server, which was a lady, came out shortly after we ordered, and was much nicer.  The curry tasted like instant or frozen, the chicken was tough/chewy and rubbery. The sushi was nothing special either. Would not recommend.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Great sushi to go and this is the only place when I feel like eating Japanese for lunch at a reasonable price! I always get their sake (salmon) sashimi with a side of rice. Their slices of sashimi are pretty huge and it gets me more than full for a regular size. Also, i got a spicy tuna roll once when i wanted to eat something light. Not bad for $6 and not feeling too full - it's just right.", "author": "Kaydee B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-04", "description": "Messed up my curry order, waited over 30 min for it. \nI was gonna let it go as it is pretty busy today and ppl do make mistake. \n\nBut the meat in my curry is simply disgusting and curry sauce is so diluted. \n\nAvoid this place.", "author": "Barry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "I love this place and it's a go-to for a lot of my meetings as the quality of the fish is great, and the lunch boxes in the display case are perfect for times when I don't have time to wait. I also enjoy ordering catering from them for the office and whenever I do, there aren't many leftovers if even all. Once I even had to go back for more because we ran out and everyone wanted more more more!", "author": "Myra Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-07", "description": "I've passed this place many many times without noticing it. Today a coworker suggested it so we popped in. I ordered the hamachi lunch box special which had 9 pieces of sushi + miso soup and salad with an indistinguishable dressing.\n\nThe sushi was actually really good! Very impressed. Soup and especially salad were skippable. \n\nBut, they are cash only. I pretty much never carry cash so this is a significant barrier to me returning. Also, I was hungry again at 4 which after I pay $13 for lunch is not a good sign.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "This was literally the saddest bowl of Udon I have ever encountered. I got my order back to my office and was confronted by a bowl full of lettuce; this means mistakes were made. Lettuce has no place in soup, ever. And there were NO OTHER VEGGIES. The broth also tasted instant. After I fished all the lettuce out in a panic in attempt to save my lunch from oblivion, I ate it, simply because I was hungry and sad. The tempura included two large shrimp (not prawns) and exactly three pieces of veggies. To be fair, the tempura was well cooked, fresh and crispy, but it also tastes like it's time to change the oil in the fryer. I guess that's what I get for trying to find lunch in Embarcadero Center for under $10, especially since the restaurant was totally deserted.", "author": "Nicky T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "I tried this spot as I heard it was ok...well it ISN'T!!! I requested the same roll that they had in their display case except switching out cucumber for avocado. The roll I received had dramatically less fish on top compared to the roll in the display case. It was a few thin chunks on top of each roll and I could see rice in the spaces between them...what the hell. The roll was so loosely assembled that the pieces fell apart as I picked them up with chopsticks. The salmon sashimi they had was the most disgusting sashimi I have ever had...SUPER slimy and chewy. Once I started gagging I knew it was time to stop trying to finish the roll. It wasn't cheap either - $14 for a tiny roll with an additional 4 tiny pieces of CA roll. I ate the sushi a few of hours ago and my stomach started hurting shortly after...it is still hurting this very moment.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "I actually like this place and go regularly for lunch.  It is not fancy or special, but the people are nice and the sushi is good.", "author": "Claire Lucy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "I've eaten here for lunch twice this month because the rain has kept me in Embarcadero center where I work. \n\nThis place has taken some heat for their \"cash only\" policy, but as of 12/2014 they have a little sign in front of the register that clearly indicates they take credit cards, and I have never had an issue.\n\nI've only had the sushi from the display case, but it was very good both times. Another reviewer compared it to grocery store sushi, which I disagree with. The fish is fresh with large thick cuts and the rice is not hard or overly cold. I recommend eating your salad and soup first while you let the sushi come to room temperature.\n\nHonestly, this place is about a 3.5 star lunch spot, but I'll round up because the owners are always friendly and fast when you order.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "So disgusting! Ordered tempura udon which came out in less than 2 min (mildly concerning). The tempura tasted stale on the outside and mushy on the inside, like it had been sitting for days and zapped in the microwave. The \"udon\" looked like instant miso soup with a pile of wilted, dirty lettuce on top. I immediately walked back up to the counter to let them know I wasn't going to be able to eat this and the lady started arguing with me and had the nerve to accuse me of already eating half. I didn't even asked for a refund, just a swap for a spider roll (which was $2 cheaper than what I paid) and she kept saying that was too expensive and I could have a California roll instead (which was less than half of what I paid). After several minutes of back and forth a girl came out from the back and gave me a pre made spider roll and sent me on my way. Never coming back here! Go to Onigilly two doors down with way better food/customer service!", "author": "Tori M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "Nice people but I was not a huge fan of the Lion Roll. I've had it before and the entire roll has been served pleasantly cold. The salmon was warm and the roll was cold, which I was told afterward was the way they serve it, but the two sensations eaten together left me lukewarm. That said, I will be back again and try a different item.", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "I was looking for something quick...and no doubt their service was fast and friendly. but the Teriyaki chicken was so overcooked and dr (thigh meat) \nAlso didn't like the hot food served in thin, plastic containers...", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "I really don't want to write a bad review but I think it would be an injustice to not write a review for yelpers.  So, here it goes......\n\nI had lunch here with a friend.  We both ordered bento boxes.  My box consisted of 3 pieces of california roll; 2 thick slices of carrots; a small piece of shrimp; miso soup; rice and terribly cooked chicken with what was supposed to be teriyaki sauce.  After a few bites, I couldn't stomach anymore.  I've never had anything that tasted this bad.  This place literally left a bad taste in my mouth.  As soon as I got back to my office, I wanted to brush my teeth to rid my mouth of this awful taste but I'm out of toothpaste.  So, I've had a couple of Altoids and hard candies that  seem to help just a little.", "author": "El A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "Nope! I should have yelped this before trying ... chicken meat is dark and gross. Doesn't look like the chicken was cleaned at all. Friendly service but awful food.", "author": "L K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-11", "description": "Vomited and had stomach issues for the rest of my evening after eating here. The food seemed good and a great deal at first, but having to deal with the aftermath means I'm never eating here again.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-25", "description": "How does this place stay in business in the Embarcadero Center?  \n\nAfter a morning of trimming trees and clearing brush at the nearby Justin Herman Park a group of One Brick volunteers including myself descended upon the Embarcadero Center for lunch.  With all of the restaurant choices available at Embarcadero Five I probably chose the worst place to eat.  I had, without a doubt, the WORST chicken teriyaki ever at Sushi KInta.  \n\nA dark brown sauce covered a big chunk of dark meat chicken over a bed of white rice.  The thick sauce did not taste anything like teriyaki and was very salty.  The chicken was not fresh, and I could taste the nastiness of the chicken meat which wreaked of a foul aftertaste.\n\nA side of steamed vegetables (carrots and broccoli) was drenched in a brown gravy and the \"salad\" made up only of lettuce was drowned in a thousand island-type dressing.\n\nNeedless to say I ate maybe three bites of the Chicken Teriyaki Lunch Box before I tossed it.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-06", "description": "Walked in right before the lunch craze and ordered just the hamachi roll. The staff is pretty friendly, accommodating.\n\nChose to eat my roll in the privacy of my office, which is good because I would've thrown a hissy fit at them for the hair found in the pickled ginger.\n\nWhich, really, is a shame, because I love having a bite of the ginger between each sushi piece. I continued eating the sushi roll anyway, because a) it was good, b) I was hungry, but most importantly, c) well, the hair wasn't in the roll.\n\nAnyway, the whole hair in ginger bit turned me off.\n\nIf you do happen to stop by: CASH ONLY.", "author": "Adena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "Great value, decent specials.  I get 4 pc. California roll, white rice, teriyaki chicken, 4pc shrimp/veggie tempura and miso soup for $10, can't beat that and it tastes just fine to me.  Good even!  I don't know why they're rated so low.  Oh and they definitely take plastic!", "author": "Tina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-05", "description": "How and why is this place still in business? It's too bad there isn't one single Japanese take out within the 4 Embarcadero buildings other than ramen and Onigilly. Food is over priced, their udon is probably frozen ones from Asian grocery stores and their staff needs to start with basic customer service skills.", "author": "Maggie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-28", "description": "I came here for lunch with a friend, and we weren't really feeling any of the other places at Embarcadero Center (not in the mood for sandwiches, mostly) so we decided to venture over for some sushi.\n\nFirst of all, it's cash only! Make sure to have cash before you go.  The food is pretty reasonably priced, and you get a lot of food in the combos.  We got a deluxe combo and a sashimi box.  Both of the food comes out immediately in the togo boxes,and if you want to eat in the store, they give you a little carrying tray.  It's not the greatest, but it's good for a quick lunch.\n\nMy only gripe is that they put the tempura in the same compartment as the teriyaki chicken, so it got kind of soggy!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-29", "description": "It's an alright sushi joint. It is convenient sushi for me, but it is not a place where I would recommend to make a special trip to for a sushi lunch. The miso soup is watery and just tastes more bland compared to other miso soup I have had. The staff are all very polite, so that's a good thing.  \n\nCash only.", "author": "Clarice O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "Awful food. The chicken may have been pressure cooked. The teriyaki sauce tasted like watery sweet hoisin. People are nice.", "author": "Shawn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-26", "description": "Had the spicy special roll. This is as close to gas station sushi you can get at a sushi restaurant. My gag reflex kicked in trying to finish this roll. Avoid at all costs!", "author": "Alex V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-03", "description": "I haven't been reviewing lately but this one stands out so much that I feel compelled to write one.  This place had by far the WORST udon I've had in my lifetime.  The portion was very small and the only vegetable I saw floating in the soup was lettuce (not cabbage!) -- no carrots, no onions, no scallions, no other ingredients you typically expect in udon soups.  The broth was just awful and tasted like it used an instant miso mix.  It gives all Chinese-owned Japanese restaurants a really bad name.  It's too unfortunate that we have such a poor quality Japanese eatery in the heart of the financial district.", "author": "J. P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-10", "description": "I was really excited to find a Japanese restaurant so close to my new work and after my disappointing first experience here, I thought it was just a fluke and I came back a 2nd and 3rd time and I finally gave up.\n\nI've ordered the chicken teriyaki bento and the curry chicken here. I love sashimi but based on yelp reviews before my visits, never would I dare to eat raw fish from here. I figured can't go wrong with cooked chicken. Boy was I wrong. The chicken was chewy and appeared to be undercooked and did not leave a good feeling in my stomach afterwards. You'll also get miso soup served in a paper cup.\n\nIt's also a cash only business but they'll happily point u to the convenient ATM located right next to the register. This place is also run by Chinese people, which I don't have a problem with, but just know that you do have Chinese customers who can understand Chinese and what you're saying.", "author": "Anita L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-27", "description": "I should pay attention to the environment. If no one is in your restaurant at a busy place, your food may not be good. I ordered the curry beef bowl. It was awful. It was just stew. There was no Japanese curry flavor at all. No one wanted to eat it. The only reason for the 2 stars is I ordered a CA roll, and it was OK.", "author": "Larissa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-18", "description": "It's not bad ... I was checking out the farmer's market and stopped here to pick up a quick lunch. I got the hama or yellowtail lunch thing for $13. It came with a salad, miso soup, yellowtail rolls and some sashimi pieces.\nI was filled from this and was pretty satisfied. It's not the best sushi EVAR, but it's pretty good for a quick sushi lunch. The fish slices are pretty big.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-03", "description": "The chicken teriyaki plate I got was completely lacking.  Chicken had obviously been sitting out for s while.  Felt rubbery.  Not worth the prices paid.\n\nMy friend ordered the beef curry bowl and it took forever to come out!  When he got it he said that the meat was tough.  Wow... Two for two and both BLAHS!  \n\nDon't bother.", "author": "Marylouise R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-01", "description": "BANZAI!...BANZAI!...BAD TERIYAKI!...HARAKIRI!...HARAKIRI!\n\nPeople presume Pearl Harbor happened because the Empire of Japan was forcing the U.S. to engage in World War II. How naive...after all, we all know that it was a cover-up to hide the truly destructive force coming from the Land of the Rising Sun...bad teriyaki.\n\nIs it too much for chicken teriyaki to look like it came from an actual chicken? Mine looked like it had major cosmetic surgery by a free clinic in Lesotho where they used rubber bands to pull the skin over and sutured it like Frankenstein's forehead. I'm afraid the chicken I had knows exactly how a post-op Faye Dunaway feels.\n\nOnce I bit into the heavily sauced chicken, it had an oddly rubbery texture that forced me to push the styrofoam away, as rare an occurrence for me as a lunar eclipse or agreeing with a Republican. It's a shame because the people serving the food are very nice, and $5.50 seems like a reasonable price since you also get a scoop of rice and some steamed broccoli and sauteed carrots to go with it.\n\nI can't comment on the sushi since I haven't had it here for years, but why should I trust them with raw fish when they can't master cooked poultry?\n\nFOOD - 2 stars...chicken teriyaki only a bad stepmother would love\nAMBIANCE - 2 stars...one of those non-descript food shops along the Hyatt Regency promenade\nSERVICE - 3.5 stars...they seem so nice...hmmm, sad\nTOTAL - 2 stars...cooked poultry should not look like Faye Dunaway's face-lift", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-09", "description": "Meh. I hate paying for Japanese curry made with the same sauce mix anyone can buy at Ranch 99. Come up with your own damn recipe, like the chef at On the Bridge. Also, don't be lazy and use the same thin slices of beef you use for teriyaki. Beef curry should be made with CUBED beef, tender and flaking at the fork because it had been slow-cooked in a crockpot for hours, not dry, flavorless pads of beef that sit on your tongue like wooden splinters of a shipwreck. If you still don't get my point, here's an analogue: Do you pay $10 for a microwaved Cup O' Noodles? No. When you order ramen for ten times as much money as the microwaved store-bought crap costs, you expect a little something special... maybe something a human actually made, not something extruded at a factory and dropped into a styrofoam cup and sealed in plastic.\n\nMaybe I should just avoid Japanese restaurants staffed by non-Japanese-speaking people from now on.", "author": "Lum P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-02", "description": "Today I was wondering what to get for lunch and then decided that the order and attractive appearance of a bento box was just what I needed.  I  knew there was a Japanese place nearby and sought this place out.  I ordered the vegetarian bento box.\n\nService was very friendly and fast.  But cash only.\n\nThe \"bento box\" was a plastic to-go container with a clump of white rice, a hunk of iceberg lettuce with a glob of thousand island dressing on it (\"salad\"), and huge pieces of carrot and broccoli (not bite-size) in a thin, non-flavorful sauce (and dressing leaking from the huge glob on the \"salad\").  I was disappointed.  Ingredients were fresh, and the rice was cooked correctly, but nothing was flavorful or interesting, and I don't think I'll go back.", "author": "Stacey B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-02", "description": "Kinta is the name of a fictional character, however, I wouldn't use that name for my restaurant, because meaning changes greatly by adding 'ma'.\n\nKinta + 'ma' = Nuts. \nI'm not talking about nuts that you eat.  I commend the owners for having the balls to pick a name that is so close to a such word.  However, the real question is, would the customers have the kinta-ma to eat sushi at a place like this?  I would stick to their teriyaki.  \n\nFOOD:  Standard Americanized bento with tempura, California Roll, chicken teriyaki, etc.  Deluxe bento was around $10, which included miso soup.  I thought their regular bento, like salmon teriyaki, for around $6.50 was a good deal. \n\nSEATS:  3-4 small tables inside.  3-4 counter seats.  Plenty of places to sit outside on a nice day.\n\nI would rather walk 100 yards to the Ferry Building and pickup a bento at Delica rf/1 (http://www.yelp.com/biz/xlXnPitrO9Mjfq3aPAyNVQ).", "author": "トモ T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "Warning: stay away!  I got a veggie bowl, which seemed like a harmless choice.  The veggies were borderline rotten, but I ate them anyway because I had brought the food back to my office and was starving.  When I came upon a completely rotten piece of broccoli, however, I couldn't keep eating.  Then I started feeling painful cramps in my abdomen.  I marched the plate back to the restaurant, showed the rotten broccoli and a few shriveling carrots to the owners and demanded my money back.  At this point I was in real discomfort.  The woman at the register accused me of faking about my stomach pain -- even with my rotten broccoli evidence -- and, as with another reviewer, pushed back against refunding my money.  No apology.   Just rudeness.  I did finally get my money back, but my stomach cramps continued into the evening and forced me to cancel a social event I had been looking forward to.  Needless to say I'm never going back to this place.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "Craving sushi? Don't go here! My boyfriend and I were desperate looking for any type of food (preferably sushi) on New Year's Day. We walked for miles and finally to our excitement (or so we thought) came across this place. Shitty service. Shitty food. If you're allergic to shell fish don't get the cucumber salad. They serve you with plastic containers, one random roll after the next. My boyfriend ordered miso soup which they failed to bring him. Sloppy. Food made us nauseated :-(", "author": "Joy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "Wow- I had no idea that this place was hated by so many people!  I come here on a fairly regular basis as a quick stop for lunch and always enjoyed my food - I usually have one of the 4 sushi specials of the day.  I actually felt compelled to write my review because the toro special is freaking spectacular today -  I paid $14.50 (includ $1 tip) for toro and salmon sashimi plus a couple other nirigi pieces and a 4 piece toro roll.   The fish was super fresh - I mean Kiji quality fresh.  This would have cost at least $30 at Kiji or any other sit down sushi joints.  \n\nPlus the owner/staff are really nice.\n\nGive this a place a chance - maybe try the sushi special of the day?", "author": "g. y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-07", "description": "The miso soup was bland and I've never had curry chicken made with teriyaki chicken covered with curry sauce (you can taste the chicken teriyaki and curry sauce at the same time...quite unsual). It was salty and pretty much disgusting. Maybe that's why the miso soup was bland...so you can wash down the taste of your main lunch. \n\nIf you want curry, go somewhere else, anywhere else, but just not here.", "author": "Noreen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-16", "description": "Spicy tuna roll was average. Miso soup was thin and wasn't great tasting. I wanted to like it but I just couldn't. I wouldn't say terrible, like a lot of the other people have said. Just average normalness. \n\nDuring the weekdays, they have a lot of busy people coming in, people who have sushi cravings, but don't want to leave the area. There just aren't that many sushi places nearby. They're open during the weekends too, so they get the Ferry Building wanderers, I suppose.\n\nThis place is super average. The only redeeming factor is their pricing. It's not super expensive.  Good service though, which is why there's an extra star.", "author": "Viola L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "This restaurant is a little shop in a strip mall, and they were real busy for the lunch hour. The staff was friendly and polite. The sushi and rice were made to order, but the rolls were pre-done. Not a huge deal, though. Also, the fish wasn't as cold as it could be - I don't want my sushi frozen, of course, but a kind of tepid wet thing hitting my tongue is a little disconcerting. Finally - the soy sauce came in packets. Hrm. \n\nBut, as I said, this is a little shop in a strip mall. You don't expect wonders... but I would like a little thing to pour my soy sauce out of, thank you.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "I like this place - they are super nice and the food is good.  Rolls are fast and fresh for pick up, and the japanese curry is hot, filling and flavorful.  Not sure what the deal is with the low yelp rating.", "author": "M L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-06", "description": "I guess this is the place to go wrong with chicken teriyaki lunch box. I came here wanting a quick bite to eat before work, and thought it would be okay at least. I've seen it when passing around there but never walked in. I should've kept it like that. I ordered a lunch box to go, and opened it and I was just disappointed.  The chicken was brown and slimy, like it past its due date. I tried just eating the rice and gave up. I stopped eating because my gut was telling me \" this is going to get you sick.\"  For $10.85 I thought it would be good....but I guess not. IF I COULD I WOULD GIVE THEM 0 STARS", "author": "Nathalee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-28", "description": "What do you call someone who writes a review of condiments? Batshit Crazy....until that person is you!\n\nLet's be honest, sushi is pretty boring if you don't eat the dead fish. Mostly, you get some cucumber, avocado and maybe a carrot or whatever. Not too extravagant. And this is why I'm not attracted to sushi. But once in a while, I dabble. \n\nFor 3 years now, I've been workin' & eatin' in the food bowels of SF (Financial District), where food is stupid and overpriced. One day, I decided to try Sushi Kintara and now I'm hooked. THEY HAVE THE MOST AMAZING WASABI THAT WILL KICK YOU ASS. ALL CAPS.\n\nThere, I said it. I'm that weirdo. They are also generous with the other condiments--piles of ginger. And THE GINGER IS EQUALLY AS AMAZING. How can this be? I don't know. It's fresh and large and lovely. \n\nAdd to this, the vegetarian roll is only $4 and the service is ridiculously fast. All of this is the Financial District. Be still my heart.\n\n$4", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "Fantastic catering trays for sushi & sashimi.  Good prices, too.", "author": "Abigail J. M. M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-09", "description": "Many moons ago I loved Sushi Kinta.  We used to go at breakfast/mid-morning for HUGE cups of miso soup with tofu, peas, scallion and nori.  Apparently they've changed ownership a long time back.  I've been a few times recently and can only give the place a meh of a review.  Sad.  Today's unagi donburi was so-so, the salad was chopped iceburg with a really watered down thousand island dressing and the miso was very thin (and I mean on flavor) with 2 small pieces of tofu in it.\n\nI think I will have to find some other place to satisfy my craving for Japanese food, it's not going to be easy in FiDi.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-01", "description": "If only I had yelped before going to this place. The sushi rolls are small, not good/ fresh tasting, and pricey. Cash only also.", "author": "Jeanie F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "Such a disappointment. The sushi is pretty darn good.  The employees are pretty darn friendly.  A 20 minute wait for sushi when the cashier says \"a few minutes\" just is NOT acceptable during lunch.  What I'd suggest is a) go early, and b) see if the specialy you want is already ready. It so, game on. If not, go elsewhere.", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-26", "description": "Instead of teriyaki chicken, there was mystery meat in my lunch box.   It wasn't all that tasty.   \n\nOn the positive side, the service was courteous and fast.", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-24", "description": "Ill eat anything....\n\nDavids bottom line- .... just not this crap ever again.", "author": "David L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-04", "description": "Just as a one star rating goes, eek!\n\nI ventured here for lunch today and the meal was... quite frankly not very good.  Being at a fairly good location I thought it would serve some decent Japanese bento boxes, but thought wrong.  I tried the \"Lunch Deluxe Box\" that was just under $10 and included chicken teriyaki, tempura, and california rolls.  The tempura was sub par and of low quality... almost looked like they made it in a mad rush.  The california rolls were acceptable but then again, who messes up a cali roll?  The quality of the chicken was also very low... actually made me question if it was even chicken.  Plus they must be the only place in the Embarcadero that don't accept credit cards- you're in the financial district!  Methinks not.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "So, after my lunch date with \"Pants Free\" Patton fell through, I decided to solo crush the ol' sushi stand-by. I don't even have to order anymore, when I walk in the door at Sushi Kinta the whole staff greets me excitedly and starts making my spicy tuna roll with extra ginger on the side, gang-bowing me all the while. I find a small table, put in my earphones, and sit silently, eating my meal and playing sudoku. \n\nIt's at this moment when I realized that I've completely assimilated to their culture, and (very quietly and modestly) I chuckle to myself.\n\nI neatly wipe down my space, throw out my trash, and for good measure, thank my hosts profusely, bowing the whole time.\n\nKonichiwa, bitches.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-31", "description": "I probably should have read the reviews here on Yelp before spending my $6.78 on the lunch box (damn you computer problems at work!)\r\n\r\nThe reason why I came here was because yesterday, as fate would have it, I had a bad encounter at All seasons restaurant employees, and even before eatting there, I walked around the food court underneathe the Hyatt, and saw this Japanese place. \r\n\r\nWhat should have stopped me immediately before entering is the Cantonese language spoken inside the place. I'm Cantonese, but I hate it when Chinese people hate Japan for their actions prior to WW I, but turn around and open a Japanese restaurant. How pathetic!\r\n\r\nAnyways, I stared at their menu for what seemed like 300 secs, and nothing was really enticing. The typical japanese stuff.. nothing exciting. \r\n\r\nWell, here it is again, my CHICKEN TERIYAKI test.  Folks, Japanese restaurants live and die by the infamous dish. If it doesn't taste good, most likely the restaurant will fail at everything they put out.\r\n\r\nSK is no exception. When I got a seat, my teriyaki seemed to be hot, but when I examined it closely, it wasnt really meat.. it was more like quasi fat, meat by-product that barely passed the USDA health inspection! Rice was decent, and I ate more of that than the chicken itself. The Cali roll was nothing to write home about... consisting of seaweed, rice, weird avacado mixture that seemd to come from guacamole, and imitation crab meat. \r\n\r\nMiso soup is Miso Nasty! Whats with some fake seaweed and miso soup without any real miso in it!\r\n\r\nSick, absolutely disgusting and tasteless. Even the ginger was bitter. Ordinary Japanese place looking for a quick buck. I hope they fold pretty soon so I can open something better. \r\n\r\nTwo chopsticks down ..", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-11", "description": "Food was terrible! I loved how the place was quick and on a Monday at 1pm, it wasn't busy. That should've been my tell-tale sign!  Well, the sign on the window does not match the menu on the wall; fine, whatever. \n\nI ordered a lunch deluxe box - $1 more than a lunch box - because I wanted shrimp tempura. I paid a dollar more to get one piece of shrimp and 2 pieces of carrots (I HATE CARROTS!). Chicken must've been old because it looked brown, sushi definitely old as the avocado was brown, rice was fine because seriously, if you screw up rice...\nI ended up tossing everything after just a few bites. So not worth the $9.60!", "author": "Pearl S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-31", "description": "One must be desperate for Japanese food to come here.  We don't fall in that category but we walked from Chinatown to the Embarcadero trying to find the right place to grab a quick bite - somehow something caught my hubby's eye and he said let's just try this place.  It happens every time when I let hubby decide on where to eat...I've yet to learn from my mistake.\n\nUpon walking in, I knew it was not authentic - the people behind the counter were speaking Cantonese.  That's cool - let's not judge...yet.  Hubby wanted a hot bowl of udon so we ordered:\n\nseafood udon - this was a chinese version of seafood udon - the udon was not chewy but doughy.  It came with pieces of iceberg lettuce.  The seafood was 2 shrimp, 2 slices of  pink fish cake, 2 white fish ball.  The broth was blah.  \n\ndragon roll w/ california roll - special of the day - came with miso soup and house salad.  both were ok.  miso soup was blah.  lettuce served with a dressing that's almost identical to thousand island - another chinese twist.  \n\neverything is served in to go containers regardless if you are eating there or taking it to go.  The udon was served in the tall plastic tub.  The miso soup was served in a hot beverage cup - like one you would get for coffee.  \n\nCash only.  Don't have any?  No worries, they have an ATM machine inside at your convenience.\n\nThe total came to just a few cents under $20 - I'm sure you can find better food for the price elsewhere.  Skip it.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-12", "description": "A sushi place run by Cantonese people?  Yeah, it's about what you'd expect...\n\nPros:  very friendly, very fast, very close to my office.\n\nCons:  food is not that good.  The sushi is a little better than the teriyaki/bento boxes IMO.  The quality of the fish is ok - not great, not terrible.  Good variety of rolls.  Kind of expensive for what it is, but it's in the Embarcadero.  Cash only.\n\nThere aren't really very many good Japanese places in this area.  It satisfies my craving for sushi when I don't want to go far for lunch, but that's about it.  When I have time to go for a little walk, I'd rather go to Miyabi, which has good and cheap udon.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-05", "description": "Just okay. Fast and easy, a bit high priced. Will cure your hankering for Sushi on your lunch break though. I will be going back, but probably keeping it very simple in terms of what I order.\n\nCASH ONLY", "author": "Lee S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-20", "description": "Sushi  Kinta at the 5 Embarcadero didn't impress me at all.\n\nI got the lunch deluxe box:\n\nTeriyaki chicken\nTempura shrimp\nFew California rolls\nRice\n\n\n\nTeriyaki chicken tasted gross.I had 2 bites and that was it.Tempura was ok,not great.I ate the california rolls because I was starving.I think I bit my finger in the process.\n\nI was still hungry after this..and I guess the prices are ok,but there are other places in the area to help a sushi crave.\n\n1 star for food\n2 is for the smile from the person behind the register.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-26", "description": "I came here on the17th, after watching a movie at the Embarcadero Cinema. First my friend and I hesitated and looked around for more sushi places, to compare. Since the other one was closed we came to this one... which we shouldn't have.\n\nRight when I walked in the door I looked at the menu and everything was pricey. My first reaction was \"wow! they're lunch box special is so cheap! ( less than 7$) I ordered that and after I learned the person running it spoke a language other than Japanese so I became skeptical of how good the food would be. My miso soup was served in a cup, such as the foam cups you'd get coffee in and my terriyaki chicken, rice, California rolls, wasabi, and this pink stuff ((which i like alot)) was in a to-go box.\n\nWhen I opened it I didn't really think the 'chicken teriyaki' was really teriyaki, or chicken as a matter of fact. I tried it and it was too soft, and I could of sworn it tasted like ham! Although my friend said, \"wow! this chicken is so tender! its really good\" I however, am used to eating quality cooked chicken since my mom, I must say, is an excellent cook :3 Anyways, the rice was alright and there's nothing special to say about their Californian roll. Now what really bothered me was their miso soup. It was hot, yes, but disgusting. Mine didn't even come with tofu, and came with what looked to be a square cube of imitation sea weed. (?) I didn't want to be rude, but when the two woman who were there went into the kitchen side I quickly threw it away... :\\\\ It was just gross to me and my friend said \"its alright....\"\n\nThe only reason why I was surprised with the price is I went to another restaurant across from the Peace Plaza in SF that's called Iroha (its upstairs). I bought a similar lunch box for 12$ which consisted of Teriyaki on two sticks, rice, wasabi, and an assortment of sushi (such as eel, salmon, crab,etc) and WONDERFUL miso soup! It was delicious! So thats why I was surprised with Sushi Kinta's miso soup :[ However their customer service was good and the woman who served me was polite. I don't think I'll ever be coming back here and wouldn't recommend  to anyone either unless they feel like wasting their money.\n\nI guess here, for the cheap money you spend on a lunch box you should expect the same quality in return.", "author": "ZEEBRA W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-04", "description": "On my last day in SF I'd had a good hearty breakfast and wanted to take something light to work to eat that afternoon.  After walking around the Embarcadero Center revisiting my past, I saw this tiny sushi house, and while checking out, ordered a roll to go.  It was quite tasty...trying to remember which one I had...  Great service, too.", "author": "Sparkely K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-26", "description": "Should have stumbled upon this before I walked in. \n\nOverpriced. \n\nNot great. \n\nAND THEY MAKE YOU PAY FOR TEA! \n\nThe end.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-21", "description": "For a small shop like Kinta, I was surprised by the quality of the fish there. The selection of fish is what I would call normal. Usually only Asian people would ask for the facier fish anyway. It is cash only and they have an ATM machine inside.", "author": "Gary W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-29", "description": "I was sick. I wanted soup. Sushi Kinta delivered. My vegetable udon was nothing special, with a few pieces of broccoli, carrot, and cabbage and some soft tofu, but it made me feel better. Plus, at least on Saturdays, it's a nice quiet refuge from the bustle of the Ferry Building with lots of seats to spare.", "author": "Katie I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "i thought this place was actually pretty decent for financial district lunch options.  it seems like a lot of people gave really bad reviews based on the chicken teriyaki.  i didn't have the chicken, so my experience was better than the others.  i ordered the spicy spicy roll (shrimp tempura, crab, avocado, spicy tuna) and thought it was fresh and tasty.  it's not going to amaze you, but it will definitely satisfy your sushi cravings at the workplace.  i'd go back again.", "author": "Anna V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-28", "description": "I've eaten here three times and had the deluxe chicken teriyaki box each time.  I should've only eaten here once.  The chicken is very low quality and chewy.  Thank God it's covered in sauce.  Otherwise it would be completely inedible.  The miso is watered down.  The fake crab meat California rolls were pretty standard, but the tempura was very hard -- like it had been sitting out for a long time.  And the tempura dipping sauce was awful; it had kind of a chemical taste to it.  Gross.\n\nIn short, don't eat here.", "author": "A R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "Great food for the price and speed of service. Friendly people, under new management. Great snack stop-off.", "author": "Alldaron K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-12", "description": "Came here for another day for lunch. As a vegetarian, I opt for the Vegetable Don (Bento box). It was literally just steamed or boiled broccoli and carrots with some water-down teriyaki sauce. Giving Sushi Kinta 1 star is being very generous.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-05", "description": "For my purposes Sushi Kinta is just fine.  Today, like most days, I had no time for lunch.  I raced to SK and picked up the dragon roll and an eel something-or-other.  They were both very satisfying; pre-made and served to me with lightning speed.  Just what I wanted and needed and the team there is very hard working and nice.  As to the bad reviews I see here, if you are a sushi aficionado you need to go somewhere else.  SK is not, and does not pretend to be, gourmet.  It's good basic working man's sushi.  Be selective about what you order and recognize that much is premade - like a lot of the tiny lunch places in the financial district.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "Pretty darn good for a downtown lunchtime place. 3.5 stars, I gave them 4 because it looks like they could use the help. My coworker got us sushi and teriyaki to go, and it was actually really good! The miso came in little starbucks-style to-go cups, that I could sip at my leisure. The fish was fresh and tasty, I'm not sure why they don't have better reviews. The people there were also incredibly nice. Went above and beyond regular customer service to help us out. Highly recommended.", "author": "Hale B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "I am surprised with the few stars this place has had... I had the mango tango sushi special (kinda like rainbow row with mango, plus spicy tuna maki) and while the fish was not cut extremely thinly, it's quite fresh and tasty. The rice was properly cooked with just enough vinegar to have it all stick together.", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-07", "description": "Get the spicy special roll. It is very tasty and made quickly. If you work in the financial district it is a great place to have lunch. On a nice day, you can sit outside and enjoy your meal.", "author": "Charissa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-08", "description": "Tried this place on a whim, now regretting it.  Got a $9.50 bento that included a small portion of overmarinated rubbery chicken, a shrimp tempura, and four pieces of California roll.  The shrimp tempura was good, the rest was (sadly) unforgettably mediocre.  Wondering how these sorts of places stay in business.  I usually reserve 1-star reviews for when I get sick afterward or wish I had, but for this place, an exception.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "Fast and relatively cheap with friendly service.  The sushi itself really gets 2 stars, no more. But the people behind the counter were very friendly and lunch was very fast.  I would say this place does what it is supposed to do as a lunch counter.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-26", "description": "It's ok.  The lunch box is a deal with teriyaki chicken over rice, miso, and california roll.  I didn't like the chicken which was more fatty than tasty.  I'm willing to give this place another chance to try the sushi, but otherwise this is on my not-returning-to list.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-14", "description": "My first try was their chicken udon. Flavorless. There was iceberg lettuce in it. Iceberg. Second try was the deluxe box. Dry chicken, mealy tempura. California rolls were loosely rolled. I most likely will not try it a third time.", "author": "Anneli L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-16", "description": "This place has gotten even worse than the last time I tried it! And that was a few years ago. The tempura sweet potato was like a dessert - and not in a good way.  Too thick - both the veg and the coating.  The mostly burnt chicken was tasteless and the California Role not edible - was that mayonnaise in there?!!!  Threw most of the meal in the trash and will NEVER eat here again.  Save your money!", "author": "K. R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "Maybe I just don't know much about sushi, or have a special appreciation for quick lunches in my building, but I thought the nigiri was delicious. I got the hamachi and the sake.", "author": "Alethea S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-01", "description": "Decent but not great sushi in the fidi.  I like the \"4 seasons\" roll.  The roll with wakame salad on it is gross, but mostly because I don't think crunchy salad belongs on sushi.  One roll is enough for a light lunch, and will only set you back around $9. The staff is very friendly and polite.", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "A lot of people are hating this place, and I just want to say, I'm glad my craving for sushi far outweighs most reviews. Sushi Kinta is not a sushi place I would go on a date night, but for a nice lunch to curb my hankering for sushi on a weekday, it's perfect! First, I almost missed it (small place), when I walked in the staff was super friendly and asked what I wanted but of course, I'm one of those people who needs to peruse the menu before I decide, so I step back and say I need a minute and the sushi chef there asks what kind of fish I like (Yellowtail) and he recommends the spicy yellowtail roll and I add on small order of salmon sashimi (another thing I'm addicted to) and a miso soup for good measure. They ring me up (CASH ONLY!!) and I wait about 5 minutes for my food. The spicy yellowtail was delicious! A little spicier than I had expected but pleasantly so. The sashimi was fresh and he added a couple extra pieces. The miso soup was pretty good (it comes in a coffee cup, don't mistake it for tea). Overall first experience, better than I had expected! Especially after reading all these reviews. I've been there about 3 times since and they still remember me and always add a few extra pieces of sashimi or a roll to my order. The place is nice to go to when you want to treat yourself to a quiet yummy lunch (although I definitely would recommend it as a nice little lunch spot for you and another person). Overall, I think this place is great and recommend people giving it another chance if they are still craving sushi in the Financial District.", "author": "Sheila N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-02", "description": "Sushi Kinta is fast, has friendly service, good prices, and great food. The staff is amazing -- they like to get to know their customers.", "author": "Danielle N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-28", "description": "A couple of years ago it was taken over my new people and the quality of the food, which was only middling at best, got worse.  The quality of fish is inferior to the point where it smells like it's verging on going bad (not good for raw sushi).  I don't know which Asians now run the place buy they aren't Japanese and don't seem to really understand the whole philosophy about sushi and sashimi.  However, there isn't really any other \"take out\" or lunchtime sushi place around this area.  I'd only eat here if I got a sushi jones that was so strong I'd eat my own leg.  They do have bento lunch boxes (but WHY does every Asian eatery fall back on broccoli and carrots--when there are tons of Asians vegetables available in this town????) and I would get the salmon box a couple times a month, once in a while I'd spring for the unagi bowl--both are passable but I think microwaved.  I also have to give them credit for changing their sign once they found out that the \"white belly tuna\" wasn't tuna at all but escolar--they now state that which not many other places do.  I did find myself picking up sushi from Safeway a lot--all these sushi rolls are getting pretty weird.  The two main people dealing with the public are real nice and are working hard.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-04", "description": "The sushi isn't made fresh. Right when you order your food, within a minute, you will receive it. The Lion King is suppose to be hot, but the Lion King they gave me was from the refrigerator. The restaurant is really small. The only thing good about this restaurant is if you want fast, non- fresh sushi, this is the right place for you.", "author": "Men A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-13", "description": "bento box food was cold and yucky.  the tempura was limp already. i have a feeling they cooked it a couple of hours in advance.  eeeek!", "author": "J S."}
