{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "By far my favorite sushi place. Super fresh, great prices and the owners are amazing!! I eat here at least once a week. My go to's are obviously the sushi- excellent quality fish and great size rolls. The hot dishes are amazing as well. You can't go wrong. They make their own green tea, one time I even asked for some to go because it's so good. \n\nIt's family owned and operated, which means they really care about what they are doing. I just ordered take out right now and can't wait to receive it!", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Don't let the less than flashy interior or rude female owner/worker deter you from this hidden gem in West Portal. Having lived in the area for over 10 years I had walked by this restaurant countless times and always opted to go to Fuji across the street for my Japanese fix. On a whim one day I decided to order some food for the family from here and was pleasantly surprised at the quality of the dishes we ordered. Been back several times since and still has not disappointed.", "author": "Sandy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Excellent salmon hand roll!\n\nExcellent shirashi (sp?) these aren't on the menu so just ask. The staff and owners are very friendly!", "author": "Cay A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "Inexpensive but everything was just ok, pretty lackluster. One roll I ordered was supposed to have smoked salmon and it had regular raw salmon which I'm not a fan of. I wouldn't order again.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "Rude waitress!!!! My family went there to eat at 2pm. This waitress seem like she was paying bills and didn't want to serve us. When you ask to things she didn't even stand around to listen. She will just walk away. We had to ask for her attention 3 times. It wasn't just me my whole table felt her rudeness. She never thank us when we left or ever say goodbye.We will NEVER go back again. This is not a true Japanese restaurant.", "author": "Irene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Late post: last Friday: This place isn't too bad. I enjoyed everything.  The review on yelp isn't very good and majority was about the bad Chinese lady with short hair. Must be my lucky day. She was really nice and helpful from the beginning to end. Maybe I caught her in a good mood. For now I'll rate 4 especially because she catered to the kids very well without me asking.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Updated on July 2018:\n\nStill my favorite affordable sushi joint in SF! \n\n\nAffordable sushi, decent quality for its price, no bs and non-pretentious. However, my only complaint is this place is a little bit understaffed, so expect a little wait here.\n\nStill one of the best neighborhood sushi joints in the city after two years! Highly recommended!", "author": "Siian X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "The quality is sub-par and no flavor to the rice but less than $5 rolls across the board and decent unagi keeps this place at 3 stars. Cute mom a pop shop in West Portal with a curious layout but good attentive service and the owner is a gem of a woman.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Food is amazing. I love eating here. This is basically my best sushi restaurant!!! The service is great! Everyone is so nice.", "author": "Vency C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "The server was very rude. She tried her hardest not to give us a good experience. Mumbling under her breath. Rolled her eyes. She was a n older server short hair.", "author": "Abdul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Bing & Mandy are so down to earth owners . I been going here for 5 years & never been disappointed. We believe it's the best Japanese restaurant in West Portal , if not the city. We have 2 year old & brings havoc when dining & it does not fade them a bit. They are always warm & pleasant.", "author": "Dave A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "Got together with my gal pals and the place is a mom and pop type of restaurant with reasonable prices and A-ok entrees!  it's farther away from the rustle and bustle of the West Portal Station so there was parking available on the street.  We ordered two combo dinners, one with shrimp tempura and chicken teriyaki, the other with white tuna sashimi and beef teriyaki, spinach salad, unagi maki, Dynamite maki, hamachi maki, chicken udon and tonkatsu.  The sashimi and sushi was fresh and the beef and chicken teriyaki was juicy and tender.  Not bad for everything under $15!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "I come here all the time! The sushi is so good and it's at a really good price. The staff is very nice and this place never disappoints me!", "author": "Mya S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-30", "description": "Extremely rude service with the older Chinese women with a short bob. Left right away after she yelled at me saying \"I'm busy\"", "author": "Jenice L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "They earn one star for terrible service! \n\nWhen I called to order soup and seaweed salad the lady on the phone was very rude. She openly expressed her irritation with my small order. When I arrived to pick up my meal, I noticed the portions were smaller than I anticipated and asked for another order, she rolled her eyes, exhaled sharply and said, \"I don't feel like getting you another order\", then she walked away.\n\nOn the other hand, The miso soup was delicious.", "author": "Sheila R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "I've never dined-in here but have ordered for pick-up and delivery many times. Delivery time is pretty much what you'd expect from any sushi restaurant delivery. The food is always packaged nicely and they provide plenty of wasabi and ginger, which is nice because a lot of places tend to skimp on the little extras. The fish is high quality - especially important when ordering sashimi. The 2 piece \"sunrise sushi\" (salmon, tobiko, and quail egg) is a big favorite in our house, especially with the kids.", "author": "Carolyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "This place is sooo good and has very affordable sushi for SF! The staff is always welcoming and very kind. This is by far my favorite sushi place in the city. Quality is always great and so is service! \n\nTheir avocados in the avocado salad are perfect every time and it blows my mind.", "author": "Denny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "This place has stayed my favorite hole in the wall since I started going in 2006. I'm pretty sure the staff is almost the exact same too! That, I love! Anyways the sushi is so good! I literally pig out on the avocado asparagus roll.", "author": "Ruby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "This is our new go-to sushi spot. The fish is melt in your mouth good, staff is attentive and friendly, and the prices are much more reasonable than Fuji sushi. Sushi suki is a diamond in the rough!!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "We had very bad experiences in this restaurant on Friday night. We ordered teriyaki chicken for my daughter, and some sashimi, sushi, other dishes. We has waited for a long time, did mentioned to the waiter and the lady boss that we hadn't received the teriyaki chicken. She gave the order to friend of her next table instead. She said something like this:\" do you want to cancel the order if you don't want to wait\". Sounds like she really doesn't care our business, wanted us leave, then she can give the table to somebody else. She is very rude, didn't even care if my daughter waited all night couldn't have anything to eat. In fact my daughter doesn't eat sashimi and most sushi, teriyaki chicken was the only dish she could eat. We are definitely not going back this restaurant no more.", "author": "Diana W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Good quality fish, hot green tea when I sit down at the bar, what's not to like?  \n\nI haven't really done their cooked food, just sashimi and nigiri.  My lunch breaks aren't long, so I like that I can sit down fast, get my sushi and have time to enjoy it .  \n\nFor that one reviewer that was complaining that the people running the restaurant weren't Japanese so it was not authentic stfu.  If the fish is fresh and cut right who cares what race holds the knife?  They're not subtle about not being Japanese, they're not trying to trick you.  I mean it's not Japanese news or music coming from the TVs...", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Thursday night, 7 pm and we are both hungry. We haven't been to Sushi-Suki for several years but ended up there because our favorite up the street had too long a waiting list. Sort of a weird location, up a flight of outside stairs, narrow felling, and a meh interior. It was busy and noisy but the service was prompt and friendly. \nThe portions were good sized, very reasonably priced, and, most of all, tasty. It seems like it's family run and they compete and compensate for their location by trying harder. It's a good business model and works for them. The bill was $29 vs $40 at the corner. Not fancy but a good choice. We'll be back.", "author": "Art R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "Pretty simple menu but I mostly come for the sashimi anyway! Always fresh... soooo good. Hamachi Kama also a star here.  Lunch and Dinner plates are very reasonably priced. Love it.", "author": "Di G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-01", "description": "I would give this place 2.5 stars, I had two of their signature rolls of sushi and they were Okay. I've definitely had better sushi and was looking for a good sushi spot when i went here and it was not impressive. Rolls were huge which made them hard to eat.\n\nService was very rude, even shouting at one point when I asked for clarification on a menu item. \n\nMaybe teriyaki is better but i never tried it?", "author": "Nazneen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "I've been coming here for almost 10 years now. Bing and Mandy have a simple, unpretentious restaurant which is what I love about them. They have regulars who come weekly, their menu is small but solid and fresh and the decor is basic but functional. It's not for everyone which is just fine by me. Oh yeah, and Bing is a clean freak. Now they don't have mood lighting and you don't hear untz untz untz untz but then again, you ARE in West Portal!", "author": "April F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Food was really good!! Salad had a delightful mustard seed dressing, sushi was fresh and yummy. Definitely will come back as well as recommend to friends !!\nSuper yummy!!!!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Yes, I gave a great review last time, so why give another?  Because Bing's added some off-menu items!  Last night, we had skewers of duck gizzards and chicken hearts!  Bing also brought out a bottle of Kubota Ginjo Genshu to go with it.  Is Sushi Suki becoming an Izakaya? I don't think so, but these are good first steps! \n\nSo, being off-menu, the skewers are not always available.  You'll have to ask.  Other off-menu items are nankotsu kara-age (fried chicken cartilege) and grilled salmon kama (heads and collars).  Again, these are not always available.  And when they are, prices are variable, so ask before you order.\n\nMore interestingly, Bing's got some really high-quality sake available now too!  Besides that Kubota Ginjo Genshu I just mentioned, he's also got Kubota Manju (often described as \"divine\") and Kubota Senju (a rich honjozo) at reasonable prices.  This is rare!!!  Typically, only really expensive sushi joints would carry such sake.  And it usually sells for exorbitant prices!  But if you order a decent amount of food, I think Bing'll charge you a reasonable price for the bottle.  Just remember to ask for availability and price.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Nice place to grab dinner and some sake\n\nUni was fresh\nDragon roll was just right\nGyoza \nSeared steak\nDeep fried smelt\nAmaebe\n\nDefinitely my go to in the area", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "This place is quaint, busy and has decent sushi for sure, but in the West Portal sushi wars it's coming in a ways under Fuji across the street. The prices are a cut under what you'd expect from a sushi bar out here, but the quality suffers a bit. I really only came in here because Fuji is closed this month for renovations, but didn't have a bad experience. If you're looking for decent sushi at a good price, look no further.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-06", "description": "AWFUL!!!!!!  And what's with all the positive reviews??????\nMushy udon, dry mystery fish chunks you could choke on, and 2 skinny rubbery prawns in the Seafood Udon.  Also, barely any broth and what little there was of it was flavorless.  Anyway most of it went down the garbage disposal.\nA scrawny Hamachi Kama, overcooked to dryness, could have been any fish it was so lacking in that distinct taste and texture.\nTamago that was slimy, off-smelling and even crumbling apart on top of the nigiri.  Don't want to think how old it must have been.  How they could serve such garbage is w/o compare.  Was too afraid to eat it and threw it out too..\nOnly truly edible items were two side salads which would be pretty hard to screw up.  Service was also very curt and had to ask for soy sauce when I saw they'd included none. Never ordering from here again.", "author": "Rose B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Stopped here by mere coincidence...nice little hole in the wall. Sashimi and sushi were very good and fresh. I also liked the plates they used to serve the food. They are like art palettes with a small side dish for the soy sauce. Looks like they have solid frequent customers. I only gave it 4/5 stars because the space needs to be organized better. It's very narrow and you have to pass a couple of storage spots to get to the restroom. The stuff looks disorganized and not very neat which a lot of people might not like of a place that has to have high sanitary conditions. The food and drinks (especially their tea) were super good. If in the area again, I would come back.", "author": "Alix H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "This is our family go to sushi place. They also make pretty good grilled halibut and lamb chops very juicy. My kids love their California rolls. Very lay back place!", "author": "Sabina A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-09", "description": "A table of 2 in a practically empty restaurant, I expected better customer service. We had to constantly ask for things: water, utensils, napkins, soy sauce, refill of water and tea... I felt as if we were \"needy,\" but if he has just prepared the table and checked up on us, we wouldn't have had a problem. He did not apologize for his service, but he did laugh when we asked for sushi that was not on the menu. Idk why exactly, but it was uncalled for and a little disrespectful. The sushi was just ok. I wouldn't go back. Just go to the other Japanese restaurant at the corner across the street.", "author": "Bermel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "An all -right affordable spot to get lunch. Not the best quality of the fish and not the biggest menu, but edible and not crowded during lunch time.", "author": "Alena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "Got delivery for the first time, so I ordered really lame rolls because I didn't want to take a risk... it was also a really hot day and it's hard to trust raw fish + delivery. \n\nShitake Mushroom Roll: Tasted different that I'm used to, wouldn't order again. \n\nTempura Shrimp Roll - Was ok. Rice was kind of mushy and tempura was a bit soggy. Avocado was fresh. \n\nCucumber Roll - my husband just wanted something fresh on a hot day and this boring roll delivered.  \n\nEbi Nigiri - Fresh, huge portion, but I wouldn't order it again... didn't taste like other ebi nigiris I've had. Form your own opinion on this one. \n\nCalifornia Roll - I generally hate this roll and never order it but I put some sriracha on it and it was edible. \n\nRock n Roll - usually really like this at other restaurants, nothing was particularly bad about it... just weirdly plain. More avocado than eel... ratio was off and severely lacking in sauce. \n\nOverall, there was nothing wrong with the order, they were quick with the delivery but it was really boring... could be because of the rolls I ordered. I might try eating in and being more adventurous but I don't know that I'd get delivery again.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "Heavy raw fish jones tonite. Wth? Haven't I had enough all these years? Dammit!  Hmmm! That's just the way it goes. Don't fight it or try and find rhyme or reason. Just cave, can't kill it. It keeps comin back. Everyplace too far, too expensive, or too busy. Sushi Suki I guess. Roll the dice, order from Yelp. What? Here in 30 min? That can't be the bell! Two rolls, all raw, yes!!  Twenty bucks, Jones subsides, hides back in the netherworld nexus of appetite and psyche, until a few days later fo sho. It was good. Fish fresh, delivery quick. It ain't Ginza, but growing up in Japan, middle school, high school with my broke ass friends, we didn't have no money to eat in those places anyway. So  Kaiten sushi is the comparison. Suki holds its own. (PS Stick with anything raw if you want to eat \"sushi\". I can't vouch for the saucy fried stuff. I didn't try any this time. But the hamachi was fresh. Wish I had another one.....)", "author": "George F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Decided to come to this place since I didn't want to drive too far to have Japanese food. However,  it's not owned by Japanese. The place was a little too small, more like narrow. Had the Chicken Teriyaki which was so so and didn't like that it came with the skin. Also ordered the Rainbow Roll which only came with 3 type of fish. Conclusion, probably would not come back.", "author": "Junray S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "I have been here several times. While the food is consistently AWESOME it's the service that really blows it for this place. 2 times I came here and they were not open (during operating hours) and the most annoying part is when you are having dinner but the business owners are entertaining their personal guests. I'm not trying to say that business owners shouldn't have their friends visiting their restaurant, but do they realllllly have to occupy the entire back of the restaurant and their kids taking up the ENTIRE sushi bar with toys and etc? Come on now Suki Sushi, you know better than that...\n\nAnyhow, besides service, price to quality and portions is awesome.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Great hidden gem, seating is easy, cute spot and food is great.", "author": "Marc W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-27", "description": "While they offer just mediocre sushi for the price, the Chicken Teriyaki is quite delish (no kidding).  Would probably go back there for just the Chicken.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "5 stars when it comes to Delivery/Takeout:  ordered salmon/hamachi/tuna sushi, sashimi, veggie tempura, chicken/beef teriyaki and it's always been fresh.  Delivery has always been fast and accurate!  Prices are great- way lower than the Japanese restaurant down the street, where we'd put up with high prices, comparable food & poor owner attitudes, before we knew about Sushi Suki.  The sushi chef here has always been super nice and we like our combination meals and sashimi/rolls.  Is it the highest end of sushi? No but you're not paying highest end prices. We've eaten at the highest end in San Francisco, Honolulu and Japan and love it, but for your daily run, we're not paying hundreds.  This place is great for your daily run.", "author": "Jane Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-13", "description": "Omg! How could a sushi restaurant this bad survive in SF? Service was very medicine to poor. The sushi was dry - even the staple spicy tuna roll was dull. The sea weed salad was soaked in green slime. The chicken udon is a tough dish to screw up - the broth tastes like really bad chicken soup and the udon noodle was certainly not fresh. Please do not go here.... Complete waste of money!", "author": "Anwar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Fresh fish at reasonable prices.  Menu is limited as this is a very small restaurant.  Family style service (husband the sushi chef, wife the hostess/waitress, mother the cook).  They can come across as rude and loud sometimes, but extremely friendly and generous people once you get to know them.", "author": "El C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "The restaurant isn't the nicest and was a bit cold but the waitress was nice and the sushi was good.", "author": "Marie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "I enjoy this place and have a sushi boat. It has been a long time ago and I didn't pay for it but I enjoy this place. My brother paid for it.", "author": "Michael Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Ok, our family has been going here for a couple of years. This place has super fresh, inexpensive sushi in a friendly environment. It is one of our three favorite restaurants.  Yes, we have been to all the other 'fancy pants' restaurants.\n\nNow, you folks giving a one star review need to step back.  This place is like a 'sushi diner'.  Its a diner with fresh, great food at one of best prices in SF.  All of you not understanding your environment, social dynamics, and whatnot are beyond help -- good luck with that.\n\nYes there are kids here sometime (like mine sometimes are), they may even have spitwads a la Evening Post cover, so you should take your annoying poser SF too cool for school self elsewhere.  We don't want you.", "author": "Devin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "The sushi are always fresh and I love the atmosphere here! The owners Bing & Mandy are hilarious! Plus I always reserve a dozen of fresh oysters all for myself! Plus their udon is really chewy and I really like their dragon roll!", "author": "Tina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-11", "description": "Deco and service average .... Food was not good I got sushi and chicken was sort of disappointed will not be going back not flavorful at all", "author": "jess c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "Fish is usually really fresh. Good place to grab a snack. Has good sashimi and sushi. Also has some cooked alternatives such as terayaki.", "author": "Jackie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Great service great food and the quick service makes it worth going nice neighborhood restaurant always satisfied", "author": "DUN UP B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "This place is awesome.  \n\nGo here and you will feel like you are sitting in someone's happy kitchen or living room.  The TV is usually playing a sports game at low or no volume and neighborhood folk are sitting around gossiping and happily eating or having a saki or sapporo.  \n\nWe swore off Fuji Sushi, which is right up the street after one time too many of going in and being ignored by the hostess, despite the place having plenty of tables.  Not at Suki, they serve you good fresh sushi and with friendly service.", "author": "R P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-11", "description": "Tried this since the price was right.  However you get what you pay for.  Sushi was pretty bland.  A few didn't taste quite right, and the next day my stomach let me know it.  Defintiely got me a little sick, and generally my stomach is a rock, invincible.  So this place had to do something really wrong.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "I came here yesterday (Thursday) with the BF, mum and dad around 6:30, and it was pretty much dead. \n\nWe ordered:\nHamachi sashmi (2 orders, 15 pieces each)- soft and fresh. perfect delicacy\nSaba nigiri (2 orders)- would not reorder. taste is off\nRaw oysters (12 pieces)- are these golden nuggets?? taste fresh! \n49er roll- ehhh, had better\nHamachi maki roll- bland\nAmaebi (2 orders)- it was okay\nBeef udon- nothing special\nSeafood udon- beef one is better\nShort ribs- it was okay\n3 sake\n\nTotal: ~$150.30 + tips\n\nI would recommend their hamachi! Totally worth it! Other than that, the price for everything is pretty expensive given the portion size and quality. Not my favorite place but I would definitely try happy hours if I am in the neighborhood.", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "Bing is awesome! I order Sushi Platters from him the other day and he was very helpful. He will customize any platter by your desire. He also came in early just to make my order. Sweet man!\n\nThere were a lot of compliments from my office party. Everyone was happy. Chicken Katsu Platter was good too. Definitely will order party trays from here again. Very Affordable!  Check out my photos of the sushi platters. (Will be uploaded shortly)\n\nOh yeah, I love there Shirmp Tempura dinner combo here.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-28", "description": "I come here only in times of desperate raw fish cravings. The sashimi and nigiri is unbeatable-- always fresh and always generous portions. I never order anything else.\n\nIt's almost always empty when I come in on Tues/Thurs nights so I grab a seat by the window and do a bit of reading while waiting for my order. It's a bit run down but not in the gross way, more cozy and homey. I think a married couple run this place and, although very little dialogue is exchanged, they are pleasant and my hot green tea always magically gets refilled as soon as it's low. Also, my request for extra ginger and low-sodium soy sauce is always generously accommodated!\n\nIf you're living around Lake Merced, this is the closest quality sashimi besides that new place next to Stonestown.", "author": "Ariana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Delicious, if u haven't eaten here before what have u been doing with your life?! The salmon sashimi here is like a slice of God's buttcheek and the katsu here were fried in the batter of love. Come here and love this place.", "author": "Jared L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "This place is awesome! Great sushi rolls for a great price. We ordered 4 rolls plus a veggie tempura appetizer for only $50! Service is a tad slow but when notified, they're responsive. Will be coming back!", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "The service could be friendlier, but maybe we're just dealing with a difference of standards. The sushi was great and the tea, miso and other things we ordered were delicious. And yes... I've plans of of coming back.", "author": "Amelia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "We switched to Sushi Suki while Fuji Restaurant is closed and were not disappointed. For local sushi take out they are great option. Fish is very fresh. Priced reasonably, good service. Just call to order and pick up.", "author": "Natalya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Amazingly fresh fish. The rolls aren't fancy, but they really hit the spot. Gyoza was super delicious. Teriyaki is on the next trip.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "Good Japanese restaurant in West Portal. Easy to park. Menu had many choices.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "This place has great sushi. It's undeniable. The fish is as fresh as it gets, and I feel lucky. The prices are fair (or cheap!) and it's delish. The service is a bit lacking. I have been here maybe 15 times and every time it's like my first time, but whatever, the fish is so fresh and that's what sushi should be about!", "author": "Trish H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "I really don't understand why the guy below gave this place one star and wrote that super-negative review. Sushi is excellent (always judge by sashimi), the service is very good. And the noise - well, people are just having fun. And you can always move to the back from the action near the bar. \n\nOverall, this is the best sushi place in the West Portal/Taraval area. Recommended.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-03", "description": "Stopped in for some take out on New Years day. I was met by a friendly hostess who brought me a mug of hot tea while I looked through the menu, which was a very nice touch on a cold night.\n\nI ordered Sukiyaki and Unagi nigiri. The Sukiyaki was flavorful and had a nice selection of meat, tofu, vegetables, and noodles. Not the best I've ever had, but it was a solid effort. The Unagi was fine for a small bite, which was really all I was interested in at the time.\n\nOverall, an experience that I wouldn't mine repeating. I'd go back to try other food there.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-21", "description": "When a couple of buddies and I were looking for an out of the way sort of spot with easy parking to grab a late dinner, Sushi Suki came to mind.  On the far end of West Portal, I used to pass this place all the time on the way home from work and I wondered if it was any good.  So, this seemed like as good of a time as any to come out this way to try it out.  \n\nI have to admit that when we walked in and found ourselves to be the only customers, alarm bells started going off in my head.  I didn't expect the place to be packed (hence our reason for being there), but I didn't think it would be empty either.  Fortunately though, a couple of parties filed in soon after we did, so that was a bit comforting.  One definite bonus was that the service was pretty attentive, and the waitress (owner?) was pretty friendly with us.\n\nFor whatever reason, the menu felt pretty simple and basic even though there's a decent variety of things to order.  I guess how they split the list of rolls onto a separate sheet just threw me off.  The menu is made up of the usual suspects, but it's tilted towards sashimi and rolls (they offer a sushi/sashimi dinner combo that you can go in on with multiple people).  Prices are pretty fair, as I dont think a single item we had cracked $10 (one of my friends got the cold soba and Spicy Tuna roll, the other got a dinner combo box).\n\nOne of my friends got an order of gyoza for us to share (average), while I ended up ordering the Chicken Katsu dinner entree (comes with rice, miso soup, and salad/japanese coleslaw) and the Crazy Maki roll (tuna and salmon inside with hamachi on top).  The Chicken Katsu was pretty good...the meat was still juicy and the breading wasn't too heavy or thick.  I thought the order was a little small compared to other places when you get it as an entree, but it was still filling enough.  Plus, let's be honest, it's probably not the best thing health-wise to have that much fried stuff anyways...haha.  \n\nAs for the sushi, I thought that the Spicy Tuna was rather generic and bland...did not feel any spiciness at all.  I know in general, most Spicy Tuna rolls really aren't all that spicy anyways, but this one really did not give off a trace of heat for me.  Either that, or maybe my taste buds have finally gone numb from years of eating spicy food (man I hope not...).  The Crazy Maki is definitely a winner though - good sized cuts of fresh fish, and not a lot of rice to fill you up either.  I would definitely get this one again, and it was only $9.95, which is pretty good considering other places might try to get away with charging more.\n\nWould come back on those lazy sort of days when I'm bumming it and want some Japanese food (hello Crazy Maki!), and it definitely helps that there's a wealth of parking around here.  Not sure if I would ever come to crave it, but it beats having to look for parking at places like Kitaro...", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-05", "description": "One of those restaurants you come in and out. Service was cool, food was aite. The rolls were kinda mushy though. Wouldn't come back again.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "Place has improved. Lunch specials are generous and fresh. Udon is good. Chicken teriyaki is ok. A LOT cheaper than Fuji.", "author": "M T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-18", "description": "I came to this place with a friend who tried this place a while back. The place was pretty empty when we went in. Granted it was the start of dinner time. We ordered some rolls. \n-sushi maki suki (I think) it was deep fried\n-hamachi roll\n-rainbow roll\n\nRed tuna sashimi and a gyoza. The sashimi was a fat piece. Very worth the price also fresh. The only one I was kind of disappointed was the rainbow roll. They used fake crab meat in the roll. Otherwise the rolls were pretty good for sashimi .", "author": "Sadie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Really enjoy this place. They are fast, friendly, and reasonably priced. Love that I can have the food delivered pretty quickly too.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-17", "description": "Seriously, DO NOT eat here. You will be grossed out... How can a sushi place mess up California rolls? I don't know. But this place did. The imitation crab was awful and unflattering. They use a cheap quality of rice and seaweed. I know it sounds ridiculous but it's true! \n\nThe waitress was also rude. \n\nGo to mcdonalds.", "author": "Karina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "I don't usually come here for my Japanese food or Sushi craving fix. To be honest, I haven't even tried their sushi rolls or other foods. I only come here for one thing and that one thing is SASHIMI!~\n\nDon't completely rely on my review for this restaurant as a whole, but if you want to know about the sashimi, well let me tell you how good it is. The sashimi here is FRESH! It is delicious, and I don't even care about spending well over $70 dollars here because the fish or seafood is so fresh and so good.  They always have a good variety of fish when I come, from halibut, tuna, butterfish to salmon (sometimes even  king salmon), scallop, hamachi and even uni! I absolutely love the uni here! They always have it right, it's never bitter (sometimes chefs rupture the gallbladder when removing uni and taint the flavor of the uni with bile) and it is always creamy. The fish here is perfect and the texture is exactly what the fish is suppose to be like fresh from the sea!\n\nI do thoroughly enjoy my sashimi visits here. I've only ever come here for sashimi and always only for lunch, so I cannot review about dinner and service then. But during lunch, even though there is a slow flow but steady , there is only one or sometimes two people working. So don't expect the service to be super quick. The server is always friendly though, so I'll be nice about the wait. \n\nThere isn't a lot of parking around this restaurant, mainly because it's by West Portal, but MUNI makes it convenient to get here. (:", "author": "Raven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "The chicken Katsu is delicious juicy and perfect and the teriyaki children is always yummy!! We've (roommates and i) had the food delivered several times And it usually comes promptly and fast :)", "author": "Fairlight S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-29", "description": "The sushi is fine, nothing amazing. But they are a tad rude, if you are not family be ready to wait FOREVER for your food and for you cheek. AND to be ignored. There are many other places with better customer service in walking distance but if ur in a pinch it's fine", "author": "Karen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "I just happened to stumble upon this amazing sushi restaurant in west portal on my way home from work. I eat here at least once a week. I can't get enough of it. Their rolls are amazing. The service here is also very kind and welcome! You should definitely come by!", "author": "Cierra S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-13", "description": "Their menu is very, very limited at lunch.  The katsu is poor as the meat is very hard and dry, and the breading falls off.  Very disappointing. But I've only tried it once so perhaps I was unlucky. Have also tried the beef and chicken teriyaki as well as the tempura.  The beef is the better choice as the chicken (have ordered this a few times) is strange; it seems to have been fried skin side down not grilled then doused in some sort of oyster sauce (the sauce does not taste like teriyaki sauce).  The tempura is okay just overly greasy.  But the salads that accompany all meals are fantastic.  Not the typical iceberg lettuce with a few bits of carrot and a tiny piece of tomato with salad dressing.  It's baby greens mixed with a lovely, light salad dressing.\n\nHowever, service is lacking.  Once they give initial water and/or tea very rarely do they offer a tea refill-unless perhaps during the odd day when there are more than two customers to make it worth their time.  Also it's irritating that each time I need to request the bill waiting to catch the owner's attention as the owners are either eating or are entertaining their personal friends with meals and drinks which happens quite frequently.  Very unprofessional to see the owners who are the waitstaff enjoying glasses of wine and having a great time while we the customers patiently wait to be attended to.  Also we were regular diners yet the owners never acknowledged this.  They always treated us like complete strangers each time plus one would think at least they'd be more attentive.  But they never gave refills unless they felt like it or if we truly requested them.  I do not believe the owners really care for repeat business. So sad about Kamakura two years hence still as the owner did appreciate our regular business and would show it by giving us a complimentary seaweed salad.", "author": "Luisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "I like this place because it is very casual and fast! The food is great and the service is very friendly and funny. I went in here alone once (of the many times I go) and no one else was in there, which I liked. I could relax and the server/owner was not always bothering me every five minutes. \n\nMy favorite roll there is the caterpillar roll. YUM.\nIf you order the bento box it comes with a ton of different things, which is great to eat throughout the day if you are at work. Order it with the chicken teriyaki.", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "This is one of the places where I believe is underrated. I came in here on a whim the other day since I was in the neighborhood and had no clue where else to eat. The service was very attentive and quick.\n\nImmediately after we were seated the server brought us hot tea (that was nice because it was raining outside) and the menus. It is very small and kind of \"hole-in-wall-y\" but it was nice. \n\nI ordered the sashimi combo which was only $15 which is much cheaper than most places so I was a little skeptical at first. The food literally came out in 5 minutes, if not less. The pieces of sashimi were the right thickness and absolutely fresh. \n\nI will definitely come here again!!", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "Food is still good here.  Quality isn't a problem.  Quantity can be, depending on what you order.   So prices fluctuate in accordance with the previous statement.\n\nService = okay and like I said before, absent-minded.\n\nI'm updating because I've ordered delivery here, and they've forgotten a few things here and there.  I've also ordered take-out and it takes them a while to do it but it's executed well.  So all in all, order in person to ensure proper execution.  Otherwise, you'll be like me on a cold, rainy night...missing her miso soup and favorite roll.  lol", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "I've stopped for pick-up a couple of times and never been disappointed.  Finally my wife and I went for lunch on Saturday.  Sushi was fresh and tasty.  \n\nThe place was really empty, but it always is, I guess because it is a little hard to find being on the second floor with no street appeal.\n\nI see some old reviews really panned it.  That is too bad.  Both my wife and I thought the food was better than your average sushi place, and we recommend you give it a try.", "author": "Fred C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "This is my favorite sushi spot in SF so far. It's moderately priced and fresh. Its never too crowded, and the owners - Bing and Mandy - are very friendly and accommodating. \n\nMy boyfriend always gets the seafood udon noodle soup: delicious broth with broccoli, shrimp, salmon, butterfish and tuna. I can't remember the name of the roll that I usually get - salmon, yellowtail, avocado and roe, deep-fried - but its SO GOOD!  A full cup of tasty, hot tea is served to every guest, and they are very punctual with their refills. \n\nIf you like a low-key, friendly atmosphere, then this is the place for you. The owners will sometimes sit with the regulars, chatting and maybe sharing a hit of sake, or watching sports or Chinese and Korean soap opera on the television over the sushi bar. Occasionally, the service is a little slow, so don't show up if you need to be out in a hurry. It has the feel of a local bar, where everyone is relaxed and not trying to impress anyone.", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-24", "description": "What a nice little surprise. I've passed this place so many times, but never really thought to try it out until my sister and I needed a new, cheap sushi spot.\n\nThe place was empty when we walked in, except for one other customer (usually a bad sign to me)...but then again, it was 4 in the afternoon, so only those seeking an early dinner or late lunch would be inside (my sister and I were amongst the latter). The prices looked fairly cheap, so I really wasn't expecting much going in.\n\nThe portions are pretty big...perfect, since we were starving before we got in there. My sister and I split 4 different rolls, and we were full even before we finished them. We couldn't even finish the sashimi dinners we'd also ordered (over-ordering, it's a habit we learned from all those other sushi places with the smallish portions). The 12 big pieces of fresh fish you get for 12.95 is definitely enough to satisfy a sashimi craving.\n\nThere isn't a lot of variety on the menu, as some people have said, but the good fish makes up for its short list of gimmicky rolls. My favorite roll is the Crazy Maki, a tuna and salmon roll topped with hamachi -- my three favorite fishes to have in my sushi.\n\nI did have some issues with the sushi rice (it was a tad on the mushy/soggy side), but I didn't care about it after awhile. I think I just found a new cheap sushi spot.", "author": "Lorraine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "One of my close friends brought me here a few years ago and it's definitely a \"hole in the wall\" sushi bar, but those are usually the best places. My boyfriend and I are now regulars as this is the first on our list for sushi. The owners, Bing and his wife, are very welcoming and friendly. They often have their big screen TV tuned in to whatever big game is premiered. Bing can talk a good game of basketball and football.\n\nThe prices are reasonable compared to most sushi bars. Since I am a vegetarian, I was pleasantly surprised by the large selection of vegetarian options. Miso soup is usually standard fare. The Kompyo and Asparagus & Avocado sushi are awesome. The spinach salad is also quite tasty with its sesame seed dressing. My boyfriend always enjoys his shrimp tempura and California rolls along with a large bottle of Sapporo. On occasion, we'll request some hot sake which is surprisingly smooth.\n\nThe site itself is small and very clean. The atmosphere is definitely one where you feel at home among other patrons who are also long time regulars.", "author": "Noemi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "I read every review before trying Sushi Suki myself.  I was prepared for the napkins stuck on the wall-gross-out but none where to be found!   \n\nI'd say they've read the reviews, really heard the complaints, and changed.\n\nI had one roll.  It took the guy quite a while to make it and when I got it was perfection.  He and I even talked about how he often rejects fish from suppliers because its not fresh.  I'm impressed with that level of fussy, being a fuss budget myself . . .  \n\nThe roll had a lot of fish in it and was quite large.  It was almost hard to get each piece into my mouth.  Ha, ME complaining about something to big for my mouth (come on, your supposed to laugh)\n\nThe service I got from the very young sushi guy was great.  Older lady came in (his mother?) and she was very icy, but whatever, most people are seriously lacking in personality these days.\n\nWill be back, will also try delivery.", "author": "Cinnamon Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-19", "description": "I rarely do reviews but needed to this time.  The waitress was rude, obnoxious and started picking her teeth with a toothpick next to my table then proceeded to do her eye makeup instead of offering us service.  There was one sushi chef/cook and one waitress- the food took almost a half hour for a Philadelphia roll (named differently here) and a red tuba roll.  The tofu appetizer came out after the sushi rolls after the child I wa with was basically climbing the walls he was so hungry.\n\n\nI hate to give bad reviews- it's a service industry and someones livelihood- but this is the worst establishment I have been to for anything nevermind just sushi", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "Not too bad, especially for its price.\n\nMy boyfriend Alex and I wanted dinner after watching Black Swan in West Portal.  He left his phone at home so we were without 3G and had to search for food the old-fashioned way... window browsing and menu examination.  Fuji looked good but too much money for us at that time.  So we kept wandering and came across Sushi Suki.  Menu looked affordable so we walked in.  There were 3 other parties there besides us.  Waitress told us to sit at any table.  We sat down near the door and then she said we should somewhere else to be warmer.  Courteous of her to mention that, she was also wearing a parka, something I haven't seen in a restaurant before, let alone in San Francisco...\n\nI ordered tempura donburi and Alex ordered katsu donburi.  I found it weird on the menu that a Philadelphia roll didn't exist but it was called a \"New Wave roll\" instead, that was my first time seeing that change.  We got free tea (delicious) and miso soup (mediocre) with our meals, always gets me in a good mood.  The waitress was prompt and nice, on top of the tea refills, although we had to ask for water, it wasn't automatically given.\n\nOur donburi dishes were plenty of food for about 7-8 bucks each.  Mine was tempura, sauce, and rice, cannot get any simpler than that, and it tasted fresh to me.  He was shocked to have eggs in his dish (doesn't like eggs) but he didn't mind them at all, that was very shocking.\n\nBathroom was clean and with ample seat covers, much appreciated.\n\nNot sure if I would eat sushi from here but the food is cheap, fresh and tasty.  I'd come back and maybe get noodles next time.", "author": "Lori D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-03", "description": "I normally don't ever write reviews about restaurants, and I normally only read them with a grain of salt, however, this place was so awful that I deemed it necessary to write something.\n\nFirst off, my girlfriend and I entered the restaurant and were greeted, sat, given menus and their paper check list which wasn't explained to us at all.  The waitress just tossed a pen on our table and when we did order she told us to write our own order down on the piece of paper.  I understand that there were a lot of options as far as the sushi alone goes, but if you don't want to put the time into understanding your own menu then don't put that many items on it.\n\nWe eventually ordered and then were immediately ordered, not asked, to move tables directly next to the door.  We would've been fine with a polite \"do you mind?\" or a \"if its all right with you\" but shoving us to the worst spot when there were other tables open or just plain not offering us better seating afterwards? We ended up seating ourselves at the bar.  On top of that, she brought us only one beer when we ordered two, for which I had to remind her and even then she brought it to us, and forgot to open it.\n\nThe food took ages to come out, and even still, the two couples who came in after we ordered not only got sat at better tables than us, but ended up getting their food much quicker than ours.  Our sushi roll came out before our appetizer, which, I understand every once in a while.  I work in the service industry too, and it happens but to not address it to us, and just the total lack of service was getting us so agitated that we were pretty much ready to leave right then and there, but just then the appetizer came out.\n\nWe took two bites of it just before realizing that there was a bug in the sauce they gave to us, and when informed, the waitress just walked away.  We finally just told them that we'd like to just pay for our beers and the miso that came with our entree.  They never got around to getting our bill to us, so we just dropped a few dollars on the bar and left without an apology or a goodbye.\n\nDO NOT EAT HERE", "author": "Tommy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "Great local business on the block. Kind of hidden.\nThe owners, Bing and Mandy, of this little sushi restaurant is very friendly and down to earth. Their restaurant has been on the west portal strip for quite some time. Very cozy and clean for a sushi restaurant. IMO their food is so much better than Fuji restaurant at the corner. Their sushi doesn't need any fancy sauce to cover up the natural taste of good quality fish. One thing that I absolutely hate about sushi restaurants is the portion size and quality. So many sushi places use WAAAYY TOO MUCH rice in their sushi rolls and drench them with super sweet sauce that you don't taste anything but some kind of yellow sweet honey mayo.. Like really?? I love the sushi rolls here because they are the perfect size and portion ratio, little layer of sushi rice with more ingredients, and you can actually taste the fish. Their sushi rice is very good. Not too vinegary. I especially love the Hamachi maki. The sashimi here is out of this world!! So fresh and delicious.. its actually quite unbelievable. The salmon is so fresh and it just melts in your mouth!! \n\nmmMmm approved!", "author": "Ubb S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "When you're in the mood for sushi and don't want to go out into the cold San Francisco rain, I kid you not, there is Sushi Suki to ease your pain!  You thought there was no such thing as delivered sushi, or that it could never compare to when you sit down and order fresh from the chef.  But Sushi Suki has, hands down, the freshest delivered sushi I will ever eat.  They can't be beat!\n\nEnough rhyming.  Seriously, it's really really good sushi, and they deliver for free!!  I've ordered from them twice, and both times, it was spectacular.", "author": "regina k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "Good price and pretty good sushi.  I am a fan of veggie rolls and before I was coming here I was always going to Fuji Sushi which is across the street and way overpriced  in my opinion. Kappa is good here as is the avocado asparagus roll.", "author": "Katie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-01", "description": "I didn't try the sushi, but me and my friend tried the lunch special rice plates so this review is only going to be on the rice plates.\n\nIt was sometime during finals, I ordered the Teriyaki Beef, she ordered the Teriyaki Chicken. Initially, when we received our food, we were like \"wow... that's a small plate\" since it was like the size of half a sheet of paper. But to our surprise, there was 2 large pieces of beef and chicken, 1 scoop of rice, and 1 scoop of cold slaw.   It was decent for it's price and definitely catering for hungry poor students.  I couldn't even finish my order.  One problem would be that I wish they gave me more rice.\n\nDecor of the place was interesting, a lot of napkins with messages or pictures hanging on the walls. You can definitely tell it's Chinese owned. but nothing wrong with that. \n\nOverall, cheap decent meal, great for lunch, but I probably wouldn't bring my friends here for a nice dinner.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-27", "description": "reheated sushi for the price u could get fresh ones in a different sushi bar, service isn't bad, but the food nahh", "author": "Akmal M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-02", "description": "A very homey cozy neigborhood sushi place.  It's a little family owned restuarant. Not quite a hole in the wall. It's reasonably good if you have a sushi craving.  The bento box is also good.  I always get good service every time I go there.", "author": "J M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-10", "description": "Suki Sushi.  Pronounced \"SUCK-E\".\n\nThis place is horrible.  The fish tastes like FISH, the rice is mushy, and the service (which was the best part of our expenience) was still sub-par.\n\nDon't do it.", "author": "Erika W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "We have been going to Sushi Suki regularly for the last eight years, it is a neighborhood gem! The sashimi is fresh and always in generous portions.  Bing, the owner goes to the fish market daily so the sashimi are always fresh.  The uni is fresh, hamachi, toro, and tuna are delicious.  The hamachi kama is grilled to perfection.  The recent addition is the fresh scallop sashimi, OMG!  so good!  They have good selection of cold sake and Japanese beer.  The ambiance is friendly and homey.  The noise level can be loud at times when they have private parties, and it is always festive. Mandy, the server and wife of Bing is friendly and fun.  Sushi Suki is the place to go for excellent sashimi and sushi.", "author": "Marie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-24", "description": "I just moved close to West Portal and love sushi, so I had to check this place out.  It was not good.\n\nBad sign #1 - three customers\nBad sign #2 - very young looking sushi chef (definitely no sushi chef training here)\nBad sign #3 - cheap prices ($3 - $11 for nigiri and rolls)\nBad sign #4 - bad sushi rice - really mushy and squishy - worst I've ever eaten\nBad sign #5 - didn't hear the obligatory \"arigato gozaimasu\" when exiting - no Japanese spoken\n\nThe words \"cheap\" and \"sushi\" should not go together.\nAt least our tea and water were refilled without asking - but the good service is eclipsed by the worst sushi I've ever eaten.  Check out We Be Sushi if you want reasonable prices - MUCH better than Sushi Suki.", "author": "Deann F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-18", "description": "Probably the worst sushi experience I've ever had.  The staff, especially boss-lady, were very rude from the moment we sat down till when she slapped the change on the table.  Our sushi took a long time to arrive, and when it finally did it wasn't even correct.  We asked for some spicy mayonnaise, but they said they ran out of mayo.  And to top it all off...we were served on paper plates. Seriously??", "author": "Jason A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "Sushi Suki is pretty much a totally family operated affair, which I like a lot because it really give you a chance to get to know your sushi chef and he gets to know you. When I go to Sushi Suki with my friends it is more like visiting a friend's house for dinner as compared to your standard impersonal restaurant experience.\n\nIf I was just grading the food I would probably give this place a 4 1/2 or a 5. They use very good fish (super clean) and will take pretty much any custom order you through at them. The non-sushi options are also very good (such as the Udon bowls).\n\nWhere they loose their star for me is the support staff. I love the sushi chef (we are on a first name basis but you will have to find out his name for yourself). He is awesome and really personable, but his staff can be inattentive and forgetful at times.\n\nThey have two sushi coolers and lately I have only seen one operational. I hope they keep getting enough business to hire some help and get the second sushi station going again.\n\nAs it gets later in the evening I wouldn't recommend this place to a family during the school season because it does fill up with a lot of college students and that can slow down orders (I usually tell the chef\nnot worry about me until he gets caught up and end up with free beer and/or sake for waiting), but if you get there at an earlier dinner time they are fast and great.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-28", "description": "If you crave Sashimi as much as I do, then make the trek to West Portal. Although they have cheap (We be Sushi, style) $4 tuna and salmon rolls, etc. as well as more fancy creations. I'm not eating those because of the rice, read another Yelper's review for that part of the menu. \n\nLet me explain; I've come to the point that I hate white rice. Sure you can hide it insidiousness in a roll, but its gotten to the point that I try to avoid it at all costs. If you are going to eat something as healthy and as good for you as raw fish why mess it up with white rice? Besides rice should not be eaten with any flesh. they just do not digest well together --- with tofu it's o.k. but only if its brown. \n\nBut I gotta' have my raw fish and that leaves Sashimi, which can be a major rip-off. Little tiny pieces for big $$$: Hell No!  Well Sushi Suki is the answer; they have 6 (usually big) pieces for $7, 12 with Miso and rice (I tell them don't bring it) for $13-15 depending on the types of fish, and a pig out size for $50. They even make custom orders and put them on a fancy boat for large parties or for entertaining at home. I'm sure they do this with sushi also.\n\nFinally, the seaweed salad is fantastic and enough for 2, even for a big guy like me, if you get the 12 piece.", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-18", "description": "I don't know what happened to this place.  Last year, the salmon here used to blow my mind.  It was so fresh and the marbling was so impressive!  The staff is nice and I would either pop in to eat or get takeout every chance I had.\n\nThe last two times I went, the quality of the salmon was terrible.  Not sure what happened, but it just didn't look as fresh, was tough, and I was thoroughly unimpressed.  I was so surprised that I spoke to some of my other food friends and they told me that the restaurant had changed suppliers and no longer had the same quality of fish that  they once did.\n\nI may go back again sometime, but for now, I've written this place off.  The place isn't bad if you're in the area, but its nothing at all like what it once was and that bothers me just a little too much to go back.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "The food is decent and they have free delivery!  The first time we ordered was on Valentine's Day, so it took a while, but once it got here, we (my boyfriend and I) inhaled it.  The tempura is awesome, sushi is adequate for a craving.  I even liked the green salad, which is shredded cabbage with a tasty dressing.  \nVery reasonable prices, which to me is as important as food quality.  I wouldn't go here for a Friday/Saturday night dinner with friends, but for a week night meal after a long day, it's perfect!", "author": "Rachael J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-18", "description": "Service was decent with the staff welcoming you in the moment you enter the door.  The sushi menu is not the most creative one i've encountered but the salmon was pretty fresh.  the other rolls were decent, but small in size.  We spent maybe a little more than $30 on sushi, but still somehow left feeling hungry.  \n\nAs for the atmosphere, the restaurant is small and cozy.  We had the unfortunate experience of being seated next to a group of maybe college age kids who were more interested in downing bottle after bottle of beer and sake bombs and eating edame than anything else, which also contributed to the noise factor. \n\nSeeing that there are so many Japanese restaurants in the city, it is unlikely i'll be venturing here again.", "author": "thb t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-31", "description": "My roommates friend is a regular here, and now knows the owner and his wife.  He got us sucked in as well.  It's simply decorated, but done well.  I especially love the napkin drawings by patrons along the wall.  Came here for a birthday party, and had a free round of sake bombs, and the couple who own the place joined us for a few as well.\nI'm not a particular fan of sushi, but they do have other things on their menu as well. I'm a huge fan of the chicken teriyaki.", "author": "Darian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-11", "description": "This sushi house offers a very warm and welcoming atmosphere that can get a little noisy on thursday through saturday nights.  It is fairly inexpensive which is always a plus.  perhaps most importantly, the food is tasty and fresh.  I have been eating at Sushi Suki for about two years now and have never had an issue with the food or service.  As I mentioned, it can get loud as sometimes there can be a group of young people celebrating an event.\n\nI recommend this place over the other sushi restaurant that is up the street, Sushi Fuji, because Sushi Suki is cheaper and has always offered quality food.  I can also take the occasional noise at Sushi Suki as sometimes I am with a group creating it...", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-17", "description": "I like Suki Sushi--their sashimi is very, very fresh. I love raw salmon (sake) and I always get two orders of it. I talked to the owner, who said that he'll throw away the fish if it's not fresh--and at first, I was skeptical, but everytime I go, the fish is always fresh and clean.\n\nThe 49er and caterpillar rolls are delicious..everything is reasonably price, and they have 15% off your entire bill if you go M-F from 2-5.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-24", "description": "My sister and I played eeny meeny miny mo and chose this place. And thank the lord above that we did because we got a lot of good sushi for a good price. I think we over-ordered, which quite frankly, is something that I do all the time. It's a great place, though! You would miss it if you weren't looking, though. \n\nWe ended up getting these really good rolls called the dynamite roll (yeah! dy-no-mite!) and the crazy roll, along with a 49er roll and tekka roll. Very tasty, and fresh! The thing we over estimated was ordering sashimi dinners, in which they gave us twelve pieces of sashimi (all tuna and all salmon) with rice and miso soup for the price of 12.95. I honestly thought this was good. And I love, love LOVE that they offer this because sometimes I have to beg, beg, BEG restaurants to let me have just all maguro sashimi (it's an obsession). Usually it's like, \"No mixing!\" Boo. \n\nOverall .. pretty cool. The sushi chef and the waiter were really nice, and I guess they knew we couldn't finish our food, but served it to us anyway. I kind of wish they played music in there, though. I kind of got tired of hearing myself talk to my sister, which is a feeling that I can experience all in the comfort of my own home.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-24", "description": "Good service and views from windows are nice but the place smelled a lil musty and the sushi was just okay. Still prefer Little Tokyo!", "author": "M K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-07", "description": "I can never really go wrong with this place. My cousin and I saw this while driving down to squatt and gobble and tried it out. it's small, quaint, and the employees are very nice. Price is a bit unmatched from the quality, but altogether i'm satisfied.", "author": "Quinallison D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-25", "description": "Love this place...they deliver and the fish is very fresh...I have never been dissapointed...they have the best salad dressing...love it!", "author": "Dee D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-18", "description": "My bf and I ordered quite a bit of food from here, but all i remember was the shrimp tempura and salmon sashimi. they both tasted great. Also had some sake. A little bit pricey. Customer service is really a hit or miss.", "author": "Neek W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-30", "description": "Quality, Yummy FOOD!!!! I mean - this isn't a trendy,pretentious joint in the Marina here.....so if you're looking to impress some stuck-up date or something - don't go here...they don't have sake pomengrante infusions or anything like that.....\n\nBut if you want some GREAT sushi, apps, and sake - give it a try....I can't tell you how many people I take here and they already look dissapointed BEFORE they even walk through the door...lol...but they are all smiles when they leave that's for sure...so don't let the exterior and ample parking fool you....IT IS GOOD!!!! My boyfriend comes all the way from Marin to eat here...and he hates goin over the Bridge I assure you!\n\nI would also recomment eating at the bar for some great entertainment from the sushi chef (owner I think too?)...he's great....He will tell you what's best today and what's really rare and special that he has from the fish market....He'll tell you exactly where everything comes from (Royal Hawaiian usually)...and if he doesn't something, he'll tell you it's because it wasn't good that day.....Oh, and have a couple drinks with him too!! He even got me to take some sake-quail egg shots with him! (no comment on taste - but a great experience none the less) HA!", "author": "R. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-16", "description": "Yet another sushi review from me.  I am officially an addict.  \n\nI'll agree with the other yelper that mentioned that minors drinking sake bombs dominate this restaurants.  But the sushi was acceptable (the rolls kinda sucked, but the nigiri was ok).  But it was just what I needed, an uncrowded restaurant where I could enjoy some hot sake and some sushi all by myself after a long day at work.  \n\nThree stars for being edible, having the sake at the right temperature and being clean.  It's much better than supermarket sushi.  (And yes, only real addicts will settle for a supermarket sushi fix.... do they have 12 step programs for people like me?)", "author": "Luba M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "4 Stars for reasonably priced, satisfying food, but more importantly, wonderful and personable staff. The family team at sushi suki are always kind to customers, and sometimes their son is in the restaurant chitchatting at the tables. Great place if you are with a large group and are concerned about finding a place that will accomodate you, (keep in mind they will do this for everyone, so be prepared for loud/ all over the place youth) or if you simply want a relaxed atmosphere with a small handful of people.\n\nShame on whoever broke their window, though.", "author": "Molly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-30", "description": "let's start with the pros... i used their restroom, which was good, only because someone had left the sink running and i turned it off, so that made me feel like i did a good deed.\nthey have four goldfish. \nthere is a really little couch on the floor, that's kind of neat.\nthey have chairs and tables.\nthe food is alright.\n\nalright, onto the cons.\n\nthe people are annoying, like, the other customers. they're drunk, loud, immature, inappropriate..blah blah.\nthe service is bad. \nthey handed us out plates, and then came back later to take them back.\nthey only serve luke warm tap water.\nthe orders take forever.\nthe restaurant is gross.\nthey tape EVERYTHING to the walls.\nsure, people write \"I LOVE SUSHI SUKI\" on napkins\nya ok, that's fine.\nbut they're DIRTY, USED napkins.\na lot of them contain profanity too.\nthey have an award for \"achieving sanitation\" on their wall.\nlet's look that up..\nachieve: to get or attain by effort; gain; obtain: to achieve victory.\nsanitation: the development and application of sanitary measures for the sake of cleanliness, protecting health, etc.\n\ni don't want to eat at a place that had to ATTAIN THEIR SANITATION BY EFFORT.\nsanitation should come easy to restaurants. uh, ew.\n\nbut hey, i'm not that picky, and the food taste alright for how much you get and how cheap it is. \n2 stars.", "author": "bailey g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-12", "description": "sushi suki is needs to turn up the heat cause' it was freezing in there yesterday night.\n\nanywho, like any other sushi joints in san francisco that is NOT located in japantown, this eatery is owned by chinese people... while i look for authenticity in not only the food itself, the chinese babbling ruined the whole ambiance for me.... moving on...\n\nthe food was good but not great, i ordered the chicken katsu dinner along with 3 sushi rolls that me and my friends shared. My friends ordered egg donburi and chicken udon, which was also good but not great. The sushi (dynamite roll, spicy tuna, and some roll with smoked salmon)  though, was surprisingly surpass good but not excellent. service wasn't bad either, the waitress/owner lady kept coming by for refills and constantly asked if we needed anything else, she was loovely! overall, i would eat here again only if i can't conjure up another place to eat... \n\ndefinitely going on my 'default eatery\" list!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-01", "description": "Easy to overlook, yet hard to forget.  On this corner alone, there's another Sushi joint a few hundred feet, and a Hibachi restaurant less than 100 feet of that one.  Nonetheless, I think I made a good choice in selecting Sushi Suki.  The prices are reasonable and the servers were super kind and friendly.  I think they were psychic because they figured that we would be in need of more napkins that what was already on the table.  The teriyaki was yummy, the sushi fresh, and my parking meter was mere steps away from the restaurant.  Good karma indeed.", "author": "brenda b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-08", "description": "Update 1/7/2009:  I always thought this place was very dependable for good sushi and a good deal.  And maybe it still is--but the last time I ate here there was a dog sitting on a chair next to his owners RIGHT AT THE SUSHI BAR.  The dog stayed there throughout their entire meal!  The owners, er, I mean, guardians, of the dog looked at me with the \"isn't our Precious just the cutest thing\" look.  Well, maybe Precious is the cutest thing but that doesn't mean I want him as a dining companion at the sushi bar.  I understand trying to accommodate all customers in this difficult economic period but this is taking it too far.  Sorry, Sushi Suki, you've lost me as a customer.  And it's too bad that certain selfish dog owners make others pay dearly for their short-sightedness.", "author": "Lulu H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-25", "description": "I discovered this place about a year ago before it had changed ownership and became Sushi Suki. I have to say that i much preffer the new ownership. The food quality has gone up and the service is much better. I highly Recoment this place to all. It is the kind of place where if you go often they get to know you and know what you like. and they know how to make great Sea urchin sushi.", "author": "Thomas E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-11", "description": "Usually, I give out stars based on this idea: I am limited to five stars.  Therefore:\n5 stars = perfection\n4 stars = better than average\n3 stars = avergage\n2 stars = sub-par\n1 star = bottom of the barrel, avoid.\n\nIn this case, I would say that Suki Sushi deserves one and a half or maybe two stars on a good day.  I probably never should have gone here, and all my instincts were telling me not to go in here.  It looked like it had just been relocated from a food court in a mall.  The \"sushi chef\" was some young Chinese hid in a polo shirt.  It was SUPER slow: there was one other guy there and he was from out of town.  And the fish didn't look very good.\n\nIt's the kind of place I might have gone to 20 years ago, when I was a dumb kid who didn't know any better, instead of nowadays in my modern persona as pompous sushi snob.  But my lady friend was whining about how windy it was and how hungry she was; so we went in.\n\nSo, the seafood udon was flavored with chicken stock and had big chunks of fish (reject sashimi?) and mussels floating in it. And Chinese cabbage.  It was really pretty much a Chinese fish stew; and if you're mouth is prepared for udon, it's hard not to spit this out of your mouth.  Not that it's bad or anything (well, not inedible at least) but it's so WRONG.  Like biting into a donut and having the filling made of beef or pork.  \n\nDid I mention everyone there was Chinese?  I don't speak Mandarin, so I was kind of alienated, because that is all they were speaking.  They seemed nice enough, though.  I mean the service was prompt, albeit there were only three patrons, sitting side by side in the whole place, but still.  And the \"chef\" kept asking how we liked everything.  He even gave us a free sample of some kind of nigiri, the name of which I couldn't understand, but it seemed like salmon belly perhaps.\nThat was actually good, but the unagi, hamachi, and maguro were all very stale and mushy.   By the way, I saw they had LAMB on the menu, too.  I was really scared to eat more.  I just wanted to get the bill and end the conversation with the out-of-town dude, who turned out to be one of those \"I'm from out of town, I'm slightly buzzed on sake, and I want to make conversation in this hotel/airport bar\" types.  Still, that's cool, dude.  Whatever.  Good luck in Carolina.\n\nThese guys seem to make an honest effort, except they suck at this.  The caveat is I didn't order a lot and I only went there one time.  I usually rate a restaurant only after a couple visits minimum, but I'm not ever going back, so there you go.\n\nThe kind of place you ought to go to if you're young and dumb, don't know sushi from sashimi and are excited by \"exploding hedgehog roll\" or something, then go for it.  \n\nDid I mention I was a snob?  Yeah, I'm kind of a jerk, huh?  Sorry about that. :p", "author": "Adrian B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-29", "description": "I consider myself a bit of a sushi lover, and I have to say this sushi sucked. Hands down, no contest, worst sushi I've ever tasted. Even the generic crap they sell premade in supermarkets tastes better than this. The unagi donburi was warm but that's the only compliment I could give it. Sushi tasted flat and I will definitely never return to this place again. I don't know how everyone is giving it positive reviews, maybe I went at a bad time, but I'm not going to give it another chance. My stomach turns just thinking about it.", "author": "Christian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-05", "description": "I agree with Peter F's review below. I love this place, although it is understandable that some may not for the drinking that goes on late at night. My respect goes up for this place each time I go there. Service without questions the best i've had, yet I am a regular there. I get 49er roll and dragon roll which i have yet to eat at a sushi restaurant that makes better. (remember to ask for the free strawberry or green tea ice cream after your meal.) One time I sake bombed there with my girlfriend, the owner actually drove us home. Thats what i call service.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-07", "description": "This place is kinda like a dive bar sushi bar, if that makes any sense. They are TINY and in a strange location - the restaurant is long. The walls could use some paint. The atmosphere is friendly - once the boyfriend and I stayed here so long that the waitress (owner?) cracked a beer and toasted with us. It's that kind of place.  \nService is attentive, especially for lunch - the waitress (owner?) is friendly and always has more tea on hand.\nThe best thing about this place is the sashimi. Butterfish and yellowtail!", "author": "Megan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-17", "description": "Good neighborhood sushi bar.  Quick service and inexpensive.  As strange as it sounds, I only wish more people would go here.  I feel awkward when my boyfriend and I are the only customers in there.  I think it has largely to do with their location (there's not much going on past them) but it's worth checking out.", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-17", "description": "I have eaten here two or three times and gotten delivery once or twice.\n\nThe last time got delivery, the driver didn't have any change. How am I expected to pay if you can't make change? I ended up having to scrounge around for enough to pay the bill, and I didn't have any left over to tip. Who sent you out without change? Stupid.\n\nEvery time I've eaten there, we've been one of only two tables of guests. The atmosphere is no fun when the only thing you have to see or listen to is the owner and the waiter talking at the end of the table while watching chinese television. So I assume most of their business is take-out or delivery. But if they deliver so much, how come they haven't yet realized they need to send the guy out with change?\n\nService is good (what else does he have to do? There's only six of us in the whole store). Price and quality are average.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-21", "description": "Sushi Suki seems like the standard college sushi hangout, the walls are covered in drunken napkin art and photographs. If you don't mind listening to banging tables with sake bombs, you can get a decent meal for a small price.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-24", "description": "This is one of my favorite place to go to...cuz of the uni-oyster n a half shell. They are the best !!!!", "author": "Renee Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "Sushi Suki is our staple Japanese restaurant.  Sushi is fresh. It's fast and has the best prices in the West Portal area.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-05", "description": "We were originally looking for another sushi place but couldn't find it. Since we were running late getting to the folsom fair, we just went to sushi suki. It was ok. Not good, not bad, just ok. There wasn't too much variety, I got some sort of combo meal. The combo meal wasted 4 pieces of just cucumber wrapped in rice, and then another piece of gross fried rice thingie that was supposed to be dessert. The miso soup was good and the actual sushi pieces were ok. Go there if you have to, but try someplace else first.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-20", "description": "I've tried this place a couple of times, and its a little hidden gem in SF!!!\n\nThe sushi is always VERY fresh. I mean, it TASTES fresh. Like, just caught 5 hours ago fresh!!! The atmosphere is very relaxed, but can be fun. Most times when I go with my girlfriend, no ones is in there, then suddenly people just come in haha.\n\nThey have a pretty full and diverse menu, which I'll have to explore, but I would definitely recommend this place for good, filling, but not terribly expensive sushi!", "author": "Invent C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-26", "description": "Simple. Simple.  That's what I have to say about this place.  But, it is good simple Japanese food and its cheap.  Just that I would like more choices on the menu.  Overall its rated a three because it middle of the ground on choice for me on Japanese food.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-30", "description": "It's okay if you really want sushi. I've been here a couple of times but only because it's close to SFSU. The service is okay and the sushi is decent but nothing to die for.", "author": "Ricialg P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-22", "description": "i loveeeeeeeeee this place!!!! sushi suki is my family's favorite place!!!!! we love going any day of the week!!!  THE SUSHI IS THE BEST AND THE FRESHEST!!! Bing & Mandy are super nice!!!!!", "author": "valeria a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-29", "description": "Casual? Let me put it this way: We sat as far away from the blaring TV as we could. As a result, our server seemed to forget about us for a while. The sushi did not seem fresh or especially well prepared. The kids' drawings were all right, though. For that alone I may given them a second shot sometime.", "author": "James B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-25", "description": "Have been here 3 times.\nfirst time to test it out, thought it was ok and felt like we would return....but got overcharged on our bill....\nreturned like 6 months later, same story ! average sushi, shitty service, AGAIN about extra 10 on the bill.... \ndecided not to return.\njust last week were looking for a place to eat at West Portal, but during mid-day practically everything was closed (at least everything we were interested in) except Suki.\nThis time bill was correct, food was decent and slices of sashimi way thicker than what I'm used to . \nI think they are making an effort....but I'm probably done with that place anyway.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "veggie tempura cracks.  the plum wine was good also.", "author": "Iman Taliah H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-19", "description": "So yes, not the best sushi, but not bad either. mediocre sushi that is priced appropriately.  What redeems them and makes them worth even a review is that they deliver... And they are certainly a notch or two above any other place that delivers in SF.", "author": "Claudia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-30", "description": "I have had sushi all over the city and East Bay. I love this place (I am veggie, however, so I can't say much for the quality of the fish). I do have non-veggie friends who dig the regular sushi. The hot miso soup and bottomless sake has always been the best thing about winters in SF. They also deliver! I've even had them deliver to my favorite bars down the street (which I will also review). Great service and friendly folks.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "I frequented there quite often for a while. I found the sushi to be quite good. I ordered sashimi most the time, salmon, hamachi, butter fish, yummmmm!  I always went for lunch, so I never saw a heavy crowd there, two other tables, tops, would be occupied. Not much of an environment though. They cleaned the napkins off the wall, but sometimes I wish they would turn up the heat a bit, brrrrr. Bing always served us and was super accommodating. Recommended for people not looking for a warm, stylish restaurant.", "author": "lara s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-29", "description": "just had dinner there tonite! decent food and near my house. lol\n\nthe sunrise sushi is my fave! the sushi/sashimi is best... cooked food is\n\nokay but thats just preference", "author": "Will M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-09", "description": "I understand that it is a family business, but the service tonight was lousy.  Friendly, but lousy. They weren't understaffed, just disorganized. It seemed like people who arrived after us got served first, and my husband had to wait 15 minutes for a beer, only to receive a different beer than he ordered.  We didn't order anything too time-consuming or exotic.  My husband got sushi, which actually came rather quickly, and I eventually got the dinner combo about 20 minutes after he finished eating. I can't comment much on the quality of the food because I had so little time to enjoy it and ended up just scarfing it down so that I could be on time for our movie. Call my crazy, but how long does it take to slap some rice and some deep-fried vegetables on a plate?", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Okay, this place isn't fancy but I can always get a seat pretty easily, the staff is very friendly, it's cheap, and they have yam maki. Delicious YAM MAKI, or maybe it is squash or sweet potato(It's actually part of the tempura vegetable roll), whatever - as a veggie I am sick of cucumber rolls and plain avocado rolls. They also have an awesome asparagus and avocado roll!", "author": "Lynn R."}
