{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-09", "description": "Want cheap decent simple Chinese food, this is the place for you. \n\nI would only order food like chow mein/fun, fried rice, and some lunch specials and i will not deviate from that, everything else been on the disappointing side. \n\nOnce you find the niche of food you like from here stick with it.", "author": "Ken T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "I think this place deserves a bit higher than a 3 star rating. We ordered beef and vegetable chow fun, Mongolian chicken and pan fried oysters. The food was quite authentic and the portions were huge. \n\nIf you are expecting a restaurant with great service and a good atmosphere this place may not be the place to go for you. But on food alone was quite decent and I would come here again.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "We were going to hit up S&E around the corner on July 4th (because err'body knows you go to Asian restaurants on national holidays), but to our surprise, S&E wasn't open! The betrayal. Luckily, Szechuan Taste came through.\n\nRating Breakdown:\n1.5/2 Stars for Taste --\nEverything here is solid. We ordered the set menu for 3, which came with fried salt and pepper shrimp, fried spareribs, fried flounder, sautéed greens, and soup/sliced oranges. (I turned to my sister and asked \"That's a lot of fried things.\" and she raised her eyebrow as if to say \"And?\" ) We also ordered a Fujian fried rice. Nothing to complain about here in terms of taste and quality. The soup wasn't just thickened broth, it was chock full of tofu and meat. It wasn't the most amazing Chinese food I've ever hard, but it was classic. Reminded me of childhood dinners with family where we got 3 dishes for $18.99. \n\nI've also had their lobster noodles before and it wasn't bad. Nothing to write home about. \n\n1/1 Stars for Value --\nThe value here is ridiculous. Almost everything is under $10, closer to $8 per plate. They don't skimp on serving sizes. Our fried flounder was huge. I believe the set menu for 3 was $28. I think we paid around $40 for our party of four and we left with leftovers. \n\n1/1 Stars for Customer Service --\nThis is an authentic Chinese restaurant. If they bring you tea and don't pick their nose over your food, you are thrilled. That being said, the waiters and waitresses here are efficient. When our waiter put one hand behind his back as he ladled out our portions of soup, we knew he meant business. The waiters mostly spoke Cantonese, but they could also communicate in Mandarin and English.\n\nBonus star because this is probably one of the cheapest places for legit Chinese food in the area. Apparently, Asian parents all over the Bay know of and love this place. I have run into family friends from Palo Alto and San Jose at this restaurant. It is a true SF classic. Anyways, there are tons of menu recommendations written on the wall in Chinese that I want to come try next time.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Have been here on and off since 2008. They have actually cleaned up a little bit and yelper still complained about their cleanliness.  Well, you should have seen it back then;-P.   Still classic Cantonese fare, don't ask me why they are named Szechuan Taste might as well called them Timbuktu.  The rice is sometimes lukewarm, fried rice inconsistently good.  Have been to S&E and this is a tad better.  You are getting more food and better seasoning.  I usually get the chow fun or fried rice to go after a long day and don't want to cook.  Fast service, cheap eats, in and out. PS: yelp should take that old-priced menu off the site because those prices probably were 2000 whoever heard of $5 entree now a day.", "author": "Lantz G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-22", "description": "Lunch was cheap and cheerful. We had the ginger and scallion crab, Chinese broccoli and beef tofu. All well prepared and tasty. No complaints on the food front. Service was friendly too. \n\nThe bathroom, and I suspect kitchen, are filthy though. It will give you pause about coming back!", "author": "Ada C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "i use to go here all the time when is was owened by another gentleman. the previous owner was super nice, he would come and check in with the customers and ask how the meal was. \n\nbut, now with the new management he doesn't care. we got a dish with hair inside. and we had told the owner, he just brushed with we told him and didn't acknowledge us. i often see the owner outside smoking and the restaurant is super empty that you can hear a pin drop.  \" pin dropped\" \n\nhorrible!!!", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "Dirt,smell.restroom.spoon.glass of water.They are unsanitary.Might as well as how eas the food was prepared.Check it out.See for yourself.", "author": "Randy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "If you want to find plastic wrap and a pice of unknown hard plastic in your food, this is the place. Don't try telling the waiter because she will pretend she won't hear you. Don't expect your food to be compensated or discounted because you won't. Don't even try telling another waiter when they give you back the bill because she will drop it off and scurry off as if you don't exist. Not one sorry was exchanged. \n\n\nDo not come here.", "author": "Sara Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-22", "description": "Come here if you are starving for Chinese food and don't care about anything... Taste, quality, service, ambience, etc. \n\nPro: very cheap prices, huge portions, decent taste\nCons: everything else\n\nSome servers don't understand English and specialty items are all in Chinese", "author": "Yenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "One of the few Chinese restaurant that offers great abundant portions of Chinese food at an affordable price. This is my go to when I just want to eat everything!!!", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "Kind of tragic that this restaraunt closed down due to health hazards, since this place did offer legitimate food at an inexpensive price. The food was average and forgettable, but the inexpensive price is what drew in customers. With this place potentionally gone, it was an okay experience at this restaraunt. Hopefully, they will reopen and improve their overall food safety. Generous $7 Chinese entrees are uncommon around SF, but this place sold them.", "author": "Timmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Has a great selection of Chinese food with great prices! Not the cleanest restaurant in the world but if you love Chinese and don't mind cleanliness this is your go to spot!\n\n\nRecommendations: \n\nChicken Chow Fun Wet/ with Gravy\n\nOr if they are out \n\nChicken Chow Mein\n\nSalt and pepper calamari \n\nEither peking or salt and pepper spare ribs \n\nand if you want more sea food either fried Sandabb or honey walnut prawns!!", "author": "Gus R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "Cod with green beans in black bean sauce was good.  Nice and hot.\nRice was warm not hot.   Yes I will return Food had good flavor.", "author": "IrmaIris V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "My boyfriend has been going here since 2010 when he was in high school. Now he takes me, and I always take my friends here.\n\nCollege students on a budget this is the place to go.\nAnyone hungry for some good tasty food and big portions please go here.\n\nI always order the Salt and Pepper Spare Ribs over rice and my boyfriend always gets the Sweet and Sour Pork over rice.\n\nI'm actually going right now to go get some lol.\n\nWhenever I'm feeling adventurous I order the jellyfish (cold) \n\nYummyyy!", "author": "Grace G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-05", "description": "The food was not bad, but the deceptive prices were frustrating. We ordered for pickup using their online menu. The prices shown are old prices. If you order over the phone or online, expect to pay more in person. I asked them about this and was told they don't use yelp. Well, I do when researching places to eat.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "Szechuan  Taste Restaurant seemed like they have been here forever.  I remember coming here as a kid. I used to swim at Wawona Pool located not far from the haunted model airplane where it used to sit in the middle of the park.  At night, the residence in the area would hear it howl!!  I kid you not.  It was on the news a lot. Eventually, the plane haunted so many residence that the City took it away.\n\nSo as I was saying, I would pay a visit to Szechuan Taste after swimming practice and I took my coins out of my pocket and counted them one by one, and hope that it would add up to so many dollars because I was that starving kid that needed food in his tummy, especially after swimming practice.  Funny thing, even today the food remains the same from the last time I visited. Some were good, and some were bland.  And if you are looking for suggestions, try their whole crab and half chicken.  They were actually pretty good.  Their clams with black bean sauce was so so and a bit overcooked. In terms of flavor, I was expecting a bit more spicy and more fragrant which Szechuan is known for. But overall, it's decent.  Oh speaking off Szechuan, if you are not familiar where it is in China, it is located in the Southwest Region of Mainland China, not far from Guangzhou Province (Canton).  If you've heard of Yangtze River (longest river in Asia about 3,000 miles and third in the world), then you are in the right location and also not far from Guilin (very famous town).  By the way, many Americans have retired in Guilin and have become a miniature Berkeley California with a bunch of bohemian hippies, dressed with their Tommy Bahama, wondering around with their flip flops eating with their chopstick.  Most of them are actually college professors.  So if you're looking to retire in China, this might be an option for you.\n\nSzechuan Taste haven't changed a bit.  Though they've updated and remolded here and there, but overall, this is still a nice hole in the wall where you can get decent food with decent prices (not overpriced).  The staff here remains super nice and they have quite a long time follower.  They are also very busy up until closing on most days especially weekend.  I'd definitely come back here to eat if I am in the area again.\n\nUntil then, be kind to one another and Cheers! ~ :p", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "Probably one of the oldest restaurant in Sunset area. But food was pretty good, home style Chinese cooking. Place is old, but it has their patrons. Pretty crowded even 9pm. \n\nStir fry beef with bitter melon - I do like bitter melon in general. This dish is pretty good. I like most Chinese cuisine with wok-hey (wok air).\nClams in black bean sauce - pretty good,\nMixed veggies with Chinese sausage \nHalf salty Hakka chicken - the chicken is a little too dry. Not recommended.\n\nThey asked how many rice we want, we ordered 2 - they serve in a big bowl, very good!\n\nLoved the complimentary Red Bean Sesame Balls\nCome here hungry, comfort food!", "author": "Sandi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-10", "description": "It has been a while since i went to this restaurant. Its your typical chinese restaurant in the sunset area. I dont know how much it cost since my family and i were invited by the relatives after the funeral and they did family style for each table. But by the board menu that they display on the wall, the prices are cheap. The foods here are pretty decent average chinese food. Some of the food that we had had the right of flavor, some were too sweet, some were a little bland that you need to add extra flavor from the sauce they provided, or salty. But it can fill your tummy if you eat each of the items on the family style menu. Since they have mostly bigger tables, of course this place can cater to family or large group", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "I once watched a TV show that studied various parts of a restaurant to determine where one can find the most germs. They looked at things like seating, menus, napkin holders, bathroom doors, sinks, etc. Well...this place fits the bill for such a show. The menus were sticky, our table top felt like it hasn't been wiped in hours and the bathroom was just a little suspicious. But you know what? The food freaking rocked and although you feel that some 20 health code violations are all simultaneously being broken at the same time you simply don't care. You just suck it up and deal with it.\n\nWe had the following items:\n\n- crab meat with fish mor soup - Nice start to the meal. Very healthy sized chunks of crab meat.\n- Mongolian beef - Solid dish here. The meat was tender and I liked the taste of the sauce along with the little spicy kick it had to it.\n- spicy salted pork spare ribs - I would say that this was the star of the meal. For pork these pieces were favor tender. So tender I thought I was eating fish.\n- deep fried sanddab with soy sauce - I really enjoy fried fish but having it drenched in a plate of soy sauce made the fish fall apart too easily. That's my only gripe about this dish.\n\nOverall, a good tasting last meal in the beautiful city of San Francisco.", "author": "Xerxes N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "The quality of Szechuan Taste Restaurant has sadly declined over the years. We've ordered takeout from this dingy establishment since I was in fifth grade, and for some reason, we keep on going back. The food is by far not the best, but the prices are very competitive for an Asian restaurant. I still remember getting dropped off as a little boy on the weekend, carrying $30 in cash, running straight to the register, and telling the cashier that I've ordered something for takeout. We usually call in around 30 minute ahead of time, and they always say the food will be done in 15-20 minutes. We always seem to fall for the trap and get there 20 minutes after we call. The cashier then nonchalantly tells me to \"wait a bit kid, the food's still cooking!\" Though the cashiers have changed through the years, I still get a bit confused when my food isn't ready even though they told me to come at this time! Waiting there for 10 minutes, I noticed that the only people that eat here are Chinese construction workers. Conclusion? It's a really affordable place.\n\nWe generally like ordering the fried rice and chow mein dishes. On this occasion, probably our 20th time? man, time really flies, we ordered the Pan Fried Chicken Chow Mein, Yangchow Fried Rice w/Shrimp and Pork, and Singapore-style Rice Vermicelli. These are extremely common Cantonese-styled dishes that you can find at most typical Chinese restaurants in the U.S. of A. \n\nYANGCHOW FRIED RICE W/SHRIMP AND PORK ($6): The most solid of the three dishes, this yangchow fried rice LACKED FLAVOR and the pieces of char siu (BBQ pork), if there was much at all, were extremely hard and reminded me of bacon bits. I usually find solace in eating this dish, but even after eating 3 cups of this, I still WASN'T SATISFIED.\n\nCHICKEN CHOW MEIN ($6): This dish was \"MEH\". Nothing really to complain about, a generous heaping of bok choy, and chicken strips that could be cut with a sharper knife.\n\nSINGAPORE-STYLE RICE VERMICELLI ($6): the most underwhelming of the three dishes. The chef really needed to add some more curry power or salt or something cause it was BLAND. The SHRIMP WAS CLEAN, which is one of my huge pet peeves, so they get bonus points for that! The char sui was dry and not up to standard.\n\nTASTE: 2-3 Stars--Food is \"meh\".\nSERVICE: can't say cause I came here for takeout!\nPRICE: 4-5 Stars--you can't beat the price--seriously!\nTOTAL: 3 Stars--I would give it 3.5 for the price, but the food is really of a \"meh\" quality.\n\nBottom Line: THIS PLACE IS SUPER CHEAP. If you can find a place in SF where you can eat a good amount for only $6 a plate, message me! However, cheap doesn't mean good. The food here really is \"MEH\". Would I come again? If I'm hungry and need a quick cheap bite, sure!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "I've been coming here time to time for years, and overall I feel the quality at best is just okay, if not slowly inching downhill. If you desperately need Chinese food in a pinch you could swing on by but there are so many better options available out there, so I overall do not recommend coming here and don't find myself coming back here anytime soon.\n\n-The sanitation is poor, both the menus and tables are oddly kinda sticky to the touch, which is a huge turn off for my mindset because if your menus let alone tables aren't clean, can I trust that the plates my food will later be on will be clean as well? Also, turns out the guy heavily smoking in the front of the restaurant that I passed entering the restaurant was going to be my server, so it was fun watching him finish his smoke break and then just walk right in and take my order immediately without washing up his hands or anything else at all, whoopie. The bathrooms gets a low scoring mark as well, although it's definitely not the dirtiest bathroom I've ever seen, it certainly isn't the cleanest by a long shot. I normally never comment on sanitation for buisnesses but I've never been that disgusted in restaurant's sanitation before, so...\n\nThe food itself was a hit and miss.\n   -Ordered Chow Fun with Beef, overall the noodle strips(?) were decent but seemed kinda greasy despite the fact it wasn't even that flavorful. The beef was also decent and it came with a couple pieces of broccoli to I guess balance out the greasieness of the dish. Overall it was okay, nothing extraordinary.\n  -Hong Kong Style Crab was a tad flavorless, and considering how expensive crab already is you would think you'd be paying for a really great quality crab, but despite the size of the crab it's not seasoned very well. Overall kinda bland and not very flavorful at all.\n  -The real and probably the only star of the show was probably the salt and pepper pork chops, which was I thought was pretty good, well seasoned, and flavorful compared to the other dishes I tried. The pork was fried nicely, chewy on the inside and crispy on the outside. Probably the only thing I liked about this place, and if I ever come back I would definitely order this. Mmmhmm.\n\n-It also occurred to me that this was the place where I officially stopped my old love of Honey Walnut Prawns because quite frankly I believe this place ruined it for me. I know a lot of people on Yelp rave about it, but I just can't agree with that considering my terrible past experience that I had here once before. I used to be a huge fan of Honey Walnut Prawns and I remember the last time I ever had it was here a couple of years ago. I remembered the walnuts were a tad too sweet & sticky and the mayonaise shrimp was maybe coated with too much mayonaise? \n\n Ok, I'll admit, maybe it wasn't entirely this places' fault completely, maybe it was a combination of things from an entire day's worth of things I had eaten, but I remember eating a lot of this particular dish and within half an hour or so after leaving the restaurant I did not feel too particularly well. What happened next was when I got home I found myself with severe food poisoning and threw up everywhere. Needless to say now everytime I see Honey Walnut Prawns or oddly mayonaise (because the shrimp is coated in a thick layer of it) everywhere else I gag, and I now avoid the dish like the plague. Needless to say I do NOT recommend the Honey Walnut Shrimp.\n\nJust overall not really the best place to go and grab Chinese food,  but if you're in a bind I guess it'll make do. And judging from the next to empty people sitting inside eating, I shouldn't have been so surprised. Needless to say I'd skip past here and go somewhere else.", "author": "Allison O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-15", "description": "Don't ever come here!!! Service sucks! Dirty and we waited 40 minutes for our food! The wait staff was rude. In general, there is nothing at the restaurant that would make me want to come back.", "author": "Juanita L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-29", "description": "This restaurant has a very racist staff and owner. After quite a long drive to arrive to this restaurant for my birthday, I was told to wait longer than Asian families to sit at a table to order my meal. I was very displeased by the behavior displayed. Terrible service. I would not recommended anyone to go to this restaurant. I would highly recommend Jumbo!!!", "author": "Leeza F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "One word: COMFORT. I often come to this restaurant for a quick bite whenever I feel stressed with work for lunch or just when I need to blow off some steam. This is that restaurant that serves food that's ready to give you a quick hug with the affordability of their rice plates. I mean $5.95 for a quick plate of sweet and sour chicken and an abundance of rice, as well as other options such as Mongolian beef? You can't beat it that easily. The only con for the latter is that the onion to beef ratio is 2:1 in favor of onions. But when factoring in cheap price and the portion, you can't go wrong!\n\nLet's face it. This is your hole-in-the-wall restaurant that knows no garish decors, unlike that one restaurant I reviewed (or roasted) a few blocks down a few months ago. Their food isn't what you consider Michelin star world class quality. Sometimes the ratios between meat and rice or meat and veggies are not consistent. Sometimes, you wait too long and other days, it's prompt. If Yelp could give a more precise rating system, I'd give this a 3.7 but I'll round it to a 4. So when you're just fed up with life, walk in, have a seat, and indulge your sadness away on a cheap comfort meal.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-28", "description": "Dined in on this place and ordered salt & pepper pork chop  among other dishes. Half way thru our meal, i stumbled into a piece of scrub metal stuck on one of the pork chop. I called the manager and guess what he did when i mentioned to him that there is a piece of metal stuck on the pork chop- he tried to pick it with his hand instead of taking the plate and apologize! I had to tell him  to take it away and i will not be paying it!  See picture !", "author": "ed t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "If I can give minus stars, I would.  I just got scammed on my bill.  My son and I ordered a soup and 2 dishes.  After the waitress took our order, I decided to add a vegetable dish of pea shoot.  When we got our bill, which was presented to us by another woman, perhaps the owner(?), there was an item costing $14.95.  I questioned the woman about the charge and she said it was for the pea shoot.  I told her that was crazy and she just said that vegetables are very expensive,  Most of the menu items cost between $6 to $8,  Lobster on the menu was $12.95.  If a dish of vegetables cost double of most of their menu items at $14.95, they should have alerted us to the cost,  More likely, they thought we would not notice the padded bill.  Also, during the meal, they dragged out dirty garbage cans while patrons were still eating.  Yuk!  Gross!!  I will NEVER go to that restaurant again!", "author": "Irene J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-23", "description": "This is not is not Szechuan food! The menu had no real Szechuan food in it; just Chinese takeout staples. I've cooked a lot of Szechuan food and been to several Szechuan restaurants. The name for the restaurant is misleading-there is neither \"Szechuan\" flavor characterized by chili oil and Szechuan peppercorns nor is there any \"taste\" in their food. \n\nThe scallop dish had tiny scallops and no flavor. The heap of broccoli that made up most of the dish was bitter. The potstickers were really doughy. I'm glad we didn't order any more food. It was mostly bad broccoli and water (soup broth had no flavor). \n\nThe restaurant was freezing and the door didn't close properly, letting in an ice cold breeze. All of this would make a two star restaurant, but the service is what really brings it down to one star. The waitress was clueless about the menu, and it took us forever to get a check even though there were four waiters and only two other parties. I went up and asked for the check. Then, I had remind them ten minutes later.", "author": "Sutee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Very Authentic Chinese/Cantonese food, big portions- probably one of the best priced Chinese restaurant. Have not been here for a long time, still similar style, dish started at $5.95. People are nice, setting is pretty simple. Food came out little too salty - next time I am going to tell them.\n\nNot sure why the English name is not remotely similar to their Chinese Name 长江客家饭店", "author": "Tao X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Great take out!\nFried fish, lobster yee mein, lamb clay pot, double fried sweet sour pork ribs", "author": "PreciousSwt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "I absolutely love this place! Not only is it reasonably affordable, the portion is worth it. My family usually like to come here for special occasions. We had recently come here for my grandma's birthday. But 2 weeks before that we came for my cosmo license celebration.\n\nMy all time favorite food in ANY restaurant that will never grow old till I die, is calamari. But I'm very picky with how I would want it battered and fried. This restaurant definitely does not disappoint, let's just say that much. \n\nAnd am I the only one that finds their fried rices addicting? I prefer it so much more than regular rice. I mean who wouldn't? More for less!\n\nAs much as I would love to come here as often as I'd like, I think it's better to go with a group of people rather than just by yourself. And I believe it's more fun with more people cus you get to order more food and try different things instead of a few plates. That's just me. :)", "author": "Sadia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-19", "description": "Picked this place at random when hankering for a quick Chinese dinner.\n\nService was perfectly fine, in the typical curt Chinese restaurant manner (e.g. they brought a water glass, but they weren't going to refill it without being asked0, bathroom not at all appalling, unlike other reports here.\n\nKung pao beef was Chinese country style: large chunks of meltingly tender beef and crunchy veggies.  My only disappointment was the seasoning.  Though quite spicy, this was achieved mostly by loading it with chili sauce which left it with an oddly sweet and sour effect.", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-06", "description": "I ordered a to-go over the phone and they picked up prettt quuckly. The guy on the phone spunded grumpy and didnt seem to be listening.  As i ordered he kept talking about some other food items than the ones that i mentioned. And then i kept asking bow many food items i ordered and he said 2. I clearly repeatedly told him 3 mongolian beef over rice and a a beef chow mein. Then after i said \"Okay\" he hung up on me without asking for my name.\nSo i get to the restaurant and its conpletely empty. Nobody there. Some people are looking at the menu outside but they just walk away. I go in to ask for the food i order and they say they didnt have an order for 3 beefs and a chow mein. They had a chow mein and 1 beef. \nI realized that the guy on the phone wasnt listening and gave the wrong prder. Plus this place stunk real bad", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-04", "description": "My brother in law had recommended I give this place a try since I had usually been going to Ming's down the way for lunch.  Apparently the food quality here is better, they give bigger portions, and the prices are the same all day and night.  Well, all of the above were true except for the prices...they're actually lower here!\n\nI ordered the salt and pepper pork with rice and that included a really hearty soup.  There was lots of carrots and potato in the soup and it definitely had better flavor than Ming's.  The pork had a lot of meat versus fat, but was covered in a ton of MSG.  I don't mind the stuff, but I think they could have reeled it in a bit.  They even offered some juicy orange slices for dessert!\n\nWhen the check came, I was a bit shocked that the price came out to only $5 with tax and everything.  This was definitely a bargain and for slightly better everything, there's really no comparison.  As a place to grab some greasy Chinese food, Szechuan Taste is great.  The restaurant itself isn't very clean (better than it used to be), but don't forget to wipe down the dishes.  It can get kind of gunky.\n\nFood: 7/10\n\nService: 6/10\n\nPrice: $\n\nAtmosphere: 5/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "It has been here for many years though the owners have changed from a senior lady, to a younger guy, then to current mid-aged man. The food is getting better and improved, at an economic price tag, suitable for casual, family and close friends dinners. Recently, I found the lobster on noodles is very tasteful, plus a few other veg dishes.", "author": "Cz C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-25", "description": "Mediocre. Skip this place. \nFood is not very good. Bland and not fresh. \nBeef and chicken was chewy and tasted a few days past its expiration. \nServers clearly favored certain customers (friends) because they were treated better and were given peanuts before dinner that not everyone else got.", "author": "Stormtrooper N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "A family favorite! that is before they changed management....\nI've been coming to this restaurant forever! I'm a little sad to see it go down the drain in terms of taste/proportion/atmosphere. READ BOTTOM REVIEW (it's more current(\n\nPRIOR TO 2012 MANAGEMENT CHANGE - The food can be a little salty at times...but it doesn't matter because the food is still delicious and the portions are plenty! It can be a little dirty at times; flies will be flying around, or some leftover food might be under the table, but I would DEFINITELY recommend this to anyone. The lunch specials are great and affordable and is a for sure place to eat for some decent Chinese food. We usually order Mongolian beef, Spicy tofu with shredded pork, saute green beans with pork, spinach with pork, and usually alternate between saute eggplants with pork, claypot chicken, and steamed eggs (see the specials menu)\n\nPOST 2012 MANAGEMENT/CHEF CHANGE - All the dishes were extremely sweet....tasted like a lot of MSG! It was really shocking to find out the chef had changed. I was disappointed because even dishes that are supposed to be spicy, ie the Mongolian beef has become a grossly sweet dish.  We ordered the stuff we always do and almost all of the dishes had shrunk significantly in proportion and the taste was just OFF. I used to recommend this place but now I'm not so sure.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-07", "description": "The food was OK.\n\nThere was something terribly wrong with one of the dishes though. I believe it was Mapo Tofu. I ate it, and something STANKED. \n\nI thought maybe it was the bamboo since I always felt bamboos had a peculiar sour taste I was not used to. But, no. I tasted each ingredient separately within the dish and pinpointed the stank. The sour and rotten taste was from the tofu. Did we order stinky tofu? Oh hell no. \n\nBut, thankfully they refunded the order once we notified them.\n\nFYI, the male waiter seems like he worked there for a while, so he has this 'whatever' attitude when taking orders, etc. It seems like all of them have this 'whatever' attitude. So, don't expect to recieve a quality 'service' treatment, but they'll do their job alright!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-24", "description": "I use to be a regular here. It's tough to beat the taste and value coming out of this grimey Chinese hole in the wall. \n\nSalt and pepper pork chop\nHoney walnut prawns\nEtc. \nEverything usually tasted really good.  \n\nMy go to dish would be their salt baked chicken. It would come with steamed boy choy. One time, well actually the last time  I went to eat one of the bok choy leaves and then I saw a white little maggot or grub wiggle out. It squiggled from in between the leaves and then onto my plate. \n\nI didn't yell. I didn't scream. I didn't even call the waiter over. I wasn't even upset. I just put a couple dollars on the table, got up and left.   \n\nI haven't been since and it took me about 3 years to step into another Chinese restaurant after that day. Til this day, I carefully wash in between each bok choy leaf when I'm cooking it. \n \nThe foods good, the food is cheap, just watch out for the maggots. \n\nIf you don't believe me. (http://tinyurl.com/3puhoe8)", "author": "Earl G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "My review from like five years ago must have gotten deleted. =/ I wanted to update it to drop the rating since they changed owners last year, but now I feel nostalgia for the old 4-star place... Super cheap authentic Hakka cuisine, packed with families and Cantonese gangsters, giant Dungeness crabs $5 a pop... yeah, no longer. Prices are still relatively cheap, but it's a ghost town, even during prime time dinner hours.\n\nMy Chinese Vietnamese auntie took me here first in 1995. Food was awesome. 100% Chinese patrons. And then the SF Weekly reviewed it and then the lines came. Fast forward a generation.\n\nThe current owners changed the menu, even though maybe 90% of the dishes are still the same. However the attention to detail and quality are lacking. Now if you're a sweet and sour pork and chicken fried rice kinda guy, you will have no idea what I'm talking about and this place is fine. It's better than Panda Express, absolutely. But for everyone else, I'd pass.\n\nOut of a dozen dishes I've tried since the change in ownership, the only one worth writing about is the beef tendon wonton noodle soup. Solid broth. Beef properly slow braised for hours. But there are better Chinese beef noodle soup places in and around the Sunset.\n\nSad. I don't think I'll ever go here anymore. The end of an era. Queue up some Teresa Teng.\n\nOh. And almost forgot to add: one of the creepiest bathrooms of all time. Not \"ew, a cockroach\" kinda creepy. More like \"flickering yellow light and deep shadows and pale faceless Asian girl with super long hair hanging upside down from the ceiling on all fours with her head spun around backward\" kinda creepy...", "author": "Perci N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-14", "description": "I havent been here in the last year, but walk past it often.\n\nThis place is currently closed. \n\nIt was shut down by health inspectors on 8/10/11. The restaurant owners hope to reopen by 8/23/11 after \"remoding\".\n\nReason for immediate closure- Vermin infestation and food contamination. \n\n\n\n\nmakes sense cus the last time i got the poops from fried rice...", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-03", "description": "I don't recommend this place.\n\nWe ended up there since we wanted to get into the sushi place on the 19th and Taraval.  We were pretty hungry after walking, the place was right there and we decided to try it out.\n\n 3 out of 4 people in our party didn't like their food.  I ordered veggies with tofu and tofu looked kinda gross.  The dish was tasteless and then I realized that they didn't even mix the garlic evenly.\nMy husband ordered some kind of chicken dish.  These were pieces of chicken as they come, with cartilage and other unknown stuff.\n\nIn other words, I am pretty sure I am not coming there again.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "The food was beyond excellent here. Better than the one at Szechuan Vallejo! It was tasty and chicken was crispy! Only down side was the bathrooms. The bathrooms were not sanitary what's so ever!", "author": "Larry W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "I ended up here because my family habitually eats at these cheap Chinese restaurants with subpar ambiance usually related to the level of cleanliness but not to the degree of filth this place is associated with. This is the last time I will come here.  I'd rather starve, and if you know me, that is a big deal. LOL  I really don't give a damn how awesome the food is for dirt cheap.  You don't have to sacrifice a clean atmosphere for yummy and cheap.  It makes you wonder if the chef picks up a piece of meat off the grease stained floor and throws it back in the wok.\n\nSzechuan Taste is exemplary in depicting the typical mess of clashing colors, disorganized composition of beautiful Chinese artwork and taped paper menus on the walls that seem to plague the interiors of Chinese restaurants in general.  Oddly enough, there were no pink table cloths, but alas, they worked it in the scheme with the other purple and silver paper lanterns dangling from the ceiling.  Someone must have been seeing black and white with the hunter green tablecloths, red chairs and striped red carpet under the pastel colored lanterns.  Ahhhh...the carpet...  The stale, putrid scents captured by this red devil are pretty much what hits your nose as soon as you walk in here.  This leads me to the final nails in the coffin for this place.\n\nSince, I decided to keep my mouth shut about coming here, I politely placed my head in the sand and decided not to read the Yelp reviews.  That was a prudent choice.  However, after lunch, my stomach churned after I read about the closing of this restaurant by the Health Department due to vermin a couple years ago.  Then, there's Earl G. who found a maggot in his bok choy.   Nice.  It really makes me wonder what the hell has changed here.  I've eaten at cleaner restaurants in China sitting outdoors in a dumpy city called Kaiping!!  \n\nNew management must be a joke.  Last time we sat in the middle away from walls.  There is less to notice there.  There were also no aggressive flies. This time we sat in front of the store front window.  I turn towards the window to cast my eyes on dust and dead bugs near the seam where the glass front meets the shelf.  *shutter*  - blow number two to my appetite after the foul smelling carpet!  There was one dirty plate and a dirty spoon we had to send back.  Yes, it continues. Time to eat off my chipped plate!  Our steamed rice arrived in a plastic container stricken with third degree burns.  Yes, our rice pot was deformed.  I had to keep from laughing when I helped myself to some rice.  Yes, it gets better!   Enter the horror of the restroom.  Wow, it looked like a guy had got hold of a fire hose in there if you know what I mean.  I need not expand on the ghastly conditions of this restroom.  I was holding my breath as long as I could and gasping for air after exiting this cesspool.\n\nAs I end this review, I am no longer hungry for the snack I intended on reaching for prior to this review.  The reminiscence of my experience yesterday has taken a second affliction to my stomach.  I hope the Health Department pays this place a visit.  I know I will never again.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "It is a very nice restaurant and I enjoyed it very much. I thought they gave great service they were very generous and nice to me and my friend. I was surprised at the end of dinner that they even handed us free watermelon!! I never noticed how good watermelon is after Chinese food. I also asked for chopsticks and they gave me wooden chopsticks as well how kind.", "author": "Trevor C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Definitely very different variety of food from a typical Chinese restaurant but I was not terribly impressed. Our family came on a recommendation so my expectations were a little high and it just did mot meet them. Overall flavors are pretty good, especially all their fried plates but their meat leaned on the chewy or tough side which I am not a fan of. But like I said, they have some unique plates if you're down to get a little adventurous and they arent supet packed on the weekends. \n\nTheir service though is a 5! Waiters are very friendly, give solid reccomendations, and are quick to attend to your table.", "author": "Christine J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-27", "description": "Very Cheap, low quality, big quantity (but tasty) food. They put a LOT of MSG so if you're a fan, this is the place for you. I ordered shrimp and egg fried rice and I have to say it tasted pretty good, but the shrimps were not cleaned properly. I also ordered fried squid for $5 that is good but again, lots of MSG. \n\nOnly go if you don't mind not so clean environment. (It's not very bad, but it's definitely less clean than other Chinese restaurants)", "author": "Erick K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-03", "description": "Place is a hit and miss. The service is horrible. The place isn't very clean. The food is cheap and decent compared to the price. \n\nPlace is not a good place to bring if one is trying to impress someone. It is only good for people who are hungry and want their food fast.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "I base my 4 star rating entirely on the food and nothing else. For this reason I recommend ordering from this restaurant TO GO. (otherwise I'd knock off a star or 2 because the restaurant itself doesn't appear very appetizing... Ive been ordering from this restaurant for many years (since i was a kid) and i have yet to find its equal in regards to freshness, tastiness and overall satisfaction. \n\nChicken Chowmein- i prefer hong kong style where the noodles are tiny and served dry with \"gravy\" thrown on top. By the time you get your order most the noodle are soft soaked and delicious. The regular style is really good too.\n\nFried rice: all variations (chicken, bbq pork, shrimp etc) are delicious. Rice is never over or under cooked and never bland. \n\nBrocolli beef over rice: yummy.\n\nCashew nut chicken: Yums.\n\nBlack bean chicken over rice: Yum.\n\nI really have never ordered anything I didn't like from here. The only help they could use would be a cleaner venue. To Go solves that issue though ;)", "author": "Kristy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-05", "description": "Awful.  The beef tasted like it was cleaned with ammonia before cooking.  It's soft but not the consistency of beef.  More the consistency of slime.  Stay away from the beef.  Meal was way too expensive for a small portion.", "author": "Koa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "5/2/15 Loved this place, gave us soo much food we had more to take home than we ate at the resturant! Nice friendly staff, clean, and very tasty! I will return!", "author": "Kim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "small restaurant with great lobsters and sea food. Don't bother order the meat lol", "author": "Oliva L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-01", "description": "I have been eating here since I was a little kid. They really cleaned up their place over the years and due to the complaints about their restroom. I usually order their beef chow fun and salted pepper pork because it's the best here. The service is quick and it doesn't hurt my parent's wallet.\n\nI took my parents out for lunch here last month and ordered a huge amount of food. It included having shark fin soup which was pretty tasty, considering it's at a restaurant and prepared in advance. Also another good dish is their deep fried chicken served with prawn crackers. It's definitely not complete without steamed crab w/ ginger & green onions. Top that off with walnut prawns. Yes we were so full after eating all that food!", "author": "Tim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-10", "description": "Chicken chow fun. That's chicken??? Noodles way too oily. First and last time here, probably.", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-09", "description": "Food was greasy so I had to blot it with napkins. The pork belly with pickled greens was the only thing I liked! My dad likes going here for lunch with his coworkers but I would not choose to come here again. The food is cheap though!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "Lobster noodles are very well portioned and tasty.\n\nSzechuan scallops were also really tasty. Good sauce.", "author": "Sharra C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "My gf and I stayed at our friends' place who live a few blocks up the street on 19th and we were looking for a bite to eat nearby.  It was good, and I would go 3.5 on this one, closer to 3 than a 4 tho...erego the rating :)\n\nPretty much your typical Chinese food restaurant; serves family style dishes, although there are combo plates available.  The sizzling rice soup (which is actually listed as \"zizzling soup\" on the menu =p) wasn't the best according to the gf.  But it was the first time I'd had this type of soup, and I have to say it was a little bland.  The deep fried salt and pepper prawns were very much to MY liking, but on the saltier side, which is pretty much how I like it.  Ordered 3 dishes and rice, so it was more than enough for 2 people and was less than 25 bucks.  The food was decent, and fairly priced, so nothing to complain about there.\n\nThe place got pretty busy shortly after we got seated, and there aren't many tables that accommodate just two ppl, and we ended up sharing a table w/ another family, but it wasn't a problem to us.  And we did find out that there was a back room, so I'm not sure how many more people can be served during busy times.\n\nWe walked here, but there isn't any parking around except for on the street, and the neighborhood, so good luck with that.\n\nService - it was what I expected of a typical chinese restaurant; not overly attentive to you, but you get what you want, you just gotta ask.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Went here the other day to have a family meal.  The service was quick, personal and attentive.  It wasn't great, but they made jokes, were able get tea and rice quickly and we're all around friendly.\n\n The food was good - really good.  Not great but not below standard.  It was good, edible and warranted payment.\n\n  We had the fixed price menu for 8 people and they were super nice by giving us extra portions and substituting certain items since they didn't have what offered in the fixed price menu.\n\n  The rice was good and I'm always happy when I get good rice.\n\nBathrooms could use work and it's a shame that the lack of ambiance takes away from the charm - but it's your usual rundown chinese shack that serves a good meal when needed.  To me, that's just enough\n\n  will def come back again and again.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "I've been eating here for over a decade. Constant key points summed up from the reviews I've read:\n\n1) Chinese food served quick\n2) Rock bottom prices\n3) Grimey hole-in-the-wall location\n\nNow let the expert elaborate...\n\nI think the food is off-the-hook!! The seafood tastes fresh, all items are non-greasy and made to order, and there are always HELLA chinese people eating here when we come for dinner, which is a GREAT sign. BUT... it's the atmosphere that you have to tolerate. Super crowded, noisy, mediocre service, flies, and the water tastes like toilet, just to name a few. But it's that exact atmosphere that makes me unreserved, and I feel comfortable putting my hair in a ponytail, rolling up my sleeves, and digging in like an inmate just released from prison.\n\nWe usually get the already-set menu that has like 15 entrees, including soup, fried rice and dessert. You can eat your heart out and we ALWAYS leave with leftovers. The famz and I usually come here with 30 people and occupy 3 large round tables. It's budget friendly and excellent for large groups. We've celebrated 1000000000000 birthdays here, and never been charged a cake cutting fee.  \n\nMy faves we always get:\nTofu beef soup\nSalt & pepper pork chops\nHoney walnut prawns\nCalamari\nFried chicken wings\nFried wontons\nRoasted duck\nBBQ spareribs\nBroccoli beef\nBaked Oysters\nFried Crab\nDeep fried flounder\nSalt & pepper Shrimp\nLobster (in-shell) with lobster sauce\nClams with black bean sauce\nAnd some type of vegetable dish...\n\nThis is my spot year after year, after year, after year, after year. I've liked everything I ever tried here.\n\n5 stars for the food. Subtract 1 star for the flies.", "author": "Joraine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "Their food is pretty good and fairly priced. Decent portions and wait time for a to go order is quick and simple. Friendly staff.", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "I work for a dental office nearby and often need a something quick and inexpensive.  The lunch is special is only $5, with a very decent portion.  My order is ready in 5 minutes everytime.  The food is pretty fair and tasty.  The crispy noodles are great.\n\nHowever, I dislike how durning lunch time, if you dine in, you may have to share a table.  I decided to have a sit down lunch with my co-worker, and they had us share this big round table with 4 other because it was crowded.  We decided to go to elsewhere after that.", "author": "Roadrunner G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "I just want to write a review about this Chinese restaurant.  We have been there numerous times, for lunch as well as for dinner.  No matter which day or time of day, we were not disappointed to having a satisfying meal.  We didn't have to drive because just riding the L-Taraval to 19th Avenue; it's just a few steps away from the place.  It's one of the bright spot to eat at this restaurant, very convenience and not having to find a space to park our car.  We have nothing negative to say about it, the staff, or anything.  There are photos about this place already, so you know about it.  Bottom line is you will not be disappointed if you should eat here, no matter if it is for lunch or dinner.  We'll be back, again.", "author": "V, G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-27", "description": "I got kung pao chicken. It cost $5.80 after tax for a big container of food. It tasted okay. Maybe I will return and try something different. Maybe I won't. Maybe I will.", "author": "Duncan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "Rick wanted to come here for his birthday lunch, so we showed up about 1:30 and had no problem getting a table big enough for four persons and a load of presents.\n\nWe had Salt & Pepper Prawns, Honey Walnut Prawns, Mixed Vegetable Chow Fun,  Shrimp Fried Rice, and Spinach w/Water Chestnuts. Steamed rice for me, and a Diet Coke, and tea all around. $40, and we were stuffed!\n\nPassing us on the way to tables with more adventurous eaters, the fried fish looked great and so did the crab. I'll have to go there with someone else to try those things!\n\nThe food's good, the bathroom was clean, and so were the table tops.", "author": "Gretchen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-25", "description": "A NOTE TO THE PUBLIC\n\nThere are hundreds of these Chinese restaurants that lean towards \"hole in the walls\" in the city of San Francisco. Here, you will find that portions are huge, sodium content high, food delicious, service relatively low, zero to negative appeal atmosphere, BUT prices low as well. You do not come to these places for a \"dining experience\", you come here to eat for cheap.\n\nList of things NOT to expect:\n\n- Your waiter bring you water, or ask you what you would like to drink - TEA is the given\n- Your waiter to speak English\n- The bathroom to be clean\n- The restaurant to smell good\n- The kitchen to be sparkling\n- Your waiter to package your food up for you (seriously Mariela?)\n\nP.S. I can't tell you how hard it is to take a reviewer seriously on said restaurants when the review is based on kung pao chicken, sweet and sour pork, and fried rice. Just saying.", "author": "Kris Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-14", "description": "I remember 20 years ago this place used to be packed and served good cheap chinese food.  I can remember lines out the door with mostly chinese customers (always agood good sign of a good chinese restaurant).  I went in about two months ago and except for a coat of paint the restaurant was basically unchanged.  It was a practically empty for dinner on a Thursday except for a Caucasian lady and her hubby (me).  I ordered the sandab, orange chicken and tofu with veggies.  The sandab was decent and i liked the black bean sauce that was light spread over it.  The orange chicken was literally 80% batter and fatty bits of chicken.  The tofu veggie was overly starched and way too gelatinous.  The tea cups were covered with lipstick and everything felt sticky.  I guess you could say my immune system was getting a nice work out.  The service was cold but efficient.  This restaurant is definitely a shell of its past.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-20", "description": "This review is gonna be one mixed bag of jelly beans. I like giving each restaurant 5 stars and deducting as I go on....I hope you're ready to do math!\n\nI 'splain...\n\nFirst impressions at restaurants, are usually indicative of what the rest of the experience will be like. When we walked in, I smelled crab. I don't mind the smell of crab when I'm eating it, but not when I walk in the door. MINUS ONE STAR!\n\nMost of the patrons were Asian, which I've been told is a good way to gauge a Chinese restaurant's authenticity. PLUS ONE STAR!\n\nWe were seated next to the register, and had the joy of overhearing everyone fumble over their to-go orders as they walked in to pay. Not to mention the constant CLING of the cash register. MINUS ONE STAR!\n\nWe kept having to swat flies away as we ate. MINUS ONE STAR!\n\nMost of the dishes on the menu were under $6. PLUS ONE STAR! \n\nWe went with the standard, non-adventurous dishes, as my husband likes to stick to the basics:\n- House special won-ton ($5.00): Included scallops, prawns, squid and of, course, won ton and bok choy. Broth was tasty, not too salty, and the seafood wasn't fishy tasting, despite what the smell in the restaurant would suggest. (photo: http://www.yelp.com/biz_photos/QgqIK87dhpxHecvTuursVA?select=tYv4BgqdekUlGuNGWiOcmw)\n- Sweet and sour chicken ($6): I normally HATE sweet and sour anything, but the chicken came out crispy, not soggy. the accompanying pineapple, green bell pepper and onions were crisp and fresh too. (photo: http://www.yelp.com/biz_photos/QgqIK87dhpxHecvTuursVA?select=quGApl7LskNWH_3yjczVoA)\n- Shrimp fried rice ($4.50): Generously portioned with lots of fluffy egg, tons of prawns, peas, carrots, etc. Perfect. (photo: http://www.yelp.com/biz_photos/QgqIK87dhpxHecvTuursVA?select=RcSp37-xriCGjZ6bQqSghA)\n- Vegetable and beef chow mein ($4.50): Very greasy, albeit tasty. I'd skip this next time. (photo: http://www.yelp.com/biz_photos/QgqIK87dhpxHecvTuursVA?select=ADZh-IYwY9WOM1lGm3GNNw)\nTotal bill: $26 including tax and tip.\n\nWe had tons of leftovers. Too bad our server didn't pack them up afterward. He just dropped off the to-go boxes and walked off. Sigh. Do you know how hard it is to pack sweet and sour chicken into a tiny to-go box without getting juice all over your pants? This sucks.\nMINUS ONE STAR!\n\nBottom line: 3 stars. Food was good and prices were dirt cheap, but service was almost non-existent.\nBottom line: As a to-go place, they would be a solid 4 stars.\nBottom line: They could use some Fabreze and some fly traps. \n\nThat is all.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "Food was pretty good. Ordered Hong Kong style lobster, rice with shrimp and scallops, and Kung pao beef. Lobster was the best dish. Service was a disaster. I'm a white guy and they definitely don't provide me with the same service they do for everyone else. They have free soup that everyone automatically gets on their table, except us. I tried asking for it and the waiter would recommend other soups saying they are better but we have to pay for it. I told him I wanted the free soup and then he finally said he would bring it. Same for oranges and the end of your meal with the bill. Can't say I felt comfortable, but the food was decent. Not sure I'll come back again.", "author": "James L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-29", "description": "It's been a decade since I was there, but I still remember this place.  It's fun to watch the different letters of their sign fall down.  Each year it looks different.  \n\nDamn.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "Real chinese food for real chinese people.  \n\nIt's cold inside, the cooks don't wear those chef's hats (or even a hair net for that matter), and most of the waiters don't speak much English.  But if you want comfort food ... as in you are Chinese and comfort food to you is the authentic stuff, then this place is pretty darn close.  If you can't read the menu and you can't read the stuff on the walls, then you really ought to bring someone who can.\n\nWe ordered too much food ... because it was all just too inexpensive not to.  The Szechuan scallops were cooked perfectly.  I didn't even mind digging thru all the onions to get to the generous portions of scallops.  (None of this $24.99 for 4 scallops that after you share with your dining companions, you're left with barely a taste for yourself.)   The claypot mapo tofu is a must as is the salt and pepper pork chops.  We also ordered a steam fish which was very fresh albeit a tad undercooked.  Stay away from the pot stickers unless you like the ones with the really thick skins.  \n\nService was solid.  Food was delicious.  Leftovers saves you money that you can later spend on drinkies.", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-17", "description": "I've been eating at this restaurant since I was 12 yrs. old and this place still has that good authentic taste.\n \nTheir Hot & Sour soup is pretty good, not watered down like at other restaurants. Along with my favorite, the Salt & Pepper Pork Chop that can also kill, but can not resist. Their Honey Walnut Prawns are pretty good here too.\n\nNot forgetting to mention their rice plates here are really cheap that will leave your wallet and tummy satisfied.\n \nMy suggestions...  for brunch order their Scrambled Egg w/ Prawns over Rice; they cook my eggs just the way I like it with no questions ask, FULLY COOKED! Also, for dinner their Salt & Pepper Pork Chop over Rice, it's quite a portion and it never fails!", "author": "Johanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "A few days ago while trying to decide what to eat for dinner, a friend chose Szechuan Taste. I said I wanted Chinese and after given the choice of dumplings or Szechuan, I definitely wanted Szechuan. \n\nFor the prices and quality of the dishes, I give this place a 4. The dishes are all pretty cheap - most of them around $4.50-$8.50. The dishes here are also pretty good - not the best, but good tasting and very comforting.\n\nBetween 3 of us, we ordered a whole Fried Fish (I think the slab), House Special Tofu, and Shrimp Fried Rice. The Fried Fish was really good - crispy, tasty, and complimented very well with the accompanying sauce. I also really liked their House Special Tofu - Tofu was good, sauce was delicious, and I liked the combination of toppings that came with it - seafood, pork, etc. Fried Rice was really good and prepared the way I like my fried rice - light in color, right amount of saltiness, and very tasty.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-28", "description": "I have been coming to this restaurant since I was a kid!\n\nI used to eat here a lot with my family but nowadays I come here for takeout. The portions they give you is definitely a great amount for the low price. Plus their service is quick even when the restaurant is packed.\n\nMy favorites to order with rice is the string beans with rock cod and the pork with spinach.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "For the price and value of the food, this place isn't so bad. I can't say this is the best Chinese food ever, but it'll satisfy that craving for sure. \n\nWe ordered their beef broccoli, peking pork, hot and sour soup and snow peas with chestnuts. \n\nThe hot and sour soup was ok, not too much flavor going on, but had plenty of goodies in it. \nBeef broccoli was average. \nSnow peas with chestnuts was average. \nPeking pork- was slabs of meat, sauce was good. \n\nOverall, the prices were very decent and quality was decent. We ordered to go, food was made quickly. About 15 minutes or less.", "author": "Annie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "Great little whole in the wall place. We had a party of 8 and order a set menu with seafood and assorted types of meat dishes. All the dishes came out hot and the taste was fresh.Service was par", "author": "Jorm K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-22", "description": "i just stuffed my face here for about 10$ \ni had minced beef with snow peas and black bean sauce over white rice with an egg and some pot sticks.\nim lovin this hole in the wall\n\nthis place was packed and i believe i was the only non asian person in the entire restaurant which usually makes me think that it should be good.", "author": "JoseLuis A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-25", "description": "We made a reservation for two big tables for my grandpa's big 80 for 6:30 pm. We came here exactly 6:30 and found only ONE table available. When we asked the waiter why there isn't two tables ready for us, he responded \"It's because they came here first.\" What? We made a reservation. So if we came a minute late is the remaining table going to someone else too? They ended up clearing a table that's two tables away from the larger empty one that we had \"reserved\".\n\nDuring our dinner, we also noticed three other tables around us that are also together. They too, are separated. What makes this even more inconvenient is that those tables and our tables have children/teenagers. Throughout the whole dinner, our kids and the other kids were running into each other and around the tables. Sigh...\n\nThe food was okay but the soup tasted a bit fishy. Lobsters were good but too small and had little meat.", "author": "Sandy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "The restaurant isn't clean and the food is on the greasy side, but it tastes great!  I like the prices too, although they have been raised.  I recommend the combination fried rice, you get a large and tasty amount.  The Walnut Prawns are also good, though it is one of the few menu items that is small in size.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "This was one of my favorite places while I was attending college. For the price, the portions are amazingly generous, usually enough for 2 meals. The combination of price, portion, and taste cannot be beat.  They changed owners in mid-2012 but everything is still there. The reason for the 5 star is because I still make it a goal to go there whenever I'm in the area. If something can capture my attention so consistently, then it deserves a 5 stars in my eyes.\n\nBest meal on a budget you'll find anywhere in the city. FYI, I usually order to go.", "author": "Pullse P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-30", "description": "Some pretty good Chinese food in the Sunset.\n\nTheir foods hold that authentic Not-Panda-Express taste, and their take out doesn't lack the taste. I always order take out from here and pick it up, but those waiters...\n\nI went with two of my sisters the other day to pick up a couple boxes of barbecued meats and the like, and those HK waiters just looked us up and down. It was totally obvious too - their heads really moved up and down. We were kind of offended by that, I mean, gee-thanks, you think we look good, but we want our food! You can hear them talk about you too; geesh.\n\nAnyways, this place ONCE scared me to death with the cleanliness factor - you know that foil thing you use to scrub pans? It was in my shrimp plate. GROSS! I stopped eating here, but I came back because dude, it's freaking cheap and fast.\n\nOVERALL - Good luck trying to avoid this place, because with it's price and greasy Asian foods, you'll end up coming back...", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "I came here for lunch one time with my grandma.  I love days with grandma....I've always wanted to try this place.\nThe place was pretty crackin at noon. \nI looked at the menu and was shocked at the prices..so cheap! We ordered sooo much and took most of it to-go because the portions are huge!\nThey put a lot of sauce on each place and it's delicious.\nIf you're in the area, definitely check it out.\nBest part??...Grandma paid for the bill and it wasn't expensive. :)", "author": "Lana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-19", "description": "A place that reminds me of the Asian restaurants that my parents would bring me to. Not the cleanest restaurant but decent food and it doesn't break the bank.", "author": "Ehau S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-17", "description": "I've been coming here for as long as I could remember. I used to love their food. The prices are affordable, and it comes with large portions. Since I came here so much, I notice how differently their food tastes all the time. I came here last week, and I've noticed that they started to add carrots into their fried rice (haha i know), but that isn't the point. The point is, the food here isn't as good as it was before. It's very bland. I see oil blotches in the chow fun I order. Too much oil in every food, except probably the soup. Oh, btw I lovelovelove the seafood with bean curd soup!", "author": "AJ C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-03", "description": "Still trying to get the Szechuan texture and taste out of my mouth.", "author": "Russell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "This place is one reason I need to be closer to SF. I have been coming here since I was young and the food has been consistently good since then. And its cheap which makes it all the better. Come with a group so you can eat more of a variety. The salt and pepper pork is a good combo of the saltiness with just the right kick of heat. So is the pork belly with preserved veggies. The lobster chow mein should also be on the list. They don't skimp on the lobster. What am I saying, it is all good and makes my tummy a happy tummy.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "Salt and pepper pork. Even though its got lots of msg, I love it. I dont know what it is with salt and pepper, its just so good. \n\nSuper affordable, simple and fast service. If I could come here every week I would. For the money, nothing beats this place.", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-18", "description": "This place is not bad, but its not all that great. They have pork blood with green chives which I love. My uncle said a few days ago, he ordered it and they didn't give him green chives. Its funny because green chives are what make that plate cost money!! haha. They were understanding and gave him a discount. \n\nThe preserved vegetable with fatty pork is my sister's favorite. I don't really care for it, and I found this one to be a little too sweet?? (weird) \n\nThis place should be 3 stars but when I ate the fish with tofu, a piece of fish had so many bones! GROSS. I know fish have bones, but when you make that dish, you'll rarely ever have bones. I know sometimes they forget one... but it wasn't just one bone.\n\nThe dessert soup was also brought it down to a 2 because it was disgustingly thick and chunky..\n\nIf you want Good Hakka Cuisine, go to Dragon River on Geary.", "author": "Derrick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-20", "description": "My roommates and my go-to place for quick and friendly Chinese food to go.\n\nThem: Ho chang go?\nUs: gives them our order.\nThem: OK, ten minutes!\nUs: walking down, ten minutes later, plastic containers filled with goodness.\n\n:) mm hmm.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-19", "description": "I waited a few days before writing this review, because I wanted to calm down a bit. But it didn't help. This was easily the worst meal I've ever paid for. My friend ordered a rice dish with mushrooms and chicken, mine was pork and spinach. \n\n1. The service was bad. I tried to ask the waiter about the dishes, but his responses were more Chinese than English and I honestly didn't know if he had answered my question... and he didn't seem to care. He never came to check on us, and never brought us water.\n\n2. The place was dirty. The tables and menus were sticky and gross. There were dead bugs in the bathroom, and when I glanced into the kitchen on my way, I was completely disgusted. There were bugs flying around, it was dingy, and there was some random big fish swimming around in a dirty tank by the door.\n\n3. The food was un-edible. Specifically, the meat was chewy, and had pieces of (I kid you not) things that did not look at all like meat in them. My pork looked more like head cheese than pork, and my friend's chicken was squishy. The rice wasn't even good... it was normal American rice, not even good Chinese rice.\n\nWe ate the rice, some of the vegetables, and left hungry. It was AWFUL.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-04", "description": "Got take out here a few times... One of those, \"not very good food, but good for the price\" types of places. \n\nThe dishes tend to be very \"saucy\" and not too flavorful, but I still eat there, so I suppose that they're doing something right.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "I have been eating at this restaurant for a few years now and i still love it.\n\nthe combinaiton fried rice is amazing and it very cheap.", "author": "Alicja D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-21", "description": "standard CC (cheap chinese) dive.\nwinners - salt and pepper pork chops, \nmongolian beef\nkung pao chicken\ndeep fried flounder\ntofu beef soup\nmost of it at very affordable prices.\ndefinite dump if you want to dine in, \nbut good call for take out.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "Cheap, yummy Chinese food. Most of it is pretty good though some dishes are better than others. But every place has their specialties, right? \n\nTypical hole in the wall Chinese. \nBut you know what they say, you want to go to the place that is filled with Asian people, not non-Asians, because if the Asians are flocking to it you know it's either good or cheap or both.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-28", "description": "Yeah sure this place is great value and cheap, but so are Mickey D's, Taco Hell, and Jerk in the Box.\n\nFirst thing, does this restaurant have a serious case of geographical and regional Chinese identity crisis? The English name is Szechuan Taste. While I have only been here once, I don't recall there being any authentic Sichuan/Szechuan dishes here, and unless they used Sichuan peppercorns, you can toss Tobasco sauce on fried rice and hope nobody notices. \n\nThe Chinese name of this restaurant, ironically is Tsang Jiang Hakka in Mandarin or Tseurng Gong Hakka in Cantonese (TK referring to one of the more famous rivers in China, and of course Hakka referring to a tribe of family oriented migrants that eventually settled from the North into the South of China, including Canton Province, and many emigrated to Taiwan, particularly Hsin Chu in SW Taipei County and developed many superb unique receipes and flavors not found anywhere else). Hakka cuisine and Sichuan food are two completely different things.\n\nIf this place offers Hakka Cantonese style food, I certainly don't see the connection here anywhere. Maybe really poor stripped down versions, or a tease of the real thing but substituted with grease, MSG, salt, canned materials, all hoping that you the budget minded gourmet, might not notice, know, or even care (do you really?)\n\nMaybe this place might work with non Chinese diners, or those whose tastebuds have been so dumbed down that they are complacent with these kinds of places (similar to 8 Immortals much further down the block, for cheap ok value but not necessarily refined Cantonese). There certainly are more Cantonese/Chinese restaurants on Taraval, that likely offer better quality for bargain values. Definitely no need for me at least to come here.\n\nBut the best and most ironic part is that years and years ago, my ex's sister witnessed the most hilarious event here. A waitress running out of the restaurant, telling a customer \"hey you didn't tip!\". Embarassing enough that the budget minded Asian Cheapness customer (aren't we all) did not tip, but even more embarassing that a waitress had to remind this person. \n\nSome say a restaurant is only as good as your desire to want to work there. So would you take a waiter or waitress job here? Nuff said.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-20", "description": "As many other yelpers have said, the food here is cheap and mediocre at best.  You really get what you pay for here - service is ok, but the cleanliness is very questionable.  If this makes you uncomfortable, I highly recommend you go elsewhere.\n\nMy friends were celebrating their bdays here so they had dinner reservations for our party of about 20.  We were all seated promptly and the food was served in a timely manner.  My friend ordered about 13-14 dishes and portions were large, so I was completely stuffed at the end of meal.  Total came out to $25/person, which included several beers, tax, and tip.\n\nWe had soup, fried oysters, lobster, spareribs, walnut prawns, steamed catfish, fried rice, veggies, chicken, and several other items.  Nothing really stood out except the fried oysters - those were yummy!\n\nThis place is worth coming to if you're on a budget and don't mind the \"greasy chopsticks, sticky tables, and flies,\" as strength a. described.", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-11", "description": "***Really Important Update***\n\nLast 2 times I had some scary experiences:\n1. The Chow Mein has a 1/2\" peice of what looked like some kind of metal grating. I had to ASK to have them take it off the bill. Unaccatable. It was large and sharp.\n\n2. Some friends ordered the Chow Mein and another chicken dish and the chicken was pretty much raw in both. \n\nI cannot endorse anyone eating here until the health department does a check. Two times in a row is too much for me. Goodbye cheap fried pork in abundance ***sigh***\n\n\nThis place feels like a real Chinese Restaurant, where people who want real chinese food go to get it. Right down to the table in the back corner where they trim Peapod leaves and other Chinese produce in the open, to the numerous handwritten posters in Chinese advertising things I will never know about. \n\nI haven't tried the whole menu, but the standout items I have had are: Spicy Salted Pork Spareribs, the whole steamed black bass, Chinese Broccoli with beef, and the Prawns in Lobster Sauce. \n\nI have to make further mention of the pork dish mentioned above. It sails above and beyond anything I have ever eaten that was simultaneously made of pig. \n\nWhen ordered (for 5.00$!!!!), one receives an OVER FLOWING white styrofoam box, steaming and mysterious. It's heavy, perhaps upwards of 2.5 lbs. \n\nOnce opened, your face is instantly engulfed in an warm, wet, billowing cloud of porksaltpepperfried steam that will literally make your knees momentarily buckle. Never have your senses come together in such a unified front, pushing you like never before, screaming \"EAT!\". \n\nThese aren't really spare ribs at all, they are essentially very large but very thinly cut pork chops. They are fried crispy, and then magically infused with black pepper and salt. It may not sound like much, but it really doesn't get any better than this. \n\nCrunchy, greasy, salty, tender, meaty. \n\n2-3 lbs. \n\n5$. \n\nAre you crazy?! Go get some.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-01", "description": "This restaurant was recommended to me by a selective Chinese friend who loves a good bargain.  He loves this place, and it's a destination for him and his family.  \n\nI agree that the food is tasty, but the couple of times I ate their food. I got a bad MSG headache.  I asked them to hold the MSG (and they said they would), but I'd guess they used it by my reaction.\n\nSo, I won't be eating there again.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-02", "description": "I'll give them a 2 for now, with hopes to raise it to a 3, in the fact that it may - in reality - be a perfectly cheesy dive (redundant?) with decent food!\n\nThe catalyst: Our hot-hot-hot Golden State Warriors are in the playoffs, I was in The City of my Birth (& a romantic one at that... but hey, I still get a bit choked up watching Karate Kid, when he has to ask Mr. Miyata to help him get \"balance\", when his leg is all screwed up). But I digress.\n\nSo I tried to have a few cold ones at The Boathouse... only to find that it is apparently out of biz? As tipoff was calling, I headed to a classic place... Shannon Arms, for a cold one, and some chatting with some good old Irish lads/playoff ball. The Warriors were HOT, I was HUNGRY, so what was I to do?\n\nNext door - on Taraval - is Szechuan Taste. Think Chinese Dive. I'm told its gotten a coat of paint, the menu is large, and the prices are quite CHEAP!! I ordered my Mongolian Beef (with rice), and was surprised when the bill was $4.50!!! And it was 8:00, not lunchtime.\n\nThe meat quality was OK, and it was SPICY HOT. I must admit that I can't give a lengthy review, as I'd had a few, I was tired, and I only has one item. I'll try them again. They also supposedly have some 'Hakka' dishes, which is a little subset or parallel universe to Chinese food, but I'm not Julia Child, esp. when we need to diss the Dallas Mavericks! Yes, yes, the M. Beef helped to restore 'my balance'! Humm, is that a triple entendre? Wink\n\nFor the younger crowd, on a slim budget, this place might be a true Keeper. And yes, the (young) waiters did have a seriously Chinese grunge haircut thing going. \n\nOther reviews also claim that their restroom facilities aren't the best. The place was pretty full, and since the customers were overwhelmingly Chinese, it gives me a further inkling that they might have something going there.", "author": "M Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "No 'lunch specials', per se, but OMG.... with over 20 plus dishes that run *under* $5 even at dinner  ($4.90 including tax!)  I'm not complaining. \n\nThey will also bring soup and rice, so it's essentially a lunch special in and of itself. \n\nBottom line: Good, cheap, lots of eats for minimal dinero. \nAs my lunches are limited to a whopping 1800 seconds these days, this place fits the bill, as long as i call in advance. They'll bring a wonderfully piping hot of tea, a loooooot of food for $5- enough to take home for at least 2 - 3 more meals, i promise. \n\nThis place was introduced to me by a friend who calls *Norway* home. Yep, random. \n\nI've heard the owners of this place also own China First Restaurant on Clement Street, but I don't know this for sure.", "author": "M'ia K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-25", "description": "Zero Stars.\n\nMy parents brought my siblings and I to this disgusting restaurant on a Sunday afternoon. I'm not sure if I can call this a restaurant, more like House of Rodents. Even the waiters were filthy. \n\nMy siblings and I left before the food came, I could not stand the environment. I might be harsh since I never saw a roach here, but it's pretty predictable. Believe me, the cheap prices will not be worth the psychological disorders after a meal here.  \n\nPlease be smart and don't eat at House of Rodents. \n\nIt even has a inspection score of 74! \nhttp://www.dph.sf.ca.us/eh/Violations/Loc_CurrentViol.asp?LocationID=2294", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-04", "description": "I can go one of two ways to review this restaurant, 6 pages absolutely bashing it, or a few lines voicing my disgust...I'll go with the latter.\n\nWorst meal I've had in years, truly.\n\nFood, Ambiance, Cleanliness, Service = 0 Stars\n\nSpecies variety in their fly collection = 5 Stars\n\nDon't waste your time here.", "author": "Dustin R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-21", "description": "CLOSE IT DOWN, CLOSE IT DOWN!\n\nso. i've mentioned before in my other reviews that cleanliness is an important factor in how i rate a restaurant. being chinese, i KNOW i should cut the chinese restaurants some slack, because let's face it, they will NEVER be well-known for cleanliness. never. ever. \n\n& so, i do. i cut them some slack.\n\nbut. this place is a different story. \n\nno matter how you look at it (from the side, upside down, under the table, through the glass door, etc), you will be sharing your food with what seems to be 13249230952039582 flies. yes. when i ate here with my family, i was repulsed. grossed out. and they had the audacity to zap flies every now and then with this electric contraption (NO IDEA what it is) while we were eating. made it seem like lightning was striking the restaurant or something. NOT a very good eating atmosphere for eating even crap.\n\nthe food wasn't that great either. \n\nplease, save yourself.", "author": "Betty T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "The ambiance is horrible, the bathroom's gross, the waiters (except Dennis) are kinda rude; but the food.. Man the food is amazing, fast, and the price cannot be beat!! Trust me, my family have been coming here for over 20yrs and they NEVER disappoint!", "author": "Eric T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-29", "description": "retarded cheap chinese take-out down the street!\n\nsalt & pepper pork chop is so big they can't even close the box!\nbiggest portion of pea sprouts I've seen too...\n\nif you're craving some cheap and easy take-out, this is your joint...\nif you're having a sit-down dinner, you'll probably be disappointed. it's not the prettiest or cleanest place in the world and service is \"ehhhhh...\"", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-22", "description": "This is one of my family's favorite Chinese restaurant. They're very fast - order your food and and expect something to come out within minutes. And no, it wasn't pre-cooked!\n\nI love their $3.50 specials menu. Crispy stuffed bean tofu, steamed stofu with shrimp, spicy egg plants, kung pao chicken, etc.\n\nOne of my favorite dishes is their deep fried sandab. It's hard to find deep fried sandab the way they make it here. If you like: fish, crispy batter and soy sauce, then you have to order this dish!\n\nThey also offer complimentary orange and either red bean soup or coconut taro soup at the end of dinner.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-07", "description": "It's cheap. They give a sh*t load of food. And the food tastes good. What else do you need? Maybe some tea because you might have a MSG headache after wards.", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-02", "description": "I've been here before many times, and usually I would have given this a 3 at best, 2 at worst... star rating.\n\nBut yesterday, after puking my guts up from the food, has left me to believe that you should, under no circumstances... come to this place. I understand some establishments are dirty. It's noted. But coming here, there was flakes of food on my dish, and the cups were sticky. The food didn't look that great, and I got sick from them. I had ordered some steamed egg with shrimp, some fired rice with scallops, steamed vegetables, and tofu with minced beef. Somewhere, from those dishes, I got sick... and I'm pretty damn sure it wasn't the fried rice or steamed vegetables. The minced beef sure tasted funny and the steamed egg with shrimp did as well. Maybe it wasn't clean or the workers in the back don't wash their hands, I'm not sure. \n\nUsually I let things slide if I just had an upset stomach, but if I puke, you're gonna get a 1 star.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "Service can be a little rough, but the food is top notch. Their shrimp and crab rank high among the finest i ever had.", "author": "Maisel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-15", "description": "Service - almost nonexistent but efficient enough\nAtmosphere - loud Chinese people, mostly tai-shan like the staff\nFood - good authentic greasy food\nPrice - cheap!\n\nThis place is definitely setup more for large families or groups. If you have never been to Hong Kong or a large city in China where you have to get down and dirty to get some good cheap food AND clean your own plates/utensils, this place probably ain't for you. And if you don't speak Chinese, it'll be hard to order.\n\nYeah, it's not the cleanest or best tasting, but very decent for what you pay. I usually come here with my family for some fast, cheap, food close to home. Our whole dinner with 6 entrees and a soup cost less than what we spent when we went to dim sum at an average restaurant!", "author": "Linda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "I love this hole in the wall! \n\nThey have a preset menu for parties starting at 3 people. They allow substitutions depending on similar pricing. \n\nSoup is always warm, full of veggies, tofu, and beef (this is the one I order) \nFried Flounder is always crispy with just the right amount of sauce \nChicken with Ginger sauce is always moist and tasty \nFried Spicy Salty Shrimp is crispy and oh so flavorful \nMustard Greens are crunchy but carry the flavor from the garlic it's sauteed in \n\nI could keep going but I'm getting withdrawals. YUMMMMMM \nGreat Food!!!", "author": "J-nine I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-19", "description": "The deep fried flounder from a number of decent reviews was a huge disappointment. It was batter-flavored (tasted like flour paste) and really gross with a stink that permeated the table. It made me lose my appetite for the rest of the dishes that came with the 5-item meal for $23. I also don't understand why they put THREE deep-fried items on the same menu, plus a very oily vegetable dish.\n\nThe only good thing was how cheap it all was, so we could just ignore the fish. The fried pork chops were pretty good, as well as the salt/pepper shrimp, but god was that fish disgusting... \n\nWait, did I remember to mention the fried fish?", "author": "Winnie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-02", "description": "I got the Chow Fun with black been sauce o_O try it you will be able to leave with some change!\nI go for take out since the atmosphere is usually crowded.", "author": "Matteo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-16", "description": "Cheap chinese food for lunch. 5 buck specials for a lot of different rice places and noodles. Fast and speedy. Being Asian, there could be better chinese food, so 3 stars.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "This is one of my favorite regular take-out spots when I used to live around the corner from Taraval.  You really only eat-in if you wanna amuse your friends with tacky decor, large-zany family watchin, and to get  ideas on the latest-cutting-edge asian hairstyles for men.\n\nYesterday ordered the mongolian beef- loaded with onions, jalapeno, and green onion-YUM, walnut honey prawns- WOW!, garlic bokchoy- INDEED!, and Hong Kong style crispy noodles with shrimp- YES!  All of the dishes are distinctive Chinese flavors- known as Hakka, which represents a minor ethnic group in China known for their vagrant ways and the Hakka cuisine really reflects this.\n\nA spot like this is what makes SF so rare in finding such unique flavors and for such incredible prices-- the 3 of us only spent $30 and had choke leftovers--crazy yeah!  Receiving fresh, tasty oranges and the warm, red bean, tapioca dessert are incentives of dining in.", "author": "omar b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-02", "description": "I came here with my boyfriend after work and i was craving some chinese food and found this place through yelp. It was so busy when we came in. I didn't like the fact we had to share a table with strangers. So awkward. We ordered magolian beef and seafood chow mein. I thought it was so good but i guess i was wrong because the whole ride home, I was feeling sick. Damn you MSG.", "author": "Janice V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-18", "description": "You want to test someone's mental and emotional fortitude?  Take him or her to this restaurant.  Cheap delicious comfort food, but not for the faint of heart.  If greasy chopsticks, sticky tables and flies bother you, then don't go to this place.  As an ABC, SF native, I've grown up on food and places like this, so it doesn't bother me at all.\n\nI'm sure this is the place that all of the kung fu students go to after a tough class.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-13", "description": "Greasy but tasty... Dirty dive but cheap... surly service and it doesn't look like the place gets cleaned often, but again the food wasn't half bad... it's like a 1000 other Chinese places in SF that tend to cater to a predominantly Chinese crowd... that's generally a good sign for me so we overlooked the squalor of the place...", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-27", "description": "This is your typical chinese hole in the wall but the food here is outstanding.  One of my favorite restaurants.\n\nI like the spicy salted squid (calamari), Crispy meat stuffed tofu, seafood and tofu soup, double mushroom chicken, spicy salted pork ribs, oysters with black beans sauce, etc.", "author": "Serena H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-15", "description": "Went here a couple of years back.\n\nHeard horror stories and witnessed things that were etched into my mind.  No matter what, I would remember this restaurant name. \n\nMoment we sat down, I noticed a lot of flies around. Some waiters were swatting them with their fly swatters, and you can hear the electric crackle every time they made a hit.\n\nThe bathroom was dark, the skylight looked out of place. I was waiting for a flood of bugs to attack me.\n\nAnd OH MY GOSH. A waiter accidentally knocked over toothpicks and was picking them up and shoving them back in to the container.\n\nFood was okay.", "author": "Christin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-04", "description": "Came here on several occasions for traditional \"hakka\" dishes. The braised pork belly is almost one of the best I've tried in the bay area...a second close to Capital restaurant in Chinatown. Everything else is pretty average. The food here is dirt cheap and portions are huge but the trade-off is the crummy condition of the restaurant. I've been in porta-pottys that appear cleaner than this place.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "I have this place on speed dial on my cell. I can't account for their ambiance or uncleanliness, since I usually order two dishes from them: chicken chow fun (with vegetables $3.75) and chicken fried rice ($4.75). The chicken fried rice isn't on the menu but if you ask for it in Chinese they'll give it to you.\n\nThe fried rice is YUM! I don't think I've tried a restaurant-style fried rice that tastes this good before and their chicken chow fun...lots of gravy so if you're ordering take out, be careful with your drive home because the sauce does spill out of the carton! These are the only two dishes I've tried and every time I order them, I have a happy belly!", "author": "Janel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-01", "description": "Five stars for cheap Chinese? Um, yeah, especially when there are plenty of steamed tofu and chicken options on the menu, and the tofu dish I went with was enough food for lunch AND dinner.\n\nSzechuan Taste doesn't excel in ambiance (unless you like the Energy 92.7 background music), just cheap, healthy, good Chinese.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "Honey walnnut prawns are AWESOME. Its cheap, but the service is horrible and the restaurant is freeeeeezing. But you get what you pay for, and for $22 for two people with plenty of leftovers, its so worth it. Go for the Honey Walnut Prawns, not the service.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-18", "description": "First time experience at this restaurant !  typically, there was no one there. how exciting! i thought the cleanness from the outside was really clean until i got there. the food seems like it wasn't long enough. we ordered 4 dishes and it was already done by the time we got to talk. service was o.k. but the kitchen need some special cleaning. it's sort of a mess in the there.", "author": "Miranda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "This is the place my parents order for dinner when they're lazy to cook or if it's just one of those days when nobody knows what to eat for dinner. We usually get the noodle and rice dishes to go, and for 4 orders, it's only around $20, depending on what you order.  Perfect if you're craving cheap and mom-style cooking in the Sunset district. :)", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "I LOVE LOVE LOVE this place!\n\nI discovered it on January 1st 2005. There was nothing to eat at the house so my guy friend and I started walking down Taraval (I used to live on 16th ave. & Santiago) and lo and behold there it was: Szechuan Taste. A hole in the wall, if you must.\n\nThe seating arrangements are fascinating to me.\nThey have long tables and round tables. When you sit, you are most likely sharing the table with other people who may come in later or who are already there.\n\nThe food is super cheap. We both had three courses and paid less than $15. Tip included.\n\nThey take a wee bit to take your order, but the food comes right away.\n\nAnd even though they don't deliver (which is why I only give them 4*s.) I've called while riding the L on West Portal, and by the time I'm on 19th my food is ready and waiting :)\n\nThe staff is friendly and helpful.\n\nThe place could use a makeover.\n\nOverall, Good food for very little money. Yay!", "author": "Miss E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-08", "description": "0.5 stars cleanliness (big turn off)\n3 stars for the good tasting food\n3 stars for the big portions\n3 stars for the value if you order the family meals\n\nCame here 3-4 times before...food is good but they really gotta clean up the appearance....Overall 2.5 stars", "author": "sonya h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "This place is GREAT, CHEAP, and FRIENDLY...well most of them, I have been going here for half my life now and the owners know me very well, Vivian usually the lady covering the cashier and her husband, the short chinese guy that wears a black vest...I forgot his name...but anyways this place is one of my favorite places to go for chinese, its cheap and good, even though its not very clean or artistic and I highly advice you to use the restroom before you go here...lol.  \n\nI have never received food poisoning here ever in my life, although it may look dirty it hasn't lead to any illness or whatsoever.\n\nOrdering...again food is cheap so you can be order abundantly but still pay under 20 dollars for 3 people..the mongolian beef here is one of my favorites about 6.50, and the calamari is only 4.50 so try it!  Then you can order any greens and then to start is hot n sour soup which is one of the best i've ever had...whatever you order here you cant go wrong, from seafood to beef to fish to chicken, whatever you like they got it!!! Definitely recommend this place to ANYONE!", "author": "Genesis K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-22", "description": "I come here with my buddies for the Salt and Pepper Spare Ribs over Rice and that is it. It's good...once every two to three months. The restaurant itself...well, don't expect too much. It's dirty, cheap and filled with construction workers and painters in the afternoon lunch period! At night...wait a sec, I don't go there for dinner. Ha! It's not much, but it's a typical cheap Chinese restaurant. Bleh. \n\nEat here if you're desperately hungry (as in 40 days and 40 nights of hunger). Otherwise, walk around the corner for Seniore's.", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-20", "description": "10 or more items on the family menu for 10 people for $118?  You don't get anything cheaper than this anywhere else.  That included soup, mushroom and mustard green, beef and pok choi, huge fried fish, salt bake chicken, salt and pepper prawns, house special spareribs, 10 whole steam oyster with black bean sauce, crab with ginger and green onion, fried rice, and dessert.  All those for $118?  on big plates? in San Francisco? common, if you come with big groups, give them a try.\n\nThe place is not very clean, I agree.  The service here is  better than most Chinese restaurants, they are not too attentive, but they get what you ask for right away and plus, they aren't rude.   The food quality isn't bad at all.  Food came out really fast, the 1st item came out about 15 min after we ordered, the last item came out about 20 min after the 1st one.  If you have big group, want cheap food, want good food, not too picky about the cleanliness, not care too much about service, this is definitely the place for you.  My family has no patient, they don't want to wait, this is perfect for us.", "author": "Lily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "favorite family place for 18yrs. Honey Walnut Prawns!!!", "author": "Drea P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "been eating at this place since high school days which 10+ years... just love it... they always have there lunch special for under $4 spare ribs over rice... just two of use and we do 3 order and were full every time... oh yeah they special lunch/dinner sets which start off $17 but now its $19 the last time i was out there... come with rice, salt pepper prawns, salt spare ribs, soup, yui choi, and deep fryed founder.... all for about $25 if you order two soda too... bang for the bucks if your hungry!", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "Been eating here since I was 5. The sliced pork, kung pao chicken, and honey walnut prawns are amazing. Also, get the black bean oysters and the fried rice. I love the hole-in-the-wall location of the place. Btw, the restrooms are still not good and sometimes there are many flies inside. Overall, awesome place. :D", "author": "Chris R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-08", "description": "Ordered an Lemon Chicken. Hardly find any chicken. Pepper salt pork, no pepper taste and pork was more crisp than jerky. Also had walnut prawns, at least that was edible, but walnuts were old and prawns were not deveined properly. Basically, couldn't finish my dinner. Not going here again.", "author": "David H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-27", "description": "PLEASE DONT EAT HERE! I went here on Christmas with my family and the food was AWFUL! I dont have much of a problem with BAD chinese food, because there is so much out there, but the problem is the place is DIRTY!!!! My son had food poisoning the morning after we ate there. My dad and I both had stomach aches. I can't blame them for myself and my dad, because we ate other food that day,but that was the only solid meal my son had that day. I'm going to file a compliant on their restaurant, if anyone else have a problem with the restaurant I think you should too.", "author": "Crystina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "We ordered these dishes for dinner last night.  Shrimp with steamed tofu was very tasty.  Peking duck - eh...have had better.  Deep fried calamari was very good, crunchy, not chewy, but tasted heavy (like fried in older oil).  Beef chow fun was very good.  Sweet and sour pork was standard.  Whole rock cod was very good, very tender.  Fried wontons were meh.... Kung Pao Chicken was ok as well.  Westlake Beef Soup was very tasty.  Bean dessert soup was ok as well.  Overall, very tasty food, pretty salty though.  Service is difficult, hard to get the people's attention.  Go here for the food, not so much the service.", "author": "June W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-13", "description": "I really loved this place, i went a few times and had a great time, had decent food, but recently, it has been super dirty with lots of flies inside, and really mediocre food.\nI'm over it.\nCan anyone recommend a different chinese food restaurant close by?", "author": "Taylor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-02", "description": "I have to say I was a bit suspicious when my coworkers told me there was a good chinese food restaurant down a couple streets. I had been victim to the bad foods of taraval such as Ha Noi Bistro, Mings Cafe, and KFC, so my expectations for this place were pretty low, however i was told that it was CHEEP!!!! SFSU student making his way on loans and a  bag boy salary can't just drop 7 dollars like it's nothing. No I needed to stretch my dollar. Apparently the food here was ridiculously cheep so I was like \"ok Cindy I'll check it out.\"\nSo the next day I am feeling the groans and growls of a 1.5 meal a day diet. I look in my wallet. 8 dollars. I could've easily rode the bus up to to the Ha Noi Bistro and Order like... 4 orders of white rice, or gone down to my dining commons for some nasty food, but I decide to ride up to taraval to check this place out... and buy some almond milk at my store.\nOMFG! I walk in and the place is a mess. Paint is faint, door seems unhinged, and dilapidated furnishings are ubiquitous. I've seen worse.\nI grab a menu and begin to read. Everything sounded pretty good... and then i scrolled my eyes over to the prices.\nOMFG! I POOPED BRICKS!!!!!!!!!!!!!!!!!!!!!!!!\n4.50 for some stirfried rice?!?!?!?!?!?!?!?! how much am i getting a spoonful. I was in shock. I call the waiter over and say... \"Ni Hao\" and he looks at me grudgingly for failing to pronounce the standard manderin greeting properly. I ask him about the price/portion ratio. I ask should i get an order of white rice alongside it? He looks at with wide eyes. Maybe his english wasn't so good, or maybe he was amazed that I didn't think i'd get enough.\nOMFG!!!! 6 dollars and 10 minutes later... I POOP MOAR BRICKS!!!!!!!!!!\nI have too much food!\nI ordered carry out... and man were those orders potent. I can still smell them even now... but boy were they good. I get home and open my boxes and grab my chopsticks. I take up a some of the vegetable stir fry with my chops ... rice and egg falling out, my grip not quite strong enough to hold a huge bite... but man.... i chew and chew and chewed... and then i swallowed.... and then.... I POOPED MOAR BRICKS!!!!!!!!!!!!!!!!!!!!!!!111\n\nOMFG this place is sooo good and so cheep. I love it! I love it! I LOVE IT!", "author": "Israel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-26", "description": "Too bad Yelp doesn't allow a negative star rating 'cause this hole in the wall deserves one!! Man, this is a prime example of the main restaurants that should be inspected every month by the health department. There were literally little flies flying all around our food (makes me sick just thinking about it!). Yeah, the food given is abundant but it screams a shockful of MSG! I don't even want to know what the kitchen looks like!! Please go elsewhere....", "author": "La C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-16", "description": "Foodwise, it's good and cheap Chinese food.  Two to three can eat for less than $20.  Got a larger party, 7-10, $100 should feed everyone and still have food to take home.  For decor and cleanliness, it's literally the hole-in-the-wall place that you've always heard of.   I came here with my friends for a college graduation party...before they had remodeled.  It was darkly lit, yet packed.  They removed some of the fixtures and made it more light and airy...but it's still a dive.  Go to eat, not to use the restroom...unless it's an emergency.", "author": "JeFF T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "My mom took us here for a family dinner.  The food looked great and the place look pretty dirty.   I was still a teen when she took us here.  I remember eating tons of sweet and sour pork because it was so good.  Later at nite I think I had food poisoning and missed school I think.", "author": "John F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-27", "description": "I guess this place would be fine if you love meat. But I don't like meat much but chicken so yep. Isn't much chicken around here, and definately not much vegetarian selections.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-26", "description": "I love this place.  Okay, yes it isn't the cleanest place.  I think it might be cleaner eating in my backyard...off the ground.  The food is good and cheap.  Whole crabs for under $10.  In their defense it used to be worse until they remodeled a few years back.  I can't explain it but on a few instances I wasn't feeling well during the day and after I ate there I came out feeling great.  Some ancient Chinese medicinal properties?  Or maybe my natural flora is strengthened in there.  We've been seated in the back on the way to the restrooms which wasn't great.  Hey, I've been in worse bathrooms in Asia so nothing here makes me squirm.", "author": "Brad K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-18", "description": "I survive another visit and didn't get sick.  Lots of empty resturant on Taraval and we walk passed many with empty stomach. ST is a full house.  This time I don't see any critters and the ladies at the next table said this place has gotten clean.  My friend didn't think so and complains about the table being sticky.  I said shut up, where can you find a menu with $4.75 items on them.  $4.50 rice plate humm.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-23", "description": "I've been coming here since 1993. This place hasn't changed one bit. The crispy stuffed tofu still costs $3.50. (Truly amazing. Even Wrigley's Spearmint has gotten more expensive in fourteen years.) You can still get dinner for three here - and leftovers to last a week - for under $20. The waiters, all twenty-something HK ragamuffins, still slap each other on the butt when they pass. Okay, the decor is a little different. When I was in high school the owners removed the faux-ski-lodge wall panels. But besides this I wouldn't have it any other way.\n\nI have a hundred stories to tell about this place. One time when I was in college my family took my roommate here. Being from Boston, he hadn't tried much authentic Chinese food before, but he came away a fan of ST. (He didn't comment, though, on our table in a narrow section next to the restrooms - or the constant stream of patrons who bumped into our table on their way.)  On a recent visit with my mother, the joint was packed and we were seated at the same table as a young Caucausian couple. The man, an Irish emigre, apparently had never had Chinese food before; he asked his companion, a fetching Russian girl, what chow mein was. The girl asked the waiter about an item on the menu. Following ST custom, the waiter responded, \"Very good choice!\" Five minutes later, a sumptuous plate of fried rice came for the gentleman, and for the devushka: a small dish of cold gelatinous offal. The Russian asked her friend to share the food. His reply: \"No bloody way I'm eating that!\"\n\nWhen Oprah talks about comfort food, she means a bucket of fried chicken. When I talk about comfort food, I mean a plate of fried salt and pepper pork chops at Szechuan Taste. If you want service and ambience go to Tommy Toy's. If you want the first choice in the Sunset for Chinese food chosen by contractors on their lunch break, Filipino families after church, and multi-generational households of Chinese Americans, take the L line to Szechuan Taste.", "author": "William L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-17", "description": "i came here last night for dinner with a group of 11 people.  They offer meal plans for large groups of 8 - 10+ people, which offer a variety of meats, seafood and veggies. The salt and peppered spareribs here are my personal favorite.  If you are a person who need some space between people ... this is not your restaurant. The space here is extremely packed, but they do accommodate to large groups. The crab was okay. And the oysters looked delicious, but I gave that to my boyfriend. The noise level here is extremely loud, so you can only hear people on your left and right. So seat yourself next to a person who you plan to talk to the most ... the one great thing about this restaurant is that they still offer tapioca dessert. It comes with the meal packages, but I do not know of any restaurants that still offer them.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-13", "description": "this place was recommended by my korean friend, raving about how cheap the food is.\n\nfirst time i came here wanting some chow fun, but they said they were out.\n\nsecond time the classmates and i came for a friends birthday lunch cuz she wanted chicken fried rice. the 10 of us shared pork belly with preserved cabbage, honey walnut prawns, garlic spinach, df sandab, salt-pepper shrimp, chicken fried rice, and more i just forgot what.\n\neverything was going well until we asked for a refill of steamed rice and found a fly in the rice. the girls immediately lost their appetites, and the guys just ate around it, hahaha\n\nservice is nice, helps if you speak chinese or bring a chinese friend to order", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "This spot is real hood!  But the food is real good!!!! Best walnut prawns ever, no mayo!  Great reasonable seafood.  Just BYOFS, bring your own fly swatter.", "author": "sonia m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-19", "description": "Came here once with my friend for lunch . We had the eggplant and the chicken pot or whatever it is called . Both were pretty decent . Good place to go for a cheap lunch but the place is kind of filfthy ..", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-07", "description": "Great authentic Chinese food. Really great prices too...they have a unbeatable lunch special for $3.50 that includes your choice of dish with rice and soup. I recommend the salty spicy squid ($3.50) and the salty spicy spareribs($4). The plates are big and really tasty...whenever I go during lunch time, I always see construction workers on lunch breaks and along with families and singles. Not the cleanest place, but the food makes up for it", "author": "Jessica h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "This place is so close to my house.. yay! So... this place is not all that clean inside.. BUT.. the food is good! The clams in black bean sauce, crab, salt and pepper spareribs and sweet and sour pork YUM! My family has been getting food from here for as long as i can remember! Oh yes and the prices aren't too bad either.. parking sucks just because its on 19th ave. -_-;; well.. good thing its within walking distance for me! ^_^", "author": "Heather C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "note: I can only speak for their take-out (so far).. \n\none day after work I was really craving some chow fun and stopped by here on the way home to pick up dinner. I walk proudly thru the tables to the back register, announce my order, only to be told that they were out of pho.\n\nwhat. THE. PHO. dude.\n\nhow can you be out of pho! I still wanted some chinese food so I decided to get a mongolian beef rice plate.. $4.90 w/tax. DAMN that's like cheaper than mcdonalds. it was a whole lot of food, but my fat ass finished the whole thing, when I easily could've saved half for the next day. anyhow, I'm itchin' to go back to try their kung pao chicken now and still gotta get my chow fun.", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "1. Tasty Hakka food.\n2. Cheap\n3. Greasy\n4. Chairs, tables, floors are sticky from grease\n5. Order Salty salt & pepper spareribs, yang chow fried rice, and their chow fun.  ($20. Dinner for 3)\n\n\nI used to go a lot.  I mean A Lot.  2x a day sometimes.  I even went after a workout.  What a waste of a workout.  They have good food.  The taste is not really consistent because they have different cooks that cooks things differently sometimes.  But, it taste good and it is cheap with a big C.\n\nThis restaurant used to be owned by someone else back maybe 10 years ago.  It was really stinky and sticky back then.  It smelled like cat urine.  Now, believe it or not, it is 5x as clean.  Food is good, and service is good.  I don't know how, but the service is good.  I don't get it.  It is better then other classier restaurants. \n\nA bit of advice, order take out.  You will feel more comfortable eating your food.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "decent to-go place.  lower your expectation and you should be satisfied.", "author": "Sydney L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "My regular go-to for Chinese. Clientele largely Asian. Service fast but frantic. Don't expect subtlety here in decor, service, atmosphere. Wildly vibrant paint and a faint aura of grunge, but sanitary enough. But the food is great, if you stay away from all the predictable stuff like chicken broccoli. Get the whole fried sand dab, or the steamed oysters, or the very cheap shrimp in egg custard. Delicious. Tip: Look around and see what the Asians are having. (It may not be on the menu.) Point and click, and the waiters will  bring it. Guilty pleasure: Walnut prawns, in something that looks like mayonnaise. What could it be?", "author": "Antonio P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-24", "description": "This has been one of my parents favorite dineout places.  Abundant portions of food and cheap prices!  I have to admit, the ambience need a lot of makeover....especially the bathroom (Don't go in there unless you REALLY have to!)  But the food and prices makes up the difference.  \n\nWhere would you find a 5 item dinner for $18.  It's enough to feed over 4 ppl.  (Minced beef soup; fried prawns; mustard greens; fried flounder; bejing spareribs, and dessert - Mango tapioca & orange).\n\nIf not the set dinner menu, there's always the separate items for $3.50.  If you can read chinese (I can bare read) they also offer some good items plastered all over the walls in chinese.\n\nGood food, good prices", "author": "Gary Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-23", "description": "6 adults ate here for lunch today.  Total cost $25 (including tax!).  20 dishes for $4.50 each.  Huge portions.  We all came out really full and even had leftovers which me and my sister are enjoying for dinner right now.  Yes, the decor is a bit dirty and bland, but those are the type of restaurants with the best food and its cheap!  They don't even charge for rice (for lunch at least)!", "author": "Erika C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-17", "description": "We had dinner here last night for a family dinner.  The restaurant was about half full.  The service at this restaurant was not good, probably worse than the average Chinese restaurant.  The waiter simply ignored you so you would have to call or wave your hands to get any service.  The food came out really quick though.  But I think there was a reason because the chef simply deep fried all the meat or seafood dishes as a first step.  I could see and taste it.  They lemon chicken was really dry because of the deep fry.   All dishes we ordered taste okay but they were way too greasy for me, even the vegetable dishes.   I can a layer of oil at the bottom of my vegetable.    The crab was also deep fried before seasoning so it kinda ruin the freshness of the crab meat.   I was not hugely disappointed because the price is very cheap and I did not expect greatness for the price they charged.  I also like the steam egg and lamb clay pot.  They tasted good and not as greasy as other dishes.\nIn summary, I felt the restaurant was okay but I probably won't come back just because I don't like the amount of oil they put in my food.", "author": "Ben c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-14", "description": "Nothing great, just good Hakka and Szechuan cuisine with friendly service in a clean no frills atmosphere such as all sunset restaurants.  The service is very friendly and the prices are rock bottom.  I love the TV with the Cantonese programing; not that I can speak a lick as I'm Caucasian, but nevertheless it adds character.  The pot stickers are small yet delectable crispy golden morsiles with a perfect ground pork, cabbage, and ginger filling; perfect topped with a little sweet & sour sauce.  The chicken corn soup is large as are all the portions; plan on taking leftovers home.!  The soup is a large bowl of creamed corn, bits of chicken with a bit of grizzle yet still pretty good in a thick yet light broth.  The Mongolian beef is tender with onions and carrots over crispy rice noodles in a spicy chili garlic sauce that will pack enough punch to wake up your tastebuds yet not clear your sinuses.  The seafood chow mein, though a little oily tasting, was still worth it with soft noodles, fresh vegetables, prawns, scallops, and squid; it would have been cool if they would have had the yee mein.  The steamed rice is firm not soggy.  The tea is wonderful as are the fresh oranges for dessert.  So, for excellent Hakka & Szechuan cuisine at rock bottom prices in a clean no frills atmosphere with friendly service, Szechuan Taste cannot be beat.  Keep up the good work guys.!", "author": "Brian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-11", "description": "Really doesn't even deserve one star.  I don't even know why it's still in business.  I pass by the area from time to time and I am surprised that people actually continue to eat there.  I ate there once for someone's birthday dinner and never came back.  Basically the food was pretty good, I'm not going to lie.  However, the restroom was filthy.  All of the toilets overflowed and there was water all-over the floor.  There was no soap dispensers or soap in the bathroom.  I find that disturbing especially after I saw one of the employees use the restroom before me and then washed her hands without using soap.  To top it all off, there was a roach in the take-out box.  Disgusting!  never again.  I heard stories about the place afterwords.  If I knew it would be that unsanitary, I would have never attended the dinner party.  An ex-coworker of mine ate there a year after and also complained because a roach fell from the ceiling and onto his plate.  I really want this nasty place shut down.  Don't eat here!", "author": "Jacquelynne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-13", "description": "excellent and real Cantonese style food\n(not Szechuan style);\n\nThe price is great!\n\nI have been the place during the last 10 yrs, when I visit SF during the weekends.\n\nAnd I have recommended many Cantonese friends to this place, and they all like it!", "author": "Allen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "This is the place to go to for a huge and inexpensive meal, take out or sit down.  There is no question - their salt and pepper pork chops (over rice to go) is a favorite of many.  They have several LARGE tables - many families drop by for dinner.  The portions are large, service is fast, food is tasty - excellent value for the money.  Keep in mind you are not paying for 5 star accommodations and you'll be well satisfied.  I only wish they stayed open later than 9:30pm.", "author": "Antonio E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-27", "description": "Kind of your typical Chinese hole in the wall. I give it credit because places like these ensure me that decent Chinese food still exists and that I shouldn't lose faith in Chinese Food (i.e. P.F Chang and Panda Express). I've lived in the neighborhood for most of my life and my family regulars this place like every other month. Our favorite dishes are clams in black bean sauce, this deep fried fish (if you go you can see a lot of people getting it), this steamed fish, some soup with scallops(sorry for my vagueness in menu items, I can't recall the names of the dishes on top of my head), and fried rice. For the most part, the portions are OKAY, but definately over the years they've downsized their portions. When I was younger, we would get a mountain of clams, and now I think at most there are about six.... Yeah... that doesn't sound too good. Overall, good for a quick and DECENT Chinese fix.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-04", "description": "This is literally the worst restaurant that I have ever been to in my life.  The place is absolutely filthy, FILTHY.. I have no idea how they haven't been shut down.  Our glasses and dishware had dried food stuck to it, the carpets and walls are disgusting, and there were hundreds of tiny fruit flies swarming around us during our meal.  The service was terrible and the food was even worse.  The three of us that went ate a total of 6 bites before waiting 30 minutes to get our check.  I could go on and on, but I think that you get the point.  If you read this, and you still eat there, then you deserve the experience that you will have.  I literally just came home and joined YELP to warn the world about this restaurant.  I am going to go vomit now, thanks for reading.", "author": "Steve O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-13", "description": "In three words, the food at this place can be described as, cheap, greasy, and cheap.  This is not gourmet fare.  It is chinese comfort food, and its has some of the lowest prices you can find for a restaurant in the Sunset, which is already pretty low.  I come here with such great frequency, that the waitstaff(one of whom speaks english, along with the woman who takes the money) commented when I cut my hair.  I've never eaten inside, if only because I would be embarrassed to take a friend there, since the decor consists of dirty curtains, bare white walls with the occasional picture of one of those waterfalls where the water moves in some kind of screen.  How do those work, btw?  This restaraunt is like a guilty pleasure.  And I love it.  It's perfect for when you need food, need food now, and need food cheap.  You can feed yourself for a day and half one one order of 4.00 chow mein, which I highly reccomend.  It's on Taraval at 19th, next door to the Shannon Arms.  Big yellow awning.  Every sunseter should have them on speed dial.  Its like putting smiles into your belly, is one way to think about it.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "I'm going to keep this short and simple.  This is not the type of restaurant where a maitre'd greets you and takes your coat at the door.  You'll be lucky if you get acknowledged right away by the wait staff.  Here you get large portions of consistently great tasting food that won't send you to the poor house.  Come here when you need a fixin of delicious greasy Chinese food not the service, ambiance, or cleanliness.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-24", "description": "At half the price and five times the quality of a bowl of soup I ate recently at the Union Square tourist trap I was unfortunate enough to have burned my mouth on, why in the world can't a great little hole-in-tie-wall place like this be closer to where I work?  The comments on rats and insects are nonsense (though my table might have been wiped down a little more thoroughly before I arrived).  The fried fish was out of this world, the pork chop serving generous and tasty!  You can get away with just that bowl of wonton soup, though.  I'll be going back!", "author": "Sophie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "I can say, this is a very good restaurant, it was such a bomb in San Francisco, and also it was very cheap, and the dishes are large. I can not find a res truant with this price in the whole bay area. As they say, they are really the king of restaurant in bay area. I just make it easy \" The half price of the fast food, and you can get more full then the fast food. I don't care the environment because you have to understand, it was a old restaurant, how can you expect it every thing is new. If they are not good how can they survive. I recommend this restaurant because it is very good and with the cheapest price in bay area.", "author": "chin fai h."}
