{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "My new favorite Taiwanese breakfast and lunch spot. The owners/workers here so nice it feels homey.\n\nThey have the fried donut and soy milk which gives me nostalgia when I was in Taiwan and I had those for breakfast. \n\nWe also got the hot and sour soup -- good for when you're sick, and the usual General Tso's chicken. The chicken is good when you're hungry because they give you a lot for cheap.", "author": "Natascha E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Small Taiwanese restaurant on Clement with some pretty decent options. \nThe day we went they were short staffed and service was pretty slow but the owner did apologize. \n\nWe ordered the beef noodle soup which was pretty bland, but a little salt and chili sauce helped. \n\nPros: Huge portions for reasonable price. \n\nCons: Slow service. Food was mediocre", "author": "Milton F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "I came here with my family and grandpa on a Sunday around 11am and the place was not packed, so we were seated immediately. We were immediately handed menus and tea was given to us. The service was alright, the man was more accommodating and attentive compared to the woman, but it wasn't that huge of a concern for us, considering that more customers came and the restaurant was filling up. \n\nFood:\n\n- Potstickers: These are one of the biggest potstickers I've ever seen, and they were packed with meat. The potstickers were freshly made to order and overall, super good.\n\n- Green beans: I love green beans (the dish comes with pork) and this dish had good flavor, though the beans were not as crunchy as I would've liked. You could definitely taste the char from their frying.\n\n- Xiao long bao: Again, similar to the potstickers, these are one of the biggest xiao long baos I've ever seen. They were also packed with meat and just oh so delicious.\n\n- Shanghai Noodles: The noodles were thick and starchy and I would definitely recommend this dish since its got noodles, meat, and veggies. This dish is one of our go-to dishes.\n\n- Fried Doughnut: This is usually ordered with some sweet soy milk since it is a savory doughnut, but we decided not to get the soy milk and just the doughnut. It was freshly made and crunchy, but maybe just a little too oily for me. This satisfies any of those savory doughnut cravings. \n\n- Rice cakes: The rice cakes were very chewy and the dish didn't have much flavor, but it was a nice reprieve from other saltier dishes so it was a good balance. \n\nOverall, the dishes were good for the price you pay, and I would definitely come back if I'm in the area!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-11", "description": "Unfortunately the food here is not so authentic Taiwanese.  They do have a wide variety of food choices.  We had minced pork rice, three cup chicken and intestine pork blood tofu pot.  Everything was just not quite there.  With all that said, their customer service was awesome.  Everyone was kind and attentive.  Overall, I am giving a 3-star.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Came to this place on a Monday during dinner time.\nIt was empty so very fast service.\n\nLots of seating!\n\nFood: I was reccomended some dishes by someone so we ordered Spare Rib Pork, Potstickers, Spinach & Garlic, Mongolian Beef, and Steamed Rice.\n\nDecently sized portion. Average/cheap pricing.\n\nThey have specials as well if you're on a budget.\n\nThoughts: Spinach & Garlic was cooked well. Good flavor.\nPork was sweet/tangy and lighty crispy. Mongolian Beef waa delicious, spicy! Potstickers are a must try!! So much flavorful and full of meat! Rice was good.\n\nOverall good food with very fast service.", "author": "Michele G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-04", "description": "The beef stew noodle here saddens me. The broth was fairly watered down and the noodles were soggy. There was rare sighting of bok choy in the bowl. The chunks of tendon were decent, the beef chucks less exciting.", "author": "Cici T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "We've eaten here for years and enjoy the food and the staff. Recommend the potstickers, Dandan noodles and beef noodle soup. The green onion pancakes are nice and crispy.  Large portions and the staff are always nice and attentive.", "author": "Nancy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "Oversized , not juicy, XLB: Strike one.\nNiu Ruo Xian Bing are using Mexican Tortilla wrap: Strike 2-3 (This is the greatest sin of them all).\nOversized, overly thick skin pot sticker: Strike 4\nHost pushing to order more than I can eat, even though I asked how big each item, ( he mentioned pretty small portion), turns out I can eat for 3 full meal out of it! Strike 5.\n\nHow many strike to do out ? 3 yet we have 5.\nThe only good thing here is turnip cake! (Lo bak Go)", "author": "Dan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-23", "description": "Ate lunch here. Street meter parking 2.25/hour if you can get space. Environment relatively clean for Chinese. Sugar, soy sauce, vinegar containers can use a good wipe down each night and hot wash weekly, greasy to the touch. Food was rather bland compared to Thai food.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Family enjoy this place. We like to taste various dishes. Needless to say we over ordered. Everything tasty and plentiful for anoth", "author": "Deanna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "The Chinese donuts and hot soy milk (Northern Taiwanese breakfast staples) were excellent, though for the sweet version of the milk you'll have to add the sugar yourself. Definitely not a deal-breaker for me!\n\nWhat I wouldn't order again:\n- The scallion pancakes. Greasy and heavy.\n- The xlb. Just don't, unless you enjoy thick and gummy dumpling skin. I only finished one!\n\nThe restaurant is family-run, totally unassuming, simple and straightforward - nothing special. But you come for the Chinese donuts and soy milk, obviously!", "author": "Jelena Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-23", "description": "Tasted Sizzling rice soup, Dry Green Beans, and Happy Family Seafood. Pretty good Taiwanese style food and Northern Dishes. Delicious mid-PM Break.", "author": "Yee Ping C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "The food is pretty good and satisfy our craving for Taiwanese food. Prices are good and service is prompt.\nIt's a small family business and I like supporting small local business. \nMost of the dishes are very home-style, not particularly unique but very tasty nonetheless.", "author": "Rosyan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-03", "description": "Got 13 dishes for 7. All that was left was rice. The food was ok - not great not. As but cheap as hell. 13 dishes and rice for $125 not including tip. Atmosphere no frills. Service friendly and efficient. Men's restroom disgusting.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "I've eaten at this place for over 20 years, it's been one of my family's favorite restaurants to go to on the weekend together. The workers are always super friendly, nice, and attentive. I feel welcomed and appreciated here. \n\nWe always HAVE to get the steamed dumplings (xiao long bao/小籠包), potstickers (鍋貼), Shanghai noodles, and a soup noodle. The soy milk and donuts are so good too. What I love about the food is you can watch them hand make their dumplings and donuts in the front, always tasting fresh and delicious! They also are very generous with the portions and with a very reasonable price too so I am always leaving stuffed and happy. \n\nIt can get pretty busy on the weekends but it's worth the wait. The food also comes out pretty quick. All the other Taiwanese / Shanghainese places we try are no competition.\n\nFYI: They've recently changed to CASH ONLY!", "author": "Allison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "I've been coming here for years with my family, and the food is always good.\n\nI came in Sunday to eat lunch with my Dad shortly after 11am, and there was no wait. On the way in, you can observe the chefs make all the potstickers and donuts fresh from the fryer. What's great about this place is that my family is one of their usual customers, so my parents have become friends with the waitress so the atmosphere is always inviting. Although this place isn't the best looking restaurant, the food makes up for it.\n\nI got my personal favorite the Mustard Green with Shredded Pork Noodle Soup, and my Dad got the Braised Beef Ligament Noodle Soup. \n\nLet me just say that the noodle soup portions are huge. If you're not a big eater and you order one of their noodle soups, I would suggest you split the bowl with someone. The mustard greens and pork are cooked in a sauce that adds a lot of flavor to the soup. Both bowls really hit the spot, but this time around the proportion of noodles to everything else was slightly higher than normal. Other tasty options are their potstickers, fried doughuts and unsweetened soymilk. The potstickers are so crisp and juicy, and the fried doughnuts go well while drinking the soymilk (there's sugar at the table for you to add yourself). The rice plates also come in huge portions as well incase you're not a noodle person.\n\nPrices are decent, cleanliness is alright, and decor is bare minimum, BUT the food is what makes this place amazing.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Went here for a Taiwanese breakfast because I was craving it after not having been to Taiwan for a while and it was really good. We got the salty soy milk, sweet soy milk, a krueller, and the deep fried turnip cakes and everything was tasty. The staff was also very nice and everything was decently priced.", "author": "Carolyn E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "This is a regular dining spot for my family and me. We love the potstickers and the pork chop noodle soup. The wait staff knows us and is super friendly and accommodating.", "author": "Descartes L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "Overall, not satisfied and would not return. Below are dish I ordered.\n\n- HOT & SOUR SOUP: this tasted as expected it should.\n- 8 PIECE DEEP FRIED PRAWNS: tasty and would order again.\n- DRY BRAISED GREEN BEANS: this was listed under their vegetarian options, it was not!! There was ground beef in the dish.\n- BLACK BEAN SAUCE SQUIDS: could not taste the black bean sauce. dish was tasteless. would not order again.\n- CURRY TOFU: was very bland and tasteless. would not order again.", "author": "Hello E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "I do love this place. I've been coming here for 20 year with my family.\n\nWe always come here for the potstickers, the dumplings, and noodle soups. I love that they make all the potstickers and dumplings fresh. I also love that everything is really affordable.\n\nCame in with my sister for dinner, we ordered potstickers, dumplings, two noodles dishes and it came out to be around $25. Apparently they are cash only now.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Reasonable price and huge portion! The food is delicious too-- we got Mandarin beef, fish egg plant, and squid soup. Would definitely come back.", "author": "Tinaa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Great food, better service and amazing customer service by the owner. My original plan of having Chinese food delivered to the Financial District on Chinese New Year fell through. I found myself looking for other places that were open and I stumbled upon Taiwan Restaurant. The owner George was super kind and helpful, he was busy because I called the night prior Chinese New Year on my attempt to place an order for 30 people. He had to call me back like three times because he really wanted to ensure I was ordering enough food for my event. He was thoughtful, reasonable and made me feel he wasn't just thinking about him as a business owner but also on me as a customer. Excellent follow through and I can't be more grateful. The food was plenty, excellent and he gained a loyal customer for life, not to mention 30 other customers because the food was truly delish!", "author": "Pilar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Whole in the wall, but delicious. Potstickers are bomb. I do like the pickled vegetables shredded pork soup and the deep fried pork chops.", "author": "Bryan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "Taiwan Restaurant is alright. I would recommend if you were looking for a decently priced meal, but I wouldn't go in with a high expectation on quality of food -- at least not across all plates. \n\nI came to Taiwan Restaurant for lunch and ordered 5 dishes. After tax and tip, it came out to $26. For San Francisco that's definitely impressive! Service was also great. \n\nThe Chinese donuts were good and the pot stickers were decent. They definitely don't skimp on portion size. However, as others have noted, stay away from the soup dumplings (XLBs). They were double the size they should be (probably not a good thing), the wrapping was extremely thick and there was no soup in the dumpling. \n\nAll in all a good restaurant to go to every once in a while.", "author": "Bernard H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "My friends and I were in search of good Chinese food when we to visit the Bay Area. Instead of going to the over-crowded tourist China Town, my Bay area friends took me to New China Town instead. This place is definitely a hole in the wall, so it wasn't busy. It's decently sized but the food was generous portions. I have to say this was one of the best Taiwanese food I had up in the Bay Area. Great for family style eating!\n\nIf you're looking for good, under the radar Chinese food: Try this!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-15", "description": "Went for dinner the other night. Was disappointed in the steamed dumplings. The meat filling was solid meat and no juice coming out as you bite into it. We think it's a new owner, pot stickers we big but meat wasn't as solid as the steamed dumplings. Just not the place it use to be. Maybe if we had no other place to go to but SF has so many Other restaurants to try. Sad it's not as good as before...", "author": "Kim F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-05", "description": "It's been years, maybe even a decade.  \nThe original in Berkeley was the standard, though didn't dine there often while living on campus.\nThen, their Chinatown/North Beach location was in my regular lunch rotation for takeout food since it was close to work.\nThis Inner Richmond staple is a change from the primarily Cantonese restaurants in the neighborhood.  My friend chose it for her birthday lunch on a recent Saturday.  While ordering post meal takeout, I recognized a waiter from that Chinatown location, leading me to believe ownership is likely the same.  Here's what we shared, all family style:\n\nAppetizers\n1.  Kuo Teh (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=GERaTy5i44rasD7Ug_8WTA) - Also known as pot stickers, these were nicely browned though skins are on the doughy side.\n\n2.  Green onion pancake (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=oJk7G8GtWxavVDwXRmJTXA) - Crisp and served hot, these disappeared from the plate quickly.\n\n3.  Steamed dumplings (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=bVTHJlHoJ4YQiirRjgLw9w) - Better known as Xiao Lung Baos, they are larger than most and like 1., skin on thick side.\n\n4.  Taiwan special deep fried tofu (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=X-L5Bh-SdVNUHMCt3j3tcA) - Seeing a neighboring table's order, we added this.  Fried well but no distinct flavor.\n\n5.  Fried squid (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=2KeA1m_3rWgKrf9FNTJKdA) - Probably my least favorite as they could pass for pork rinds.\n\n6.  Wok-fried Shanghai thick noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=h9FnAuBagMh80C4CBXQsGw) - The noodles were extraordinarily thick almost udon like.  Flavors were very distinct as chef had a light hand on the soy sauce while stir frying.\n\n7.  Bean and meat sauce noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=agbAC1NtfEOYP3SPCl4Izw) - Probably my favorite as seasonings were spot in.  A little more veggies might make this a must-order.\n\n8.  Dry braised green beans (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q) - Hard to do this wrong, they did a decent job in savoriness and not overcooking them.\n\n9.  Smoked tofu, celery, and pork stir fry (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=s2EjsJtnF1mlqI2lsvCMCQ) - My second favorite of the meal, all ingredients shined.  Tofu size made smaller would make this perfect.\n\nAs many comment especially Ken K. (http://www.yelp.com/user_details?userid=DS0Idr2XDhz5e7ZfSy0dYA), this is a pretty far cry from authentic Taiwan food as far as flavors go.  The bar is set high in Southern California with the predominance of locals there.  Here, Cantonese palates reign and welcome any variation of Chinese cuisine available.  Portions are generous and prices are certainly reasonable here.  \nJust don't expect to enjoy the true flavors that you'd enjoy in or around Taipei's night market.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Delicious! We split the white turnip cakes, mandarin tofu, and fresh vegetable chow fun for lunch. Enormous portions. All for twenty bucks! \n\n*edit: it was our first visit and we found the restaurant from Yelp. Didn't disappoint!", "author": "Tyjen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "The food here is always good. I particularly like the red wine, served by the carafe or if you're by yourself, and I am too often, by the 1/2 carafe. For the quality, quantity, and service I would like to to give this place 5 stars, however it is cold. I mentioned this to the server, who didn't seem to understand or care. I pointed out that everyone in the restaurant was still wearing their coats. I came to the conclusion that she understood, but was not able to do anything about the apparent lack of heat. The door is held open, I assume to provide make-up air to the kitchen hoods.", "author": "Iain A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "Tasty fresh made dumplings. Shrimp and leek and fatter/larger pork steamed are delicious. Scallion pancakes are also good. We added steamed spinach with garlic and it was enough for 3 adults and a 11 year old who doesn't always eat that much. Went down the street to get custard buns at Good Luck Dim Sum for dessert.", "author": "Jon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "While service may not be the friendliest or the fastest, this small restaurant delivers on taste.\n\nTry their beef noodle soup (4/5) soup tastes homemade and the noodles are plenty and chewy. Their green onion pancake and turnip cake (3/5) are deep fried instead of pan fried, delicious but probably a little overwhelming if you eat more than one piece. I also recommend the basil chicken (4/5) which has many levels of flavor and a great dish to share.\n\nOther items we've tried are dumplings (boiled and pan fried) (3/5) which were standard and rice cakes and Shang hai thick noodles (4/5).", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "I only order 2 things here: the beef noodle soup and an order of pot stickers. Perfect comfort food and still good even when you order it to go for pickup. \nThey speak Chinese to me but I do not understand what they are saying. Try the potstickers with red vinegar and hot sauce. Yumm.", "author": "Mari A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Family owned for 30 + years! They can serve to vegans & the decor is in pink shades. The prices are reasonable & the portions are huge.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "I gave Taiwan another try at the urging of the owner and it's clear the previous visit was an off day. Everything was fresh, well prepared and piping hot. \n\nI did some examination of my favorite Spicy Prawns, however, and realized the problem is that the batter is simply water and cornstarch which makes for bland flavor. I'm sure they used to put something else in there (when I make this dish at home I add sesame oil and soy sauce). \n\nBut that gives me justification to explore the menu on my next visit, so I'm good.", "author": "Otis M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-26", "description": "Probably the best pot stickers and xiao long bao on Clement St.  Amazingly my kids love this place despite its crowded and old decor.  Forget that they have a piece of rope tying the door to a pole so the door doesnt fly open\n\nNicknamed the Chinese Pink Palace this has been around since at least the 80s. They have a wok in the window where they make their pot stickers fresh!!\n\nWe ended up here on Christmas Eve.  As my mom says,  the only things you'll find open on Christmas eve are self serve gas stations and Chinese restaurants. As a matter of fact, many Chinese restaurants on Clement St. Were closed.\n\nNobody wanted to cook after Christmas Eve services so we drove along Clement St. Until we found some lights on.  We sat down overdressed and flagged down are waiter for some menus.\n\nWhen they are busy here, you have to flag them down for everything from menus, to more hot tea, to your bill.  It is not rude.  They just staff very thinly.  In fact I think it is a family run business.\n\nWe ordered the Jia Jia Mien ( noodles with meat sauce, beef chow fun, 2 orders of pot stickers (6 to an order) and an order of xiao long bao (6 to an order).  We ate it all up\n\nI give the food a 4 but the ambiance and service a 3. Parking can normally be a pain on Clement St., but not on Christmas Eve.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Very consistent... great pot stickers, chow leen go, dry fried string beans, green onion pancakes, and steam shrimp dumplings.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-13", "description": "The fried tofu was okay and the turnip cake was normal. The Taiwanese noodles were undercooked with two pieces of shrimp and half an egg. Definitely much better places in the area.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "I like this place. Variety food choices and the Chinese fried dough is really good. I definitely recommend this place to people who interesting to try new things.", "author": "Unyo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "When my friends say that Costco has the best potstickers I laugh and think to myself, \"You're all morons.\"\n\nNow this place has the best potstickers, fried bread, and Taiwanese noodles.\n\nI'm not a betting man, well maybe I am, but if I were to bet on one of the best homemade potstickers in the Bay Area, it would be this place.\n\nTheir portions for their noodles are enough for two people, and it's one of my favorite Asian comfort foods. \n\nThey also have the traditional soy bean milk (hot) and fried bread, which reminds me of my trips to both Taiwan and Hong Kong.\n\nSo if anyone tells you that Costco potstickers are the best, do what I do and laugh in their face, then send them here!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "I've been coming here for over 25+ years. Still original family owners. George was taken over now. Excellent Taiwan style Chinese food. Large portions of Beef Stew noodles. All of the bowl of noodles are large portion. 牛肉面, 炸酱面, 担担面。\n\nThey also make Northern style dough pastries. Their Chinese donut 油条 is the best in San Francisco Bay Area. 烧饼油条 豆浆。手工猪肉水饺，独一无二。", "author": "Will L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "The dumplings are disappointing.\nThe noodles are ok. The fried onion pancake is awful.\nI feel sorry for the mom and pop so I will come back for just the few items.\nNot authentic!!!", "author": "Alison W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "A great neighborhood \"stick to the basics\" Chinese restaurant. Taiwan restaurant has very tasty pot stickers, chow fun, and string beans. Friendly servers, and slightly tight fit to walk to the restroom. Location provides a lot of post dinner shopping and exploring; from a nearby aquarium pet store to green apple books, you'll be able to work off those pot stickers. Just note, lately Taiwan hasn't been very busy, but don't let that discourage you from stopping in. \n\nBottom line: Solid Chinese food. Order pot stickers.", "author": "Jaime W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "2 Words- Amazing food!!!\n I Recommend  the Dim Sum!!\nTaiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\nFresh Chinese donuts daily, and they are delicious with their fresh sweet soy milk! \n\nWhenever I'm in the area I have to come here because the servers are the best. Especially George, he always makes me laugh. The things we talk about together is just Hilarious.  \n\nSometimes when Im not feeling well won ton soup is the way to go. I honestly recommend this place because service is amazing, food is amazing, perfect atmosphere, and great prices.", "author": "Mr. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "It was a quiet weekend since my girlfriend was out of town so my buddy and I met up for dinner in the Richmond.  I chose Taiwan Restaurant since it had been some 10 years since I last visited with my dad.  I was looking forward to some authentic and nostalgic stuff.\n\nWhile not necessarily a dish from my past, I went with their salt and pepper pork chops.  My buddy and I also shared some of their boiled dumplings and won ton soup.  The food quality was good especially for the price, and the portion sizes were huge.  I really wanted to get some of my old favorites as well, but my buddy can be a bit pick at times.  I would definitely get the pork and the dumplings again, but I thought the wonton soup was a little bland.\n\nService was friendly but the food was brought out at different times when we really wanted it all at once.  The restaurant goers have changed over the years and this place has joined the ranks of the hipster favorites.  However, prices have stayed the same so that's always a good sign.  I would come back for their dim sum and small plates for brunch.\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "Taiwan has been my go-to Chinese restaurant for over 10 years. Service is quick and the food is fresh and tasty. Favorites include the Shanghai noodles, the pork and leek buns, twice cooked pork and any of the dumplings. Great place. Reasonable too!", "author": "Pierre K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "Been coming here for 30 years!\nStill authentic and has great Taiwanese dishes, though I do wish they would expand and add more dishes.\nTaiwanese country favorite sparerib and chicken... yummy.\nPotstickers the BEST in SF.  Nice and juicy inside, flavorful, and most importantly NOT deep fried, must be tender on top and golden brown crispy on the bottom (yin and yang).", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "I haven't tried anything else on their menu except for their pork chops so this is based only on that one item.\n\nReally tasty pieces w/ a slightly crunchy crust. It comes w/ pickled veggies. Order extra cuz it really complements the meat.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "From my first experience in this modest looking spot I was hooked! A buddy took me here and insisted on what he calls \"pork candy\" which was the pork spare ribs (dry salty rub, delicious!) They are f#$king amazing. I could have just these over steamed rice every day for the rest of my life and be happy. Then came the sizzling rice soup. so many amazing flavors! The pot stickers are also fantastic. My go to spot for any special day, friendly staff that always makes us feel welcome", "author": "Jack B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "Food five stars, deco one star, service one stars. We ordered bow and it was homemade and you can tell it's quite different from made by machines. Rice cake was home made too and delicious. Soy milk was home made so you can taste the slight burn smell. The tofu noodle soup was ok - was hoping the noodle has a bit more texture. Not enough servers. Deco was very dated and menu was dirty. We ordered three dishes and was only $16", "author": "Anya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-20", "description": "This place is like a landmark for one of the pioneering Taiwanese Restaurant in the city.  It has been here since I was a kid.  LOL :p  I have always enjoyed Taiwanese breakfast.  It is so different from Chinese.  The Taiwanese pays close  attention to sauces and they like to eat \"Tapas style.\"  It's just a whole different culture put together.  With that said, I'll keep this review short and \"sassy!\" I only come here for their Taiwanese breakfast, and I usually order their hot soy sweet milk, and their super fresh sweet deep fried Taiwanese donut.  They go hand in hand and a must while you are here.  You can even watch the chefs at front kneading the dough from start to finish.  It's an amazing feat! \n\nCheers! ~ :p", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "One of my favorite Taiwanese restaurants! I love their potstickers, perfection! Their beef stir fried rice noodle is right amount of flavor. The fried rice is perfect! I love most dishes from this place. I totally recommend.\n\nBut one plate I DO NOT recommend is the yam stuffed with mushroom and beef. It looked like you made your own glue paste. The taste wasn't fantastic either because the bamboo totally empowers it.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-17", "description": "Very so-so. Why is it so hard to find good Taiwanese breakfast in the city??\n\nOur party of 4 was seated without a wait around noon on a Saturday. We ordered tonssss of carbs (beauty of tw breakfast!) -- Chinese donut, salty soy milk, turnip cake, red oil wontons, salt and pepper squid, oyster pancake, and minced pork rice. Everything was just meh and lacking in a little flavor. I enjoyed the rice the most, but that's preeetttyyy hard to do wrong. My least favorite was the squid - it had too much batter and no flavor. Oh well, the search continues.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "My dad use to go here in his USF days. As a Hong Kong transplant, he searched high and low for semi authentic places. This was one of them. \n\nMostly Chinese people were at the restaurant, which usually points to some authenticity. Ambiance isn't the best, but we didn't expect much. Old restaurant, but everything seemed decently clean. \n\nWe ordered WAY too much food, as usual. Xiao Long Bao, potstickers, sesame noodles, and Sichuan beef. \n\nXiao Long Bao were big, hand made, and hot. I really enjoyed them. The potstickers were crispy and juicy. They were also pretty big. \n\nI was so focused on the dumplings, I didn't even bother to try the beef. It seemed overloaded with bell peppers though. When ¾ is bell peppers and the rest is meat, I feel a little cheated. \n\nThe sesame noodles were great! Very rich and filling, but the sauce was killer. We got meat on the noodles which really helped cut through the think sesame sauce. \n\nThe service was really good. Everyone seemed kind. Dumplings took longer than usual since they were super fresh. Our waitress was nice, and she even talked to me in Chinese. I kept up... Sort of. She was, however, a little shocked at how much we ordered. \n\nDefiantly a place to try and I will try and head back before my San Francisco summer is over. I really just want more potstickers!", "author": "Chandler H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Came across this place for the first time and man, I wish it was closer to my regular haunts!  The Sizzling Beef hot plate was served with crisp bell peppers and onions, and was pure perfection in a kind gravy for $10 and a lot of it.  The dumplings are very much Taiwanese style and both huge and packed.  Plenty of vegetarian and seafood options.  I would gladly come here again.\n\nThe final touch of authenticity:  The bathrooms that are simultaneously filthy and antiseptic... dirty looking with a mop pail and a drain on the floor, but smelling completely of disinfectant.  That's how you know you're at the real thing.", "author": "G M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "Honestly, its probably one of the worst restaurants I have been to in the Bay Area.  I ordered 銀絲卷and排骨pork rice, the deep fried roll was mediocre, but the pork rice was simply disgusting.  I don't understand all these 4 star reviews or even 5 stars.  In any review I give, I always try to be as subjective as possible, but the food here is really sub-par.  Taste of Formosa is a better choice in the area, however, it can be a bit salty in their dishes.  \n\nI am just puzzled at all these 4 and 5 stars given by the yelp users.  Questions for these people.\n\n1. Have you tasted authentic Taiwanese cuisine in California?\n2. Have you been back to Taiwan in the last 20 years?\n\nIf the answer is no, then I urge you to either take a drive to Cupertino or try Taste of Formosa nearby.", "author": "Cheng L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "Owners or chef has changed. Their Chinese donuts which used to be worth a trip over from mission is thick and too doughy now. Hot and sour soup was salty and not sour or spicy. The vegetarian dumplings had very thick floury skin and we ended up having to scrap the veggies out. The soy milk was sandy and not hot. \n\nI've been to Taiwan and this restaurant before and it's very disappointing. Never again...", "author": "Jannies L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "This is a great friendly restuarant. Been coming here for over 20 years. Is alway a positive here. Foods are good, better than any other Taiwanese restaurant in the bay. Very good price\ntoo. Friendly services.", "author": "Judy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "Don't order dumplings.  Not fresh.  Green onions pancake was deep fried, not traditional.  The fried rice had no wok fired flavor.  The soup was good and sweet and sour shrimp was really good,  not too tangy like other restaurants.  I was disappointed with service, very slow and up attentive.", "author": "casey j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "it finally happened.  took my Taiwan wife in.  this isnt our first time, and we dont remember our last visit. \n\nwhat finally happened?  we walked out.  yup..took one bite of each dish, got the check and left.  food was brutally salty.  and we got this dish we have eaten often.  it is a dish that is seasoned beef wrapped with a roti like onion pancake-ish thing.  (that is how i actually describe the dish to my wife so she can order it)..what we got was comical.  i kid you not, it was wrapped with a tortilla.  not a Chinese wrapper..a Mexican tortilla.  and the thing was a salt-lick.    food was cheap..we spent $20 and still left a tip..but we just got up and left.  no sense wasting a togo container..  one dish had that salted pickled veggies.  they didnt rinse the veggie before cooking with it.  wow..it left your mouth tingly it was so salty.\n\nand that place has gotten filthy.  no thanks.", "author": "Cliff L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-31", "description": "We stopped in for some Taiwanese food because we saw the layout of the Chinese doughnuts (crullers) displayed in the window along with other fried bready things. Once we sat down and perused the menu, we were really disappointed because there really wasn't anything Taiwanese on the menu. There were a lot of regular dishes and a handful of Taiwanese street food like fried oysters with egg, but that's it.\n\nWe settled on some salty soy and salty tofu, but was told they didn't have the latter. So salty soy milk it was plus some Chinese doughnuts.\n\nThe doughnuts were terrible! They weren't crispy on the outside and airy on the inside. The texture was like bread, dense and chewy. The soy milk had no flavor whatsoever. They didn't season it nor did they put much condiments in there except for some dried shrimp, scallions and preserved vegetables. Where was the pork sung? How about soy sauce, vinegar and other things to flavor it?\n\nWe didn't order anything after that. We moved somewhere else for food. I don't recommend it for Taiwanese breakfast!!!", "author": "Anita L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-13", "description": "I gotta say, you have to know what's good here in order to like this restaurant. \nThe noodle soups are pretty much terrible and not worth it. Same for their dumplings.\nI went here today with my mother and uncle. The restaurant feels like a hole in the wall, this place hasn't been updated in decades. flies were everywhere. it is a bit dumpy and dirty. That would be fine, as long as the food is good, that's the most important thing. We ordered 3 dishes, the fried pork rice plate, japanese seafood noodle and this beef noodle soup dish. Of the three, the rice plate was the best. it had a sweet and spicy sauce with a real kick to it, and a very large portion. I think the rice plates are the better items to get here. Those are the safe bet, and u'll get a very large portion. they didn't skimp.\n\nWhat was terrible were the noodle soups. Japanese seafood noodle was just flavorless, bland and average. For a pricey dish at $9, it should've been better. it was a risky choice picking this.  I thought it was a stir fry dish by the title, like a stir fried udon dish with seafood. so i was surprised it was noodle soup in a big bowl. it was a clear broth with udon noodles, shrimp, shellfish, green beans and carrots. it had absolutely no flavor to it. My uncle's beef noodle soup was just ok too. The noodles were oddly gummy textured.  Portion wise, both are good on that front. \n\nOverall, there are many other better choices on Clement and nearby here. If you do come here, order the safe items.", "author": "Jim D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-06", "description": "Avoid this place if you have a food allergy or restricted diet. Have celiac, have to eat gluten free, ordered an egg flower soup, confirmed with the waiter that it didn't have flour or soy sauce, etc. Ate it, was a bland rendition of the dish, ended up sick all night because it had something in it I couldn't eat. Will not ever eat here again.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "If there is one thing that this cat loves, its restaurants that I can always count on to bring great food at a great price when I need something quick and easy. and for me, Taiwan restaurant is exactly that!\n\nI have been dining at Taiwan restaurant frequently for years, and I always bring friends and family here as well. Why you ask? Simply put, I can always leave this restaurant feeling very full, satisfied, and not broke. \n\nhere at Taiwan, they definitely have your standard sort of Chinese restaurant menu items, but a look further Into their menu shows many things that are not so common and unique. The menu is HUGE so take your time looking through. if you find yourself wondering about a dish, asking the server always brings a very detailed description on what the dish is and how it is prepared. very informative. \n\nI will say, Taiwan restaurant isn't the cleanest and nicest looking place in the world, but don't let that be a turn off as I can honestly say that the food served here is honestly wonderful, and doesn't feel greasy and salty like many other Chinese places. \n\nbeen coming here for a long time, and will definitely continue  to do so! \n\n*chirp!*", "author": "Jei C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "This place seems hit or miss, as our friend has been going here for years, yet when my family went, it was definitely more of a miss (though they did say their main chef was actually in Taiwan, so some of the dishes we couldn't even order with him being gone)\n\nWe got several staple Taiwanese dishes, beef noodle soup, stir fry rice cake, fried tofu, xiao long bao, salt and pepper pork chop, stomach, eggplant, and sweet and sour fish. Sadly, my family was not pleased with majority of the dishes, the beef was tough, the rice cakes were not cooked well, the stomach was way too tough, etc.\n\nThe upside is the staff were relatively attentive, there was plenty of seating on a weekend, and the prices were reasonable.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "This place was just okay for me? I went with another Chinese-American friend, and admittedly, neither of us can really articulate the difference between (various) Chinese and Taiwanese food. What we got (vegetarian mu shi; eggplant; and green onion pancakes) didn't help.\n\nI will say, though, that the service was generally great! Sure, we didn't get any menus handed to us when we sat down, but the woman taking our order was super attentive and clarified any questions we had about whether or not there was hidden meat in the food (note: this was all in mandarin). Gotta love that!\n\nSo, overall, no complaints, but also nothing to write home about. :T", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "My mom was on the hunt for Chinese doughnuts (油條) this morning. She knew that Taiwan Restaurant was likely still closed since it was so early in the morning, but decided to walk by anyway. One of the workers, an older man (perhaps the owner...?), was at the window making and frying the doughnuts. Although Taiwan Restaurant was indeed closed, my mom waved to him and asked if she could buy two, and he agreed! So nice and great customer service even though they weren't open yet! Only 三塊 or 2 for $1.50.My mom left a happy customer. It's quite satisfying getting something fresh off the presses, or in this case, fresh off the oil. :)", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Hot fresh soy milk - a giant bowl of the stuff sweetened with a little sugar - is this not the most perfect breakfast? It's filling and nutritious and I guess if you were being sensible you'd stop there... but of course I didn't and ordered dry fried beans and XLB dumplings too.\n\nThe filling in the dumplings had excellent flavour, but the skin was a little thick and stogy. The beans were amazing...I love that it's listed as \"vegetarian\" on the menu but is really just a guise for eating sweet and salty mounds of ground up fried pork.  YUM!\n\nOver order because you can take home everything you don't get through (such a novelty for this Australian).", "author": "Tresna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "Taiwan Restaurant is a valiant effort but ultimately suffers from the problem I have found in most of SF's other non-Cantonese Chinese restaurants: Ambitious attempts at replicating the classic dishes of the region are compromised by staff who don't actually understand how to make these dishes and who are catering to Western palates. The result is a confusing hodgepodge of offerings that don't really bear resemblance to one region or another.\n\nBeef noodle soup: Nice noodles but bland broth. Slightly overcooked beef\n\nShredded pork and mustard greens noodle soup: Very good. The mustard greens were fresh and abundant, cooked to crunchy perfection. However, the broth was lacking in pork flavor\n\nXiao long baos: A little too watery, though the skins were pretty good\n\nVegetarian dumplings: Adequate, but not really like the Taiwanese vegetarian dumplings I'm used to\n\nSticky rice: Very good. Perfect combination of soy flavors + soft, sticky rice + flavorful meat\n\nOyster pancake: This would never pass muster at a Taiwanese night market. Too much egg, not enough oysters. Also, overcooked\n\nThe people are really nice and the area is quite spacious (good for large parties). However, I wouldn't go out of my way to come here if you're craving Taiwanese comfort food. Unfortunately, I haven't really come across a decent alternative in SF.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "BEST CHINESE FOOD IN San Francisco!\n\nHere is why: I have been coming here since I was 5 years old and that was a long time ago! The flavors are consistent as to when I first remember which is a rarity, trust me.\n\nPot Stickers - Order these and you will thank me. I have had these dumplings from every restaurant in SF and these BY FAR are the best. (Just make sure you make a nice Soy Sauce, White Vinegar, Hot Sauce) to accompany these. \n\nWar Won Ton Soup....One word, Amazing. (I get it with noodles, makes a fine meal)\n\nChinese Spaghetti with meat sauce. Simple and Delicious.\n\nGeneral Tsao's Chicken: Order it old school way, not friend but saute'd - another favorite. Get an extra order and next day, make a 3 egg omelet with milk and add this dish to it. Again, trust me on this one, delicious!\n\nSpicy String Beans - 5 Stars\nSpicy Chicken Wings - 5 Stars\n\nCan't say enough good things....just go here and enjoy!", "author": "Robert N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-31", "description": "The food was fair.\nI've ordered a Chinese sweet donut, but it was undercooked.\nThe environment was not okay. Water was dripping through the ceiling (second table near the entrance)\nI don't think I will come again.", "author": "Vickie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "I've gone to this restaurant over the past couple decades whenever I'm in the neighborhood. My father likes this place because the food isn't greasy or overly salty. I've always had polite service here but then I've been told I'm not very demanding. Still, I can discern the difference between being neglected and treated rudely from decent service provided by a family-run business (not polished but still taken care of well).\n\nAs with most restaurants, there are a few reliable dishes on the menu and I stick with those when I want a guaranteed good meal. My favorites here are the dry braised green beans with meat, mustard greens shredded pork noodle soup (omg! such comfort food), Taiwan country favorite spareribs, red snapper filet and the very simple/plain chicken chow mein (they use the thick Shanghai style noodles for this dish).\n\nI love the down-homeness of this place. Not fancy or new, but still comfy seating with my one of my favorite soup noodle dishes in town.", "author": "Everso T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "I was born and grew in Taiwan for 30 years before moved to the States, so I can tell if it is authentic Taiwanese foods. We went to this restaurant while we were in SFO, and wanted to tried it out. The menu looks very Taiwanese, with some unique Taiwanese items. We ordered some and found out that the tastes were more like Chinese, nit Taiwanese.\n\nHowever, the tastes were still quite good, if you were not looking for true Taiwanese foods. The interior was not great, but clean enough to dine in. The service were OK too, not too quick but friendly. Best of all, its price was very affordable comparing its big portion. Will come again next time when we visit again.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-28", "description": "They are well-known for their Chinese donuts here, which are made fresh daily - goes perfectly with porridge! Came here with my mom and sister and had their soymilk, which was good - not to sweet or bland. We had their flat rice cake noodles which lacked flavor and their dumplings were not tasty. Their dumpling skins were too thick and hard, and lacked soup inside the dumplings. Probably won't plan to come eat here unless I want the donuts or soymilk to go.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-24", "description": "We never deviate when we eat here.  \n\nPork chop with soup noodles. \nBraised beef ligaments in soup noodles.\nPan fried potstickers.\n\nIf we do family style we always order the dry fried green beans and the eggplant in garlic sauce.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "Authentic Chinese restaurant. Really like this place. Food is always good. Never had a problem. The owners are very friendly; their English might not be very good but they manage. Highly recommend the fried pork chops and the onion pancakes.", "author": "Celia Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-26", "description": "This place is NOT anywhere close to an authentic Taiwanese restaurant so if you are looking for decent taiwanese food, please do not come here because you will be very disappointed. This is the worse Taiwanese food I have ever eaten in the bay area!\n\nOyster Vermicelli - The noodles were too thick, the sauce was off, the flavoring was wrong and everything about the dish was nowhere close to what it should be except that there was oysters and noodles in the dish.\n\nWhite Turnip Cake - the only decent dish we ordered although you can make better turnip cake buying it frozen at an asian supermarket and cooking it yourself.\n\nSoy Milk - very bland, did not taste good.\n\nOyster Pancake - the worst mix of batter, eggs, spinach and oysters. It tasted more like a thin layer of egg and spinach with a few small oysters thrown in there and batter mix. They didn't even use the right sauce on top.\n\nChanghua Meatball - too much shell, not enough ingredients - it did not taste right.\n\nSticky Rice Lotus Leaf Wrap - worse than any dim sum place I have been to, the rice was too hard and there were few ingredients inside. \n\nNONE of the items we ordered tasted good and they put oyster sauce on top of everything which isn't even the right sauce that goes with any of these food items. It was a poor attempt cooked by someone who clearly does not know what Taiwanese food even taste like. I was quite disappointed. This restaurant should not be called Taiwan Restaurant because it is nowhere close to it.", "author": "Peggy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "I've been going here for more than 20 years.  The Spicy Shrimp is very good.  The owners work here and the food is very good and the prices are reasonable.  Their lunch special is a very good deal and whenever I'm in the area I try and go followed by some beers next door at the Bitter End.", "author": "Harrison P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "It's really 3.5 stars. Xiao long bao was okay, but their you tiao was delicious and fluffy. The service wasn't the best because they're understaffed, but the people there are really nice. \n\nReally liked their stirfried rice cake and their Tainan noodles. :) I would come here again for some you tiao again!", "author": "Belyn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-16", "description": "Please read before coming here!!!\nWanting to bring my Taiwanese grandparents here for a final lunch before they were off to the airport I though Taiwanese would be appropriate. \n\nHow greatly disappointed I was, if 0 stars was possible I would give it. My problem with this restaurant is the fact that they sell themselves as a Taiwanese restaurant but it's about 0% authentic in the food.\n\nFirst of all you know you were in trouble when there wasn't a single Taiwanese staff. I would have left if it wasn't for the did fully of my grandpas wheelchair. \n\nNow about the food: \nthe minced pork rice: terrible, the rice had clumps and tinge meat was literally just ground beef. Authentic minced pork has fat to make the dish more flavor for and rice shouldn't have inconsistent lumps in them. (I think the rice was frozen)\n\nThe dandan mian: the meat looked raw (pink) and it was drenched in peanut butter sauce. Sorry I didn't order peanut butter noodles! \n\nThe 彰化肉丸 was most likely frozen and just heated up. The skin didn't have any of the chewy texture that makes this item delicious.\n\nThe oyster pancake: first off the sauce was all wrong, oyster pancake doesn't mean oyster sauce on top..... \n\nThe sticky rice, the rice wasn't sticky and the pork on top seemed old it has the frozen meat taste. \n\n牛肉大餅 sorry but I didn't ask for a flour tortilla with red looking beef and drenched in sauce. Nough said. \n\nPlease save yourself money and don't come here and make the whole family sad! \n\nPositive: it's cheap", "author": "Catherina W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "Taiwan restaurant has been around for decades. decor is beige walls. minature red lanterns and like facsimiles hang from the ceiling.\n\neats:\n-xiao loong bao: 6/3.95\ngolf ball like with lots of meat inside but no juice. no red vinegar provided,  just ginger\n-lamb noode soup(6.95)\nbroth had lamb, green onion, and msg flavorings\ntender lamb meat on bones\nnoodles commerical type, tab mushy\na few pieces of spinach also present\n\nleftovers:\n-cheap eats, dumplings @4.95,  potstickers @3.95\n-quality of food just so so, portions above average.\n-english spoken here as well as mandarin.\n-service adequate.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Taiwan Restaurant may not look like much, but this place has THE BEST dan dan mien, fit to appease the gastronomy gods.\n\nWhat is are these foreign sounding items of deliciousness, you inquire?\n\nDan Dan Mien are noodles topped with a generous heaping of spicy or peanut sauce. The noodles are traditionally freshly pulled thick noodles made in house. The name of the noodles come from the \"dan\" merchants use to peddle the noodles in China. Also, \"dan\" means \"bouncy\" or \"springy\" in Chinese, which perfectly describes the process of how the dan dan mien is made, as well as the texture of the noodles when eaten. But, enough about the history of dan dan mien.\n\nOn my most recent visit, we ordered the Xiao Lin Dumplings and Hot and Sour Soup to start off. Xiao Lin Dumplings are fickle creatures. The chef made them amazingly juicy and tender with the right amount of broth in each morsel. Dipped in red vinegar, it makes you crave for another. The hot and sour soup was standard, nothing special about it. I will give credit because it's not overly sour, which is always a good thing.\n\nOur main course is the dan dan mien. I ordered a garlic peanut sauce one because the classic has always been my favorite since I was a child. My friends ordered the spicy flavored one. We ended up eating the noodles family style, split into smaller bowls. Why? Because the portions of these dan dan mien are HUGE. One bowl can serve 2-3 people. But it's not just quantity, it's also quality also.\n\nThe garlic peanut version had a milder taste, the tones of peanut and garlic meld together with the creamy noodles, it's very rich and filling. The spicy variety is also very buttery, but has a spicy kick to it. It's not Sirarcha-worshiper spicy, just enough to go with the rich creamy texture of dan dan mien.\n\nService here is slow because there's only two waiters, the owner and a hired employee. Atmosphere is very casual and the decor is drab, but that's because they spend their resources on making good food. They tend to the taste buds, not the eyes.\n\nBottom line: Delicious dan dan mien. Try it~", "author": "Anna F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "I use to come here as a kid and I decided I would revisit this place because we were hungry and did not want to wait in a line. This place has the usual food that you can expect from dumpling kitchens everywhere but they have very cheap prices. \n\nI ended up getting a shanghai rice cake, soy milk and xiao long bao and it was all for under $20! The rice cakes were okay I wish it had a little bit more flavor but it was a big plate. Can't go wrong with the soy milk and it was a big bowl of it for about $3. The xiao long bao was not all that great and had no soup in it but I can't complain cause the price was so cheap. \n\nI did see another table eating different types of dumplings and pot stickers that looked quite appealing and delicious so I think go for that over the xiao long baos. Overall the service was friendly and the food was cheap.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-16", "description": "Coming from an American and Taiwanese perspective, \nThis is literally terrible. \n\nAt one point a tortilla was served to us. A Mexican tortilla.\n\nThe service was also very bad. When we questioned the color of the meat on whether or not it was cooked, the waiter became very gruff and rude. He insisted that it was cooked without even a glance at the meat in question and walked off.\n\nEvery item that was carbohydrate based was extremely doughy and hard to swallow.\n \nI applaud their efforts at an eclectic assortment of food but they really couldn't live up to any of the dishes. What good does making hundreds of half assed food come to? Sad stomachs, broken hearts and an honest yelp review.\n \nDon't come here. The highlight was the tea.", "author": "Isabella W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "Order the Fried Chicken, it was very dry, not fresh re heated old fried chicken. I hope it was not chicken from others left over plates that they served me. Sorry it was gross. KFC is even better. Won't be coming back.", "author": "Unus U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Wuh? So I've been living in the Inner Richmond for over 10 years now and yesterday was my first time in here!\n\nGoddamn, their food is cheap. Why have I not stepped in here earlier.......\n-FREAKIN CHEAP!\n-Good portions for the price!\n-Decent food!\n-Pretty clean!\n\nI will def come here again since I only had the potstickers, dumpings, a noodle, and an eggplant dish.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "Me and my family visited this location earlier today. We ordered Hot & Sour soup, 2 orders of potstickers, general chicken, and spring rolls.\n\nThe Hot & Sour soup was excellent! It came out fast and was delicious.\n\nThe potstickers are outstanding. Every single time we visit SF we get these potstickers. They're so good! It came out last though.\n\nThe general chicken was the best I've ever had. Perfect amount of flavor.\n\nAnd last but not least, the spring rolls were out of this world! The best we've ever had! \n\nService is amazing!", "author": "Isabella K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "I think we have finally found our go to Chinese restaurant too bad it's clear across the city, but so totally worth it. we've been going so frequently that the owner (the older Chinese man) and a good deal of the waitresses know my brother my face.\n\nTheir rice plates are such a great value for under $6 and include soup and fruit at the end. My brother likes to order the general tso's rice plate. And my favorite would be the dry fried green beans with your choice of meat (beef, chicken, or shrimp) I normally get the shrimp. The general tso's has a bit of a vinegar like tang to it.\n\nOur other family favorites are the potstickers, the taiwan special spareribs, the green beans, the braised flounder, and the braised fish filets.\n\nWe've been adventurous lately and have been trying some other items in the hopes that we could include them in our repertoire. Do NOT order the taiwan special chicken. We thought they would be like the spareribs... soooo NOT the same. Totally different preparation. The spareribs are prepared like the San Tung Chicken wings with basil a top. The chicken was prepared in a clay pot and resembled and tasted more like chicken adobo. The hot garlic chicken was another fail, thinking those would be good. They were chicken wings prepared much like the General Tso's chicken, but less saucy and not even the slightest bit hot or even garlicky. Both big disappointments.", "author": "Dina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Good food at a good price!  Fast service !  Simple and enjoyable!", "author": "Thomas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Their lunch specials are really good and the service is decent and the food is great and the bathroom is clean! What more can you ask for?\n\nI like the rice plates and lunch specials and the dumplings are good too. It's not too crowded during lunch hours but I always stop by after 3pm and it's quiet and peaceful. \n\nGreat place to eat alone too.", "author": "Gangsta G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Their beef noodle soup was very good. I got the half-and-half (beef/tendon) - but the tendon was so tender I'm going 100% tendon next time.", "author": "Lulu B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "Their Wonton Soup is a magical remedy worth driving across town from The Mission (or a short hop from Kaiser). Cures all ills, banishes evil, add a hot sake and there's nothing better when you're feeling sick.\n\nPrawn w/ green beans, Shanghai dumplings, & thick noodles are great too.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-17", "description": "Haven't been back in years and some plates remain the same while others completely lost their flavor. The tofu plate should had been spicy but the only heat was the kind that burns the hand. The noodles plate was dependent on the sauce for flavor. The intestine plate was the best, but not made the way listed.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "Quick, inexpensive and ample lunch.  Lunch specials come with soup and  white or brown rice.  The brown rice costs a bit extra. \n\nI got the asparagus prawns which had at least an entire bunch of asparagus and lots of shrimp in a tasty black bean sauce.\n\nThe lunch special servings are at least two - three meals worth.  No one offered to wrap up the leftovers but since I had another half day of training and a long commute home, I probably wouldn't have taken them up on the offer anyway.", "author": "Emily J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-01", "description": "The food is okay. \n\nI got the beef soup noodles and the bf got the asparagus prawns + rice. Meh. Edible, but not great. \n\nThe portions are HUGE! I think I ate about 1/8 of my noodles and became full. This is the place if you want the bang for your buck. \n\nI'm hoping there's better Chinese food in the area. I wonder the location in SF also owns the one in Berkeley. The Taiwan Restaurant in Berkeley is significantly better.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "Wonderful for breakfasts especially the freshly fried you tiao 油條, pot stickers, and warm soy milk. For those who haven't had fresh soy milk, I do recommend savory if you are more adventurous. \n\nThey also have really nice rice cakes/noodles 年糕  in both soup and stir fried form which are not so common to find. The service is prompt and friendly. I will definitely go again.", "author": "Jimi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-27", "description": "This place was 'meh'. We had red beef noodles and fried pork chop. It didn't come with an egg.  Bleh. \n\nThe interior needs updating.  \n\nThe search for good Taiwanese food in SF area begins again...", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-04", "description": "I was craving taiwanese beef noodle soup so thought I try this place. \n\nI ordered:\n\"original\" beef noodle soup - it was decent.   Broth was pretty good, fair amount of beef chunks tho somewhat bland. I have had better back east (nj).\nBeef crepe - tender, tasty. Would be better  if they use softer doughier pancake, added scrambled eggs and topped with some oyster sauce.\n\nI would come back to try their Taiwanese breakfast menu.", "author": "Cheung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "My fave soul food comfort food place. Almost homey cooking but with enough polish to justify eating out. A neighborhood stalwart. The noodle soups are good go tos, with thick noodles and tasty meats, as is the fried string beans. Parking is hairy.", "author": "E. W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-17", "description": "In my constant quest for great Chinese food in the bay area, my friend and I visited Taiwan restaurant for their Chinese breakfast and it was heartily disappointing.\n\nThe bad: The chinese donut tasted oddly savory, their fried daikon cake was just deep fried and greasy, the oyster pancake was sludgey and I think the worst part was the pork buns. The meat was overly spiced and weirdly grey, and after a couple of bites we stopped eating them.\n\nThe good: There were several Asian families here (always a good sign) and most of them ordered entrees like stir fried noodles or rice, which I'm guessing are the strengths here.\n\nAmbiance: Chinese family style restaurant.\n\nOverall: Not somewhere I would return. A poor effort at re-creating good Chinese/Taiwanese food, but maybe we just didn't order the right thing.", "author": "Jackie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-03", "description": "Sure, they do have real Taiwanese dishes like three cup chicken (they called it Taiwan country famous chicken), street food, and freshly made northern breakfast items like soy milk, baked cake, twisted dough, etc. However --- all of them were bland and like the worst versions one can make that is still edible and resembles the dish it's supposed to be. \n\nThe twisted dough and fresh soy milk were the only two items I thought was ok. The red bean bun had a very doughy texture. The spicy wontons had very thick skin (not desired) and the sauce wasn't flavorful enough. The sticky rice cake contained only two things: sticky rice and bits of meat and it was close to falling apart -- a good version of it would have the sticky rice very sticky forming a pretty pudding shape, filled with sumptuous meat, mushrooms, dried shrimp, topped with a hearty sauce.\n\nIn other words, going to this place when you crave Taiwanese food is like, going to Pizza Hut when you crave pizza and going to McDonalds when you crave burgers.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Food here is totally not authentic Taiwanese food.  I can only say the food is trying to mimic Taiwanese, but the taste is far from the authentic, delicious Taiwanese food.  There are many other Taiwanese restaurant way better than this.  Not recommend.", "author": "Kyle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "It's a Neighborhood gem.  I've been coming here for more than 15 years.  Good things to get is  Taiwan country spareribs, pickled cabbage and pork noodle soup, pot stickers, all their dumplings are also good.  Everything's at a reasonable price.  Come and try it out.", "author": "hannah t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Food: \n- Vegetable and pork dumplings are very, very good. Generous portions. \n- Pork buns were huge and extremely tasty!\n- Schezuan noodles were very tasty, but a bit heavy on peanuts and not as spicy as I'd though they would be. Would still order again.\n- Wine for $2.25 a glass! \n\nAmbiance was fairly plain. Walls are an odd pink/peach combo. Not a fine-end decor. \n\nService was a bit slow, and they didn't check back after dropping off the food. Took a while to get a bill, so don't come here for service, come here for the food.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-23", "description": "I've eaten here a few times for lunch. Standard Taiwanese cuisine. It's good for what it is. I would be giving 3 stars but my last visit ruined it for me. I was eating my shanghai noodles when I discovered a fortune cookie wrapper embedded in the noodles. I don't even want to know how that got in there. Informed the waitress and they made a new order. I like my fortune cookies after my meal, not in it. Definitely not kosher.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-16", "description": "Review is for pork chop rice only. It might be harsh to judge a restaurant solely based on its pork chop rice, but two dishes are Taiwanese staples: 1) pork chop rice and 2) beef noodle soup. Reasonable to expect that a restaurant named \"Taiwan Restaurant\" would at least have decent versions of these dishes. I should have been wary and walked out when the servers started using Cantonese.\n\nThe pork chop rice here at Taiwan Restaurant falls flat. The pork is overly seasoned and too sugary. In addition, a proper pork chop rice needs its small accoutrements (shredded sour vegetable, ground pork sauce, roasted egg, garlic-steamed bok choy or cabbage), the only one present here was the sour vegetable. Say nothing of the poor decor, grungy dark restaurant, Taiwan Restaurant is not worth coming to if you're looking for authentic Taiwanese cuisine.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Skinny:\n\nGreat food\nGood prices\n\nwe sat at a table with a couple and their son and we had a blast - great conversation and good service - or should i say typical of restaurants like this - people are nice but you have to speak up.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Don't sleep on this spot if you're looking for consistently great Taiwanese style fair. Best Hot & Sour soup I've had in SF and the General Tso's Chicken is legit...", "author": "Jack F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Came with a foreigner (!) and introduced him to some classic dishes.. the \"fish flavor\" eggplant, mapo tofu, and turnip cake. Everything was pretty good, though not at all spicy. They must have assumed my friend didn't eat spicy.. BUT I LOVE SPICY GIVE IT TO ME YOU JERKS. You know what happens when you assume? Not only do you make an ass out of u and me but I get really sad. The dishes were huge but we actually finished everything.. that's how good it was. The server was super sweet. Also they have brown rice, bonus! AND they take credit. OK fine you get 4 stars (on chinese resto standards).", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "FINALLY! A good Taiwanese restaurant to get some good ol' Taiwanese breakfast! I can't believe it took me to long to finally come here and get my fix.\n\nOrder:\n1. Chinese donut made fresh and crispy\n2. Sweetened soy milk --it's not actually sweet because you have to put sugar in it. THEN you dip your chinese donut in there! TOTAL WIN\n3. Sizzling rice soup - SO good and totally hits the spot\n4. San Ba Ji (3-piece chicken) --a Taiwanese staple. Takes 20 minutes to cook though so be patient\n\nThere was so much more on the menu I didn't get to but if you are looking for a Taiwanese breakfast fix, this place totally does the trick. Ever since I moved up here, I've been craving a spot like this so this just made my entire weekend.\n\nDon't come here expecting some fancy nice decor. The questionable cleanliness of the whole place is what makes it so authentic and endearing.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "san francisco taiwanese breakfast search...outer richmond location...small and unassuming...find by address number...leaving it up to the taiwanese sister to order...but, requesting fresh donut sticks and sweetened warm soy milk....a bowl to of soy milk to share...perfectly lightly sweetened...jar of sugar to sweeten more, but not needed...hot crispy outer and fluffy inner donut sticks...deep fried goodness...a dip in the sweet soy and tasty....crispy fried onion pancakes good...double stack portion and filling...thick and fried bubbling crisp...platter of dumplings decent...little hot oil and soysauce self-made to dip...quite the large servings...an order of the oyster noodles finding hefty, thick saucing and oysters loaded....tasting not fresh and the least favorite and biggest entree....about $sixteen total breakfast for two with plenty of leftovers boxed...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "One of my favorite Taiwanese restaurant since I was a kid. Ordered their sweet and sour soup, potstickers, Mandarin beef and their meat sauce noodles. The food here always tastes so good and you get a lot for the price. The service here is very fast and your orders come fast. I would also recommend their Shanghai dumplings and their Chinese doughnuts where in San Francisco is very rare these days.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "I've been craving chinese breakfast for a while.  I came here on saturday, hoping they would satisfy my craving.  Sadly, I don't even remember what I ordered.  I remember the serving being on the larger side and liking the green onion pancake.  Cool to see the guy making chinese donuts in the window.  Anything memorable...probably not...", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-23", "description": "I'm going to be completely honest here. Nothing about the dumplings or the niou ro mien (beef noodle soup) is authentic. The dumplings are just steamed or boiled pot stickers. And the beef noodle soup is simply what the description is; a soup with noodles with beef in it. Although they were tasty, neither dish(es) are authentically Taiwanese, as the restaurant suggests it is. \n\nThey used lo-mein noodles for the soup, which are not as bouncy and get soggy too fast, and they do not include the pickled mustard greens and use spinach instead. I also sensed there are some spices missing, such as star anise. And the dumplings' filling seemed wrong, as if it was just the same salty pot sticker filling. It should have been made with a consomme that liquifies during cooking which makes them juicier.\n\nSo, basically, if you were to go to Taiwan, you would never, ever, in a million years, find these dishes served this way, period. These are pretty much Americanized versions which had to be adjusted due to inexperienced American palates. And unfortunately, if you do not have the opportunity to travel to the real Taiwan, then the only authentic way to get the real deal (in San Francisco) is to find a Taiwanese person to make a home cooked meal for you.\n\nI believe the owner of the restaurant is truly Taiwanese, so I hope one day the public will be ready for the real deal. When and if this ever happens, I will be there every single day at least for breakfast!\n\nAnyway, I will say that the service is very good here. They speak English, Mandarin, and Cantonese. I have yet to hear Taiwanese, but I would not doubt that they probably speak it too. The menu is also quite extensive, and there is a good variety of Americanized \"Chinese\" food, mixed in with some \"authentic\" favorites. It is a rarity to find Taiwanese food in San Francisco, so I will give them a lot of credit for even having the option. Also, the dining area, china and flatware are clean. So, I will be going back, and I will recommend coming here, mainly due to the lack of alternatives for Taiwanese food.\n\nOh, and one thing I found authentic about this establishment was the restroom, which was authentically dirty, just like in Taiwan!", "author": "Lizzie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-13", "description": "I've been here on and off with my family for years.  Its good for Taiwanese food. The XiaoLong Bao and Potstickers are amazing! They really have great chef's in the front.\n\nDown side? Service.  Its so bad that it takes away a lot of the pro's of the food.  Its filled with self-hating Asians...\n\nA while back, I went here and there was somewhat a line.  After waiting a while, the waitress seated some non-Asian people who walked in after us.  She claimed these people came before us and just walked back.  Sure...   During the meal, the waiters were always great to serve the non-Asians, but we had to request several times for more tea, our FOOD and even the check. Serious?  You people are lagging when I want to give you MONEY?!\n\nAnother down side - its crazy crowded in there. I know you're trying to shove as many people in as possible, but GEESH.  If the guy behind me has to bump his chair into me EVERY TIME he breathes and you have to contort into a strange shape to get to my table...maybe its time to re-think the layout?? \n\nFor the super savvy genius - Order take out. Come pick it up with non-Asians  Leave with your good food. Don't look back.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-23", "description": "I came here with pretty high expectations. My girlfriend is Taiwanese and this place is a couple minutes away from our apartment, so it felt like a good match.\n\nAfter reading reviews, we figured we'd go with the dan dan mien, xiao long bao and green beans since everyone else seemed to praise these dishes. In the end, however, I was a little disappointed. Maybe I hyped it up too much heading into it, but it wasn't as good as I thought it'd be. The mien was a little bland, the xiao long bao were not xiao (small) at all and were just OK. The green beans were all right though.\n\nI read someone else say that the taste fluctuates from bad to good, depending on the day so hopefully it was just the day we came by. The place was clean and the service was real nice. I have no complaints. I just wish the food was a little bit better.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Sizzling rice soup is yummy. I also like the pickled greens with squid. The dumplings are also yummy. My favorite Taiwanese restaurant in SF so far.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-21", "description": "This used to be one  of my boyfriend's favorite restaurants,  He still comes here quite regularly on Sundays, and he's taking me 2 or 3 times now.  Every time we come here, he gets a little nervous and says, \"I hope it's good today...\"  Apparently, the flavor fluctuates...a lot.  \n\nHe keeps taking me here because he claims this is the beef noodle soup I am looking for--good brown broth, chunks of beef, fat noodles, a little spicy.  Every time I go, it's pretty good, but not great,. The broth is a bit watered down.  \n\nTheir pan-friend dumplings are always pretty good--though last time they were a little watery? which was weird.  \n\nThe kicker was when we ordered the sweet Chinese donut.  I did not enjoy this at all.  It needed to be warm or soft or warm and soft.  \n\nThus said, it's cheap, and still pretty good.  I'm looking at another review of this place, and it says to try the dan dan mein.  I LOVE dandan mein...maybe I would go back just to try that ...", "author": "Aly A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "This restaurant is a small, quaint building located in the Richmond District.  The food is tasty, but is high in salt, so if you have health challenges it may not be for you.  They also use soybean oil- not healthy.  The service is adequate, but not as attentive as I prefer for my dining experience.\n\nPart of the reason it receives 3 stars as opposed to 2 stars is because of it's super cheap prices.  3 of us ate for about $25.  We ate family style and ordered 3 pork buns, prawns and asparagus, steamed rice, and beef chow fun.  I also ordered a glass of plum wine which was only $2.50.", "author": "Mieke B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Great place ! I ordered the clay chicken, it was a HUGE portion, tasted great, had good amounts of sliced ginger and basil in it. we could barely finish it. Definitely one of the best values in town", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "This place is great! Had no issues ordering vegetarian plates. The woman was very helpful and understanding that we didn't want any meat in our dishes.\n\nThe soy milk is quite good, like many have said. I didn't personally want to sweeten the soy milk, but I could see why people like it as a dessert with the donuts.\n\nI'd go back again for another giant yummy meal. As others have said, the portions are huge, cheap and good.", "author": "Ninja R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "I really like this spot!\n\nThe service here is good and food is good, too! (except for the oyster noodle dish, which was prepared incorrectly).\n\nThe Taiwanese country chicken (I think that was the name) - DELICIOUS!\nThe spicy oil dumplings are good, and the green onion pancakes, too!\nOh yeah, the soy milk is good as well, so is the Chinese fried dough thing (not sure what it is called in English lol). I like to eat them together (dipping the fried dough in the soy milk).\n\nThey serve dim sum all day (small selection), which I love.\n\nWe've eaten there about 3 times between December and January, so that says a lot.", "author": "Sway M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "My first time having taiwanese food and I was a happy fat child when I was done with dinner. The waiter/owner was really nice and sweet. Decor could use some sprucing up, but I came for the food, not the ambiance. There were 3 of us, we ordered 4 dishes and I have enough food for two days of leftovers. \n\nHere's what we ordered:\n\nSizzling rice soup - yes! thanks to the yelpers that raved about this, or else I would've missed out. Pretty cool hearing that rice sizzle as it gets dropped into the soup. Veggies were fresh and crisp, shrimp was plump and fresh as well.\n\nGreen Onion Pancake - our waiter recommended it since they were out of chinese donuts. I loved this, so simple and tasty, you can't really go wrong with fried dough. Dunked it in the soup for that perfect combo of soft and crispy. \n\nSpare Ribs (I forget which kind since my friend ordered these) - battered deep fried and tossed in a sweet and savory glaze. Reminded me of the chicken wings from San Tung. Huge portion so I have tons of leftovers, yes!\n\nCrispy Chicken - the only sad dish of the night. There was crispy skin on some of the chicken pieces, but for the most part it was just dry chicken in a sauce similar to the spare ribs we had. I'll still eat it, but could've done without this.\n\nI don't know how authentic this place is as far as Taiwanese food goes, but it's damn good. That's all the matters in my book.", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "I usually come here with my family and order a bunch of stuff. The chinese doughnuts are soft and go well with the sweet soy milk. The deep friend onion pancakes are really good too. The dan dan mein is really good here. The spicy sauce is really good with the thick noodles. The pot stickers are really fresh. You can usually watch them make the pot stickers in the front while waiting for tables. The xiao long bao and the shrimp and chive dumplings are also good to order. The portion size for the chicken and broccoli over rice is big.   \n\nThe inside of the restaurant looks old. There is only street parking.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-23", "description": "The only things true to Taiwan is the name. If you're looking for true Taiwanese flavor, no need to waste money here. \n\nWe came here for breakfast and dinner once each. Nothing special worth mentioning in the dinner. As for breakfast,  I was happy when I saw the breakfast menu. But when the Chinese donuts came, I was so disappointed. They didn't either look like nor taste like the Taiwanese Chinese donuts. This disappointment made me ate Chinese donuts every morning for breakfast when I went to Taiwan a few months later. \n\nIf they don't have the name Taiwan, I would give 3 stars for the food.", "author": "V L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "(See pics)\n\nI love this place. I ate here when I first moved here a few years ago with my best friend. A few years later as we talked about the place, we walked right by it and decided to eat here again.\n\nAs soon as you walk in you can smell the great cooking aroma. We sat down and immediately knew what we wanted first, the deep fried silver rolled dough. The dough is always my favourite since I was a kid. And the deep fried ones are special.\n\nWe also had the hot soy drink, so very good. For the main dishes we had the Fu Pei with preserved veggies (shin chai), 3 cups chicken (just learned the name is to do with 1 cup of sugar, 1 cup of wine and 1 cup of soy sauce), Wu Gan Chung Wan (tofu with lots of green onions, preserved vegetables and pork red (blood formed cubes that actually is not as what it sounds but very delicious) in a hot pot that has a burning flame to keep it warm while you eat.\n\nIn addition to all these, we had a side of rice.\n\nIt's all for 40 dollars and we took some food home!\n\nMy limited Taiwanese (language) came embarassingly handy as we communicated and the family owners were so very nice to help us on the ordering and recommending!\n\nAnd the most amazing thing is that I bumped into my another best friend at the restaurant that I have not seen in ages!! Such an intersection of great food and fantastic friends!\n\nThis is almost a full circle of what I have experienced in the last few years with great reunions at a warm, welcoming family style restaurant that serves some of the best food I have experienced!", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "It's decent Chinese breakfast food. \n\nHad the usual sweet soybean soup (Dao Jeung) with Chinese doughnuts (Yao Tiu), Red Bean bun, some other type of plain bread/pastry, and minced meat noodles (Jia Jeung Meen). \n\nThe noodles were the best. Everything else was good but nothing spectacular.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-22", "description": "I was craving Taiwanese food and decided to check this place out for lunch. To be completely honest, I was a little underwhelmed. \n\nI was hoping they would have lu rou fan on the menu. No dice. :( So I ordered the beef noodle soup and xiaolongbao. I will say that the portion size was very generous -- the dishes I ordered would definitely have been enough for at least two people. The xiaolongbao was a little dry and the beef noodle soup was also disappointing. Not terrible, but nothing that will make me a regular here either. \n\nAs a warning, I guess readers should know that the last time I ate Taiwanese food, it was in Taipei, so maybe I'm just being picky.", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-03", "description": "This place was so bad that I didn't even want to bother yelping it. Sigh... You would think that with the name \"Taiwan\", they would have good Taiwanese food. I guess not.\n\n We had the oyster noodles and pancakes - both of them didn't have much flavor and didn't taste anything like what it was suppose to. The texture was all wrong. Everything was really pastey. Even the rice cakes had wilted vegetables. Ick. \n\nDefinitely won't be back here. Ever. I'd rather eat McDonald's (which I never eat).", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "A restaurant named after a country and so you would think that the folks are Taiwanese but in fact I think they are from China but they serve food from Taiwan and also from China. A little confusing I know but at the end of the day, the food is delicious and cheap and so we would definitely come back.\n\nTheir regular menu does not have some of the Shanghai/Taiwanese specialties so make sure you look at the wall for the goodies:\n\n*Green onion pancake-it's deep fried versus pan fried. It's really crunchy so it doesn't have the typical consistency of the chewiness of the pan friend one. \n\n*Spicy green beans-yum, I love this dish\n\n*Genereal Tso's chicken-a little less tangy than Orange chicken, deep fried goodness\n\n*Steamed pork dumplings-xia long baos-very fresh\n\n*Shrimp and leek dumpling-we got this boiled but I highly recommend getting it pan fried (that's what I did with the leftovers and it was soo good)\n\nOur total including tip came out to be less than $40 and we had enough food for dinner the next night.\n\nI would definitely come again and next time order the pan fried dumplings!", "author": "Betty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "I've walked by this place a million times and never went in til today.  My friend said this place has the best onion pancake and sizzling rice soup.  Sounded yummy to me so I went in.\n\nMy Lunch:\n-sweet soy milk - I added no sugar cause I like the taste bland. I loved it!  Fresh made warm soy milk  really hits the spot on a cold rainy day like today.  Must drink it when its warm.  When its cold it doesn't taste as good.\n\n-Chinese Donut- Fresh made and simply delicious.  I ate this with my soy milk.  Just so simple and perfect!\n\n-XLB (dumplings)- Not a fan.  The skin was too thick and there was no soup.  Probably the worst dumplings I've ever had.  \n\n-Sizzling Rice Soup - This I loved!  Its a bit on the salty side but I like it that way. Its a clear broth with veggies and chicken and shrimp.  They top the soup with crispy fried rice.  It gave the soup more texture.  Really enjoyed the part crunchy and part soggy texture of the rice.\n\n-Onion Pancake - You can't go wrong with this pancake.  I think it was ok.  I prefer the pancake to be flat and not too many air bubbles in the dough.  But still the taste was very close to the real deal. Right amount of dough and green onion :)\n\n\nDefinitely will have to come back here again to try out more items on the menu.", "author": "Ying F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-09", "description": "I'm Taiwanese and I can tell you most of the food here isn't great. If you are a true food lover, go elsewhere. The Chinese fried doughnut (yo tiao) is not crispy, the Taiwanese special rice noodles are too \"wet\", the Taiwanese country spare ribs ...eh. The owner seems to be too preoccupied to really pay attention to his customers. Also, he would drop all the dishes into the bucket to wash very loudly - we sat by the kitchen so it was really annoying and loud, and every 10 minutes. Really unnecessary. I took my dad and aunt here and they were very underwhelmed. We love food made with thought, and it doesn't seem like this is a place that thinks about the quality of their food.", "author": "yvonne c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "Omg, those are typical Chinese food, especially south of China, such as Shanghai, Suzhou and Hangzhou.. NOTHNG TO DO WITH Taiwan....! Those who lived in the 3 main cities, after the Chinese civil war escaped from mainland to Taiwan, kept their own eating&food style. That's so called \"Taiwan\" food .....You can call it: a little mini Chinese castle TAIWAN. So basically, once you tried so called Taiwanese food, that's definitely Chinese food...", "author": "Sherin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-29", "description": "I had cravings to eat the food at Taiwan Restaurant.  Finally made it to eat there after several years.  I was soooooo disappointed with the food.  It doesn't taste the same.  I wish that it did because I had cravings for their Chinese donut (yau tiu), potstickers and soup noodles with pickled vegetables and pork.  \n\nThe yau tiu was cold and hard to chew.\n\nThe potstickers were not juicy inside and no taste.\n\nThe soup noodles didn't have much flavor and the noodles were too soggy. \n\nThere goes my cravings.....not going back ever again.", "author": "J W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-10", "description": "We came to Taiwan Restaurant for dinner and it was solid. The service and food were both good. We ordered the following:\n\n1. Chinese Pancake - the best dish we ordered that night. It's an onion pancake and fried just right. Wasn't too doughy, which has been an issue with the onion pancakes I've had at other places\n2. Eggplant - thought this dish was decent. Just a heads up, it comes with shredded pork\n3. General's Chicken - battered well and has a small kick to it, but not overwhelming\n\nOverall, the experience was good but nothing that blew me away. I'd come back if my friends wanted to eat here but I probably wouldn't go out of my way to do so. \n\nMy tummy gives Taiwan Restaurant...3 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "A Chinese friend of mine loves this establishment, so we have frequented it a lot, but my mother, born and raised in Taipei, tells me that the cuisine here is not Taiwanese. \n\nWhat is nice is the high standard of hygiene, difficult to find on Clement Street restaurants, it seems. The flower rolls are exquisite, but taking them home should be avoided unless you have a bamboo steamer and know how to use it.", "author": "George T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "...starving after green apple books...wandered into this place...got stuffed on very good food...good even service...great prices...ignore that it's not gary danko decor-wise...and, lol, i always love hearing madonna, even in a taiwanese restaurant...", "author": "Bob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "I'd been craving Asian fare all day and noticed this place while waiting for the bus. There are a number of restaurants right in the area, but a sticker in their window says, \"People Love Us on Yelp!\"  That's good enough for me :)\n\nI tried the steamed vegetable dumplings, sweet bean buns, and steamed white rice. The food was AMAZING.The bean buns were to die for. The rice (always my litmus test) was cooked to perfection, and still maintained its flavor and consistency after a night in the fridge. Prices were reasonable too, and the staff was friendly. Can't wait to go back!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Owner son George is super friendly and the food is authentic, just love it.", "author": "Alen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "As a starving college student, I remember surviving on instant ramen noodles, pasta-roni, and anything that is sold in the frozen section that is microwaveable.  Like my peers of the time, I would oft look for some eateries that were a decent price and filled me up.  If I knew about this place in college, I'd probably come here a lot.  \n\nThis place is ideal for the college student or anyone eating on a budget.  The portions are huge and the menus haven't changed since I don't know when.  Recollections of this place in my memory pop up when I was small, so this place has got to be at least fifteen years old.  Not only are the menus and price the same, the recipe, and the taste is the same. \n\nDo not get what they have labeled \"beef crepe\", if you're assuming it is their beef pancake.  Apparently, what they mean by \"beef crepe\" is a quesadilla looking thing with beef and hoisin sauce.  Their potstickers and xiao long bao (or XBL as used in many fellow Yelpers reviews) are huge here.  They're not the highest quality, but they're great for the budget diner wherever you are.\n\nThe noodle dishes and noodle soups are one of their fortes.  Personal favorite, the dom dom mein, which has a peanut like topping in their meat sauce.  The sauce also is a little spicy that mixes into the flavor of the dish.  The best asset that Taiwan Restaurant has is its Chinese donut.  There's something about the dough they use or something.  They have some awesome Chinese donuts.\n\nHaven't eaten in a few days?  Need to feed a hungry college student or maybe you want to be a good samaritan and feed a couple homeless folk?  Taiwan Restaurant could be an alternative.  Healthy portions at a good price are what they're about.  I'll come here for their Chinese donuts to go.  Maybe stop by if I have a few bucks in my pocket.  With an abundant of options in the area, it wouldn't be my first choice though.", "author": "Arnold T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "Taiwan Restaurant looks like a Chinese bakery from the outside and can be easily missed if you're looking for a restaurant front. The back of the place is the restaurant while the front is actually a bakery. The restaurant is pretty big on the inside.\n\nThe Chinese pancake here is definitely a really good dish. It's quite different from other onion pancake places. It's thicker, soft, and fluffy while tasting like a great.\n\nI got some kind of special village chicken and it was a pretty mediocre dish. There were too much ginger for my taste mixed in. Also the chicken was chopped chicken leg pieces so they still had the bone inside of the meat. Gotta be careful with this dish or you'll be biting a lot of bone pieces here and there.\n\nThe service was great and nice. They speak English pretty good here for non-Chinese speakers. The food was prepared pretty quickly even though the place had quite a lot of people inside.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-23", "description": "** PLUSI\n\npot stickers (average)\nsweet & salted tofu desserts (below average)\nShanghai dumpling (below average)  dough to thick\nhot oil dumpling (good)\nsoy drink (good)", "author": "Sinny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "I love this place. But it's not real Taiwanese. If you go in expecting it you will not like it (it will prob be a 2-3 star). For me I've been coming here for years and didn't know what \"real\" Taiwanese food was until a few years ago. This is not real Taiwanese so go in with a open mind of just Asian food.\n\nThe \"real\" shao lung baos are suppose to be soupy and thin skin. This is thick skin and not soupy. It's a dumpling that should be called something else. I love these. I wouldn't call it shao lung baos but if you go in thinking it's a dumpling other than shao lung baos then you will like it. flavor is good and not too gingery. Just the way I like it. (BTW, my fav \"real\" shao lung baos are at Yank Sings, best in Cali in my opinion. And Yes, I've been to Din Tai fung in Arcadia. It's not as good as the ones in Asia so it doesn't make my list).\n\nA must for me is sizzling rice soup. It's very clean tasting and I love it when the rice sizzles, yummers. It has veggies, chicken and shrimp.\n\nI also really like the thick noodle stir fry. No idea what it is called cause my parents always orders it in mandarin. You can get it with any type of  meat.\n\nFresh Chinese donuts! They are the best here. Perfectly fried with not overly crispy. The sweet rounder versions are good too.\n\nI've been coming here for 10+ years. I still love it. I requested to go there for lunch today actually. We always order the same thing: sizzling rice soup, \"non\" shao lung baos, the thick noodle stir fry with choice of meat (prob pork for me), and chinese donut with soy milk. OK, hungry now.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-02", "description": "Do NOT order their dumplings...\nTheir food is def below average.. I've had much better Chinese food for the same price.", "author": "Mia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "The price was incredibly low - around $6-$7/dish and the portions are pretty large. \n\nIf you're not used to these sort of smaller, not super clean, Asian restaurants, you might be a little put off by this place, but just know that the food is usually fried so any bacteria will be dead :) \n\nService is so-so, nothing to write home about, but what I expected\n\nThe taste is like home (home, being Taiwan) and I'll definitely be back. \n\nBe sure to get the minced pork noodles in bean sauce - *SOOO good* - it's the Chinese version of Jia Jiang Mein (vs. the Korean/Chinese version).", "author": "linda t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "This is another old family favorite that I've been going to for years for the Northern Chinese dim sum brunch (noodles and dumplings galore).  I don't know what their regular dishes are like.  They also have a Taiwan specialties section of the menu that looks interesting, but we always have the dim sum.  They now have pork blood casserole - yum.  \n\nTheir menu claims that they were the first restaurant in the US to serve Taiwanese food.  I don't know if that's true but they have been around for decades.  I do like walking by and watching them make fried Chinese donuts in the window.  There aren't many places where you can see that and their donuts are always fresh.  \n\nFor brunch we usually get soy milk (salted or sweet, $1.25).  It's served hot in a bowl.  Delicious.  My father says their donuts aren't as airy and light inside as they should be but I think he's comparing it to what he had in Taiwan.  \n\nTheir shredded white turnip cakes (4 per order) were huge, the size of a red bean bun and stuffed with turnip, ground pork and mushrooms.  The shell was thin and flaky on top and thicker on the bottom.  These were really good.  \n\nThe hot boiled dumplings had a tasty pork filling but there wasn't enough filling and there was too much dough.  Also the soy sauce it was tossed in made the dumplings too salty.  I noticed you can ask for low salt - we should remember to do that though I'd rather get other dumplings (these were like won tons) with less skin.  The Shanghai thick noodle was disappointing - oily and bland.  \n\nThey are trying - they will make dishes w/o msg, with less salt or hot & spicy upon request and they even have brown rice now.  The food comes out very quickly, the décor is very pink but no frills, and the prices are reasonable.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "I have eaten here with my friends and family. This is restaurant is quite good. As people think that Taiwanese cuisine is just Chinese food. But the fact is that it is quite different. I enjoyed the food here.\n\nTop on the list I enjoy the three cup chicken. I have tried three cup chicken from other restaurants. This restaurant makes the best three cup chicken. The chicken is cook and braised in a clay pot. The result, is pieces of chicken the is tender and juicy with a slight sweetness because of the rock sugar used to braised the chicken. Yet the chicken is refreshing because of the use of basil. If you are craving a chicken dish remember to order the three cup chicken.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Great no frills Chinese (more than Taiwanese) food.  Good comfort food.  Not greasy, no MSG.  Extremely clean tables, everything gets wiped clean.  I've even seen them wiping down the soy sauce and condiment bottles, and menus.  Nice family-run place (fewer of these left here in SF!).  Nice mix of customers, and family-friendly.\n\nI come here regularly to get my fix.  I stick to the basics (e.g., beef and broccoli) and everything has been good so far.  The highlights:\n- Pot stickers are a must.  As everyone has mentioned.  Every table orders it, and you'll see why.\n- Green beans are cooked perfectly.  Not mushy, CRUNCHY!  I usually get green beans with tofu or chicken.\n- Hot and sour soup.  One of the few places that makes it with chicken instead of pork!\n- Ma Po tofu.  One of my comfort dishes, personally satisfying.\n- Brown rice is an option!\n\nThat's really about it.  I haven't ventured into the fringes/exotic parts of the menu, which seems to be where other people's complaints are coming from.  That's really not what I'm looking for in this place anyways (even though I am an American-born Taiwanese).  Just go here and try it out when you're craving some old-school basic Chinese grub.  You won't be disappointed in this local's spot.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "on a cold Saturday morning, my boyfriend wanted to come here. \nWe sat down and a conversation followed when we were suddenly interrupted by the waitress.\n\nwaitress: you're so lucky!\nme: huh?\nbf: uhhh? \nwaitress: she's so pretty!!\nme: huh?\nbf: *blank stare*\nwaitress: your girlfriend! she's so pretty! you're so lucky to be with her.\nme: thank you! *snicker at boyfriend*\n\nthe rest of the day: \n\nbf: oh you think you're so cute don't you? just because the waitress said you're pretty! you're going to do something like, run over a dog and say \"it's okay, i can get away with it, the waitress said i'm pretty!\"\n\nbut anyways. in all seriousness, it was okay. i liked the soup and fresh hot soybean milk, mmmmmmmm.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "The food here is okay. Their salt and pepper shrimp was meh. The steamed pork dumplings was the only item ordered that I actually thought was good.", "author": "Alice D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "OH WOW! A hole in the wall restaurant in the clement with amazing food. \n\nWe ordered chicken fried rice with some noodle dish that comes with fried porkchops (don't ask me what's it called b/c I don't know). It tasted amazing. Wasn't a big fan of the soup/noodle but the fried porkchops were like da bomb! The fried rice (which is usually an easy dish to make), was packed with so much flavor. It's almost as if it's saturated with something to make the rice heavier than usual. So good. \n\nPlace is kinda dull looking though. They really should remodel the interior but other than that, the food was fantastic.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-10", "description": "CHILDHOOD FAVORITE\n\nmom: where do you want to eat?\nme: lets go to the pink Taiwan place\n\nIts been a while since i ate here but it used to be my family's favorite place to eat when we have time to hang out together. good memories sitting with my parents and siblings and then after lunch or dinner, we would walk around and my mom would buy groceries before heading back home. \n\nPrices are decent and the food is very flavorful. We ALWAYS had to the Shanghai dumplings and noodle soup. normal Taiwanese food. I'm glad the restaurant is still open after so many years.", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "Was putting all my bets on the yelp community because the one in Berkeley with the same name is not good (or maybe ordered the wrong items)... anyway, being taiwanese-american myself, I found this place to be the perfect place for my cravings. \n\n-Started off with the mustard green & pork belly soup - warmed my soul!\n- Soup dumpling (shiao long bao): it was dry. no soup spilling out. but it was tasty nonetheless. Shiao long bao's are not a specialty in taiwan\n-The green onion pancake seemed extra crispy and fried .... and it was so tasty! \n-The oyster pancake (a staple taiwanese street food) was lacking the \"snotty\" consistency, but it was still delish\n- Eggplant in fish sauce... i looove eggplant \n\nconsidering i haven't tried many places in sf or east bay for taiwanese food, i give it 4 stars. great service, super casual, and cheap food.", "author": "Marian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "It is a restaurant which will be easily ignored ,cause its normal doorway. We ordered a beef noodle soup , lamp noodle soup, and three cup chicken, and they are delicious . My friend  recommended this restaurant to me ,and I think it is worthy to try, like it !", "author": "Panny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "Didn't realize that I had already written a review, but after last night's dinner I wanted to because again, the folks working there are SO NICE! The rest of my old review stands, but I decided an upgrade was in order.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "This place is a hidden gem. It does have a fancy glowing neon sign. It does not offer the the greatest of service but the food is solid. ...and it won't burn a hole in your pocket.\n\nThe braised lamb noodles is my favorite. The noodles are fresh, not prepackage. The portion of the noodles are on the larger end of the size spectrum.\n\nI usually get an appetizer and share the noodles with my girlfriend. \nGood food has its limitation after that it is gluttony.\n\nI am not Taiwanese, I don't have a reference of what good Taiwanese food is but I like what I ate. So you Taiwanese food snob/purist out there can suck it.", "author": "Tony N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-21", "description": "I give this place three stars for their nice service.  It's much better than when I last came here many years ago.\n\nI ordered their shrimp and chives dumpling.  It was okay, the skin was probably thicker than it should have been, thus making it more chewy.  Along with it I tried their hot and sour soup which was tasty with a lighter color texture than most other restaurants' version.\n\nFor actual Taiwanese food fan, there is a section of the menu more dedicated to food items more associated with Taiwan.  I would love to check those out despite my limited knowledge of their cuisine since I'm not a native of Taiwan.  At least the menu looks much better than, say, Taipei Restaurant on Ocean Avenue. One disappointment is that they do not serve fried stinky tofu, one item I definitely I associate with other Taiwanese restaurants that I've visited regularly.", "author": "H K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-19", "description": "I don't know what everyone is raving about. Since I adore Shanghai dumplings, friends kept mentioning this joint. So I finally went on a Sunday morning. \n\nThe dumplings were over-sized & the wrapper was too thick instead of delicate. The filling wasn't tasty - not enough spices or broth. \n\nAll the other items the \"expert\" I went with ordered for brunch were fried. I rarely do fried - especially in the morning. I tasted everything & even the fried didn't help the food taste.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-06", "description": "Xiao Long Bao was okay - not enough \"juice\" but okay. Other than that, the veggies tasted like they were \"watered down\" and double-cooked pork (hui guo rou) tasted super dry. I'm guessing this restaurant is only good for those authentic snacks (e.g. you tiao), but real dishes.", "author": "Su L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-30", "description": "Came here for lunch with my friend. As soon as I walked in the waitress immediately greeted me very nicely ( I am not use to Chinese restaurants with nice happy workers). The place is really small I guess you can kind of say its a hole in the wall place but its on Clement Street so not really but I looks like a place that would be. But do not let the place fool you or turn you around. The food is really good and very very very CHEAP!\n\nWe didn't order any of the food off the menu. Instead we ordered the food that was listed on the wall. We got:\n\nShanghai Noodles- Not the typical Shanghai noodles I'm use to but it was still very good. It also came out a lot bigger then I thought it would. I got it with pork and it had veggies in it as well stir fried in a fat egg noodle. I liked it because it was not greasy at all and not too much soy sauce tasting like other ones I've had. \n\nSpicy Szechuan Noodles- It is the regular egg noodles with minced pork and a bunch of stuff (sorry didnt know what it was) and thick gravy/sauce. Do not let the name fool you, it is not spicy at all but it is soooo GOOOODD! Its one of the best dried noodles I've ever had. Definitely going to back and get that.\n\nGreen Onion Pancake- I also like that this one was not greasy like most other places. It was fried very well too. \n\nAll of that came out to only $17! And we did not finish any of our food either! We finished only about half of each dish because we did not expect it to be that big. \n\nI would definitely recommend this place if you are looking for some good taiwanese food for CHEAP!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-10", "description": "This used to be a great place for authentic Taiwan style Chinese food.  A few years ago I would have rated it 5 stars.  Not anymore.\n\nIn the last couple of years I've had a few mediocre meals here and then a couple of days ago we came and we left feeling \"never again.\"  The food had no taste.  Every dish we had was just plain lousy.  The service was adequate but not friendly.  I think this place is riding on its past reputation.  \n\nWe definitely don't plan to return.", "author": "Bob S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-12", "description": "I wouldn't say this is the best place for Taiwanese food, but it is cheap and worth every penny. Portions are huge; in fact, this is probably one of the few restaurants around that don't rip you off.\n\nTheir dumplings seem to be very popular here, but I really don't think they're that great. The skin is just too thick. Plus, their potsticker (kuo tieh on the menu) and Shanghai Dumplings taste exactly the same, i.e. they use the same filling. Their Shanghai dumplings just doesn't taste right, plus the skin is too thick.\n\nTheir other dishes are good though. Potstickers are a good choice, radish cakes are cheap and delicious, and their country spareribs pack a unique sweet and salty taste. Also, for you oyster pancake (o wa jian) lovers, this place makes it, though I wish they'd be a little more generous with the sauce.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-28", "description": "We were walking down Clement Street one sunny day and were drawn into Taiwan Restaurant by the sight of 3 cooks making the most delicious looking dumplings in the window. We weren't very hungry, but the dumplings were calling our names so we ordered 1 basket of chicken and 1 basket of pork dumplings along with 1 of those long Chinese donuts with warm soy milk.\n\nWe were so excited when the two baskets of steaming dumplings arrived at our table, but after the first bite we found out that they were lacking in flavor. The donut and soy milk were ok, but we were really disappointed by the dumplings.\n\nI have to admit that I don't know much about Taiwanese cuisine, so I am looking forward to going back and trying more items on the menu.", "author": "Keau K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-05", "description": "Ate there tonight. Waitress was pretty indifferent, never asked if we needed anything and did not bring utensils we asked for. Two dishes I ordered they did not have but we still ordered other three dishes. I was very disappointed that none tasted as I expected. I grew up in Taiwan n just visited Taiwan a month ago. The name of this restaurant is misleading to me.", "author": "Paiyu G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "My brother and his gf LOVE LOVE this place. So I finally went to eat with them and they ordered their usual. I personally LOVED their green onion pancake the best!! The dumplings were good too and the noodle dish we had was good. I thought the noodle soup was a bit of an overkill though on the noodles. The Dry Fried Green Beans were DELISH too! I can see why they keep going here and the bill was pretty cheap. We also ordered extra green onion pancakes and dumplings to bring home as well.", "author": "Leah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "I will never be disappointed by this place! I extremely love their turnip cakes, so that dish will appear on my table every single time I am there. I also usually go for their dried noodles and soymilk. Definitely big portions. I also adore the staff because they're so nice and courteous.\n\nAnd they play old Chinese music like Teresa Teng (or 96.5 KOIT), so my old soul trapped in my young body is quite content about that.", "author": "C. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "Hands down, this is my favorite Chinese restaurant in all of San Francisco (and perhaps the U.S.).  The food is as good as it gets.  Fresh, well prepared and tasty.  And come hungry, because the portion sizes are gigantic.  The prices are insanely good too... a meal for three adults came to less than $40, including tip.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-03", "description": "Yes, i'm a fan. They have lunch specials that i get all the time...cashew nut chicken ...simple and fast! Dumplings are huge - a must try!", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-28", "description": "I was visiting from Seattle and had a case of bad cravings for Taiwanese food. A quick search on Yelp and I found Taiwan Restaurant with stellar reviews. Hey at least they got the name right, right?\n\nWell that's about the only thing they got right.  I ordered the \"fried yam cake with meat and mushroom\" and Taiwanese oyster pancake. Both are very traditional Taiwanese dishes that every Taiwanese restaurant should do well or go home. \n\nI had a bad feeling when I walked in and heard the owner speak Cantonese. Nonetheless, I sat down and gave it a try; 200+ yelp reviews can't be that off, right?\n\nYam cake: the dough layer was way too thick thus undercooked. The stuffing was big chunks of pork that had no flavors. I think they microwaved it because the parts of it was cold.\n\nOyster pancake: what oyster? I found a total of one oyster inside. The dough/pancake part of the dish was too dry, the consistency was all wrong. They did not top it with the red sweet chili sauce per tradition either.\n\nReading other reviews, most people compliment their dumplings, juicy pork bun (xiaolong bao), green onion pancake, etc. NONE OF THEM ARE TAIWANESE FOOD. I believe Taiwan Restaurant does these dishes well but they can't do any Taiwanese food.\n\nSo the lesson is, Taiwan Restaurant may be a decent eatery but don't come here and order Taiwanese food...hmm...how ironic.  Blech.", "author": "John K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-02", "description": "Taiwan Restaurant's inconsistencies leave it mired in the land of the forgettable.  \n\nOur usual orders include the green onion pancake, Chinese doughnut, thick noodle chow mein, beef noodle soup, and thick sliced noodles.\n\nThe green onion pancakes vary in thickness, amount of oil coating, and crisp with each order.  \n\nThe Chinese doughnut is rarely freshly deep fried, and is discernible by its level of chewiness - the more chewy the doughnut, the less fresh it is.\n\nThe chow mein noodles and thick sliced noodles range from rubbery, limp, and unable to soak up flavor to al dente, fresh, and vibrant for the taste buds.\n\nThe beef noodle soup often contains enough salt for a pot twenty times the amount.\n\nWe come back here often because it is conveniently located and substantial for the price, but are ready to jump ship should we find a better restaurant.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "Large portions and cheap prices still gets this place 3 stars, but it is the pot stickers that is the highlight of this restaurant.  The other dishes seems to suffer from average quality ingredients that is masked by decent sauce unfortunately.  Still for those who are not ultra-selective would likely not be bothered by this fact.", "author": "Laurence H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "This is my go-to spot for chinese food near my hood. I've gotten take-out from here, brought family and friends for lunches and dinners and I can't stop going back even though there are tons of chinese restaurants all over this neighborhood. \n\nI love their portion sizes. Whenever I get take out it usually lasts me for days. One time I got the lemon chicken, fried rice noodle and steamed rice. When I scooped out a serving of fried rice noodle it didn't even seem like the portion in the togo box lessened. That is awesome!\n\nI also love their noodle soups. So far I've only tried the pork chop noodle soup and the beef stew noodle soup, but they are both so yummy and comforting on a cold, rainy day. I think my new new year's resolution is to go through their entire menu.\n\nThe waitstaff here is also friendly enough. I once made an order 15 minutes before closing and they accommodated. Thank God! I also like the man making chinese donuts in the front. It's quite enticing.\n\nAll in all this is a great taiwanese spot in my opinion and I did go to UC Irvine so I have some clout in my review.", "author": "Charlene C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-09", "description": "Came here earlier this week and had lunch with my parents. I thought this place would be like the old Taiwan Restaurant in North Beach. Nope...Horribly bad. We order a few dishes but they tasted the same. Heavy handed on the soy sauce. They have this oyster dish that has egg on it and something chewy. The oysters tasted nasty and really gross. And the xiao long bao were big and the skin was thick, not small and thin and fluffy like they're supposed to be. Horrible experience and not too sure if I would ever want to come back here ever again...", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-29", "description": "I have been coming here since high school....their food are A OK since years ago, no improvement or decrease in quality.  Good for average lunch, not recommended for dinner.  \n\nTipical Taiwanese food....not a big fan", "author": "Wasabi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "Good green beans, sizzling rice soup (clean tasting), and green onion pancakes. Inexpensive and a favorite neighborhood place when you don't want to cook at home.  It's been here for years and years.", "author": "Nan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Delicious dumplings. SOOO good.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "I've been to this restaurant a number of times. After having lived in Taiwan for a few years, this is the closest to authentic Taiwanese food there is in the city. The servers can make you feel like being in Taiwan and will help with the selection. Ask for the oyster pancake if you dare.\n\nThe prices are low considering the portions being served. It's one of the best restaurants serving Taiwanese food in the Bay Area.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-04", "description": "I like going here as the service is polite usually pretty quick; The boiled dumplings are phat, succulent, stuffed with pork and other tender vittels and deelishus, did I mention you get ten of these tummy stuffers.  My favorite is the flat bean curd with chinese greens; it's a large serving of wonderful flat bean curd noodles and chinese cabbage, sooooo  yummy and healthy. Update, you can ask for brown rice. Try dumplings, flat bean curds with chinese leeks and  the mongolian lamb, these will topple your Tummy Tiger. \nTonite, 11/13/07, the dry bean curd and leeks, and steamed dumplings were good, however, the rice was dry and looked a few days old. I did complain. Taking two stars off.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-18", "description": "Taiwan food is so delicious.  Especially for brunch, make sure you order the xiao long bao and the cong yo bing (steamed 'dragon' buns and scallion pancakes)\n\nIt's also super cheap too.  You can order a meal for two for less than 20 dollars and still have leftovers.\n\nThis is definitely one of the most under-rated Chinese Dim sum places I've been to", "author": "Alison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "3.5\nthis place sells cantonese, shanghainese, and taiwanese food. The dishes I usually get are the deep fried onion pancakes, the 5 flavored tripe, the xiao long bao's, and one of their noodle bowls. The deep fried onion pancakes are quite crispy and different than the usual pan fried variety and I highly recommend trying it here if you like onion pancakes. The xiao long bao's or soup dumplings are also made daily and steamed to order. They arent the best ive ever eaten but they are pretty good and i would say above average. They have various flavors of noodle soup bowls. I havent tried all of them but they all look good at least. The one i usually get is the preserved mustard green and pork noodle soup. Other notable dishes are worth getting is their hot soy milk and chinese donuts/oil sticks as they are usually made fresh daily.\n\noverall its a good cheap asian restaurant that I would go to more often if I lived closer. Parking on clement can be a hassle.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "Ginormous food portions!  One entree, and it's usually less than $7, can easily feed two!  \n\nEverything we ordered from the spring rolls to the curry tofu w/rice to the braised beef ligament noodles tasted great.  I really enjoyed mixing the sweet sauce with the onion pancakes, it was awesome.  And pretty impressive veggie selection, I saw plenty of things that I wanted to try.  \n\nGreat service, UBER cheap prices, lots of tasty and good and filling food.  I think Taiwan Restaurant's a bargain, definately get a bang for your buck.", "author": "Swetha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Best sizzling rice soup ever. Friendly staff. Great prices. What else u can ask for:)", "author": "Mutlu T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I like there.Nice waitress and soybean & Chinese donuts.", "author": "H S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "Came here for lunch with my family and I have got to say, pretty good. Definitely can't judge a book by it's cover. The service was great, the people were nice and attentive. The food was yummy!\n\nWe got the FRESH hot soy milk. You add sugar to it yourself so it's perfect for those who are picky. It was very good. We also got the green onion pancake which was pretty good, very oily but what do you expect? We also go shanghai dumplings which were pretty good and they were huge! There's also the I think black bean noodles. It wasn't impressive because I've had better and cause it wasn't spicy. The best thing we ordered besides the soy milk would be the Shanghai noodles. Fat noodles cooked with meat and some veggies. I've never tried such fat noodles but I'm not a fan. \n\nThe servers were super nice as they packed our unfinished food for us. Food came fairly quickly. I will definitely come back.", "author": "Annie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-16", "description": "I was on the hunt for jook (Chinese rice porridge) in the Richmond district, but decided to try for a northern Chinese breakfast at Taiwan Restaurant instead.\n\nThe scene:\n\nAt 11:30am, we were one of the first customers of the day, and the man at the front of the restaurant was frying up some homemade Chinese donuts.\n\nTaiwan Restaurant has a lengthy 4-page menu with items varying from \"Northern Chinese Specialties\" to a variety of dry and soupy noodle dishes. They even have an impressive selection of fried breads which are probably made with lard, but who's counting calories, right?\n\nThe food:\n\nFor 2 people, we ordered the sweet fresh soymilk, a Chinese doughnut for dipping, spicy wontons and Szechuan Hot Sauce Noodles. All came out to about $20.\n\nSoymilk and Chinese doughnut- Disappointingly, the soymilk was lukewarm. One of my pet peeves at a restaurant is lukewarm dishes. However, the doughnuts were fresh. We only ate half of it since it was so big.\n\nSpicy Wontons - The wontons themselves were really good, but it wasn't spicy at all. The skins were thicker than I'm used to, but it was al dente - the way I like it. The meat was super juicy too. The sauce was basically just soy sauce. I didn't see any chili flakes or chili oil in it.\n\nSzechuan Hot Sauce Noodles - These were sooo good! The noodles are the kind you usually see in northern Chinese noodle dishes. I don't think they were homemade, though. I really couldn't point out every ingredient in the sauce, but it was super tastey. Items I could point out were ground pork, peanut sauce, tons of hot sauce and and green onions. The dish was so big, we had to take it home some leftovers. The downside is this makes terrible leftovers. The noodles soaked up the sauce, making the noodles mushy. Dang!\n\nTaiwan Restaurant seems to be a popular restaurant in the Richmond. They seem to be specifically known for their breakfast/lunch items. I'd like to come back to try a noodle soup.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-22", "description": "Food is alright. The service could be better. The last time I went, this bitchy girl was making a big fuss because she said my mom cut her in line (it was busy so we had to get numbers). She kept staring me down the whole time. I was just thinking...hey at least I'm not ugly. Bitch.\n\nThey seated us in the middle table in the middle of the room. There was a skylight above us and I had to wear sunglasses while eating because the sun was reflecting off the table and was blinding. True story.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-28", "description": "I came here on a Monday at noon. It was busy without being crowded. Service was attentive and friendly. I ordered sweet rice and pork in bamboo leaf, dumplings (pot stickers) and the dry braised green beans. I thought the green bean dish was just the vegetable, but for some reason she asked if I wanted it with the pork and dried shrimp. I was confused but asked for it without the shrimp. The beans and pot stickers came quickly and were fresh and hot. The pot stickers were nicely cooked but not as tasty as I might like. Beans were excellent with lots of ground pork. The pork was too salty for me but I am hypersensitive to salt. The sweet rice and pork was very good. A decent place and reasonable.", "author": "John K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-05", "description": "Very typical of Chinese places around San Francisco not all that great, and my parents really did not enjoy it, oh by the way I am Chinese and know what Chinese or Taiwanese is supposed to taste like", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-03", "description": "This place has really gone down hill.  I used to love coming here on Sunday afternoons with my family as a alternative to dim sum.  I used to enjoy simple dishes like hot sweetened soy milk, fried onion pancakes and thick shanghai chow mein.  My childhood memories will have to stay memories because those days are no more.\n\nHad dinner here with my sister and mom about a month ago.  We came at the perfect time and grabbed the last available table in the place.  The bicycle cops were working extra hard that night \n\n- Cold jellyfish.  I've never ordered this here before.  I was shocked to see that they serve the jellyfish over a huge bed of cucumbers.  I'm not a fan of cucumbers and it sucked that the jellyfish took on the cucumber taste.\n\n- Hot & Sour soup.  It was a bit bland.  I had to add more pepper to make it hotter.  I'm just glad they didn't over do it on the vinegar.\n\n- Salted mustard green bits & pork.  This dish I did like.  Was great with some white rice.\n\n- Black bean sauce noodles.  I like the noodles that they use.  The sauce is a different story.  It just tastes different than I remember it.  I used to like it.\n\nI wonder if they have a different chef i the kitchen now?  If Yelp was available back i the days, I would have rated it a 4.  It's now as bad as it's Chinatown location used to be and that place is closed now.  I really hope they get better.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "Generally, when it comes to any hole-in-the-wall Asian restaurant, or one in a Chinatown-type area, I have very low expectations with the service. So I was very pleasantly surprised by the smiles when we walked in, and how helpful they were when helping me order the right dishes. Some of them had slightly different names here than at other Taiwanese restaurants I usually frequent, so it took a little work. We ended up with way more food than we could finish, yet the bill was still only around $30 for two people. Had we only only ordered what we could really finish, it would've been much closer to the $20 mark.\n\nThis is a genuinely great place to grab some delicious food, all for very little of your hard-earned cash. Taiwan Restaurant (despite the uninspired name) is great, and I wouldn't hesitate to come back or suggest it to friends.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "I don't care what none of y'all say, I still love her. Her, as in Taiwan Restaurant. This is my favorite Clement Street spot for soup, dumplings and chicken with asparagus, which is crazy fresh and has excellent flavor. In fact, I have a ritual: reflexology followed by soup and dumplings at Taiwan Restaurant, and then off to Super Tokyo to stock up on Royal Milk Tea and a case of toasted seaweed. Makes for a comforting foggy afternoon. \n\nAnd the staff are so kind here, with their occasional free thank-you donuts and genuine gratitude. It makes me happy to tip them extra, and that almost never happens while dining  out in San Francisco.", "author": "Quinn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "Every single dish we ordered was a disaster. I haven't tasted Chinese food this bad in my entire life. Avoid this place please.", "author": "zhicheng w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-13", "description": "pretty pretty good\n\nhard working folks \n\nspinach, dumplings, tofu, hot and sour soup - all pretty pretty good\n\nwould go back\n\nparking is a biatch around there though", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-29", "description": "It pains me to do this but I our last experience was horrible.  We arrived and ordered our favorite dishes and they were good as usual. However, as we prepare to pay my friend notices that there is a disgusting dead bug in one of our dishes.  That completely ruined our meal and we vowed never to return.  The restaurant did not make us pay for that particular dish but this experience ruined any chance of us ever returning.  Sadly, our love affair with Taiwan restaurant is officially over.", "author": "Jammie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "Like the xao long bao, green onion pancake and all of the sauces.... great prices I always love a deal. Dinner tonight with my boys always a great time.", "author": "Tan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-23", "description": "I've always passed by this place when I'm in the I-Rich so decided to pop in yesterday. Ordered up the  ('beef crepe'- one of my favorite snacks in Taiwan), expecting this : http://globaleats.blogspot.com/2010/09/taiwans-resurgence.html. Not even close. What I got was a flat (not crispy or flaky) super dry 'crepe' (more like a day old tortilla, if I'm being honest) filled with blandish braised beef slices and a few green onions. No griddle marks either!  Big letdown.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "Scared when I saw a waitress yell at one of the patrons for complaining the food was cold but my server was so extremely sweet!!! Gave me extra napkins to soak up  grease! ( so Asian). Food was delicious except the beef wrap was not really my kinda thing...This place is more like shanghai style than traditional Taiwanese", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "I remember coming to Taiwan Restaurant when I was just a kid. This would be one of the few places my parents would go to have chinese fried donut with warm sweet soybean milk. This was my chinese equivalent of a McDonald's happy meal.\n\nYears later... I finally made my return visit to Taiwan Restaurant with a group of my co-workers. Of course I ordered my chinese happy meal. To my amazement some of my co-workers... some who are chinese did not know how to eat this!\n\nSo... this is how you eat a chinese fried donut with a bowl of warm sweet bean milk. The soybean milk should come without sugar. So, add sugar and mix till you find your perfect sweetness. Next, take a piece of donut and dip into the bean milk. Get it soaked and eat! Easy peasy... japanesey. Or you can toss in a couple of pieces of donut into your bowl and eat it like cereal.\n\nAs for the rest of the menu... some winners include the chicken wings, Taiwan Seafood Rice and Dry-Braised Green Beans.\n\nThe dishes may be a little on the salty side but most of the sauces that come with the dishes are tasty.\n\nPrices are cheap... $10 bucks for a big lunch... good deal!", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-16", "description": "I love this place. \n\nCheap, and delicious food. \n\nI love the waiter. That one old man is so nice. They're not rude at all. They're patient with you if you try to order in Chinese and your Chinese sucks. \n\nI loved everything I've tried here.\n\nMy favorites:\n\nPan fried rice cake with shredded cabbage and pork - I always get this. It's not too salty or oily. \n\nNoodle.. with bean sauce? - I love this too! I prefer the one with meat, and not the vegetarian one because the sauces are VERY different. \n\nNoodle soups and fried rice is good too!\n\nI don't even know what else I've tried here since I come here so often. But take a risk, and order whatever sounds good!\n\nI'm going to try sizzling rice soup next time :)", "author": "Christina X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "Had a Shanghai dinner for two and Five Spice Beef for Chinese New Year/Valentine's Day, shit was really good and filling- the Five Spice Beef was actually as good as my family's traditional recipe and the pork and chicken dishes were perfunctory, but well cooked and flavorful.\nQuick service and surprisingly friendly staff for a neighborhood Chinese place and I can't wait to try this place for breakfast You Tiao and Mantou!", "author": "Heng W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "Fantastic food, very reasonable prices, friendly staff (seems like a family-run place), typical Inner Richmond Chinese restaurant ambience. Love the dumplings, wohl wonton soup.", "author": "Greg A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "My first time at this establishment and, in particular, eating Taiwanese food was a satisfying experience. The wait staff was friendly, attentive and helpful for a mid-week, early afternoon lunch hour. The vibe and atmosphere of the restaurant was great: it was a calm and quiet setting to enjoy a nice lunch.\n\nI got a sense they take pride in preparing meals for their patrons. For instance, the garlic, onions, and bamboo shoots used in their entrees were finely chopped, unlike other Chinese restaurants, where it's apparent less effort was involved in the preparation. Their food reminded me of home-style cooking, atypical of the oily and greasy Chinese fare one might expect. While food arrived at a nice pace, I didn't feel rushed to finish eating.\n\nI ordered their Chicken Dumplings, Crispy Prawns (a daily special), Dry Green Beans (a daily special), Green Onion Pancake (not on the menu), Mongolian Beef, Szechuan Hot Sauce Noodles, and Wok-Fried Rice Cakes with Pork and Chinese Cabbage. Food wasn't too salty or, in the case of the Mongolian Beef and Szechuan Hot Sauce Noodles, spicy. With the exception of the overcooked, pasty and bland Wok-Fried Rice Cakes, I would recommend all the dishes, especially the Szechuan Hot Sauce Noodles that is not your usual chow mein but is topped with I think some kind of peanut sauce.", "author": "Cliff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-01", "description": "There are three statements I will commonly say that almost invariably brings a shocked look of disappointment and loss of foodie respect to most men's faces.\n \n\"I'm not big on pizza...\"\n\"I don't really like Mexican food.\"\n\"Chinese food is not my favorite.\"\n \nBut let me explain.\n \nI love excellent pizza, but it's extremely rare that I will find pizza of this class.  I had it once in NY, and found it again in Venice, Italy - and recently discovered it in San Francisco.  Three times over a lifetime isn't much - so it's easier for me to say that I'm not big on pizza rather than explaining how good pizza has to be for me to like it.  \n \nWhile I enjoy a few things from Taco Bell - let's make clear that this is not Mexican food.  So then taking me to most taquerias results in a very mediocre meal for me.  But having had meals cooked for me by authentic Mexican families, and having had excellent dishes IN Mexico - - I love real Mexican food.  There's very little in life that beats a tamale that is too hot to touch, plump w/ fresh meat, etc.  There are some taco trucks in Oakland that the mere sight of requires a napkin to wipe the drool off my face.  But the majority of Mexican restaurants will result in an unsatisfying meal for me.\n \nThen there's Chinese food....\nBeef and Broccoli, shrimp w/ lobster sauce can only be so good and it's Americanized Chinese food.  It's just not my thing.  Dimsum, I love... but there, too, I am entirely too picky about what good dimsum should taste like.  I love porridge, but not when there's more water than substance.  Throw me in Shanghai, and I think you'd probably have a hard time stopping me from eating everything - but when friends are gathered deciding where to go for dinner, if someone mentions Chinese, I will usually pipe up with other suggestions, hoping to avoid more \"so-so\" meals.  But my search for excellence in Chinese food, though, has been kicked into gear lately, and there seems to be no end to how much Chinese food I can try.  Most, however, I will not like.\n \nEnter:  Taiwan Restaurant.\n \nLocated on Clement Street, I would probably walk right by without a second thought if not for the small area in the front window showcasing a man making dumplings.  It looks good, but I'd enter assuming it's just \"OK\".  But Rob went to this restaurant a week or so ago with his friend and never stopped talking about it, and every night's dinner suggestion resulted in, \"Chinese Food tonight?  Taiwan?\"\n \nFinally, we decided to go.\nPhotos uploaded.\n \nThe dumplings here are, in fact, extremely good.  If I had to ding them for something, it'd be that the wrappers are thicker than what I like in a dumpling.   I'd recommend the pork dumplings, and shrimp with chives dumplings.  The first is steamed, the latter boiled, but it gives you a good glimpse on what this place can create.  These are steroid-sized dumplings - REALLY BIG!  (We also ordered the beef, but there was no discernable difference between that and the pork - and if you had to pick one, I'd suggest the pork.)  We also ordered some entrees - - a scallop and snow peas dish, and Schezuan beef with an order of rice.  If I give their dumplings a 4.5 - I give their entrees a 3.5-4.  The ingredients are FRESH, and it's cooked well, but neither dish made the top 5 level that I expected after having the dumplings.  Chinese food at Yuet Lee is still the only one that I have found in the city to be top 5, no matter what I order - -- but they don't make dumplings - at least I don't think so.  I'm too busy eating porridge when there to notice much else.\n \nNotable was  that the rice was more Korean than Chinese - sticky instead of jasmine type of rice.  Interesting.\nDumplings should be ordered first - - as they will take a considerable amount of time.\nService is professional and nice.  The hostess remembered Rob from the week before, including where he sat and what he ordered!  No doubt, I will be back to this place when I need a dumpling fix.   Their prices are also really economical!\n\nBeing Korean, I have no idea whether this is authentic or not.  It's not necessarily authentic that I am looking for - - just some really good food, period.  Goodness knows \"authentic Korean\" doesn't mean it's delicious.... just give me good, tasty food!!", "author": "Grace K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-03", "description": "Not sure why it's called Taiwan restaurant.  The food certainly is not \"Taiwanese\" or \"Hokkien\".  It's more like Panda Express. \n\nThe interior is depressing, like a funeral parlor.  The servers are all very old and tired looking.... bunch of old male servers.\n\nThe menu is really a mesh mash of Chinese and Americanized Chinese dishes.  The food is horrible here.  Greasy, bland, very poor quality and not authentic.  I ordered 4 dishes, had maybe 2 bites of each and just could not eat another bite after that.  Needless to say, I did not ask for doggie bags that night.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "Here's what you need to order:\n\nFresh Hot Soy Milk (add one spoonful sugar)\nOnion Pancake \nShanghai Pork Dumplings\nShanghai Thick Chow Mein\nGarlic Szechuan Shrimp (request no batter, trust me!)\nBeef Noodle Soup\nBowl of Rice (to mix with garlic szechaun sauce)\n\nYou can thank me later. \n(My fav lunch; cheap eats; hangover cure; Pepto Bismol colored restaurant in SF.)\n\nGood food. Great prices. No frills. Taiwan. Restaurant.", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-16", "description": "Wow this place is such a rip off. I bought the Mandarin Lamb for $9 and didn't realize that the to go box was so small. Inside this togo box was mostly vegetables and a little bit of lamb. I would not suggest coming here if your a college student looking for a good deal.", "author": "Joan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-11", "description": "This was the first time I've ever dined in a \"Taiwanese\" restaurant.... well I wasn't impressed with their food : -T so that was a bit of a let down. A friend, who's Taiwanese, ordered the oyster noodles and said it was all kinds of wrongs going on there... haha. The service was nice and friendly, they don't talk with you much (which i don't mind) but maybe that's because of the language barrier... They really tried to give us the best service that they could! \n\nFood: \n* Oyster Noodle - Corn starchy gravy with thin shrimp or egg noodles with lots of oysters. Oysters could've been fresher... : -T \n* \"Clay Pot\" Chicken - Sorry, but when was the last time that pot was scrubbed!! It was tasty enough but came with lots of boney pieces of bark meat... and lots of slices of ginger (those were pretty tasty and mild) \n* Green Beans - BEST dish we had, they were stir fried and had nice crunch! \n* Soy Sauce Chicken - It looked like soy sauce chicken with the sauce around it, but it had an interesting vinegary flavor to it. \n* Soup Dumplings - There's suppose be a little broth (soup) in each pouch, but there wasn't. The actual filling wasn't bad, but it crumbled (which it shouldn't). Some people may know these dumplings as Shanghai Dumping. \n\nService & Space: \nThis place is a complete mom-and-pop place in terms of the service and quality/preparation of the food. Old school Chinese restaurant with pink walls...", "author": "Fried Rice B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-25", "description": "It's chinese food.  It's solid good, well priced chinese food. I like their deep fried pork chops and green beans. \nMinus one star for no consistancy. One day great next day way to salty or gamey tasting. \nIf ur in the area i would highly recommed it. Especially if your into the hole in the wall place alot of the local chinese eat at.\n\nNot much for dim sum. Meal for two under $15 plus tip", "author": "Spanky M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-27", "description": "I'd heard so many good things about Chinese eateries in San Francisco so when I visited, I did some research on places that had \"you tiao\" and soy milk. I saw that Taiwan Restaurant \"xiao chi\" from Northern China and decided to give this place a try. \n\nThe soy milk was decent and the you tiao was not bad, but the rest of the food was just shameful. The frozen dumplings I buy from Ranch Market are better than these. When I think of small eats from Northern China or Taiwan, I think of thin-skinned, juicy buns and dumplings. The dumplings and steamed pork buns were way too doughy and sticky. I have never had such thick-skinned dumplings! There was nothing \"small\" about these eats! Everything was large, clumsily and bland. Anyone who thinks this place has good food obviously doesn't know their authentic Chinese food.", "author": "Lulu W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-01", "description": "Arguably the oldest Taiwanese restaurant in the Bay Area, maybe it was good when nobody knew any better, but with tons of restaurants offering similar and wider variety fare in the East Bay and South Bay, this place doesn't glow anymore.\n\nYelpers if you have actually been to Taiwan recently and have eaten anything from street food to restaurant fare, then come back and eat at Taiwan restaurant, you will either shake your head, laugh or cry (or both), question why this place exists and why people still flock here, and also wonder why people would debase themselves to eat such crap.\n\nI'm not trying to be mean and I do appreciate that this restaurant exists to serve a type of cuisine that's virtually impossible to find in SF, that also has been around for a while.\n\nFrom a Cantonese snack/fried starch palate standpoint, this place is nice in that you can get yoh tieou (crullers) and its respective variations, including the \"beef tongue pastry\" which is a sugary donut that oddly enough looks like a set of lips or depending on how deviant you are, a vertical smile. People who grew up in Hong Kong during the 60s to 80s might remember having this as street food. But then that's where the gems end. While soy milk and yoh tieou are great comfort food snacks, I dare say their soy milk isn't really that great, and anyone from Yung Ho Taiwan will laugh and cry for paying x2 to x2.5 prices for the same portion (heck even Yung Ho restaurant in Southern California, San Gabriel on Valley Blvd does a better rendition that's more like the real deal). It just sucks we don't have something like that up here.\n\nThe restaurants main menu has more or less stayed the same in the past oh I don't know 15 to 20 years. I know Taiwanese street food has been around 100 years at least, and the fact that the business doesn't keep up to date with food trends, what is considered a good snapshot or representation of Taiwanese food, or innovate means that they continue to offer the same stale standard fare over and over (much like most Chinatown restaurants).\n\nAnd don't get me started about the one in Berkeley...", "author": "Ken K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "There are two things that I really enjoy here: the beef noodle soup and the dou hua.  The noodles always taste fresh, the soup is rich and flavorful and you get some nice chunks of beef.  It's comfort food, Asian style.  The dou hua, which they only have on weekends, is made on site, I believe, and you can really tell from the taste and texture.  It's a shame they don't have this that often since I could eat this all day long.  Another thing they have going for them is that the dumplings are also made on site, and you can't go wrong ordering the shui jiao or guo tie.  Lastly, their lunch special rice plates are humongous (I can only finish about half) and pretty cheap.", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-14", "description": "Potstickers and Siu Lon Bows are not as good anymore.  Potstickers are cold and too crispy.  They've gone downhill.\n\nService without a smile.  Based on these two factors,  I don't go as often anymore.", "author": "MickYee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "Mustard greens with pork noodles, side of pig ears and rice wine.  \n\nI found out that I'm not a big fan of rice wine, but everything else was good.  Especially the bill for only about $10.  \n\nThe menu is huge and everyone in my group liked what they ordered.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "When I'm depressed or hung over, or both, the dumplings and pot stickers at Taiwan are among my staples.  On those occasions when I want to act like a girl, and eat my problems into deeper ones, I head there first. \n\nI just devoured an order of each, and now I'm going to cry myself to sleep.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-20", "description": "We came here for soy bean milk breakfast the day after yet more partying.  \n\nThe joint:   Typical chinese restaurant with Taiwanese fare.\n\nThe food:  With the soy bean milk we had the sweet and savory fried doughs as well as the green onion pancake, the fried rice cakes, noodles and dumplings.  The soy bean milk was alright.  You could go the same with the Golden Gate Soy bean milk you get from the store hot.  The fried dough was excellent though and we ordered another sweet roll after the first vanished so quickly.  The green onion pancake was crispy, hot and not too oily; better here than other places.  The dumplings were not as tasty though.  \n\nThe service:  though they take your order right away, you've got to wave someone down it you want anything else.", "author": "Marie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "Ahhh, Taiwan restaurant...  Brings back memories.  I've been coming here on a random basis since maybe 14 years ago.  Their green onion beef over rice has been one of my fav dishs for over ten years!  They also serve the good ol' soy milk and the long fried chinese doughnut thing.  hmmmmmmm, long fried chinese doughnut thing.....\nConsidering the low prices here, it really deserves five stars~", "author": "J D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-22", "description": "Taiwanese restos are meager in SF. Good thing I'm not that picky about Chinese food in general. The meat rice here and zha jiang mian are ok.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-04", "description": "When I first arrived in the bay area (from Taiwan to LA then to SF), this is about the only place that you can get some Taiwanese food:  fried chinese donut, soybean milk (savory), and most of all cuttlefish soup.  I was delighted to find a branch in Berkeley.  \n\nNow forward 20 years to present day...I brought my husband to share the fond memory of surviving in a foreign land of no Taiwanese food...we ordered...ate...and he said as he shed his tear, \"baby, I'm sorry you had to eat this nasty food growing up...\"\n\nThe spicy wontons were the worst I had.  They were like frozen dumplings, thick skin not fully cooked, tasteless meats, and the \"red oil\" sauce is bland.  We couldn't even finish the dish and certainly didn't bother taking it home.  \nThe stir-fry rice cakes were very bland and greasy.  The cuttlefish soup is fishy and without good flavor.\n\nI didnot believe it, and went back again...but sadly I feel like I was not eating anything Taiwanese cuisine, but really a panda express...\n\nHow has thou fallen so far down, O Taiwan Restaurant?  How do you survive with competitions such as Joy, Taste of Formosa, Southland Taste and the likes sprouting like springtime shoots?  \n\nI think it's really one star but one extra star for old time sake...", "author": "MooMoo L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-29", "description": "I'm a little stunned by the glowing reviews.\nMy experience was \"adequate, maybe good food, abysmal service\" \nOur greeter bluntly told us \"This is taiwanese, don't mistake this Dim Sum for cantonese, you can get that down the street!\" And a happy day to you too! All we asked was do you have dim sum.\n\nWe sat down, and waited, and waited, and waited and started to wonder if this was a buffet dim sum with the food in the back we were supposed to get until we finally got menus.  The whole vegetarian thing is a concept lost on them.  They have plenty on the menu to accomodate a vegetarian however.  \n\nWhen we wanted to order some food to go after we ate, this caused major confusion and they finally sent out an American born, English perfect girl who was very helpful and clearly admonished her elders for some of what they were doing to the patrons.  \n\nSo look for her but don't look for me because we won't be back.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "Coming to Taiwan Restaurant is like coming home again...and again...and again...and if you are like me...again. The food doesn't change much and always greets you with a big hug (as much as a set of 'xiao long bao' or a heaping pile of 'zha jiang mien' can embrace one). I definitely still feel the love, and at a more than reasonable price. \n\nAnd to add to this already bountiful bundle of flavors, I would suggest the green beans, which I kid you not, would make any vegetable eating child (or adult, for that matter) rethink their diet. Deep fried pork chops, yiu tiao (Chinese donut), soy bean milk, deep fried chive pockets....yadda, yadda, yadda. I could go on for days....but I wouldn't want you to risk starving yourself where you could just go out and get the food.\n\nDon't forget to wipe that river of drool from the side of your face either, I'm not sure how attractive that will look in front of the Taiwan restaurant crowd.", "author": "D L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "Just read yelper Lolia's review. This restaurant definitely cooks with a lot of msg. The food is tasty and greasy. You will leave the restaurant feeling super thirsty. I like their noodle dish, sweet and salty soy milk with Chinese donuts. My favorite dishes for dinner are string bean and 3 cups chicken (direct translated from Chinese menu). The 3 cups chicken requires 30minutes of preparation time. \n\nPrices are pretty cheap here, about $10-$15 per person with plenty of left over.", "author": "Ervinna L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-13", "description": "Good food, but they throw the dishes around when cleaning tables. It is very distracting and keeps you on edge at all times.  Not a pleasant dining experience.", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-24", "description": "I am meh about this place.\n\nI came here on a friday night and there was a couple waiting in front of us. There were two tables that should have been open up, but they were dirty and not cleaned up yet by the two waiters who were busy doing other immaterial things such as getting water for others. They should have hired more waiters. I mean, they're were two available tables that should have been cleaned up and it would only take two minutes to clean up but they didn't! They were busy doing other very menial tasks. \n\nFinally when we were seated, the waiter took another person's order before us even though we were seated first. We ordered Shanghai thick noodles and the fish flavored pork. \n\nAnd then when we finally got our food, the food was lukewarm and got cold quickly within two minutes. It was as if the food was left there for ten minutes until it got served to us.\n\nI totally do not recommend this place as there are so many places in the sunset district that are so much better than this.", "author": "David N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "Note: If you unfamiliar with the taste of Taiwanese food, you will be sorely disappointed expecting Cantonese taste.\n\nI love Taiwan particularly Shihpen (Taitung County). When I grown up, you will find me here, roaming the surrounding canyon roads on my MV Agusta Brutale 910R or a KTM Superduke R with a base-jumping parachute on my back. Don't care too much for Taipei, Kaosung, or Taichung but I love the Eastern countryside. Among the majestic hills and forest, I felt a calling of home. Up high with low hanging cloud, it seems as if you look down from heaven.\n\nI find the key to this establishment is to order off of the menu via the wall posting. Some of my favorites are Shanghai Noodle, Country Chicken, Country Lamb, and Lion's Head. The dishes are generally flavorful and can be ordered without MSG. Shanghai dumplings' skin is a bit on the thicker side and bigger in size than what I used to. Once upon a time, I had fantastic Shanghai dumplings in Taipei...Mmmmmmmmmmmmm. \n\nThis is one of the better TW restaurants in the Bay Area. Enjoy!!!", "author": "DAVID N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-01", "description": "Taiwan restaurant reminds me of lunch with my family after church on Sunday. We use to eat here all the time. I love Taiwanese style dim sum, here are my all time favorites:\n\n-Sweet, warm soy milk. Be sure to order a side of fried bread (the long ones) for dipping.\n-Onion pancake. Crispy pan fried pancakes made with scallions.\n-Steamed pork dumplings. Always freshly, hand made by the window and steamed to order. Yummy with vinegar.\n-Pot stickers. Similar to the steamed, but pan fried. Always crispy and full of pork and cabbage.\n-Shanghai noodles. Fresh, thick flour noodles stir fried with beef and veggies\n-Beef noodle soup. Savory beef broth with slices of beef and spinach and homemade noodles\n\nNow that I think of it, I need to pay them another visit soon.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-09", "description": "This place has really good taiwanese food. I usually don't get appetizers, but this place has good finger foods. The soy milk (unsweetened) is yummy too. The dishes are tasty, but sometimes too salty. The food is out hot and fresh and orders are at most times promptly taken. Staff is nice and doesn't give you trouble. I would definitely eat there again.\n\nmy only complaint is that the chairs are getting old and snags on my clothes sometimes.", "author": "Cecile S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "mmm... \n\nJust like I remember it. It's all so good. I'm super excited there's one in SF. All through college this was the singular restaurant my parents would take me to in Berkeley (Taiwan Restaurant on University). Today we stumble upon the SF sister (interior decoration is the same...quality of food is the same).\n\nWe of course over order. Steamed dumplings, sweet soybean soup, chinese donuts, boiled dumplings, rice cake and pork stirfry. My god. It's fabulous. Here I was thinking I would have to drive to Berkeley whenever I wanted to remember what good home cooked Chinese food tasted like.\n\nThank you.", "author": "Annie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "Surprise Taiwanese food discovery!  My beloved curry chicken with the fluorescent yellow sauce, and containing naught but chicken and onion.  No green peppers, mushrooms, water chestnuts, bamboo shoots, or other nuggets of anything to clutter it up.\n\nPork chop on rice (pai gu fan) extremely tasty, missing the brown sauce my friend was seeking but apparently it's prepared in many different styles of which this was one.\n\nLow, low prices!  I am going to go back again and again.\n\nA standout location in the Clemental region.", "author": "Walter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "I've gotten food here for probably over 20 years and it still remains a good place to eat.  My favorites are the Shanghai Chow Mein and Xiao Lung Bao..oh yes!  And also the Chow Leen Go..  I know...there's no soup in the xiao lung bao, but I like the gingeriness of it.  This used to also be my go to place for pot stickers which looks the same and probably still as good except that I'd rather have the steamed xiao lung bao instead.  \n\nWhen I was young, I loved watching them making the chinese doughnuts in the window.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "Great cheap place for Taiwanese food.\n\nXiao Long Bao here are large with thick skin so it's definitely filling.\n\nMinced Pork Rice is fantastic and is a great replacement for plain rice.\n\nGreen beans could have been cooked a bit more, but still good.\n\nSomeone recommended this place for breakfast, but I haven't been yet.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-10", "description": "Once i find a great Taiwanese food place... I'm going to move next door. Seriously? No. But i really am on the search for a few great Taiwanese places in the city (Spices already being one of them =). YAY!\n\nI had the pork chop and rice, squid stew, and ba-wan (meatball bowl?) \n\nIt was a nice quick fix but it was overall... ehh... just okay. The pork chop and rice was fried kinda strangely and the meat sauce on the rice was rather lacking. \n\nThe squid stew was lacking quite a few ingredients that would've made it fabulous. \n\nI thought the ba-wan was pretty decent. \n\nThe service was great! They were super nice and efficient. The food though? I wasn't impressed... but will i go back? Probably! \n\nTimes like this... i miss my Taiwanese mother.", "author": "Angelinaaah h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-04", "description": "The won ton soup and pork chop soups are pretty good. \nSo is the lemon chicken. \nMu shu pork isn't so great. They serve it with a thicker, pita/tortilla type of wrap.\nNo atmosphere to speak of.\nThe service is good.\nOverall, Taiwan is an okay place to eat, but with so many other restaurants to dine from,\nthere's no real urge to return anytime soon", "author": "chris m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-13", "description": "Can you say the best potstickers in town???\n\nOther than that the food is a bit different ever since they changed owners..it isnt terrible..i still eat here so thats a good sign!\n\nparking sucks by the way..good luck!", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "I was here on a weeknight and it was almost empty. This city is so strange. A couple of blocks down people are lining up to try to get into a restaurant and here is this place with cheaper and more authentic food and it sits empty. Go figure.", "author": "karabina c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "I actually liked this place.  We ate a restaurant just down the street the night before but I would have to say I thought this place was better.\n\nThumbs up for the dumplings.  They were freshly made and quite tasty!  Made me think of the jiao zi my grandmother used to make.  YUM!\n\nYup, I'll come here again if I'm in the area and not eating somewhere else.", "author": "Juliana T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-24", "description": "Four stars for the sesame cake/bun, everything else get 3 stars.\n\nI crave the Northern Chinese/ traditional Taiwanese breakfast sometimes, but not many places serve it in the city, so I finally stopped here and try it this morning. We got the sweet and savory soy milk, fried donut, sesame bun/cake, and the jiu-tsai-he. \n\nThe sweet soy milk is so good that I ordered 2 more for home. The savory one wasn't so great because they didn't season it, you have to do it yourself. A&J in cupertino village has better savory soy milk. The fried donut is WAY too bready. BUT, BUT, BUT, the sesame cake is REALLY GOOD!! Baked to golden and flaky, great with the fried donut and sweet soymilk. Yum....I miss home.\n\nWill come back and try other \"authentic\" Taiwanese dishes some other time.", "author": "Yuchi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "One of the best deals in town for Chinese/Taiwanese food, and the folks who work here are quite nice.  The ingredients are fresh, little to no MSG, not too oily, and food always comes out fast and hot!   I'm here 2x a month and recommend the following:\n\nOnion Pancake\nShrimp/ Chives Dumpling\nThick Shanghai Fried Noodles\nMa Po Tofu\nCrispy Pork Spareribs\nLong beans with ground meat\nNoodle soup with mustard green\n\nNever get tired... been coming here for years.", "author": "Hotung T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-13", "description": "I love the interior, it is so sparce and odd. Dumplings are delicate and fresh. The huge long dong chinese donut was meh... but everything else was good. I always walked by and was so happy i finally tried.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-19", "description": "I came here for my friends 'birthday dinner'  since Burma Super Star was soo crowded and it did not seem like we would get a table. I was hungry so we decided to try go to this place. We had a lot to eat for $15 for 3 people. The service was good too! The lady was really nice, my friend was being all bitchy saying that she was talking in english just because we were ABCs. They were still nice. Lemon Chicken was fantastic!", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "I really think that bus stop that is covering this gem should be moved a store over. seriously? i would have missed it! \n\nI love this restaurant...i have total food coma which means that i ate too much...because it was so DELICIOUS! yummy! i love their cha chang myon (bean & meat sauce noodles), sweet and sour shrimp, crispy spare ribs, and the deep fried squid. \n\nand the best part? LEFTOVERS! \nso if your craving taiwanese food...go here!", "author": "Suzan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-03", "description": "I've eaten here a few times when I still lived in SF full time. Food is good, service is just ok.\n\nI never order dumplings or boa here. I don't know why anyone would considering there are far better places that specialize in those dishes not far away in the Richmond district.\n\nThe noodles and the soy milk is what I come for. Don Don mien is perhaps my favorite there. Sometimes you just want a big bowl of noodle goodness.\n\nAs always, parking sucks but it's Clement, you should've already know that.", "author": "Jin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "The pot stickers and Shanghai dumplings are the best!  Freshly made and fried up fairly quickly, one of the best things about this place is the homemade fresh goodies they offer.  A favorite for us for Chinese breakfast, it is inexpensive, delicious and satisfying.  We particularly love the freshly fried Chinese donuts with our sweet soy milk.\n\nDelicious!", "author": "Betty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-30", "description": "Dumplings, dumplings, dumplings....that's the best thing about this place!!!  Fresh, steamy, and yummy!!!!\n\nBraised green beans....the second best thing about this place!\n\nEverything else, I think is just, \"meh!\"  \n\nThis is one of the places where ordering your usuals and favorites is not a bad thing.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-27", "description": "This place has it all.  Soy milk, noodles of all varieties, and dumplings around the China.  Nothing is overly expensive and everything is tasty.  I still want to go back and get some five spice beef noodle soup, something the Taiwanese know how to make.\n\nInside is your typical run of the mill Clement restaurant.  At first you walk in you get this interesting smell.  You can't put your finger on it but you know you've smelt it before.  After careful nose analysis, I've concluded that it smells like the perfume that people use to send out wedding invitations but it's been sitting too long and gone stale.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "Nine of us went to Taiwan Restaurant on Clement Street and 6th Avenue.  We have not been there in the past 2 years.  We got a seat immediately with the restaurant about 70% at capacity.  \n\nThe Food\nFor the price, the food was actually quite good.  We ordered the following items:\n1. Sticky rice in soup with vegetables.  The sticky rice was a bit overcooked and mushy, but the soup base was very tasty. They had a mix of vegetables including napa cabbage, carrots and some bok choy.  \n\n2. Rice noodles with Beef with a beef soup base. The beef was extremely tender where the meat melted in your mouth.  Great dish and one of the first to be finished.  \n\n3. Rice noodle with tofu with clear broth was another great dish with eggs an mixed vegetables.  Soup was great and the mix of tofu with eggs was also very good.  \n\n4.  Shanghai noodles with spinach, pork and shrimp.  This dish was decent with the shrimp and pork being the stars of the dish.  The flavoring was not quite there for me.  May have needed a bit more soy sauce.  \n\n5. Fried bread and sweet soy milk.  Add your own sugar so that you control how sweet you wanted the milk.  Kids loved it.  The bread did not go as quickly though, but looked good (like a donut).  \n\n6.  Potstickers were nice and large, and above all, tasty.  \n\n7. Shanghai dumplings (siu lung bau) was juicy inside and tasty too.  Both the last dishes takes awhile to cook so came at the end.  \n\nOverall, the food was good but can be considered great based on the price.  For $48 (after tip) we easily fed nine hungry folks - five kids.  \n\nWould definitely go back and order similar items in the near future.", "author": "J Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-21", "description": "Quick service. \n\nWhen we came in, we were quickly seated. The pot of tea was coming shortly. After ordering, bowls of hot & sour soup were coming our way. I ordered the general tsuo's chicken. It's very good and I had ordered it the last time I came here. Good portions of rice & chicken. I think I should try something else on the menu the next time I go back.\n\nThe lunch menu is quiet cheap! $4-6 for soup, fruit, and choice of entree!\n\n**6/25/2008\nI had the asparagus with chicken and it was absolutely delicious!!", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "Taiwan Restaurant is my favorite place to eat in SF.\n\nThe food is VERY affordable with generous portions and tastes awesome. Though, I'm sure the MSG will kill us all sooner than we'd like.\n\nMust have dishes are Bean and Meat Sauce Noodles, Szechuan Hot Sauce Noodles (the vegetarian one is just as good, they just don't put pork), and Fish-flavored Egg Plant.\n\nThe only thing I would stay away from at this place is the lamb. The beef variants are fine. It's just that the lamb at this place never seems right.\n\nAs a kid I always enjoyed watching the sous chefs prepare the dumplings in the front of the restaurant. Really nice touch to show everyone that the food is freshly made.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-20", "description": "never found a place that does the Taiwan country favorite ribs like this place. yummy squared! the deep fried doughy thingies (ngow lay so) that they fry up in the front display kitchen are slightly sweet and tasty as well. funniest thing about this Taiwan restaurant is all the Cantonese spoken here by staff and customers alike. i guess I need to go to the South Bay to hear Mandarin spoken in a Chinese restaurant!", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-26", "description": "Nothing we ordered was very good. I wouldn't come back -- it's sub par Taiwanese food. I had the \"peddler\" noodle aka rice noodle soup with ground pork, beansprouts  and boiled egg. I've definitely had better such as the one at Tainan in Cupertino Village. My lovely dining companion had the braised beef noodle soup. Again, it was not very good -- the broth was not spicy and the noodles were not homemade or tasty. We also tried the green onion pancakes which were deep fried. Why would you deep fry the green onion pancake?", "author": "Helen Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-25", "description": "The place looks like a typical run-down Chinese restaurant with tacky pink paint color and dim lighting.  I think they tried to make it classy with a dirty sunlight, but i wasn't fooled.  Never go to a restaurant starving, because we ordered a feast for 8.\n\n**HOT SWEET BEAN MILK -- had to add sugar yourself. tasted just like soy milk. nothing impressive.\n**CHINESE STYLE DONUTS [yow teew] -- best i have ever had!!!!!!!! i even ordered one to go. it was light and crispy and not too oily.  The only downside is that the place did not serve congee to eat it with.\n**CHINESE GREEN ONION PANCAKE -- not impressed.  Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n**MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. flavorful and not too spicy.\n**TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. fried a little too much, it was a little hard to bite into.  strong taste of basil with it. \n**DUMPLINGS -- decent. enough said.\n**STEAMED PORK BUNS -- decent. the stuffing inside had a taro texture to it.\n**SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. good but probably not the restaurant's specialty.\n\n\nprobably won't be a repeat customer for anything but the CHINESE STYLE DONUTS.  \n\nand guess what, we ordered so much that it became my thanksgiving dinner.  why do the food gods hate me so?!", "author": "Bernice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-26", "description": "The best eggplants hands down! I love this place.  It's cheap, fast and it tastes great!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-02", "description": "I've been craving some Shanghai dumplings and this is the place to go to.  I  went here this morning and had myself some sweet soy bean milk, it sure hit the spot with the morning chill n all.  Also had the Shanghai noodle and a side of green onion pancake too.  It was a delicious brunch.  \n\nWhen the bill came, we were surprised how cheap it was.  Now how can you beat that?!", "author": "hello k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-13", "description": "Food was OK not too exciting.  Service was poor.  Hate it when waiters bring dishes to the table before clearing the table for an open spot.  They just stand there and look and wait for you to make room for the next dish.  Honestly felt like I earned a share of the tips.", "author": "willie w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-08-03", "description": "I love the food here. It is great, from the pot stickers to those oily bread things Yauw Ja Gwuy. The noodles are even better, Dahm Dahm Mean, it's so good. I also love the dumplings. I love everything about this place. It's still so good, and I always remembered it from childhood. Sadly I am no longer nearby this neighborhood that often, and I miss it sometimes between Spices and all the stores.\n\nUpdate:\nI no longer miss this place. The last time I was here, I found plastic in my dam dam mein. PLASTIC! Unwrap the damn thing before you serve it!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-12", "description": "Would be one star if their you tiao (chinese donuts?) and scallion pancakes weren't so damn crispy and addictive!  \n\nSeriously, that was a really gross meal.  There was this noodle dish that was just chicken broth thickened with a lot of corn starch, a shit load of white pepper, and dried noodles that was probably supposed to soften in the soup.  Gross.\n\nInflation sucks a lot because the Chinese donuts used to be $.75 back in the day.  I think its over $1.25 now.  :(  I love that oily goodness with my congee!", "author": "Anna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-29", "description": "Total yummers!!!  Went there today with my girl, Nichole, and we had a delicious Friday lunch!\n\nTry their Chinese donut w/ sweet soy bean milk, boiled dumplings and salty sticky rice!", "author": "Keika L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-26", "description": "I really wanted to be impressed. Really. My boyfriend had been wanting to go here for a long time so we finally tried it out. The menu looked good, but the only think I ended up enjoying was the steamed rice! We ordered pork soup (I think it's a specialty of the house), sizzling beef, and baby squids. Everything was so salty it actually burned my mouth! And the baby squids were waaaayyyy over garlicy (even for someone like me who cooks everything with a couple cloves of garlic!). We meant to ask them to cook everything with no MSG and low salt but forgot. So I partially feel that the meal could have been better had we asked. That being said, the fact that you have to ask for things to not be loaded down with salt is an issue for me in itself. \n\nWith all of the great places to try, I will definitely NOT be going back. Sorry, Taiwan. I really did want it to be good...:-(", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "This is one of the few restaurants that is open late (10:30pm), cheap, but not cheap enough to sell chicken feet an pig intestines (see D&A cafe). I ordered the typical chinese favorites--potstickers ($4) and green onion pancake. ($3) Turned out to be way too much food! It was a warm, yummy, oily meal. Just what I wanted. I think of it as my local american-chinese joint with a much better selection. I'm sure I'll be back at night to try the Taiwanese noodles.", "author": "Rahil P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "Mmmmm, just like a home cooked meal at home in Taiwan. \n\nIt's a little on the saltier side, but all good and authentic and can't beat the prices.", "author": "lily l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "wide range of food selection. the food here is very close to what i used to have in taiwan so you can trust that it's really authentic taiwanese. \n\nthe place smells a little bit (perhaps of mold) because the interior looks dated. The tables also don't look very clean but the cutlery look clean.", "author": "J P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "Pretty good/authentic Taiwanese food. Get the fried onion pancake, steamed soup dumplings, and any of their fried noodle dishes. Food here is on the oily side, but hey, that's Taiwan for you.\n\nOther things we tried:\n-Sweet/sour soup: pretty good\n-Sauteed green beans: get this\n\nIt's kind of your typical hole in the wall. The best part about it: a rope that's tied to the handle of the front door to the roof of the overhang. Guess they have a problem with the door sticking? Lol. Can't get anymore ghetto than that. Again, that's Taiwan for you.\n\nThe staff is courteous, fast, and friendly. And don't forget your (unwrapped) fortune cookie at the end of the meal ;)", "author": "Yee-Shing W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-30", "description": "I went here on a Monday afternoon around 2pm with fellow yelper, jason g. The place was not busy at all, it looked like there was only one waitress that waited the entire restaurant and there were only a couple of customers, so our orders were promptly taken and our orders came out quickly. We ordered fried pork chop over steamed rice with preserved veggie's, a dish that resembled general chicken but was sliced beef battered with a tangy dark sauce and chicken dumplings. I think we ordered too much meat, we should've ordered a vegi dish. The pork chop was good, it was lightly fried. Although I would probably choose the salt and pepper pork chops over that, like the ones they have in Chinese restaurants. The beef dish was just okay, it was an American-Taiwan dish I guess. As for the steam dumpings... aren't they supposed to be really juicy inside? Or am I just comparing this Taiwanese restaurant to other Chinese/dim sum restaurants? =/", "author": "Vinkin Ken T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "I finally tried the beef noodles (hold the beef) and it was a nice broth however it was too plain.  It was noodles, broth, and vegies.  It lacked: green onions, pickled mustard, bits and pieces of fat.  But the flavor of the broth was nice.  I think if you order the beef noodles WITH beef, it would taste better.  I did ask for a side of pickled mustard - very delish, kinda sweet.  $6.25.\n\nAlso had an order of steamed vegie potstickers.  It was ok, but with a very obvious Chinese vegetarian smell and taste of fungus.  I'd skip this next time.  $4.\n\nWhile the food is ok la, I like the female server who served me both times.  She's middle aged but smiley and doesn't ignore you.  \n\nI'd come back to grab a bite whenever I'm in the area.", "author": "Mrs F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-18", "description": "Clement is a center for Chinese people, so I figured to find some good Chinese food here. The other giveaway: we walked in and EVERYONE was speaking Chinese. Now, I thought, this place must have good authentic Chinese food!\n\nThe menus were in both Chineses and English, so there shouldn't be too much trouble for English-only speakers. Besides, I can't read Chinese anyway.\n\nService was nice and quick.  The place was very well lit and clean. The skylights really helped make the place very welcoming.\n\nThe food wasn't too oily, which I really appreciated.  While I can't read Chinese, I know most of the Chinese dishes by their Chinese names only.  So I would like to recommend a dish or two, except I don't know their English names.\n\nIf you want Chinese food and not that frilly \"fusion\" crap or Chinese-food-made-for-Americans like Panda Express, this place should be a top choice.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-13", "description": "Drove by this place almost a year ago and vowed that I would try it out. Hell, a place that calls itself Taiwan Restaurant (that's the name in Chinese too) is either full of itself or the real deal.\n\nWas finally back in the area today and stopped by for lunch/brunch. I was just about drooling after a quick glance through the window - lots of fried Taiwanese goodies. My friend and I got the oyster pancake (o-ah jian), the shredded turnip cakes (luo bo si bing), the pork chop rice (pai gu fan), the bean & meat sauce noodles (zha jiang mian) and the soymilk (dou jiang)\n\nThe oyster pancake was pretty good, though a little light on the oysters. The shredded turnip cakes probably would have been really good, except they were already cold by the time they hit our table. The pork chop rice was fairly good, but the pork chop itself was a little too sweet. The zha jiang mian was probably the best dish, as it was a good representation of Taiwanese style zha jiang mian (lighter in color and with a higher water content that Shangdong style and Korean style zha jiang mian). The dou jiang was also pretty good, and I liked being able to sweeten it to taste.\n\nOverall, pretty good Taiwanese fare though we did hit upon a few duds. Still, there looks to be enough depth in their menu to try again.", "author": "Albert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "Reliable Taiwanese comfort food.  I like the steamed chicken dumplings, rice petals with por and pickled cabbage and the donuts.  Perfect place to visit on a rainy day in the city.  Not super well heated though so when it's really cold our, its also chilly inside.", "author": "Debra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "This was a delicious surprise. We rolled in, my food cohort and I, late on a Friday night looking for some post-movie grub. The service instantaneous and good throughout, perhaps because it was 10pm and we were the next-to-last people in there?  \n\nI'm an onion cake kind of guy. Especially when they're the thick, pancakey kind... not those wafer-thin crisps. And these were good. $2.75 for two of them, which are cut into fours and could easily make a meal in and of themselves.\n\nAlso had the velvet chicken. Sauteed with snow peas and a wine sauce. Didn't get much wine out of it, but it felt pretty healthy. Because hey, I didn't have a massive coronary after grubbing down the fried onion cakes, which by rights I probably should have had.\n\nI'd like to go back and see what else they've got going for 'em. The menu was frickin' huge and said \"Fowl\" for the chicken dishes.  Heh heh... fowl... how I love you and your egg brethren... but lets work on the name... still, you've got a good thing going on...", "author": "Rob W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-16", "description": "I was invited to this dive by relatives so this got my hopes up. The service was decent for a typical Chinese restaurant. The natives were friendly! The place itself is clean and appears relatively well maintained. \nNow for the food, gulp! Their oyster pancake was underwhelming and so were the steamed dumplings. Not bad but not the \"I've got to shout it out at the top of the mountain\" variety, you know. They had not so crispy chicken which the kids liked, a vegetable delight that was undelightfully bland and a spare rib that had this artificial reddish hue which made me think twice about biting down on it. I did anyway against my better judgement. Ooooh! It tastes like orange chicken! \nThe one really pleasant surprise was the bill. We had at least 10 dishes for 10 people. OK, more like 8.5 including three kids. Total cost? Less than $100! Not bad if all you want is to feed a gang of hungry peeps who you aren't trying to impress! If I'm flat broke and on a cheap date, this will be on my shortlist. Otherwise, keep on walking down Clement.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-20", "description": "Yum!  I love their nian gao (sorta like chow fun but better!  Very chewy) and green onion pancake.  That's what I always order if I'm in the neighborhood!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-12", "description": "One of my two favourite places to eat.\nTheir broccoli is the best you can get anywhere.  \nTheir chinese donuts are fabulous, and are very similar to the ones I regularly consumed while in China (unlike those sold most places in the city).  \nThe service is always incredibly fast, and they're so pleasant and nice!\nThey've come to recognise me and my family, occasionally giving us free extras, because we go there so often.  Which is really saying something, since we live over an hour away.\n\nWonderful place.  Did I mention how cheap their lunch menu is?  Generally $3.99 or so...", "author": "Leila-Anne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-01", "description": "The fried dough sticks and \"beef tongue pastry\" (sweet version of the former, don't take the name literally) are typical breakfast items from Canton. They are comfort food, especially when you get to dip them in warm soy milk. For this experience, I would keeping coming back to Taiwan Restaurant. \n\nOne minor criticism: The fried items they make tend to be overly dense. If only they would make the dough lighter and more airy, I would give extra stars.\n\nPS I think the beef tongue pastry is only available on weekends.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-12", "description": "Used to come here once in a while as a child.  When they first opened, it was a really popular restaurant but I think they've certainly lost a bit of their luster.  I really liked it then cause it was different and modern at that time.  But the place looks rundown now as compared to before.  \n\nSo I did make a return visit recently and they were okay.  Not super but a place I wouldn't mind coming to once in a while.  It seemed like the prices were pretty fair.  I was expecting their dishes to cost more.  \n\nI always look forward to eating dumplings so when I am in the mood again, see you soon Taiwan.......", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "This restaurant could be easily overlooked, because it is small and rather nondescript, but that would be a HUGE mistake. The prices are unbelievably low and the menu is interesting. Especially notable are the noodle dishes and the fresh soy milk. The sizzling rice soup is also a winner. I like the $3-4 noodle dish that has the thousand year old egg in it when I just want a little gnosh after having cocktails or shopping.", "author": "Revive M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-19", "description": "Everything was a bit too doughy for my taste...the \"cow-tongue\" crispy bread, the Shanghai thick noodles (which was a hybrid of flat noodles...strange), green onion pancake, and the skin of the xiao long bao (steamed dumplings) & potstickers. just everything...doughy! If it wasn't for the tea or the soy bean milk, i'd probably have a hard time stuffing all that food down my throat.\n\nThere are a few commendable dishes...like the soy bean milk & chinese donut, fried spareribs, the \"three-cup\" chicken and some of the other noodle soups. \n\nI come here sometimes when I'm craving taiwanese food and don't want to go far. The prices are reasonable for what it is. On weekends, you might have to wait a bit before getting seated.", "author": "Jeremy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-05", "description": "Order carefully. Not everything is great here, but there are some really great standards that keep people coming back. Good clue to know if you are ordering correctly, look at the table next to you. There's a lot of regulars at this restaurant and they know what's good. Not everything on the menu is great, but once you've gone enough times you will find your favorites.\n\nI'm a sucker for this restaurant. I know it's not anything compared to what you'd find outside of San Francisco, but it's grown on me and I love coming here for steamed vegetarian dumplings, Schezuan spicy noodles, tofu and mustard greens, Taiwan special deep-fried tofu, dry braised green beans, sizzling rice soup.\n\nThis place is super cheap, has good food, and has an extensive menu with your normal and not so normal (see \"stuffed baby squids\") Chinese food. \n\nThey are known for the dumplings. They make them in the window. I've heard their Xiao Long Bao are not so good, but I really like their vegetarian steamed dumplings.\n\nMost of what you see in the window is on a small dim sum menu. Look in the bottom right corner of your menu to find it. It's on one of the folds.", "author": "Timothy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-28", "description": "I been to this place twice and still do not like it. The first time I came here with my friends from NY and we thought the food was below par and even though I forgot what we ordered, all I know was it is not authentic.\n\nRecently, I came back for lunch with another set of friends. The only thing that stood out was the shao long bao (which by the way still does not stack up to Joe's Shanghai in NY). The scallion pancake was thick and similar consistency to american pancake and too fried/crispy. We got the meat sauce noodle which tasted like shanghai fried noodles (we agreed that Spices makes a more authentic dish). \n\nThe potstickers were ehhh. When I discover this place serves oyster noodle, I was excited but was sorely disappointed when it came out. The oysters were superbig that none of my friends wanted to try it. After one bowl of it, I gave up. \n\nMy question is this, why do they call it Taiwan restaruant when nothing here is served like Taiwan??? Last I checked when I went back to Taiwan, none of the dishes tasted this weird!!! Or is this what everyone calls FUSION??? Maybe I was under the impression of false advertisement or ordered the wrong dishes, but seriously now, coming from someone who does speak chinese and have tasted authentic Taiwanese food, I would not recommend this place.\n\n*Also, cheap does NOT mean good! There are plenty of other places in SF that is cheap and is WAY better*", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "So take into consideration that my review:\n\n1. Is based on a take-out order;\n2. The order was placed after a strenuous day of snowboarding and;\n3. That that meal was eaten by starving individuals.\n\nI ordered the Singaporean thick rice noodles and a side order of potstickers. The noodles and potstickers tasted like the best noodles and potstickers I have ever had in my life.", "author": "Sandy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "Came here for brunch.  The menu is basically the same as the one in Berkeley (yay), but the food is a little different.\n\nExamples:\n- cold jellyfish was tossed with a vegetable and had a lot of liquid\n- sesame paste noodles came with cooked spinach and some chopped peanuts instead of raw cucumber, but was just as good\n- pot sticker filling not as flavorful\n\nThis place is cleaner, smaller, and has friendlier service, but I prefer the food in Berkeley.  But maybe I just need to come here a few more times to have my mind changed.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "I come here whenever I want a potsticker fix!  My family and I used to frequent here just about every other weekend (my brother loves LOVES potstickers!).  These days I go back for the green onion pancakes, steamed dumplings, potstickers, \"chow neen goh\", and soy bean milk.\n\nAltho the decor can use some revamping, this is still the place the go for some northern style dim sum in the Richmond District.", "author": "elaine i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "As read above this place is awesome and such a good bargin.\n\nI personally recomend going to eat here for breakfast . The dim sum served here at breakfast is one of my all time favorites. \n\nWhen you go , order the green onion pan cakes, the sizling rice soup and the chinese doughnut. \n\nYou wont be dissapointed.", "author": "Benji C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-13", "description": "This is a great family style, relaxed and cheap Chinese restaurant. Pork with mustard greens, crispy prawns, sizzling rice soup, red eggplant and pot stickers are all excellent and can be ordered with no msg and low salt- something which I heartily recommend. \n\nAfter years of great meals here, it's a must stop with guests from out-of-town, especially with kids. \n\nThe only downside is the bathroom, which would not suffer from more frequent cleanings.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-01", "description": "Delicious, cheap, big portions, decent service. Nothing bad to say about the Taiwan. Make sure to order at least of one of the following (or get 3/4 people and get it all):\n\nhot n' sour soup\ndry braised string beans (how can string beans be so good?)\npork dumplings (the little kind)\ngreen onion pancake (one of the only worthwhile I've ever had)\nshanghai noodles", "author": "Sophie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Taiwanese breakfast!  Yummy!  I come here for that exclusively when I'm craving those chinese donuts with a bowl of warm soy milk or a bowl of their sweet soft tofu.  The staff here are friendly and service is quite prompt.\n\nYou can see that they make the chinese donuts on site and they're fresh and pipping hot.  They also have great scallion pancakes, so anything dough based  that they make from scratch has been top-notch.\n\nI'm not a complete fan of their lunches.  I've had three noodle bowls and have not been extremely impressed.  But, you can't really argue with the price.", "author": "Mei C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "When I am extremely hung over, like the alcohol is literally seeping out of my pores hungover, I make a bee-line for this joint. \n\nSomething about the combination of the steamed pork dumplings, Beef ala ShangTung and Wok Fried Bok choy Hearts with extra garlic and I am saved. Released from the hell I have self induced and free to roam the streets again in all my glory", "author": "Ham and Eggs M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-17", "description": "Very casual, but nice restaurant that is (almost) a break from the monotony of Thai and Cantonese style restaurants on Clement street.\n\nI like the pig's ear's or tripe in sauce, my Shanghainese company thought it was a little wrong. Whether it was actually wrong or a difference in preferred tastes I don't know.\n\nBut I do LOVE their meat buns!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-03", "description": "Can't find a Taiwanese restaurant? Well, this spot might be ok for people to try. I've eaten here a few times here and there but I was craving some pork chop noodle soup. They make it pretty good here so until I find another place to fulfill my craving, i recommend trying this place out. It has been there for years and years so its gotta be pretty decent. Oh yea, their food is on the salty side but I've discovered thats the trend to a lot of Taiwanese food.", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "Was here on Friday night.  The food's affordable and delicious. Great for impromptu dinner dates.", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-07", "description": "you are disgracing Taiwan...\nplease change your name...\nyou dont even have much Taiwanese food on your menu!!!!\n\nnow I miss Taiwan even more...the food just isnt the same T_T", "author": "phillip w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-05", "description": "This is a great restaurant. I've been coming here since I was a kid and the food has stayed pretty consistent. Their shanghai stir fried noodles or whatever are OK, but the rice stick things are awesome. All the noodle soups here are really good too. Noodles taste like their home made but their sauces are a bit salty. Overall this is probably my favorite taiwan/shanghai style restaurant in the city. \nGreat food, large portions, and cheap.", "author": "Ale x."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-22", "description": "3.5 stars.  I'm still full. It's been 2 hours already from our meal, but I still have to move slowly as I roll home. We didn't realize we had over-ordered until the plates were served. The portions here are HUGE. I liked the pork and cabbage dumplings. The lady said that they were soup dumplings. Although  shaped like them, but they actually weren't very soupy, but delicious nonetheless. Also, the salty soy soup is awesome. \nOverall, the service was great - very friendly.", "author": "GS M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "I always get a bowl of soy milk, chinese donut, rice cake w/ pickled vegetables and pork, onion pancake, and dumplings. \n\nMaybe next time I'll get some noodles.  The restaurant isn't a looker, but I can look past that since the food makes my tummy happy.  All in all, I'm never disappointed.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-24", "description": "Okay I'll admit I've only ever had five dishes from here, but I LOVE everyone (and I get stuck in a dishes I love rut with asian food but thats my choice and don't disregard my review because of it).\n\nTheir General Tsou's Chicken is divine.  Not goopy sweet or ridiculously spicey like most places.  That perfect balance of sweet and spicey and perfect with plain white rice.  \n\nTheir Shrimp and Snow Peas is also amazing.  Simple, light but super flavorful.  This girl loves her snow peas and devours every one.  \n\nI've also had the potstickers and pork fried rice, good staples that you can't go wrong with.  The potstickers have a nice firm skin and aren't a soggy mess and the pork fried rice is light and not greasy like a lot of places.", "author": "Dawn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-18", "description": "I wish this place was good cuz Taiwanese food in SF is terrible.  All the Taiwanese people are in South Bay with all the good Taiwanese restaurants.  Supposedly.  Stick to the dirty canto food in SF.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-15", "description": "I've been here in the past and had really good memories of this place, but my recent visit has been disappointing. The (shao long bao) dumplings were not as delicate and just very bready. The beans were old and the dish was returned. But the onion pancakes were good. The service was good, they were nice about returning the dish but as far as the food quality, i know it could be better.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-02", "description": "For cheap and delicious food you must go here.  Their dumplings are freshly made to order are oh so juicy.  $4 for 6 big dumplings = best deal!  I also love the noodle with black beans and meat sauce.  This is my best cheap finding so far.", "author": "Mai-Tam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-02", "description": "Inexpensive and tasty chinese-style food. We went to get dim sum at night, and ended up with vegi potstickers, eggplant and shrimp chow mein. The eggplant was awesome - potstickers average and chow mein greasy and tasty! Plus, bill for two was less than $25!", "author": "Kai C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-12", "description": "One of my favorite small Chinese food spots (see also San Tung). (Though, in this case it would be Republic of Chinese food.) I've travelled to Taiwan a bunch and gone to a famous spot for dumplings in Taipei. The dumplings here are on par.\n\nThe other thing not to miss is the spicy prawns. These critters come lightly battered, fried cripsy, with lots of garlic. I almost always get 2 orders. Also check out the dried braised green beans ... crackin'!\n\nService is good (and quick), too.", "author": "C. A. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-12", "description": "Went there for a hearty dinner before finals. We ordered xiao long bao, black bean noodles and long beans with shrimps lunch plate (yes, the waiter told us lunch plate is still available)\n\nThe waiters there were very friendly and patient with us. They have an extensive menu and it took us a while before order. We wanted to order one of their sizzling plate but the waiter was honest enough to tell us that it's only so-so. Anyhoo... food came and portion is big. The black bean noodles were alright. I expected it to have more sauce and to be honest, i like the one in Shang-Dong better. Their noodles are more flavorful and has more sauce. Long beans with shrimp is a complete disappointment :( The waiter took the wrong order and thought I ordered long beans with rice (without the shrimp). And the long beans were obviously left-over. They weren't only warm.. and very salty. We told them not to put MSG (there's such option on the menu), but couldn't really tell if they really did as ordered. Xiao long bao was okay. It's freshly steamed but unfortunately, not juicy inside. The skin was also too thick. And, they only have the white vinegar, instead of the more traditional black vinegar used as the sauce.\n\nService was good, portion is big and price is reasonable. But food-wise, it's only ok. There are better chinese place nearby.", "author": "Doris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-08", "description": "the 4 stars are  for Tainan noodle soup, the sweet soy milk, the Taiwan friend rice noodle~", "author": "Susan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "they serve the best dry fried string beans in the city, and i mean it. come for brunch and order some soy milk with a chinese donut. come for lunch and get yourself a piping hot bowl of beef noodles. come for dinner and order some string beans with spareribs. sprinkle in some dumplings and pot stickers along the way. there, i just helped you with a day's worth of meal planning. you're welcome.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-16", "description": "taiwan my ass. there's nothing remotely taiwan about this place and its cuisine. even lowly moi can teach these people a few things about some good taiwanese street/alley food. \n\nwell hell, i think i shall:\n\noh-ah jian (taiwanese oyster omelette)\n\n4-5 farm fresh, cage free and organic large eggs\n3 green romaine lettuce leaves, washed and chopped into strips\none jar of small pacific oysters, should be no bigger than half a finger's length\ncornstarch or potato starch dissolved in water\nsalt and ground white pepper\n\nsauce (any sweet and sour sauce variation, but this is one i use sometimes): 5 tablespoons of light plum sauce, 2 tablespoons of ketchup, 2 tablespoons of sugar, rice wine vinegar to taste and a little of the cornstarch water (heat ingredients in saucepan with some extra water, stirring constantly to smooth sauce, and remove any solid matter at end)\n\nbeat eggs with salt and pepper. heat frying pan with some oil on medium heat. drain oysters (do not rinse), mix with cornstarch water and place in frying pan with lettuce. immediately add egg to mixture and evenly distribute oysters throughout the omelette. turn heat down to medium low, flip once. once eggs are set (should look more like a frittata), pour plum sauce on top of omelette and serve.\n\n(for a variation: chao-jiu style oyster omelettes have chives instead of lettuce. chao jiu is a small region in china's guangdong province)", "author": "May T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-04", "description": "Taiwan on Clement is a great place to go when you're starving--the food arrives super quick.  It's cheap, with lots of vegetarian eats and dim sum treats.  And the service was pleasant and accommodating.  It's reinforcement that, at Chinese restaurants, good food and service don't have to be exclusive from one another.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "this is me when i eat here with my mom and sister:\n\nmom: \"so what do you guys want?\"\nsister: \"uhhh i don't care....\"\nme: \"WE ARE EATING SHANGHAI NOODLES, THE SOUP NOODLES WITH PORK AND PRESERVED VEGGIES AND XIAO LONG BAO AND THAT'S IT!!\"\nmom: \"did you want chinese doughnuts and milk?\"\nme: note that my answer will vary if my brother is with us. if he is, then it is a YES and if not, NO because they're generally too greasy for me. \n\nluckily my mom puts up with my selfish ways and lets me order the same 3 things every time we come here. what can i say, it reminds me of my grandma taking us to lunch here every once in a while when she was still alive. she introduced me to this style of food and i wish she was still around so i could eat dumplings (and her homemade wontons) with her all day.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-22", "description": "I've been going to this place ever since I was a kid.  The sweet soy milk and taiwanese bread rolls are always good.  I also like their egg with oysters and the taiwanese spare ribs.  The food is a bit greasy and filling so expect left overs.", "author": "JACOB L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "had a lovely xmas eve dinner here with two of my favorite gents.\n\nreally, what more can you ask for? prompt service, succulent dumplings, delicious sizzling beef platter, excellent kung pao chicken and mu shu to die for!\n\nthe place is pretty no frills but offers up excellent food at cheeeeeap prices", "author": "Brooke M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-05", "description": "The politics and resultant Chinese culture of Taiwan expressed in food...mmm...edutasty!\n\nJust like the polyglot and frequently conflicting flavors of Taiwan's multiple waves of Chinese colonizers, settlers, and refugees, Taiwan Restaurant's menu is a Lazy Susan menagerie of its cuisines' best picks...or at least a very, very close approximation of what those picks can taste like, by using locally available ingredients and importable exotics.  You may not get the full \"authenticity\" of Northern Chinese fare like the shrimp and leek dumplings that you may get at San Tung Chinese Restaurant No. 2 (www.yelp.com/biz/M0JTO3oyu6gxh1mfFjU-dA), nor the defunct Happy Family Restaurant formerly at Geary and 2nd Ave. (God! I miss them so much!), but you can have fried rice flour-noodles with your steamed mini pork dumplings.  Meaning that you can have a traditionally Fujianese, Southern and coastal dish (rice flour noodles) with a traditionally Northern, Santung staple (the wheat flour bun) at the same table for the same meal in the same restaurant.  I know, I know, this distinction is like...wow, they have Neopolitan AND Sicilian pizza here!  Well, it's Chinese cosmopolitan, not just Cantonese.  I just wish they had more \"crazy\" sounding stuff...like that Hakka dish where salt-cured moldy mustard greens are stewed with ham hocks, or go trendy with stinky tofu.  Are you salivating yet?", "author": "Bruce L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-21", "description": "7:30 Thursday night we dropped in and there were 3 tables open.  The place was generally packed.  Good service, good food.  The menu had a tofu section and a vegetarian section, but best of all it had dishes from all parts of China.  The menu explains that Taiwan has eclectic Chinese cuisine.  We chose the Taiwan dinner for two, which included black bean chicken, and prawns & peas.  It appeared to be Cantonese style, you know the sauces.  Short wait for the table, short wait for the food, short wait for the check.  A solid place to go.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-26", "description": "The best kept secret of Clement.  Homemade dumplings AND \"destination\" Taiwan country spare ribs.  Their food is consistent, cheap, and DELICIOUS.  I probably go here weekly I love it so much.", "author": "Mariss D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-24", "description": "Not only will you be in total disbelief how incredibly tasty the various dishes are here (not to mention how  wonderful the aromas are) ... you won't believe how affordable it is... I just hope the place stays a Clement secret gem...just so the quality stays the same.  I'm vegetarian, but I've dined here many times with carnivore friends and their choices were even a little tempting just because of the amazing aromas rising from them.  Try it... you won't be disappointed.  Oh, it can be quite busy midday...but still worth the wait!", "author": "Grrrl W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-30", "description": "Good family style food at great prices!", "author": "Jared F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-25", "description": "This place is great.  Good food and very cheap.  Every dish was good.  I really enjopyed the Mongolian Beef, Fried Tofu, Sizzling Rice soup and dumplings were great.  I will definetely come back and the pricing is amazing.", "author": "Harry E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-25", "description": "I had dinner with my friends a while back. I ordered the fat noodles or something like that. I was pretty good. I was quite surprised at the size of the noodles though. We also ordered the onion pancakes which were yummy. I also had the sweet soybean drink but they forgot to give me it. If this happened on my bad days, they would only get 2 stars but I had a good day so 3 it is. The food is cheap tho.", "author": "Audrey M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-29", "description": "this restaurant is a disgrace to taiwanese. \nbeing a true taiwanese, i've always searched for the best food that i can find in bay area. i gave this place a try and all i can say is *nothing*... (shakes Head)\n\nhow do they dare to even put TAIWAN in the name of the restaurant.. \nfor the most part, i believe that other wannabe restaurants that served the slightest fake so called taiwanese food can do better then this.\n\nthe last time and only time i tried this place was years ago. i know for sure that no matter what i do, i'll never go back to this place. even if people say that this is the oldest taiwanese restaurant in san francisco.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-22", "description": "Homestyle chinese/taiwanese food at super low prices!  Great shrimp/leek dumplings, yeow tiaw (a.k.a. \"fried chinese doughnut,\" although a little dough-y), and noodles.", "author": "Mitzi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-19", "description": "This place is absolutely the BEST freaking Chinese type food in San Francisco... The vegetarian steamed dumplings are amazing, as are the spicy prawns, the brazed green beans, and the sizzling rice soup. I could go on and on and on, but I'll spare you. The atmosphere is plain, and is often filled to the max with people But it's great food. And prices are great.", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-25", "description": "I've been a regular at this restaurant for over 12 years and I've seen a slight decline over the same time - service and cleanliness.  But, here's the bright spot, the food is pretty consistent; albiet consistently greasy and delicious.  Here are my high's and low's....\n\nHIGHS:\n\n- The service is TOOO fast and can sometimes be taken as pressure to eat quickly and leave.  But I like it because I'm only looking for a quick meal and I would rather not wait around here for very long.\n- The food is prepared VERY quickly and some of it right before your very eyes.  When you enter, there is a little chef bay to one side (separated by glass) where their dumplings, chinese doughnuts, potstickers, and other doughy creations are hand made.  At least this station, up in the public eye, is kept relatively clean and you can witness the necessary skill to prepare your food.\n- MOST of their dishes are authentic and well cooked.  You will get generous portions for the price you pay - which is laughingly only very little, considering that this is San Francisco.\n\nLOWS:\n\n- This place would be shut down for sanitary reasons if the health dept guy wasn't a family friend.  They really do need to clean the dining area better.  I don't think their back kitchen is any dirtier than your typical Chinese restaurant, so I won't complain about that.  I agree that the bathrooms should be overhauled at least once soon.\n- The same generous portions are usually served swimming in oil/grease.  But hey, sometimes I actually like the additional lubrication!!  When/if you order the pan-fried rice cakes, you'll understand why (and for gawd's sakes, get it done dry - not too saucy).\n- I've noticed that the waitstaff are not that friendly to white customers.  I walk in, speak Cantonese, and they're still not that friendly, but at least I get what I want (most of them speak Mandarin).  Most of the staff do not understand English - which generally means lower quality service, but more authentic food.  You be the judge?\n- Don't wander too far off the core of the menu (it's like ordering pizza at a BBQ restaurant).  Even though the namesake is Taiwan, some of the more authentic dishes are NOT well prepared and shouldn't even be on the menu.  A prime example is their oyster noodles AKA \"o wa mee swa\" or \"euh ah mi swa\".  This, even as it is served, is a pathetic bowl of colorless broth, NO OYSTERS, NO FLAVOR, crappy FAT noodles (I don't need to go on).\n- DO order what most people at the next table order and what they're well-known for:  potstickers, soup/fried noodles, chinese doughnuts, onion pancakes, steamed dumplings, and sweet/salty soybean milk.\n- I don't order their rice dishes simply for the reason that there are better places that specialize in it.  OK, the prices are cheap and you might enjoy them, so do what makes you happy - it's all good.\n\nAnd lastly, I hope they never change the pink paint outside.  It's not very good looking, but SO EASY to spot.  There is also a Taiwan restaurant in Berkeley on University, but I haven't been to that one in over 10 years.  I prefer this SF location because of their specialties.  I used to eat dinner at the Berkeley place because it was $4.95/dish and it was VERY good for the price when I was in college.", "author": "Alex J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-01", "description": "Try the vegetarian pot stickers and the Taiwan thick noodles.  This has been one of my favorite restaurants in the world since I was born here in 1983.", "author": "Kate J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-18", "description": "I recently ate here with a couple of my friends and I was pleased by how CLEAN the place appeared. I was seated quickly and the staff was pretty friendly. We ate the pork buns, fresh steamed vegetables, \"spring rolls\", lemon chicken, and a few other dishes. I thought the pork buns were delicious, but I was unimpressed with the \"spring rolls\". I was expecting uncooked and NOT deep fried. Basically, what came out were some egg rolls. Im typically pretty health conscious, so I stayed away from those. I thought the vegetables were cooked well and the lemon chicken was tasty, although I did not feel like anything was worth writing home about. I may eat there again someday.", "author": "Joelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "I ended up here with friends after failing to get into Ella's for brunch and was much happier than we would have been, not even factoring the crowd and wait at Ella's.  Lots of noodles in the noodle bowls, good prices, the stuff written in Chinese on the walls is translated too, and excellent fried dough sticks.  Okay soy milk -- the salty kind could have had more flavor.  But I thought it was did a good job presenting Taiwanese food.", "author": "Leo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-24", "description": "Although I'm not a fan of things mandrin, I do love the noodle dishes here.  I'm a huge fan of the pork and pickled vegetable soup noodles, not sure if that is their english name.  Service has always been quick and friendly.  I have tried dishes that were below average but if you stick to the noodles and their specialities, you should be fine.", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-13", "description": "I left home about a year ago and totally missed my mom's taiwanese cooking ~  I didn't think this would be a good place just cause taiwense food is just so totally obscure and the place looked like a hole in the wall.  But let me tell you, the food was delicious!  Especially the 'taiwanese entrees\".  The bread they had in the window was my favorite part.  I suggest those and the taiwanese country styled spare ribs.  They were both a mix of sweet and salty.  My fave!  The prices are also super cheap and you can get a delicious crepe across the street right after!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "i've been trying to find dumplings like i'm used to in beijing and i've had a lot of trouble lately, even in this big city. i was surprised to find that this place had a great alternative. they've got a section in the menu that i believe is titled \"northern specialties\" and they've got some dumplings on there that are really fantastic. they're definitely spicy so be careful if you've got a sensitive palate. \n\nthey've also got fry bread. another favorite of mine from way back in the day when i was living in beijing. i used to walk out my door every day and just around the corner there'd be tons of street food venders selling fry bread and bao zi. its definitely not good for you and soaked in oil but its really tasty actually. try it, i think one piece only costs something like a dollar fifty. \n\ntry this place out. its great.", "author": "Georgia W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "One star for the Shanghai thick noodles. Everything else was bland (sauteed spinach), greasy (Tawain country ribs) or downright inedible (stir fried squid).", "author": "Yogi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-27", "description": "Out of most of the restaurants on Clement this place seems to be the cheapest. I've eaten here twice and both times I've had pleasant experiences with the food and the servers. However there aren't too many things that stand out in this place. Very average.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-13", "description": "Excellent food, great prices, awesome customer service and right across from a terrific fresh tapioca drink place.   Parking could be a challenge being it's on clement but close to Muni Bus #38 and #2 line.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "I have lived in inner Richmond for 18 years.  Taiwan is my default Chinese restaurant.  I have never had a bad dish or bad experience here. The dumpings are excellent and most of dishes are great.  There are some selections that are a bit too authentic for a gweilo such as myself.  \n\nI just wish they would take the flyers with random dishes and prices off the wall.  The menu is where this information should be!", "author": "Swaz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-27", "description": "This place is near my work, so I eat here often.  The place looks like crap inside and outside, but the food is delicious.  Start with the steamed dumplings.  The dumplings are cooked when ordered, so it is fresh.  It is served with shredded ginger and you don't need soy sauce at all.  The spicy tofu is good but needs to be more on the softer side.  You can taste the tobacco which is good and it's served with minced pork.  The shrimps with snow peas and carrots is good too.  It has a starchy taste, which I love.  Beef soup with glass noodle is good to eat on a cold day.  It 's served with green veggies.  Very tasty.  Lastly, you have to definatly try the CRISPY SPARERIBS.  Omg, to die for.  Very tasty, big portion and crispy.  I never had crispy spareribs like this before. I brought my boyfriend here and he loves it.  So you to should try it out", "author": "marley b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "Mmmmm sesame meat paste noodles and spicy Szechuan noodles and yummyish dim sum.  I've eaten at Taiwan for over 10 years and for a real cheap satisfying meal of noodles this is it.  I also like the pan fried string beans.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-31", "description": "two stars is being generous.  i just ate there tonight after staying away for about 20 years.  they just reminded me why i stayed away.  taiwan restaurant USED to be good and even great at some point then things changed.  very disappointed with the food.  not much else to say but that it helped me remember why my friends and i stopped going there.  having the green onion pancakes be one of your better dishes is depressing if not morbid.  before i took a first bite into my \"meat sauce over rice\" a traditional taiwanese dish which ALL restaurants claiming to be of taiwanese influence should already have perfected since it's so simple...even before i touched my spoon my wife said \"we are not coming back here again, they are lazy chefs\".  she is right, they didn't use any pork belly meat in the meat sauce and it just look straight from a canned deal.  i would suggest \"taste of formosa\" farther down on clement or \"tea garden\" in the downtown area.\n\nit will prolly be another 20 years before i listen to my wife and give taiwan restaurant a shot again.\ni hated when i am hungry and get sucky food.....i just get pissed.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Walked in thinking that I'd want to look at the menu before I sat down, but after taking a look ... the menu was varied and had a handful of things that just wouldn't be found elsewhere.\n\nThe Xiao Long Bao felt homemade and very tasty, the seasoning wasn't overly salty and just juicy enough.  I'd say it was comparable (albeit perhaps only better because of fresher ingredients) to food in Taiwan.  The Dan Dan Mian was delicious and definitely made in Taiwanese style rather than the Hong Kong style.  The turnip squares were quite delicious - among the better I've had for restaurant fare and the Scallion pancakes were different - a definitely deep-fried version that wasn't ringed in Cantonese style.  All in all, a definite restaurant I'd go back to.", "author": "Albert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "Food is really good, specially dumplings and string beans. Try out the eggplant dish as well. Not at all a fancy place but clean enough that the appearance will not kill your appetite. The best part is the price. If you want darn cheap good chinese food (but not your usual\nMSG loaded food with boring choices) definitely make a visit here. Friendly staff is an added advantage.", "author": "Kingshuk g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-18", "description": "This place on 6th & Clement has been here for years & years.  The food is always fresh & always tasty !!   Not at all expensive (cheap !!) & very friendly service.  Try the dumplings which are made from scratch in the window or my favorite Taiwan County Favorite Spare Ribs.  This is the real thing as you will notice from the croud of locals eating here.  If you enjoy Chinese food this is the best place on Clement Street. One can pay alot more in other fancy places around San Francisco for Chinese cuisine but it won't be better.", "author": "mike d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-28", "description": "Probably the most inaccurate \"Taiwanese\" food that I have ever had. In addition to being terrible food, with no flavor or discernible difference from any other indiscriminate Chinese takeout restaurant, I have never seem more than 2 tables worth of people there, one of which is usually all the restaurant staff.", "author": "Shaina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-23", "description": "OMG you guys, they totally have the cutest dish EVER!!!  Little rice UFO's with pork and cabbage.  For reals!", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "The #1 reason why I love it here is because they serve hot soy bean milk with chinese doughnut on a weekday!  Order the potstickers and remember to sweeten the soy milk with the sugar on the table.  Everything else is fairly decent.  Food is affordable, quick, and reliable.", "author": "Angie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-31", "description": "There's no better place on Clement to have warm soy milk and a fresh chinese donut. The homemade dumplings are delicious, cheap & man-size here-- you can watch the cook in the window stuffing endless baskets of them during your short wait to be seated. This is a mom and pop operation, so I don't expect great service.  The thick Shanghai pan fried noodles are satisfying. I went here last week, and was amazed that their prices were still low and their portions huge.  If you don't mind being left alone to enjoy a big pile of food, then come here.", "author": "Miz J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "i don't come here too often, but the dishes are always good when i do.  the waitress that took our order was very nice.  we ordered the green onion pancake, siu loong bow, hot and sour soup, and shanghai style chowmein.  everything was very tasty and my tastebuds were having a blast.  they also have yummy chinese donut and hot soymilk.\n\nwhat i also like about this place is that you can see some of the guys making the chinese donuts in the front window.  it's fun to watch them if you're waiting for a table.", "author": "Lauren Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-26", "description": "Come here for the lunch. Double cooked pork EXTRA spicy. $4.25. Happy.", "author": "k w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-19", "description": "If you are in the mood for traditional Taiwanese breakfast - fresh deep fried bread with homemade warm soy milk...this is the place to go ..This is also another great place for dumpling!  My favorites are the onion pancakes and wonton soup....The noodle dishes are also very hearty.  One downside - parking...nearly impossible.  Wait for a table can be longer on weekends...", "author": "Peter W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-01", "description": "ive eaten here quite a few times.  my buddy loves it here and everytime we meet up he wants to come here.  i dont have the heart to tell him its not as good as he remembers it to be.  but i think last night he may have realized that.\n\nthe service is pretty good.  theyre really eager to serve you.  tea right when you sit down etc.  maybe because there arent that many people there.  but i almost feel bad saying something bad about it because they look like such nice people.\n\nthe food is really mediocre.  i usually order the bean thread noodles with fish balls and everytime i get it i finish it because i dont want to waste it not because its good.  the noodles break and have no elasticity.  theyre stale or something i cant tell what it is exactly.  last night i had the bean thread, or silver noodles, stir friend instead to see if they were better that way.  but still stale.  i didnt even bother finishing it.  ive ordered pork and tofu and also mixed vegetables here before too.  the tofu dish being way too oily and the vegetables being way too soft and covered with too much of the water and corn starch mixture.\n\nmy friends usually order the noodles with beef or pork.  they slurp all of it up.  but i think its because they are dudes and eat everything.", "author": "claudia y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-22", "description": "The dumplings are pretty good. They hand make them in the window! Also, I love the fried breads. Dip them in soy milk! I also like the tofu salad, and the shanghai noodles.", "author": "Bub B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-08", "description": "Solid Chinese food for Chinese people. Had the beef noodle soup and it tasted almost like the soup in Taipei. Great dry fried string beans and dumplings as well. Huge portions, not overly salty and CHEAP!\n\nThey need to clean up the interior. Pink bare walls and dirty floors. \n\nAmbience *(*** for a Chinese restaurant)\nFood *****\nValue *****", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-29", "description": "I've eaten here twice now, and I feel both times were just so-so. We went with a big group so we ordered a variety of dishes, and none of them really stood out. I'm not Taiwanese, but a few in my group were and they thought the dishes were just so-so as well. The servers were friendly, but not very respectful. A server ran right into my back as I was drinking hot tea and almost burnt my tongue off, and I continued to get bumped over and over again at which point I consciously started dodging the servers.  I should probably take off another star for this, but I'm no drama queen.  Besides, it gave my friends a good laugh.  This place may receive 3 stars anywhere else, but not in this part of San Francisco where Chinese is everywhere.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "This a classic staple of the City.  Cheap, consistent, delicious.  Been going there for over 10 years and I love taking east coasters here who have no idea what Asian food is supposed to taste like.  No other reviewers seem to mention the steamed dumplings (pork and chicken) that is the SIGNATURE of this place.  Those dudes in the window do nothing  but fire off dumplings all day.  That's what you must get at Taiwan.  The crispy spare ribs are off the hook too.  Totally unique.  \n\nYou can't go wrong here.  Just don't go for the decor.  Enjoy!", "author": "Peter J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "heck yea!\n\nthe only problem with this place is that i don't know what to order. and it's very pink.\n\nthe food was great, the bill was cheap, and the service was not your typical crappy asian service (not that they were super nice or anything).\n\ni can't recall everything we ate, but i do recall that i loved each dish.  we had some fat noodles, potstickers, beef noodle soup, etc...\n\np.s. it was also clean :)", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-03", "description": "This is my favorite chinese restaurant................love the dim sum, the noodles and the mongolian beef is amazing..........", "author": "Dena S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-10", "description": "Oh what???  Flies!  Those pesky flies really got on my nerves.  The whole time, my friend and I were swatting flies.  Furthermore, the way they describe their food is totally different from what we actually got.  My friend inquired about their green onion pancake (normally pan fried) and what we got was deep fried batter with specks of green (which i'm assuming is the green onion) and my black bean noodles came no where close to what black bean noodles are suppose to be...I'd only go back for their jook (porridge).", "author": "Julie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "Went here with a group of like 12 for dinner. They have a huge array of items to choose from. The food is affordable as well as tasty..9.1/10 tasty.", "author": "Prescott T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-05", "description": "so the other day i was run down with a cold and knew that the only perfect comfort food that would hit the spot and nourish me right were chinese steamed veggie + meat buns (cai rou bao). \n\ncai rou bao from shan dong in oakland's chinatown, to be exact.\n\nhowever, shan dong is closed on mondays.\n\nso, the hunt was on for the perfect-as-can-be cai rou bao. \ni searched left and right, used all of my online research prowess, but to no avail. not even the folks on chowhound could help.\n\nwhich led me back to the same question that often haunts me: why is san francisco barren of quality chinese food? what the hell does it take to get some downhome northern china lovin' around here?!!!\n\nfinally, i decided to give taiwan restaurant a try. i knew they had buns and made killer stuff out of dough, but was unsure of the regional stylings of their cai rou bao. \n\nwell, after biting into the steamed bun, i must admit i was pleasantly surprised. the filling was a lovely, simple blend of ground meat, napa cabbage, clear noodles, mushrooms, and herbs. not bad at all!!\n\nthe dough was slightly sweet, but fluffy enough and contrasted well with the savory innards.\n\nnow i know where to get cai rou bao when i can't get them from shan dong.", "author": "jennifer y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-25", "description": "I decided to go here after reading a glowing review in the SF Examiner. We ordered what that the reviewer recommended, such as the hot boiled dumplings with porkand cabbage and the fried oysters. Well, the fried oysters were good, but nothing outstanding. They lacked that creamy ocean goo in the middle. The fried pork chop noodle soup was kind of bland, and the pork chop was too gristly for me. The boiled dumplings were nothing special.. just your average dumpling. I would not go here again.. also, the leftovers smell kind of funny in our fridge.", "author": "O K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-07", "description": "The various dumplings are tasty and fairly inexpensive, but the beef chow fun was mediocre at best. I'll give this place another chance based on it's reputation, but I was fairly unimpressed with my first visit.", "author": "Ziad E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-10", "description": "from the outside and the inside, this place will not wow you with its decor.  but, i come here for the food, not the ambiance. \n\nnow, if you're expecting non-greasy chinese food, you are SOL at 95% of chinese restaurants out there. this also depends largely on what you order, however. everything i've had here has never been overly oily or greasy, and i've liked all the items. a sample of dishes i've had recently:\n\n- bean and meat sauce noodles :\ngreat; my favorite dish here so far. Taiwan Restaurant does this dish VERY well, the best zha jiang mien i've had outside of Taiwan. this dish is also HUGE, as are all portions at this restaurant (this dish served me for 3 meals). the noodles were also excellent, chewy and fresh. \n\n- chinese doughnuts & hot soy milk:\ngood, not great (like all yiu tiao, too oily to be eaten often); the yiu tiao are very good, more doughy than normal, though i like that, and still retaining that crispy exterior; super fresh (i first walked in here b/c i saw the guys making them fresh in the window), and huge. the soy milk was ok; fresh, though you add your own sugar or salt to taste. i prefer when they add the flavoring, since the sugar incorporates better and faster. \n\n- pork dumplings:\nsolidly good; extremely fresh---they make them to order i believe (as in stuffing, wrapping, and steaming per order), and are ginormously stuffed to near-bursting. the skins are thicker than i like, but they're still very good. like eating mini pork&veggie buns. \n\n- pork chop fried rice:\nreally good; though, they don't include the stewed egg or ground pork stew here.  the pork chop is great (crisp, but juicy and tender, with a sweetish seasoning). also includes the requisite chopped mustard greens and my favorite, sour pickled veggies (i love these so much i wanted to ask for more on the side). \n\n- mustard greens & shredded pork noodle soup:\ngood; esp nice on a cold night. the broth is light but substantial, very clear flavors. noodles in this were great as well (i think they make anything using dough fresh in-house, there's just no accounting for that taste and texture).\n\nthis is a great place for inexpensive, tasty, fresh taiwanese food w/super generous portions. the service is decent, they're actually friendlier and more helpful than many chinese joints--- if you get the older waitresses (the younger ones, i think the kids of the owner? not so much. not that they're incompetent, just not as attentive and quick). those older ladies know what they're about. \n\ni only wish that (1) this place was closer to me (though SF is better than going to SJ, and waaay closer than LA), and (2) they would include tzo dofu and fan tuan on the menu here", "author": "L C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-17", "description": "I eat here almost weekly for take-out so I am jaded but consistent.\n\nFood is always good, clean, good serving size, hot, and fresh.\n\nSome of our favorite - wan-ton soup, steamed chicken dumplings, snow peas + water chestnut + mushrooms, Mongolian beef, noodle with peanut sauce, \\crispy spare ribs.", "author": "david s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-08", "description": "Very \"home cooked meal\" feel.  Not sure I want to know how they make the \"country chicken\", but it is tasty.  The staff are friendly.  A good neighborhood haunt.", "author": "Cristin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-18", "description": "I love this place. Truly what I would call comfort food. Regardless what mood I'm in, I've never turned down the idea of going there!", "author": "Annabel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-19", "description": "I like their pork chop noodle soup!  I always order that dish.  I also like \"fish flavor chiken\".  They have taiwanese dishes and they are also good. I usually don't order those, though...  Their pot stickers are good.  Surprisingly all of their food servers were very nice.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-24", "description": "I love this place, I've been coming here since I was a kid. They have the best \"dan dan mien\" that I've ever tasted. and these dumplings called \"xiao lung bao\" (sorry don't know the english name), and they're awesome too. You can't really go wrong with whatever you order. And a major plus to this place, is it's dirt cheap and the portions are ginormous!!!", "author": "Lynette R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "I'm so glad I found this place!  They have the real authentic Taiwanese food and I just love going there on the weekends!  The restaurant is not very big but you can still do walk-ins if you go early.", "author": "JenJen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "Maybe I didn't order the right things, maybe it was the fact that i just about fought my four year old niece for the last prawn out of the chow mien only for me to let her win, her eat and then regurgitate it because she \"didn't liiiiike it\" but I rate Taiwan a mediocre experience and food. However while writing this, I did upgrade from two stars to three stars because after recalling the leftover chow mien and sweet and sour chicken (I know, truly unadventurous, keep in mind we had a four year old with us) the leftovers were noteworthy! Maybe it was the lack of four year old company that made the second meal, out of red and white boxes, just that much more enjoyable.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-22", "description": "Great food, good prices, really no complaints - it's not amazing or mind-blowing, but definitely a good standby. I always get the garlic string beans and taiwanese special spareribs when I come here - soo good. As others have mentioned the place is clean which is great.", "author": "Sung P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "My family really likes this place...I think it's all right. It's not the best food but it's nowhere near the worst. Prices are decent and the broths for the soups are good but, other than that, it's just chinese food.", "author": "Tiff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "The main thing that sticks in my mind about this place is that the sweet soy milk is absolutely delicious.  Perfect for dipping donuts at breakfast-- so refreshing!", "author": "Hallie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "This place is pretty good AND cheap. I love the dumplings, and I always order the thick noodles (not sure the exact name, but it seriously makes me laugh when I have to order them). They are really good. I think they have beef, chicken, and shrimp in one delicious noodle dish. I usually go with a group and its usually $15 per person max. I've never had to wait to be seated either.", "author": "Jennie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-15", "description": "This place hasn't really been the same since the change of ownership about 2 years ago.  But I still love it.  I been coming here since when I was a toddler.  They have the best Chinese donuts, and their potstickers are all homemade in the display window.  You gotta have the General Tsuo's Chicken, Spicy Shrimp, and green onion pancake.  The hot and sour soup is pretty good too.", "author": "Alan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "My favorite Chinese food in the city.  Try: Won Ton Soup, pot stickers, Taiwanese Country Fried Spare ribs.  The vegetables are cooked al dente so it is not a vegetable mush.", "author": "Liz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-09", "description": "I'm not quite as well versed in Chinese cuisine as Bruce down there, but I know good General Tso chicken and this place has it. I've been frequenting Taiwan Restaurant for almost 12 years now and my worst complaint is inconsistency. Friday night might bring big juicy cuts of battered and fried chicken pieces covered in thick, glistening sauce while Tuesday afternoon may bring non-battered scraps in something more watered down. The dumplings and doughnuts are good everyday and who can beat lunch for two for under 15 bucks. All menu items featured on the walls seem to be the bread and butter. The wait staff can be curt but my meal is always promptly served and the takeout flexibility is clutch. Give it a second chance.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "I  would have to say that Taiwan Restaurant is  my favorite Chinese/Taiwanese lunch place.  They provide great service and great food, especially their dumplings and noodles soups - always fresh and hot. Every time I go there, it brings back memories of when I lived in Taiwan.  I love the fact that I can eat the food that I grew up with right here on Clement Street.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "this place was a godsend during my vegetarian year. tons of meat-free selection. best comfort food ever; makes me wish i were chinese so maybe my grandmother would know how to cook this deliciousness at home. always seems to be filled with large families and their adorable little kids who run around the restaurant like monkeys. i don't mind at all. i've been considering going into elementary education and eating here feels like training.", "author": "Jane P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-23", "description": "It had been a restaurant I liked to go until most recently when I ordered \"Jiao Zi\" - hand made dumplings. The came out with skin all broken therefore they were soggy. I complaint to the waitress. She said: \"We froze them therefore they are like this. There is no way that they aren't broken. \" I said :\"but they don't taste good.\" She walked away saying;\"we can't go nothing.\" Thanks for reading...I am just sharing...", "author": "Vat S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "i'm chinese, parents grew up in taiwan...i've been a few times...maybe i'm out of practice at being chinese...but the menu at taiwan restaurant completely overwhelmed me.  i had no idea what to order...and just started pointing at other people's tables and saying \"give me that!\"  the waitress didn't seem to mind, though...so, this place is cool with me!  i need to come back with my mom so she can do the ordering for me.", "author": "Tabatha Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-01", "description": "OK, so it's not the fanciest, cleanest, trendiest restaurant in The City, or even on Clement street for that matter. But it's also NOT the most expensive, blandest, unimaginative Chinese food in the area. Pretty much every other table will have the shredded pork with mustard greens noodle soup and the braised green beans, and yours should too. The prices are incredibly cheap for the quality of the food. Service is good to very good, but no frills of course. Not 5 stars because some dishes can vary from visit to visit.", "author": "Brian O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-29", "description": "Taiwan Restaurant is one of the best food bargains in San Francisco, bar none. A tasty and generous meal for two can be had for well under $15. Fill up on dumplings, because they're the real standout here, along with everything else made in tiny front kitchen that looks out on this international stretch of Clement Street. Standouts include delicate boiled shrimp and leek dumplings and picture-perfect kuo teh. Steamed pork buns are enormous and contain a portion of savory ground pork, not the sticky-sweet BBQ pork to which one is accustomed. Red cooked eggplant and dry braised green beans make for delicious side dishes, and the General Tso's chicken is a unique take on the dish, but far and away my favorite. The bright pink bi-level room is bizarrely dramatic but ultimately charmless. If you can get here for lunch, lunch combinations are less than $5 and include soup, your choice of entree, rice, and orange slices for dessert.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-20", "description": "I always order the same two things from the menu (onion pancakes and what i refer to as: rice noodle saucers) and get them to go. This time though, I ate at the restaurant. I wasn't paying attention when our friend was ordering so I don't know the names of the dishes that were ordered. I do know that the tofu dish and the noodle soups were not very impressive. The string beans were actually pretty good, but let's face it. No matter how good they are, veggies can never make up for the rest of the meal. The onion pancakes appetizer was definitely the favorite.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-28", "description": "I'm not Chinese, Taiwanese, or any other \"ese\".......  I'm a white dude who likes to eat.  I do not particularly enjoy Panda Express or any Chinese combo meal featuring egg rolls, fried shrimp and sweet and sour soup.  If you are a fan of either of these things, then Taiwan Restaurant may not be for you.  What I do enjoy is the wonderful flavors and generous portions that I receive.  A few favorites are the lamb with onions and the green beans with meat.  They have dim sum items as well, but I usually stick to the entrees at Taiwan restaurant and grab some take-out dim sum down the street at Wing Lee.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-03", "description": "Today, I took my parents here for lunch as this is my ultimate test for any Chinese restaurant. We had soy milk, potstickers, Chinese donuts, and beef tendon noodle soup. Everything was very tasty. The best thing was that there wasn't a single complaint from my parents which meant the food was pretty authentic. The place was clean compared to other Chinese restaurants. I can't wait to go back and try more.", "author": "Chanli S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "This menu looked promising, with lots of items I hadn't seen before; however, the experience was very disappointing.  I hate to waste food, but no one at our table took more than the initial taste of the sauteed baby squid, and we certainly weren't going to take the rest home: it was neither fresh nor freshly cooked, just old and hard.  The dumplings were freshly made, but like everything else, bland.", "author": "Sumomo O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-14", "description": "just hook me up with an order (or two) of the xiao long bao and the green onion pancake and i'm good.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-27", "description": "The dumplings... one look when they got to the table and I knew the skins were too thick.  The filling was... meh.  Had the steamed pork dumplings (xiao long bao) and there was more cabbage than pork.  Also had the veggie ones as well, too much pickled mustard greens and not too much else in them.  Had the beef tendon noodle soup which was good, the tendon was very tender.", "author": "win c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-14", "description": "i'm not a huge fan of chinese food but my friends and i came here on saturday evening, armed with boba drinks from up the street. s was starved so we got a lot of food. a lot. and it was still only $50 somethng! that was a meal for 4 people plus leftovers. i had the velvet chicken which was pretty tasty. the general chao (sp?) chicken was good too... some beef thing ok, and the potstickers, eggrolls, lo mein, hot and sour soup,... but my very favorite was the pork buns. they were stuffed with meat and so filling and tasty. next time if i ever went again id get a full order of just those! good customer service, a guy even came back to check about sesame allergies since we were allergic to peanuts. none of us loved the potstickers actually.  and s was eh on the beef and noodles. but overall a pretty good chinese food place. nothing really special.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-18", "description": "Some of the Taiwanese dishes here hardly resemble the real stuff.  The bigger problem is they don't even taste too good.  I am not one to say everything has to be \"authentic\" as long as it's tasty. I welcome innovation or improvements over the original dishes; if you can't even come up with something that taste remotely like what it should be, you should not be making it.", "author": "Steve C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-03-08", "description": "soymilk, sweet & savory. the savory soymilk doesn't come curdling (i.e., thicknening into a loose tofu-like mixture) like it's supposed to be - so if you want it how it's supposed to be, you'll have to add a few drops of vinegar and it'll be curdling in no time. drop in some youtiao (fried dough) to suck it all up.", "author": "Lijia X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-14", "description": "one of my favorite chinese restaurants in the city--the crispy prawns here are mind blowing. also worthy of consideration are the green beans (with minced pork), hot and sour soup, and general's chicken. oh, the szechuan beef is top notch.", "author": "dusty d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-31", "description": "since the change of ownership, the food from the kitchen has been so salty. good thing they kept the dim sum chef in the front. only thing I still like are the potstickers, soy milk, and deep fry goodies at the window.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-09", "description": "ate here tonight and was happy with the great prices and decent food.  you definitely have to try the onion pancakes.  i can make this a taiwanese girl's regular outing from now on.  and i got great, fast, efficient service.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "Craving freshly made dumplings?  Authentic chinese/taiwanese eats?  Look no further!  These are the best dumplings I've had since I left the PRC.  Never been to Taiwan but eating Taiwan's food makes me want to make it my next foodie destination.  Think: Shanghai style dumplings with the succulent pork with the perfect melt in your mouth pocket of juices and not to thick not too thin outside texture.   Finding a good source for these is like uhm...finding parking on Clement on a Friday night.  I think they call these dumplings just plain pork steam dumplings on the menu.  The mustard greens pork noodles are great as well as the special taiwan pork spare ribs.  The take out service is great too.  They pack it well enough to preserve your car from sauce spills.  Be sure to ask for the vinegar sauce for your dumplings.  While you're waiting for your food check out the cool fish pet store next door.", "author": "Ann F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "Very good , cheap, yummy potstickers, green bean and hot and sour. Not the cleanest wall or greatest ambiance, but who cares.", "author": "B D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-20", "description": "We've always walked pass this place and have always wondered if their food was authentic Taiwan flavor. Finally decided to try it a couple of weeks ago. Love the crispy ribs and won ton soup. Authentic Taiwan taste for the crispy ribs. I recommend this place if you want chinese food that's different from the usual chinese flavor.", "author": "J C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-25", "description": "I just got back from a hike in Mt. Tam and wanted some warm soup and Wor Won Ton Soup sounded so good.  Problem is that I hadn't found a good Chinese restaurant since I've moved here almost 3 years ago!?!  I was always worried about picking a wrong restaurant, but I turned to Yelp and found this place.  I called in for Take-Out and ordered the shrimp chow mein, dry braised green beans, lemon chicken and rice.  He said it would be ready in 10 min.  I left the house immediately, especially since finding parking is nearly impossible on Clement.  My BF found a spot out in front, and the food wasn't ready yet.  The food was ready in about 15 min (not 10 min), but it was worth the weight.  The soup was so good and authentic. It had 2 shrimps in it.  The chow mein was good and had 5 shrimps, but were big pieces.  The beans were good, too.  The rice was dry, and the lemon chicken was so-so.  I'd go back and order the soup again and the beans.  I finally found a good and reliable Chinese place!  P.S.  Check the cartons when you look in the bag, most of it had opened when I got home, and my BF spilled the green beans on the table.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-16", "description": "won ton soup -- good\nmu shi pork --- terrible\nsteamed dumplings (beef) -- ok\nfried spring rolls -- ok\n\nservice -- good\n\nwe didn't eat all of the food and refused to take it home -- bad sign.", "author": "M F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-21", "description": "Cheap, good, friendly, clean, AND not too greasy.  Taiwanese food is great. Looooove the steamed chicken dumplings.  And the noodles, get the noodles. You can see the chefs making the dough as you come in too.  I could eat here for a while and not get tired of it, which I can't say the same for a lot of chinese restaurants.", "author": "Priscilla P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-19", "description": "let me start by saying this food is very good and not that expensive. i loooove the food at this restaurant and have taken all my friends and family here. i would have to say that they are one of the best restraurants on clement...until now...\n\n\nThe restraunt food is unfortunately not that clean.  one day a friend and i went to this restraunt for dinner. expecting to receive our favorite taiwan dishes steaming hot, we noticed, after taking a few bites, that the food had a piece of hair in it! we pointed it out to the waitress, a very nice and understanding lady, who quickly rushed the dish to the kitchen and demanded a new one to be delivered to us. as she apologized and brought forth the new dish,  we began to eat it again.as i was tasting and chewing on the food she brought forth i noticed a sponge-like felling in my mouth. i didnt want to know what it was that i was feeling in my mouth because i knew if it was foreign to what was suppose to be in that dish, i would NEVER come back to this restraunt. i spat out the food, pulling from my plate a piece of steel wool-like sponge that they use for cleaning their woks and pans! \nvery very dissapointed, that my favorite taiwanese restraunt had such things like hair and steel wool in their food i got up and told the hostess/waitress to come to the table. i pointed it out to her and she had nothing to say. to conclude, she canceled the dish off our bill but unfortunately it left me with the imprint to never go back to this restraunt and to deem the restraunt dirty!\n\n\nbeware as the food is good but might have \"foreign\" disgusing stuff in the food!!!!!!!1111", "author": "alex a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-19", "description": "I recommend this place.  It's kind of a hole in the wall restaurant, but the value is there.  You can have a good meal feeding two or three with less than $20.  Don't forget the potstickers and the soy milk.  The soy milk is made fresh.  The shanghai noodles are good too.  The pork chop over rice is tasty too.  They deep fry the pork job.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "Good, solid, inexpensive Chinese food. Noisy, casual and family friendly.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-02", "description": "we just got out of this place an it was good.  according to my Taiwanese gf  the oyster pancake was not very authentic according to her albeit high standards.  my favorite food was the Taiwanese doughnut deep fried.  they serve it with your choice of salty or sweet soy milk.  i preferred to try the Sweet as the doughnut was really quite salty enough.  they served it bland which i thought was odd but easily remedied as i just added sugar and stirred.  that was my favorite item that we had today.  and i hadn't seen anything like that before anywhere else in San Fran.\nI tried the oyster pancake... not for me i must say.  there was a gelatinous layer of what appeared to be a cornstarch mixture that was a little to close to slime for my liking.  i also have a a little bit more than a strong aversion to anything fishy to cross my palate as this would serve as my breakfast.  i also had the Taiwanese country spare ribs which i thought were tasty however again according to my gf not up to true Taiwanese standard.  she felt they were more Chinese than Taiwanese but good nonetheless.  \nthe steamed pork dumpling was good and the sticky rice with pork on top was good.  notice a theme here?  had it not been my first meal of the day there were actually a lot of items on the menu that looked interesting to me for example the 5 spice tripe soup and other Taiwanese dishes that are A little off the beaten path for a white guy like me.  overall we all 4 stuffed ourselves for 26 bucks with tip.  you don't get more bang for he buck here in the city and i am actually looking forward to dinner one day.", "author": "Anthony Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-05", "description": "if you are around during the lunch hours this place is a steal. i love the dishes here.  pot stickers, broccoli beef and chicken are delicious.  you also get soup, orange for lunch for like $3.50 to 4 dollars.  nice hole in the wall.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "don't get the chinese donuts, they're hard and tough and not very good, but everything else was delicious, just takes a while.... the wait on the weekends... and they run out of certain things, like the daikon cakes... but still, very good", "author": "Janet P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "i have been going to this restaurant for many years now.  used to come here pretty often.  so much so that one of the chefs that makes the potstickers and shanghai dumplings would remember what we ordered each time and prepare our potstickers as soon as we sat down.  had a major craving for shanghai dumplings after i came back from my trip to china, so i thought i'd try to relive the memory of eating shanghai dumplings in shanghai by coming to taiwan restaurant.  i've never been disappointed by this restaurant before, but nothing compares to eating REAL shanghai dumplings in shanghai.  unfortunately, when i took a bite of my shanghai dumpling, it didn't bring me back to shanghai.  don't get me wrong, it was still good, but it just didn't compare to my experience in shanghai.  i guess i somehow was tainted by the experience of eating REAL shanghai dumplings and now nothing else will compare.  overall, taiwan is a good place to eat potstickers, their noodle dishes are tasty and cheap, and their lunch specials (that are only served during weekdays) are well worth the price.  some suggestions to try would be their mustard green and pork soup noodles, szechuan hot sauce noodles, pork chop noodle soup, bean and meat sauce noodle, potstickers (of course) and of course the shanghai dumplings.", "author": "Jeannie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "so, i've only been to this restaurant a couple of times...each time to pick up their fried doughnuts.  so, my comments are going to be conflicting because i don't think that this place has the best anything.  so, why go here more than once?  well, because my husband is always driving nearby...so more for convenience.  for those that like the potstickers, steamed dumplings (xiao long baos), soy bean milk, deep fried chinese doughnuts, go one block down towards Geary Boulevard.  Five Happiness Restaurant (near the corner of Geary and 6th avenue) serves all these authentic dishes, only it tastes WAY better!", "author": "Jenny Y."}
