{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Uji matcha boba and all things light! I ask them to go easy on the cheese foam, ice, and sweetness level. This combo has been the best craft boba drink that I crave time to time. The decor of the cafe is pretty cool. A huge art piece on the wall was interesting to look at. In addition, there are classic board games to play while you're sippin' away. \n\nThere isn't usually a long line whenever I'm here and I'm a bit confused as to why. This is a solid cafe  and I'm not sure why more people aren't giving it a try. Perhaps not that many people know about it? \n\nSome suggestions to management: sign up for grub hub, Uber eats, eat 24, Groupon, and advertise on IG or Facebook.", "author": "Briana H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-04", "description": "I love how the place has seating along with board games such as uno. The service was nice but I didn't enjoy the drinks as much as I expected. My friends recommended me to try the place out because they said it's one of the new boba places in San Francisco and they really enjoyed their drinks there.\n\nI am a big fan of Jasmine milk tea so I decided to try out their Jasmine green tea with boba. The Jasmine green tea had a really unique taste but I tasted more matcha than the jasmine. Although the menu stated that their Jasmine milk tea had a hint of matcha flavor, I was still expecting the drink to have more of a jasmine taste.\n\nOn the other hand, my friend I went with who also hasn't tried the place got the lychee black tea with boba. I had a few sips and it wasn't exactly the best drink I have tried overall. The drink tasted a little funny because it was more bitter than sweet. But the boba was sweet and chewy.", "author": "Joey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-30", "description": "With a million boba shops in SF, you'll find yourself bombarded with shops all over when you type in \"boba\" on yelp (or pmt or milk tea or god forbid bubble tea). So what makes Tancca special? Frankly I don't know either but it's good quality tea!\n\nAlso they do have some unique teas here like uji matcha. While not mindblowingly good, it's different. It's conveniently located so you can swing by here after a meal around the area. That's really it though, a good quality place that's conveniently located, serving up typical teas and the occasional unique flavor.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "San Francisco is a city that loves its boba. There's always new shops popping up, and honestly, I can't keep up with them.\n\nMy significant other and I stepped in on the way to a friend's house, and went for unusual orders. For $8, we got the raspberry tonic with black tea, popping yogurt, and basil seeds and the super grapefruit with boba.\n\nBoth were misses, unfortunately.  The tonic, between the ice, popping yogurt, and basil seeds, had too many floating bits inside to feel like a drink. Basil seeds aren't for everyone, and we weren't part of the crew that particularly enjoyed them after this. The super grapefruit is quite bitter. You really have to be a grapefruit lover to enjoy this, because it tastes more bitter than tart. The boba is pretty chewy, but hardens quickly in the slushy drinks. Not sure why those pairings are so popular, but they were pretty eh.\n\nI must've missed the real star of the show, the cheese foam, but I was really in the mood for something fruity and light and thought this place would do well from the other reviews. It's not that great of a place to work and enjoy a normal milk tea at, either, because it's so tiny and very warm inside.\n\nTancca, unfortunately, is not for me. While I believe they make high-quality tea, I think that they really need to work on their flavor pairings before they can earn a glowing review.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Once in a while, my friends will recommend me boba places that they have adored. These boba places are usually far out of reach for me as they require some traveling. However, the stars aligned last week and after a satisfying meal at K Elements, I knew I had to make my way over to Tancca.\n\nIt was highly recommended that I try jasmine milk tea with puff cream, but knowing that was going to be hella filling, I decided to pass and try their passionfruit green tea with 50% sugar and less ice. I was really impressed by the taste because when I usually order less sugar, it can be either really bland or still really sweet, but it was honestly, just perfect.\n\n If you have a chance, please support Tancca. They are not pretentious like the other boba chains and they serve quality tea with friendly service!", "author": "Eva L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Tancca-- like tank ya-- like thank ya? Anyway....\n\nAfter getting food coma from ingesting some heavy pizza, I was in search of some caffeine as a pick me up. Found just the spot at Tancca. I got the uji matcha with cream cheese, and had sips of the green apple tonic. Drinks were ready in ~5 minutes, and there are a number of tables to sit at (no games though). Service was friendly and knowledgeable. No line on Saturday at 7:30, but it began to fill up closer to 9pm. Cool mural at the back of the shop.\n\nThe uji matcha was decent on the matcha flavor, and likely used real matcha, but still felt a tad bit powdery. I would probably get it again though. I was torn between the puff cream and cheese cream. The lady at the counter explained that they were similar, except that the cheese cream was a bit more savory. The cheese cream comes with a complementary little shovel to scoop away at the cream. The cream had the density and texture of shaving cream, with the flavor of very light cream cheese with a pretty strong dose of salt. I didn't end up mixing the cream together with my drink, so it was like having two desserts in one cup! Boba was sweetened, but a bit firm for my tastes (though not hard in the middle). The cup size felt larger than average. 30% sweetness was true to sweetness (yay!). 3.75/5\n\nApple tonic was a bit more artificial (because apple drinks are not naturally green durr) but tasty and comparable to apple soda drinks, since this drink has a bit of carbonation. The yogurt popping boba and basil seeds added some good texture and fun to the drink. The intial gradation of green on the drink would be a good photo opp (yes I'm guilty too). 3.5/5", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Great boba place with cream/foam!\n\nWe got here around 1pm on Monday. There were two people ahead of us. I got uji matcha with cream cheese foam and boba 0%sweet and my friend got assam milk tea with tiramisu foam and boba 50% sweet! It was $10.50 for both. I LOVE cream cheese foam!! It does taste like cream cheese but salty which went well with my Uji matcha tea! It reminded me of 85degree bakery's sea salt cream but much better! It was my first visit and it's my favorite boba place now! \n\nHighly recommend this place!!", "author": "Clare L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "I really like this place. Price is not too bad and the boba is the perfect soft chewiness that I'm looking for in boba. \n\nI tried the uji matcha with the puff cream (whipped cream texture with egg custard) that goes inside of towards the bottom of your drink and that was ok. I prefer the cheese foam near the top instead. My other favorite drink here is the A2 Royal Ceylon milk tea with the tiramisu cream top. It's sweet and you can still taste the notes of tea in the drink. Enjoy with your small shovel.\n\nThere's seating inside and a games like uno and Jenga if you want to hang out. Metered street parking.", "author": "Lindsay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Ahhhh this place was phenomenal!!!! I love boba drinks with the cheese milk foam and this place makes it really good. I think I was eating in either the sunset or richmond area so i stopped by here to grab boba afterward. Tancca is on a main street so if you are coming during a busy time, parking may be hard to find, you may have to park at nearby side streets and walk a few blocks, but that's to be expected in sf right? haha. I came at a not so busy time but still had to park a block away or so. \n\nThe inside is a bit small (like all boba shops, so not really a bad thing), but their interior design is really cute and the workers are also really nice. We sat in there to hang out for a little bit and then off we went. \n\nPLSSS get the cheese milk foam if you have not tried it. Don't be deterred away by the fact that they are calling it cheese ;) It's really more like a cream cheese taste. But they have puff cream and tiramisu foams too, which other boba shops don't have! So if you are picking just one boba place in sf to try, i highly recommend this one.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Almost don't want to write this review because everyone else will know about this place. If you know me well, then you know how much I love boba and trying new places out. This place has been my top boba place lately. I still love boba guys but sometimes when I'm not heading in that general direction I don't bother going but tancca is so close to my house that I'm constantly craving it. \n\nI absolutely love their uji matcha / matcha latte with puff cream or cheese foam is absolutely amazing! It's the perfect amount of matcha flavor and the foams go so well with it. The foams are perfectly salty and creamy, love the little shovel it comes with! The puffcream is a sweet and custard foam that's really great with the matcha or milk teas!\n\nThe white grape milk tea is also really great as well! The grape flavor really comes through and there's a really good tea flavor as well! The puff cream makes it slightly sweet and it's just amazing! I haven't tried the other flavors but from what I have tried so far, all the drinks have been delicious!", "author": "Stella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I loved their matcha with milk foam! They give you a little shovel to eat your foam with. The interior is cute with nice paintings and music. Their boba is of good consistency too! I'll definitely be back!", "author": "Robby T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "Lots of boba places have fallen into the matcha craze and some sort of variation of cream/foam topping so it's nice when a place actually delivers good results. \n\nThe uji matcha met my standards - not grainy, not too bitter, and it doesn't taste like something artificial (aka matcha-flavored vs actual matcha). They did very well with adjusting sweetness as I asked for 30% and tasted my sister's 70% uji matcha as a reference. The puff cream topping was not bad. It wasn't too heavy and complemented the matcha but tbh, I could probably do without it. It did make the drink look cool though.\n\nThe service was quick and efficient. We didn't have many questions so there wasn't much interaction but it's always nice when you can go in and out of a boba place even with a little line. I would definitely come back if I was in the area to try some of their other drink/topping combinations!", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "I was craving boba in the Richmond District, and Tancca popped up. After trying the uji matcha drink with puff cream and boba, I don't think I'd return.\n\nSetting: stuffy and lacks adequate ventilation (it was a hot day). There are a few bar stools and seats available.\n\nDrinks: they have a large menu board with starred favorites. Ice and sweetness are customizable, which is a plus.\n\nI tried the uji matcha with puff cream and boba. The total came out to be around $5. The cashier described puff cream as a sweet cream placed on the bottom of the drink. She advised not to stir for better taste. \n\nOverall, it was an ok drink, and SF has better places. I'm not excited to come back.", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Great little boba shop! Got the matcha with added cheese milk foam!  Feel like it'd go well with boba too but passed on it this time because I was so full from lunch but I would love to try their other foam options next time!\n\nI've been in love with matcha drinks lately especially from my favorite place in Japantown but this one was still pretty satisfying! Would come back if I'm in the area! Wish they had more locations!", "author": "Holly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-17", "description": "Came here yesterday after corgicon and it was alright, to be honest. The place itself is pretty small, only three to four tables with chairs inside. There were two workers and they were both really nice and friendly! \n\nI ordered their uji matcha with milk foam and my friend ordered their thai milk tea. Their uji matcha was good at first, but it tasted really powdery, like the matcha wasn't mixed well or something. Not much to really say about this place..  it does remind me of this other place in socal called tancha (I think?). Tancha also has uji matcha, but I probably prefer theirs more than here... Parking is also a big issue, but that's like most places in san francisco.", "author": "Rosamond H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Good boba. Quiet. Can sit here and do work.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Their matcha latte with puff cream with tapioca is heavenly \n\nTheir uji matcha (slightly heavier than matcha latte) with cheese milk foam is yummy too\n\n20oz cup and drinks begin at $3.25 to $3.50 but extras like puff cream and cheese milk foam is $1 extra and it's so worth it\n\nI'm so stinking in love with this place\n\nBabygirl and homies like their snowy mango and snowy oreo so I'll recommend those too also!", "author": "Yeanne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Tancca is a unique bubble tea cafe that serves your regular milk tea drinks, special teas (like Assam & Uji Matcha), and optional add-ons (like puff cream and tiramisu milk foams). I usually come here when I crave specialized teas and my favorite add-on - the puff cream. It's like the cheese milk foam except that it doesn't float on top, but rather mixed into the tea. The puff cream tastes like a salty egg custard and it goes really well with any tea.\n\nMy favorite drink to order is the Uji Matcha with puff cream in 30% sugar. It's a rich matcha tea that heavily flavors and sweetens the drink through the tasty puff cream. I've also tried the Assam Milk Tea, which was good, but not memorable for me.\n\nService is good - no waiting time and fast production. Tancca has tables and boardgames, which is perfect for chill hang-outs or doing work. There's also metered and street parking available in front and around the area. Recommend checking this place out!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-09", "description": "I came here on a rainy Friday because I was craving some boba. I'm not too fond of trying new boba places because most of the time, they end up disappointing me. But I felt a little adventurous this day. \n\nI ordered the Jasmine green milk tea + boba, and I was thoroughly disappointed.... it made me regret trying a new boba place :'( The boba was good, but the milk tea was WAY too milky. I couldn't even taste the tea! \n\nI don't recommend their milk tea drinks! I whole heartedly endorse i-tea and Wonderful for milk tea / any other drinks.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "As a Fluffy Head Cafe and Happy Lemon fan, I give this place my stamp of approval! \n\nMy favorite creama drink of all time is the Camouflage from FHC and Matcha Salted Cheese from HL. They serve drinks here that come pretty close to both! \n\nDRINKS: \nThey serve a variety of tea, milk teas, fruity drinks like your typical milk tea shop, but where this place stands out, is their added option for creams/foams for an additional cost. I recommend the puffcream for milk tea drinks! I tried: \n+ matcha latte 50% sweet with puffcream - tasted pretty close to the Camouflage. It didn't taste watery like some places and the puffcream compliments the milk tea really well and adds a smooth texture. \n+ Jasmine milk tea w/ puffcream: their jasmine tea was really strong and fragrant! Loved it! \n\nSERVICE: \nFriendly staff that works efficiently. The also have a bathroom which you'll have to ask for a key. \n\nAMBIANCE: \nPretty small space. They have about 2-3 tables and wall seats. More of a grab and go place!", "author": "Samantha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "The drinks here are just okay. The interior is a little worn down so it's not the best place to hangout with friends.", "author": "Kaylee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "The Uji Matcha with Cheese Foam Milk Tea is sublime! The Cheese Foam is much thicker than typical sea salt cream or Happy Lemon cheese cream. They give you a cute little shovel to eat the cheese foam with and it goes quite well with the Uji Matcha. The Uji Matcha was strong in the green tea flavor, just how I like it!", "author": "Ngoc My H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Since this new cheese mousse phase hit, I've tried it at multiple places and most times I've found myself preferring the normal sea salt creama instead. No matter where I went and how much they hyped up the cream cheese undertone, I could never really pick it up.\n\n...however, Tancca really changed the game in my opinion.\n\nTheir cheese mousse is incredibly thick and they serve it with the cutest little shovel on the side! There is definitely no way you can miss the cheese flavor here in my opinion. I scooped up every last bit of it cause I thought it was that good!\n\nThat being said, I felt like where the cheese mousse really shined, the tea under was a little tepid for a roasted oolong. Regardless, it was still a refreshing drink for a warm afternoon.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Got the uji latte and lychee black tea with 50% sugar which was perfect. Hard to come across such reasonably priced boba in SF :) Definitely recommend", "author": "Anju J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "Came in around opening time, so wasn't busy at all. I browsed yelp before coming to see what was popular so I was ready to order. I had the Assam milk tea with the puff cream 75% sweet with boba. It was delicious! The cream made the drink a bit too sweet, but that's my fault because I ordered it that way. Next time I come, I know the better choice would be to cut the sweetener if I get a foam/cream. Definitely would love to try the other options of foam as well. \n\nThe girl at the counter was very friendly and made my order fairly quick.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "Was in the neighborhood helping my wife and mother-in-law.  Had a thirst for Cheese Foam Milk Tea and by chance there was a tea joint on the next box.  Told the wife that I was heading down the block for some Cheese Foam.\n\nSounds weird huh?  Well, think of a buttery tea or better yet think of Universal Studios' Harry Potterland \"Butter Beer\" for the slight buttery, cheesy tea taste.\n\nThe place was modern and next to a Lou's Sandwich Shop, so you can get a wich' and a cheesy tea on one trip.  Ordered a: 1) Jasmine Green Milk Tea with Cheese Milkfoam, and Grass Jelly, and 2) White Peach Oolong Milk Tea with Cheese Milkfoam, and Lychee Jelly.  Both at 50% Ice and 50% Sweetness.  Yes, sounds like a job for a bartender.. tearista.\n\nPleasantly surprised as there was almost 3/4 inch of cheese foam on top of each drink sprinkled with matcha.  Also a good serving of Grass Jelly and Lychee Jelly.  The tearista rocks.\n\nCool mural also.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Everyone's going to be talking about the Matcha drinks that they have here, but I simply loved their Roasted Oolong Milk Tea. It was my first time having it where 50% sweet wasn't overly sweet, but just perfect. You were still able to get hints of the actual tea without the sugar overwhelming the flavor. I didn't expect to like it so much because Tancca was just a random spot my friends and I found on Yelp, and we just wanted something that wasn't going to take forever to get (i.e. Boba Guys). Overall, great drinks and would highly recommend.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "First timer. My friend and I decided to stop by here while we were in the area. Parking in the city is usually a pain however, we were lucky enough to find parking around the corner from this place. This location is pretty small but we didn't plan on sitting there. When we walked up to the cashier (no line, yaya!), we were greeted by a friendly employee who gave us a few minutes to decide on what we wanted. After a few minutes, we were ready to order. I ended up ordering the earl grey milk tea with puff creme and my friend ended up getting the earl grey with milk foam and grass jelly. \n\nIt didn't take too long for our drinks to come out. My drink was really good and the puff creme was delicious. My friend liked hers a lot too; they also gave her a little shovel spoon for her drink. Overall, both our drinks were delicious and they were fast, friendly, and efficient. This location is right on Geary and it was definitely worth the try. I'll be back again, for sure!", "author": "Misty T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Came here and got the jasmine matcha with cheese cream. The cream could've been a little more savory I thought. The tea tasted like jasmine, but didn't have a lot of tea flavor. Perhaps it's why they add matcha to it.\n\nThing that was nice is if you don't get any toppings it's pretty cheap, comes out to be only 3 bucks.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Love their milk tea especially their matcha drinks. \n\nMy friends and I came to SF just to try Tancca milk tea. I ordered the Jasmine Milk Tea with a hint of matcha tea and 75% sugar level. I must say the drink was very good. I love how the tea was strong and I could still taste a hint of matcha. My friends ordered the Uji Matcha Milk Tea and they love it as well. We haven't try their other milk tea drinks but for sure we will come back again when we are in SF. \n\nService was good! Also, its a small and friendly place to hang out with your friends. They have board games too! \n\nHighly recommend - Jasmine Milk Tea and Uji Matcha Matcha Milk Tea!", "author": "L H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "I got the Thai Milk Tea with boba and puffcream. I would have gotten a milk foam so  I could get the cute little shovel. Anyways, this is definitely a neat spin on your drinks. They have so many different toppings. You can even chose your sugar and ice levels. \n\nThe lady was nice enough to give me a shovel even tho my stuff is at the bottom of my drink. So it tastes like thai ice tea with a creamery texture. I would have gotten a little less sugar, maybe 75%, because it was still super sweet. This place was a great treat after our sandwiches from Lou's Cafe", "author": "Estrella S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Let me just put it out there that I am completely biased when it comes to any cremas/foams/whathaveyou on top of teas, I love this stuff.\n\nI have tried the jasmine green tea with cheese foam and uji matcha with puff cream. Between the two, I actually really liked the uji matcha with puff cream the best probably because of the convenience. Their foams/creams are tasty and I think the idea of the shovel is cute, but I like to drink my teas with one hand. Puff creams are already mixed into your drink for you to effortlessly sip through a straw. \n\nTheir drinks aren't sweet to begin with so you don't really need to adjust the sweetness level too much. I honestly would have kept it at 100% instead of 75%, but hay that's just moi. Service is a little bit more on the slower side, but at least you know they put a lot of effort doodling on your cup and getting your drink right.", "author": "Christene M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Came here thru a recommendation of a fellow boba enthusiast and was not disappointed. I wish every boba shop do puff cream bc I'm totes obsessed. Would def come back here when I'm in sf.\n\nGet the jasmine green tea with some extra pufffff daddy for guaranteed euphoria in ur mouth.", "author": "An B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "It's been on my list for awhile and I had no idea they were right next door to each other.  They're known for their cheese foam (which is a somethe latest craze w/boba) so I tried it.  Personally, I liked my drink but not so crazy on the foam. \nOrdered: snowy strawberry w/puff cream ($4.75) , matcha latte w/cheese milk foam ($4.50), uji matcha w/tiramisu milk foam", "author": "Mikayla M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-11", "description": "Drinks can be hit or miss I guess.\n\nWhat I've tried:\n*Roasted oolong milk tea w/boba\n*Rose black tea w/boba\n\nOverall thoughts:\n*Boba - good texture and little sweetness\n\n*Not a fan of the rose black tea (asked for 75%sweet and it was like they gave me 25% sweet)\n\n*Recommend drinks with a star on the menu should be safe\n\n*Decent seating inside is a plus", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "I saw that a new tea place opened in the Richmond district and knew that I had to stop by to try it. They had a good selection of teas to choose from, offer foam topping, and the regular add ins.\n\nYou can also customize the drinks to your taste. If you like it less sweet, you can get it less sweet. If you want less ice, you can choose less ice.\n\nI ended up ordering white peach oolong tea with 100% ice and 75% sugar. The tea wasn't so sweet and it was definitely flavorful. The boba was a generous amount, chewy and soft. \n\nI would definitely come back here to try other drinks.", "author": "Andrea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Pretty standard boba place, but they have the milky/cheese foam add-ons. You can ask for samples if you're unsure if you want it. Basically, like a sweet cream cheese flavored topping that's foamy, added to the top of your drink. \n\nI got a basic black milk tea because that's how I standardize my boba joint judgements. It's pretty good, flavorful. I got 75% sugar, which was recommended to me by a friend. You can also ask for less ice. \n\nSmall sitting area, not really a place to hang out extensively with a group of friends. \n\nPs- my friend's drink came with a small shovel spoon for the tiramisu topping. It was cute and a lil extra.", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "It was not super packed, so luckily I probably ordered my drink and received it in less than 10 minutes. The workers greeted me and they were nice.\n\nThe yellow stars on the menu means that those are their most popular drinks. \n\nI prefer fruit drinks, so I ordered a snowy strawberry. This is their version of a slushie. They give you a lot in the cup, so much that it was almost coming out of the domed top. The boba balls were pretty chewy, but not too hard. It was pretty good. I would definitely come back and try other drinks.", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "My new favorite go-to boba shop!\nIt's like happy lemon but even better and with more unique choices.\n\nLocated on geary street and presidio, street parking is available\n\nCute little shop that offers a decent amount kf seating, wifi, and a very clean bathroom(just ask for the key)\n\nMenu is straightforward and easy to understand. They offer unique foams like cheese,milk, and tiramisu (likewise to happy lemon). However what makes them standout is their tea selection like Uji Matcha, Assam, Royal Ceylon, etc. They also a healthier drink which are the Tonics (like kumquat, strawberry..etc)\n\nI have ordered Uji Matcha with Cheese Foam and Boba twice. Yummy matcha taste. Cheese foam was not too cheesy and came with a shovel like spoon to eat as well. I would reccomend sticking to 50% or 75% sweet because 100% was a bit too sweet for my liking.\n\nCustomer service: Nice and fast!\n\nWill definitely come back lots of time in the future!", "author": "Michele G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "One of my go to spots in the Richmond that has good boba and wifi! I got the Uji Matcha this time around and it was pretty damn good and potent! I like the versatility of the stand up tables and regular sit down tables.", "author": "Erika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Tried this place out because of their cheese foam. After trying Happy Lemon, I wanted to see how others compared. I ordered the uji matcha with cheese foam, and it had a strong mozzarella cheese taste. Unlike a lid where you drink at a certain angle at Happy Lemon, they give you a tiny shovel to eat the foam, since the lid is just a normal flat lid. The cheese taste is more prominent and thicker. After trying their drinks, I wouldn't really compare this to Happy Lemon. Tancca is unique, and their drinks are yummy! The cheese complemented the drink very well. It wasn't overly cheesy like a cheese pizza. It was very mild, and addicting. \n\nI will be back to try their tiramisu foam and other drinks!", "author": "Jamila W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I got the uji matcha ($3.25) with tapioca ($0.50) and cheese foam ($1.25). Overall, the drink was good, but very filling. It is $5 plus tax. Would come back again for drinks.", "author": "Wesley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I love their uji matcha!!!  The right amount of matcha for me. It has a more stronger taste than typical matcha lattes served at other places. I like that you can customize sweetness and ice. I've had the cheese foam with uji, I like it when I'm in the mood. The cheese foam makes the drink heavier tasting and more of a dessert drink.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Hmm, not sure how I feel about Tancca as a boba joint. I definitely had a great experience, but am not sure I would come out of my way to get boba here. I usually eat further down the road, where all the other boba stores are nestled together so it just be a lazy factor. I ordered the Assam milk drink with boba, which had a very strong tea flavor. My boyfriend didn't like it as much, but I thought the place had potential. Geary Blvd is a competitive street to be on, especially since there's definitely no shortage of boba shops. \n\nI think branding's really important and I'm not sure what Tancca is going for. The indoor graffiti art is cool, but there's also scratched graffiti on the glass windows. I looked up Tancca for the meaning, but couldn't find a direct translation. Most boba stores have a huge advantage, either they have a viral product that everyone swarms the store for OR the environment of the store is a place where people hang out and stay.\n\nIt will be interesting to see how Tancca makes pivotal adjustments during its first few months.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I always get the Jasmine Green Milk Tea,then add puff cream & ALSO cheese mousse into my drink :)) I know guys,it's too creamy,but I just love it that way haha. Their cheese mousse is the best in sf over all the milk tea stores I've tasted. The jasmine green milk tea's color is not as many other stores (they add a little matcha into it) I love it hereeee", "author": "Ha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Currently ranks as my favorite boba spot in the city. \n\nI typically get the same thing...milk tea, milk foam, boba.  Easy peasy.  The milk tea is always lightly sweetened to perfection for me.  The real standout though?  The boba.  I love the slight chew and texture.  The milk foam has a dash of matcha and almost tastes like there's a little salt.  \n\nThey have other types of foam also but haven't ventured out yet.  The cheese foam seems intriguing but I just can't get myself to try it yet!  Haha.  Will eventually do so though...oh!  And can't forget the super cute shovel to scoop up your foam with!  \n\nParking has never been a problem for me.  Lines are irreverent at the time of night I visit.  I hear it's busy during the day though.  \n\n5 solid stars and hope this place sticks around awhile!", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "My boyfriend came here on a Sunday afternoon where the store was pretty much empty. The store was staffed with two front workers that were super helpful in my indecision in picking drinks. \n\nWe ordered a Matcha Latte with cream puff and an Assam black milk tea. Both teas were great at regular sweetness but I wouldn't get the cream puff next time. It costed a $1 extra which was acceptable but it didn't really alter the taste of my drink. All I tasted was my matcha latte so the cream puff really made no difference. I would just go for the cheese foam next time for a $1.25 extra. \n\nAs for the store itself, it was not very instagramable. If you're looking for an aesthetic milk tea shop, this is not it. The tables were dirty and so were the glass. Our table already had straw wrappers on it and the space is pretty small. \n\nOverall, the drinks and the workers were nice. I would visit again but hopefully the store is cleaner next time.", "author": "Quynh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Working in the Richmond, there are so many boba places around! What sets this place aside is their natural selections of teas, I love their Roasted Oolong Milk Tea & surprisingly, their Milk Foam! It's to my understanding that this trend of adding foam to the top of your milk tea is a new thing? I've seen creama milk teas & cheese milk teas which, I LOVE cheese, but would have never gone out of my way to try it unless someone I knew were to recommend it to me.\n\nWell, I got the Roasted Oolong Milk Tea with the Milk Foam which was described as a mousse texture with Himalayan Sea Salt-- YO. That Milk Tea was SOOO good with the Milk Foam! The foam is definitely really thick & dense & not very foam-y at all, it was creamy & rich & the saltiness of the Himalayan Sea Salt just added to the entire experience. They even give you a little shovel to scrape it all out at the beginning or the end because yes, it is THAT GOOD*\n\nThe lady that works there is super nice & I always get served pretty fast. Give this place your money, & tip the poor girl! I feel like a lot of kids come here & don't tip her anything more than just some pocket change.", "author": "Celine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Quite an experience, I actually saw this on YouTube and wanted to try out the famous cheese foam. I got the matcha milk tea with boba and cheese foam on top. The cheese foam is really heavy so I ended up throwing some away before mixing my boba. Other than that I thought that the cheese foam was not too bad. I really want to try out the tiramisu foam I think that will be less heavy.", "author": "Deki T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "I'm always looking for a new boba spot in SF, and this place was so yummy. The pearls were nice and chewy and the cashier helped me pick my drink. I got the Cherry Blossom Green Tea w/cheese cream and my friend got the Jasmine Milk Tea w/puff cream. We both got our drinks 75% sweet. \n\nI'm not much of a floral tasting gal, but the cherry blossom tea was pretty bomb. \n\nDefinitely recommend this place, I plan on ordering the Tiramisu flavored cream on milk tea next time.", "author": "Mila J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "I got their uji matcha w tiramisu cream! Loved their tiramisu but their matcha was just average compared to other cafes in SF. I still enjoyed their drink but wouldn't make a trip from far away to go here.", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "The milk tea drink with cheese foam is so good! Honestly a bit pricey but tastes better than boba guys and happy lemon.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-26", "description": "I came here for celebratory boba after UC Davis acceptance letters, but I was not satisfied. The drinks are build your own and that's fine if any combination you pick tastes good with one another, but they don't at Tancca. Also the ratio of the the drink with cream/cheese is very unbalanced. You could tell the tea was not great quality either. At least customer service was good :)", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "If you enjoy cream or foam in your drink, Tancca is a solid boba spot!\nThey give you a shovel to scoop your milk foam! Pretty cute! I've been here twice and LOVE their uji matcha. You can really taste the matcha. My friends added puff cream to their drinks and it tasted ahhh-maazing. It's like whipped cream in your drink and it's really creamy. Not too salty and not too sweet. I recently tried their jasmine green tea which stated it has a little bit of matcha in it, which was true in my experience. It had a strong jasmine tea flavor and just a hint of matcha :)  My bf added the tiramisu milk foam to his uji matcha drink and that was also delicious. Price wise, it's pretty comparable to Happy Lemon and with the add-ons, the drink can get a little pricy, but it's pretty good quality!\nTheir fruity drinks are good too. \nAll in all, I'd come back because it is nearby, closer than Happy Lemon, and the quality is just as good. I recommend stopping by if you haven't and give Tancca a try.", "author": "Debby N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "I had the Uji matcha with cheese cream on top. The cream is much thicker than other places, but i liked it! I drank about half without stirring everything, and then after I gave up and just mixed the whole thing. My boyfriend tried the jasmine green tea with puff cream and he enjoyed it. Going to Richmond is a bit of a stretch for me so I wouldn't come here unless I was in the area. It is also a bit pricy but what isn't in this city?", "author": "Joyce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Purple cow is overrated. Come here if you want to get your milk tea on! The service and their drinks are top notch. The owner even knows exactly what I want when I call in to do a pickup.", "author": "c h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "I was around the area, decided to give Tancca a try. Seems like a family owned boba shop. I really like their Jasmine Green Tea w/ Cheese milk foam 100% sugar & 50% ice (less ice). It tastes perfect to me. However, if you expect 100% sugar to be super sweet, you will not get that from here. \nOnly thing is, you'll have to find a parking (street) and there were 2 people who ordered in front of me when I came, after ordering, I waited 10 mins for my drink. I thought it was taking sooo long especially how there were only 2 were before me. I guess they only have 1 person who makes drinks & 1 cashier/takes order.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "We came in 3 mins before closing and they made us our drinks! Love that customer service cuz everyone's had that experience where you just come late and they say no more boba! :( But thank you for making our evening better that's the whole point of boba right?? Haha kidding but let's talk about the tea foam and cute little spoon shovel ! Can't wait to come back here", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "First timer this 3 star isn't something bad, but I'm just really in the middle. I don't love it nor do I hate it. They do have that cheese topping for the drink that is similar to Happy Lemon. It's not really my cup of tea, but if you like that topping give this place a try. Orders come out relatively fast. They also do have a clean restroom for their customers.", "author": "Sally L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-28", "description": "I may have to come back again to re-try.  We ordered a Thai iced tea with boba and a Passion Fruit Green Tea with basil seeds.  Both drinks were supposed to be 50% sweet.  My green tea was way too sweet, like icky sweet.  The tea was also very bitter tasting.  I had to add water to lessen the sweetness and the bitterness.  The Thai tea was just okay.  The girl who took our order was helpful and friendly though.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Yummy\n\nOrdered:\n\nroasted oolong tea: nice, deeper taste of oolong. Would get again.\n\nsuper grapefruit: very grapefruity- there were bits of grapefruit in it too. Would get again.\n\njasmine green milk tea: yummy, flavor was a nice surprise. My fave of the 3. Would get again.\n\nTheir boba was not good, too mushy. \n\nStaff was friendly and nice. \n\nLiked that we could do some work here/hang.", "author": "amanda d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "New favorite milk tea place! I love the salted cheese foam they give. The foam is thick and rich so it doesn't just melt and mix into your drink easily. Best part is, they give a cute mini shovel as a spoon for you to eat it with!", "author": "Tina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-07", "description": "Stopped by for a quick drink since I had time before an appointment.  Ordered the Coffee milk tea with no toppings and half sweet.  It was bland with barely any coffee taste, like there was too much water instead.  At $3.25, it's a pretty large size.\n\nI might come back again to try with boba.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Thanks to Evelyn for providing me with an awesome experience! I had a very great experience, it reminded me of the very first time I had cheese foam in LA: Tan-Cha", "author": "Jray M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Do yourself a favor and get the jasmine green milk tea with puff cream or tiramisu cream. It's milder and smoother than their uji matcha. Their tiramisu cream is my favorite cream topping across any of its kind at any Bay Area boba shop. Get it! \n\nThis place is great for hanging out or even working! I've done work here before due to its ambience, lighting, seating availability, and WiFi availability.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "I am obsessed with their Jasmine GMT with puffcream and boba. It's the only drink I ever wanna get when I come here! The only thing I wish they would have is a larger size. But, other than that, I am never disappointed with this drink!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Have you ever had matcha soft serve? Well the Uji Matcha drink just tastes like one! I wasn't that satisfied with the drink but it was pretty ok. I think the matcha/jasmine drink was better cause it was sweeter for me. I wish I added a foam cream on top because it seems like everyone around me was getting that. I do like how they had an ice level option! Service was really attentive - the cashier would remember whose drink belonged to which customer. Very important if there are sketchy people out there who are going to steal other people's drinks!! I do want to try their tonic drinks because it sounds interesting and unique.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "I'm addicted! I really love all their drinks but the ones I get regularly are the Jasmine Green Milk tea with cream milk foam and boba and then any other milk tea with puff cream and boba. And yes, sometimes I get 2 for myself ok!! Cuz it's hard to decide lol when I'm in the city I always try to come here on a break.", "author": "Patricia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "The boba is so yummy! I typically go to Purple Kow and I feel like this place is up and coming. I got the roasted oolong milk tea at 50% with the tiramisu milk foam. The owner had me try both and boy were they delish! Between the cream cheese and the tiramisu, I chose the tiramisu because it is a little bit more sweet than salty. The boba had a good consistency. I would say that the foam can make a huge difference on sweetness though.\n\nThe owner and the baristas are all super sweet. I should come more often because it seems like this is a place where you can kick back with friends and chill. Highly recommended and I left as a happy first timer.", "author": "Earl J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Okay so you know that vicious cycle of eating some salty, then eating something sweet after, and then needing to eat something salty once again? Well, this place totally hits the spot in one drink! I love the cheese crema and tiramisu crema at this place! I swear it complements all their drinks so well. I got the Ceylon milk tea with boba and cheese crema and it has the perfect balance of sweet and salty. The boba is also juuuuusstttt right, not too soft and not too hard. There is also a cute little shovel that comes with the cup to scoop up the crema. :)  I am so happy that this is close by to me so I can always get my fix!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "I LOVE their uji matcha with puff cream and basil seed. My go to order every single time. It's a small establishment but they still have games for their customers so they can hangout and play. Usually when i go there's only one person working, she's the sweetest thing, kind of feel bad when there's a lot of people there and she's the only one making drinks. Last time I was there a customer walked out and dropped their drink, she remade it without hesitation!", "author": "Yenni H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "We were looking for new places in town and this shop popped up! We looked at the menu and we were semi overwhelmed with all the option pairings. However, they were more than happy to let us try some of the cremas. \n\nI went with the cream cheese cream with my matcha drink. I loved the strong matcha flavor and hint of jasmine tea. Unfortunately I accidentally drank a good third of my drink before mixing in the creama, resulting in an overly cream cheesy drink. As you can imagine, it was quite rich. Fortunately, the owner noticed and asked if I wanted some more tea to even things out. I was overjoyed that she offered and even followed up to see if it was okay. I really appreciated her service. \n\nBy the way, they give you little shovels for the crema. Just for fun.", "author": "Fiona H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-20", "description": "Was in the neighborhood and dropped by the newly opened Tancca yesterday since I was craving bubble tea. The Yelp influence is strong and found myself sucked into the milk foam that everyone seems to be talking about. I definitely thought it was a little gimmicky (they do give you a cute little shovel to scoop the cream off the top) and after a few bites, I was over the cheese milk foam floating on top of my jasmine green milk tea. They were also out of boba in the middle of a Sunday afternoon, which seemed a little unfortunate. All in all, just an average addition to the bubble tea scene.", "author": "Nerri Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "My friend and I decided to try this place since we were in the area. The place itself is very hip, new, modern and casual. They have a good amount of seating and a bar that looks out onto the street and sidewalk. \n\nI got a Passionfruit Green Tea with mango jelly. Very basic, so you can't really mess that up. My friend got the Uji Matcha with milk foam. Her drink was not bad but I'm not really into milk \"foam\". I tried it and it tasted like salted sour cream. \n\nProbably willing to give this place another try if I'm in the area.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Fresh grass jelly & good tea flavor in their Jasmine Green Milk Tea. Really enjoyed the matcha addition with the tea. They say it's just a hint, but it's definitely a little more than a tad bit of matcha. Fortunately, I am a matcha fanatic. Would def come back!", "author": "Carol N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "A hidden gem of a relaxing family friendly boba place! When I say family friendly it doesn't really have changing tables and the chairs are high, but the atmosphere is kid friendly. The only staff there chatted with my kid. They have Jenga blocks that you can play and people left adorable messages on them. And importantly the boba is actually good!!\n\nThe cream choices are very unique. We got jasmine milk tea with puff cream and Assam milk tea with regular cream. The cream are very thick and blends well with the milk teas. \n\nAlso has a clean bathroom. Parking should not be too difficult since it's next to 1.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Uji matcha is delicious with and without the cheese cream on top. The mini shovel that comes alongside for you to scoop the cream to eat is too adorable, however i prefer my drink mixed because it's too salty just eating the cream. The matcha has its strong flavor that i enjoy so this spot was on point for me. Also had the chance of trying their jasmine green milk tea with cheese cream and it was amazing! Really nice cashier when i came here on a Tuesday night before they closed. They have a Fivestar program here too. Totally would return to try other things!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "I come to this Tancca alot. And I usually get the same drink all the time. It's a bit difficult to get here IMO. The intersections near here are SO. DANGEROUS. Like, this one prius literally try to T-Bone us. (WHY??) What kinda insurance you got lady that you wanna purposely crash into another car?? Parking is hard and I am a bit scared of parking on an open street with so much car traffic. \nThis place is small, with only these tall tables and stools. Also, why the weird graffiti art on the walls? When we come here at night, it's super freaky and I am not comfortable drinking my boba with this picture glaring at me. Regardless, this place is a good place for to-go! My favorite is the Sakura Blossom green milk tea, preferably hot. It's so unique. This is the only place I know that serves this. As for the foam, I know that it's what this place is known for but it's like $1.50 (?) and sometimes, the foam is not a generous portion or mix well with the tea. We've somewhat stopped going out of our way to come here but if we're close enough, I'll probably stop in for a boba to go.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "I wanted to try something new and a friend recommended this place so decided to give it a try. The store itself like most places in SF is pretty small. I got the Jasmine Green Milk Tea which also has some matcha in it which makes it green. However, there isn't much of a matcha flavor, but it does have  a pretty good Jasmine flavor. Also tried the puff cream because everyone raves about it on yelp, but found that I didn't really care for it. It didn't taste like much to me and wasn't much of a topping, but I guess if you're into whipped cream and stuff maybe it'll be something for you. I would come again, but I can't say it would be my favorite boba place.", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "You can choose Tancca specials, milk teas, fruity refreshers, tonic and snowy drinks. There's also a variety of toppings to choose from for an additional 0.50-0.75$. There's an option to add puff cream, milk foam, cheese milk foam, or tiramisu milk foam for 1.00-1.25$. You can choose your desired level of sugar and ice. I ordered the uji matcha + puff cream + boba and 30% sugar and less ice. The drink was still sweet for me because of the puff cream, so I'll go with no sugar next time.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Our go to boba stop as of late. Friendly service and really good tea and boba. The boba is made just right and the tea is premade so the drink is served pretty quickly. The milk foam is what makes this place special and gets us coming back. I have yet to try the cheese one because well I'm a little afraid to but I'm sure it's good also. The foam has this sticky thickness that's so good! A1 30% sweetness half ice. That's my order every time.", "author": "Guisela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "The space is large and clean. There's a variety of tempting flavors, but I thought the boba pearls could definitely use some more cooking.", "author": "Ke C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-13", "description": "This place is okay. As a big boba fan, I am not impressed with the boba itself. The boba balls are plain and extra chewy. They are also tasteless and definitely not honey tapioca. I tried both the Assam Milk Tea and the Uji Matcha with Cheese Milk Foam. The Cheese Milk Foam has a stronger taste compared to the Cheese Foam at Happy Lemon. However, you have to pay an extra $1.25 just for it, so I would rather just stick to Happy Lemon. The Uji Matcha is way better in comparison to the Assam Milk Tea which I find to be very bland. I guess what makes this place unique are the different choices of milk tea. Other than that, SF has too many good boba spots so I wouldn't drive all the way here for their boba drinks.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "My friends and I decided to try out this new boba shop in the Richmond district and it was very pleasing to see that the pricing here is very affordable! Most places mark their drinks at $5-$6! So ridiculous, but I'm happy to say at Tannca, the drinks averages around $4 :)\n\nThere are about 3 tables and window seats available. Board games and cards are available for the customers to play as well. Which is a big plus for me, because it is so rare to find a place with boba to hang out at in San Francisco.\n\nDrinks were really good. More on the creamy side and not too sweet. Their menu is a little more unique as well. They have tiramisu foam topping for additional $1.25. I tried it with the roasted oolong milk tea. I wasn't very impressed--wouldn't order it with the tiramisu foam again. The foam made the drink extra creamy and chocolatey. A cute little shovel was included with the drink to scoop the foam to taste on its own.\n\nThe service was really good. I always appreciate when my cashier is able to communicate with me.. Sometimes I get non-English speakers taking my order at boba shops.. not this one!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Tancca where have you been all my life!\n\nGod-I truly cannot even begin to express how delicious this place is. Who's idea was it to add tiramisu cream/foam to the menu? That person needs a raise. This place has been open for maybe 2 months and I've managed to try most of the drinks, which I have zero complaints about any of them. Sure I liked some drinks more than others, but none of them were terrible.\n\nI would suggest getting 100% sugar, as their drinks tend to not be very sweet at all. To those of us who usually have to get 75%-50% sugar, trust me and just get the regular sugar amount. \n\nBesides the amazing drinks, the staff is very friendly and helpful! Awesome customer service really sets them apart from the many boba shops on Geary. \nStop by and give them a shot already!", "author": "Cynthia F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-01", "description": "I was actually pretty disappointed with my drinks here. My friend and I like to try new boba places a lot, so we were pretty hyped up from the reviews and pictures. The menu does have a lot of different options, which is great. I ordered the White Peach Oolong and my friend got the Jasmine, we both had boba in ours. While ordering I asked about their sugar levels because some places put more or less than the actual percentage. I ended up getting 100% sugar in mine. What was disappointing was that our drinks had little to no flavor in it. The 100% sugar tasted more like 0%. & Our boba was kind of hard with no flavor to it as well. We had also ordered another drink for our friend (a White Peach Oolong) and she ended up throwing hers away after the first si. Maybe we came a bad time..i'm not sure, but our experience wasn't great. Maybe we will try it again some day.", "author": "Siera O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "I've tried a few drinks here with my mom including the coffee milk tea, cherry blossom green tea, matcha latte, and the kumquat lemon tonic, and they were all really great :)\nMUST HAVE the cheese cream topping! Goes great with the teas and coffee milk tea as well! \nService was always super friendly during the few times I came by, busy or not. \nFive Star rewards are also a huge plus! Gives me more reasons to come for my tea and cheese cream fix hehe. \nInterior can get crowded really quick when it gets busy, but at least it's clean and they do have a bathroom, just ask for the key!", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Came here after having lunch nearby and tried the Milk Tea & Tiramisu Milk foam- which included a cute shovel! My cousin had the regular Milk Tea. Drinks were good and would definitely come back if I were in the area!", "author": "Jasmine l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "The lemon kumquat tonic is really tasty! I asked for 3 pumps of kumquat syrup instead of the original 4 and it was the perfect balance of tart and sweetness.", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Ordered the Uji Matcha with Puff Cream. SO GOOD. This will be my go-to boba place from now on. Thanks!", "author": "Loren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "gzuskrst hot af outside perfect monday but super sweaty i needed DAVINCHI COCOA added OREOS topping 0% sweet u know me muhfuhs. sick wall graff by local arteest j hernandez. outlets along the wall under the bar get ready for hegga asians homework spot lol. 3.5 for now.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Looks like I have a new favorite in the area. With the Richmond getting so competitive with the boba renaissance, I'll admit that I was a bit skeptical about ANOTHER place opening up in the idea. But I still had to try it after grabbing my Lou's sandwich.\n\nFirst of all, the owner is super nice and helpful. I always try to start with the classic bubble milk tea, and she was there to answer all questions, have recommendations, and was super friendly.\n\nSecond of all, the tea is on point. Everything in the shop is fresh, from the tea to the toppings, and if they do use something that is a syrup, they will make it clear. And while sometimes this is just a gimmick to make people think what they're drinking is better, it actually really shows! The teat had flavor! I don't like my boba sweet, making most of them just kind of plain and bland, but this was one that I could get 30% or 0% sweet and be super happy. This is for you tea freaks out there. This place has it.\n\nSo in short, I think this place is worth its place. They've been tried in true from their location in Chinatown, and now in the competitive market of Geary/Clement, they have won my favor. Good job.", "author": "Griffin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "This is a pretty nice place if you just wanna chill with friends for a little. The cheese foam is really good. And trust me it doesn't actually taste like cream cheese. The jasmine milk tea with the cheese foam is super good especially if you just want a little taste of matcha in it. The uji matcha is their strongest flavor or matcha they have and it's not what you're imagining. A bitter taste that matcha always comes with. No this is the same matcha flavor but more accentuated so it's a stronger taste of matcha. You know where I'm tryna get.", "author": "Kristen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "My now new fave spot in the Richmond :) \n\nTancca has the same menu as it's Chinatown location, but the owner informed me they would be expanding their menu with more dessert options I believe. She's super friendly & super helpful! \n\nMy fave drinks are the Super Lemon Yakult Drink. Super refreshing & perfect for a hot day. (Been hot in SF this past week so it was perfect.) Good balance of tartness & sweetness. Of course, all drinks can be adjusted to your sweetness preference. 75% was just a perfect balance for me. \n\nI also love the jasmine green milk tea + cheese milk foam. I love their jasmine gmt because it has a touch of matcha. Plus the cheese milk foam = bomb. The perfect creamy, sweet and salty combo to add to your drink. \n\nMy friend had the roasted oolong tea and it was great :)\n\nThere's also a few outlets so it looks like a great place to study and get some work done.", "author": "Kathleen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Their Uji Matcha is my favorite. Always good service, great decor and consistency in their bubble tea :)  My fav spot in SF to be truly honest", "author": "Iris M. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "First time trying out something like this. I'm not huge on milk tea drinks as they're all the same in muy opinion. Susan is the owner of the store. She's a native to the city which I want to support her business.she was really helpful on recommendations. I ordered the matcha milk tea with tiramisu milk foam. It was freaking delicious! My boyfriend really enjoyed it as well. The foam is really thick and creamy and had a great consistency. The matcha tasted really good as well. They have games there like UNO and Kenya. We ended up playing Jenga for a good hour and a half. I felt like a kid again haha. I can't wait to come back again and try another drink from their location!", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "I order jasmine green milk tea with tiramisu foam and boba which it's really awesome! The flavor of foam is a little bit bitter that is really combination with sweet green milk tea. The boba is chewy and refreshing! Recommend this so much!!!", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I got their uji matcha with cheese foam and I loved it! The cheese foam has a strong flavor, but I do like it a lot. The matcha drink itself was also flavorful and I like the little spoon shovel that came with it.", "author": "Kim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "New style, new milk tea mixed. We try many places and and this place has milk tea flavors just like others , Assam, omanthus, Earl grey, Oolong,,,,and they have new things which calls milk foaming, tiramisu foaming,,,, which we think it tastes good.  The only things takes away 1 start is waiting too long.  There is only one employee does and customers come in group and we have to wait almost half an hour.  Besides that every thing is great.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "Relatively cheap \"mango snowy\" (i.e. smoothie) of average quality.\n\nPlace seemed understaffed.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "I like this place very much!! The drink is yummy and the girl was very friendly and helpful.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "My favorite new tea place in the neighborhood. Super friendly  service and some delicious and interesting flavor combinations.", "author": "Fred P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "I ordered the milk tea with tiramisu cream. The cream tastes really good. It was heavy and tasty. Highly recommend", "author": "Yuerong G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Tasty and freshly brewed teas. Delicious boba that's not soggy or hard. Cute quaint location to get a well-priced and yummy  pick me up!:)", "author": "Sonia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "One of the best milk tea in San Francisco! The tea actually has a strong tea flavor while it's customizable and the price is fair. The staff is always friendly and courteous. I'll definitely stop by whenever I'm in the area.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "SO SO GOOD! I've had their Jasmine GMT twice now and I can definitely say that it's worth the money. Tancca is not at all cheap with the toppings either, so that's a major plus. I hope that they get more business because their drinks are awesome. A must try!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-29", "description": "It was okay. Nice selection of tea. The milk is strong and the tea flavor doesn't really stand out in the drink. The puffcream topping is good but don't recommend combining it with a sugar level above 30%.", "author": "Arctic S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "My husband and I got the earl grey milk tea but my husband added tiramisu cheese on top. I wasn't a fan of the cheese but the earl grey milk tea was good - not the best but was decent. \n\nIt's a good place to grab boba if you're just satisfying a craving but probably would never crave this place. Also - they have a very tight space.. a couple people playing Jenga almost hit us while we were waiting on our drinks.. not my kind of environment.", "author": "Celena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Great Uji matcha! I could actually taste the matcha in this drink and I asked for 30% sweetness too.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "Okay just starting off, the lady that took my order today was super nice! BUT they are so short staffed.. Had to wait 15 mins just to get my order taken and there wasn't even a line in front of me. I just waited awkwardly at the cash register. I got the Jasmine green tea with cheese foam. I agree with the other review that said the teas aren't that sweet! Got 100% sweet and it tasted like 50%. Not the best cheese tea but definitely worth a second visit! I'm going to try the tiramisu next time!\n\n\n***Update: YOU GUYS. I TRIED THE TIRAMISU FOAM AND ITS SOOOO GOOD. I prefer it to the cheese foam!!! Definitely go for the TIRAMISU!!", "author": "S S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "Weak flavorless tea.. boba way over cooked.. was surprised.. environment modern and lovely.. need to improve tea flavor and add some variety as well\nTo menu..", "author": "Robin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-25", "description": "This place is decent. Not as good as the one in socal. I would suggest for them to change their lids because some people don't have the time to take off the lid and use two hands to enjoy the cheese foam.", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "5 stars for their Uji milk tea at 25% sweetness with less ice. There was a strong matcha flavor that reminiscent to ones I had in Japan. I topped it with the cream cheese foam per yelp's recommendation, but will probably omit that in the future and try out their boba.", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Develped cravings for the assam milk tea with puff cream and boba!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Had a jasmine milk tea and uji matcha. The flavors were so great, fragrant, and you can really taste the tea. Didn't add any foam, regular sweetness level (the drinks are not that sweet so it's good), and I loved it. Also, the prices are really reasonable, especially for SF. $3.25 each, $0.50 extra for boba. Will definitely come back again.", "author": "Carolyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Amazing customer service every time I come here (which is pretty often)! Susan, the owner is really sweet and if they accidentally put the wrong topping, they'll gladly fix it! I have tried their snows which are good at any sweetness levels. I'm also a huge matcha fan so I've tried their uji matcha which is pretty good with lychee jelly if you have a sweet tooth. I also really really like their cherry blossom green milk tea warm or cold, if you get it cold it's amazing with milk foam!! For the price, all drinks here are worth it, especially compared to the other boba shops within the area that may be cheaper, but are lower quality! They also have a few card games and jenga if you want to chill here with friends  They have the Fivestar reward system as well!!!", "author": "Elisa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "wowI love this puffcream milk tea，Frist review for this place", "author": "Ray L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Super nice lady working behind the counter. Asked for a roasted oolong milk tea less sugar. The drink was made exactly to those specs, usually less sweet is still really sweet, but this one was just right. Will def come back when I'm in the area!", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Delicious and Affordable for a broke college student like me. The coffee milktea is a real good pick-me-up, especially after pulling all nighters.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Stopped by for some late night drinks and was greeted with a smile. Susan is very friendly and knowledgeable. I got a custom drink Strawberry/Mango Snow with 50% sugar, was on point and delicious. My BF got Assam Milk Tea with Tiramisu Foam; he was a happy camper as well (see pic post) love the ambiance and art work on the wall =)", "author": "Tammy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Friendly customer service. I got a Jasmine Milk Tea (matcha flavor) with Milk Foam. It was delicious. I will definitely be back!", "author": "Suzan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "Tiramisu milk foam WAS SO GOOD. It had a strong tiramisu taste yet was so sweet and a tiny bit salty it was savory. I got it with uji matcha 100% sweet; there was a generous amount of matcha but I recommend getting 75% since the tiramisu is sweet as well, and if you like your matcha slightly bitter.   Overall 10/10 :) thank u!!", "author": "Christy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Lots of options and great patient service. Their boba balls are on the hard side which I personally dont like but their other topping options were great. Namely the yogurt popping boba & basil seeds, which were perfect. The basil seeds are very small and have the texture of a pomegranate or passionfruit seed.\nThe passionfruit & raspberry tonic, which one can get with no tea, were very good although the passionfruit was better. Weirdly mine came without carbonation where as the other passionfruit raspberry did. (Personally I liked it without better). The passionfruit snow was good though on the milky side (maybe it was because it was only 75% sweetness). My friend got the oreo snow which he & I both liked (although it does take talent to screw up oreos)\nAs far as sweetness goes, 100% was pretty sweet, I didn't have a problem with it but the other people who tried it thought 75% was more reasonable", "author": "Boba R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "i like this place -- the boba texture was good and the sweetness level was perfect for me at 50%. i only drink milk tea boba and i feel they do a very good one that has a great balance between cream and tea.\n\nshop is clean and the atmosphere is relaxed. i'll probably be coming here a lot more often since i am not a fan of boba guys nor am i huge fan of the other boba shops on geary/clement. \n\ni find boba in nor cal to be subpar in comparison to what they have down in LA/SGV, so this one reminds me a bit of the ones at home.", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-07", "description": "The drinks themselves are fine - good tea flavor for a Bay Area boba place and a menu that has good variety for tea flavors and toppings. The problem is the incredibly slow service. They need to hire more than one person to do both the drinks and the ordering/register. If you don't want to wait 15 min for a drink then go to Etea or Teaone nearby for something of similar quality (though Teaone has a less extensive menu).", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I got the Cherry Blossom Milk Tea with soy milk; the drink itself was fine but I didn't really taste the cherry blossom flavor (maybe because I only got 50% sweetness?). The service was really nice and helpful. I was told that any changes (soymilk, hot instead of cold) were not extra charges so that's a plus! I would recommend a try if you're in the area.", "author": "C. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "I come here so often now that they have opened up their new location in the Richmond district. My favorite drink is the jasmine green milk tea which has a hint of matcha in it. There were some times when they actually forgot to put sugar or sweetener  in my drink but the workers were really nice about it and remade my drink without problems. Both Chinatown and Richmond locations have a nice seating area. Decent price on drinks. Definitely recommend.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Tancca is my new favorite milk tea shop in Richmond district. I went there 4 times during their grand opening week. After trying a variety of their drinks (mainly milk teas), I have yet to be disappointed. Compared to the other milk tea shops in the area, their price is lower and the quality is better. The owner is super nice and emphasizes that they do not use powder in their drinks. Their drinks are not as sweet compared to the other shops so I would recommend 50 - 75% sweetness level. I will definitely stop by again in the future.", "author": "Michu B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-04", "description": "I was hoping this place would be a good alternative to TeaOne but nope. They take forever and a minute to make a simple milk tea and don't even allow for customizations to their jasmine milk tea! (Apparently you can't take out the matcha b/c it's against store policy) The wait alone is reason enough to not return but add on top of that not getting a drink that you like. Taste is not great either...mediocre at best. I'll wait for TeaOne's replacement at that location.", "author": "Jackie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "I got the best milk form tea from Tancca. I have tried many many places in LA, Asia, and this place didn't make me disappointed. I always go the one located at Russian hill, I'm so glad that finally open their second store at Geary , which is so close to USF! Super nice service, and decent drinks.", "author": "Fifi Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "I ordered Uji matcha w 30% sweet and no ice, whole drink is so watery, I can taste bit of matcha, and no taste at all; customer service is good, but drink doesn't worth come back", "author": "Serena J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Great service and great tasting drinks. The snowy mango and snowy oreo are our favorites so far.", "author": "Tyler F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "The grass jelly here is A1 and their drinks are bomb af, glad theres a location in the richmond cause going to chinatown was too much", "author": "Melda O."}
