{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "I came here an untold number of times in the five years I lived in the neighborhood and they only screwed up my order once.  Got a replacement burrito out of it tho without any further issue.  \n\nThe two hundred other times the food, which albeit was pretty much a super burrito or shrimp cocktail every time, was consistent, good, and well worth it.  Once a week for five years makes this a neighborhood staple.  \n\nThey also get major props for the salsa bar although none of the options available are particularly spicy.  I sense there's a secret stash that I never asked for.  \n\nYou're not going to find a better taqueria this side of Twin Peaks.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "This was an extremely disappointing experience. \nMy boyfriend and I picked his place out for lunch based on the Yelp reviews. We both each got a chicken burrito bañado, and he also got horchata. \n\nFirst issue: they charge extra to pay with cards instead of cash. That's fine, and that's their right, but there was no sign about this policy and the woman who took our order didn't mention it. We only noticed when we looked at our receipt. If we had known we would have paid cash, no question. \n\nThen the food came. The horchata was well-done, but the burritos were absolutely inedible. We each took a few bites and left the rest. We were unable to identify the meat as chicken, as it was rather gummy. We probably should have complained to the staff, but we got the impression from the hidden credit card surcharge and the woman's attitude that they would be unsympathetic to our criticism and refuse to refund us. \n\nThis was the culinary lowlight of our week in California, and a shame to end our trip on such a low note.", "author": "Jo O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "I've been here dozens of times, close to SFState, always a great experience. I recommend this taco shop over any in the area for their above average taste, customer service, cleanliness, and and menu options. There is way more to try here than the standard Mexican food, and none of it is run of the mill in taste. Even their salsa bar is on point, everything is housemade daily instead of the canned stuff you get from other taco places. The difference is in the taste, and also the quality of their meat. You can tell when you are being served quality carne asada in your tacos, and this place has the good stuff. \nOk. Let me talk about the orange salsa for 10 minutes: holy hell, this was so good that the first time I tried it I went up to the counter and complimented them to no end, and also begged for the recipe. The orange salsa is NOT something you see at a typical taco shop, it's just one they want to offer and thank God they do because I'd drink this stuff out of a cup if they let me. It's that just right kind of spice that you feel the heat but can continue eating it anyway. The best way to quench your thirst in between eating this salsa, which is a perfect compliment to their freshly made chips, is to sip some of their horchata. I order carne asada tacos just for this salsa, and their cucumber salsa, and their chismol, and literally eat more orange salsa than anything. \nI've brought several friends here and they all have raved about the salsa bar as well, but this place is more than a taco shop. So let's be clear, they have a huge menu of every kind of delicious Mexican dish you can think of. So if you are in the mood for Mexican like it's from your comadre's kitchen you can still come here and be happy with the choices. I'll update more later with taco photos and of course salsas.", "author": "Mona L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "SF burritos galore!!!! Small hole in the wall in between other chain stores in a mini strip mall, but don't be underwhelmed because this place lacks value and flavor. I got a burrito, my BF got 4 tacos, one of each meat. Tortillas were solid, and meats were flavored well and not dry. They have a small condiment bar on the side where you can get your own sauces, salsas, pickles, radishes, peppers...this is probably my favorite part. The orange salsa--2 words: TRY IT. \nThe portions are very generous, left stuffed!", "author": "Shirley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Omg super carnitas burrito is super DElicious! I've also tried the cali burrito, not great.", "author": "T P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "Don't even waste your time here. Found a huge large hair in my burrito. No manager available to talk to me. Barely understand English, so no one even cares about it. I don't get it, how this place can stay open.", "author": "Igor T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Huge delicious burritos. I don't remember what I ordered, but it was a basic chicken, beans, rice burrito. It was better than Chipotle burritos, and I love Chipotle burritos. Also the provide free chips and salsa while you wait, and soccer is playing on TV.", "author": "Gabrielle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "Decided to come here for a quick dinner before going back to studying at sfsu library. This place is small but it get very busy especially with students who were studying at sfsu. Got 4 regular tacos(2 carne asada, 2 carnitas). It was over $13 for 4 regular tacos. Decent price. Their food was simple but it was good. Tried my friend's fries with carne asada, they give you a lot. It had potatoes wedges instead your usual fries. Not too bad. They make their food quick since i came at a time before dinner rush hour. Will definitely come back again when i am in the area", "author": "Julie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-28", "description": "Why are the reviews so high here? Have you guys not had good Mexican food and this is one up from Taco Bell so you're excited about it? Maybe it's a little island restaurant in the middle of a lot of housing so it's convenient? \n\nThey can't make a simple bean and cheese burrito. I mean, I'm sure if the effort was there, whoever made it could have done a better job. Why?? \n\nA $6.30 bean burrito with a little bit of beans and a little bit of cheese and A LOT of TORTILLA! Thanks for leaving me hungry for something else.", "author": "Kim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "My favorite thing to order here is the carne asada super burrito! My boyfriend usually gets the chicken quesadilla which is good as well.  They are very generous with their portions, food comes out quickly, and the service is great.", "author": "Mauricia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Authentic, delicious and fresh Mexican food! First time trying this restaurant after a day trip to the zoo, definitely won't be our last! Wish we lived closer! All the salsas were AMAZING!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Came here a few times, and enjoyed the food every time. My latest order was a super quesadilla with chicken, while my girlfriend got a super burrito with carne asada. We shared both of them together and they were delicious! Also, each dish comes with a side of tortilla chips as expected from typical taquerias.", "author": "Wesley S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-04", "description": "Been here twice for a carne asada super burrito. It was a good portion size but tasted trash, and they SKIMPED on the meat, do better. Also skimped on the chips but the salsa was pretty good. Other than that, if you respect good Mexican food then you should go somewhere else. This place is for freshmen on campus who don't know any better.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Wow this place is actually good! They don't skimp and the prices are reasonable! My fiance and I shared a wet burrito, a taco, and nacho. The wet burrito was like 1lb, taco was really flavorful (the tortilla was different, in a good way), and nachos was loaded with beef. Minus 1 star because we asked for no beans but they added beans to both our burrito and nachos. We had to pick out the beans in the burrito and had to eat around the re-fried beans on the nachos.", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "I used to love your Carne Asada plate so much, I couldn't live without it, and haven't eaten at any other taqueria in town. Until today! The way you changed your Carne Asada plate is terrible. Meat is overfried and almost burned, it's way too dry for beef, which used to be tender and juicy before. Moreover, you're clearly saving on rice and pico de gallo, and keep bringing plastic cutlery most of the times, when reusable forks and knives are available. FYI, we don't order take outs because single use plastics are trashing our planet. Considering all above, there's no point for me to even come back to your place. I'm very dissapointed that you treat your customers this way. We always leave you tips and clean after ourselves, and we don't deserve crappy food. Sorry, but you lost a customer who used to bring your place about $200-$300 a month. Thank you for all good food in the past, I will miss it.", "author": "Katie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "Worst burrito I've ever had... I don't even know whats inside it, doesn't look like anything i was expecting. Ordered the baby burrito on Postmates today, and several extras for lunches this week... Hopefully I don't have to throw them out? No salsa, no beans, chicken is ok but the rest is just rice and a lot of sharp cheese. It all has this weird starchy texture. Can't believe I wasted so much money on food I might not even be able to make myself finish.\n\n\nHow do you screw up a burrito this badly?", "author": "Susan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "This is my neighborhood taqueria and they always take good care of me. Breakfast burritos are great, NorCal burritos are absolutely delicious (off-menu item I think), service is always solid, etc etc. They have cold beer and a couple TVs so you can catch part of the game while you're waiting or eating. \n\nThey have a couple tables outside for when the weather is nice. \n\nThey have a small salsa bar including an orange salsa and jalapeños, which I greatly appreciate. \n\nI'm still working up the courage to order a campechana and this amazing-looking stuffed pineapple dish. \n\nThank you!", "author": "Noah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "As a neighborhood joint not in the Mission, Dos Charros serves a purpose and the locals flock to it.  This place has the greatest variety of meat and seafood choices on this side of town and some unusual dishes, like the pina charra with seafood and the alambres with chopped beef. This is one of the few places to get lengua west of the Mission and it's very good here, perhaps the best meat choice.\n\nI have gripes, though:  (1). They surcharge credit cards but there is no signage advising of that.  The surcharge is greater than my credit card's cash back percentage, so I pay cash here.\n\n(2).  I am getting tired of paying for extras and not getting them.  I usually get food to go and when I have gotten home, on two or three occasions, I  found that my super burritos didn't have the guacamole and sour cream.  Tonight, I paid extra for cheese on my tacos, but there was no cheese on any of them.  I have mentioned being shorted to the cashiers on subsequent visits after being shorted and none has even expressed an interest, let alone offered to make things right. \n\n(3).  They are cheap with the to-go tostaditas. They volunteer one small bag with two burritos. I usually, but not always, can talk them into an extra bag.  At least they no longer ration the salsa cups.\n\nSo, good choices and good food, with some rough edges in the hospitality.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "A super reliable neighborhood Mexican restaurant. The portions are sizable and the staff are always friendly. I've noticed a lot of Spanish-speakers visit this restaurant which gives me a level of confidence that the food here is authentic to some degree. The burritos are massive and the nachos are huge platters worth. The horchata is tasty and their salsa bar has some good options too. If you're ever in the ParkMerced area, this restaurant is worth a try!", "author": "Christina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Excellent customer service. The nachos were a lil pricey but it was worth it. They had big portions of food and it was very worth the price.", "author": "Alleona E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Just came from Los Angles and tried this spot my boyfriend brought me to, i must say the carne asada tacos and crunchy tacos are delicious with the green avocado salsa. The meat had no fat which is a huge plus!", "author": "Diana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "A Mexican Taqueria that essentially caters to SFSU students and residents of Park Merced. I have been here twice and feel they offer good Mexican food at good prices. Unless you know this area, this location is hard to find. I heard that this place will add a surcharge for credit cards, but I've always paid in cash.", "author": "Wayne Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-05", "description": "Not my favorite place. But at least the food score is highe than most Mexican restaurants. The food doesn't seem quite as fresh here as it does at other places. I love carne asada and this place doesn't seem to have the best. It's open late though which is a +++", "author": "Stan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "The tacos are pretty damn good, burritos are too full of rice and beans though. Very friendly people :) also love that you're given chips!", "author": "Romro J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-30", "description": "Unfortunately we all had very bad stomach problems after eating here...:( \nThe restaurant looked nice after a long family day at the zoo and the staff is very friendly but I don't think we come back after that experience...!", "author": "Nadine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Dos Charros really hits home with its true authentic Mexican prepare dishes. To my area of Mexican restaurants around the area, the mission could never compare. Love this place, their waffle fries with pollo asado is the reason why I make it through the day. It's the perfect Mexican American dish i have tried. Clean and spacious. The food is tasteful and overall fresh. It is made fresh every time. \nTry it out.", "author": "Gerardo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Delicious carnitas super burrito! I highly recommend checking it out! They give you free chips and salsa! The salsa variety is very good!", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "I never thought I would find a really good Taqueria in Daly city! We ordered super nachos, carne Asada waffle fries, and the California burrito with waffle fries! It was delicious and definitely ended up with leftovers.", "author": "Ronsen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I come here all the time! Always fast, fresh, delicious, authentic Mexican! They're tacos are really good and their loaded fries are amazing", "author": "Katie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "I really enjoy this taqueria. They food is very delicious and they give you a man sized portion. I ordered the jumbo super burrito wet style. It was filling and delicious. \nTheir salsas are very tasty. \nI also tried the steak fajita and was very impressed. They were flavorful and had a generous portion.\nI preferred chips and salsa as a side. The only disappointing thing is the amount of chips they give you. They have a salsa bar but no free chips. If this place added chips to the salsa bar, then it would be perfect.\nOverall, this place is highly recommended!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Our all time favorite for a cheap and quick weeknight dinner. \n\nCall ahead so your order is ready when you arrive. \n\nLots of options, very affordable and authentic Mexican food. There's a salsa bar, TV, plenty of parking spots.", "author": "Pauline H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "Decent service, Decent food. \n\nThis place isn't bad. I mostly come out of convenience because I live nearby. The chips they give with your order are always old and kind of oily. The food itself is decent, though. Their chicken use to always seem super salty to me, but  lately it has been better. FYI: they charge a 75 cent debit/credit card fee under like $8 or $10.  \n\nIf you're around parkmerced and are really craving Mexican, it's a solid option.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-04", "description": "Not worth it to be honest. I don't understand how Mexican restaurants in the Bay area can get away with such high prices when most of the ingredients are so cheap.", "author": "Linda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "My wife and i went here 5 minutes to closing.  We found them to be nice even towards the end of closing.  We ordered 2 burrito's and we were not disappointed.  It is always a good look coming here.  Now I just found out that they have spinach and tomato tortilla shells.  I just want to say thank you for showing good customer service.  \n\nThe food was very good as always.  I had the chicken with schrimp, and my wife had a steak burrito.", "author": "El-Khalid M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "DO NOT BUY FROM THIS PLACE . I purchased two burritos last night & ended up throwing up this morning. The food here is not fresh & they are not good with instructions. I specifically ordered two burritos, one being with absolutely nothing & specific instructions on what should NOT be on it . I get home & both of these burritos have EVERYTHING . People with allergies should be VERY CAREFUL !! The sour cream looked yellow & the meat was not properly cooked/ taken care of !!!", "author": "Esmeralda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Fresh sauce! Fresh seafood! And carne to die for! No weird taste! No saltiness! Muy perfecto! This place is a diez not a cinco! But it's numero uno in my book for around this area. Nonetheless ariba to Taqueria Dos Charros!", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "amazing california burrito. huge portions. delicious sides that go with food. salsa selection is amazing too!! my friend had the torta and it was massive! great spot to go!", "author": "Theo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Ok so how is it that i've been in the neighborhood for so long, and i never knew that park merced had some bomb ass food around? Well better late than never. \n\nBefore this magical night where i just decided to  stumble in to grab a bite (or a meal for 10 all for myself,) i had always thought it can never get better than a good ol' Mexican food truck from the hood. But was i so wrong. \n\nI ordered fish tacos, carne asada tacos, refried beans and rice with a bag of chips, again all for myself. Hands down the BEST fish tacos I have ever had in my 23 years of life. They marinaded the fish to absolute perfection. The carne asada was very tender with a nice grilled beefy taste. And the chips omg they were delish. Usually i dont fancy the chips that are included because its usually stale, but these were so perfectly crunchy. And the fact that it was free just made it that much better. I would deff come back and order the whole entire menu. Cuz Dos charros man, they don't f*ck around!", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "this place has very good food. Been here quite a few times. Had burritos, tacos, different plates and the waffle fries. All excellent.\n\nI love one of the hot sauce they have in the salsa bar. It has a smoky flavor.\n\nUnless you live near by or go to SF state this place is hard to find.\n\nOne of the pluses for me is that they close at 10pm.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-12", "description": "A few weeks ago we tried Taqueria Dos Charros & were impressed with their huaraches.  Today we were wanting Mexican food & decided to go back.  My dining partner got another huarache & liked it just as much as the first one.  I decided to try a combination plate.  I asked for a Chile relleno & a tamale.  They didn't have any tamales.  OK, then I'll try an enchilada.  No problem.  We took our food to go & when I got home, I dug into my meal.  The enchilada wasn't bad.  It was flavorful.  I was looking forward to trying the Chile relleno.  I tried cutting into it & it wasn't cutting!  I finally pulled it apart & it was completely charred!  Seriously?!  They obviously charred it before the egg batter was put on it because the outside isn't burned.  I might give them another chance, but wow.  What a disappointment.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "Costumer service is horrible management is horrible they don't know how to take orders efficiently then blame you for their mistakes my experience was so horrible I took my tip my money and gave them back the food they messed up because their service was so bad I didn't even want them to fix it don't bother asking for management after your meal is screwed he's just fine with how he's employees treat their customers.", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-09", "description": "Food: Pretty average in my opinion. Nothing super special, but does the job. I like that you get free chips though!\n\nService: I hate to rag on anything or anyone, but I was with my boyfriend who recently called and ordered a burrito for takeout. The order was repeated to ensure it would come out correctly. We went back to our apartment and realized the order wasn't correct. A phone call to the restaurant was made to explain the situation. The woman hung up in the middle of the conversation because she wasn't understanding what was wrong. I thought it was unprofessional and rude for no reason. Sorry y'all", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "One of my favorite places to go for Mexican food in the city. It tastes so homemade! Love the fish plate, they have very generous portions. I also\nLike the new California burrito.", "author": "Natânia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Their burritos are great and they give chips to customers that dine in. There's a salsa bar too with a variety of salsas to choose from. Super speedy service every time I visit.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "Lunch today on the way to SFO. Tucked into a small strip mall in Park Merced (off 19th Ave), definitely inauspicious. Service was somewhere midway between friendly and unfriendly (like the DMV or post office?), but the reason to go is decent Mexican food at a very fair price, for SF -- being next to SF State probably keeps the prices fair.  Plus free parking!", "author": "Fred E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "They serve these thick chips that are super crispy and have just enough of a hint of oil that tells you they deep fry these suckers in house . . . \nand I love that!\n\nThere are some other taquerias (warning: I'm about to go on a chip rant here) that either lack the desire, want, or skill to serve something as basic as a decent chip and some go so far as to buy them in bulk from somewhere.  Shameful.\nWhat I'm saying is, if your taqueria can't deep fry chips 1) you've got to wonder what else can't they make and / or 2) you might seriously consider finding another taqueria.\n\nBack to Dos Charros:\nThey provide yours truly a level of comfort and satisfaction, like only a good taqueria can, when I am fiending for some Mexican eats.  Seriously, they've save me from a couple late night drives out to the outer reaches of the Mission, and their prices allow me to double up (in case there's an urge to binge) on my order.\n\nThey serve a tasty veggie burrito\nand I'm a fan of the nachos (mostly because of the aforementioned chips).\n\nService is always friendly.\nParking can be interesting at times.\nAnd the salsa bar features an awesome chipotle salsa.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Food is great, but WAY too salty. Salsa, taco y quesadilla would all be better if they weren't so salty.", "author": "Bill W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "The taqueria is in a college community and they know it. Food is OKAY but very cheap. There is parking nearby but it's also a short walk from anywhere in the Park Merced area. Never packed.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "This is my favorite Mexican restaurant in town! The prices are extremely fair, not overpriced and the food is absolutely delicious. The portions are huge and i always take it to go and eat it throughout the day. Fresh food, authentic, and the workers are super sweet. Highly recommend!!!", "author": "Claire L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "I was satisfied but not filled!\n\nCame here with the intention of getting a JUMBO burrito but wound up with just an average burrito. When I think JUMBO I think thick burrito and double to size of this burrito.\n\nI was pleased with all the meat, beans, cheese, and other topping on the burrito but the size does not equate to a JUMBO burrito in any fashion. I finished the burrito in less than 5 minutes. Yeah, that's right, I did that because that is how I get down. I couldn't enjoy the burrito the way I wanted and devoured this thing like it was a baby burrito. I am a bit unfulfilled by this burrito but now I know for next time, if there is a next time. \n\nThe service was excellent. There were not a lot people present when I can in. The line moved rather quickly as well. \n\nIf you are looking for complimentary chips then you had better spend at least $6.50 because if you don't then you will need to PAY for it. There is a sign that is posted that informs all customers of this as well. So, READ IT CAREFULLY!\n\nThe seating is nice. The table are spread out and spacious which allows for lines to form without customers having to hover over seated customers. That is a huge plus. \n\nParking is rather easy because there is a parking lot. If you cannot find parking in the lot there is additional street parking available. \n\nThere is a lot of good about this place. But, for me I am somewhat disappointed. Might give this place another try again in a few months or so.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "This is not good . The rice was weak . The beans were no bueno . Chicken enchiladas were average . The chips were the worst of any Mexican place I've ever been to . Tasted like they were 10 days old . A couple of beavers were sitting across from me . I overheard one of them say \" Don't eat the chips - you might lose a tooth .\" \n         I asked for a glass of ice . I was told they don't have any . Room temperature \nDiet Coke = not good .", "author": "Mike D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Typical SF burrito shack that tastes good, but skimps on amenities.  Food is above average but basic.  They have a salsa bar, but it is a bit small and placed in a corner.  Wide variety of drinks, but unless it's alcohol, you have to walk to cooler and remove on an honor system.  New paint would go a long way.  Stick to basics and you'll be happy.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "The best molcajete around this area , the portions are big, menudo on the weekends is good too", "author": "Paulo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Came here yesterday and came here today. Two days in a row, two of the best burritos. My bf and his brother couldn't get enough. Crispy bacon in the burritos and guacamole with perfect eggs and waffle fries in the burritos...... Out of control good and nice staff. 5 stars 100%", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I like this place because it so close of my house. Good Mexican food. Hot and spicy !!! Quick service and friendly staff. Recommend.", "author": "Kate Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "Friendly people, always a busy business. I go regularly and never get disappointed. Food is good and cheap prices. Likes the carne asada plate! Fish tacos !", "author": "Victorya Esmeralda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Who knew there was an amazing taqueria in Parkmerced?! Their tacos have super generous portions and they have a great little salsa bar with three or four salsas to choose from. The real star of their offerings is hands down the carnitas. Crispy on the outside, even after being in a burrito, while being tender and flavorful, not to mention consistently good visit after visit, is worth the stop alone. They also do an amazing California style burrito with waffle fries.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Food good. Location convenient to my home. Parking would be difficult if I drove but I don't so", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Best local Mexican food. Great food, great price. Living very close by, we eat here all the time. If you want affordable but amazing Mexican than this is the place.", "author": "Nicholas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "We've come here twice and haven't been disappointed. What we've tried:\n\n- Super Burrito (I forget which meat)\n- Super Quesadilla (Carnitas)\n- Carne Asada Waffle Fries\n\nAll were really good and if my boyfriend and I get two items, we normally have enough leftovers for one more serving. My boyfriend really enjoyed the carnitas and the waffle fries are just a good change from the normal nachos. Crazy to think that this place, probably more catered to the SF State students that live near by, is really good but it is! We'll keep coming back. \n\nAlso, they give some free chips (feels like you get more free chips when you do take out than when you dine in), a few little containers for salsa, restroom for customers, and free water for dining in. Also, I think everything is really reasonably priced. The portions are big! That's basically all that I could ask for in a Mexican restaurant.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-10", "description": "This place isn't bad. I go here for the convenience since I live in the high rise towers nearby. If I order from here, I usually get the super burrito with carne asada or super nachos with carne asada. The super nachos always come out well. The super burrito is good, but sometimes a hit or miss. There have been times I ordered the burrito and it was mostly filled with lettuce and even one time, it had those paper fasteners that go around cilantro bunches in the burrito.. not very appetizing to say the least. \n\nIf I order from dos charros, it's usually to get my nacho fix since I love the flavor of their refried beans. Go try out their nachos, it's sure to please.", "author": "Nina I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "My go to when I don't want to make a journey to the mission. Always friendly, good sized portions, and accommodating with a decent price. As a vegetarian i wish they would add more items to the menu but I ask for the super quesadilla with veggies or beans instead of the meat and they never seem to mind.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "This place dishes out a pretty good burrito.  The rice and meat inside the burrito are seasoned quite well.  The chips and salsa are also worth mentioning.  They chips are consistently fresh and pack a great crunch.  The habanero salsa is sweet and spicy, and is a good dip for both the chips and burrito.  For the size of the burrito, the price sounds about right.  You must spend $6.50 to get free chips.  They don't leave the salsa cups out which is quite annoying and makes them look cheap.  \n\nThere is always plenty of seating available. I will be back.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Worth a visit if other taquerias are out of the way or you're already near. While decent food, everything tasted a notch below places in the Mission. Usually in my case, convenience won out - on many occasions. The 1-, 2- or 3-items combination plate is the best deal.\n\nNot easy to find or get to unless you've been here. Not a standalone taqueria but within a small shopping center.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "I was crying when I saw there were no taco Tuesday deals! However, I must say the $3 carnitas tacos were quite exquisite. Definitely recommend carnitas over asada.", "author": "Katherine R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-02", "description": "I really don't understand the good reviews. I've given this place multiple tries and was disappointed  every time. Everything is so dry and bland. The rice tastes like no effort is put in to make it flavorful, and the meat is always dry and overcooked. I guess they don't have much competition in the area, but that's no excuse to not take pride in your food.", "author": "Zach B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "Good Mexican food. With your order you get chips, sometimes they forget to give them to you and you have to remind them. You can call ahead to order for pickup, but sometimes the phone just rings and rings. My favorite item is the California burrito with Carne Asada.", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "One of my fav places to go. My go to orders Super Steak and Shrimp buritto and super shrimp quesadilla yum!!! Both full of yummy goodness", "author": "Monique E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I've gone here twice, and loved it both times! Their nachos are soooo delicious! Definitely going again next time I visit the city! I remembered where it was because it is located near the housing for sfsu.", "author": "Braelyn Joy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "Pros \nCarnitas = good, nice consistency, soft thruout - pretty dam oily\n \nCons \n- Hair in burrito \n- cheese wasn't fully melted", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "What a nice surprice, great food big portions for your money ,  my molcajete was to die for and was enough to feed 3 ppl. The best was only $14.50. Shrimp meet,chicken and fish. To my Yelper visit this place is great. \nJust don't use the restroom way too  durty.", "author": "Elisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I love this place so much I literally come here at the very least once a week! I haven't tried a single thing I don't like here and I've tried damn near the entire menu. A couple faves of mine here are any of their tacos, their cali burrito, the camarón burrito, molcajete (if you're really hungry), cocktail de camarón,their super quesadillas, and piña loca.", "author": "Niña E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "California burrito is the way to go. Deciding factor for me was the fact that the California burrito has waffle fries in it. My choice of meat was carne asada and it was an excellent choice indeed. I can never finish this in one go and divide it into two meals (lunch and dinner), just got to be careful since the guacamole in the burrito will of course be less green than when you first ate it. \n\nPlus side is the free fried tortilla chips with a purchase of $6.50 or more.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "We really enjoyed this place. Friendly staff. Very good marina quesadilla. Definitely eat here again.", "author": "Len F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "It is cheap and affordable, plently of choices to pick from, pretty nutritious, well balanced diet", "author": "Mike W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "Okay this is absolutely ridiculous.\n\nI came here wanting to try something new, going out of my comfort zone (El Burrito Express). I ordered the most simplest food item of all the food items. I ordered a BEAN and CHEESE burrito. That's it. With refried beans. She asked, with rice? I said no. She asked, with pico de gallo? I said no. Literally JUST beans and cheese.\n\nMy friend ordered a Cali burrito with carne Asada.\n\nWe get our food. I drive home. I take a huge bite of my burrito... Littered with carne asada. Literally meat was all up in that. Refried beans, cheese, and carne asada. I've been a vegetarian for 13 years.\n\nI drive all the way back, I explain that I ordered just a bean and cheese burrito. They make me a new burrito and apologize. I drive home. I take a bite of my burrito. It is literally just pico de gallo, rice, and a couple of pinto beans for garnish.\n\nI've been eating Mexican food since I was born and I am sooo disappointed. I asked my friend, \"how is your burrito?\" He said \"it's alright. But it has this weird crunch in it, like something is burnt. But I don't have anything to say about it. All I have to say is we should have gone to El Burrito Express.\"", "author": "Mika S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Best taqueria! Ive been to taqueria's at mission street and this place compares very well to most of them. Love their salsa bar. Out of all the take out places, this place my go to. I love their tacos and carnita waffle fries. Price is pretty reasonable too.", "author": "Tri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-12", "description": "All I can say is if you want a taco come here. It's convenient for students and it's not a hassle to get here.", "author": "Ann N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "Had a couple visits to this place since I live nearby.  Crunchy tacos were probably the best thing I've had here.  Carne Asada \"Waffle\" Fries were very lackluster.  Barely and meat and the fries were soggy.  Super Burrito had way too much rice.  I'd rather drive elsewhere for Mexican Food.", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "I live very close to this area so I visit the Parkmerced plaza occasionally if I'm too lazy to go anywhere else for food. I saw that the previous taqueria closed down so I was curious to try this new one.\n\nI've tried this place a total of two times now but mainly for burritos and nachos. For the most part everything is pretty good. I do consider the food to be better than the previous restaurant and they offer more menu options for sure.\n\nFlavorful and simple. I'm pretty glad that this is there though and I'm so ready to try their shrimp cocktail!", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Best super shrimp burrito in this part of town!! It is an awesome price, super convenient as it's in my neighborhood of Park Merced and it's soooo delicious. Perfectly spicy, perfect size, perfect taste!!!", "author": "Bristy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "Authentic tacos!!! Love their food every time I\ncome in!  The people here are super nice, I'm sure the owner has helped me before and the lady is super sweet! I've only tried the tacos here, there aren't many places in this area with great Mexican food, so when I'm here, I am ordering tacos for sure! \nI've ordered the chicken, asada, & carnitas! I've brought some of my friends along to try and they have all loved it! Try it out!", "author": "Crystal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Hello Shrimp lover. Visit here and try the super shrimp burrito. I'm pretty much sure you'll love it also and you'll love coming back because of their very delicious food offer.", "author": "Team M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Awesome place! We happend to find this place while visiting the San Francisco Zoo. We had the \"Molcajete\" as well as \"Filete de Pescado\".\nBoth dishes were delicious. Four day later we were craving \"Molcajete\" and drove all the way from Hayward. Highly recommend it!", "author": "Martha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Not sure why I'm giving this place five stars. I mostly get my food to go, and they're always stingy about giving an extra bag of chips when I order two items. But besides all that, it's pretty damn good. Friendly service, and hearty portions. I might be working on my first heart attack if I keep eating there. Let it come, baby.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I'm mexican and love tacos!!! The tacos here are quality and on point. The carne asada is the sh*t. Most places use cheap meat with a lot of fat and dry or overcooked. This place cooks it fresh and juicy with quality meat. Thats why there prices might be a dollar or two more than your cheap ass taqueria.", "author": "Jacque R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "I've been here a couple of times but I think it was before they changed the name.  My coworkers liked going here but i wasn't wowed back then.  After church, hubby wanted a burrito but i didn't wanna go to a random place.  We didn't want to go all the way to the Mission as he was very hungry and well Daly City doesn't really have good burritos.  Since we're always on a quest for good taquerias, I recommended to come here with some hesitations. I was willing to try again since it had good reviews on Yelp.\nI got their carnitas super burrito. I usually get super quesadilla carnitas as my litmus test when trying a new place but I'm pretty picky with my quesadilla. Hubby got their steak super burrito. Both with no beans. Meat was tasty, not just saltiness. Rice was flavorful. Huge. Their guacamole seems to be mixed in with something so that's a blah. I love they have a salsa bar. Plus that there is parking. Chips are free with minimum purchase of 6.50. It just sucks that they only gave 1 bag. \nThe verdict, we'd come to this place when we're nearby.", "author": "Claire J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Good for the price. And they were open on a Sunday evening! I ordered take out. Short wait time. Staff was cheerful and polite. Everything I tried was tasty: chicken enchiladas, chicken tacos, carnitas, chips, rice & beans. Good salsa bar. My only complaint was that the guacamole seemed runny like it was more sour cream than avocado. I'd order from there again, but make my own guac.", "author": "Kristen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Maybe it wasn't such a good idea to have tacos after getting over the flu. That made things worse. I\"m staying away until the thought of carne asada tacos doesn't make me wanna hurl.\n\nCarne asada tacos pre-flu was good though. :)", "author": "V M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "A consistently good burrito. That's what they do well here. I've been coming for a few years now, because I love the food and the friendly service. They are really friendly!\n\nI probably should try some of their other menu items, but right now I'm quite content with the chicken super burrito. It's delicious. It's massive. It comes with chips and fresh salsa. And, it's under $10.", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Food and price are quite good, as are portions.  Also, the mall is not that crowded so I can always find parking and Dos Charros usually has seats without waiting.  So far everything I have ordered from bean and cheese burritos to fish dinner plates have been good in quality, large in size, and reasonably priced.  My go to place.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Juicy burrito! I ordered a super carne asada burrito with no pico de gallo. My burrito had yellow rice which is different. It's probably the juiciest burrito I've eaten so it can get pretty messy. The chips are fresh and you can tell they are made there. Salsa selection is pretty good, I tried the green and the red salsa. The area is kind of difficult to find, at least for me. Overall great filling food 4/5 stars.", "author": "Flower C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "Just don't come here if you're actually looking for decent Mexican food. I happened to come because I was trying to find the closest location of mexican food in proximity to sfsu. I happened to come here during closing hours, and not only came across rude service, but also dissatisfying food. If I'm paying $8.50 fora burrito, I expect it to be at least somewhat well made. Then I asked for salsa, because they had the salsa bat closed down, they lady completely ignored me until I asked again, waited and asked again. Then she sighed, put some on the side and seemed aggravated. Shudda just gone to taco bell.", "author": "Neha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "Best Mexican food in town! Carne asada and chorizo tacos are where its at.", "author": "Konstantin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-11", "description": "I normally do not write negative reviews because I know how much of an impact it has to business' but I am making an exception. I ordered a Carne Asada super burrito. Everything was good about the food I ordered besides the fact it also came with STRANDS of hair. I understand that this can happen from time to time so I wasn't too upset. But what really got me upset is when I brought it to their attention. The cashier just said \"oh...\" and brushed me off. Where is the customer service? Never returning and I advise everyone else to dine here with caution. Good luck to the fans.", "author": "Charles Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-12", "description": "Terrible. Chicken in burrito was overfried to the point of being inedible. Weird aftertaste to some bites.", "author": "Joel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-03", "description": "This place is literally disgusting. Lumpy, oily, too salty, terrible quality and just so bad I want to stick my finger down my throat and start over elsewhere! Run run away...", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "Great burritos, good service, and decent prices.\n\nSo far that's two great burrito place near my home. Maybe I like burritos more than I thought I would.", "author": "Ken T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "I really could not say enough positive things about this place. My boyfriend and I live in the neighborhood and come here at least once a week (okay, twice, but who's counting?). The carne asada taco plate has become my go-to, but the nachos, carne asada fries, taco salad, and burritos are top notch and always conflicting for me to order. I could go on, but I'll spare you. You know those Nights you crave a mission burrito? This is far and above better than those and in my case, in my back yard. I have yet to order something I haven't loved. I've even gone as far to say I'd eat this as my last meal. Do yourself a favor and check it out.", "author": "Bailey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Came here for this first time today, good customer service, good cleanliness, ordered a taco of each meat and was pleasantly pleased with the food quality, plenty of salsa containers provided, will be back in the future.", "author": "Christina A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "This place has ratings that are too high. I assume this is because it is really close to student housing and a lot of inebriated students eat here late night and they have strong consumer loyalty. I had the carne asada, carnitas, and al pastor tacos here and they were all really greasy. I am talking, they were slick with grease and they were bland. None of the seasoning or marinade on the meat had any flavor. I would not come here again.", "author": "matthew m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-04", "description": "I only been here twice and the second time I go here I got food poisoning. Not really happy about that, just be careful that's all I am saying when you go there. It was on Jan 3rd around 12-2pm I arrived.", "author": "Timothy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "This is a fanstastic taco shop. The best mexican food in a 2 mile radius! The food is authentic and never had a bad meal. VERY CASUAL.", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Great food, the place is super clean, I go here at least twice a week, I would totally go for the tacos , skip the mainstream burrito please try something else, Mexican food is so rich and varied! Tacos are great, and my favorite, the \"Campechana\" a huge Shrimp and Octopus cocktail exactly the same taste you would taste in Mexico.\nif you want to go big the winner is the \"Molcajete\"", "author": "Jaime J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Delicious food - absolutely great. \n\nMy favorites were the refritos and Chile Verde and the Carnitas. \n\nI had the three item combo (carnitas enchilada, carne asada enchilada, and al pastor taco. Yum! \n\nMy wife had the Chile Verde platter. They were both great dinners. \n\nWill want to eat here again soon!", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "I went there thinking it was Taco Libre but that's ok, my friend and I wanted to try it out.\nI asked them how was the torta and they said good, that it came with traditional bean spread, avocado, jalapenos, crema, lettuce and tomato w choice of meat.\nThen she showed me the thin cuts of steak they would use and I was sold. It was delish! The red salsa at the bar was very tasty as well. My friend had shrimp tacos and she also said they were good.\nI always look for nice meat at taquerias, I'm very picky about clean and non fatty cuts. You know what I'm talking about when you get a yucky bite... gross! LOL\nAnyways, will recommend and cant wait to get another!", "author": "Tere C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-23", "description": "Saltiest burrito I have ever tasted did not make me feel good. I'm not sure where they went wrong. I wish they figure out something to change it.. Really was looking forward to trying this place it because it's so close to my house and convenient! Maybe the salt dispenser got knocked onto it!", "author": "Alina Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "I love this place! It's my go-to for dinner. \nAs a vegetarian, it's typically difficult for me to find restaurants with multiple options, but dos charros can make just about anything without the meat. Their taco salad is amazing, complete with creamy guacamole and a house-made crispy shell. I love their nachos, their burritos - you name it. They do to-go orders as well as dine-in, and it's fairly inexpensive. Their hours are great and convenient, too. Five stars all the way.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "Most unpleasant experience I've ever had in a taco shop. \nWent in on a Saturday morning, it was nearly empty, so I assumed it would be quick. \nI ordered my basic test for a taco shop,  a simple breakfast burrito, Potato, bacon, egg, and cheese.\n3 people came in after me, ordered, sat down and we're served before me. \nThe burrito was rather small for $8 and the roll job was embarrasing. In the associate northern California style, steamed tortilla wrapped in foil resulting in a sticky tortilla.\nThe first bite I took revealed 2 huge, raw looking gross strip of bacon. Not broken into pieces like whole strips, looked like it hadn't even touched the stove. \nI honestly almost threw up.\nI took it back to the counter and was given a less-than-respectful response by the cashier and was given another burrito. \nTook this one to go and it was close to the same result. \nShitty breakfast burrito for $8", "author": "Nate C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "Good prices. Decent food. Beer on the menu but no liquor license, which was a disappointment because beer and Mexican food go hand-in-hand. \n\nExcited to see a more authentic Mexican restaurant than the last place. I will definitely be back again!", "author": "Misty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "My coworker brought over the breakfast burrito and it was one of the best I've ever had. Perfect size, the chorizo wasn't greasy and it had the perfect amount of cheese and potatoes. Morning made; I'll definitely be back to try the rest of their food.", "author": "olivia a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "I've been coming here for months now and I gotta say that their food is amazing, and trust me, I'm very well acquainted with Mexican tacos since I'm half Mexican. From someone who as tried the 'real' tacos at Tijuana, Acapulco and Mexico City I know a good taco when I eat it.\n\n\nThey have a good range of menu items. Can be a little bit pricey but that's only if you get the meals like a burrito or quesadillas. Tacos are fair price. Favorite meat is by far the carnitas. Only a few places can make good tasty, crisp and flavorful carnitas. Props to the cook who knows how true carnitas are made.\n\nOverall I enjoy coming here every time. The cashiers are very friendly and helpful.", "author": "Thelma C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Best steak and shrimp burrito in town the staff is friendly and prices are reasonable", "author": "Tye P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "We just came back from a week in puerto Vallarta eating shrimp fajitas and molcajetes and we're looking for a place to continue our vacation. We found this place on yelp and were so happy to find it so close to home. Their molcajetes and shrimp fajita (ca marines charro) is as good as anything we had in PV!  Both were so delicious. We also had the al pastor burrito which was very good. We were surprised to find these dishes in a local taqueria. We will definitely be back.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "Okay this spot is really close to my house so I come here at least once a week and it's always so good. I've gotten the chicken jumbo burrito, carne asada tacos, crispy chicken tacos, nachos, carne asada fries, quesadilla, their breakfast burritos and they are all amazing. They have pretty big portions and the prices are reasonable. They give you free tortilla chips with your order which is nice and they have three different sauces and other things like jalapeños and radishes for free as well. The orders are always made quick, even when they are busy and it's always consistently good! Hits the spot after a night out drinking!", "author": "Tanya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Honestly some of the best burritos and quesadillas I have ever eaten came from this place. The prices aren't that bad. Can seem a little pricey than most locations. The staff is nice and they deliver your food to your table. So there's no need to stand around waiting for your food. They serve a great variety of food, drinks, & alcohol. I have experienced a couple moments where the burrito was not up to par, but I think that's on days where they get a little overwhelmed with orders.", "author": "Pj A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "To be honest I never have fully explored the menu but for what I have it is all delicious! One of my few lunch spots for work. Burritos are great, tacos are filling, Taco Salad OH MY!", "author": "Joe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "Adequate food.. Don't go here if your starving . Not a fan of thick tortilla chips nor am I a fan of liquid textured guacamole but the nachos were ok ..", "author": "Jasmine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "I was craving Mexican food while I was studying at school and Yelp Mexican restaurants near me and I spot this place. I was helped immediately and ordered an asada super burrito. It was delicious, and I really liked there guacamole on the salsa bar. Great/friendly service. I recommend this place to anyone!", "author": "Jose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Bomb bacon breakfast burrito! So good with avocado. Just moved here and this is my new breakfast spot.\nSo I'm actually updating this review... they have the best bacon breakfast burrito I've EVER had. Period. Comes with bacon, cheese, and crispy seasoned waffle fries and you gotta get avocado and add the light red mild salsa. So bomb!!", "author": "Ben N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "I love this place!! Best Mexican food outside of the Mission.  I eat here 3 times a week. Food is delicious. Salsa bar is Awesome! And it's super clean. One of my weird pet peeves is restaurants that don't clean their tables. These guys make amazing food and clean the tables almost obsessively. My dream come true! Come here! PS, eat the breakfast burrito. It has French fries in it and is crazy yum!", "author": "Peter P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Great Mexican food! Honestly there aren't a lot of great authentic Mexican places in the city so this place is a gem. My favorite things are the carne asada tacos, cali burrito, and the shrimp burrito. They also do fresh menudo and pozole on sundays if I'm not mistaken", "author": "Foxy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Super good Mexican food one of the best I have had in SF! Definitely recommend the chicken torta super good and the chips are freshly made as well as the salsa!", "author": "Gabriela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Everything about this place is authentic - the food, the interaction, and the \"community\" feel of a taqueria. I routinely go here with company, or if I'm heading out to pick up groceries at the Park Plaza or grab a cup of coffee from Spressa. This place is a gem in the Parkmarced area!\n\nOverall food experience - 4.5 stars\nCustomer experience - 5 stars\n\nI routinely get the carne asada because unlike a lot of places I've visited, they actually know how to cook a steak so it's chewy with the right seasonings. The rice is fluffy and the beans mix in really well.", "author": "Zachary S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "Told the lady at the register that I wanted no pico de gayo in my California burrito she said ok no pico. My burrito comes and its full of it. I let her know and she says I never told her. So she huffs and puffs and storms to the back to let the cook know. The cook comes up to me and says he ran out of fries for the California burritos. so then he starts pulling out the pico from my burrito with his hands. it's also dirty in the restaurant and the lady at the register has no respect for the customers.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Came in for shrimp tacos and they were excellent! The corn tortillas were fresh and the shrimps were grilled to perfection. Next time I'm\nGoing to check out the super burritos!!!", "author": "Stan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "This place is great! I had family in town and they had traveled all day and just wanted some good food and this is the place my mom found because of the good reviews. \n\nThe food was great. I had the carne asada plate and the carne asada was great. Not too spicy but tender and really well seasoned. It was cooked perfect and the sides were also good. My brother got some huge burrito and loved it and finished the whole thing. The service was very good as well, very nice and they brought our food to us. I would definitely go back here, very good Mexican food and clean and good service.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Always Amazingly Delicious... The Super Nachos are my favorite, Piled high with fresh ingredients YUM... Hats off to whoever pickles the peppers & Carrots, wow", "author": "Bryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "I love this restaurant is great! We started eating here earlier this year and continued even after becoming vegan. Pre-veganism we got chicken wet burritos. Now we get the wet burritos still but vegetarian and without cheese and sour cream. Their service is a little off sometimes because the workers sometimes speak little to no english but they are very fast when we order the food over the phone and pick it up. I highly recommend this place, they have really good food!", "author": "Arti L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-18", "description": "Taqueria Dos Charros live up to there name aka Dos Chorro. Everybody I know that has gone here gets Chorro...", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Always fresh and tasty. Vegetarian tacos are my favorite.  They also have delicious homemade flan. Fast service.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "They have a nice verity of Mexican food menu . I went there twice and I really like their food spatially they cook it front of you .", "author": "Moaid M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "Worst burrito I've had in 10 years. \nOily. Rubbery meat. Cheese was sauce. \n25 bucks for 2 burritos and a soda. \nI feel like an idiot for trying this place.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "My favorite thing about this place is that it's so convenient, affordable and satisfying! I've ordered from this place a couple times and I've never been disappointed. Everything from breakfast burritos to dinner platters have been enjoyable. This has definitely become my go-to-spot when I want good Mexican food but don't want to commute to the Mission.", "author": "Reina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-01", "description": "Typically, it does not take much to impress me, and even less when I'm starving. With that being said, I ordered a veggie burrito last night because it's REALLY hard to go wrong with that, but I was proven wrong. The cheese tasted off and the lettuce and overall burrito was really soggy. I took a couple bites out of the sheer fact I had nothing else and paid for it, but could not stomach the entire thing. Regrettably one of the worst burritos I've had. Sad day.", "author": "Clarissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I'm having a hard time finding a decent California burrito up here.  But I found one here! Huge burrito, great service, and super yummy touch with the waffle fries!", "author": "Michaela F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "In February, I moved to San Francisco and begun studiously exploring the city's tacquerias. These are the best chicken tacos I have had in SF. The corn chips however could use some improvement.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "Food good, presentation fine, prices o.k.  When we walked in, the smell was unknown?  And that's what gave them only a 3 stars. Sorry, about that, a lot of patrons while we were there too.", "author": "Chester T G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Overall experience 4 stars! :)\nCustomer service: 5 stars\nSuper friendly lady cashier! & super fast at making our order. Our order wasn't rushed, the food was warm & fully cooked\nQuality of food: 3 stars\nI felt food was mediocre as in it was just okay. Nothing special & it the carnitas were yummy, but the rest of the food was just ok and kinda bland. I had the 2item plate: one carnita enchilada & one cheese quesadilla with rice and beans", "author": "Jeanette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "My boyfriend and I wanted to try a different taqueria that had carne asada fries...and man, we were in for a treat. This place has the BEST carne asada fries I've ever tried. First of all, they don't use just regular fries. THEY USE WAFFLE FRIES. WAFFLE. FRIES. I don't know any other taqueria that does that. They had me sold on that one. I love how they perfectly drench the fries with sour cream, guacamole, etc. IT'S ALSO HELLA CHEESY! Like there's so much cheese, I love it. I would also recommend their California Burrito. They put waffle fries in it as well :)", "author": "Arianna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-02", "description": "I was doing laundry next door and decided to try this place out. The interior is pleasant with a simple to read menu. I ordered the combo platter with one chile relleno and an enchilada. The portions are pretty big here. The salsas were okay, but nothing spectacular. I didn't want more after finishing the two I had. The food itself, although nice in appearance, wasn't hot at all. I cut into the relleno and the cheese was a solidified block. No creamy gooeyness at all and the egg white shell on the outside taste as if it had been sitting it for a while. The enchilada was good, but wasn't the saving grace of the dish. Rice and beans were standard fare. The prices are a little high. Especially when you're paying for a cold chile relleno and a so-so enchilada. Next time I want Mexican, I'll go to Taqueria Cancun.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "I stumbled across this taqueria when I went with my roommate to pick up a uhaul next door. We were starving after a long day of work and decided to grab some tacos before the packing and moving commenced. We were so glad we did. \n\nThis is such a hidden gem. Hands down best tacos I've had in San Francisco. I ordered the Lengua and the Asada. The lengua is a go to taco for me. It makes or breaks my experience. Dos Charros went above and beyond my expectation. It's cooked enough where the meat is tender and you don't notice the texture of the tongue and packs a lot of flavor. \n\nSalt on the table. You know a taqueria is legit when they trust the flavor of their meat enough that they don't give you salsa to mask the taste. Great tacos should be enjoyed with salt and lime and their salsa bar is stacked with limes for that reason. Also, the radish here was distinctively good. Surprising because its just radish and it really only serves to cleanse your pallet, but it was fresh, cool, and incredibly crisp.\n\nHighly recommend this place, I was disappointed when it was already closed when I went back to return the uhaul because I was ready for round 2.", "author": "Cody M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Burritos are huge!  The last time I ate there I ordered a shrimp burrito and thought there would only be a few tiny shrimp.  The burrito had about 8 large prawns inside which were cooked perfectly and not dry. Ate here with a few coworkers and friends before going to the bar next door and we all enjoyed it.", "author": "D A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "Pretty solid little taqueria hidden in a weird, secret strip mall close to my work. Nice people, decent prices, and salsa that actually has a bite (which is becoming so rare these days, for some reason...) Their carne asada tacos have never let me down.", "author": "Joe V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "Better than expected Mexican food for a strip mall joint not in the Mission. Excellent value for SF.", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "This place is delicious! I go here way too much. I find myself craving it all the time. The prices are very reasonable for the amount of food they give. It's also right next to San Francisco State University, so it is an easy lunch/ dinner/ food craving option.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Great little place hidden in the fog of Park Merced. Any taqueria that serves lengua is the real deal in my opinion. Two taco plate with rice & beans was $7.75 and delicious. The sauce over the lengua was quite good and had a bit of a kick to it. I didn't sample anything else so no other comments. Friendly cashier, decent amount of space and reasonable parking. I'll be back to try other things!", "author": "Adrian Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Oh hey, just as I perma-blacklisted Taqueria El Jalapeno, this place opens up and it's even closer and WAY better food!\n\nThank you, burrito gods.\n\nYou'd never guess by eating the food that it was a strip mall taqueria. They also offer California burritos for all you socal students at State who are having trouble adjusting to the superior burritos found in the Bay Area. ;o)", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "Though not on the level of a good Mission taqueria, it was surprisingly good, especially for its location. Nice to have a salsa bar and I appreciate a free refill on the (diluted) agua fresca. Great chips!\n\nNo chicken in their rice, no lard in their beans or chips, so I was good to go with a veg burrito (I passed on the cheese and cream and got avocado instead).\n\nI wouldn't drive here, but will eat here occasionally when I want to eat in Parkmerced.", "author": "Veg V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-21", "description": "had a horrible experience with the casher lady. She was glued on her phone and made me wait for the receipt while she's busy texting. I had to ask again to get her attention after signing for the credit card transaction. And she charged me extra for 2 out of my 3 orders. When I asked about the different price being charged compare to their menu, she only refunded me part of the extra being charged (not including the extra tax i was charged). When I asked about the other order that I was charged extra, she was impatient and her excuse was that the menu is not updated...... I gave 2 stars instead of 1 since the food was okay. My suggestion: always ask for ur receipt and verify it with their menu.", "author": "Ken S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "3 1/2\nA lot of variety. Some dishes are bomb like the molcajete, huaraches and super quesadillas among others. The only problem is that the tortillas, tacos and burritos suck. I eat here all the time and everything is decent. Not the best Mexican food place. Some dishes deserve a 5 and others 3 . Overall I'd rate it 3 1/2", "author": "Nati R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "Food is excellent and service is really good, one of my favorite is the ceviche tostada", "author": "Salvador G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I see this place each time I visit SFSU. Finally dropped in and had the al pastor taco and plate. Excellent! I will come back.", "author": "Oscar C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "I use to love this place. As a mexican I can confirm this place is legit. However, I haven't been back seeing as I got sick twice (after the first time I decided, hey whatever this stuff happens, gave it another chance and nope...). My husband has been sick as well. I don't think I'll be back again sadly.", "author": "Rocio R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-06", "description": "Everything was going so well from the moment we set foot in this place. There were about 2 people eating when we went in. Guy at the cashier was nice. Ordered our burrito and it came about 5 mins after it was ordered. We tried their different sauces which were all good on its own. I was excited to try their burrito due to the good reviews on yelp. The carne asada was tender, the pico de gallo was fresh. I enjoyed each bite until I felt a string as I take my 4th bite. I looked at my burrito and found a hair dangling. I stopped chewing and we called the cashier guy that took our order. I pointed at my burrito. He watched as I pulled out a string of hair out of my burrito. He didnt know what to do for a second. Calmly, He told me nobody has long hair. I told him, you just saw me pull that out of the burrito. He then asked me if I want them to make a new one. At this point I just lost my apetite. I was enjoying my burrito until I found that hair. I said no.  He asked if I wanted to see a manager. I said, yes. He started talking to a guy behind us in Spanish. I don't understand Spanish fluently but I do understand a little. From what I made out of the conversation, the manager didnt seem to believe that there was hair. Claiming nobody has long hair. And the cashier guy told him that we just pulled it out right in front of him. Cashier guy came back to our table, told us he can make me a new one again or just give my money back. I nodded to the latter one. He came back with the money and apologized again and left. I took a picture of the hair and then we left. The manager never went to our table to even apologize. Maybe the food is really good here, the cashier guy did his job and treated us fairly from beginning to end, but to hear the manager talk about you as you are leaving and not even show his face for an apology was absolutely unacceptable. 2 stars for the cashier guy.", "author": "Jerick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Extremely good carne asada breakfast burrito. Reasonably priced. Pretty good salsa bar. Go here before it gets too popular.", "author": "Ray B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Good food, I like salsa is always fresh , perfect portions and friendly service!", "author": "Sonia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "This place is great,the fact that this is a  family owned restaurant from Mexico, makes it so much better. Every plate dish I have order has been delicious!! The staff is so friendly and the place is clean :) the tacos are my favorite yet you can never go wrong with the molcajete, a little bit of everything. If your in a hurry your order will be ready super quick!!! If you ever find yourself around this place go in and enjoy a nice michelada ;)", "author": "Abril A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Randomly went after SFSU graduation and all 10 ppl had great lunches! Quick service too. Recommend trying it!", "author": "Ruth N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "solid burrito place with a tightly wrapped and filling burrito, a decent selection of salsa/sauces to go with the burrito and the free chips", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "I live around the area and out of all of the places to go this is the best. Their carnitas is especially good AND THEY HAVE TONGUE!!! OMFG YES!!!! It's not as good as the lengua/cebeza tacos I can get in San Jose, but it's pretty damn close. Their go to for me is the wet burrito and the waffle fries. they're always fast and totally worth the walk from SF state if you want Mexican food (way better than the taqueria on campus).", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "More than just burritos!\nWhoever thought that a fantastic Mexican restaurant would be in a strip mall hidden on the edge of the Park Merced apartments. But Taqueria Dos Charros is fantabulous!.  I've lived all over the southwest and tried Mexican food from Austin to Taos to Tucson and this really one of the best I've ever had. To call it a \"taqueria\" is a bit of disservice; the menu is large and varied, they make 3 fresh salsas daily and also have beers and aquas frescas. The fish tacos and tostada de ceviche are really good but so are the carnitas and the carne asada. My wife is Latina and picky and she loves everything here; last time she got the lengua (beef tongue) which is hard to find. But truly everything on the menu is good. This place is family owned and run by a very sweet family from Jalisco and everything is made with loving care.  It's hard to imagine they will stay in this location once the word gets out.  Check it out!", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "This place is legit!  Not a lot of taquerias in the area so I was stoked when they opened. Everything I've had so far has been fab, but I have to give a shoutout to the huaraches. Really it's one huarache but it was bigger than my head- and I have a giant noggin. Amazeballs!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "California Burrito! fuxk with it; best i ever had and that's coming from a so cal bean bag.", "author": "Raul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Most authentic Mexican food near me. Its like home away from home food. The best breakfast burritos and super nachos --my husband and I eat here once or twice a week. Sooooo good!!!!!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "This place was really good. I wasn't expecting it to be that good because it looks like a typical Mexican food place but it was bomb. The burrito with steak was really good and their salsa was really good too", "author": "Raphaela V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "My loving son brought home a surprise Valentine's Day meal for me, a Nacho con Carne from the local Taqueria Dos Charros. How thoughtful. It had salsa, sour cream,  guacamole, melted cheese, black bean, over tortilla chips. One of my favorite munches.  I took my sister there last week when we were out shopping and she enjoyed her Super Burrito and also enjoyed that it was not as noisy or over crowded as the food court in Stonestown Galleria. Friendly staff, good food, portions, prices, & close to home. Can't beat that combination.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "I'm one to go out in The Mission or Excelsior for tacos, but this place is REALLY good!  The chorizo is definately worth trying. This place is quickly becoming a staple for the nights I don't get home in time to cook.", "author": "Nichole F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-31", "description": "Average Mexican dishes, they have a variety of burritos, tacos, soups, etc. It's a little pricey but if your craving some Mexican food this will do. Horchata is also available! & they are open late!", "author": "Lola M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-02", "description": "First I am from San Diego California and I know taco shops. The food is very mediocre. Their carne asada fries are not real carne asada fries they're more like waffle fries their burritos are over priced. And there service is a 2 star.", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "This place is brand new here at parkmerced and so far so good! Love this place very yummy hope they keep their food consistent and being a college student I can't complain on the prices your get good food for a good price just hope they don't start over pricing like the other place that was there before and hope keep their food yummy!!!", "author": "Evelyn Sophia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-16", "description": "There food quality has drastically increased since the last time I came here, and the service is very nice. I find myself coming here more and more since the food got better, still needs some work but at least it's improved", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "I'm not sure why there are such low ratings. But I am so excited that there is another taqueria in my neighborhood! Before all I had was Burrito Express, or Jalepenos. Now I have another option, and IT WAS SO DELICIOUS. I got the Jumbo Burrito, I was hesitant at first, but it was delicious, HUGE, filling, and very satisfying. The carne asada was grilled to perfection, the avocados were perfectly ripe, and the burrito was piping hot and enormous. I will totally come here again, and again, and again. So happy to have found this place. They deserve way more stars. Well done.", "author": "Rachael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "Quick, straightforward, authentic, and delicious. What more could you want from a neighborhood Mexican restaurant?", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "First time trying this taqueria cuz it was close by and I didn't feel like driving to the Excelsior for El Farolito which is my go-to place for quick Mexican. Since I live in Parkside my only other option was El Burrito Express...hell nah...ewww! Tonight I took a gamble and came out winning! #1 The lady at the counter was very friendly #2 my super carnitas burrito was delish #3 their homemade chips were hella bomb #4 their salsa Verde was thick and on point! There were Hella chunks of carnitas and a nice balance of the fixings. The only thing was my son had plain al pastor tacos and they could've added more meat since it was a plain order. He says they were good but prefers Farolitos al pastor. Another thing is there was a half a bay leaf in my burrito but hey I'm not mad cuz it means this place is authentic and legit. I will definitely be back again.", "author": "Mona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "I sometimes work at the apartments at Park Merced so i occasionally eat here. These are very good burritos. The meat is always cooked right and rice and beans are exceptional. Since i have a short lunch i always phone my order in ahead and its usually ready within 5-10 mins. Great place since the new ownership opened up!!", "author": "Ed T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-04", "description": "This place has gotten much better in the past year. It's like the food has more juicy taste in it, especially the breakfast burritos", "author": "Kristen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Good food, great prices.  I highly recommend this place for a great lunch or dinner.  It is not fancy, but it does have good food!", "author": "Herb B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-24", "description": "Terrible, enchilada was really small, and their beans were gross, rice was pretty bland, honestly everything was bland. And to top it off I had a terrible upset stomache the next day, do yourself a favor and don't go here.", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Let me start this off by saying that I hardly ever write reviews, but this place is great. The service is always friendly, warm and welcoming. The food, well priced, huge quantities and I personally love the filete de pescado (fish) it is a lightly breaded then fried piece of tilapia I believe, covered in this amazingly well spiced orange sauce. The place comes with a slice of orange. It's wonderfully spiced and something that I have not seen at other joints that sell mexican food. The burritos here are huge, and well priced at that. A jumbo burrito is 9 bucks, the great thing is that they do not charge two dollars for guacamole, like other places. This may be off the beaten path, but if your looking for good restaurants, with a casual clean dine in, amazing food, this is the place.", "author": "Hanna Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-10", "description": "Soo expensive for mediocre food. I miss the old establishment be that used to  here. Taco libre", "author": "Brian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "lets just say when you eat this..you look fcken cool! xoxoxo", "author": "Zeo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Finally! A decent taqueria on this side of town! This place is easily as good as many in the Mission. My go to is the carnitas burrito with black beans. Delicious! The house made salsa are fantastic as well. While I have my \"go to\" spots for Mexican food, this place is a welcome addition closer to my home.", "author": "Brad D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "This place is awesome. Finally a mission style taqueria in my hood! I'm a burrito snob. I want a good tortilla, quality meat and a nice distribution of ingredients throughout the burrito. I ordered a prawn super burrito and it was awesome. I can't believe how many shrimp were in the burrito and they were cooked perfectly (not over cooked like many places tend to do). Chips were great too. Husband got a carne asada super burrito and his was legit too.", "author": "Brooke G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-07", "description": "I decided to try 3 different tacos, I ordered the carne asada, al pastor, and the veggie (comes with beans, rice, lettuce, guacamole, sour cream).  I enjoyed the carne asada taco, it was pretty standard.  The veggie taco was pretty stuffed so I ate the toppings off the tortilla, it was kinda like of a mini burrito bowl.  I did not like the al pastor taco, the pork had a different taste to it, and I did not like it.  Also, the chips they provide are very hard as if they were made very early in the morning or even the day before.  This place is pretty standard mexican fast food.  All in all, the food was an affordable price, I recommend the carne asada tacos with the green salsa.", "author": "Linda C."}
