{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "Keep in mind, I'm from Texas so my review will be bias.\nPer taco the cost is $3.50\n    This explains why the tacos are larger than the ones at home. They really pack in the meat.\nEach taco they add their salsa on top, and it's spicy \nI did not notice it was mentioned on their menu board, so FYI\n     Places I've been to they leave that up to the customer to add. Also this place only had one option for sauce Red. Other spots offer red and green sauce (salsa).\nService was awesome!! \n    Would come back!", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Very good. Staff was exceptionally friendly. We got lengua, al pastor, and fajita tacos. The meat was fresh, seasoned well, hot and delicious. Agua Frescas were great, horchata and pina. Priced very well. Great spot!!!", "author": "Monica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "4 stars for yummy Mexican food at worth-it prices. (Still doesn't come anywhere close to San Diego's Mexican food, but it's good for SF!)\n\nI've tried the fish tacos, al pastor tacos, and al pastor regular burrito - all were decently flavorful and in good portion sizes. If you eat there, you can scoop on as much of their salsa as you want from the little containers. I wish the fish wasn't chopped into small pieces, as I prefer fish tacos with whole pieces of fish, but they were nicely grilled and quite aromatic.\n\nThe chips that come with the tacos/burritos are possibly my favorite thing here yet! So fresh and oh so crunchy. I couldn't stop eating them even though I was pretty full already. If you get take out, you'll get a small container of guac and another of salsa to go with the chips as well.\n\nThe people here are also pretty nice. It's super close to the SF General Hospital, so I saw quite a few people dressed in their hospital uniforms drop by to grab some food, and several of them were greeted by name or at least with an extremely friendly hello.\n\nRestroom is quite clean; open to customers only.\n\nLooking forward to coming back and trying more of their food!", "author": "Ivonnie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Real Mission Taqueria.  Not hipster, not fake.  Burritos weigh several pounds, I think.   We both noticed that the tortilla was special, and who ever noticed the tortilla?  I had a regular chorizo burrito and tamarind agua fresca, and loved them.  Chorizo was SO good.  My partner loved her chicken with avocado burrito too, and we have leftovers for lunch.  Chips and salsa fresca (a little hot for my other) were bonus. (Note: cash only when we went.)", "author": "Mary V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "As a vegetarian, I look for flavorful Mexican food. :p\n\nI ordered a veg taco. It hit the spot. The cheese is melty at the bottom and there's flavor to their pico that they put in the taco. Beans and rice were well done. Good amount of avocado on my taco too.\n\nThe pico and green chili salsa are different than other taquerias because they have a flavor zing to them, the pico is tangy and there's some spice in the green chili salsa that is different and wonderful, couldn't pick up on what it was though.\n\nI know meat eaters go to taquerias for the flavored meat, so I can't report on that unfortunately, but as a veg, we can't be having bland ass tacos and burritos, and the tacos here ain't that. \n\nI wanted to go for the mojado (wet) burrito, but I'll try that next time and update y'all.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "My new favorite burrito joint. I love Taqueria Cancun but it's been closed for a while, and we've been trying other options. Both my\ncarne asada burrito and my husband's with al pastor were killer. They get the char on the tortilla that makes it extra great. We went at dinner time on a weekday and there was no line. We will be back!", "author": "Alison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "Not really sure why or how this place is rated so well. I came here during my last visit to SF as I wanted to have a great burrito while in town. This was really basic and underwhelming. I've enjoyed burritos from Chipotle more than the one I had here. I came with my family, my parents who are vegetarian got the super veggie burrito, which they said was just ok. My brother and I split a chorizo mojado burrito. The flavors were surprisingly weak. We also got the nachos to split and the cheese was that bright yellow nacho sauce you can get at the movie theater. At least use real cheese. All around heavily disappointing.", "author": "Naina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "The super pastor burrito is amazing! Tried it one night when I was muey burracho and it was good. I re tried with a sober palette and was pleasantly surprised  bomb.com", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "This place is awesome!\nThey serve real man portions of food and it's all delicious!\nTry the nachos with meat. They won't disappoint. Best $14 ever spent.\nI also tried a chicken Mojado burrito. It was very good. They are generous with their portions. Alot of avocado and cheese on everything. The sauces are delicious and they include a home made pick de gallo and chile.\nOverall this place is great. \nCash only.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "\"wait, why are we coming here when farolito is down the street?\"\n\nI'll tell you why. Because this place has toppled farolito from its hallowed place in my heart. Because here the meat is fresher, the portions are bigger, the line is shorter. \n\nIn fact, my super burrito was SO delicious that I immediately went back in line wanting a second tripas burrito. Alas, they had run out of tripas and cabeza by then- a sign that they actually keep track of ingredients and things are made fresh. \n\nEverything just goes together better for completely comparable prices - but without so much of the insane line. My new favorite burrito place.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "This is my favorite Taqueria in the city! It is sometimes better than others but when it is good it is the best. We generally get carne asada or carnitas burritos and both meet is flavorful and fresh. \n\nThe service is also great. The gentlemen that work there are super friendly always.\n\nOnly takes cash however!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "This place is cheap and nice, they have some very good options but sometimes the food doesn't taste great. Love their veggie burritos and tacos though", "author": "Celeste G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Solid burritos. It's your typical mission hole in the wall burrito place. The tacos are packed with meat. I was wondering why I was getting charged 3 dollars for a taco in the mission but it was like two tacos as one. Cash only.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "No bueno.\nDisappointment on a plate. I had the fish taco, an al pastor taco, and a lengua taco.\n\nThe fish tasted funny. Like, really funny. I'll update here if I get sick. Sadly, it also wasn't the delicious fried kind of fish in that burrito.. it was just chopped up, mushy fish that was cooked on the griddle like any other meat.\n\nThe al pastor was okay....\n\nThe lengua, though generous with the portions and tender, absolutely lacked flavor. There was no taste of any salt or any other seasoning to speak of...", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "They use their bare hands, like he scooped the salsa up and patted it down into the taco. I dont even touch my own food like that. Sorry but no", "author": "Rissa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Pretty good burritos. Nothing fancy. The burritos can be good or just OK depending on which staff makes them. Timely and affordable. Cash only tho.", "author": "Tim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "This is a great Taqueria. Food is excellent for the price point. It's clean. It's authentic. The people behind the counter were friendly, polite, and helpful. You can tell they care about their restaurant and take pride in it.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "This place!!! Everything was perfect. The murals in the building and surrounding area, the aroma, the sounds of spatulas \"tink tink\" on the side of the grill, the smell of onions and garlic. The cilantro and Meat juices- the cheese a d avocado. The pictures I submitted for this review were sent over two years ago, but I still remember how I felt when I walked into this location. They met me where I was and took me on the journey steps further! Did you see my photo's? How the Queso in the burrito was evenly dispersed? How it stretched from one side of the bitten burrito to the other waiting to be consumed again from the second bite. Putting your mouth on something to digest is very intimate in so many ways. And the expected ambrosia of flavors that are combined with the way you chew are all apart of the bigger picture. Sitting in this restaurant in the heart of the mission district was eclectic. Do yourself a favor. Bookmark this spot and visit on a monthly bases if that works within your budget. Wash is all down with an ice cold brew  and relax with them trance of bliss that your minds eye will thank you for later.", "author": "Nate C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I returned! Got two tacos: one al pastor and one chorizo. The chorizo was a greasy mess, but WOW was it amazing!! I also got the horchata, which was the first horchata I've ever had. It was sweet, milky, and had cinnamon in it. Very good. I imagine it would also be a tasty treat to warm you up if you heated it, but I'm not sure if that's how it's meant to be enjoyed. I definitely imagine coming back here. I still really want to try the sesos, lengua, or cabeza; but you have to get there early for those!", "author": "Jen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Perfect little hole in the wall Mexican joint. I've noticed during our visits that the more local we get and less recommendations we take from touristy areas, the better and CHEAPER the restaurants.", "author": "Aubrey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Satisfied my craving for a tongue burrito.  Service was fast.  Sauces were good, I wished there were more.  There was a lot of testosterone in that place, mainly working, burly men!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "My favorite taqueria in SF! I've been coming here for more than 10 years! Delicious food.", "author": "Jsjeejjwwj W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-28", "description": "Not bad. A bit like a cross between Cancun and El Farolito yet not as good a either. A bit bland.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "$14 for a legit set up of beer chips spicy salsa burrito and tip.  Salsa is actually pretty spicy and has a nice kick to it.  I have been used to seeing either salsa bars or places giving you small cups of salsa but Taqueria actually gives you a jar of salsa.  Such trust that this establishment has and as a huge salsa fiend, I was careful not to breach this trust and go ham on their amazing salsa.\n\nMojado burrito is a super burrito on bath salt.  Bath salt makes thing ridiculous and this really makes the burrito insane.  Sauce all over the burrito. Cheese melted on top.  Salsa and guacamole and onions in small islands as they fight for dear life.  My lord this is a good mission style burrito.  I have been looking for you and I definitely found it.\n\nSo not only is your burrito covered in this amazing sauce and cheese, the inside has layers of delicious meat, beans, and rice.  \n\nReally amazing burrito and if you want a true mission style burrito without breaking your bank, this is your place to go.\n\n5/5", "author": "Gary K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "I've been coming to this little taqueria since 1995?1996? (it was Kindergarten for me and I'm now 25) and I love them. They haven't changed or lost their flavor.\n\nBasically, when I want a torta, a burrito, a quesedilla, or chorizo.. from anywhere else, I base the quality of others to their standards and all have fallen short.", "author": "Terinna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "The best and most intriguing taqueria on 24th st. The burritos are inconsistent, but when they're good, wow. On their off days, they're still tasty, but they can taste a little bland. Maybe too much sour cream. They're always better than El Farolito though.\n\nThe people who work there are very nice as well. Always happy to provide extra salsa when you ask. They will know this place in Japan for sure (check out the decor to figure out what this means).\n\nI'm a vegetarian, so for all the bloodmouths out there, your mileage may vary. My carnivorous friends like the burritos too, though.", "author": "Henry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "I've walked by this place numerous time, but I never had a chance to pop in. I was on my lunch break, and wanted to find something close by that was quick, and delicious. I found all of that here! I ordered a veggie taco. I was more than pleased. There was a generous helping of ingredients, including avacado! The veggie taco was only $3, wow. Other places charge you about $1.50 or $2 more for the same meal. You also get your own personal pico de gallo for your table. Super tasty and spicy. The staff was friendly and attentive, even bringing me utensils and napkins, although it's self serve. I look forward to coming back and trying their veggie tamales!", "author": "Alicia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "It is what it looks like: a no frills mission taqueria. They reliably produce good burritos and have amicable staff. I give it five out of five because it is always exactly what I want and need it to be.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Was so pleasantly surprised by this place last night. My boyfriend loves this place because they apparently have great lengua, but as a vegetarian, I'm usually stuck with a mediocre veggie taco at most taquerias. Not so here! The veggie taco was really flavorful for being so basic - everything was fresh and tasty but I think what really made it was the salsa on top. It was perfectly spicy without overwhelming the rest of the taco. Best part - it was overflowing, so there were plenty of beans and avocado to scoop up with tortilla chips.", "author": "Dede G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "I love this place! I will go here every chance I get. This is oneof my favorite lunch places. Super quesadilla is my goto... Their Pico de gallo is on point and the guys behind the counter put it down. This place is amazing.", "author": "David F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "The burrito I got was very big, but the meat was burnt, so it didn't taste good. There also wasn't a lot of variety of ingredients in the burrito.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Always feel at home here.... the staff is always friendly....My favorite taqueria hands down.  Must haves: Super Chicken quesadilla and Super grilled chicken tacos.  Their to die for!  La mejor taqueria de SF.", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-25", "description": "Ordered a carne asada super burrito with refried beans. Got a carnitas super burrito with pinto beans. Dafaq..", "author": "Oliver F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "This place is gross don't go here. Jk, it's really really good, but still, please don't go here.", "author": "Julian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Having worked and lived in the Mission for a few years, I've crushed more than my fair share of burritos at different establishments and throughout the process have thrown loser burritos to the wayside where dances were performed on top of their yucky burrito's bones while also celebrating the recurring deliciousness that breeds from championship burrito talent. While victory parades and marching bands might only scratch the lower levels of respect a true burrito connoisseur deserves, Taqueria San Francisco's al Pastor burrito supreme is so far above that basic level of respect where we're going to invent a new level of respect for this burrito. \n\nTHE BURRITO- The second your mouth touches the tortilla, your lips will learn what a real 'first kiss,' feels like. It's not some weak kiss you might get after a middle school dance, this tortilla asks you how you like it and realizing that you have no idea how you like it, will come on all flaky, soft, strong, yet vulnerable- everything you and your burrito both need. \n\nTHE MEATS- oh the meats! The al pastor meat at Taqueria San Francisco is hands down the best al pastor meat in the Mission- THERE- I SAID IT! the secret is out. At this point, you're probably going to assume that with the best al Pastor meat available, the burrito just must skimp on the quantity of meat and put in more rice, but that's where I'll call you a tulip eating, tire licking good for nothing person that's terrible at assumptions. The TRUTH is that these burritos receive a super serving of meats to make sure everyone from little babies to big macho body builders receive all the important protein they need for their growing bodies. \n\nSALSAS- you can never go wrong with a salsa that dances on your tongue while wearing miniature salsa sized shoes to make sure all of the flavors are delivered to your palette. Try all the salsas if you dare. ;)\n\nTHE BURRITO ROLL- Anyone can put items on top of a tortilla and try to roll it- thankfully laws have been passed to prevent those inexperienced people from ever attempting that again. At Taqueria San Francisco, the guys making these burritos must have been born on a separate planet, like Superman and Krypton. This is the only explanation for how they managed to get so many incredible individual aspects of the best burrito ever, into one tortilla. Once you start eating your burrito, you wont need to worry about the last few bites embarrassingly falling apart all over you because this is a Taqueria San Francisco burrito- it'll stay together until It's ALL GONE!!!!\n\nOther burrito places rely on hype and newspapers which can be...influenced to select the best burritos in the city. Taqueria San Francisco doesn't make burritos for Millionaires and Billionaires- they make burritos for everyday good honest people who just want to eat the best goddamn burrito of their life. \n\nIf you've gotten to this part of the review, you're in luck there's one more piece of advice........stop reading reviews and eat that goddamn burrito!!\n\nFinally- the appropriate level of respect for a Taqueria San Francisco al Pastor burrito can only be realized with the awarding of a Taqueria San Francisco al Pastor burrito!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Forget all the others! This is the one! 6 stars! This is the top secret not so secret best burrito in the mission. If you dare get off the touron (that's tourist-moron) path of status quo taquerias and try the REAL DEAL then you won't be disappointed. This will change your life.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "Gross... I understand prices are high but you don't have to put a whole raw onion, chopped it up , put it in a tortilla and call it a burrito. My burrito was so full of onions I wasn't able to eat it, I took 2 bites and had to throw it away. The onions were over powering , and bitter. I like a little pico de gallo on my burrito, don't get me wrong, but this was just gross, never coming back", "author": "Karen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-21", "description": "$7.50 for a regular burrito? $5.00 for a tostada? $12.00 for nachos? \n\nAre you kidding me? \nWho do you think you are Taqueria San Francisco? La Taqueria on Mission street? (which is also garbage) Are you trying to emulate them? Are you trying to get over while the gettin' is good? Jack the prices, lower the quality and increase the profit margins! Good times all the way around! \"Surge pricing\" while the techies are here? \n\n2 carne asada tostadas, some bogus nachos covered in Velveeta cheese (no exaggeration) and 2 horchatas for $28.00??? WOW! Straight robbery. \n\nIf you're going to charge me this much I expect the meat to be lean and without big globs of fat and without grissle. Screw that noise! And the chips are straight Costco! \n\nToo many other good Taqueria's in the Mission District for me to ever visit this place again.", "author": "Vic F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "When first moving to the Mission 2+ years ago, I put out the word that I needed knowledge of at least five decent to great taquerias that would satisfy my constant and unquenchable need for Mexican food. Mexi food has been a staple in my diet since I discovered that my young and very picky pallet enjoyed very spicy food and the option of only refried beans from my hometown favorite burrito place, Guerrero's (http://www.yelp.com/biz/guerreros-taqueria-pacifica?q=crystal). \n\nAs I grew and matured, I discovered that tortilla chips with cheese, meat, guac, and pickled jalapeños was also delicious. Then I started to crave sour cream. Then I wanted Pico de Gallo. Then carne asada. You get the idea. Who knows when these changes occur. Likely a combination of wanting to taste certain flavors and also mooching off all my friend's food and then wanting what they got.\n\nTaqueria San Francisco was recommended to me by several people but I could never find it. In my greener days I didn't realize how many awesome restaurants existed on the Potrero-heading direction of 24th St (St. Francis, Sushi Bistro, etc). So one fine SF afternoon I was picking up my newly repaired bike from Valencia Cyclery and giving it a test drive around the Mission all while cruising for some new-to-me Mexican food. \n\nEureka! There was SF Taq! So I parked my bike in front, wandered in, and ordered up a Super Carne Asada Burrito and chips and salsa and guac and ate it in the shop, which was a good choice given my tummy rumblings. Everything is prepared in front of you and with the perfect amounts of each ingredient in the burrito, also very reasonably priced and NO UP CHARGES FOR BEANS *cough La Taqueria cough*!\n\nI've been back a couple times since, getting the Super Nachos which are just okay, nothing special and they use the nacho sauce from a can (why you do dis?). \n\nMoral of this story is, just stick to the burrito. You won't be sorry.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "This was the first dinner I had coming to San Francisco, and it was just one minute from where I stayed, but after a month in California I would say that this was the best Mexican I ate during my travels. Awesome vegetarian burrito! No hussle when I asked to bring my leftovers home in a box.", "author": "Gustav H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "I love this place.  We live in the area, and I am not ashamed I usually average at least 2 burritos a week.  Surprised this place doesn't come up more often in the conversations for best burritos around.  The meat is awesome, the size is great, and its a totally fair price.  Not sure why the lines aren't usually longer its just a really great spot.  \n\nI'll still do el farolito every once in a while, but taqueria San Francisco has stolen me 70% of the time.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "I've Lived in San Francisco for over 10 years and have had every burrito in the Mission.  The super burrito here is the freshest, cleanest, and tastiest I have ever tasted (grilled chick super).   We go here at least once a week and every time it's perfectly consistent.  And their pico de gallo salsa, precisely diced is legendary-- so fresh and flavorful and served generously in full jar that will disappear at your table.\n\n Yes, some people won't like this place because it doesn't have the fanfare of other taquerias and as far as frills, has none, but their burritos are the best in San Francisco.  Also, this is a family run spot with 3 generations oftentimes in the kitchen.  Some of the friendliest guys anywhere. And, it should be mentioned they have a pretty impressive collection of old school panoramic photos of San Francisco.   \n\nIf you're ever on the far side of 24th street or want to pilgrimage to burrito heaven, get a move on to Taqueria San Francisco.", "author": "Nicholas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Ended up going here not even knowing it existed.  Was going to eat at the tamale place across the street and our friend was about to go up and DJ at Pops in 15 mins.  So he told us to try out Taqueria SF.  I have to say this is a legit taqueria.  They only take cash.  You get large fresh portions of food.  Mmmmm", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "One word: Guacamole.\n\nThis avocado-based salsa just doesn't get much recognition these days. Well Taqueria San Francisco seems to have perfected the recipe. \n\nOne way to describe it is that the avocados must be harvested from the high altitudes of the Sierra Madre mountains by one-armed monks, blessed by the ancient shamans and fed to the Aztec goddess Xilonen who then regurgitates it and sends loads of it to TSF through some divine channel. It's THAT good.\n\nThat probably explains why they give you so little of it in a tiny container when you order a burrito and chips. They are imparting heaven's secret to the world one tiny container at a time. Ask for an extra serving but expect to pay 25 cents for it. I don't mind. I would pay top dollar for jars of that divine sauce.\n\nAs for the burrito, it's all about ratio. The meat flavor has plenty to do with it, but the ratio is also an important factor in judging a good burrito. In that regard, TSF has once again exceeded expectations. Many taquerias will either fill your burrito with too much rice, or too much meat or too much in between. TSF has figured out the perfect balance. And it's not as hefty as, say, El Farolito's burrito (which is a great burrito) but it will still fill you up. It's actually just right. My Asian tummy can only take so much rice and beans.\n\nThe staff is always good to me.  I'm always greeted with smiles when I come to pick up my to-go order. It doesn't get very packed too so you get your order pretty quickly. \n\nThe guacamole really put this place on the map for me but everything else about TSF is a step above the other neighboring taquerias IMHO. Living in the mission has somewhat turned me into a taqueria snob so trust me, I know what I'm talking about. :P\n\n4.6 stars", "author": "Angelo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "had a super quesadilla suiza which was almost as gross as they're attitude but not as bad. first let's start with the food it was gross I was hungry I ate half my daughter was suppose to eat the other half. she toke one bite and refuse. the chicken was blah no seasoning no nothing it was flavorless. the guy that time my order was rude and didn't want to serve me at all I noticed he was a lot friendlier to the Latino couple that came in after me and the Latino elderly man after them. i don't understand people like this if u don't want to serve a \"certain kind of person\" don't open a restaurant.THIS IS THE SECOND TIME AN INCIDENT LIKE THIS HAPPENED IN THE MISSION. I had a kid with me at least be a little friendly. this was my first and last time coming to this over priced place", "author": "Sarai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Ever since I've moved to the Bay Area, I've been on a hunt for a good taco shop. I don't need the frills and fancy margs - just some quality meat and tortillas.\n\nAnd let me tell you, Taqueria San Francisco hit the spot and satisfied my inner-LA girl-late-night-taco-truck cravings! Not to mention their portions are HUGE. The amount of meat for one taco easily amounts to two tacos are many other spots in the area. Free chips if you eat there, and their salsa? Fresh, spicy, and on point.", "author": "Breanne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Al pastor super burrito with black beans is all I ever get here. It is darn good. Not the best I have had in my life, BUT I live close and I eat this burrito once a week and it makes me happy. They are usually quick and their burritos are cheap. Cash only. \n\nGF gets vegetarian burrito and it is her favorite one. That being said she only likes rice, beans, cheese, and guac in her burritos (snooze fest).", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Love this place. I get something to eat here every time I wash my clothes (laundry place right in front of the taqueria). The súper nachos are bomb and they have this deal before 5pm or after 5pm (can't remember) where they give you a free agua with your order! Very small place that is never too busy which is what I like. Never a long line or wait for your food.", "author": "Oscar T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "The real deal--great food, great prices, and great service!  And check out the amazing mural on the side of the building.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "The real Best burritos in the Mission! My all time favorite half chicken half shrimp super burrito! Everything's pretty damn good tho", "author": "Lorena V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Visited SF from the east coast and stayed in the mission - this was our first and best meal. Super tacos were to die for, I loved them and couldn't find anything wrong. My boyfriend got a burrito and was very pleased at the taste and portion for the price. Highly recommend!", "author": "Amber H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "I've lived in the neighborhood my whole life and this taqueria is always my go to. I try to go at least once a week. This is the ONLY place I'll get a burrito from. Even if I moved across town I'd still hype it down here for their bomb ass food. Burritos, tacos, quesadillas, nachos it's all good here and the men working are always nice and friendly. People complain about their prices, which did go up, but what do you expect? It costs a lot of money to be located anywhere in SF ESPECIALLY the mission. GENTRIFICATION at its finest.\n\nP.S -CASH ONLY but they do have an ATM at the liquor store next door :)", "author": "Mia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "I eat here about every 2 weeks and always walk away satisfied and very happy. The veggie tacos are the best I've had in SF. You receive complimentary chips when you eat in. Every person I've brought with me has come back again. The guys working behind the counter are incredibly nice and friendly. The price is affordable, and it's never crowded.", "author": "Megan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "I got the torta that was made pretty well but I was not a fan of the chicken that they used. It lacked flavor. Perhaps the next time I try another meat instead.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "My favorite place to get a burrito in the city. The salsa is to die for. Try the normal \"mission burrito\" and then come here to have something real and good.", "author": "Drex D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Ok this is the place to have a cold beer and tacos food is delicious staff is nice I recommend this placev", "author": "Remysbarbie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "5 star Mission burrito that is very underrated/unknown. Tortilla was perfectly heated to a very slight crisp. A+ Composition and ingredient mix. Avocado was excellent. Cheese was very nicely melted. Size was good too.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "El Farolito and Cancún rightfully deserve props for their burritos but I feel like this modest taqueria always got overlooked. When I lived in that part of the neighborhood this was my go-to taqueria along with Taqueria Vallarta. The sauces were solid to excellent and their burritos--even vegetarian ones--were filling with their chips. Their crew was always welcoming and the vibe was always chill. Now that I'm an ex-Barrio-Mission pat, I miss this place. It's one of the few joints in the neighborhood I can say that about.", "author": "Juan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Working in the mission area in San Francisco I have a lot of options for taquerias. I have to say this is the best of all of them. The food always taste so fresh and my favorite part is their salsa! It tastes SO GOOD. My only set back is that they are cash only, cuz I would definitely come here more often if they accepted card, but believe me most times that I do have cash on me I defiantly opt for this place.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Incredibly fresh and delicious! Inexpensive for the quality of the food. The salsa was the perfect combination of spicy and chunky. Chips were not greasy and very crisp! Staff was very friendly. The kitchen was open facing the restaurant.", "author": "Diamond C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "Don't confuse this with that other place. You know, that overrated place located about ten blocks away? This, ladies and gents, is my go-to joint for a super vegetarian burrito. I can't believe that I'm sharing this place with you. I don't even know you and now you know one of the best kept secrets in the City. This isn't a big hipster spot. You'll find at least one person in scrubs and one person freshly discharged from the General either loitering on the sidewalk or inside ordering food. The guy at the counter is super friendly. He can look a bit intimidating at first, with all those tattoos, but he's nice. He always gives my sister and me extra guacamole. \n\nOh, and the burritos are hella good! They're hella big and the cheese is hella, hella delicious. Please don't come here. I want this place all to myself.", "author": "Misfit M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "Nice people prepare your hefty delicious burrito. Fresh ingredients at a fair price. Simple setting but they have a tv.", "author": "Lhm M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "So, I've decided to embark on the true San Francisco pilgrimage: the search for the best super burrito. Sure, there are a handful of go-to places in my own neighborhood, but I'm starting to tire of them. Also, I have to wonder, is there a better burrito out there? First up Taqueria San Francisco.\n\nOverall, this place is legit. Their burrito is very solid. I was particularly impressed with the construction of the burrito and perfectly toasted tortilla. I had a super carne asada burrito. Great meat, very satisfying. Definitely big and filling, and at $8 its a good value, inline with other burritos out there. \n\nSo, the down sides are this: no black beans (my preference) and they put avocado instead of guacamole. This later part is a real shame a I ordered some guac and chips on the side and their house guac is REALLY good. Spicy in a good way. Other missing items are no free chips and salsa bar, which is a shame. \n\nThis place is in the deep mission, but it's definitely worth the trek. Solid all around.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "A City native said it was the best taco in San Francisco. It was. Maybe in Northern California, too.", "author": "Don M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "There are a lot of reasons that I'm jealous of my unemployed friends. Besides the obvious, such as sleeping in, no commute time, and day drinking, there was one in particular that almost lead me to seriously consider sabotaging my employment last year: watching the World Cup.\n\nIt's just not the same to watch it later or watch clips. I want the real deal! En route to SF General for work I found this gem of a taqueria, drawn in by the cheers when Spain scored that lone goal in the match against Germany. I am half-Spanish, was donning my Spain trackjacket, and was ready to party daytime style so I grabbed a beer and an al pastor burrito. Work be damned. Not my favorite Mexican on 24th, not the cheapest either (though by all means not expensive) but is definitely A-ok and then some. I've been back twice post-Spanish victory and the atmosphere is obviously not as festive, but the carnitas and al pastor burritos are always solid. \n\nI really want to go to Rio for World Cup 2014, but if I can't make it I would happily cheer on the Spaniards from here.", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-24", "description": "Attempted to eat here again on Jan 21st and ordered 3 tacos (lunch) and 1 burrito (for dinner). A few hours later, I was on the toilet reeling in pain and felt like every organ in me had failed. It is now Jan 24th and I STILL am sick. I do not know if it was food poisoning, or lack of them washing their hands (to date, I have NEVER seen anyone there EVER wash their hands, ESPECIALLY NOT THE COOKS!) And I am thinking about calling the health department and seeking medical treatment as I wonder if I caught some disease from them not properly storing the food but NOT WASHING THEIR HANDS! \n\nI am advising ALL READERS TO RETHINK THEIR CHOICE WHEN SEEKING A TAQUERIA - At least until this gets solved.", "author": "William D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I moved to San Francisco in 1996 and moved back to NYC in 2001 and I have continued to be a loyal customer every time I go back to visit.  This IS hands down the best burrito I have ever tasted, anywhere.  I always order the regular vegetarian burrito and extra \"green\" sauce on the side for it.  Also, the same family has been taking and making my order since 1996 which is awesome! Support local SF businesses, please! This awesome staff has magic hands!!! I'm addicted...and thank you for that, seriously! :)", "author": "WJeremy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "Assignment: Find tacos to satisfy craving. Preferably close to San Diego standard.\n\nAnndddd Mission taco is a-go!\n\nSo I took a ~45 minute bus ride allllll the way out here and I was really hoping this place would be worth it. It was :)\nThe tacos are HUGE! Not like the tortilla was a bigger size or anything...it's more like they stuff the taco to the point where you can't even hold it properly and you're better off just eating the filling off the tortilla!\n\nI got the regular pollo (chicken) taco with added guac and it was pretty good! Like I said before, extremely generous portion! \nThe chips are really good here! They're nice and crunchy and just the right amount of salt! Taste especially good with the table salsa! \n\nThe service is quick. The dining area isn't the nicest looking, but this ain't no fancy restaurant...it's a taqueria! Seems like a lot of locals come here, which is always a good sign!\n\nIt's not as delicious as tacos in San Diego, but still...they're not bad! I'd make the long bus ride again...that way I know when I arrive I'll be hungry!", "author": "Kei H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "Good tastings tacos. Nice workers. I like the style and my homies who hang out on the street.", "author": "Bombiz V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "Mmm... These tacos are pretty darn good! \n\nI know this isn't a very nice thing to say, but coming from L.A. where I grew up in East L.A. eatign tacos, I wasn't expecing much from this little Taco Shop called Taqueria San Franciso. But seeing as I was from out of town working in SF, and this was close to where I was working and came recommended by one of the ladies at the warehouse who didn't have a car... whatever... we were hungry, we just went there.\n\nOkay totally undersetimated the place. Had 2 tacos: Lngua and Cabeza. Had the Sandia agua fresca. All of it bomb! They give you chips with some bomb salsa after they take your order too! All ofr less than $8! If i was working in the Mission, I would go back there for sho!I", "author": "Rceli A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-30", "description": "I volunteered at an event at the Brava Theater the other night and I saw someone eating a burrito and decided that I needed to have a burrito immediately. The Taqueria is conveniently located across the street so I made my way over and got in the pretty short line. Do note that they don't accept cards - cash only. I had a regular grilled chicken burrito + cheese and salsa and horchata, and enjoyed a bowl of chips and while I waited for my order. The kitchen is small but they were efficient and I got my order and was on my way after just a few minutes. I took the burrito home and it held up pretty well. I have to say that it was about the size of a small baby and I enjoyed every bite of it. I wish they included or asked if I wanted some additional salsa, as it could have been hotter for my taste, but it was good nonetheless and I would definitely stop in again if I was in the area.", "author": "Candace R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "top super burrito in SF P4P,  ran by good people who have been here for years. Best queso + crema ive ever had, Warm flaky tortilla stuffed with ingredients distributed evenly, the the secret to a great burrito (It's cross section is a work of art). Compact, wrapped tightly, takes a couple bites before the flavors all come together but when they do youll know.... Standard burrito comes with refried beans which isnt usually my favorite but is a must try here.", "author": "Joe A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "Taqueria s.f. had a nice fragrace of  meat  when i entered.  the entire grill was covered with grilling meats, no doubt getting ready for the lunch rush.\n\nmenu: burrito (5), super b(6.25) tacos(2.25) etc.\nsampling:\n-carna asada burrito (5) \n*onions, green onions, lots of pinto beans, rice, and chewy beef were in the burrito mix. initial bites were yummy,  subsequent bites less so.  commercial chips,   green salsa, and  red tomato salsa were part of the meal.\n*burrito was a nice size,  tasted too much of beans.\n\nfrijoles refritos:\n-burrito a good value\n-fast and courteous service\n-some seats available for sitdown.\n-too inconsistent for 4 stars.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Quick, cheap, and on the way home. That's what I like about my burrito. Also it was the only thing open when I was walking home from the gym and everything and their mama is startin to close at that time. \n\nA burrito is a burrito and I swear nothing really blown your mind when you use to live in SD and east Oakland and now the Mission. So why the four star? It's because they do substitute. Sometimes a boy just want to eat tongue burrito or some weird mix variation and thank you for letting me do that.", "author": "Nam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Love this hole in the wall place.  Outstanding food and service. ....  I love the tacos. Drive 45 minutes just to have some.", "author": "randy t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "Burritos. Burritos. More burritos! Are you sick of them yet?\n\nNo, I'm not either.\n\nAnd Taqueria SF is actually a cut above everything else on 24th - I'll even say my personal favorite burrito between Potrero and Mission.\n\nThey cook and prepare in the open, which I like. Nowhere to hide bad practices. This is important when your dinner costs $6.\n\nAnd I like the chicken - grilled for a simpler taste, or \"pollo\" for something juicier. (When I say \"juicier\" because I mean that both literally and kind of.. spiritually. That burrito has spirit.)\n\nAnyway, the perfect amount of good-tasting chips are included with your order.. but for me, I ask for an extra green sauce. You can take that to the bank.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-17", "description": "We have been dining at this place for many years.\n\nThe last time we ordered in the restaurant, the food was full of salt.\nWe could not eat the dishes. He compensated but we will not be returning.\n\nWhy is is that everyone uses so much salt in their cooking?  It is terrible and unhealthy.\nI hope the owner is reading this. But i figure he does not care.\n\nWe will not return. Ever.", "author": "rick l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "I think this is one of the best taquerias on 24th st. The only downside is that it's cash only.", "author": "Monica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-28", "description": "I have no doubt that in 150 years San Francisco's great contribution to Western Civilization will be the Mission-style Super Burrito. It can be a beautiful thing, portable, able to provide a grown man with all of the nutrients and calories one needs in a day and incredibly fucking delicious.\n\nOn my most recent visit, The City's eponomous taqueria created a burrito that was competent, a fine representation of the style, but not in any way special. Yeah, I totally dug the rice, the pastor had a nice char to it and, wait, was that some avocado I just spied? Everything was perfectly integrated, every bite was warm, and the incredibly spicy pico de gallo added some potent heat.\n\nThis seems the hallmark of an excellent burrito, nu? Tragically, this was the rare urban food log where everything that went right didn't elevate this experience to glory. The pork could have been a little tastier, the cheese better melted, the tortilla further grilled, spice more abundant. Everything was OK, but not great.\n\nDid I enjoy this burrito? Oh yes. Did it do everything a Mission-Style burrito should? Also yes. Was it good enough to enter my pantheon of burrito greatness? Tragically, the answer has to be no.", "author": "Casey U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "first time here and it was the best, juiciest and most flavorful burrito al pastor I've had in a long time. it doesn't look like much from the outside but ultimately a restaurant is defined by its food and the food was GOOD.", "author": "Zac J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "Two of my favorite things.\n\nThe city and the burrito. Together at last. I'll keep raving about San Francisco proper. Liked but didn't love the namesake taqueria.\n\nPassable is the best word I can think of. Good sized. Friendly service. Quite a bit of grilled chicken and not much oil.\n\nBut oh those surcharges for wheat tortillas. Gets me every time.\n\nFinished product was about seven bucks. Others have been more expensive and not as good. And quite a few others have done it cheaper and much better.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "I've tried this place for the first time today and I was pleasantly surprised by this humble little place. I ordered the super chicken burrito and it was the best burrito I have had from the different spots on 24th street that I have been to. I do think they should serve better chips With purchase and ease up on the salt in their complimentary salsa though. Also, a little sprucing up may bring in more foot traffic. \n\nAnother note, they only take cash.", "author": "Rose H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "WHHATTT I havent written a review for my favorite burrito place in the city!!! holy crap lets review this.... \n\nLets see I'm a 22 yr old OG native and they know me, I've been here for about 7 years now. I usually get my usual grilled chicken burrito. Everything on it!!!!!! (If I want to get fat, I can get extra everything hahaha that's If you're feeling risky and you do cardio everyday like me. Trust me since the day, I ate my first burrito till now nothings changed and that's a good thing simple simple simple grilled styled burrito to make me completely full. Pretty cheap as well cheaper than El Faralito plus that place gave me food poisoning. \nOther places steam their tortillas, I like how this place grills everything IMO.\n\nBelieve the HYpe people this place is BOMB!", "author": "andrew a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-14", "description": "My reviews are based on the following premise: \n\n\"Food Quality, Ambiance, Economics - pick two and base the review on that.\"  \n\nIf you are looking for food preparation quality, taste and economics that support making this place a daily habit... this is the best taqueria north of the Rio Grande. Don't bring the girl you are meeting for the first time off line here... unless she's a committed lover of tacos.", "author": "Ian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "Walked in here on a whim after reading some reviews and was pleasantly surprised.Went back one last time before leaving SF to Miami. The tacos were really tasty and a great bang for your buck. Items came with sides of chips and amazing house-made salsa. Don't waste time at any of the surrounding taquerias/Mexican restaraunts!", "author": "Nato S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-06", "description": "Place suck dont belive reviews prices are.high 4 blocks up the.best burrito spot on 24th these guys are crooks they see.Latin community is almost gone.n mission n want to raise price lol", "author": "Oso O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-30", "description": "Their Tacos are packed full of meat and the Super Taco has avocado and sour cream! The Fish and Carne Asada are very tasty and not dry at all! I was a little turned off of the price ($2.50 or $3 for super) but considering the amount of awesome-ness you get, it's worth it! The chips and salsa are also muy bien too! \n\nLocation is conveniently close to SFGH and other establishments! Remember that they're cash only!", "author": "Yumi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "Best burrito I've have in a long time. I got the carnitas burrito and I would probably get it again. I could only eat half of it but I ate the rest of it cold later that night and it was still delicious. Also very fast service and really nice servers/cooks. I will make the trek to the city again just for this burrito.", "author": "Danielle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-06", "description": "Cash only. Their chips are incredible and they give you a large jar of yummy fresh salsa. I ordered fish and Al pastor tacos. 3 tacos was way too much. Very spicy.", "author": "Bonnie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Taqueria San Francisco's friendly service, bustling and clean atmosphere, and flawed burrito lead to a mixed experience.\n\nThe grilled tortilla provided a pleasant crisp to the majority of bites; the avocado's freshness permeated the burrito; and the grilled pork lent an enjoyable, smoky taste.  The complimentary chips were not oil-soaked and even seemed quite healthy.\nHowever, there were too many empty tortilla folds in the burrito where fillings could have been crammed, and the missing salsa bar created flavor limitations.  \n\nNestled among stiff burrito competition, it would take some convincing to return to Taqueria San Francisco.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "+1 sombrero- they can;t speak english\n+1 sombrero- soccer is on t.v.(european soccer, not pussy american stuff)\n+1 sombrero-it look's dirty in a clean way(get me? gotta pass health inspections)\n+1 sombrero- not in the hipster district of mission\n+1 sombrero- mexicans eating at a mexican spot\n\nAuthentic Mexican food in the Mission. A little pricey. I mean you can go to Taco Bell for 88 cent crunchwrap supreme, but that's like going to  Panda Express for actual Chinese Food(panda express isn't real Chinese food right?) Anyways, this little joint, which actually doesn't sound too bad right now, is nestled in the un-gentrififed un-hipsterish fixed gear riding douchebaggery area(which is awesome +2 stars)!\n\nThe inside is pretty clean, and you can see everything their doing. A T.V. that was blaring soccer(what else would it be? golf?i swear im not racist ), and you could see half the workers in the kitchen(which is really open, so you know they won't spit in your food), attempting to watch the manchestr game\n\nI ordered the fatest thing possible. A super burrito with chicken..it was like the most expensive one with avocados and stuff Anyways, I was expecting the burrito to be dry, but it was wet(that's what she said). It was a burrito with chicken, beans, cilantro, rice, tomatoes on top, and avocado  drizzed with some taco sauce that appeared to be 2000 calories per ounce\n\nit was awesome. I couldn't finish it(that's what she said), but the succulent feeling of oil being permeated into my blood veins was worth almost the whole burrito.\n\nThe burrito has amazing flavor, which is indescribable to the yelp community by an abundance of words(it's like love, you can't put it in words,but oyu can feel it)\n\nanyways, go there and you won't be disappointed", "author": "Allan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-02", "description": "I've had two burritos here so far after Laurence W. wrote his glowing review I had to try. \n\nSo I've had two burritos so far one carne asada the other a grill chicken. The grilled chicken was definitely better. So far my issue has been with their salsa. If you eat at the restaurant they have a salsa cup that's shared with other folks you don't get your own :/. A little sketchy for me. Supposedly the good salsa is asked for according to Laurence. So I'll need a third attempt before I completely give up on this place.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-10", "description": "Got a lengua burrito and a couple tacos to share. Everything was unbelievably bland. Everything needed salt. I've never been bored by a burrito until now. This is the Ben Stein of taquerias.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "Taqueria SF: So close to being right.\n\nIn an effort to diversify my burrito portfolio, I took stock at Taqueria San Francisco, hoping it would be another hidden Mission gem. I'm sorry to say, but this establishment is still a diamond in the rough.\n\nComing in at 2PM for their daily special, a super burrito with a free aqua fresca, I ordered their carne asada and an horchata. Super carne asada burritos have become the gold standard for judging Mission burritos as of late so i hoped it would be a good choice. I almost immediately regret that decision when I saw a pre-made, packaged tortilla fly from the bag to the grill. This was starting off poorly. It got a bit worse when I handled the burrito and it felt half grilled and half hardened, like it was in that bag for a bit too long and was only redeemed by the lackluster grilling. Luckily for me, this experience took a quick turnaround at the first bite. Everything in there tasted fresh; there were slices of avocado, finely minced onions, bits of tomato and jalapeno, and juicy bites of carne asada. Even better, everything was consistent. Every bite was the same as the last. Well, this was interesting. On the one hand, everything felt so wrong with the tortilla, but everything was so right with the rest of the burrito. The tipping point really came when I rewrapped my burrito half way through the meal to make up for the numerous empty folds and flops of tortilla. In my mind, a burrito should not have wasted space. It's really a dealbreaker when I get a mouthful of nothing but tortilla. So after rewrapping and ripping off excess tortilla, I was left with a regular sized burrito and enough leftovers to make a taco or two. Yikes.\n\nAs much as I loved everything in Taqueria SF's burrito, the tortilla issues and overall quality of the burrito turned me off too much. Maybe they'll solve this problem one day and, on that day, you'll be sure that I'll be first in line to try them again.", "author": "Frank Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Super Veggie Burrito is really good and too big to eat in one sitting.  The service is fast and the staff is very friendly.", "author": "Daisy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "With very little sleep, Sleepy Matt received a early morning phone-call from his boss, telling Matt to come to work at a different location. Matt, who had nothing in his stomach; not even a cup of coffee, landed at this taqueria at noon, because this taqueria was walking distance to/from his one of his workplace location.\n\nMatt ordered the Carne Asada Super-Burrito with everything ($5.25). The super burrito was smaller than other taquerias, but very tasty, with the meat grilled perfectly. But that lone-Super-burrito did not satisfy Matt, so Matt ordered a SECOND Super-burrito, which was the Broiled Chicken with everything. The Chicken was very good as well, but the second super-burrito seems bigger than the first one. Both of the burritos were small , but very tasty. Matt ate both burritos with just a can of Diet-Coke.\n\nWhile in between customers, the cook made fresh Salsa and Guacamole in front of Matt. But the terrified patrons' attention was at Matt devouring 2 tasty Super-Burritos. Matt yelled, \"WHAT ARE YOU LOOKING AT? YOU'VE NEVER SEEN AN ASIAN-MAN EATING 2 SUPER-BURRITOS?\"", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-11-25", "description": "I tried this burrito shop based on the accolades it has received from the fine people at burritoeater.com, which rates it as the second best burrito in the City.  I'm disappointed to report that this was a long ride to another world for a less than mediocre taco experience.  I tried both the carnitas and pollo tacos.  The carnitas was quite fatty and greezy and the pollo, although white meat, was tasteless.  This joint is really just another ordinary neighborhood taco shop.\r\n\r\nAs far as trying a burrito v. tacos? If a place calls itself a *taqueria*, its tacos had better damn well be at least as good - if not better - than its burritos, right? I mean, otherwise, they would call it a burriteria.  Simply, the meat was just greasy and fatty.  The same greasy-fatty meat would have been stuffed into a burrito.  I was totally unimpressed with the whole experience.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "WOW.\nI have rolled my overly stuffed little body into the office after having a \"Super Carne Asada\" burrito from Taqueria SF and not only am I sporting that post lunch coma, I'm also sporting a big sh*t eating grin as my lunch totally hit the spot.\nI know, a good burrito in the Mission is like Angelina Jolie's lips--obvious.\nBut, it had been a while since I've had juicy carne asada deliciousness pass through my lips (cue dirty joke)and this place fulfilled my desire.\n\nMy compadre had their Mojado  carne asada burrito which is the wet burrito, slathered in enchilada sauce and topped with sour cream ,salsa, guacamole. Since it was my first time, I decided to play it safe and stick to the dry version and both of us were very pleased with our choices.\n\nCheap lunch for 2 with large burritos, drinks and chips under $18.\n\nIt seems to be a favorite with the local SF General crowd, a good sign.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "My little sister couldn't stop raving about their Super Quesadilla Suiza, so I had to try it. She warned me it was freakishly large and overflowing with \"extras\" not normally found in a quesadilla. So obviously, I was sold.\n\nI ordered the pollo asado super quesadilla suisa. It was roughly the size of my head. And with one bite, cheese, sour cream and guacamole oozed everywhere. In fact, I ended up using my chips to scoop up my spillover quesadilla fillings, which was kinda like eating nachos - bonus! \n\nI preferred turning my chips into makeshift nachos instead of dipping into the pico de gallo they had sitting in little jars on each table. I couldn't bare to dip my chips into it because much like Ben Stiller in \"Along Came Polly\", I imagined the scores of people who must have double-dipped in there. I prefer salsa bars, thanks. They're slightly more hygenic. But it's a nice thought.\n\nAn added bonus is that it's down the street from Humphrey's, so if this place fails to induce a food coma (which is unlikely), their ice cream should do the trick.\n\nAmbiance? Well, I guess if rickety benches and the sound of Univision blaring on a 15-inch tube TV counts as ambiance, this place has got it. But let's face it, who goes to taquerias for ambiance? I go to get my fullz on. Period. And this place delivered. I haven't tried their super burrito yet, but judging by the quesadilla I'm sure it would be equally filing and ridiculously full of gooey goodness.\n\nTraditionalists might say that adding so many fillings to a quesadilla makes it no longer a quesadilla, but more like a flat burrito, so it really shouldn't be called a quesadilla. To them I say....\"What, I can't understand you?! My mouth is full of this delicious quesadilla! Nom, nom, nom...\"", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "Yes yes yes. San Francisco is now complete and Los Angeles is losing its edge.  So Cal can no longer claim to be the only place with great Mexican food. I've found the bay area mecca tacos and I'm not going home.\n\nI thought it was that \"Americanized\" Mexican food. You know, the sour cream, guacamole, un-spicy salsa burrito all wrapped in a wheat-tortilla.\n\nNah Dawg, no no no. There are Mexicans everywhere.\n\nWe're talking Cabeza tacos, lengua burritos, pastor y carnitas... and it's every where in the Mission District.\n\nGame time.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-04", "description": "i was reallllly craving street tacos, and used yelp to find this place. i got two al pastor tacos, which were solid but not like blow my mind away amazing. i still think that tequila bar next to tacolicious wins that award. \n\nwith that said, these are decent if you want some no frills tacos.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "I'll tell you something you already freakin know.  In the Mission you can't find a bad burrito so don't let some bad Yelp reviews make you think twice about this taqueria. \n\nBest burrito?  That debate is so ridiculous. Especially some people's comments that one has to headdesk at given all the useless info contained within them.  \n\nLet's get down to it.  If you go to a taqueria for it's decor and ambiance you probably will quiver with fright at Taqueria SF. But then again, people who rate taquerias on their ambiance probably don't care that much about what their burrito tastes like.  Amirite? :p\n\nOrder a super ____.  Whatever pleases you, order the super.  Don't skimp.  Order it SUPER.  Take home what you don't eat. I like pollo asado myself.\n\nTheir burritos surpass many others in a few details.  For starters, they give you alot more meat.  Second, no annoyingly dry all-rice bites because the balance and distribution of rice to beans to meat is unusually pleasing.  By which I mean, it makes the burrito that good.  And third, it's likely the juiciest burrito you can find that doesn't drip all over your forearms.  There will be queso in every bite and you will enjoy many bites IF you did not fill up on the huge basket of tortilla chips they give you (at no extra charge).  \n\nThis is not the spiciest burrito in the Mission by a long-shot but guess what?  They have spicy salsa in jars on every single table.  They also have pico de gallo on every table and if like me, you really dig spicy salsa, onions, cilantro and tomatoes beyond what is included in the typical burrito log, then I recommend you use both liberally.  It's like this:  Bite.  Spoon salsa and pico.  Repeat.  \n\nIs it really necessary to make the trip all the way to York just to get a great burrito in the Mission?  Hell no.  But, if you love burritos and haven't tried this taqueria yet I think you should make the journey.  Nevermind \"best burrito\" claims or what burritoeater.com thinks, just go cause it's good.\n\nOh, and one more thing.  Don't take it to go, eat it there.  I was the only person sitting in the place, so what?  Enjoy the free condiments and enjoy your burrito piping hot before the cheese and other ingredients congeal and you feel a need to blubber about how it didn't measure up to the reviews.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "I've come here a couple of times during my lunch break and ordered the super vegetarian burrito and its been pretty good both of the times. I haven't tried anything else on the menu but there are a good number of vegetarian options. I love the two salsas they give with the chips -- its spicy and so flavorful! The service is pretty fast. Only downside, cash only!", "author": "Krishna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Best burritos in town. Been to plenty of places and hands down the best. Fresh meat, delicious salsa and the workers are always a pleasure. I wish they took credit cards or ATM's, however it's worth the trip to the bank whenever I don't have cash......", "author": "Ramiro R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "Do NOT go there for the nachos-- they charge $10.50 for the meat super nachos but they use that disgusting cheese sauce out of a can. You can get far superior nachos from El Metate for only $6.50. I had their carnitas nachos and an al pastor taco. I wasn't impressed with either of the meats. The service was slow because the workers were too buy talking to each other.", "author": "P U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-25", "description": "I had the Menudo and I did not like it. It was very heavy and the broth was not very tasty. I came out with all the ingredients to prepare the Menudo. The staff was really friendly and nice. the melon fresh water was amazing. I expected a little more from this place in general. I don't know if it was just not a good day for menudo.....", "author": "JC L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-15", "description": "Not the best nor most ample quesadilla in the hood. No salsa bar but their table pico de gallo is on point. Overall, good but not awesome.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "Their super burrito is amazing! I love the homemade salsa but it's a bit salty for me since I love to eat a lot of salsa. Great food!", "author": "Ryosuke K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "Little hole in the wall taqueria on 24th street that makes delicious taqueria fare.  The al pastor quesadilla at this place is amazing.\n\nI like how when you get food to go here they throw in chips and a few sides of salsa without you even having to ask.  Their salsas are flavorful and have a good amount of spice (they could be hotter but hey I'm a spicy food fiend).\n\nGood spot and I'd probably hit it up more if their weren't so many other awesome options to get your grub on, on this street.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "Best Taqureia in SF. Everything is fresh hot  generous and cheap! I love love love them. Their Fresh Fruit Drink and a Taco can't be beat. NOM", "author": "Kitten M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "Fantastic tacos, well worth the accolades.  It went head-to-head-to-head-to-head-to-head against 4 other taquerias in one night and it came out in 1st place!  Followup visits have me hooked on the burritos.  \n\nI don't know what the deal is in the Mexican food world -- no one ever seems to agree on what's good and what's not.  So here's a suggestion: try 'em all -- particularly this spot -- and find out for yourself if it works for you.  If it does, you're in bean heaven.  If it doesn't, well, there's about 250 other taquerias out there that still might float your boat...", "author": "Laurence W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-14", "description": "Ok.\n\nThe chicken burrito is extremely salty. That's all I can really taste.It was also pretty dry and I got the mojado.\n\nYou get chips with your order - they are straight from a bag. Not good. The salsa is on the tables and is alright - there are two types one is a fresh pico de gallo and one is a hot sauce.", "author": "Chili B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "BEST Burrito EVER! I love their burritos, I live on 17th and always go all the way there when craving Mexican and get the regular with sausage and lots of cheese, the flavors are clean, Hands down my favorite Taqueria in town. Quick and cheap and delicious!", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "Just had 2 veggie tacos for $2.25 each and was blown away. It didn't come instantly but I saw why when I saw that each fresh taco had 2 corn tortilla with melted cheese between. The taco was piled high with Spanish rice, pinto beans, and pico de gallo topped with perfectly ripened avocado strips. It was so filled, I could barely pick it up and needed the assist of a spoon. I was hoping for a light lunch and was rewarded with a nice filling meal. They also have table salsa & pico de gallo on request, which is a plus. The ambiance of local guys hanging out and chatting about soccer over their Modelos makes me want to run back to join them after work.", "author": "Jones E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "Whoa wow. \n\nTaqueria San Francisco!!!!\n\nSuper Quesadilla Suiza con Chorizo. Don't ask, just do it. Do it right now. I've tried every place on 24th street and it hands down has THE BEST quesadilla suiza. \n\nThere chips and salsa aren't that great, but the mediocre start makes the climax all the better. This is on my list of the three food places I take every single person that visits me in SF", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-11", "description": "this is the place i bring everyone when they visit san francisco. my dad made me go two days in a row. he says it's all about the lard. could be, but it's some yummy lard and it's really my favorite burrito place ever. and, they are super nice.\n\nwhat's not to like?", "author": "Victoria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "This is one of my favorite taquerias.  There are 5 guys that work here (I've never seen any females behind the counter) and they are all friendly.  I always get their super carne asada or super chicken burrito.  Their burritos are pretty decent size and they give you tons of chips and salsa to go.  What I love about the guys that work here is that they are very good to their loyal customers.  About two years ago, I came here and ordered 2 super burritos to go....I forgot that they're CASH ONLY...so I told them that I would walk to the ATM and be right back.  The guy was nice enough to say \"oh it's ok, just pay me next time.\"  Isn't that awesome?!  My total came out to be about $12.00 or $13.00, so I just paid him the next day.  \n\nTheir prices just went up recently.  I think their burritos went up a whole $1.  \n\nThe cleanliness of the taqueria needs some work.  Then again, it is run by all guys....haha so what do you expect?!  J/K\nBut seriously, sometimes the place looks really dirty.  But I don't care, I always take my food to go.", "author": "Cin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "Randomly found this place and wanted to try since it seemed like a hole-in-the-wall mexican place. Thought the food would be good but was a bit disappointed. Carne asada taco - meat wasn't great and the corn tortilla was soggy. Carne asada burrito - same meat as the taco but at least the flour tortilla was pretty good. Tamale - Not fresh and was dry. Good friendly service, but will likely not return as there's way too many other options in SF.", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "This is my favorite burrito place in SF.  Here's why.\n\n1.  They put real avocado slices into your burrito.  No gooey watered-down guacamole here.  The guy scoops fresh avocado right out of a whole avocado and puts that into your food.  Can't beat that.\n\n2.  The portions are generous.  You get a hefty burrito with plenty of rice beans and a lot of meat.  It's almost the size of a small infant.\n\n3.  The salsa is unusual.  It's a fresh salsa and they use some vinegar in the ingredients, which gives a very tangy taste that you just don't get anywhere else in town.  \n\n4.  They always have a soccer game on TV.\n\n5.  Prices are cheap!\n\nThe only negatives are:  \n\nParking can be a bit tough.  But, that's not really their fault.  It just makes it harder to get these burritos as often as I'd like!\n\nChips are commercial packaged type instead of being made fresh in the shop.  I don't really care because I don't eat many chips anyway.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Burritos are a personal obsession.  I go to different places for specific things (i.e. carne asada at La Cumbre).  Taqueria San Francisco is my place of choice for al pastor.  Delish.  \n\nThe chips and salsa are great also!", "author": "Chanthi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-19", "description": "We went here for the first time a few months ago and really liked it. I had the grilled fish taco, which was nice and spicy, and he had some al pastor and carnitas tacos. We remembered everything being very good.\nToday, I made the mistake of just asking for a fish taco - so it came fried (not deep-fried, just fried). I prefer the grilled anyway, but this preparation had some kind of slightly sweet sauce with it, so I only had about two bites of the whole thing. The al pastor today was ok but nothing special - maybe a bit dried out. The carnitas also weren't as good - the flavor was all right, but no nice crispy bits on the edges. We also decided to try a pork tamale - fine, but the masa was a bit creamy for my taste, and not heftily corny enough (yeah I know I have to work on my masa vocab). The pork didn't really stand out, and altogether it was a bit greasy. And, the cacophony of meat chopping from the kitchen made it hard to hear someone just across the table.\nOn the other hand, the vegetarian taco was nice and fresh, with beans, rice, cheese, cilantro, and salsa. Maybe today was an off day, and everything was all right, but not great.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-25", "description": "Again not the best Mex in the Mission but that's like comparing legs at a beauty pageant, they are all good but in the kind of competition its hard to be the best.\n\nPlus its the closest taqueria by my place so it gets an extra star for that.  If you don't live with a couple blocks take a star off.\n\nIt's good for take out cause their isn't any decor.  Seriously it looks like they just dropped in some benches, a couple pics of SF and and left it at that.\n\nI got the super tacos which are stuffed and a 7up.  BTW I now know I hate the new 7up,  it tastes like cleaning fluid.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-05", "description": "My dad took me here during one of those hot weather attacks that SF was experiencing. Walking into the restaurant, there were only two other people in the restaurant. Whenever I see a small amount of people in a restaurant, I usually get a bad feeling about eating there. I ordered the chicken enchiladas because I haven't had enchiladas in a while and my dad ordered a super burrito. \n\nWe received our free tortilla chips and chose to sit close to the door since it was hella hot. It seemed like the wait for our food took a long time but when the food came out, the portions were large. My enchiladas came with a side of beans and rice. The sauce that topped  my enchiladas looked incredibly greasy which is very unappealing to me. Overall, I finished the enchiladas and the rice, but left the restaurant a little unsatisfied. My dad ate his entire burrito because he would eat anything and everything that's edible.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Best al pastor tacos in the city! perfectly seasoned pork and a great combination of crunchy and soft pieces, the people work there are very friendly, everything is fresh and it's even pretty clean. This place puts some of the big name taquerias in the Mission to shame.", "author": "Sefi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "I live about 5 mins away from sf taqueria and come here often. Their burritos aren't mind blowing, but definitely one of the best in the city. What really makes this restaurant stand out though is their salsa, both the pico and guacamole based. I recommend their al pastor or grilled chicken burritos, and the burrito mojado which isn't something that can be ordered at the comparable burritos places surrounding it.", "author": "Erik V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "I had their veggie burrito with everything on it. They give a ton of chips, the salsa they have is very good, and the burrito's a pretty good size.  I still like El Farolito better.  But they're pretty good.  Close to SF General.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-28", "description": "Im a bit biased as this was/is my family's go to burrito/plate restaurant for as long as I can remember but i still eat here on the reg and enjoy everything they have to offer! I have grown into a voracious eater of all kinds of foods but the oldschool plates still give me that homestyle fill! Eggs and chorizo, carne asada plate, alambres or their over the top super nachos! Deeelicioouss!", "author": "Denny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "Great tacos, friendly & patient service for some touristy Asians and ohsomuchfood.  We were floored by the portions and levelled after eating it all.", "author": "Danny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "Super authentic, best taqueria in the Mission for my money.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "Petite Taqueria with racks of smoky meats on the grill daily.  As you walk in you can see all the food being prepared and it makes your mouth watery.  They provide excellent service and their chips are the crispy and flavorful.  I had a chicken burrito today and I could barely finish it.  Fulfilling and tasty food for a affordable price.  Will definitely return and try out different items on the menu.", "author": "Sam O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-09", "description": "You know when you're tired....just too damn lazy to cook or even feeling too worthless to walk more than a block from your house and just wishing your mom was with you to fix your favorite meal? But the closest thing you have is a taqueria, a liquor store, and a washateria? Out of the 3 options for my meal yesterday I chose the taqueria and ordered just a simple plate of my Mexican favorite: super-nachos. \n\nI've got to say, I was starving, and when you're lazy and starving, everything tastes great, right? Not so much. It looked pretty; heaps and heaps of green, red, white, orange all meshed together. And everything would have made this my closest go-to place for super-nachos......except one major ingredient. I'm just asking for one change, dear Taqueria San Francisco, please stop using the jar of Old El Paso cheddar cheese for your nachos. Queso Fresco, Panela, or Queso Blanco would be great, but to be honest, anything would be better... Monterey Jack, even Velveeta!\n\n It hurts to write a bad review about nachos, I just hope this was a one time thing.", "author": "nancy k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-25", "description": "2 burritos $15 bucks, terrible.  It was dry AND greasy with day old rice, i got ripped man.", "author": "Wally A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-27", "description": "This place is located on the more \"colorful\" section of 24th Street in the Mission/Potrero area.  Naturally, I was inclined to come here when there was daylight still out.\n\nFood:  4 stars.  This place definitely serves one of the better burritos in the city.  I tried the super burrito with carnitas.  It comes with everything you'd expect except guacamole.  The carnitas are juicy and not over-cooked, which is a problem you may encounter at other taquerias.  The tortilla chips are a little bit like Doritos, but are not stale.  I also tried the chorizo taco on another visit - they give a generous serving of meat, so get a fork to scoop up all the bits that fall out.  \n\nService:  3 stars.  It appears that all the food is made to order, but it takes a fairly long time to get your food compared to other taquerias.\n\nAtmosphere:  3 stars.  The place is sparsely decorated and a little run down, which is a perfect reflection of the surrounding neigborhood.  Also, the people roaming the streets outside are \"interesting,\" to say the least.  Just don't make eye contact with them.\n\nHits:   Carnitas.\n\nMisses:  Eat...and run.\n\nIf You Like This Place, You'd Probably Like:  La Taqueria, Taqueria Zapata.", "author": "Keith C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-28", "description": "Maria D gives it 5 stars, who am I to argue?\n\nWell ok, for 5 stars they need to have a little more (than zero) ambiance--right now it's just a plain white room (tip: you could totally work that into some sort of colonial-era Mission-esque chic if you got some dark, rustic wood rafters and tables--or you could just put up some murals like everyone else).  The Yelp-geist says to go for El Pastor, and that's exactly what I did, though in my rush to order the works I forgot that \"mojado\" means wet.  Oh well--all the more goop to scoop up with tortilla chips after the fork-n-knife phase.  Diagnosis: delicious, and plenty enough for two.  And I'm digging that papaya Agua Fresca--finally something that's subtly (rather than sickly) sweetened, for maximum refreshment.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "Tried their Pastor and Carnitas burritos and though both meats were tasty, I would say that I preferred the Pastor.  But then again, I usually prefer the Pastor at every other place I go to so....  \n\nBut the real star here are the Tortillas.  They were really fresh.  Fresh enough that I have to say something about them.  Maybe the freshest I've had in my life.  \n\nPrices are great.  Still love a place where I can get a burrito for $6 and less.  The only thing that was missing for me is that they don't have a lot of salsa to choose from and the one they had on the table was pretty good but probably not in the Top 5 of what I've had in my life.....", "author": "Mark W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-30", "description": "Reading paragraph after paragraph of whiners about this place has inspired me to give it 5 stars instead of the 4 I originally intended.  I'm not even going to get into it because it's already giving me a headache (I just wanna say that if a place is known for their burritos and you are the dumb ass ordering nachos, the joke is on YOU, my friend). And it's like, if your favorite place is Papalote (god bless them, but they are in a completely different kind of taqueria world), then clearly this little shack of meat grease is not for  you. You should also know that I am pretty harsh when it comes to burritos as most places don't do a very good job. I however, really really enjoyed this place. \n\nThe goodz: this place is most similar to El Farolito, with one huge, major advantage: they use waaaay less rice. How many times have I eaten a lighthouse burrito to find that the second half is nothing but filler? This place hooks it up, especially in terms of avocado & cilantro, two of my most favoritest things.  If you are one of those godless cilantro haters, I am not sure what to tell you. I also noticed no steam trays, which is gigantic taqueria capital, as well, as the most important ingredient: they grill. I didn't eat my burrito until about half an hour after I purchased it, and it was still (mostly) warm and succulent and awesome. Because of the magic of grilling. Steaming should be abolished. \n\nWhen I am down on this lovely stretch of 24th Street (St. Francis Fountain, the panty store & Pops are all across the street), I will for sure be returning to this joint.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-21", "description": "Fuck this place.\n\nHow you gonna grill Annie's tortilla and serve me a raw one?  \nGive me chips, but not offer her any?\n\nWhat kind of crapshack IS this?  I had really been looking forward to trying this place - trying new taquerias gets me really turned on and i was stoked to spend a lovely saturday afternoon with my good friend sharing some laughs over a burrito.\n\nThere was no laughter.  I dont even think we talked the whole time we were there except to mutter commenrts like \"what the fuck?\" under our breath. \n\nAs i previously mentioned, my tortilla was not grilled - now this isnt a big deal for me if thats how its done at that particular establishment.  However ...\nThey grilled my friends tortilla and not mine!  I cant believe they played me like that.  I took one look at the burrito and decided \"ok, so this is how its gonna be....\".  I heaved a giant sigh and took a bite. \n\nThe rice was a huge problem for me - it seemed more like congee the way it all congealed into an amorphous rice \"patty\" if you will.  It had the viscosity of pudding.  '\n\nThe carnitas was extremely crispy.  I know, i know - its supposed to be crispy.  I like it crispy so back the fuck off already.  What i'm saying is i think i might have chipped a tooth on a few pieces.  But i can never hate on pork too much - i have a deep and profound relationship with pig products and it doesnt feel right to hate.\n\nAfter my first few bites a large piece of the burrito broke off and fell in my lap and  I had to pick pinto beans out of my crotch.  Trust me, its not as sexy as it sounds.\n\nNo salsa bar - seriously, what the hell is going on here?\n\nI felt really helpless and vulnerable, my Saturday afternoon had been completely sabotaged.  My butthole hurt.\n\nBroken and defeated, Annie and I retreated indoors and proceeded to get ridiculously drunk hoping to purge our minds of the atrocities we endured.  It didnt work, but i did throw up later and lost the burrito in the process. \n\n Its the small victories in life that i cherish the most.", "author": "Kirsten S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-06", "description": "Burrito fail. My first visit, got a super carnitas burrito - and requested it without salsa or cilantro as the green herb tastes like soap to me.\n\nAlas, my burrito was packed with cilantro. So much so that I couldn't forgive it as a mild case of \"cilantro contamination\" of another ingredient like the onions, which is common and understandable.\n\nAnd, considering it was a a super burrito, the thin slices of avocado were stingy at a count of only two.\n\nThe carnitas were well flavored, though more a stewed, shredded pork than a greasy, crispy carnitas. Very little fat blobs, which have ruined other carnitas for me.\n\nI'll give it another chance, but reluctantly.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-08", "description": "I'm am so glad to here people like this place.  I used to live basically across the street from here.  My housemate said it wasn't very good so I avoided it for a while.  But one day I couldn't resist any longer, as I do love mexican food.  They will make your burrito how ever you want it.  They don't advertise this but if you're really nice to them they will do it.\nMaybe it was because I went there a lot... anyways.\n\nI would always ask for a \"quesadilla\" with black beans and rice, tomato's and avocado.  Basically it's a burrito grilled with lots of cheese.  Weird I know.  But AMAZING!!!  They never get mad either, even though they are right next to pop's and get all the ruffian from the hood coming in at all hours.  \n\nI LOVE THIS PLACE.", "author": "amanda v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "This place rocks, quick, cheap and great burrito's. i love the salsa and cold beer.", "author": "Greg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-27", "description": "Fish taco was A+. Super tender pieces of [fish type?] piled on the recular taco fixings. Salsas are hotter than other not as legit taquerias. The burrito will go in my stomach next.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-27", "description": "Best burrito I've had in SF ever.\n\nI've made comments in other reviews before that my being from Southern Cali has made me snobby when it comes to Mexican food.  Down there, cheap Mexican food is usually better than any fancy restaurant and more plentiful.  \n\nAround here?  Bleh.  It's cheap, but crappy.  Really poor quality.\n\nThis place has officially impressed me.  I've never been inside, my coworker called me and asked me if I wanted a burrito for lunch.  I reluctantly said yes.  When he brought me this chicken burrito, with fresh celantro and avocado...omg.  Everything was warm and juicy, it's the best I've had in SF.  (working on 2nd year here)", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Best taqueria in SF!  High quality meats, fresh ingredients - and their burrito is always perfectly proportioned. Al pastor, carne asada, carnitas - all great. El Farolito used to be our favorite until we found this place.", "author": "Alison J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-11", "description": "Despite the somewhat seedy area and lack of ambiance, this place has remained my favorite no-nonsense burrito joint since 1998.  Bluntly put, the place itself is nothing special.  Simulated wood tables dot the dining area, while a drop ceiling and fluorescent lights illuminate from overhead.  At least one set of lights is always sporadically fluttering, it's bulbs or ballasts going into a slow dance of death.  Excited, animated Spanish voices radiate from the TV when a Mexican soccer game is being televised... Mariachi tunes blare from the jukebox if one isn't.\n\nLocated about two blocks from Potrero Ave., this place is far enough from the nauseatingly trendy Valencia St. corridor to be devoid of any influence from the wrong things, but deep enough inside the Mission to be influenced by the right things.\n\nI always get a Chicken burrito here, and the Chicken is ALMOST on par with that of the uber-spendy La Taqueria (see my other review on this) on Mission Street.  Chips are free, and each table has a full jar of salsa on it.  I regularly kill an entire jar... and nobody ever says anything when I snarf a fresh one off an adjoining table.  Seating and lines are NEVER a problem, even at high noon on the weekdays.  Bicycle riders rejoice....I've brought my steed inside many times, and the staff has never so much as batted an eye.\n\nCheck it out, but don't bring too many friends...especially if they aren't from the Mission.  This place is one of my last remaining neighborhood secrets....and I'd be devastated if the Valencia street mod-squad sniffed it out and made it hip....\n\nUpdate: 4-02-06 burritoeater.com got written up in the Chron, ( http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/04/02/CMGU9GJ0Q51.DTL&hw=burrito&sn=001&sc=1000 ) And so did this place along with it.   There goes the neighborhood....", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-21", "description": "There burrito people and taco people. I am a taco person. Taqueria San Francisco is by far my most favorite joint for al pastor tacos. Carnitas are ok. Lengua is ok. But the al pastor, seriously heaven in spicy pork form.\n\n+5 for delicious tacos\nwho cares about ambiance?", "author": "Glenn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "Nothing fancy to look at but man that chicken taco was delicious. It was juicy, spicy and perfect!  And it was all white shredded meat.  I was very happy and now I'm craving more tacos from this place. \n\nDon't be fooled by the lack of chi-chi decor.\n\nYUM.", "author": "Liz H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-21", "description": "Meh. I was really excited to try Taqueria SF but was sadly disappointed.  I ordered a super carne asada burrito without sour cream and took it home to eat. I thought the tortilla was good, nice and soft, but as soon as I bit into it I was so bummed! The flavor was lacking because the carne asada consisted of teeny teeny tinsy little particles of meat that tasted nothing of carne asada. No juiciness, no yummy meaty flavor, just one sad burrito-file   :(", "author": "Pola C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-31", "description": "I used to live down the street from here and it was a regular Saturday afternoon lunch place for me.  Great salsa and chips, loved the soft tacos and the chicken burritos.  Yeah, bare bones, but who cares?  I don't go to a taco or burrito joint for the atmosphere.  If you want atmosphere, go check out the car wash burrito place off Bayshore x 101.\n\nNice fruit drinks, horchata is tasty.  And the price is always right.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-11", "description": "Hi, this is one of the best burritos you'll get in the city.\n\nCheap. Deli-cious.\n\nYa know why? \n\nThey grill the burritos instead of steaming the tortilla.\n\nAnd they have salsa ON THE TABLE.\n\nAnd they're across the street from Pop's.\n\nThat's why.", "author": "Danyell K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "Great Mexican takeout. They make all their own tortillas right there!! Not expensive either.", "author": "Andrew X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "This place has the best tacos in San Francisco. Haven't had there burritos yet because I can't get enough of there al pastor tacos.", "author": "Colin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-06", "description": "There is a man that works here who completely ignores what you order and instead makes the burritos how HE thinks that they should be. He has screwed up my order so many times that I honestly think that he does it purposely\n\"No CHEESE? I'll show you cheese m.f.\"\n\"No SOURCREAM? Your getting sour cream M.F.\"", "author": "fuck you p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "Ok, so the chips are pre-made and tastes like Doritos. The \"fresh\" pineapple juice is from a can. There is no beautiful salsa bar with roasted peppers. And there is no arsenal of smiling ladies in matching aprons and paper hats. \n\nBut the carnitas here is RAD. It is wonderfully tender and flavorful in a way that only pork fat can ensure. The tortillas are warmed and act as the perfect conveyance for the carnitas. Two carnitas tacos and a Mexican Coke make Taqueria SF a wonderful destination in the Mission.", "author": "Dana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "Bar none, my favorite place for mexican food in the city. The carne asada super burrito is so flavorful and juicy, without being messy and getting all over the place. I first discovered this when I lived down the block on 24th and now drive out of my way to pick burritos up from here.\n\nThe guys behind the counter and nice dudes too. They sell t-shirts too...of which I am a proud owner.\n\nRecommendations:\n- Carne Asada super burrito\n- Chicken Quesadilla\n- T-shirt", "author": "Rondeep C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-15", "description": "yup burritoeater.com led me here too, and I too was unimpressed....\r\nvs Cancun, Castillito, I thought they were all better.  It's a good and cheap burrito, but I wouldn't call it the best burrito in the city.  Also, the agua fresca (pineapple and peach) were made from canned fruit... not really very fresca now, is it?\r\nmy friend got a pastor taco.  I got a carne asada burrito.  Carne asada was kinda bland.  Pastor was nowhere near cancun or castillito level of tastiness.  salsa was good though.  nice balance of spiciness and flavor.\r\nEl Farolito is just down the street...  you know what to do.", "author": "Fong L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-07", "description": "Carne Asada Super Burrito\n\nFull disclosure: I read all about this spot on B.E. and this page. So the hype meter pegged deep into the red as we made our way up to the Mission for a show at the Make-out Club a couple of nights ago. And boy howdy, this notoriously heavy hitter came through in a big way.\n\nThe burrito came to the table thinner than the ones I had been dreaming about. Maybe they are trimming down for the upcoming World Cup? I was immediately impressed by how tight they wrapped the foil around the burrito. Like no wrinkles. It was sort of like this beautiful cylindrical mirror, reflecting back an image of me distorted by desire and hunger.\n\nInside this gigantic silver bullet casing was perfectly proportioned rice and beans, thick chunks of ripe avocado and weapons-grade carne. Oh, the carne asada; seasoned to the hilt, slightly charred edges and juicy insides and a heaping heap of the good stuff.\n\nYummers.", "author": "Morga n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-01", "description": "Mojado.  That's the short story of my five-star review.\n\nTaq. SF always delivers the goods, as long as those goods are burrito-esque; Maria D. is right on that the nachos are not the secret to their success.\n\nHits:\n\n1) Burritos range from large to extra-large.  I have never seen one that was less than above-average in size.\n\n2) Al pastor -- even though I have not been around when the spit is spinning, they have one.   They sometimes chop the meat a little too finely, but that's about the worst I can say about it.  It's got flavor.\n\n3) Pico - they only have one kind in a jar on each table, but it's a one-hit wonder.  I rarely eat more than a few of the factory-made chips at any taqueria, but the pico here is simple, well balanced, and vinegary enough to cut through some grease without being overpowering.\n\n4) The burrito mojado is a sight to behold.  Nice presentation, good ingredient mix, lots of meat, and overflowing with cheese, guac, and sauce (no sour cream for me).  The only thing that would make it better would be extra cheese placed inside the burrito (in addition to the abundant cheese on it) to hold the ingredients together a little more.\n\nNo misses.  The employees are courteous, the bathroom is reasonably clean, and the kitchen is in full view to assuage any concerns about cleanliness (the kitchen floor was a little dirty, but gravity works like that, and the counters were all good).", "author": "Steve K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-13", "description": "Nasty carne asada...the meat is stale as hell and their burritos are filled with too many rice and beans.  No decent salsa selection either.\nAlso, they'll try to overcharge you.", "author": "Johan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-28", "description": "You certainly can't give Taqueria San Francisco stars based on atmosphere but they make the best carne asada burrito I've ever had.  As someone who was a loyal el faralito consumer for 4+ years I don't make that claim lightly.  To those who say el faralito makes a better burrito, I wonder how often they eat there.  As someone who eats burritos weekly I love el faralito still, but consistency isn't their strongpoint.  I've reached the bottom 1/4 on numerous occasions to only find myself staring at a pile of rice and nothing else.  So now when the burrito calls I walk past el faralito (2 blocks from my house) and make the admittedly out of the way trek to Taqueria San Francisco.  I'll still bring out of town friends to el faralito for the experience or myself for late night cravings (TSF isn't late night), but hands down its Taqueria SF if I want carne asada flavor.\n\nAnd no Rick, they wouldn't call it a burriteria.", "author": "Mikey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-16", "description": "I can rarely pass up Manivanh's Thai food which is just \ndown the street on 24th but, when I finish a case at San \nFrancisco General AFTER Manivanh is closed, I head \nstraight for Taqueria San Francisco - I thoroughly relish\nthe indulgence in a carne asada burrito with its \nsucculent meat cooked to perfection - and all the \ntrimmings.  So what if it's laden with calories!!!  Maybe I\n'll get a second one for lunch tomorrow!", "author": "Carmen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-13", "description": "How much better is this place that Farolito?  I can't even begin to tell you. Everything about it is better, the balance of things in the burrito, the atmosphere inside the restaurant, the quality of the beans and rice (bitter beans?  what does that even mean?) Yeah, everything. \n\nWhy do people like Farolito, then, you ask?  I don't really know.  It has to be that they haven't heard that Taqueria San Francisco is right down the street.  Oh, and also, they close at like 9:30 for some ridiculous reason.\n\nI just ate here last night and it was so good that when I finished my burrito I eyeballed my roommate's until she gobbled up the last precious little bite.  And I was pissed.  Seriously, its so good that youll be a ridiculous person.  \n\nI can't believe I kept going to Farolito for so long. \n\nOh and their green salsa is just as good, if not better.  Although their chips SUCK.  Seriously, guys, get some new chips.", "author": "Bill P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-02", "description": "Super Carnitas Taco. Built with love and care. First bite, I felt the love.\nSecond bite, I knew someone cared about the quality of the food here.\nThird bite, the taco was gone and I was longing to order another but\nI dragged my ass out. Very good food. The burritos are awesome as well but I stay away from those to try and keep my ass small enough to\ndrag it away quickly when my self control wanes.", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-04", "description": "Hmm....It's hard to say how I feel about this place. I was on mission about to check out the \"La Palma\" Mexicatessen because I heard here on yelp they were pretty badass, but alas, they were closed. So I popped by this place. \n\nDidn't expect to have spot on service (and you shouldn't either) because this is the equivalent of a sort of gourmet fast food joint. I ordered the standard burrito, and for the 5 something that I paid, it was pretty huge. Then again, I can't say it tasted great nor can I say that it was terrible. It was sort of devoid of flavor, yet still it had some old fashion mexican goodness to it. \n\nThe Chips were a let down because I was really hoping to get some actual hand fried stuff, but the dude scooped it out of a box that looked like the chips were shipped to them from texas (okay not really). They have salsa stuffs at the table and I loved the salsa because it was definitely fresh stuff and tasted great. Oh and ask for water because that stuff is spicy as hell. Mmmm...jalapeos.... \n\nAll in all, It's a pretty average place (especially since its on the mission). I'm sure there are better places on the mission out there somewhere, but this places wasn't bad. Then again, nor was it good.", "author": "Dzu N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-24", "description": "I have been here a number of times in the past, with great results. Apparently they have shifted staff in recent days. I guess it takes a while to catch up. \n\nMy manpal went out and ordered me a vegetarian quesadilla tonite, but returned with (shudder) a carne asada. I was so pissed that, after he finished eating, I did not even want to go back for the 14 block round trip, but he insisted. \n\nThank my stars his conversational skills always dazzle me most while strolling. \n\nThe main man at the shop looked around angrily at the cooks when we explained the predicament. The MP wanted to tell them that I am also muslim, but I had to decline on the grounds that I'm disinclined to misuse other persons religious/dietary restrictions for my own not-so-evil ends. \n\nIn a few minutes, we looked at it to ensure a lack of meat. I got home and discovered that it was a goldarned vegetarian BURRITO. I am sick to death of rice and beans. That's why I didn't order that-either time we went today. Almost no cheese! I'm not saying it was of poor quality, just that we went twice, and I didn't get what I ordered either time. WTF? \n\n28 total blocks of walking and I still got F***ed. Good thing it was only for a few dollars. Persons with dietary concerns, large or small, wait a while and see if some semblance of order returns!", "author": "dodie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "better than many overrated taquerias in the mission , when you see people latin people there you can already tell that this place is pretty authentic , pastor super taco was amazing, and the burrito did not fall apart for once they know how to put the right amount of things, overall good experience , oh and that salsa verde they give you with your chips Soooo goood ..", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "beef burrito ot shrmip burrito thats all i want from here,I love this place its one of my fav work lunch spot...SO GOOD!", "author": "Nina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "Legit - nuff said.\n\nHad a mojado burrito with al pastor and was not disappointed. The burrito was huge and came doused with cheese, sour cream, onions, and a couple different sauces/salsas. I made a point of finishing all 4 lbs of it and was very content. The chips/salsa verde they provide are a nice little compliment to the meal. They also serve a slew of Mexican beers which I thought was cool (no taquerias in my neighborhood - boston - that serve beers). TVs with futbol playing non stop are another plus. I am not Mexican but the place seemed like a pretty authentic joint to me.\n\nso happy with my meal that I purchased a T-shirt to bring home with me", "author": "Sean P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "This is typically my favorite SF style burrito place.  For SD style burritos, it sucks.  Zero guac, chewy meat (I usually get carnitas here so this was unexpected), way to much pico de gallo.  Again, I am in search of an SD style burrito and not an SF style burrito so I can't award points for what I think is generally a good taqueria.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-21", "description": "their chips and salsa is the worst i have ever had...\n\ncarne asada is ok, and carnitas is so-so\n\nthis is a hole in a wall you want to avoid if you are looking for a good food, there's a LOT of better one's down the street.", "author": "Gors P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-18", "description": "I guess I'd give this 2 and a half stars, if Yelp offered that option. These are decent burritos and decent tacos but nothing to write home about. The salsa is good, but not great, and the atmosphere -- well what do you expect from a taqueria in this seedy neighborhood anyway?\n\nNo frills, fills the stomach, gives you gas. To some that's what burritos are for, but I like a little extra something in mine. You won't find it here.", "author": "Alan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "I'm on a mission.  In the Mission.   I need to find my \"go to\" burrito place in my new neighborhood...you'd think that wouldn't be a challenge down here.    Taqueria SF has some good yelp reviews and looks clean inside in comparison to other spots in the 'hood so I thought I'd check it out.  \n\nFirst of all, my dream of swimming in a sea of cheap mexican food is quickly dying.  It seems that even deep in the Mission I'm paying the same as anywhere else in the City.   I miss my $4 Oakland burritos.   $6 hurts.  \n\nThe counter guy was pretty friendly so that's cool.  I got a chicken burrito, which admittedly isn't my favorite in general, but I was in the mood.   It wasn't bad.....but it wasn't \"it\" either.   The chicken was well seasoned if perhaps a bit too salty...and the salsa was also a bit salty as well as a touch too sour...like many lemons were killed in the process of it's creation or something.   \n\nPerhaps I'll come back for the much hyped carne asada sometime...but for now, the search continues....", "author": "Scott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "Best...burrito...ever.\n\nI work just two blocks from this burrito gem.  I have been going there for over a year now and have never been disappointed.  The super carne asade burrito is the highest rated burrito ever over at BurritoEater and it's my meal of choice everytime.\n\nThe staff is friendly, the food is fresh, the service is quick and the price is good.\n\nI've tried a whole slew of other burrito shops here in the mission area (Faralito, El Metate, and many more) but none can amount to the deliciousness and reliability of Taqueria SF.\n\nI eat one almost weekly....and it shows.", "author": "James G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "A nearly perfect burrito - roast pork \"Carnitas\" on a flaky grilled tortilla - rice and beans done right - spectacular hot, hot salsa - guacamole that didn't just disappear into the mix.\n\nAll that, and from some of the friendliest people along 24th Street. I'll be back. And I'm telling my friends too.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-06", "description": "I've been mulling it over for a while, and I have to say, I was really pretty harsh on good ol' SF Taqueria.  I'm sorry guys.\n\nI gave it another shot... Here is what I have to say:\n\nThe chips are actually B grade.  I love the crunch factor, but the salt should get cut down a lot.  I am also pretty into the salsa that they have on every table, but really guys, am I supposed to dip into a communal salsa bowl?  Jeez.\n\nI punished three tacos recently, and I was actually impressed.  They were good.  Chicken, and al pastor.  I'm down with it.  Not as good as Vallarta, but then again, what is.\n\nIn closing, Im cool with Taqueria San Francisco.  And I am glad I gave them another chance.\n\nGrade B chips.", "author": "will h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "I only go here for one thing on the menu - The \"Super quesadilla Suiza with carne asada\" and that's it. Ordering the super versus the regular means that they add avocado, sour cream and pico de gallo salsa. It is an explosion of flavors and yummy greasiness.  It's cheap, yummy and a must!\n\nIt's a basic taqueria dive with not much atmosphere.\n\n$6.25  \n\n*Cash Only*", "author": "Angelica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-23", "description": "SUPER CARNE ASADA BURRITO (4.5/5) - Ordered according to BurritoEater's high rating: http://www.burritoeater.com/restaurant.php?taqueria_id=126. The lime-tinged pico de gallo brought just the right tang.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "Nothin but good stuff here! Another regular stop for me while in the mission. Grab a burrito and head over to Potrero del Sol park.....good times and great food.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "I don't know if this the best burrito, but it is up there.  \n\nI think the grilling of the tortilla, the type of cheese they use, and maybe a bit of different flavors to the meat, make the burritos standout.  \n\nThey could use better chips though.", "author": "Reginald F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "GET THE VEGGIE BURRITO and get over it\nthe chicken admittedley is kind of lame and the nachos are a no go\nbut damn that toast that tortilla for the burrito the way you know you want it- not all soggy steamy-\nand fresh fresh fresh avocado not some soupy guac inside!\nyay yay yay", "author": "eve e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "Quit yer bellyachin already.  Six bucks is the new four bucks.   Your entitled first-world ass is bitching about two dollars?  Get a job.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "Go here for the burritos. This place rocks for the burritos. I don't waste my time with anything else on the menu. The wet burrito (you know that one with all the sauce and other deliciousness on top) is the super awesome. Not super huge but enough to make you feel stuffed and wobbly.", "author": "Lettie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-20", "description": "I would have to crown this the best burrito establishment I have ever visited. What sets them apart is the way they slice their carne asada.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-21", "description": "Also came here via BurritoEater and love it! Gently grilled tortilla for my Carne Asada regular, and the man at the counter smiled and seemed genuinely very kind. I always come here on trips to the Mission, even if this mixed bag of reviews is making me doubt my burrito taste buds.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-16", "description": "The burritos here are what make living in San Francisco worthwhile. I try not to eat burritos more than once a week, but this place is one of the best. The carne asada isn't as fresh as Papalote or cubed as Cancun on 18th, but it is super flavorful and juicy without being watery. I like how they grill the tortillas before they are served. The super nachos and quesadillas are also pretty awesome. Another plus is the location that is off the crowded part of Mission so it's easy to go there for a quick dinner when parking is tough where the other taquerias are. I just wished they opened later!", "author": "Mark Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-04", "description": "Wow. Quite frankly I'm amazed at how divisive Taqueria San Francisco is amongst the yelping community. Initially I didn't even think to review this place because I figured the praise would be nearly uniform, but I suppose there is a debate to weigh in on, so here's my two cents.\n\nIt appears that negative reviewers of Taqueria San Francisco can be grouped in to two categories: those who are mistakenly eating non-burrito items off the menu, and those who are totally clueless as to what one should expect from a burrito. Those in the former group can easily rectify the situation, and if they are not a subset of the latter group, problem solved. Those in the latter group who are putting inferior meats like chicken in the burrito or complaining that the salsa is too hot, I can try and present my argument for why the Taqueria San Francisco burrito is the only burrito that I will probably ever give a five star rating on this site.\n\nThe essence of TSF's burritos are the construction, which several people before my have eluded to. The tortilla is grilled, which is obviously superior to steaming, but the manner in which TSF grills creates a flakiness that I have never found in other burritos. It's almost as if you're eating a quesadilla tortilla, and really the only reason to eat a quesadilla and not a burrito is for that tortilla texture. The wrapping technique is always tight, and the contents are uniformly distributed within. \n\nYes, there is a lot of avocado, and the avocado are wedges, and not guacamole, which I think is a sign of the freshness of the ingredients. I've never thought that to be a negative thing, but it's a fair complaint. The meat selection is typical for a good burrito place; aside from the normal asada-pastor-carnitas trifecta, they serve meats that you don't get at the place that serves the \"best nachos in the city\" (lengua, cabeza, chorizo). It's tender, juicy and each one has a unique taste. Beans and rice are as good as beans and rice get. They are there to play a minor flavor role, and mostly are a way to get more meat juice into your mouth and not at the bottom of your tortilla. The salsa is contentious, I will admit. It isn't very spicy, but it is unique in that there is an interesting pickled jalapeno flavor in the pico. For those who want more heat, adding the whole jalapenos that are also available on the table should allow one to adjust the spiciness to their desired level, which I think is preferable to making every burrito really spicy.\n\nSo that's my take on the restaurant that has given me the most complete and satisfying burrito experience time and again. I hope this helps clarify some of the debate, and if not, I know of a great Mexican place with a seven layer burrito to die for that we can all go to and discuss this further.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-07", "description": "Had the Carne Asada burrito..man o man it was good. Not a lot of ambiance for dining in, but one of the best burritos in town! Thank god is around the corner from my new home! I love when cool things are super close - I foresee a future of burrito parties at my house.", "author": "Anne Sophie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-12", "description": "If I had to vote today on my favorite Burrito in San Francisco, this would be it. Taqueria San Francisco delivers on every element important to making an amazing burrito amazing. The tightness of the roll, the tinfoil, the fresh ingredients with a good mix so that every bite explodes with flavor, the girth, and the price. Everyone of these categories is achieved to the highest level with each burrito I order here. I switch up my orders from time to time from a carne asada to a grilled chicken burrito and have found both to be damn good with a super carne asada taking the hands down vote of the very reason why I come here in the first place. I usually find parking right in front which is just another bonus to make me smile. Your going to love it!", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-27", "description": "Hell Yeah!  This place rocks.  My favorite is the super burito carne asada.  Burrito is the size of a baby's arm.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-25", "description": "I don't like this as much as El Farolito, but the owner takes pride in his store, and it feels more like a family owned place than Farolito.  I love their burritos, and you don't have to pay for chips.  The horchatta is a lot better here than Farolito.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-08", "description": "I love burritos.  This is the first time that I can remember that I did not finish (or even come close) a burrito.  The flavoring of the chicken was awful.  The cheese (on the super burrito) was overwhelming.  It was an awful burrito.  I have no idea why people rave about this place.\n\nI can say, though, that the salsa was delicious.\n\nHead down the street to Paplote instead!", "author": "C. J. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-03", "description": "They do a very serviceable al pastor here.  Two super tacos for $6 seems steep, though.", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-09", "description": "Worst nachos I've had in the city.  With over a dozen places in the area that sell every variety of delicious Mexican cheeses Taqueria San Francisco put freaking canned cheese on my nachos...  Like at the ballpark... Cheese Whiz... damn.  Maybe something else there is good, but hell if I'll ever find out.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-29", "description": "Their super-burritos are as good as they get, as well as their tacos and fresh salsas. They recently redecorated their walls with a collection of very large San Francisco photographic panoramas..", "author": "Victor M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-13", "description": "I too went here because of burritoeater.com, and I too was somewhat underwhelmed. Don't get me wrong -- the burrito was just fine, certainly not bad. (Rick H., perhaps you should've have a burrito instead of tacos?) But it didn't knock my socks off, and it wasn't better than my neighborhood place's, La Corneta's, burritos. I wouldn't go out of my way to go here again, but it's fine if you're in the area. Positives: Grilled tortilla, addition of cilantro and onion, manageable size. Minuses: Cardboard-y store-bought chips (not even Casa Sanchez brand), forgot to include my guacamole add-on, bland boiled chicken (I prefer it grilled).", "author": "Tara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-13", "description": "I am yet another burritoeater.com inspired visitor.  I guess I just don't get it.  I had the carne asada super burrito, and it was just your average Mission burrito.  The horchata was okay, if a bit watery.  El Farolito kills this place.  It wasn't bad, but I doubt I'll come back.", "author": "Ficus K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-07", "description": "Stumbled upon this place by accident on my way to the airport.  Super duper excited about my taco...this one piece of mexican cuisine might have changed my whole taco outlook.  I was never a fan until I  experienced the veg taco, the wierd thing is...huge carnivore....huge burrito fan.  Who was that girl?  Well a girl who loved the ripe avacado on her taco, a girl who couldn't get enough of the fresh red and green salsa.  Can't wait to see what they have up their sleeve as far as burritos.", "author": "Brye L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-29", "description": "carnitas.....good.  pollo & carne asada very mediocre. Chips are kind of lame too.  I thought I wouldn't like their chunky salsa in dirty bowls on the tables, but it wasn't bad and had a great kick. Not the best joint in town, but if you're going get carnitas, they are yummy.", "author": "Nima K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-30", "description": "They make the best effing burrito I've had in my life. I almost wet myself out of joy. If it weren't such a freaking trek for me, I would eat here every day.", "author": "C P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-10", "description": "Hmm.. this place was merely mediocre. My friends and I went here because of its high rating on burritoeater.com. We had the wet burrito (umm, we didn't know it would be wet. Lol. I didn't read the last part on the menu, \"cheese, sourcream, sauce,.....ON TOP\"), and it was kind of greasy. I also got a horrible stomach afterwards (not sure if it was from eating 1/2 a burrito at Papalote and 1/2 here). GO TO PAPALOTE instead! About 8 blocks up 24th St.", "author": "O K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "I work at The General and have been enjoying the burritos and the quesadilla suizas at this place for years.  What can I say, it's close to work, the crew is cool and I love the bowl of jalapenos on the table, I must down two or three before I finish up.", "author": "ein bier bitte k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-19", "description": "Booo to the SF Weekly Best of San Francisco!  went to this place because it was listed as best burrito.  The beef had an odd taste, the chips are grade C, and the al pastor meat was ultra greasy (inedible).  the only good thing was the salsa in the \"little cup\" on the table!!!  the whole experience was extremely upsetting and disappointing!!!  and, yes, as another reviewer wrote, the rice had a sort of congee consistency, and a couple hours later i felt slightly ill.", "author": "suzanne e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-22", "description": "Gotta agree with some of the negative yelp reviewers. Came here for some post-happy hour grub (I'm actually kinda drunk writing this) tonight based on a rec from my co-worker and it disappointed. I got the carne asado burrito \"mojado\" with their fiery hot green salsa, sour cream and red sauce on top. Jesus it was freaking spicy! Too much tortilla, not enough meat and in my book, that's b.s. My guy had the tamales dinner and he remarked the corn and meat were waaaay overcooked. We were full, but not satisfied. Doubt we'll be back--we're fans of La Corneta personally.", "author": "Genevieve R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-09", "description": "Below is my original review. I have changed my mind. I went there twice this week [the 2nd time was to return my burrito] and they gave me the wrong order both times. The first time I was handed a carne asada burrito, which great except I am not a beef or pork eater. \n\nCool, people make mistakes. I take it back up and they give me another carne asada burrito, this time in a spinach tortilla. WTF?\n\nI take it back up, and they are like sorry, come back tomorrow; it's closing time. \n\nI agree, it is time I close the book on these 2-bit bastards. I will not go to Taq. SF under any conditions whatsoever in the future. They are grade A douchebags for messing up that much, though I deserve part of the blame for eating so late in the day and not checking immediately what I ordered. \n\nOh well, it is a learning experience.\n\n===\n\nThe grilled chicken burrito is not good. I tried it twice in one week. Very dry, like you are eating sand. \n\nThe tortillas here are among the best in town. The veggie burrito is excellent. \n\nAs another reviewer said, they do a great job with the rice:bean ratio. I firmly recommend Taqueria SF for veggie burritos, but not anything else.", "author": "Rahul T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-28", "description": "ordered one taco al pastor, one fish taco, and one chile relleno burrito. food was generally ok but nothing spectacular. fish taco did not come with lime - what's up with that?? n sums it up in one word: greaselicious. neither of us really think we need to visit taqueria sf again...especially not with all the other much better choices on 24th.\n\nreading the other reviews, maybe we should have ordered a more traditional (carnitas or al pastor) burrito instead....so maybe i'll give this place another try. but it'll be hard considering all the competition on the same street.", "author": "Angi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-03", "description": "San Francisco Taqueira-\nHad a regular chicken Burrito........with rice beans and (I think grilled) chicken. Not sure because it was a little dry, yet it was in a red tomato stew. Anyway, tasted like oregano, and although I like oregano, it didn't taste good in a burrito. The best oregano, with garlic, vinegar, and lemon marinated chicken I've ever had was at a Greek golf tournament, and these old Greek guys could Q. Don't get me going, but it was great. I gave the chicken burrito 2 out of 5. I went for the Carne Asada Burrito..... That I've read so much about. It was good, not fantastic, I gave it a 4 out of 5. The best part of the lunch was watching the 3 guys preparing the carne asada. One guy was cutting thin pieces of meat from a whole bottom round, another guy grilled it, while yet another chopped it up on a round cutting board. They all seemed to be having a good time, especially when the female customers left the room. I gave the Carne Asada burrito 4 out of 5. Everything was good about it, but it wasn't a 5.  \nIt was a pay as you order type deal, cash only. Neat counter to sit at and watch the show with a beer. Very simple menu. These guys made authentic food; they had sesos as a choice of meat. Are sesos considered a meat? I believe these are organs. I'm going back for the beer and converstion.", "author": "Miguel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-03", "description": "I ate the veggie burrito, which didn't actually contain any veggies.  It didn't matter because everything was very tasty and then they grilled it so it was also melty.  They have salsa on the table, which they had to refill after I left because I emptied the entire container.  Instead of using fresh jalapenos, they used pickled ones, which added another layer of flavor that I wasn't expecting.  I would recommend this Taqueria to anyone.", "author": "Jody S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-08", "description": "Referred here by BurritoEater.com and boy were they on the money. Not the biggest burritos in the world, but so unbelievably flavorful that you always feel like you've had an excellent dinner. Staff are cool too. I always get the carne asada which is pefectly grilled, and best of all they grill (not steam) their tortillas.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-04", "description": "Hands down, my favorite super veggie burrito. Can't beat it. I am a fiend.", "author": "Bete S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-16", "description": "I also tried this place based on burritoeater.com and I was impresed.  I have different taste from the reviewers at that site (they place a strong emphasis on cheese, while I can do without), however, I really like this place.  Good food & prices, friendly people.  Thumbs up.", "author": "Val U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "The chile relleno burrito is delicious. Their tortillas are super soft and warm. Friendly, accommodating staff.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-18", "description": "My corner-block-burrito-joint.\nI am a proud loyal customer.  \nA lotta of love for these guys.\nCarne of choice: Al Pastor\n\nBuy a shirt!!!", "author": "Dan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "indeed this place is a popular spot for SFGH employees to go to...it's about 3 blocks away and takes about 5minutes to walk there.  \n\ntheir menu is simple, yet it was still so hard for me to make up my mind about what i wanted!  I ended up going with my friend's recommendation about their tacos - fish tacos and a beef taco for $5.48 with a free basket of chips. YuMmM  Food came out quickly and was even brought to our table!  The tacos though small, were covered in tons of meat and fish.  The meat literally took up the entire taco, as did the pieces of fish.  I didn't know how to eat it without meat falling out!  Both tacos were very tasty.  I can't wait to try their burrito =P  Of worthy note... their salsa --chopped up tomatoes, onions and cilantro -- looks harmless and looks just like the mild salsa at most other mexican food joints... but BE AWARE... there's also chopped up jalapenos in it!!  despite the ongoing fire in my mouth, i couldn't stop eating it... it was so good.  My 2 other girl friends and i killed the entire jar of salsa on the table =P  Oh, and they have guacomole salsa too! but you have to ask for it.  I wish I knew that ahead of time!\n\nIf you're in the area try it, quick, easy and cheap bites.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-18", "description": "The place was pretty empty, and it was 7ish--this was the first sign that this taq might not be the place to be when in need for a mex fix. But I then thought that I may have stumbled upon a holy taco paradise. So I thought.\n\nI entered. I looked to the left--standard taqueria billboard-menu . Two classes of tacos--regular and super. I asked what was in the \"taco regular\" (which was $2.25). \"Onion, cilantro, hot sauce.\" \"Salsa Roja?\" I ask. \"Yes.\" \"Two please.\"\n\nFirstly, there was a puddle of aqua roja in between the tacos. It should not be this consistency. Now, I would be more forgiving if somehow this liquid was tasty, but it really just wasn't.\n\nEven more of a crime than the salsa roja was the carne asada. Simply bland. The carne asada is the integral part of a taco, and they flavored it with a dash too much of nothing. Even salt and lime couldn't save this taco because salt and lime is used to enhance the flavor of the carne asada, but there was no flavor to enhance.\n\nThe only decent thing about the tacos were the corn tortillas. It's not even that they were extraordinarily flavorful; they were just well-warmed and had a good consistency. Though this may seem trivial, barely warm, soggy tortillas kind of blow. It's always nice when the tortillas are done right.\n\nI give this a 2-star solely based on the tacos. It's NO BUENO--I would not come here again for the tacos. Note that the rating I give doesn't in any way reflect the restaurant as a whole nor any other items in the menu--it's simply a reflection of the tacos.\n\n-The Taco Guru", "author": "Taco G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "I actually like the atmosphere.  It's your barest taqueria, pretty miss-able from the outside, kind of Beckettish on the inside: the crowning jewel of the decorating scheme was the humungous pile of chopped onions sitting on the kitchen counter for all to see. The long Formica counter has a very American roadside diner feeling, thanks to the register-side coffee pot that was in all likelihood brewed hours ago and a medium sized TV perched on high. In reality the menu might be just as extensive as all the other taquerias out there, but perusing it takes less effort.  They've got fajitas and pescado, and other things that are laid out on a platter, but I've only had their Carne Asada burrito.  It's the best I've ever had. My bio-dad agrees, despite his loyalties to El Toro and Pancho Villa.", "author": "Reena R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "We must have been feeling adventurous when we strolled into the empty Taqueria San Francisco-- my bf ordered the carne adada super burrito meal/dinner with rice and beans.  It was like a burrito-enchilada hybrid, covered in cheese and salsa.  It was totally delicious and survived life in a Styrofoam box as we drove it home.  My risk-taking, however, didn't quite pay off.  I tried a tamale, because I love tamales and I hadn't had one in a while.  Unfortunately, it was super dry and I don't know how common/normal this is, but it had potato in it.  Which wasn't horrible, it was just weird to me.  My apologies if tamales are supposed to have potatoes in them, I'm just a white girl, what do I know?  Anyway, we were the last customers of the night and maybe that tamale had been sitting around all day but I wouldn't try it again.  Stick with the burritos and head somewhere else if you want good chips-- theirs pretty much suck.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-11", "description": "this is my fav taqueria in san francisco. don't go here expecting a \"fresh and healthy\" burrito...while the ingredients are fresh the cooking is homestyle so that means no skimping on the grease. their salsa has a vinegar tinge to it that does the trick for a hangover and is good to pour over thier corn chips. the vegetarian burritos and tacos come with huge clumps of avocado in them and are delicious and they always serve up the right amount of cilantro in their concoctions. their staff are especially talented at wrapping your log right so that none of the goodness falls out and your enjoy every last bite- YUM!", "author": "Adrienne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-04", "description": "This is my favorite taqueria in San Francisco. A highly contested category to be sure, but ohhh, I have never come closer to true burrito perfection than this place. Juicy, well-grilled super carne asada burrito with chips and salsa cruda (well-loaded jars of which are at every table) . . . it's a long walk from the 24th St. Mission BART, but it's worth every inch. Besides, after one of these guys, I could probably walk all the way to Oakland.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "DELICIOUS AND GREAT CUSTOMER SERVICE. Prices are a little higher than other taquerias but well worth it. Their agua de horchata THE BEST. Love all their food speciall the carne al pastor burrito and super nachios with carne asada and jalapenos.YUM", "author": "Maria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "i've lived in the mission for a good 10 years and this is as good as it gets.   it is painful to see people raving about places like Metate, Papalote, or worse, places around 16th and Valencia like La Cumbre, El Toro, etc., \n\nMaybe not for the light of heart - ie people to order chicken or veggie burritos or want a wheat tortilla. Order the carne asada or el pastor.  \n\nGotta go deep in the barrio to find this gem.", "author": "baillie p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-23", "description": "I was looking forward to coming here for months. I really wanted to like it, esp. because the guy behind the counter was really nice. I got two fish tacos. I also got food poisoning for the first time in my life. I'm never going here again.", "author": "ratty r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-03", "description": "Unlike the other reviewers, I didn't try this place based on burritoeater.com. I, on the other hand, was in the neighborhood and since it reminded me of a taqueria I went to in Mazatlan, Mexico, I figured I'd give it a shot. Ya see, I'm not a burrito fan at all. Burritos drove me away from Mexican food for years, but then I rediscovered the culinary beauty that is the taco. Yes, its the simplicity that wins my heart and my stomach. So of course I ordered two regular tacos, one carne asada and one pollo, received my complementary chips, and began to wait in the damned cold dining room. The doors and windows were open and it was raining outside. Finally, after about 15 minutes, the longest I've ever waited for mexican food, the tacos came to my table. They were actually damned good. The meat was tender and tasty and the tortillas were soft and resilient. The were a bit skimpy on the portions, but all in all it was decent. I would go there again if I were in the neighborhood, but I wouldn't make a special trip for this place.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-17", "description": "not very impressed by this.  the salsa is delicious, but everything was just missing something. i dont know but it definitely wasn't missing the eggs that auto and i almost got pelted with. egg snipers were throwing eggs at us as we walked down the street.", "author": "Victor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-11", "description": "best al pastor super burrito i've ever had.  period.", "author": "stephen a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-11", "description": "What's with the bitter beans here?  I've been here twice, I can't recommend the veggie burrito as I hated the flavor of their beans, but my chicken burrito wasn't much better.  This place has supposedly won awards as the best burrito in SF but the judges must have been from Boston where even a bad SF burritto tastes great.", "author": "Rusty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-23", "description": "While they're not 100% consistent, these are the best burritos in town.  They lightly toast the tortilla's which is money, and the fixings are legit.  A bit out of the way... but interesting.", "author": "Ken M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "best carne asada burrito in san francisco, fried with lard, and a substantial amount of cilantro.  very much like the burritos were here in san francisco in the 80s. edible as a regular burrito. and they leave the jjalapenos escabeche on the table in a bowl, very original san francisco style, not like taquerias of today.", "author": "christopher a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-23", "description": "My stomach just started spontaneously growling as I thought about writing this review. Seriously. I can't even count the number of alternatives I walked by on my way to Taqueria SF, but I am so glad I kept on walking and made it to my intended destination. I will continue to walk by those other places and go just a wee bit further to get to the best burrito in the city. So good! I am a huge fan of the narrower shape, it makes it much more manageable than some of the super fat burritos out there. Don't get me wrong, I'm not girlie about my food, especially not my burritos, but I feel the narrow shape is superior. For one thing, you don't have to stress out about all your fillings spilling out of the tortilla, which makes for a more enjoyable eating experience. There is still a very substantial amount of food, too. I finished mine, but that was based strictly on what my taste buds were telling me to do, it had nothing to do with how much food was in my stomach.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "Outrageously good food.  No ambiance (unless you're a gangster).", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-24", "description": "They make your burrito on the grill. Not steam it, but they literally put the beans and rice on your burrito while its still on the grill. Then they slice fresh avacado ontop. mmm. Their salsas are all very good especially the verde that they give you with chips.", "author": "jeremy r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-17", "description": "their salsa cannot be fucked with. oh man. i got eggs thrown at me while i was walking in here one time or i'd hook it up with a 5 star rating. who is this unknown egg assassin rifiling eggs from the surrounding buildings? i almost got tagged. i saw a car get tagged pretty hard by one. burritos taste good as fuk at this spot", "author": "Wats C."}
