{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "While everyone else on Mission street is running to El Farolito at 2 am, I come here. Never understood the hype around El Farolito anyways, but Taqueria San Jose can get it all day, everyday!\n\nTACOS! Get 'em! And super size them bad boys up if you really know how to get down. Their super tacos are delicious and they load them up heavily with all of the goodies. That sour cream, though! They give you SO much of it! Never a dull moment with Taqueria San Jose. Some people swear by their al pastor, but I love their chicken tacos. Call me boring, but that ish is so good. \n\nI love their salsa, especially their pico de gallo. Even at 2 am, they always seem to have the salsa bar stacked. Yes it gets crowded on the weekends, but not nearly as bad as El Farolito. The guys behind the counter work really hard and they are always super friendly! They'll remember you when you come in often, all the way down to what you like to order and how you like to prepared. \n\nThey keep it CLEAN! Hallelujah! Nothing is worse than coming from a party and then seeing all of the trash thrown around a restaurant from all of the lazy drunks nearby. They really try their best to keep it clean. I love that they're open until 3 am for all of the fat asses like myself that need a \"beyond midnight snack\" while out late in the city. It's on 24th and Mission, so super close to bart as well. \n\nIt's a hole in the wall, but the food is good and much better quality than many of the other Taquerias on the block. Because of this, they are priced a bit higher but trust me: for the portions, taste, and quality, it's worth it. An excellent choice for delicious super tacos in the Mission!", "author": "Shayla B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-13", "description": "Stopped here on a Saturday morning to get a breakfast burrito. It's super convenient that it's located right next to 24th St/Mission BART, and I figured I wanted to try a place I'd never been to before. Around 9am on a Saturday it wasn't busy at all, as expected and I ordered the chorizo super breakfast burrito. Probably try to bring cash unless you're coming with friends -- they do have a minimum for credit card so if you're getting multiple items it'll probably be okay but I had to pay cash for my burrito. Nice salsa bar.\n\nThe breakfast burrito was super satisfying, and the portions were v generous -- saved a little bit for later. Unfortunately, the only gripe I have with this place was that it took ages to get my food. There was another party eating in that was waiting for their food to be fair, but I waited for what felt like 20-25 minutes for my breakfast burrito, which is a little beyond my desired taqueria wait time, especially when it's not so busy. I would come back here, but left here a lot less excited than I was when I arrived.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Good solid taqueria in the Mission District. The prices are average but the sizes of each item are gigantic. We had milanese tortas and an al pastor super burrito. One torta could easily feed 2 people. One burrito could easily feed 2 people. The flavors here are done right. Good solid fare representing the Mission District very well. I'd return here and be happy for it.", "author": "Nicci L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Dropped by around midnight (Friday) and there was a group of people playing board games (hella hardcore). I think it's cool that a taqueria would open up their space for them - I literally had a flash to the past to the food court area of SFSU's Cesar Chavez Student Center. \n\nFood: Got the al pastor super burrito - BOMB! I have a low tolerance for spice and their salsa was spicyyyyyyy but it was soooo gooood. I was so full off of HALF.\n\nI think I found my new favorite taqueria in SF (sorry Guads)!", "author": "Erika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "Solid, cheap, easy, tasty, Mexican food!\n\nI got the super place and it came with two tacos beans and rice. Plenty of food tasty. I like that they have a lot of options for free salsa.\n\nMy husband got carnitas quesadilla and if huge and tasty.\n\nThe inside isn't super fancy, but pretty normal for a mission st authentic food experience. Great location as it's right next to the BART and easy to get to. Honestly if they had outside seating like the place next door they'd be in a really good place.\n\nWe ordered pickup online at Yelp and it was super easy to deal with. We will be back for sure!\n\nBest,\nAlyssa", "author": "Alyssa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "So my friend and I wanted to go to La Taqueria but they were closed because it was a Tuesday, so we ended up going here instead. They have a $10 minimum for credit cards so be prepared to eat or bring cash!\n\nI ended up getting the two mini burritos for like $7 and I got lengua and buche. Both were decent, though they were very standard burritos. I think I would have preferred the tacos a lot more but they were advertising these mini burritos on a sign.\n\nThat being said, the burritos were pretty big for the price and I was quite surprised at how much I got. Beyond that though there wasn't anything too amazing or special about it.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "This place is bomb!  I don't really care for their super tacos just because if you want a super taco, you may as well just get a burrito.  But if you get their regular taco and throw some of their homemade pickled veggies and the green sauce on their... Nom Nom Nom!", "author": "Andrina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Just tried their al pastor taco and it's OMFG sooooo. Good I can't even love that you can grab any salude how much you want .", "author": "Sara F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "Taqueria San Jose is steps away from the 24th and Mission BART station. \n\nI stopped by for lunch today and got a veggie burrito with guacamole. The burrito was huge. I split it with my boyfriend but still felt like I had a decent sized meal. The ingredients were pretty straightforward: the standard rice, pinto beans, guac, lettuce, and cilantro. The cilantro was the crowd pleaser. I was sad that the guacamole wasn't more flavorful- I'm a lady who loves lime, and the beans left a lot to be desired. That being said, the tortilla was thick and could've been made in house. It was definitely fresh. Theres a salsa bar available too (of course). Definitely take advantage of it and find your fave. The salsa will add a much needed kick to your dish.\n\nAll in all, I got a lot for my money and the food was decent. I'd be curious to try something else off the menu, but I don't know if or when I'll be back.", "author": "Kendall G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-24", "description": "Open after midnight on Thanksgiving. That's not nothing. And in the state I was in, I v much appreciated it. \n\nI was... yeah you know what? I'm gonna continue to call it a state but I was ya know, having some perhaps alcohol related food cravings even after stuffing my face with some incredible homemade sushi that my friends crafted while I watched, caught them up on the recent happenings in my life, and was a real do-nothing, per usual. \n\nI guess I ordered too much food. It was like upwards of $40 somehow and the real redeeming piece of the order was the carrot juice, which I found to be primo. \n\nIt took what seemed like 4 days for all our (my) food to come out and when it did, the quesadilla was for sure the least favorite. Hard to eat and the taste wasn't worth the trouble of cutting it. The nacho fries were p good if you go in under the influence of alcohol- if not... they are probably just on par. The camarones a la diabla was the level of spicy that I love, though I def paid for it for about half the day the next day. \n\nWould I go back? Probably not if there's anything else open, but if this is it and I'm super hungry and in need of sustenance I'd go for the carrot juice and fries.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Very underrated place. Very clean as well.  They have an actual roasting spit for their al pastor. So you know its legit.  I don't understand how other places don't do al pastor the right way.  Good selection of refreshing drinks. Very friendly. I recommend.", "author": "Joseph K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "Ate here for cinco de mayo. Too crowded and tables packed after lunch about 130pm. Tacos not good today. Menudo average. Get number on your receipt and the server will bring to you.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Yep. I'm hooked. I come here on average 2-3 times a month. Always a welcome and friendly staff that greet me. \n\nI'm a fan of the tacos and an occasional wet burrito, but lately the taco bowl has my heart.\n\nChicken is my favorite. Grilled it has a bit of a Smokey piquant flavor. If you are sensitive to the casual and a bit dated decor, maybe this isn't the place for you. Too bad, because you don't usually eat the decor. \n\nDo it. Come here. I'm promising you will become a fan too!", "author": "Stu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "I am giving this restaurant a 5 stars because the menudo was so tasty and one of the best menudos I've ever had, service was also great and to my surprise the prices were reasonable, I also ordered 2steak tacos and the meat was tender and plentiful", "author": "Paul n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Really good authentic Mexican comida!  They also have delicious sweet agua frescas.   Watermelon was delicious!  We had the super tacos con carne Asada.  Really Spicy too.  Yummy.  The employees were very sweet and accommodating.   Would definitely come back if in SF area.", "author": "Shelby F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Best Al Pastor tacos!\n\nWe have been going here for years. I remember the first time going, seeing the al pastor in the vertical spit-- I had to have it. I always anchor my orders in the pastor which is succulent and drips orange grease like chorizo. The tacos are huge.  Really an amazing amount of meat.  \n\nI can't understand why the lines aren't longer.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "This is the thing . In San Francisco burritos runs and I've been to plenty a burrito spots , but I always keep coming back here if you want to get full and you have a budget come here I always get the burrito super style with two back to chips because I'm greedy AF LOL. They customer service always on point. Shout out to Victor,  Who took my order and not judge my weird request. Also on Fridays evenings they have game night you can bring your board game a couple of friends and a bucket of coronas and have a good time.", "author": "Maria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Wow. I ate a lengua taco with guacamole here this weekend and I can't believe how much meat they load these things with. The portion of meat is beyond generous. There was so much lengua on the taco I can't even pick it up. Just a few bites and the weigh of the meat totally made the taco fall apart. This taco require utensils. The meat was nicely seasoned and tender. I wasn't very fond of the so called guacamole. It was more of a salsa and watery based guacamole. I was expecting chunks of avocado or even a thicker based guacamole. \n\nMy burrito with guacamole was the same. Loaded with meat, cheese, beans, rice, sour cream and the watery guac. Although the guac did not live up to my expectation the meal itself was still very satisfying. The total spent for a taco, burrito and horchata came out to $14.00. To be honest, the meal could've fed two people but being the overeating American I chose to devour everything in front of me. It is fair to say I left the restaurant with a very happy tummy. Only feedback I can give them is work on your guac and I will be back.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Ordered two sopes today, one chicken, one carne asada. Both were perfect in every way.\n\nSopes = little fried rounds of corn masa, topped with beans and meat = REAL Mexican food = delicious!\n\nThe beans were distinctive, the meats were flavorful, the masa was clean-tasting and crisp, not oily, and the salsa was fresh.  \n\nTaqueria SJ is weird: twenty years ago their food was just acceptable. Then, maybe a decade ago, something went terribly wrong: food was stale and unappetizing. Then about two years ago, someone told me the food had improved. At first I didn't even want to take a chance, but when I did, I had to agree: everything I've ordered in the last few months has been delicious! \n\nWhat happened? Change in ownership? Blessed by Quetzalcoatl? I don't know, but I now consider SJ to be one of the best Mexican spots in the Mission!", "author": "Judy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Dat cheese corn quesadilla doe. Oozing with cheese, omg..\n\nI think it was a corn tortilla vs. flour, whatever it was, it was amazing.. \n\nLooking forward to going back for that..", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Hands down, best Carnitas Taco in the world. Stop looking elsewhere.  Walk drive or fly here today. Stop wasting time.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "This is my favorite taqueria in the Mission. The food is fairly standard but it is inexpensive and the portions a large. It has tons of seating so I can always bring in a big group with no notice (game night on Fridays is the exception). The staff are super-nice. Like most old-school small businesses in the Mission, they have $10 minimum for credit cards (or .75 fee) so if you are just stopping by for a taco, bring cash. \n\nWhen I go by myself or with one other person I like to sit on the \"bar\" area facing the front window and people-watch while I eat. They also have habanero peppers in their salsa bar, which I love.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Taqueria San Jose is different from any other taqueria you'll find in the Mission. This restaurant has over 30 different platillos, featuring authentic Mexican cuisine such as tortas, mojarrita, carne adobada and several other dishes that are hard to find in other places. If you are tired of the same Mexican food (tacos, burritos and enchiladas) then Taqueria San Jose is the place for you. Five stars for this place not only because of the unique menu, but also because the restaurant stays open till late hours and has the best flan in town.", "author": "Jamie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-03", "description": "When a taqueria goes south, it can go way south...way, way south. I have no doubt Taqueria San Jose has seen better days and maybe I didn't give enough thought to my order here. After all, the little video snippet they posted under their Yelp business listing made the place sound so cozy, clean and family-friendly. Regardless, what Jamie W. and I had here was unequivocally miserable, and its proximity to the 24th Street BART station brought a whole transient element that made us feel like we were waiting for a bus to Bakersfield. And who wants to go to Bakersfield anyway?\n\nI wasn't very adventurous with my selection of a quartet of soft tacos at $2.66 each, and in response, they didn't put much effort in putting them together. It looked like they cut the tortillas in quarters and served them up like hors d'oeuvres at a Mexican fiesta party at a singles mixer. I ordered two of them Lengua (beef tongue) and other two Carnitas (fried pork), the latter of which they smothered in a watery red sauce with what appeared to be a bushel of cilantro (photo: http://bit.ly/1NqpNLQ). The lengua were better simply because there was less sauce and more chopped onion for contrast (photo: http://bit.ly/1MGGhRb).\n\nJamie ordered smarter by getting the $12 Tacos Dorados Platillo. He also got four tacos but his actually looked like tacos in crispy corn tortilla shells, each filled with grilled chicken breast and the same watery red sauce I had. It came with lettuce, tomatoes, sour cream, rice, refried beans and some very tired looking mashed avocado passing for guacamole (photo:  http://bit.ly/1k9Bjjf). There wasn't anything remotely fresh about his platillo, and the gamey aura of the salsa station wasn't helping much either. I'm afraid I did find a way to San Jose, and frankly I'm OK if I go wrong and lose my way.\n\nFOOD - 1.5 stars...disastrous tacos that didn't look like tacos and less-than-fresh sides\nAMBIANCE - 2 stars...has my bus left yet?\nSERVICE - 2.5 stars...they were fast, I'll give them that\nTOTAL - 2 stars...making the savory unsavory with less-than-fresh meats & lazy flour tacos that don't satisfy", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Great authentic Mexican Tacaqueri. We followed the aroma of food to this spot and we get right. Got the taco de cabeza, de pastor, and asada and chips and salsa. Everything was made to order and came out fast, and was good. Friendly staff, and super clean bathroom. Recommend as a stop in the area if you don't want a line.", "author": "Desiree R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Best Carnitas in San Francisco, end of story.  I can't vouch for the rest of the menu because carnitas tacos are all I ever get.  Fresh carrot/orange juice too.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-20", "description": "The word gentrification is always used when talking about Mission Street and the surrounding areas. Sometimes it's a bad thing but sometimes it's a really good thing at the same time. And in the case of Taqueria San Jose, this place could use a heavy dose of gentrification and/or a total start over. \n\nYou ever wonder where all the drug dealers come to roost and many of the folks walking around like zombies near the 24th and 16th Bart stations hang? It's at this taqueria.\n\nBut let's talk about the food:\n\nTacos Dorado: this was four hard shell steak tacos with rice and beans. The hard shells were stale! The meat was bland and rubbery. Worst Mexican food I've ever tasted.\n\nBurrito Mojado: this was a terribly bland combination of ingredients. A total waste of at least 1000 calories that I wish I could take back. \n\nThe service was fine, not really expecting much. The food on top of being bad was expensive at $25 for the two dishes. The terrible food is undesirable as the people who hang out here, it made me wish I had stuck to a sure thing across the street at El Farolito. So if you want meth or crack, come here. If you want food go anywhere on Mission Street and I'm pretty sure it will be better than this.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Incredible salsa roja and al pastor. Positively emulsified, yet incredibly, still so crispy. This place sets the damn standard!!", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-12", "description": "If you can find another taqueria that's open- go there, even McDonald's would be better than this place. \n\nBurritos are always soggy and awful looking (brown gauc, tough meat, dry rice). \nNachos were soggy and just slathered together all messy.\n\nIdk what happened bc they used to be okay, now I wouldn't even give it that high of a rating. \n\nNot to mention my stomach was killing me the entire next day...so there's also that...", "author": "Mandy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Finally, the place that got me into Mexican food! I had been a holdout for a long time, probably due to what I thought Mexican food was. I ended up going with friends, one of whom knew the cuisine very well. The result was excellent - burritos stuffed with beef, beans and fantastic sauce. I will definitely be back!", "author": "Aviah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "I went to Taqueria  San Jose for breakfast today, i had a large plate of carne asada, beans, potatoes  and eggs. The food was good, but there was nothi special about it.  It felt like the people who work there aren't  having a good day.", "author": "Siarhei F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Excellent!  I had 4 tacos (lengua, cabeza, al pastor, and carne asada.  My wife had a veggie super burrito, and we split an order of carnitas super nachos.  An excellent combination of foods that we somehow managed to eat all of.  I was drawn to this place because they have a visible al pastor spit.  Many of the Bay Area mexican spots purport to serve al pastor pork but don't seem to use the whole spit technique.  \n\nAll 4 tacos were great.  Three days earlier I'd eaten a lengua burrito at el farolito, and I'm not sure I could say one was definitively better.  But this one was quite tasty, and it certainly wasn't worse than farolito.  The cabeza was my favorite, very tender and delicate.  The al pastor was good too, although it seemed like it may have had an added sauce, which may have been a bit overpowering.  \n\nThe carnitas nachos were also good.  I would get the same combo again. \n\nThe place was not crowded at 6:30 on the Tuesday after Christmas.  A very change from throwing elbows at farolito.", "author": "Delaware F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "I really did not find anything different or special about this restaurant. Food tasted exactly the way Chevy's or Chilli's food taste; generic and boring. Honestly, I am tired of the same food over and over, so I always intend to find places that have something different from other similar restaurants. \n\nAnyway, although food wasn't bad (I ate 100% of my Chicken Quesadilla with a side of Guacamole), I really felt that the food lacked creativity. It just looked like it was made in the most traditional way, and that's exactly the type of food I try to avoid. \n\nNot sure if I would return, not it other restaurants are open. I would not mind coming here if there was no other option, but it won't be my first choice.", "author": "Federica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "Maybe I ordered the wrong thing. Tried this place based on reviews. Ordered an enchilada and got the reddest sauce I've ever seen had to be canned. Didn't taste that great at all.", "author": "Zak F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "Great place!  We always find our way there to eat when in the MIssion.  Fresh carrot juice is to die for, employees attentive and friendly (food took a little long to come out, but well worth the wait)!  Next time we're in the neighborhood you'll find us eating great food at Taqueria San Jose!", "author": "Cher P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "It's difficult to find an authentic Mexican taco shop in San Francisco but THIS. IS. IT. This place competes with some of the city's favorites, which are located on the same block (la taqueria and el farolito) and while the competition is tasty, Taqueria San Jose is simply the best because it serves up real authentic Mexican tacos the way they were invented and intended to be made. And at a very good price. Also, those free pickled potatoes after some salsa are an amazing idea. Yes, my review is for primarily for the tacos but why order anything else??", "author": "Gordon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "No line when all other taquerias have 15+ people in line at 1:05pm on a Saturday.  7 people eating here.  3 workers.  Wait time for food from order to receiving: 3  mins.\n\nCarnitas Super Burrito ($9.24 w/tax) was great.  No complaints.  Tons of flavor and meat.  No too fatty, see pics.  I will be coming back here.", "author": "Kailo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Considering all San Francisco Mexican food is garbage. Yes, I've been to LA taqueria, taqueria poncho villa, taqueria vallarta, taqueria guadalajara, etc. This is the best bang for your buck. Don't eat Mexican in SF. Period. Go to socal. If you must make your own. I am Mexican. I cook. Don't effing eat Mexican in Sf. If you like Mexican food in sf, you're either white or a coconut", "author": "Nestor A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "Nachos are one of my favorite foods. It's actually not difficult to please me when it comes to nachos either. Chips, beans, cheese, meat, guac, sour cream, pico de gallo, jalepenos. Done. \n\nTaqueria San Jose came highly recommended for burritos, but I was jonesing for some super nachos last weekend when I was done hanging around the library, so I thought I'd give it the old college try. Well folks, if you get that same feeling, I'm guna recommend you save your $11.50 for literally anything else. The nachos were a huge let down. The ingredients weren't good: carne asada was unseasoned and gristly, the beans, guac, and sour cream were used very sparingly, the chips were stale, and they threw on a couple shreds of iceberg lettuce to finish it off. This was nachos gone all wrong. \n\nThankfully my mama taught me to be creative with my food, so rather than toss them, I spruced these bad boys up at home, tossed them in the oven, added some cheese, cilantro, and fresh jalepenos, and viola! Edible nachos. But at the end of the day, when one spends almost $12 on a meal, they want it to taste good without having to go home and make it into something way better. This was a miss for me.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "Worse disgrace for Mexicans the I ordered  a regular burrito with carne asada got a vegetarian but I was hungry and ate it and it taste like s*** I could have made a better one myself at home and I ain't even Mexican man you need to go back to Mexico with that s*** that's garbage food", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "Horrible do not eat there bought 2 steak and 1 chicken burritos and all are meat was burnt", "author": "Tamara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Definitely one of the best taquerias i have ever been to. The restaurant itself is very clean unlike other taquerias i visited in the past. Salsa bar has many different options. I ordered just a single taco plate with chips & soda and was very fresh, filling & delicious. Every visit im welcomed & greeted by their friendly staff! This place rocks!", "author": "Tony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "This place is legit. Never had carne asada here that I can't chew (you know what I mean).", "author": "Sharon J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-11", "description": "Pretty overpriced for some basic ass food. The $12 super nachos are a key example. Really nice staff, but unfortunately they're not edible.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "So much delicious food, and it's relatively inexpensive. Perfect spot for late night tacos. My go to is a super veggie burrito, and I have yet to be let down. The environment is really friendly too, this is my go-to for late night tacos.", "author": "Jeremy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Best burritos in sf I been coming here for over 30 years I also enjoy the shrimp cocktail with a couple of tacos...and dinner plates are off the hook", "author": "Otto N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "It's hard to screw up Mexican food but these folks have accomplished just that.\n\nMy veggie burrito was a huge disappointment, mostly because it *looked* so delicious when it was brought out. It was quite fat so I thought it would be loaded with goodness as any decent burrito should be. No such luck! Its bulk was mostly lettuce and the scant amount of beans they gave me were whole when I was told they'd be refried. The entire thing was so dry it fell apart when I tried to pick it up, so I resorted to cutting it with a blunt butter knife and fork- not an easy task since the tortilla was tough as leather! \n\nI was so disappointed by lack of beans that I went up to the counter to ask for more and had to pay $2.75 for them. They were delicious... but really? There was something floating in them too; I think it was waxed paper.\n\nChips were good but they cost extra and you only get one little cup for salsa.\n\nWhat's more, the guy at the counter is sullen as hell and does not look at all pleased to have customers. Normally I would overlook this if the food was decent but not here. They're surrounded by endless other (better) Mexican places and should be polite to what customers they have left. \n\nI left feeling fleeced and frustrated and will not return.", "author": "Ellery D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "Pretty good tacos. Perfect for a quick lunch. Wish there were more toppings and wish all the proteins weren't cooked next to each other. As a person who doesn't eat pork, I don't like the idea that it could have been mixed. Two tacos for $5, is a great deal and filled me up.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Food was fire! Tasted and looked so fresh. They made my shrimp and steak super burrito with some TLC!", "author": "Juan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Wow, had the Al pastor taco with guacamole, was awesome! Only downside was salsa wasn't Mexican hot.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "I really like the one in San Rafael. The food was  good and service ok but rest was lacking", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "I like their burritos and like I said in the prior review nice guys behind the counter.  This taqueria is next to the BART station and some scruffy do wander in to eat.  The guys behind the counter are nice with them and never try to hurry anyone out.  Food is fine and its just a place where I feel really comfortable", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "The best legit deal in town for a huge baby burrito that is the size of my forearm. It can have meat or be veg! Also if you buy 2, then it's $7 (I'm veg). Today I can in randomly & got 1 beef for my aunty & a veg for myself as well as 3 salsas & freshly made chips for $8! I used to go to La Corneta, La Altena, & other ones  in Excelsior. But for $4, huge baby baby burritos are a must! I am now a devout client to this place cuz it's clean, fast, tasty, convenient & of course affordable! You must get your baby burritos now!", "author": "R C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-01", "description": "Some of the worst Mexican food I've had in a long while. Got the enchilada plate. Didn't eat the chicken enchilada as it tasted super gross. Old dry and gamey. Yuck. Everything else was bland as hell. Not even mediocre. Much much lower than than. Won't be coming back with so many other great spots in the immediate area.", "author": "Jason P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "Saturday morning I walked in to order a couple of burritos. I had never gone here in the morning before. The few times I've gone here, has been after midnight. Never had a problem with my order. \nFood always tasted good. Saturday morning was a different story. I ordered a super carne asada burrito. With everything on it except lettuce and hot sauce. The nice lady assured me that it does not come with lettuce. Cool I thought. I HATE LETTUCE IN MY BURRITO!!! \nThen I ordered my friend's burrito. She's vegan. So I know how to order her burrito. I saw a sign for their grilled veggie burrito. It sounded perfect for her. The nice lady at the counter walked me through the burrito and what it all came with. \"This burrito comes with lettuce. Do you want lettuce? I asked for all the veggies it came with except zucchini and lettuce. Then she asked me if I wanted cheese and sour cream. I CLEARLY TOLD HER NO SOUR CREAM. NO CHEESE. \"No sour cream n cheese?\" she asked again. AGAIN I said NO CHEESE NO SOUR CREAM, NO LETTUCE. By the way, I ordered in Spanish. So I know there was no language barrier. The nice lady understood my order. I saw her clearly mark down the instructions for the burrito maker to follow. I ate my burrito there while I was waiting for my friend to show up. We had a long ride ahead of us. She decided to take her burrito (the veggie one) with her and eat it when we got to where we were going. An hour later. We get to our destination. She is hungry. She couldn't wait for that \"Grilled Veggie Burrito\" that I had described to her. She starts to unwrap her big burrito. She was talking about and waiting for this moment the whole morning. \nShe takes a big bite. CHEESE AND SOUR CREAM. CHEESE AND SOUR CREAM. CHEESE AND SOUR CREAM!!!! She almost cried. I was furious. It also had LETTUCE in it. I was an hour away so I couldn't just go back with that burrito to show it to them. We couldn't bring food and I wasn't about to carry a burrito with me all day. Believe me I was so upset I wanted to. I failed my friend and it ruined our morning. I think there needs to be more accurate communication between whoever writes down the orders and whoever reads them and makes them. Get it right!", "author": "Stormtrooperfiftytwo E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "All I can say it try the al pastor super taco. It made me fall in love with al pastor. I also love the fact that the they offer radishes along with peppers at the salsa bar. The chips aren't the greatest, but who goes to a taqueria for the chips?", "author": "Eric K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-09", "description": "It was late and we wanted some Mexican food since most places were closed after 9pm, we ran into this location and decided to give it a try. I only good thing about this place is the fresh house made aqua frescas. We ordered carne asada plate the food was cold, no flavor, no taste, it was bad. the ceviche was horrible. Not coming to this place anymore. To top it off they charge for chips,  chips that taste horrible.", "author": "Rosa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "In shock my parents went here tonight to buy 4 burritos when they checked out they man automatically charged a 18% gratuity when my dad asked why the cashier said \"they have the right to do that bc it's there choice to add\" so watch your receipt closely! When we called back they said we can come back and get our money! They are illegally adding tips! Burritos were very dry too!", "author": "Pete Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "You have many choices in the Mission for greasy food. This is, an okay place. I went here about a month ago with a group friends, and ordered myself a nice, meaty quesadilla. It was on the greasy side, but tasted pretty damn good. You have to pay extra for chips, and that's not too cool. There was plenty of places to sit, at least when I was there, and it was a Saturday. If you want something for the long haul of night drinking, this is a good place to start.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Randomly stepped in here for lunch. Got two super  tacos (al pastor and carnitas). They were freaking huge and delicious. Can't think of a better way to review them. I will definitely go here again.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-13", "description": "Saturday afternoon. Carne asada super burrito.\n\nServer seemed bored and uninterested. Food was okay. Not great, not good, but okay. Tortilla was flaky and fell apart. Carne asada was mediocre and tasted plain. Guac was not great either.\n\nConsidering the ridiculous amount of excellent options for taquerias in the area just across the street and down the block, \"okay food\" doesn't really cut it. I would not return here.", "author": "Victor S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "My friend and I were frantically hunting for Mexican food on New Years Eve around our usual places at 24th/Mission. You know what cravings I'm talking about. Everything near the BART station was pretty much closed except for Taqueria San Jose. SCORE!!\n\nWe both shared the Super Nachos ($11) which adds guacamole, sour cream, and cheese onto the regular nachos. Everything tasted mushed together, but we were craving Mexican food so it was still very satisfying. In fact, for some reason it made me crave Taco Bell. Anyways, there is plenty of seating here, so you don't have to worry about taking your food to-go on most occasions. Props that they accept credit cards with no minimum and were open on NYE when nowhere else was.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "This place was amazing! Loved the tacos and enchiladas. I could not stop eating the salsa and pico. The beans and rice were not too salty. So good.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Love this place. So convenient 2 block away from us. Good food and drinks...... 10+.  Highly recommend. \nThey open late and always pack. Recommend rsvp 1st", "author": "gigi t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "really good service. had a good first few bites and spent the rest of my meal trying not to gag. also an employee was confused when asking for forks ?", "author": "Emma S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "If you are looking for a shitty, expensive, and just not good at all taco go here. Also, if you want stale chips that you have to pay for go here too.\n\nI rather go across the street to la taqueria, or el farolito.", "author": "Davis E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "THE BEST BURRITO IVE EVER HAD!!!\nit was one of those situations where you don't want the meal to end so when the burrito was almost finished I started taking smaller bites and prolonging the enjoyment", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Best street taco joint in town. The carne asada is juicy and chock full of flavor.\nThr ultimate meal here is frijoles and rice and ensalada and al pastor tacos\nJalapeno pepper radishes spicy salsa verde grilled mexican green onions lime quarters and an icy tamarindo melon or\norchata and or pollo asada or carnitas on a plato with all of the above. No other tacqueria in the mission comes close to their al pastor. The menudo is suitably spicy and the birria is through the roof.\nFoodie heaven. But kept real. Find out yourself. This is it.", "author": "Bob R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-23", "description": "Nothing to complain about, just didn't quite match the El Farolito's and Papalote's of the world for me.", "author": "Steffan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-19", "description": "Cannot believe all the high scores this place.\n\nSingle bite into a burrito al pastor, it oozes red thick oily substance. Like a bad pimple on a burrito that never ends.  The al pastor is tastless and full of fatty oil.  Chucked it after 2 bites.  No flavor what so ever, first time pork fat does't rule.  I rarely waste food.  Rather in the garbage than in my belly.\n\nThe al pastor they have in the picture is for show, I saw the cook got mine from a special stash in the cabinet.  Guess he gave me special stuff that they save for special guests.\n\nAsk yourself why does the al pastor the have in the picture and in store so picture perfect.  Do they ever cut from it?  Is it wax or real?\n\nSorry, hate to write these terrible thoughts, my fav is still Gordos and many others.\n\nAll the folks in this place on a evening (2 others in an empty place) was not even latino... another tall tale sign.\n\nYes I have been to Mexico several times, never seen this low grade quality products.", "author": "David H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-13", "description": "The \"first\" taqueria in SF? PUH-LEASEEEE...that's like me saying, \"I'm skinny\" and we all know that's a damn LIE. \n\nAfter having yet another disappointing drunken meal; yes, you would think I would have learned my lesson by now but this time I SWEAR it wasn't my fault. We somehow ended up at Taqueria San Jose Sunday morning when I told my friend to drive to Mexico Tipico. I guess someone was drunkER than the rest of us. :T \n\nUpon walking into Taqueria San Jose and seeing all hipster and no natives, I already knew this was going to be bad. However, looking at the menu seemed a bit more promising because they had lengua and cabeza which only more authentic taquerias tend to have. \n\nSUPER LENGUA BURRITO w/ No Rice, No Beans, & No Cheese (crazy looks from the cashier not pictured)\nhttp://www.yelp.com/biz_photos/r0N9vb7G4Us8HEG20v4NkA?select=6jk8Ka25SHFWq7F3hNbsvg\nMy burrito was one disappointing soggy log. The juices from the pico de gallo made the tortilla limp and wet. The copious amounts of crema was overwhelming and made each mouthful difficult to eat. The lengua? What very little lengua there was, were diced in microscopic cubes; the onions in the salsa were larger than the lengua pieces. The lengua was not braised long enough as it had a tough and hard texture. It was like eating a burrito after it has been weathered in a rain storm; several bites in, I threw in the towel.\n\nOne of my friends drunkenly threw a slice of carne asada in my basket which was equally as bad. The tough as shoe leather carne asada was cold, dry, and flavorless. http://www.yelp.com/biz_photos/r0N9vb7G4Us8HEG20v4NkA?select=dTy_2rRSgJwpAaxu08YAAg\n\nJust because you're catering to the drunk crowd at 2 AM doesn't mean you can serve subpar food and for some of them to not take notice. Nothing can phase this drunktard's taste buds. \n\nOne star for being clean and well-lit. \nOne star for the delicious salsa verde. \n\n***HITS THE REMIND BUTTON***\n\nBack to the start of the review, as I was walking to the bathroom, I remember seeing a sign saying that Taqueria San Jose was the first taqueria to open in SF in 1980 (makes no sense even sober). To confirm that I wasn't being delusional, I checked their website which Taqueria San Jose does state themselves as the first taqueria in SF to open in 1980 under \"our history\". Ummm, if you're going to lie, please do a better job. La Cumbre was the first taqueria to open in SF in 1967. I knew ALL those hours vegging on the couch watching Man vs. Food would come in handy one day. Thank you, Adam Richman!\n\nOTHER NOTES:\n*Closes at 3 AM on weekends\n*Plenty of seating\n*Free chips\n*Salsa bar only has pico de gallo, salsa rojo, and salsa verde\n*Near 24th/Mission Bart stop\n*CC's accepted", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "Solid taqueria in the mission. The dining area is large and the line doesn't get too long. i got a lengua super burrito and it was very flavorful. They have good aqua frescas too -- I got the strawberry and it was yummy.", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "Went here with a friend one day looking for burritos and ended up with a carnitas burrito and chicken taco. The food was good but average at best. It was no more expensive than your general Mexican place, with about $8 for the burrito. The taco was definitely a bit overpriced and with the quality of it, I felt like I could have gone without it. Mainly because the burrito itself comes huge and packed. Overall, the place is an average stop if you're looking for a decent spot to eat as you're walking the city.", "author": "Denzel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "A lot of people review this place as a comparison to El Farolito, and while I can see the resemblance (open late, on opposite corners of the same intersection, and same category of food) I don't think it's necessarily a fair comparison as they offer rather complementary features. \n\n1. Taqueria San Jose has more space, bar none. So much so, they host a Friday night board game night (or maybe magic the gathering? Scrabble? I can't always tell, but I think it rotates or they host a mix). \n\n2. UPDATE: they no longer take credit cards :( Taqueria San Jose takes credit cards, and if it bothers them that I spend ~$6 each time, they never let on.\n\n3. Taqueria San Jose almost never has a line. I can usually order, pay, and be out the door with my grub in 5 minutes or less.\n\n4. Taqueria San Jose night shift rocks! I think the food is better after 8pm because it's busier, which means the food is fresher. I've only heard complaints from people not sober enough to judge, or people who came during the day... But this could totally be coincidence/superstition.\n\n5. Taqueria San Jose's super taco is my jam (I've never had anything else). I might get the pollo adobo or al pastor if I'm especially hungry/hankering for some grease in my gullet (if you're hungry but don't want the grease, the pollo adobo is your best bet), but the vegetarian super taco is usually a satisfactory quantity of food. It's a fork and knife endeavor when you eat it out of the to-go container, or on a plate you can try to separate the tortillas to make two large/messy tacos. My only (small) gripe here is, even though it's *exactly* the amount of food I want (which helps with portion control), it's about 2/3 the price of a burrito, but only 1/3 the amount of food. Evaluating price per calorie, this is not strictly budget-friendly, but it's awesome if you're looking to fill your belly to a reasonable bloat on less than $6 without leftovers.\n\nMostly I guess I'm just impatient. I think the food is (all things considered-- remember, I've only eaten the super taco, and that's not something El Farolito offers) just as good as their neighbor, but I don't like to wait in line/make sure I have cash/be forced to take it to-go because there aren't enough seats inside. As such, Taqueria San Jose is my hidden-in-plain-sight gem.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Given its location, it can be overshadowed by neighboring La Taqueria and El Faritlo - but definitely give Taqueria San Jose a shot. The breakfast burritos are bar none, and you can get any burrito as a baby burrito size, for when a full sized burrito belly seems like a bit too much.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Went walking around SF with friends and got suuuuper hungry. Found this place only .3 miles from us and OMGGG it's amazing! I ordered the super burrito of carne asada and it was huge! With rice, beans, cream, meat and guacamole for only $8! A great meal for cheap? That's what I'm talkin about!", "author": "Marisol M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-31", "description": "They should use salt and pepper at least when cooking meat. Had to eat only cuz I was very hungry", "author": "Fabian E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-25", "description": "Went here one time when waiting in line for a burrito at La Taqueria or El Farolito seemed too overwhelming.  Big mistake.  I ordered an al pastor super burrito and it was genuinely horrible.  The al pastor seemed to have tons of gristle, and I had to throw my burrito out less than a third of the way through.\n\nIt's hard to think that anyone could combine tortillas, rice, guacamole, salsa, sour cream, cheese, and meat and end up with something bad, but the folks at Taqueria San Jose seemed to accomplish the feat.\n\nGo literally anywhere else.", "author": "Victoria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "One random evening, my boyfriend and I stumbled into Taqueria San Jose to try out some micheladas....the best idea we ever had! Til this day! So much flavor and the perfect amount of spicyness! The tacos &burritos aren't bad either! This is a real hole in the wall for me! My bf & I call it our \"big meech\" spot, cuz with these micheledas, you can never go wrong!", "author": "Ruby G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Must go place for Tacos de Camarones:) I really like them. Their salsa is also awesome!!! And it's in a nice location which is next to the Bart station.", "author": "Maitai N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-29", "description": "You ever had dinner at a friend's house and you ate the meal as to not offend the host? That was me with the bbq pork burrito. It was \"meh\" at best.\nAnd on top of the limited food experience I had there, I can say the ambiance is not very inviting. The salsa bar was tucked away far from the register and all closed up with no indicators around it that we should approach this makeline cold case, much less open it up and help ourselves to whatever could be inside it.\nThe staff were great though! Just an unfortunate taqueria.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "You either love this place or you hate it. You can group me with the former. I suppose it's because Taqueria San Jose was the first place I ever tried a Mission-style burrito, many years ago. Back then they had a second location directly across the street from this one! Nowadays the place has a fresh coat of paint, is much cleaner and the restrooms are pretty nice.\n\nTSJ has the the biggest burritos I have come across anywhere in the Mission, which is saying a lot. They are a bit juicier than others as well. That might turn some people off but I like the extra moisture. You're guaranteed never to get a dry burrito. My usual order is an al pastor super burrito, no beans. Most places will just serve you a smaller burrito if you order one without beans, but TSJ ups the amount of meat and rice to make up for it. Solid. The al pastor is always juicy and flavorful but can sometimes lack those crispy edges that make it something special.\n\nI miss living around the corner from this place. How much do I miss it, you ask? I once drove 10 burritos home to LA, froze them and rationed them out over the next few months. True story.\n\np.s. I just read a two star review by a woman who complained about the lettuce making her burrito watery. What did she expect?! TSJ doesn't put lettuce on their burritos. The fact that she special ordered one with lettuce should automatically cancel out her review.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Been here a few times. I always get the carnitas b/c they make them crispy here. Sometimes it's awesome w/ the perfect combination of crispy and tender. Sometimes it's way too dry. Burrito was a bit bland and not very well mixed, but their salsas (chile verde!!), horchata and customer service are always bomb!", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "I have made this a stop before many business trips, just before flying for many 10+ hour flights.", "author": "Jeff Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-18", "description": "Food looked really good!  I posted a pic!   But it was bland.... :(  So peculiar!!  \n\nWe had lengua & al pastor tacos and a Chicken burrito.  All were not very flavorful.   lol, even the pico was bland (but spicy!).  How is that possible??  \n\nGood service, the guy was really nice.", "author": "CatwomanRoar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "This is my favorite taqueria in the Mission. The food is always so great and the staff are super friendly!", "author": "Erica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-01", "description": "To be honest they were quite the disappointment for me, unfortunately. Burrito was a bit of a watery mess thanks to the drenched lettuce. Towards the end, burrito juice was running down my arm and the tortilla was soggy. Not only that overall flavor was somewhat bland. Chips (which tasted of the bagged variety) are 85 cents.\n\nService was fine. The person who took my order was fine. I noticed there was only one person working the kitchen. But then again this was in the evening, an hour or so before closing. \n\nToo bad. I wish I liked them. It would be easy to pick up a quick dinner here in the evening as I exit off 24 Street BART.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I'm not a breakfast person. If I MUST be up early and need some food in my belly, its gonna be lunch/dinner food. Right before a tattoo I'm gonna need some serious grub (read: BURRITO). Taqueria San Jose to the rescue! They serve their entire menu starting at 8 am. Not only was my burrito al pastor very large for 7.95, it was made quickly. Their al pastor is the truth! That plus the fresh pico de gallo and the fluffy rice made this one of the best burritos I've had in the mission. I'll be back for more serious breakfast.", "author": "Sunshine R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-04", "description": "New Year's Eve and the craving for Mexican food was strong. My friend and I walked around for so long trying to find a place that was open. We were both so excited when we finally saw the open doors at this place. \n\nWe shared an order of Super Nachos and it was decent, but ain't got nothing on El Farolitos. They were generous with the amount of meat though and their pico was better. The nachos themselves were mushed up but it was a great way to satisfy my cravings. Props to being open on NYE!", "author": "Winnie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-18", "description": "This is the first (and so far only) place I've ever thrown away food from in San Francisco.\n\nOrdered an al pastor burrito around 8:30pm one night.  It was far too greasy, with red al pastor grease literally streaming (not even dripping) out of the bottom of the burrito.  Maybe it was just my bad luck, but the first 3 bites were also mostly gristle.\n\nThew the whole thing away and went elsewhere.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-01", "description": "Worst burrito i have ever had. And i've had a some bad burritos. Only one of the salsas was even edible. I've heard the street tacos are good, but nothing could make up for that burrito.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "We come by Taqueria San Jose on the occasional Friday night to join the SF nerds for board game night (random people bring board games and you just join in, every Fri at 7pm)\n\nLuckily, in addition to this place having a lot of space for people to spread out and play board games, their food is quite good too. Our favorite is their carnitas meat, which whether loaded into a burrito, torta, or taco is incredible flavorful, generously served, and reasonably priced.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "It's okay, burrito was good. Not spectacular but still good. Even though there was a piece of paper in my burrito at the end. Also, the 2 burritos ordered were ready really fast, so that's a plus", "author": "Erich P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Came here at 2am for Halloween and it was crazy packed. Other than that, it was soooo good. I got the al pastor burrito and it was delicious. Everything comes with free chips and salsa. Overall great experience and I would definitely come back.", "author": "Samanyha O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-30", "description": "This place is the perfect example of a business based on fleecing the guest. Your a Mexican restaurant but you charge for chips and salsa, limes and even ice in your complimentary water. No salsa bar so you have to ask for it which is an extra charge. A good example is that Nachos are $7.50 but Super Nachos are $12. What kind of meat cost an extra $4.50 to add?? Just another business trying to prosper on stupid white people that insist on hanging out on the mission. FML...", "author": "Santana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "For a long time my 24th and Mission burritovision was tunneled In on El Farolito,  however, after a long time missioner raved about Taqueria San Jose, I widened my view just a bit.\n\nI got an Al Pastor super burrito and found it to be crazy flavorful.  It had just the right mixture of spicy and tangy to keep my taste buds happy for the whole burrito.  San Jose seems to go a bit lighter on the rice than El Farolito, instead opting for more meat, salsa, and grac to stuff their burrito.  This didn't write work for me, but I imagine for some people it will be awesome.\n\nPerhaps due to the lack of rice, the burrito also super greasy. I can imagine this might be a good thing if you're stopping by after a night out, but it may give you feelings of regret during the daytime.  It didn't ruin my experience, but it may for you.\n\nThe one area where San Jose is lacking is burrito construction.  The bottom of mine fell apart pretty quickly, so I was left to cleanup the leftovers with a fork.\n\nNonetheless, clean up all the leftovers I did, as the deliciousness of the Al pastor made up for all the downsides.  San Jose hasn't unseated El Farolito in my mind, but it's definitely a respectable entrant in the mission burrito rotation.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "My favorite spot in the whole 24th and Mission area. Tacos de lengua are delicious. Salsa is pretty fresh. And the aguas frescas are pretty good. My fave are the quesadillas. Restrooms are fairly clean also. Always gotta stop by if I'm in the neighborhood.", "author": "Georgina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "I usually get their super nacho, and I think it's the best I've had in the mission. Always give you a lot and never stingy about meat or avocado !", "author": "Keith A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "I've been going to Taqueria San Jose for many years. If you want a great burrito, I recommend El Pollo al pastor burrito. It has the Great Taste of al pastor without the pork. This is one of the very few  places that have chicken al pastor.", "author": "Ronald M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "Cash only, what is this an illegal run business in Mexico, $1 for a batch of stale chips, rude cashiers. \nIt's the only thing open this late and I was starving, so nex time I will plan ahead and avoid this place at all costs", "author": "Roger Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "We had a ceviche tostada and chorizo, carne asada, and carnitas taco.  There was a lot of meat in the tacos.  Salsa wasn't spicy, but tasty. The tacos ate made with the small tortillas.  I always like the pickled carrots and radishes at the self serve area, you can get as many as you like :)\n\nThe pastor meat looked really good, but I was full.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "SOLID four stars.\n\nnow, as you may know, i preach about how amazing tacos are in san diego because it's where i lived the past four years.  i've been on the hunt for a replacement late-night mexican restaurant for quite a while.\n\nthis is my TENTATIVE replacement.\n\ni've eaten here twice and gotten takeout twice.\n\ni LOVE that they have different kinds of salsa because.... that's my thing.  i don't LOVE any of them, but i do love variety :)  \n\ni REALLY like their super burrito because it's HUGE and mixed the perfect amount.  \n\ni also really enjoyed their tacos because of some special spicy pico de gallo they put on it.  i wish they put that salsa in their burritos!!\n\nthe variety of food they have here is nice!  it's also decently priced and there's plenty of room to sit :)  the guys working there are also super nice and patient (because i take forever deciding). i hear this place is open really late too!!  wish i lived closer or else i would come here more often.  SF needs some more late night drunken munchie places.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "Awesome burritos- big and flavorful. My parents used to come here when it was starting 25 years ago. Still good!  I wish they were cheaper so I could come here more often but they are not bad, about $7-8. Make sure to add the green salsa and pico de gallo too. \nThe enchiladas were okay but the burritos are the star of this place.", "author": "Hannah F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-17", "description": "The only positive thing I can say about this place is that they accept debit. The food was very tasteless and dissatisfying. I ordered a Carne Asada super burrito and was very disappointed by the lack of flavor, no amount of salsa could compensate for the flavor.", "author": "Reina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "I first moved to the US 2 years ago and my wife took me here for my first super burrito and I have never looked back! \n\nI've now eaten my fair share of burritos but there's something about the way they cook the meat, especially the carnitas, that really makes them. \n\nTheir salsa bar is always full and ready to be taken advantage of. Would recommend this place to anyone!", "author": "Max R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "ASK FOR CHIPS!! Salsa is on the side counter.\n\nThis place gave me the most delicious nachos with pork. Yummmmmyyyy. A couple of friends got drinks from next door, I brought the nachos over, and it was more than enough for everyone to snack on. $8 wasn't too shabby of a deal!\n\nI didn't try anything else at the location, but the service seemed fast. This is a in and out type of restaurant, I didn't stay for long, so I don't really have anything to say about the ambiance. \n\nIf I find this place again with friends, I will be back.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-19", "description": "this Taqueria San Jose must be the black sheep of all them name-alikes. it's the priciest and least tasty.\n\ncleanliness they exceed at. (much cleaner than oaktown)\nroomier than san rafael.\n\neats: lengua burritos (6.99)\n-tender lengua, what there was\n-so so salsa, rice, bean mix\n-quick, cordial service\n-quality food, no (chemical) aftertaste\n2.5 stars\n\nfrijoles refritos:\n-value isn't present. 2 stars.\n-heartell al pastor is excellent here...", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "This place ranks high on my list of reasons to miss San Francisco.\n\nHands down, best burrito I've ever eaten.", "author": "Connor I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-22", "description": "Taqueria SJ is my favorite taqueria in SF.  They give you FREE chips and 2 small containers to fill with their salsa at the salsa bar.\n\nTacos are only $2.21 so cheaper than La Taqueria.  \n\nWe got:\nal pastor taco- bbq pork.  Very tasty.\nlengua taco - lots of meat, tasty.\ncabeza - beef head - nice\nceviche tostada $2.5 - lots of chopped up marinated red snapper w/ onions & sliced ripe avocado - nice\nmedium strawberry drink $2.10 - nice\n\nAll for about $12.  I saw a sign for credit cards, but we paid cash.\n\nSeparate bathrooms in the back.  Next to 24th Bart Station.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "This place meets all expectations. The food was really good. We went on a Saturday and the Caldo de Res (Beef soup) was really good full of flavor and they accommodated my request of ordering just half a bowl. We also ordered the carnitas burrito which the meat was really good but the rest of the fixings where lacking taste. Regardless it was really big, something to just share between two people for sure. Highly recommend this place, much easier to order and less hassle than Taqueria. Also the dinning area accommodates a bigger group with plenty of room to sit and enjoy your meal.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "Gave this place a shot when the other places around didn't take credit card- and I'm not gonna lie, this is probably one of the worst burritos I've ever had, and coming out at around $10, was by no means cheap (especially since I now have to buy a second dinner after eating almost none of it). Got a chicken \"super burrito\" mainly for the guacamole, of which none could be found. Flavors managed to be both bland and unappetizing, nothing tasted fresh, and the chicken tasted \"gristly\", with a really odd consistency. As a benchmark, Chipotle is about 1000x better. Next time I'll remember my cash and actually check out Taqueria El Farolito like I'd first planned!", "author": "Alice T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "My wife and I were jonesing for a late evening treat before getting on the BART to head back to East Bay. We'd just spent a number of hours at a bar and had then headed to Mission district to check out the Dia de los Muertos action, so we were still a little tipsy.\n\nWe decided to order quick food - Tacos and a Quesadilla. My wife's Tacos were an A-, my Quesdilla was a solid A. I don't remember the kind I ordered, but it had Guac and sour cream inside, and I'd never had it that way before. Mighty tasty, in my opinion. The salsa was fine (tried both green and red) - nothing spectacular, but satisfying. My wife's Horchata was a little gritty - she didn't mind so much, but that's not how it should normally be served. \n\nThe place was packed at 11 PM, mostly with people from the evening's festivities, and the employees were doing a bang up job considering the circumstances. \n\nBTW, I find all the Groupon people reviewing this place to be rather whiny. Stop being cheapskates and actually review a place on the food for a change.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "I have now had their chicken burrito a few times now. The sauce that the chicken is stewed in is so delicious. Flavorful but not overly spicy. It is also so large that it serves as dinner and also lunch the next day.... Just watch for dripping of the sauce through the to go bag. Even better, bring your own container", "author": "Miri R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "This is my Go-To Taco spot when I'm at 24th and Mission. Sure , there are a lot of places to go in the Mission, but if I'm headed home from Bart - you better believe that I'll be stopping off for a Super Taco. \n\nThe super tacos are so big, I like to use chips and treat it like nachos until it gets down to something I can handle. I usually just order one, not because I'm a cheap date, but because they are huge. \n\nYes you have to pay for chips now, but in these economic times ~ $1.50 for a huge order of chips is not going to break the bank. Get over it. I overheard this guy complaining about it, saying he was going back to Noe Valley where the chips are free. I laughed my a** off, Taco + Chips + Salsa + Free Comedy for under $6.00.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-25", "description": "I had a super burrito with al pastor.  The only thing super about it was it's size, and the guac was pretty fresh and tasty.\n\nThe burrito itself was not unlike an old man sans viagra: limp and prone to premature ejaculation, as it fell apart only 4 bites into my dinner.\n\nNeedless to say, I was sad and disappointed that this was my last meal before i left.", "author": "Tony N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "Chicago is famous for its pizza, Philadelphia for its cheesesteaks and Kansas City for its barbecue. San Francisco's claim to Roadfood fame is the burrito, the best examples of which can be found in the city's Mission district. Located half a block from the 24th Street BART station, Taqueria San Jose has been lauded year after year by various local publications for having the best burritos in the Mission and therefore the best in the city. It won't take you long to figure out why.\n\nFormica tables and plastic chairs crowd the unassuming storefront, decorated with the paintings of well-endowed senoritas and matadors, mariachi music or a soccer match on TV providing the soundtrack. But one comes not for the ambiance, but for the food. Place your order at the counter, pick up your basket of freshly fried tortilla chips, load your little plastic cups at the salsa bar (go for the outrageously fresh-tasting pico de gallo and/or guacamole), and munch away until your number is called to pick up your food.\n\nThe burritos are, in a word, humongous. Two-fisted eating at its finest, a massive fresh flour tortilla stuffed with your choice of meat, rice, refried beans, cheese, sour cream, salsa and guacamole. If you're not burrito-minded, you won't go wrong with the fajitas, meat and peppers and onions heaped high, or the tacos. Think there's no such thing as non-greasy chorizo sausage? Then you haven't eaten a Taqueria San Jose chorizo taco, redolent of spices that are eased by sour cream and another freshly made tortilla and not a speck of grease in sight or on palate.\n\nTaqueria San Jose has two other locations closer to the touristy sections of San Francisco and I'm told that the quality is the same, but when in doubt, go to the original. I can also say that the leftovers from a carnitas (pork) burrito make a pretty darn good breakfast. \n\nPS--this is a re-post of my Roadfood.com review, which, I am proud to say, is now framed and hanging in the shop.  I wonder if I'd get a free burrito if I showed my ID ... ?", "author": "Patricia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "From out of town and had heard of the mission district burritos. Tried the other places there was no place to sit. Found this place and found food to be outstanding.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-11", "description": "I haven't been to this taqueria since Clinton was our president. It has changed and gotten a lot cleaner. The price has increased since the last time I was at SJ Taqueria. $8.00 for super-burrito and soda,it's still cheaper and tastier than (what's that place on 16th and Mission called?) They give a score of 100 for cleanliness. It has changed. The lavatory is cleaner with no graffittis. \r\n\r\nIn 1999, i used the bathroom, I see all the Tags and graffittis on the wall. The most stupid one I saw written was,\"DON'T WRITE ON WALL\"\r\nThat made me wanna pee on the wall to wash out the written request. Now this place is better and cleaner,even my piss on the wall is gone.\r\n\r\nOh yeah, the place on 16th and Mission is \"Pancho Villia\", that place is expensive and mediocre.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-26", "description": "The people who work there are not nice. \n\nThe food does not taste good. \n\nIt takes FOREVER to get your order. \n\nI'm not sure how this place has as many stars as it does. There are so many other amazing taqueria's in the mission.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Recently discovered this place and I was not disappointed. They have menudo and birria on the weekends super yum. A lot of choices and al pastor on trompo! Definitely as much as I can", "author": "Montserrat S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Like everything here! Staff are friendly! Always busy there! Food is fresh! Downfall: Bathroom is gross", "author": "Susie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-11", "description": "I'm not sure why I never found this place before! \n\nAfter the line at El Farolito was out the door at midnight, we ended up at Taqueria San Jose for some of the fattest burritos I've had in a long time. They had friendly service, mouthwatering carnitas, and they were serving sangria long after most places had stopped serving at all. \n\nA friend got the al pastor burrito as well, and I almost ate hers too. I usually go to La Taqueria when I'm in this stretch, but I think I just found a competitor.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "I usually go to Taquerias El Farolito\nI was pulling up and there was a spot right in front of San Jose. I parked and decided to give it a try.\nIt was awful. I got the enchiladas\nThey were cold and stale tasting. \nTaquerias El Farolito there is no comparison!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-01", "description": "Disappointing.\n\nAfter several attempts (the woman at the counter had a very strong accent) I managed to order a burrito, though she got the drink order wrong. They won't put salsa on a burrito, they want you to open the wrapped burrito and add it from their self-serve bar. This of course means the burrito will fall apart. They also don't put napkins out, nor did they give me any with my burrito. There are good taquerias in the mission, this isn't one of them.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Great place :) crew was nice and I left with full and happy belly :p everything was fresh and tasty", "author": "Radoslaw D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "I've been here a few times before and the food was good, though not as good as El Farolito. Sometimes I just don't want to wait in that line though and tonight was one of those nights. That was a mistake as I was very disappointed with my food. Ordered Chile Verde and I thought they gave me the wrong order. It didn't look our taste anything like it. Had a weird sour taste and had more giant chunks of fat than meat. I love the Chile Verde at Pancho Villa on 16th. Go there instead!", "author": "Dora L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-24", "description": "I got a cheese enchilada and gave up eating it about half way through. The cheese is  gross. Guac is watered down. Salsa is bland. I ended up scraping off all the cheese and eating plain tortillas with rice and beans soaked in pico de gallo :( Now I have a stomach ache and I'm still hungry...\n\nMore importantly, I had a groupon type certificate for $10 off and the cashier told me her Manager had to verify certificates and wouldn't be back for several hours. She told me to try my certificate at McDonald's or Denny's... I proceeded to show her that it was specific to her restaurant and location to no avail. \n\nI'm sorry I gave them a chance....", "author": "Dharam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "Again, I think this is more of a meat-friendly place, but their veggie stuff is decent, and they have good salsa. If I remember correctly their veggie tacos should be measured in butt-tons - as in yeah, they're really big.  \n\nAnther plus is that this place is clean. Overall, this is a pretty choice little spot.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "I'm going to be honest, the food isn't exactly the greatest in the world.  It's good and it definitely hits the spot, but that's not the reason I go here.  The reason I go here is because they're apparently cool enough to let a bunch of nerds take it over every Friday night to play board games, which is something insanely cool for a taqueria in the Mission to do.\n\nThe al pastor is really, really greasy, though.  It's manageable in a taco, but burritos just drip.\n\nRecommended:\nCarnitas burrito\nAl pastor tacos", "author": "Norman S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "This is my go-to place when the line at El Farolito is long, and all I want is a massive super taco. It's massive, buried in meat, and covered in guacamole. I don't order anything else.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-02", "description": "Seemingly \nSolid \nsuper \nsteak \nburrito\n\nthat got me sick last time  :(\n\nLast tme, key word.\n\nthe end.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "I love this place in Mission near 24th. Right off of the BART this place is awesome. Their burritos are as big as my arm and full of meat not just beans. The enchiladas are awesome and they have some of the best carnitas I have ever had. I eat here once a week it's so good. Check this place out its worth the trip.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-28", "description": "This is our go to late night munchies corner! There aren't that many places you can hit up at 4 AM after a night out, but I don't think this place actually closes. I also come here during the day, and it's always the same three guys working the place...hardest working people in SF.\n\nThe pico de gallo is to die for. Super spicy and yummy. My boyfriend always gets the super burrito and its huge and delicious. I'm a big fan of the carnitas tacos and the chile relleno.", "author": "Kexin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-17", "description": "The food is great although I felt like I was in a fast food restaurant. \nThe service is like the one in a fast food restaurant, not very friendly. \nThe ambiance is just cold and not very welcoming. \nIf you just want to go to eat very good mexican food for a fair price, go.\nI might return one day, but is definitely not the place I would go if I want to chill out while I eat.", "author": "Beatriz L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "My first review after leaching off of this site for years. Just taking. No longer. And I present to you, on this monumentous occasion, the most under-appreciated taqueria in the Mission. Or this part of it at least. \n\nSo, my one major barometer of a good taqueria are the tacos. duh; but specifically the carnitas and al pastor. They're widely available options for meat, so serve as a good standard order; also because they're generally delicious as well. These guys just consistently get both so right, so much so that \"right\" is now partially defined by their succulent benchmarks. Forget the lines down the block either way at La Taq or El Farolito, there's no wait at TSJ#1, and the pork is ready for you.", "author": "Hunter M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-18", "description": "I ordered some food takeout here yesterday afternoon...a super taco with carne asada and a chile relleno plate. I had no idea there would be SO MUCH food in the box or I would have gotten just one or the other. But really I wanted both and didn't know the taco would be like 3 tacos. Anyway in the end I just ate the taco last night and then reheated the chile relleno today.\n\nWhile I would not say this was the best I've ever had, in SF or elsewhere, it was good. As I've said, huge portions. I was thinking it was not quite as cheap as some of the other local taquerias, but once I saw the size of the portions I realized that it is very cheap indeed. The chips were really good and fresh. I liked the salsas. The meat was a little dry though.\n\nOne thing I was not crazy about (although I have to admit it tasted good when I reheated it in the oven today) was that they put the chile relleno in the microwave. I don't know if it was precooked and they were heating it up--more likely, I think, is that they were melting the cheese on top (I hope that's why) but that is still something I'd rather see done under a broiler than in a microwave when I'm eating out.  Again, it did taste good today, much better than many chile rellenos I've had (and I've had a lot)--very big, a lot of cheese--and the refried beans and rice were tasty (though the beans were a tad on the salty side for my taste). But I'm just not wild about seeing anything put in the microwave at a restaurant.\n\nSo...I guess I would recommend it as...not bad...but I'm sure there are better places too. I just moved here, so I will learn. The tacos I had at Cancun down the street in the Mission were amazing.", "author": "Jennie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-31", "description": "I got the chicken quesadilla. I think I would have liked it better without the chicken. The good news is that the quesadilla was HUGE. The bad was that it was pretty unremarkable and not something I'd want to order again.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "Open late, amazingly huge portions, cheap, and quick. \n\nI usually get the quesadilla. I don't know how they do it, but this place seriously seems to put a whole block of mozzarella cheese into my 15\" HUGE tortolla shell. It's a little bland, but I can go home and add stuff to it and still pay less than I would if I bought the tortilla and cheese myself. Plus it feels more authentic when it was made at a Mexican restaurant.", "author": "Georgette T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "I love these guys. I will definitely go out on a limb and say that their quality of ingredients, service, and overall care beats El Farolito TEN FOLD.  Being that I work near by, 7 days a week, I feel that I am a fairly good judge. Don't believe the hype. San Jose all the way. Super tacos and burrito plates, you cannot go wrong", "author": "andy s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "This is a great alternative to Il Farolito if you want a midnight bite after a night of bar hopping and don't want to wait in the scary line at Il Faro.\n\nI like that it's clean, spacious, and the only line is from the folks who can't stand the line at Il farolito's, haha.\n\nI choose convenience over a miniscule bump in the taste of the food any day.", "author": "Ricky S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "Best taqueria in the Mission in my opinion. The portions are huge and the salsa is much more fresh and delicious. I enjoy El Faralito like everyone else, but the salsa and carnitas are subpar compared to San Jose. \n\nI recommend anything with carnitas or the carne asada quesadilla. I've always had good experiences with the service as well. If you want a delicious taqueria that's open late with NO LINE, then try this spot out; it's right across the street from the 20 minute line of El Faro anyways.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-09", "description": "Taqueria San Jose is an old haunt of mine from my days living in the east bay, due to its proximity to BART and typical lack of line compared to the other local taquerias. Out of old familiarity, I ended up grabbing lunch here during my exhausting weekend of sublet searching.\n\nIt was pretty much as I remembered it from a couple of years back. This taqueria is more expensive than other taquerias but has less of a line, more space for eating, seems to generally be cleaner, and is open late. The food here isn't extroardinary, but I've never had any complaints. The portions are large - perfect for leftovers. There are more exciting options in The Mission for tacos and burritos, but this is a reliable place to hit up if you need to be fed in a hurry before catching BART.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "Been going here for a while after randomly selecting it while in the Mission one day. The food at this place is great. I have only tried the grilled chicken taco's and the burritos (GIGANTIC burritos), but they are both by far my favorites. The chicken has a little flavoring/seasoning that is not too much and not too little -- just right.\n\nThe longest line I have ever waited in here had 3 people in it ahead of me and the wait was no longer than 5 minutes. Note I have not been during \"rush hour\", but have been at many different times of day.\n\nWould definitely recommend giving it a try.", "author": "John C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-30", "description": "I ordered a burrito to go one afternoon and opened it during the late evening and didn't find my order. They mixed up the order for a vegatarian with avacado for a meat combo with PORK !\nIt was a couple of weeks before I went there again and they didn't express interest in \"making good\" ie sorry we got your order wrong !\nI spoke with mr. Valle the owner the following day and he said something like come in again and we will give you what you paid for \nAgain it was a couple of weeks before I came in again and the same guy didn't express interest in making amends for the error.\nI spoke with mr. Valle on the phone again and he couldn't articulate in English a satisfactory response other than bring the wrong order.\nSpent less than ten dollars and going to call it a write off !", "author": "A L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "I come here mostly for the friday night boardgame night.  The baby burritos are decent at $3 a pop which is almost full buritto size and does not come with rice.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "This place is awesome.  I have fallen in love with the way they prepare the  chicken, and constantly have to fight the urge to get it in a quesadilla every time I go in there.  \n\nThe staff is super friendly, the server is really quick, and the place is much cleaner than it's 24th and mission rival across the block.  Something about standing in line in a packed house when I could be across the way in a cleaner place and watch ESPN while I wait, instead of drunks and crackfiends..\n\nBut the food is what brings me here!  Good stuff.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "I heart this place.  Open late, never a big line unlike Faralito across the street, and huge portions with good reliable burritos (and great salsa).  Plus the guys play settlers of catan and other nerd games.  The real deal.", "author": "Hemant S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-13", "description": "I love al pastor, and I loved the al pastor tacos at Taqueria San Jose!! I definitely could feel my arteries hardening as I watched the grease drip away from the taco remains clutched in my hand, but that is part of the experience, right? ;-)\n\nMy friends who didn't get al pastor (what were they thinking?!?) also were very, very happy with their selections.\n\nI haven't tried Taqueria La Altena yet, but that's next on my list for al pastor tasting.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "what i ordered... super burrito with carnitas\n\nburrito was of an ok size, filling's were good as well but not much of the rice and guacamole or was there any? carnitas was very good.... so tender and spiced up right.\n\nthe real bad thing about my visit was the wait and that i asked for no beans and it was full of it (though it was tasty). i was about to return it but the lone cook was goin' bananas in the kitchen. c'mon two cashiers and one cook does not make any sense, greedy as owner/sbastards wan't to take your dough as fast as they could and could care less about their customers and/or their employees.\n\nambiance... so-so (spacious but dirty)\nservice...bad (take your money and go)\ncost...$ (fair)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Friendly staff, decent salsa  and a good late night burritos that gave me wonderful gas an indigestion for the rest of the night. The super burrito can easily be shared by 2 normal people. \n\nA good amount of seating and well lit.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "We had Taqueria San Jose baby breakfast burritos for the brunch the day after our wedding. They were delicious, ready on time, and affordable. Our guests loved having a taste of true San Francisco, and they're a perfect hangover cure.", "author": "Lindsay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "On my last trek to Farolitos I parked in front of Taqueria San Jose. When I got back to my ride the sign on the front of TSJ stating they have the best Pastor in the city caught my attention. I accepted the challenge. I ordered one taco de Pastor. I have to say it was some of the best pastor I've ever had. And that's saying something. I try it everywhere. I can't speak on the rest of the menu. But if you are a pastor fan, I would call this a MUST TRY. Adios criticos de comidas.", "author": "Detox D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-16", "description": "These ppl don't honor their own gift certificates!! And it was NOT expired they just told me it was too large of a discount!! Wtf?!?! It was $15 off for a party of 4...we would have spent wayyyy more than that today. Their loss", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-06", "description": "I'm used to those $1 tacos in Tijuana, but I guess you can't be picky about prices on this side of the border. I got 3 tacos for a little over $7, but these tacos were PACKED so full you couldn't even fold it up to eat it. So I ate half of the meat with my fork first and then folded it up. What a messy ordeal! Thank goodness for the bathrooms to wash up afterwards.\n\nFor my tacos I ordered tripe (very deep-fried and crispy), bbq pork (super oily), and fish (pretty meaty). They were all pretty good, but not anything super spectacular. The chips, however, were fantastic. They tasted like fresh corn tortilla chips. Not too salty like those store-bought ones. Their salsa was pretty good too.", "author": "Esther Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "I used to work on this block and I haven't ate there in 7 years.  I am not sure if this is still the case but there used to be two Taqueria San Jose's directly across the street from each other on this block.  All day long I would see employees bring stuff across the street back and forth.  Like a huge container of salsa in one of those big buckets.  Sometimes mops and misc. stuff.\n\nTwo restaurants with the same name right across the street from each other?  I found this to be very strange.  But bboth locations were yummy and this is the neighborhood for taquerias, so why not?\n\nLow prices and good food.  Could be more clean and shiny inside.  Sometimes some shady customers.  Authentic Mission feel to the place complete with homeless person out front.\n\nThe prices are so good and the food is not the best, but damn good for the price, so i have to give it......four stars I guess.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "An overlooked gem next to the 24th St. BART station -- don't be fooled by the fact it's not as packed as the other places (which are just half its size).   Mileage varies when it comes to taquerias, but the delicious food is between Good and Terrific, and bonus convenience make this a solid 4 stars.\n\nSucculent carne asada, spicy grilled chicken, weekend BBQ pork taco specials, and one of the most mouth-wateringly tangy green salsas in the Mission. (Yes I'm a local and get to make that judgement.) They even offer \"baby burritos\" if you're craving less than an whole donkey.\n\nNo doubt it lacks some critical ingredient of your favorite eatery. (Personally I always miss Cancun's grilled tortillas.) And San Jose humbly lurks in the giant late-nite shadow of Farolito across the intersection. But the food gives Farolito a run for their money, arrives in a fifth of the time, and you can enjoy it in a window seat or at a large table. (This place is huge = awesome for crowds.)\n\nAnd man oh man, that green salsa!", "author": "Kimbro B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Great late night taco.... very filling and tasty , place was empty around 10:30pm Thursday with only one guy working .... if there was a line you might have to wait .... either way would return for the tacos con pollo.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-13", "description": "The reddest taqueria ever. Red signs. Red interior. Lots and lots of red. And clean. Which is always a plus down in the good old Mission, especially at a burrito joint.\n\nPrices are on the high side (especially for the breakfast burrito, but at least they made it happen with egg whites), so really your best bet is the baby burrito. Packed with meat and none of that distracting rice, for $3 and change it's the way to go.\n\nEdible. Satisfying. And very red.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-04", "description": "It could have been the post NYE drunkeness or that the food was really good. I can't remember. Either way, the vegetarian tacos were hitting the spot!!\n\nI wouldn't come all the way out here to try their food again, but if I was in the area and drunk, I might grab some tacos.\n\nMy only concern was the dead roach on the wall next to the table I was sitting. If I weren't drunk and busy stuffing tacos down my throat, I might have thought twice about eating there. My BF's response when I told him about the roach: \"Well, it is the Mission.\" Touché.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "If you love fish tacos, this place is very good and very affordable. The tacos have lots of tender tilapia and you can get four for $5.00. (There about) \n\nI have another favorite restaurant that I go to for steak tacos but they cost a lot more. I always come here for fish or when I have very little money. \n\nYou can eat a super healthy and delishious  fish dinner here for very cheap!", "author": "Sandra W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "What do you do when it's after 2:30a, the alcohol buzz waning to a quiver, yet you're hungry for just about anything, and not willing to wait in a 30 minute El Farolito line in the cold? You head to what's open - and for us that was Taqueria San Jose.\n\nBright with fluorescent lighting, smelling of cooked meats, this is the antithesis of the bar/club you just vacated. Luckily the bathrooms are clean (customer use only, and opened by a buzzer from the cashier), and the restaurant spacious, to accommodate revelers looking for a last meal. \n\nWe quickly ordered some waters (a la Costco bottles), and our standard Quesadilla Suiza ($7.99). Like most places in the Mission, these quesadillas are enormous - hefty in weight, it is filled with meat, sour cream, lettuce, tomato, cheese, and some sauce - all wrapped in a tortilla and grilled. They serve it in 2 halves b/c it won't fit otherwise. It's delicious and hits the spot.\n\nTSJ's version is a little lighter on the seasoning and the grilling (vs. EF) but it was still good. And they even accommodated AL's tradeout for a crisper taco shell. I did venture a bite of the Burrito Lengua. Have to say that it was too full of sour cream and personally not a fan of beef tongue. (The bumps gross me out.)\n\nA clean decent alternative to waiting in the cold.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-18", "description": "Stopped in for a burrito on my way home from work, seemed like kind of a long wait since I was the only customer. I got a carnitas burrito and asked for salsa verde, but pretty sure I ended up with some other kind of salsa. I think there were carrots in my rice which was weird, and some very raw onion which was so strong I couldn't finish the burrito. The carnitas were waaaay overcooked, to the point of being crispy and I got a big bite of something that I hope was only gristle. Too grossed out to finish. \n\nThe photos on the wall looked good, I'd maybe come back and try the tacos since I can see whats in / on them. Wouldn't get carnitas ever again though.", "author": "Beth D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "I ordered the al pastor and carnitas tacos as well as fish and chicken enchiladas. \n\nThe tacos were well priced, flavorful and loaded with meat. There is also a fresh salsa bar which was nice.  There pico de gallo was very fresh and complimented the taco well.\n\nThe enchiladas were ok- not my favorite. The rice was very bland. It's not a bad choice in the Mission- just not the best. If it was just on the tacos I would have given it 4 stars but the enchiladas and the ambiance (or lack there of) knocked it down.", "author": "Mister Chub S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "It's the a giant place, it's open late, it's good, and it accepts card. I'm coming here instead of El Farolito. I don't think it's as good? Yes that's an intentional question mark, I only come to these taquerias late at night after a night of drinking and one greasy mexican place tastes the same as another when I'm hammered.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "3 stars for the tasty food, 1 for the nice portions they give. Minus 1 star for their staff. My husband bit into some hard object, in his chicken taco which made his lip bleed. When we went to tell the woman about it, she called the manager/owner and he came over NOT apologizing but excusing himself. He went on about how it's not his fault. I told him all I wanted was to let him know in case it happens again. Granted, I think he was mostly afraid of a law suite since he mentioned twice about sending him the doctor's bill, he shouldn't have been so difficult as if we were attacking him. We told him several times we weren't going to go to the doctor's and we really just wanted to let them know. He ended up handing my hubby $30 bucks and told us to come back for a free meal. \n\nFood is great, kind of a weird experience though. But we will probably be going back (:", "author": "Yishra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "Okay, this place has officially gotten my thumbs up. Took a while, but it has totally grown on me. Mostly because the people that work here are so friggin awesome! \n\nAlways friendly, hook a girl up with chips and lots of salsa cups. When I get home super late from work, a chicken taco with guac from this place hits the spot. Well cooked chicken and generous portions of both the protein and the guac.\n\nSounds like next time I need to try the fish taco. yum.", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "CARNITAS!!! Great tacos. Their veggie super burrito is very good and isn't that 'heavy'. Service is quick, and they have all the essentials.", "author": "Conor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-30", "description": "another bowling night and mexican food right after... El Farolito was way too packed and was about to close in half an hour so we say this taqueria across the street.. we didnt really care anymore because we were hungry!!\n\nwe came in here, the place was much bigger, which is a plus, and the food is made pretty fast.\n\nand again, in the middle of the night, its ghetto.. a lot of drunk people and whatever so its loud! but heck, i cant really say anything, were all out after a long night of partying or having fun..\n\nthe menu is sort of confusing because its mostly in spanish, theres english, but a lot of it was in spanish and i was confused! but i wanted good food lol\n\nanyways, food is good, i feel kinda bad for the owners because everyone is so roudy, including us, but i think theyre used to it. hah!\n\ntheres a lot of sauces and condiments, yum!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-02", "description": "Mmmm....I don't know what they marinate their meat with, but its damn good and makes for an excellent, filling burrito.\n\nThe salsa verde is also incredible.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-09", "description": "Went here for a chip and salsa craving after a night of drinking.  The chips were pretty standard, no different from the stuff you buy at the grocery store.  I still prefer the thin, warm homemade chips that they serve at my favorite mexican restaurant (La Pinata in Fremont).  Their red salsa was just ok, but I really liked the pico de gallo, which had a decent kick to it.  \n\nThey didn't bat an eye when we got a second order of chips (don't think they charged us), and kept going back to the salsa bar and refilling our chips, so kudos to them for that.\n\nThe place was pretty dead when we got there around midnightish, but had lots of people around 1am when we left.  It wasn't the best chips and salsa I ever had, but it was cheap and it hit the spot.", "author": "Arlene M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-05", "description": "Okay, so it's been a while since I've ordered from here. I stopped eating burritos a while back since I cut back on eating a lot of carbs and would just grub on quesadilla suizas. I've been craving for a carne asada burrito the last couple of days, so I decided to stop by here since it was on my way home coming from BART. They've remodeled this place since I was here last and I have a feeling it was to compete for esthetic reasons, other than for customers, with Rosmunde next door. In any case,the place looks nice. The first thing I noticed was the new menu board and the new prices! YIKES!!! I always thought TSJ#1 was pricey compared to other taquerias, but come on! Then again, they just remodeled, so I figured they'd have to increase the prices a little. However, I wasn't expecting for them to skimp on some things.  \n\nAs I was waiting for my order, I decided to go to the salsa bar- what's with the small containers??  They weren't this small before, why start now??? After I got my order, I noticed no chips in the bag. I asked the guy, \"What happened with the chips????\" He said they were extra. WTF????? They weren't extra before. So he asked if I wanted to buy a bag. For $1.50, sure why not. At least he filled it to the top of the paper bag. Sheesh!! Anyway, the burrito was good, minus the sour cream. I didn't want everything in it, just meat, rice and salsa. I got that along with the sour cream and guac. It was still good. I ate half for lunch and the other half for dinner. Needless to say, I won't be coming back here if I get a craving for a burrito or quesadilla. I think I'll stick to my usual spot, which I won't mention =).", "author": "Neni E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-02", "description": "This is my favorite Taqueria of all time.\n\nWhy?  Well, they say you always remember your first... and this was where I ate my first ever carne asada burrito, no frijoles!\n\nThroughout high school, my friends and I always ate here.  When we were broke, we'd buy sodas and the guys working there used to give us chips and salsa.  A high school student's dream!\n\nAlso, the owner (I don't know if he's still the owner) used to have the funniest (unintentionally) business card ever - it said \"Taqueria San Jose\" and there was a drawing of the spit of meat... under which was his name, \"David.\"  So we named the spit of meat David.  Good times!\n\nWhile the new staff is a tad more abrasive and the ambiance is akin to a cafeteria, I still LOVE this place.  And the carne asada still rocks.", "author": "Melanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-21", "description": "Visually appealing, with large, colorful murals of San Jose, but lacking yum yum.\n\nThe chorizo in the super tacos was depressing and the only hearty topping on the super nachos was sticky malaise.\n\nPlus, every menu item is about a buck or two more expensive than other Mexican joints in the area.\n\nI feel so empty.", "author": "Corbin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "Taqueria San Jose has delicious, reasonably priced food. The restaurant was recently renovated, and the newly colorful walls enhance the attractive murals. On our numerous visits for lunch and dinner, the service has always been extremely fast, even when we've been there with a group. My husband's all-time favorite is their huge al pastor super burrito. Mine is the carne asada super taco. What's practically unique about Taqueria San Jose's super tacos is what's included -- one of these is a meal in itself. It starts with two soft corn tortillas. Meat (of your choice), cheese, beans, rice, guacamole, sour cream, and salsa are layered on top (there's also a salsa bar, so you can add your own). It's kind of like an open-faced burrito, but better because you can mix everything together, so every bite is enriched with guacamole, sour cream, and salsa! There are separate bathrooms for men and women, and they're clean and modern.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-11", "description": "After a wild Friday night adventure at Club Six, I worked up quite the appetite. Richard G. recommended this place based on my affinity for carnitas. I was not disappointed. \n\nI was impressed.\n\nThis place is located across the street from the super awesome La Taqueria, which recently shut down in San Jose due to the owner wanting to retire. It still exists in SF and it thrives; yet, Taqueria San Jose can find a way to compete with the best taqueria ever?\n\nHow do they do it? Well, by making the best carnitas in town and staying open late.\n\nWow. Holy smokes. My super burrito was pricey (over $8), but it was also enough for 2 people. I could not finish it. Everything was fresh and the carnitas were amazing. \n\nAjua! Ajua!\n\nI'll be telling my friends and even my future kids about them. Well, as long as I survive the swine flu.\n\nMy fellow Yelpers (Richard G., Yvonne C. and Jessica Y.) were growing tired, so they made me eat faster. So I just took a fork to my burrito and scooped out the remaining carnitas and shoved them down my throat.\n\nHeaven wrapped in a tortilla. Heaven on a fork. \n\nI also tried their chicken quesadilla when Jessica was not looking. It was very tasty and they did not use garbage boiled chicken (like they do at La Victoria). \n\nAnyway, if you are ever in San Francisco and you have a late night craving for Mexican grub, you have to consider Taqueria San Jose. \n\nI dare you try to the carnitas.\n\nHeaven wrapped in a tortilla.\n\nHeaven in my mouth.\n\nHeaven in my tummy.\n\nHeaving in the toilet.\n\nAjua! Ajua!", "author": "Archie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "I've since tried the carnitas (pork) and the fish fillet, both of which are really good. The pork is juicy and has crunchy bits and the fish is flaky and has a really tasty spice rub on it.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-30", "description": "This was the 1st taqueria I ever ate at in SF 20 years ago and used to be my favorite. I always loved their Carnitas Burritos and I had two in the past 6 weeks to give them a chance before writing this review. Can you say FREEZER BURN? My guess is that their freezer went out, they had a big giant piece of pork that partially thawed and they refroze it.  They served me freezer burned pork twice and I'm 100% sure as we all know what freezer burned food tastes like. I'm not sure if their other meat is freezer burned but if you must eat there, stay away from the pork!", "author": "Russell R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "A good value for the price, because dang! that's a lot of food. I had the carne asada and felt like I should have been rolled out the door and through the Mission (but how can you say no to such deliciousness?).\n\nMy BFF is my resident go-to gal on all things authentically Mexican (she is  of Mexican heritage and she has lived there, nuff said).  When we walked into this place she seemed to approve and after we got our order (and after she made fun of me for asking if they had HOR-chata) she tucked in to her tacos and I waited for her assessment.  Very rarely does she give the green light on authenticity, but said even though they were missing pineapple from the dish she was eating, it was legit (hurray!).\n\nWe spent the better portion of the hour stuffing our faces in relative peace (weeknight) listening to a strange mix of songs ranging from 50's rock/soul and traditional mariachi music. The price didn't really faze me - I've seen much worse and to me it's worth it to pay a little extra for something tasty.", "author": "Marissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-02", "description": "You should go here.  They have multiple \"best of\" awards on the wall, but they are WAY too humble about it.  These people are SO nice and gracious.  \n\nThe al pastor is the very best.  And if you don't think so, you're only out $2.40 for a taco!  I LOVE you, TSJ!  See you soon!", "author": "Amy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-07", "description": "I have to agree with Colin H. \nI used to love this place when I first started going there. Now, all they offer me (aside from pretty good tacos de el pastor) is a big ass Corona for like $8. \nYou have to realize that by gentrifying your taqueria, you're going to lose a lot of your true fan base, and probably even some hipsters too.", "author": "J A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "Very prompt service.  I had beef tongue tacos.  The portions were generous and the taste incredible.  I'll definitely be back.", "author": "Rex C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "My search for the holy grail of crispy fish tacos led me to the mecca of taquerias, the intersection of 24th and Mission, home to El Farolito. Although I've enjoyed a number of offerings from El Farolito, sadly, they don't offer pescado tacos. So down the block I spied Taqueira San Jose and thought I'd give it a go. \n\nI ordered two crispy pescado tacos and one super pescado taco, and chips and salsa. It's almost criminal when a taqueria charges for chips and salsa. Chips were so-so, but the self serve salsa was on FIRE. And I am not usually one to shy away from spicy fare. It hurt in an oh so good, hit you in the back of the throat, need another Mexican coke kind of way. I suppose $1.50 for chips and salsa isn't going to kill me, and yet I will grumble anyways. \n\nOn to the tacos: My mistake for ordering them to go, and not devouring them on the spot. But minus one star for the craptastic packing. By the time I got to unwrapping them, my crispy tacos had been reduced to some crumbled soggy bits of corn meal mush hugging what I supposed was the fish. My anticipation deflated, and I was sorely disappointed.\n\nI was somewhat cheered by Pookie's selection of the super taco. A taco so laden with rice, beans, salsa, guac, sour cream and seasoned fish, that it had to be packed in its own little take out box. Pookie even noted that it was \"damn heavy\" and \"are you sure this is just one taco?\" We ended up downing this one with a fork, since it didn't led itself to the fine art of taco origami, and probably would fall apart at first bite. \n\nA little pricey for tacos, at around $4 each. I think El Farolito is a super cheap $1.95.\n\nThe Good: Bottom line, the pescado WAS delish, and the super taco was pretty amazing. My MO next time would be to order the super pescado taco CRISPY and eat it right there as it came out of the kitchen. An added plus? They take credit/debit cards, so you're not fumbling for cash at the end of a looooong night. \n\nThe Bad: Shitty packing ruined my crispy taco, and I ended up eating it with a fork and chips. Also, paying for chips and salsa makes me feel violated.", "author": "Zehra A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "I only came here because the line at El Farolito was too long and I had to catch a BART train.  After eating my burrito, I am quite pleased the line was too long across the street.  My burrito was a little more expensive to get the guac and cheese added to it then it would be elsewhere, but boy, did they pack on the meat in this one.  Aside from the top and bottom of this bad boy, every bite was packed with morsels of meat.  It held up warm and it held up three hours later on my plane.  I grabbed three different salsas and each was on point as dressing for my side of chips (Hallelujah for them not being stale).  I could have wished for more guacamole, but overall this was a solid burrito and something I may wish to bring on every flight I take out of SFO.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "A decent burrito with no rice so it's less filling. Fresh guacamole is great and the carnitas is excellent. The crisp taco is good too. Ridiculiously large and that green salsa is nice.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "In my quest for the perfect al Pastor, I finally made my way here. I found my quest will continue, and will still go to El Gran Taco Loco when I want this greasy, sometimes spicy pork. \n\nMy roommate was hungry for a burrito. After first going to Phat Philly, while waiting for the 14, I went here. It's clean at least. She reported her burrito to be just OK. \n\nFor lunch for myself the next day, I bought a quesidilla suiza with al Pastor. I also thought it was just OK, and nothing special. Perhaps all the good reviews were alcohol enhanced? \n\nI did like the salsa though. But I don't think I will be back.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-31", "description": "First of all I'm a native San Franciscan who uses to frequent this place years ago.  Decided to grab a taco and quesadilla the other day.  Yes the decor and atmosphere has taken a turn for the good.  But your not eating decor.  The taco was full of whole beans and the meat tasted like low quality.  The quesadilla was big and salty. Im very disappointed in the food.  Not at all like I remember.  Can't believe how pricey it is now.", "author": "Joselyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-21", "description": "I had the beef enchilada here, I wasn't really blown away by the taste but it was a pretty good sized enchilada and unlike some of the other places they don't charge extra for the chips they include them with your order.", "author": "Nicholas A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-16", "description": "A pretty decent super with carnitas. It was above average(if only slightly.) Nothing about the ambiance here is worth sticking around for unless you get a beer and have too. There's a game night on Mondays, which maybe needs a separate review, but in case you were thinking about going for that I don't recommend it. I tend to judge burritos pon size, but this one was also relatively fresh.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-17", "description": "This place fucking BLOWS. I'll tell you what, I'm sitting here, right now, eating the burrito I got there and I can hardly finish it. \nI asked for chicken. The gem behind the counter said 'grilled or shredded' (Personality of a corpse, this one), I said I wanted shredded chicken. I said 'oh, by the way, can I get extra sour cream on the side?'. What did I get? A burrito with NO CHICKEN and sour cream INSIDE. This burrito is cold and flavorless. Did I mention I paid almost TEN DOLLARS for this shit?\n\nI live a block away from this place and this is the first time I've been there.  I suppose next time I will not be lazy and walk the extra block for El Farlitos", "author": "Alexandra F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-03", "description": "My friend tried to get me to go here recently which I had to decline don't get me wrong once upon a time this was the place to be after 2am. I knew all the people who worked here and after hanging out on 30th and Mission( at the gas station) or Day Street Park we would come and eat our drunk away.\n\nEven when I stopped hanging out outside I would come after the clubs that is until that one fateful experience.\n\nI was eating my burrito and everything was all good until I reached for a chip and out popped a COCKROACH as big as day I could not belive it...\n\nMy Late night burrito Dreams shattered...", "author": "Kim R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-12", "description": "Much like mediocre sex, life is too short for mediocre burritos.\n\nEven at 2 in the morning.", "author": "Jess T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-14", "description": "oh god.  meat on a vertical spit.  When you see that pillar of meat and fat, slowly turning as the heating elements spark and flare from fat melting and sputtering on the grill, you know you're at a place to be reckoned with.  They have it at truly med.  they have it at el castillito.  and they have it here.\n\nI was walking past 24th and mission and was hungry and el farolito had their usual massive line, so I kept walking and there was taqueria san jose, which burritoeater talks well of, as do other yelpers.  No line!  sweet.\n\nOne glance at the spit and I knew what I had to order.  dos tacos.  un de pastor, y un de carnitas.  carnitas and pastor.  the pillars of mexican pork.\n\ntacos were 2.40 ea (inc tax), and the pile of meat was bigger than the tortillas they came on.  I picked up the taco de pastor first and the meat fell all over the basket, as the hot taco burned my hand.  I shoved a bite in my mouth, and it was just heaven.  I'd have to say the pastor at castillito is more flavorful, but I think perhaps the balance here was better, since the \"bbq\" flavor was not overpowering.  I'm going to need to come back a few more times to do the true comparison.  \n\nThe carnitas...came out looking like pork hash browns on a tortilla.  oh man.  PORK HASH BROWNS.  absolute genius.  it was a patty of stranded pork, with a whole side browned and crispy.\n\nDare I say the carnitas was better than farolito's?  I dare.\n\ndamn, I think I have a new default taqueria in this part of the mission.\n\nonly complaint:  the pico de gallo needed some more tomato.  it was nice that it had lots of pickled jalapenos chopped up in it, but still.", "author": "Fong L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "Amazing service, amazing food, and a very clean establishment. I've been going to Taqueria San Jose for the past 4 months and I'm still not tired of it. Their quesadilla suiza ($7.99), in my opinion, is probably the best in the Mission! The carnitas platter is also out of this world. I would definitely recommend Taqueria San Jose over any other Mexican place in the Mission.", "author": "Justen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-16", "description": "Have you ever been drunk in the Mission?\nHave you ever been hungry after your alleged \"drunken night\" in the Mission?\nHave you ever craved a taco, burrito or nachos after bar time?\nHave you ever been appalled at the line that wraps around the corner outside El Farolito at 2am?\n\nRefusing to wait over an hour for a $2 taco you stumble caddy corner across the street into Taqueria San Jose.  Damn, it's bright in here... you wish you brought your sunglasses, but there's no line and it's clean enough.  You order your taco and a quesedilla and within 5 minutes it appears before your half-lidded, drooling, smiling face.  You inhale your meal within a matter of seconds and pity all those SUCKAS *still* waiting in the rain just to order their food.", "author": "Shayna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-20", "description": "One of my favorite Taqueria's. Their Carne Asada is flavorful as well as their Carnitas. They're a little pricey but I feel like I've paying for quality. The main reason I go here is because I LOVE LOVE LOOOOVE their Cantalope Juice. I come in quite frequently to just pick up their juice. It's YUMMY! Their servers also give you free chips and salsa & hand deliver your order to your table. Been going here since a child & I won't be stopping anytime soon.", "author": "Dessa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-11", "description": "Gross.  I don't care how many cocktails and cheap beer I've thrown back.  I would rather eat my own regurgitated dinner than go here again.\nI went with a group of friends after hitting a few bars, e.g. I was boasting a significant enough buzz to enjoy most anything put in front of me.  However, my order of cheese enchiladas was hard, stale, and more than a little mysterious.  My friend, who ordered the chicken burrito, was met with chicken so undercooked that it was pinker than the bubblegum stuck under the table.  The others, who actually chose to eat their food, were all met with a very uncomfortable visit from the 'rhea fairy later that night... if you catch my drift.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "Best al pastor super burrito in the universe.  I live in San Luis Obispo county and always make it a point to stop and grab a burrito when I'm in the city.  I'd dare you to find a better burrito anywhere.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-17", "description": "I can't really comment much on whether their burritos are mediocre, but until I visited this place on a Friday night at 2 in the morning, I was convinced that NorCal just couldn't do tacos the way SoCal did.  This discovery was nothing short of miraculous.  (Sorry, NorCal...but it is what it is.)\n\nI had the al pastor super taco, or taco supreme...or whatever the taco with all the fixings was, and you should try it too.", "author": "Dwigt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Great tacos! I had some alpastor, tripitas and carne asada. The meat was tender and had great flavor for the alpastor and asada. The tripitas were nice and crispy as they should be. I will definately return here again.", "author": "Lulu G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "Clean.  Crisp.  Refreshing.  Ahhhh.  Sounds like a beer commercial, right?  right?  Wrong!  I'm talking about Ceviche tostadas!  Just because the name of the place tells me to buy a taco, I have the freedumb to choose anything on the menu.  Plus, on a hot day in the Mission, towards the end of our \"1st annual Taqueria Crawl\", a great ceviche is something you should not pass up.  Of course, their name also implies that we are in another city, but I'll let it slide.\nLocation: good.  very close to Mission and 24th.  Near lots of bus stops, pedestrians, bicyclists, homeless, hipsters (i can't escape!), and of course Mexicans.  \nAtmosphere: big, bright, quiet and loud at the same time, busy, very clean, so clean in fact the whole place smelled like pine sol and bleach and fresh cilantro.  \nCrazy:  a lady came out of the restroom yelling at us cuz she thought we threw a bunch of  baby wipes in the sink.  Well, we didn't do it.  She said \"we gotta keep it clean in here!\"  Then she kept yelling and the cooks finally looked over at her, so I retorted, \"Shut up you old hag!\" (in Spanish) and waved her to leave the place.  She had enough and left.  The whole place cheered.\nFood:  Great tacos al pastor, cut right of the vertical spit, ask for pineapple and easy on the salsa-- makes it too runny.  It's good!  But on the side or less is fine with me.  Like I said before, the tostada was really really nice.  Perfect mix of lime, fish, onion, everything.  They give you big avocado slices on it too.  mmmmmmmmmmmmmm.\nPrice:  a little bit expensive for tacos, but everything else is standard.  \nProfessional Opinion: A good, authentic choice amongst a sea of worthy opponents.  Cheaper tacos elsewhere.  At least here, you know everything is clean if that matters to you.  If not, just eat the scraps on the floor outside.\nProvecho.  Goce de su alimento", "author": "Joshua K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "I went here last weekend and I am STILL craving it!!   i didnt even look at the menu, i just asked for a \"big shrimp burrito\".\nThey made it and brought it out to me (gave me some delicious chips first).  OMG it was soooooo goooood!!  Full of big shrimp, rice, beans, sour cream, guac, and super fresh tomatoes.  The best part about it was the tortilla. \nThe tortilla was so soft and delicious!\nI am still totally craving the burrito here!  They are friendly too.\n\nAnd the bathroom was nice and clean.", "author": "Bettie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-24", "description": "Im a huge burrito fan and Im generally content with any burrito you put in front of me but this place failed to satisfy my craving. These are the kind of burritos where u cant tell what's inside and every ingredient tastes the same- like one big mush inside a tortilla. The most disturbing part is it's impossible to tell if they gave you the chicken you ordered or some sort of mystery meat. \n\nDon't waste your time here - go across the street to La Taqueria instead.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-03", "description": "Just a quick hope from the 24th Mission Bart station. They fill your burrito with lots of rice, so much that it's overflowing. It's definitely a decent deal...the regular burrito was almost like a super in most places. The staff were pretty nice. It's a decent place to eat if you're in the area, but I'd probably go somewhere else if I had a choice.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-24", "description": "For some reason this location is not nearly as good as their Mason Street Taqueria #3. \n\nThe burritos are a bit runnier and a bit more salty than at thier #3 counterpart. Too many good taquerias in the Mission to bother with this one. Go across the street to El Farollito and save Taqueria San Jose for when you are in the North Beach area.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-09", "description": "Just a quick precursor... I just visited Mexico two weeks ago and experienced the best tacos I've ever set my tongue upon.\n\nI have yet to experience \"the Mission\" and the legendary food in the district. No better place to start than Taqueria San Jose. \n\nI ordered 3 tacos: carne asada, pollo abodado and carnitas. Just to get a taste of all they had to offer. I have to admit, they give you a TON of meat, a welcomed surprise :) The pollo abodado was okay but the carne asada was not very good. The carnitas though... was absolutely delicious! The pieces of meat were nice and crispy on the outside and moist and juicy on the inside. YUM!\n\nThe chips they included kinda threw me off. They're the circular kind you find in the supermarket :/ wasn't sure what to make of them. \n\nThey have a small assortment of salsas, just the bare necessities. The prices were okay... $2.12 for each taco.", "author": "Danvin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-19", "description": "One Heaven of a Fish Taco \n\nOk, silly title aside, WOW! Our 13 year old neighbor recommended this one and I'll tell you, that kid is going places with taste buds like that. \n\nTo top it all off it's only $2.50. The fish is grilled not breaded. Not that i would kick a good breaded fish taco out of bed either. (cough) El Matate ( end cough) \n\nI absolutely love the people who work there as well, always happy and they always remember my order. There's a gum ball machine you can hit up on the way out too;) \n\nAnd don't forget to get some of that sweet sweet Strawberry Water.", "author": "Chantelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-09", "description": "Taqueria San Jose is the Mission's overlooked treasure.\n\nSeriously, best Taqueria in town, and i know of which I speak.\n\nYeah, they're super burrito's are a bit pricey, but they are twice the size of the one's at La Taqueria and 3 times as tasty. \n\nThe real treat at San Jose are their carnitas.  I know my carnitas.  I really do, and these are the best in town.  Crispy on the outside, chewy on the inside, no fat chunks like at other places.  They throw the carnitas on the grill and crisp them to order.\n\nIf you're tight on cash, you can go in and get two carnitas tacos (served with free chips, they dont charge like other places) and be full and happy.  Oh, make sure you get the salsa verde on those free chips as it is BOMB.\n\nYeah.  So stop wasting your time in line at Farolito or your money at La Taqueria and treat yourself to some San Jose.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-21", "description": "Since I couldn't bike home after doing my part to finish a pitcher of Sangria at Cha Cha Cha...we went on a hunt for food in the Mission on a late Sunday night.\n\nWe ended up at Taqueria San Jose and picked up a couple of steak burritos since apparently stuffing ourselves with fried and fatty Cuban Tapas didn't inflict enough damage on our arteries.\n\nThe steak was good and the burritos were on the moist end, but that worked well here. I don't remember the salsa blowing me away here, but overall an excellent late night stop.\n\nGood seating available inside (maybe 1-1.5 size of a starbucks) and there is a bike rack within a building or two of the restaurant.", "author": "Varun .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-26", "description": "The underdog of 24Th and Mission. I fucks with San Jose a lot. It's way better than overrated as fuck La Taqueria which is for people who think salsa is exotic. I fuck with Farolito too but I ride for San Jose. yeah the chips are those generic lame joints you find all over the city but if you're going to a taqueria for fucking nachos then you need to take your ass back to taco bell.  But man when they step up they got the game on lock. One late morning I showed up and got some Al Pastor that fucking killed anything I'd eaten anywhere else. I'd had Al Pastor from here before but the morning is the jump off for the al pastor. The carnitas are dope too. I usually get the plate for those or grab a couple of tacos. basically just stick to the pork cause they know how to rock that shit. Although the lengua here is tasty also.\n\nI don't know what kind of softhands are asking for non spicy tacos because you can't get a fucking spicy taco in San Francisco.", "author": "Sergio O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-24", "description": "I was here during the Street Food Festival. It took us 1 hour for them to make the food we ordered. Not even kidding. \n\nThey took tons of orders even though they knew they wouldn't be able to serve people food for an hour. I think they got a little greedy seeing all the business come in. Needless to say, an angry mob formed. The poor guy in the back seemed really stressed out, and with good reason. \n\nAfter an hour I was starving so I asked for a refund. They asked what my number was and proceeded to go back and make it. I would have felt bad, but it was 3PM by that time and I'd had no lunch that day. They also decided to make to-go orders first, but that meant that none of the orders that were \"for here\" got made. Some people had been there even longer than an hour!\n\nWhen the food came, it wasn't very good. I had the tacos, and I had indigestion and foul belches all afternoon. Pretty poor experience there. With all the great burrito places in the Mission, I don't think I'll be back. I do realize others like this place a lot, but I was really disappointed.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-02", "description": "Was excited to go back to this place. I remember having tried it about a year ago after the Dia De Los Muertos celebration. I seemed to remember it was good. \n\nWell, we went back last saturday and it was OK. I order tacos: 1 al pastor, 2 lengua, and one carne asada. The al pastor was tasty, but overly oily. The lengua was gross, over cooked, big chuncks and smelled gamey. Yuck! You've got to steam the cow tonque carefully, the meat should be tender and fall apart ;-) The carne asada was probably the best of the bunch.\n\nThe search for the best taqueria continues. I maybe back for a burrito. As I said before, some places aren't good at tacos, but make great plates and burritos. These are my people man, I believe in giving second chances ;-)", "author": "isaias J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-17", "description": "It was Saturday morning and I was really craving watermelon aguas frescas, accompanied by a super burrito.  I went to 4 or 5 taquerias/tortas places, and no watermelon aguas frescas was to be found.  Taqueria San Jose had cantaloupe, and I'd never been there before, so I figured why not.\n\nThe decor has the requisite murals depicting life in the Mexican desert, and a jukebox was playing Mexican hits as you expect in the Mission.\n\nA large cantaloupe aguas frescas and an al pastor super burrito set me back around $13.  Chips are pretty standard, mass-produced but good.  The salsa bar was good and they have Tapatio on the tables.. nice!\n\nThe burrito was enormous, but not all that great.  I mean, it wasn't bad, the al pastor was decently marinated but doesn't compare to El Farolito across the street.  The rest of the ingredients were pretty standard.\n\nI enjoyed the cantaloupe aguas frescas, but I think the stuff at La Taqueria (also across the street) is better.\n\nOverall, this place is ok, but La Taqueria and El Farolito are better, giving you little to no incentive to eat here.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "Could be the best taco's in SF.   Yep, i said it.  Al Pastor, Pollo are my favs.\nOf course, best tacos and best burritos can get religious, so i'll just leave it at that.\n\nBeen coming here for 12 years, mostly late night snacks but also good for lunch and dinner.   Love the free chips and salsa bar.   And the jukebox and colorful clientele at 2am.", "author": "chad n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-29", "description": "Looking to change things up a bit, my girlfriend and I decided to try a \"new\" (the last time I ate at Taqueria San Jose was when The Fugees were on tour with the Roots, which was a long time ago, as in 1996) taqueria in the Mission. Our choices: Taqueria Cancun (the one between 18th and 19th) and Taqueria San Jose. Since I didn't feel like driving through a goddamn hurricane for tacos, we settled on the one that is closest to my house.\n\nI hadn't been back to my stomping grounds for a while (Luna Park definitely does not count), and I quickly saw that it was the same as I had left it. There were roughly 5 or 6 police cars all over this stretch of Mission street, sirens blaring and a mass of cops walking around like one of them had lost their keys. As we crossed the street in the rain, we passed by two police offers, who quickly ran down the situation:\n\nCop 1: \"So we still don't have a victim?\"\nCop 2: \"That's right, Lieutenant.\"\n\nNothing like tacos and random gunfire to welcome you home.\n\nTaqueria San Jose, as you might of guessed, is a 3-star taqueria that doesn't really have anything to write home (or on Yelp) about. The food is a bit greasy, the salsa at the salsa bar is not fresh, and the place is cold as shit. However, sometimes you kind of want that, or dare I say need that. I ordered 3 carne asada tacos with cheese and guacamole, and they were both great. Not taco truck great, not La Taqueria great, but \"it's 11pm and I'm glad I'm eating these tacos instead of gnawing my fucking arm off from hunger\" great. And that's all you can really ask for.\n\nWith so many taquerias in the area, why chose Taqueria San Jose over any other taqueria? Well, if it's 1:30 AM and you want to a) eat your food sometime within the next hour, and b) avoid the drunk jackass scenesters at El Farolito, this place is just across the street.", "author": "Alexis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-23", "description": "I love love love Mexican food. There are so many places with so many varieties, eventually you might ask: 'Is this really Mexican?' How should I know? I have not even been south of the US border. So now that you know you are dealing with a Gringa, here is my review. \n\nYum. And I have had better. Maybe next time I will order something different than the burrito, maybe some tacos, which my friend Sally liked.", "author": "Betsy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-20", "description": "For starters, this place is expensive compared to El Farolito across the street, and El Farolito tastes better also. \n\nI went here about a month ago and got a quesadilla suiza, mine was cool, nothing too spectacular. My friend had a pork quesadilla and it was THEE greasiest thing ive ever witnessed in my life. The entire quesadilla had turned pink from the grease. I may have a picture of it around here somewhere.\n\nYuck.", "author": "D F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "The first stop on our taco crawl.  Had chips and red snapper tostada.  Chips were great, guac was a little off (too spicy?), tostada was great.\n\nThe place itself is roomy, slightly shady, but definitely has a good \"family owned and operated\" feel.  (whether that's true or not I have no idea).  Beer was $5+tax which was a little high for the area, but a solid stop nonetheless.", "author": "DH H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "Taqueria San Jose in the city?? Yes, its true... I would hate to say it.. but I still love La Vics.. maybe only for their sauce... we came here after a random night at Bruno's... our friend said that this place was pretty good and after I had that bacon wrapped hotdog at the corner... I didn't think anything else could've tasted any better.. \n\nA super burrito is $7.99.. which is pretty pricey in my opinion... if they had some special type of sauce here.. I would have to say one of the best burritos I've had.. not only because I was a bit drunk..  if we're ever in the area.. I'll have to try their tacos next time!", "author": "Liz L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-10", "description": "The veg burrito was subpar, the burrito was missing something.  I just felt like I was having a bundle of tortillas. Plus the salsas were ok. I had to rate it as the worst veg burrito I have had in the Mission.", "author": "Ajesh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-25", "description": "I've been coming here since 1994, and I've always loved it.\nIt doesn't change much, and the tacos and burritos are great.\nI like ordering tongue and \"head meat\" (buche?), and they're always delicious so don't be afraid to try.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-21", "description": "Eh, definitely not the best burrito in the Mission. My carnitas burrito was decent but my friends chicken burrito was bone dry- tons of extra salsa was needed to add flavor to it. With El Farolito one block away, I don't see much need to come back here.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-05", "description": "Large (almost too large to eat in one sitting), yummy burrito for 8 bucks.  Would have been 4 stars, except the guacamole wasn't that fresh.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-26", "description": "The Taco Crawl crew hit Taqueria San Jose on crawl #1 (Dec 2004).  The crowd of 20-odd taco eaters was unanimous in its disapproval.  So many tacos and so little time to waste here...", "author": "Laurence W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-15", "description": "Let's go with 3.5 stars...\nI love tacos!\nFirst taco- one with just carnitas and guacamole- the meat was over flowing and the guacamole was fresh.  It was the perfect taco! And I was able to eat it like a regular taco.\nSecond taco- chicken super taco.  It was a bit much...it was like a messy burrito.  There was no way I would be able to eat it like a regular taco, so it should be called a tostada with a soft shell.  The chicken was cool- a bit too over spiced, lots of rice, beans, cheese, hot salsa, sour cream, and guacamole.  It was huge - I had to leave over half of my taco/tostada:( I'll so be back for the carnitas! \nAnother plus to make it a 3.5- they accept atm/credit cards- perfect when I'm short of cash!", "author": "Valarie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-02", "description": "Taqueria San Jose should be one of your two destinations when 2AM rolls around (other being Taqueria Cancun). The taqueria is an open dining room complete with jukebox with lots of Mexican selections. I had a carne asada super burrito and it was great. The meat tasted really good. Around 2AM, the line gets pretty long. Out the door long. We were able to beat the crowd so I could get a chance to take in the food. \n\nOverall, the experience was pleasant.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "Look- anyone that serves good ceviche i'm a fan of, especially at a very resonable price $2.50 um, yeah I will have two orders please,  my co worker had a burrito that looked bigger than him! Great prices and the food here is real good. My co workers and I make the effort to catch BART and eat here when we are in the mood for Mexican food and I am having a ceviche craving. It's right around the corner from 24th and mission BART station.", "author": "X X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-02", "description": "I went here once a few weekends ago late at night. I was less than impressed with my chicken burrito. I can't explain it very well but the ratios of meat to other ingredients was off somehow. The meat itself didn't taste that good either. It was very dry chicken that seemed like it had been over BBQed. Maybe I just got a bad batch, but I've had quite a bit better.\n\nI would suggest many other taquerias in the Mission over this place.\n\nThe only advantage I found was that this place wasn't as busy at 1:30am compared to the overly popular competing taqueria kitty corner across the street, which seems to attract all the after bar/club hipster crowd. \n\nIf I remember correctly, the prices were decent-- around what you would normally pay for a mission burrito.\n\nOverall, it's probably a 3 star if I went back and tried it multiple times, but from my 1 time there, I wasn't very pleased and didn't even finish my whole burrito-- something I almost never do.", "author": "P. D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-19", "description": "Super-Burrito.. Carnitas... standard fare for me. V. friendly workers, and v. tasty buritto. \n\nI'd come back (but probably won't b/c Taqueria Cancun is just down the block)", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-06", "description": "This place gets a one star upgrade because it's open late.\n\nWandering home at 3:30 am this weekend I was in dire need for a burrito. Farolito's line was too long so I ran, wait stumbled over to San Jose and ordered a super carne asada burruito.  It hit the spot but I realized I probably would have been happier at Farolitos.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-05", "description": "I had a hard time deciding how many stars to give this place. Let me explain. \n\nThe Al Pastor here is outstanding... in the traditional divey taqueria way. It's nice and spicy, and the ample grease mixes with sour cream to form some sort of heavenly goo. \n\nSome people in the area (and the dudes on burritoeater.com) will claim that Taqueria Can-Cun and Taqueria San Francisco have better Al Pastor. Let me break it down like this: \n\n- San Jose has what I've come to expect from great Al Pastor. It's spicy. It's greasy. It has a few little crunchy burned pieces. It has a ton of flavor, and is downright satisfying.\n\n- Can-cun's Al Pastor often has the same qualities I described above. Other times, I get a load of Al Pastor there that's *too* *damn* *sweet*. Weird. It's ok, but it tastes mostly like paprika and brown sugar.\n\n- Taq. San Francisco is in its own world. I can't exactly compare their Al Pastor to others just yet, because it isn't what I'm used to. It's not all that greasy, and there are no burned pieces. The quality control is actually outstanding, and it's definitely delicious. It's just that I feel like I'm eating something else... not quite Al Pastor. I do love it, though, whatever it is. I have to go back again.\n\nThe grilled chicken at Taq. San Jose kinda tastes like the Al Pastor... spicy, but not so greasy. \n\nChoosing either the chicken or the Al Pastor will result in a solid burrito experience. \n\nThey have good salsa, too, and their pickled carrots and peppers are delicious.\n\nEverything else here is kinda mediocre. The carne asada is average, as are the quesadillas.\n\nSo, to summarize, go here for the Al Pastor or the Chicken... especially if you're planning to go \"super\". Otherwise, this place is just like a lot of other places in the burrito corridor.", "author": "Angelo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "After my trip to Puerto Vallarta I have been craving chorizo tacos. I would normally go to my usual Farolito but sometimes or rather most of the time I dont have the time to stand in line.\n\nThe next best thing, Viola!!! Taqueria San Jose, their quesadilla is not as big as Farolito's and they are a bit pricey but they're good so it doesnt matter. Their fruit juices are the bomb too. The chips are actually the ones you can actually eat, they are crunchier/crispier than what they serve at Farolito's and close to what they serve at Papalote. \n\nI would have given it a 5 star but then again shelling $11 is a bit too much.\n\nBut you have to try it.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "Sober or not, this is the best taqueria in the Mission by far. It's never ridiculously crowded, the quesadillas are always done to PERFECTION.", "author": "Phoebe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-21", "description": "3 stars for decent fish tacos. The salsa and pepper bar is lackluster and they dont seem to care about diner's experience. Unless they step it up soon, they're always gonna be El Farolito's spillover spot.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-02", "description": "Taqueria San Jose gives you lots of food for your money. $5 got me a burrito that I really couldn't come close to finishing, which is pretty rare for me. I don't consider myself to have a huge appetite, but I can usually finish what's in front of me.\n\nAnyway, the food itself was OK. I really enjoyed the first few bites of my chicken burrito, but after a while I just didn't dig it. It was OVER-stuffed with meat (maybe that's your thing, but it ain't mine), and totally drippy and messy from the rather watery salsa they slopped on (even though I asked them not to).\n\nAll in all, it's definitely not TOO bad a place. I mean, I wouldn't argue with my friends if they all wanted to go there again... but the Mission is just way too rife with better options to go back to Taqueria San Jose otherwise.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "This place is one of those places I go for a CERTAIN item .... here ...it's the  El Pastor!    \nWalk up to the counter ... do not look at the menu .... Order the El Pastor burrito.... MArtha Stewart ranked it in the top 25 best burritos in the country ... cooked to perfection.... a little spicey ... a little tangy.. a little smokey. It is a very original flavor .... almost BBQey   \n\nGood salsa bar as well.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-19", "description": "I rarely feel compelled to write a Yelp review because I find they're often more narcissistic than helpful, but this is an important public service announcement. You've been lied to. Sure, La Taqueria is good, in a sort of white-washed \"cripsy taco\" sort of way, but this place has reasonably priced Pastor tacos that are as authentic as I've ever tasted, they actually come from the real spit. Just get 4 for the price of 3, spicy style. 7 bucks. About the price of one and half cripsy taco across a street with the trendoids. The best tacos around without overpaying and their open late when you want them.", "author": "Trevor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-02", "description": "Ok, so those of you that know me, know I'm a vegetarian.  Those of you that know me REALLY well, know that I cannot resist the allure of the carne asada at this dirty little hole-in-the-wall-yet-insanely-poular taqueria.  I was first introduced to this place over three years ago by a Filipino guy I was dating.  I have since lost my love for him, but not for these super burritos.  It's a meat infused orgasm in a tortilla.  Their fruit waters are super yummy too!\n\nThe chips aren't very good though...and bring mace if you go late at night.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "Taquerias in the Mission evolve over time, and this is currently one of my favorites.  Just hop off the BART and grab a burrito on the way home from work.  Not the healthiest of meals, but good comfort food.\n\nTheir carnitas burritos are great and the steak is usually decent.\n\nThe grilled chicken is only mediocre - something about the sauce doesn't sit right with me.", "author": "Rusty S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-17", "description": "My roommate loves this place and that alone almost made me skip writing a review for this place but...I gotta do what I gotta do.\nI don't have much to say other than this I don't like having a soggy burrito...ever, not the way they are supposed to be. Even with a 2 star rating, I won't go back. most likely, I will go across the street to EL Farolito...despite the long lines.", "author": "James J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-15", "description": "- They take debit cards\n - Best late night Taqueria\n - Tacos to go..... not so good!", "author": "Justin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-17", "description": "after a night of drinking what else do you do. eat donuts? no, you eat tacos. first it was 17th. then 18th. 20th. 22nd... we walked down mission like all the other junkies that my sister usually tends to at the hospital looking for her favorite taco place. back and forth we went and that's when i realized how bad i had to use the restroom. i was pretty convinced there was no way in hell i would find a restroom at 2am in the mission. \n\nafter passing a bunch of taquerias i pre-determined a spot to do what any wasted girl would do. the bart station on the corner of 24th street and mission. the thing was i wasn't even drunk! i was pretty damn sober. as i looked at the corner getting ready to do my thing there it was. my savior. taqueria san jose. i almost cried. \n\ni think it was anthony bourdain who said if you want to know how clean a restaurant is, or kitchen, or something like that look at the restroom. i don't know if that's valid or not but this is probably the cleanest restroom i've come across at a taqueria or bar in SF. not what i expected at all from the mission. i don't even use the restrooms at starbucks here.\n\noverall, it's a clean looking place even at 2am. i ordered two carne asada tacos hoping they would be as amazing as the restroom. i don't know how much the tacos cost because i didn't pay for them but i was disappointed. not the best. i will say this, the green salsa was some of the best i've had in a while. my sister ordered nachos. i don't know what kinda nachos they make but it looks like they just throw in a bunch of mission tortilla chips beans and whatever. she loved them. you might too.\n\ni guess if you need to use the restroom or don't want to wait at the super long taco stand down the street come down here. the food is good. not amazingly good but good. there's plenty of tables and they also have a jukebox with Mexican tunes. my sister was all on that shit. i chilled and enjoyed my Mexican coke while i munched on the complimentary tortilla chips.", "author": "Marilu R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-31", "description": "This place is awesome! Make a trek out of the way to mission and get some baby burritos. They will fill you up!! I had carne asada and pollo adobo. Mmmmmmmm and cheap!!!! Oh and the service was very friendly", "author": "L. .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "This is my favorite taqueria in SF. I've tried the al pastor, carnitas, and carne asada burritos and the shrimp cocktail. All were exceptional, way better than what I've had at la taqueria, la corneta, el farolito, etc nearby.\n\nNot sure why the ratings aren't better for this place, maybe because the prices are slightly higher than the other surrounding taquerias... but I'd rather pay more for the yummier food. \n\nPlus it's super clean. And I love that the self serve salsa bar is refrigerated and covered.", "author": "Richie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-03", "description": "ok.  i went back.  it was a bad idea.  This place is just flat out gross - never before, and never again, will i only eat a third of the burrito and then leave because I can't take any more, despite the fact that I am STILL hungry.\n\nMaybe if you get something other then a veggie burrito, or nachos, you actually get food that is not just lettuce and white sauce (which I want to think is watered down sour cream), then it's not one of the most disappointing experiences of your life.  I couldn't tell ya.  But I have no reason think anything other then this place is where bad burritos go when they die.", "author": "Tmon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-16", "description": "carnitas=perfection.\n\nSalty, slightly crispy, porky in flavor, fairly greaseless...the perfect topping for a taco.  great whether you're sober or completely tanked.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-02", "description": "I remember the day I started going here pretty clearly...but I wont write about it, because it is boring.\n\nThe only thing I really eat here are the veggie tacos.  They are either awesome or not.  It depends on who's cookin' although, the same dude made my tacos two days in a row one week and they were kinda terrible the first time (no salsa, watery beans), and kinda good the second time.  \n\nThe best tacos (and the recipe seems to fluctuate wildly) I have had there include:  cheese-bonded double soft tortillas topped with pinto-beans (sometimes they like to use refried, which I think is gross), 2 types of salsa (one avacado-based, the other...well, not avacado-based), lettuce, onion and chopped tomato.\n\nI could complain when I don't get awesome tacos, but I'd rather not bother since the whole reason for going to a taqueria in the first place is somewhat-instant, semi-greasy gratification.\n\n{this review is actually an average of 2 and 4 stars...}", "author": "Maxwell M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "Step 1: Get thee to thine Mission District.\nStep 2:  Enter Taqueria San Jose. \nStep 3: Order tacos al Pastor with everything on them (hot sauce, too, you candy a**!)\nStep 4: Eat.\nStep 5: Fall in love.\nStep 6: REPEAT.\n\nThere it is, people.  Best tacos outside of a taco palapa in Mexico.  Go there!", "author": "G R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "this is hands down my favorite burrito spot in frisco, super steak burrito every time, at $8 bucks its expensive but well worth it cause you get a big bag of chip with it and they just started serving sangria so you can keep the party going after hours.  never a huge line like that spot across the street and theres hella room to sit comfortably and eat.  fuck that other place this is where to go", "author": "Papp J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-03", "description": "Decent burrito.\nIf you do not want to wait for the El Farolito late night line and do not mind paying a little bit more ($7.xx ) for a burrito then try this place.", "author": "Po L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-07", "description": "taqueria san jose has always been a place that i USED to go to for great authentic mexican food. it WAS definately one of my favorites. great food and decently priced, but then all of a sudden a new menu, painted walls, and  prices jumped up. WHAT THE HELL MAN, i hope you realize that there's a great chance of losing customers considering you are in competition with other awesome mexican food close by. whatever, im over it.", "author": "Colin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-24", "description": "It's been 8 months since I've been, but I remember it being so-so.  The one on International Blvd. probably has the best burrito i've had in the bay, but the meat at san jose in the mission just wasn't that great.\n\nI do hear, though, that they have killer nachos", "author": "cheddar b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-02", "description": "Obviously, this place is past its prime, and that's so sad, but I still find the pollo adobado to be the tastiest meat in the mission.  Too bad that's all they got (as far as I can tell), which makes this my second favorite taqueria after El Toro, but I'll keep going 'til they close up for good, which, judging by the amount of business they get, will be sometime soon.\n\nThe chips are a disgrace, as far as I'm concerned, but some people like them, and I'm not there for the chips.  The dining area reminds me of a morgue, except not as well-maintained.  The prices are a little insulting (DO NOT buy a veggie burrito there, it's as expensive as a meat burrito, but with less food, and not much taste; even the woman at the counter said it's a rip-off), and I've gotten gristle in my meat, but I keep going back for more (less and less often, though).  At least you'll always have a place to sit!", "author": "Freeman F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "Open late. Shorter line than Farolito. Why not. Hm...Not the best I've tried but one can be in and out in a few minutes. Major plus. Not the cleanest spot. And in all honesty, I hate the styleof the huge painting on the right wall.", "author": "Tania C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-03", "description": "This is easily the worst mission burrito I've ever had. Go anywhere else and you will get better service and better food. Walk across the street to El Farolito for something delicious, or go up the block to La Corneta at 23rd for a very similar feel but dramatically better food. Rosamunde is also next door --you should consider all alternatives to this restaurant as it was absolutely terrible.\n\nAlso a homeless guy came in while we were there and was eating the leftover food nobody was cleaning up on the other tables. (He apparently also wasn't satisfied as he was picking his nose after for dessert.)\n\nReally horrible experience. We left while the plates were still full because it wasn't worth eating. I would have rather eaten the $18 I spent on that crap.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "The fajitas and burritos were excellent.  The breakfast burrito was strange though (lots of cumin and nutmeg).  \n\nI don't get why El Farolito across the street has a huge line but this place is empty.", "author": "Matthew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "the BOMB!!...regular al pastor burrito [with pineapple mixed in....sssshhhh, it's a secret!] with extra avo...intense flavors!!\nthe super is just toooooo much food for a sane person and the sour cream can 'soften' all the great flavors inside the burrito... \n\nmuch better joint than the \"cool\" hipster place cat-y corner to this one. there's great light, food is super fresh and the place is clean, and tons o places to sit. two epic murals on the wall and they have a menu with a bunch of options...delicioso.... and they don't charge for chips!!!", "author": "'CJ' Edward A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-19", "description": "Not very tasty...  Plus got my order wrong.  Skip it.", "author": "Mason G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-10", "description": "You can grab a dependable burrito here anytime. But what are those little things that set San Jose apart from the rest? Well, first of all, there are the little quarter candy machines. Next, there is the awesome jukebox playing all your favorite Mexcian hits. Then, there is the lovely, serene mural of (what I'm assuming is) San Jose, Jalisco, Mexico. But I suppose I could be wrong about that.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "I have been going to Taqueria San Jose religiously for probably the past 8 years. It began one night so long ago as almost an accident. We intended to stop at El Farolito after a night of partying but the line was too long,we saw the lights on at TSJ and decided to try it out. Now I had been here years earlier as a kid but really had no recollection. Well from this night on I was hooked. I usually get the Super Carne Asada burrito, which is delicious. The other items I've tried there are the tacos and also a torta which was pretty solid also. I go to this place at all hours and honestly I've never been disappointed.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-15", "description": "Sloppy seconds, the burritos are full of juicy meat and sauce derived out of the melted cheese, avacados and beans. More of a soup inside a tortilla than a traditional burrito that can be eaten with one hand. I recommend a side of chips to add texture and balance out the soupiness.", "author": "George M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "Some restaurants can be counted on to do one thing right and that's it. For me, the only thing worth eating at Taqueria San Jose are the tortas. When I'm craving a torta this is definitely my spot. If you want a tasty burrito or taco, definitely look elsewhere in the neighborhood. Like most places around here, they do a decent fresh orange & carrot juice and it's likely you'll never have to stand in line.", "author": "Nate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "one MUST try: Al Pastor Tacos. \n\n(hate to admit it, but wayyyyyy better than the local east los angeles taco trucks i grew up around)", "author": "Sandy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-26", "description": "Oh how I love coming here after a proper drinkfest.  I just loooove the tacos carne asada / al pastor!", "author": "lulu p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-21", "description": "Their tacos are much more fresh than that \"other\" taqueria across the way...and the place is much cleaner.  Given how close it is to the BART station, its the perfect place for a pit stop before heading home.", "author": "Hector M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-24", "description": "When the bars are closed, and you're done partying--or maybe just need a snack to keep going--they're still open. At this point, who cares how good it is or what the ambiance is like? It's a taqueria. The food's decent. It's savory. It's filling. They're open late. It's serving it's purpose well, and I am a happy camper.", "author": "N B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-28", "description": "The al pastor tacos were pretty good, but very oily. The pico de gallo in the salsa bar looked anything but fresh. The guac was boring. But, at least the meat was tasty.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-24", "description": "A solid local place; would prefer to give them 3.5 stars, but it is local, and I love The Mission (I grew up on Dolores, Holmes!). Like a few other comments here, this place is good (bueno) to very good (muy bueno!), but with a few small changes could be excellent!!\n\nToday, I had 2 chicken tacos ($2.20 each?) that had meat overflowing the tortilla! Great! The cerviche fish taco was also nice (with two avocado slices on top). My friend had his first meal there - he had a burrito that he LOVED! He enjoys a good burrito, and Robert said: \"I love the large amount of meat, the pork is perfectly cooked. I'll come back here; and I rank this with the place we ate at in Mountain View - 6 months ago.\"\n\nThere are LARGE windows that look out on Mission Street, and the bathroom is clean. Its also large, not some hole in the wall joint.\n\nOK, what could be improved to make the place excellent?\n\n1) The cashier was unfriendly. (A Latina woman in her late 20s?) Even my friend said, \"She is cold.\" I tried to make a small joke, and she just shut me down. No, I wasn't drunk, and no, there was no line.\n2) I haven't tried everything on the menu, but there are some small things... the chips might be upgradeable; and I think I had their nachos once, and was not happy with them. (Shoot me, I'm a gringo, but I love nachos & half-nachos!!)\n3) Their prices are just right for a local place, but $4.00 for a Corona seemed too high. My friend agreed. If Irish bars charge $3, and Tu Lan charges $2.25, where does the $4 come from?. Four bucks is what you charge the yuppies at La Taqueria!\n4) Yes, there is something I can't put my finger on, that might make it even better... should their big tables FACE the windows? When I'm almost done, if they're not busy, could someone ask, \"How is your meal? Can I get anything for you?\"\n\nLastly, I'm not sure why all the writers fall all over La Taqueria! Is it a place for Marina yuppies? $3.50 for a taco?!?! Yes, its good, but I root for a place like Taqueria San Jose to make the small changes needed to become consistently excellent!\n\nDo you agree? What small changes can they make to become the best??", "author": "M Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "Mission ice cream crawl intermission. You go here for the pork tacos and the pork tacos alone. Two of us had al pastor tacos; two of us had non-pork burritos. Two of us rated this among our best taqueria experiences; the other two thought it was appalling. Fortunately, I was one of the taco-eating pair. Incredibly crisp and oily pork off the vertical spit, cilantro, onions, zingy hot sauce, $2.40 each. If you're fat-phobic, kosher or veg, this isn't your place. If you prefer burritos, well, I won't laugh at you, at least not to your face. If you're me, you can't wait to go back. Still, docked a star for making my friends queasy.", "author": "Brad L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "i've been here tons, but haven't yelped it...\n\none of my favorites is the baby burrito. $3.00 for a decent mini-burrito, i think you can even get 2 for $5 of these suckers if you wink at the cashier.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "It's open 24-7.  It's bright and the bathroom and dining area are clean.  I get burritos elsewhere, but the tacos aren't bad.  The tables are big which is important for playing board games after we Muddy's closes Fridays at midnight.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-16", "description": "Can't find a burrito joint open at 3am on a Friday?  Look no further!  I'm sure the food is great here sober, so i have been told, of course usually an a Saturday at 3 am looking for food, means that you have had a bit much to drink.....so it you're tanked...then the food will be amazing!  just don't puke it out in the car.   hahahaha......", "author": "A P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "remember to ask for your taco non-spicy.   I tried the beef taco and casadilla.  Yum and yum!  Plenty of table.  Service was quick.", "author": "Sydney L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-15", "description": "fish tacos, my friends, fish tacos. grilled, yummily seasoned, no frills, simple and a tad smoky flavored = the best fish tacos in town. nope, el metate doesn't compare, other taquerias fry their fish to death and serve it up lifeless and tasteless. at taqueria san jose, 2 fish tacos, a healthy squeezing of lime and some spicy salsa, a couple of negras modelo and I AM DONE! giving 4 stars in case i find another fish taco place that's better.\n\nUPDATE: 4/7/08\ni had a fish hankering and it's been a while so off to SJT I went. But wait, $5 freakin' dollars for a bottle of modelo?! Geez! And looking at the rest of the menu, it appears that they have jacked up their prices! WHAT?! $4.40 for a super taco?! (It used to be $3.45). I'm decreaing them a star because part of the allure was the reasonable prices for delicious food. Now it is bordering on, well, let me think for a second if I want to spend that much on stuff. No way Jose.", "author": "ray e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "Let's be honest - you really only end up at Taqueria San Jose after a long night of late-night drinking. I'd like to tell you to order X, Y and Z, but the truth of the matter is, I never remember what I've ordered the next day. Their food has the magical ability to sop up free alcohol flowing through your bloodstream - the more cheese and fat the better. Strongly recommended... I think.", "author": "Andy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "This restaurant is in a great location --- 24th and Mission but the food did not measure up to what I would expect for an authentic Mexican joint in the mission.  Plus it seemed pricy and the horchata was watery", "author": "ITesh J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "I devoured the chicken burrito I got here. Normally I don't even like burritos. And the complimentary chips were a nice bonus.", "author": "hello y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-02", "description": "The menu is getting a bit pricey but at 2:30 am on Friday or Saturday when the line is out the door at El Farilito, this is the spot?", "author": "Mingus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-09", "description": "Definitely one of the better taquerias in the Mission.  The spicy chicken tacos were spot on and the jukebox did the trick.  Convenient location near the 24th bart station makes it easy to remember.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-10", "description": "Arrived a little after dinner to find the place deserted.  Apprehensive, I tried the carne asada taco and found the meat pleasantly tender and flavorful.  The guac and salsa was generous, fresh, and refreshing.  Price about standard for mission tacos.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "Wonderful food!  I had the supper burrito.  It was huge and very good. They had a large variety of salsas and guacamole, all good, though the chips were a little thick.  My husband had the carnitas, and shared with me. They were excellent as well. I especially liked the fresh squeezed orange juice.  We've eaten here twice and it has been tasty both times. They have a nice staff and clean facilities.", "author": "Becky C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "Great tasting Carne Asada Super Burrito. It's probably one of the tastiest I've had in SF. A bit on the pricey side and be prepared for a long wait if there's a crowd. If you happen to be exiting the 24th and Mission St. BART station, this place is diagonally across the street.", "author": "Gus L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-10", "description": "You know, you see a taqueria with a line out the door over there and then this one with nobody in it and a bell goes off. I didn't hear it.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-06", "description": "HAven't been in since like puberty, but back in the day this was one of the only spots open past 2 am.  It wasn't clean, it wasn't the best mexican food, but damn it was good at 3 am, mmm!!!", "author": "Aaron I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-28", "description": "it's the mission. it's a burrito place in the mission. it has a super burrito. \n\n\nbut cancun is just down the block, and it's much better. and has a better atmosphere. so i can't rag on this place since it's good, but i prob won't take it over cancun unless there is parking right on mission in front of san jose.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-25", "description": "This place is making me fat. The unlimited chips and salsa, carnitas and carne asada plates will end me. The plates are huge, stuffed with all the usual sides of frijoles, sour cream, guac, warm tortillas and fresh greens. There is no way anybody can leave here still hungry.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-17", "description": "Skirting the dodgy deals on the Mission path from Hayes V. can really build up an appetite, so I for one was glad when my culinary adviser, Colleen l., suggested we stop in for THE best carnitas in the city. Being somewhat of an authority on all meats roasted, I was understandably skeptical at first. But, I'm happy to report the carnitas were excellent. Nicely roasted, expertly seasoned, they tasted divine. However, the chips that came with my nachos...not so good. I was glad that enough guac, cheeses, and sauces had been poured over them to help me forget what they originally tasted like...cardboard, I think. I will return, and this time, will order my carnitas in the form of a burrito.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "best carnitas in SF hands down.... Drove by there a couple of nights ago and forgot how damn good this place was....Tell them extra crispy and they don't skimp on portions...", "author": "Richard G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "While a burrito and horchata came out rather expensive, I did enjoy them.  The grilled chicken was wonderful and the horchata authentic, with rice and cinnamon.", "author": "Victor R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "Delish fish tacos and shrimp tacos. No rice or beans filler, which IMHO too many taquerias rely on to mask bland meat/fish/etc. Just perfectly seasoned fish & shrimp, fresh chunky salsa, wrapped in a yummy corn tortilla. Great fresh selection of salsas. Crunchy tasty chips without a spot of grease. \n\nBe prepared to wait, they make everything fresh to order & though it's cheap, this ain't fast food.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-02", "description": "THIS REVIEW ONLY FOCUSES ON THE TACOS.  Their al pastor, pollo, lengua, and carne asada tacos are all the best I've had outside of Mexico.  They are all liberally spiced.  Some people might consider them over-spiced, but I love it that way.  The most surprisingly good taco was the pollo, which I never order at taquerias since it's usually rather bland compared to al pastor, but here it was as spicy, tangy, and delicious as the pork or beef.  I've never noticed tendon or large chunks of fat in the meat.  The salsa bar is one of the better ones.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "he had tripe and cabeza tacos, i had grilled fish tacos, and chips for us both.  all of this was just short of $9, but mind you we paid for the chips since they weren't complimentary.  it's a great place for late night eats, and a good alternative to el farolito across the way (they don't serve fish, only shrimp as far as seafood goes).", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "The al pastor here is the best in the Misssion.  Crunchy, crispy pieces from the outer edge of the spit, juicy, buttery pieces from underneath.  When I want beef, I roll to El Farolito, but when I want swine, San Jose gets the nod.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-27", "description": "When I go for Mexican, I usually go for beefy burritos 'cause it's my thing.  Big beefy burritos.  But every now and then, I'll get this intense craving for fish.  Just occasionally.   And that's when I'll sneak over from El Farolito's (I'm sorry, my love!)  to San Jose's.  Their fish tacos are amazingly fresh and always cooked to perfection.  Seared, almost caramelized, on the outside and flaky on the inside.  Yum.  Their salsa bar, though more expansive than Farolito's, just doesn't do it for me.  That's when I run back \"home\" to Farolito's begging for forgiveness.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-27", "description": "Excellent Tacos Al Pastor, served from the spit!  However, the green salsa is thicker and creamier at the Oakland branch.  Or is it a branch?  The worker said they weren't related.  5 stars for the tasty pastor goodness.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-08-21", "description": "Maybe I wasn't sufficiently drunk when we got here, but this place doesn't get too much of my love. To start with, the chips taste like cut-up pieces of cardboard. Now imagine the nachos - make that cardboard soggy, and top with sour cream and a little bit (emphasis on little) of cheese. Muy bien (smack your lips). The soft tacos also weren't much to write home about (I prefer taco bell, which doesn't say much). Fortunately it was cheap, so this (mis)adventure didn't break the bank.", "author": "Dana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-07", "description": "I enjoy their burritos, tacos, and ceviche.  Not much to expect from a local taqueria, but you can always count on San Jose getting your order right and walking out satisfied.", "author": "Adrian N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-26", "description": "Terrible.  Just terrible.  The meat tasted past its prime; the horchata, gritty; and the guac, watered down.  Would I rather go McDonalds across the street? Hell yes, and I haven't been to one in years.  To sum it up, there's a reason the line's out the door at El Farolito and this place is empty.", "author": "Leon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "This place is known for tacos al pastor, and they deliver.  My food here has always been great; the chips are good, and they have a salsa cooler that looks like a kitchen appliance but contains a number of good salsas.  The decor is a little grungy, with some hand-painted murals on the wall, a toilet that you have to get the kitchen attendants to unlock for you, and a seemingly ever-present old man drinking the same beer with the same half-eaten plate sitting at the same spot staring out the window.  Service is pretty friendly.  Definitely a good place.", "author": "Nils J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "Same menu as Taqueria No 3 in North Beach, same friendly service, but not exactly the same carnitas. Ordered the carnitas taco, and it was great, but not excellent. The pork was tender, however it didn't have that added outer layer of crispiness that I've come to expect (from too many visits to Taqueria No 3). Maybe it was just an off day. The salsa though, oh the salsa. Not sure exactly what is in the green salsa, which seems to be tomatillo, but a little thicker and spicier...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-15", "description": "I had a Super Taco with carnitas; the meat was tender but too much was going on. I like to pick up my tacos and eat them without half of it falling back into my plastic basket. I think next time I will pass on the Super upgrade and focus on the basic taco and flavor of the meat. Watch this space.", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-21", "description": "I wasn't too impressed with this place ... got a cheese enchilada, and it was aight. I'm sure there are better places on the Mission.", "author": "Antara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "Pricey for average Mexican food, but the burritos are huge. I had a lengua burrito and it's the first time I've had tough, gristly meat. It was otherwise tasty. Nice touch that they have a covered/refrigerated salsa bar. And the jukebox is LOUD.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-11", "description": "This place is not very good. I used to work nearby and came here maybe twice to eat. Most of what I got was bland and the chips suck. I once tried the carnitas and got TOTALLY grossed out, they were soft and dry at the same time. El Farolito is way better albeit greasier!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-04", "description": "Went here after seeing the crazy line at El Farolitos and was reminded of why i stopped coming 3 years ago. 9$ burrito should get you a pretty d*mn good burrito in the mission; not the case here. Super burrito was cold, sour cream was watered down, just disappointing. If I remember correctly, their nachos are decent.", "author": "Kellen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-06", "description": "I love this place. I usually order the super vegetarian taco here and it never disappoints. It is basically a mexican platter, under the guise of a taco. If you get it to go it is practically busting out of the styrofoam take-out container as it is heavily-laden with veggies and rice. There is hardly ever a line and there is a self-serve salsa bar, something missing from many of the other places in the vacinity.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-12", "description": "It's good for late-nite stuff, but it is not on par with the other taquerias. \n\nI cannot put my finger on it but there is just something not right with the burrito. It was good enough for its purpose, but I would not go to this place again unless I had to.", "author": "Rahul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-25", "description": "I've tried a lot of places in the mission, but my heart always goes back to this place. The \"special\" plate with two tacos, beans, and avocados looks so pretty and tastes marvelous. The burritos are fantastic, and I love the pic of the guy who is making your food on the wall when you walk in. Mario Batali listed this place as one of the top tacos in the country.", "author": "Mama C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "get the fish tacos!!! for dinner one night, we decided to order three little things: a ceviche tostada, a shrimp taco, and an al pastor taco. the al pastor here is weird and tastes way too much like it was smothered in american-style bbq sauce. it wasn't bad but just not really what you expect. the ceviche tostada was tasty but a little too limey. the shrimp taco was decent but doesn't have all that much flavor. \n\nstill a little hungry, we ordered one last thing to round out the meal: a fish taco. this last taco blew us away - the fillet of fish on the taco was so flavorful! we went back again late one night after parties and ordered two fish tacos and again, delicious!\n\nupdate 7/2007: i was feeling adventurous and tried out a tripas taco here. it was really nicely crunchy and low on tripey-funky-aftertaste. muy delicioso!", "author": "Angi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-12", "description": "Try the fish tacos. I see the other reviews are concentrating on the al pastor and carnitas. But try the fish tacos. They are really good. They don't deep fry the fish, wish is key. They sautee small chunks of (guessing) talapia, cover it with minced red onion and chopped cilantro and squeeze some lime on it. That's it. Fantastic. As far as I know, this is only taqueria that makes fish tacos this way. With a beer and football games on TV, lunch here on a weekend is a joy.", "author": "Kourosh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-11", "description": "I've only been here once and I loved the carne asada burrito. Big, fat, full of meat (w/ avocado), and not soggy --- yum! Enough said!", "author": "Betty L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-25", "description": "Drinks here are outrageously priced.\n$4.00 for a domestic? cmon this is just a regular sh*t hole taqueria\n\nChips are NOT homemade.\n\nI had three tacos.\n- Carne Asada = nothing special, boring and bland \n- Grilled Chicken = terrible\n- Carnitas = the best of the three but nothing special considering how good most of th other taquerias in the area are", "author": "Henry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "These tacos are bomb. Absolute bomb. And at a complete neighborhood service, one of the only digestable eateries open very late at night, they are perfect, really for any time of the day, or when the vampires are trolling around. Lestat, come back with my taco!!!!", "author": "Lucian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "damn good tacos, especially because everything in the mission closes so damn early. i came here on a friday night at about 9:30 looking for a taco or pupusa because i wasn't satisfied with my meal at Home in the castro. i settled on taqueria san jose as not much was left open other than el farolito, which was still pretty packed so taqueria san jose it was. 2.21 plus tax (kind of expensive) for a pollo taco, which was hot and greasy. the salsa and spices were plenty hot and spicy, and the taco was made fresh to order, so it was piping hot too. it was a legit taco. i've read about their burritos and other plates, and they don't sound too enticing, but their tacos are legit. if you want some cheaper tacos or good burritos though, you can hit la taqueria, el farolito, or anything down 24th street. all of those taquerias are legit, especially vallarta, and they're much cheaper, but for a hot, lat-night taco, taqueria san jose isn't a bad choice.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-16", "description": "I've learned my lesson: When you find The One, never ever stray. I went here instead of my trusty Farolito just to try something different. I should have noticed the red flags. There was nobody inside and I got my order way too quickly. The veggie burrito was lukewarm, soggy, and loosely wrapped, so everything started to fall out when I unwrapped it. It was supposed to come with avocado, but I could barely taste any. For $7 (which is more than a super burrito at Farolito!) I was really disappointed. Never again.", "author": "Tammy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "i would have given this place 6 stars. friendly service and good food. but they just raised their prices which bums me out as they were already on the pricey side.", "author": "Wayne T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-11", "description": "not the best place carne asada wasnt that great super chicken quesadilla was decent , very fast service though !", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-05", "description": "our food tasty benefit ran out of food... we didnt really get any... so we had to eat something! we randomly picked mexican, then went to the mission and randomly walked into this place. it's just an order at the counter, and they bring you some food type place. b didnt like his fajita. s loved his pork tacos. j liked his pork enchiladas and my chicken ones were ok. i think s wants to come back for tacos.... but i would not come back here on purpose. it was just eh. not bad not good. except for the strawberry water... that was the best i've had so far. cheap tho... mine came out to less than $15.  you get  a lot of food (3 enchiladas with toppings, nachos rice beans...). and empty on a wednesday evening.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "my first taco experience in san francisco and one i keep coming back to. the choizo taco is incredible. spicy, saucy, flavorful. i like the pollo and carnitas and other ones as well, but it's the chorizo one that makes my mouth water.", "author": "dannebrog .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-28", "description": "A bit expensive for what you get.  I like taquerias who fry their own chips too.", "author": "Antony E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-11", "description": "The absolute best pollo asado tacos in the city- and as a pollo asado taco freak, I have tried a good number of them. The pollo is heavily marinated and cooked to perfection, with the right amount of spice, cilantro, onions and sauce. Prices are good and it's open late. You don't get flavor like this at El Farolito- it amazes me people go there instead of here for their late night taco fix.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-17", "description": "i'm surprised that nobody commented on their taco chorizo.  in addition to the chorizo, i ordered their version of the al pastor and found it be fairly mediocre to california standards (however, it was really great for NY standards).  but the star of this restaurant was their taco chorizo.  minute cuts of DELICIOUS chopped fatty pork, seasoned with chili and paprika in a soft fresh tortilla.  the flavors truly burst'd in my mouth, and the sides (tomato, onions, lime slices) only complimented it, however, they weren't necessary.  it was easily the highlight of my first mission-style latino experience, next to my first REAL burrito de cabeza just a few doors down at La Taqueria.  my plane had landed only an hour prior to my first visit at this establishment.  it was around 3pm in the afternoon on a peaceful friday.  business was slow and i was the only customer there.  it's moments like these that made me pause, and think to myself: \"life is fucking beautiful in california.\"", "author": "Hugo B."}
