{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "Ordered out so can't really speak about the spot or the type of service and staff. The food though, was really tasty. I ordered a plate of nachos with carne asada and shrimp tacos. The tacos were good though I wish there had been more shrimp in them. The highlight for sure were the nachos - they were hefty and had a lot of asada as well as nachos and cheese. I liked that the jalpeños weren't super spicy yet added a nice kick. The portion was also massive and we couldn't finish it despite being two people. \n\nOverall, a great place to order from and I want to check out the restaurant in person!", "author": "Valeria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "I wanted something quick to eat and this place seemed like a good place as there were a good amount of people around this food truck for lunch. I suppose a lot of them are employees in the area. \n\nI can only comment on the cheese quesadilla because that's what I ordered, but it was a tiny bit pricey for what I received! I guess it has to do with the guacamole that they include as a side along with sour cream. I like that they also include a bag of chips on orders over $8. In the end, it was just a normal cheese quesadilla and it did fill me up. Maybe next time I'll try a burrito!", "author": "Katrine U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This review is for their food truck/catering service:\n\nThey cater to our company every other week and those days are my favorite days to come to work. All of their dishes are super fresh! From the fresh sweet tomatoes in the Pico de Gallo to the fresh lettuce used in their salad. They really put an effort in sourcing fresh ingredients. Not only that, they even offer vegan refried beans (which is really rare, since most mexican taqueria uses pork fat or old fried oil to cook their beans). Another highlight is their guacamole, it's absolutely delicious! Well-seasoned and well-balanced with the right amount of acidity and spice. After one bite, you'll be going back for more and more! Their red salsa is addicting but also really spicy. This is definitely one of my favorite Mexican place in San Francisco.", "author": "Fei S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "Sometimes decent, sometimes bad. Food can get very salty depending on the day.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-05", "description": "The only reason why this place receive two stars from me because of convenience. \n\nThis place is closed temporarily right now because of who knows what, but before they closed I was the last customer. Just say they ruined my 30 minute lunch. Instead of telling me they have no more ingredients, they still decided to serve me. They could have told me that going to the taco truck across the street will give me better food service, but they wanted to be greedy and just take my money. \n\nI ordered a super chicken burrito. When I arrived back to my office, I took a bite of a big chunk of rice. The second bite had more rice and a little bit of refried beans. Third.. fourth... fifth.. rice and beans! All they had left was rice and beans! Where's my chicken? Where's my Pico? Where's my cheese? Where's my sour cream? HELLO? Do you think I wouldn't have noticed? I paid $11 for a rice and bean burrito? \n\nAfter work, I saw two men working on the truck. I believe one of them was the owner. My coworker and I walked up to them and I told them the situation. The owner had the nerve to ask me who made my burrito. He put me in an awkward position because it was the old man he was standing with. \n\nHe pulled out $11 from his pocket, gave it to me with no apology. \n\nIf they recommended the truck across the street, I would have gone there to get my food, but I would still be a returning customer once they opened back up. But instead, I'm a new and returning customer to the food truck across the street.", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "I've only had the tortas here and they are great. Their salsa verde is fantastic. The seating on the side is nice and shaded if you choose to eat there.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Great food with great prices.  The burritos are always so satisfying and the Taco salad is delicious.  They also provide chips and salsa.\n\nBe sure to get their point card.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "order out it's the C A Z A D O R ES n the rest is e a t\n\nu c i order TACO SALAD n BURRITO of the dinner these items i'll add the meat\n\nu c i'm 5 foot 7 n i'm foody heaven n i dine to a t\n\nu c i write more reviews than muhammad ali n i post so viciouslyyy\n\ni got burrito grease i got guac n sour cream that definitely fed the mouth\n\ni got POLLO hermano n a AL PASTOR every time i call out", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "I ordered the al pastor regular burrito and it was so good. My only complaint was that the pieces of meat could have been smaller - the current slices were a little too big which made it chewier and harder to eat. Otherwise, great burrito and love their salsa verde.", "author": "Lillian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Ordered through yelp. I got a carne asada super burrito and there is no meat at all! Cut it in 3 different places and nothing! Gave it three stars instead of two because the burrito is still tasty and the salsa is good.", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-24", "description": "When you want a quick bite outside in their outdoor patio or for take-out, drop by this corner.  The service is fast and friendly with a variety of items and meats to order that aren't on typical Mexican food truck menus.  All orders over $10 come with crispy chips too.  My favorites include their fish tacos and garlic shrimp cheese quesadillas.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Love this place! It's close to my office so I go here frequently. Their salsa and hot sauces are great (wish they bottled and sold it!) and their burritos, tacos, etc. are top notch! \n\nThe staff is great too! They always start up a conversation and are very friendly. \n\nHIGHLY RECOMMEND!!", "author": "Dan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "I've driven by this spot late at night and always thought it was a very random/odd/sketchy late night food truck spot, located at an intersection on Van Ness just south of Market with nothing else around it. When my coworkers suggested we grab good, quick Mexican for lunch, I had no idea they meant this place, but I'm glad I discovered it.\n\nThe food here was better than the food truck options at OTG Civic Center in my opinion. Tasty, cheaper and bigger portion sizes. There's a little seating area if you want to stay and eat. They give you complimentary chips too, which were so much better than the usual tortilla chips you get with Mexican food. Theirs were thick and crunchy and not overly salty.\n\n* TACO SALAD ($7.25, add meat +$1.50, add fish/shrimp +$3) - 4.5/5\n[beans, iceberg lettuce, sweet salsa, pico de gallo, guac, sour cream]\nI was honestly expecting a sad salad with mostly lettuce and a little bit of meat sprinkled in. Instead, this was a loaded salad served in a giant tortilla bowl! I got mine without beans and with chicken, which was a little inconsistent - some very moist and tender pieces, some on the dry side - but there was a good portion of it. My favorite part might have been the tortilla bowl, which was thick and crunchy just like their chips, but the bottom got a little soggy from all the liquid from the salsa.\n\nDefinitely recommend stopping by for a quick lunch or late night food!", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "This place is great. Not only was the food delicious, they were able to put together a catering order for 30 under short notice. I called at around 9am and Cesar delivered shortly before 12pm, the requested delivery time. My office was so excited by the taco bar and the taqueria people were really nice. We will definitely add them to our food list for office events.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Every time we have been there both the food and service have been incredible. Special shout out to the crunchy tacos.", "author": "Kaia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "I come here every week and I love it!! My favorite thing on the menu is the crispy super taco- they way they make the shells is so delicious! They are also super friendly and welcoming.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "My favorite spot. I feel it's a bit pricey but it's worth it. Quick service , consistent flavor. Kind staff. I'm glad I started going here,  but I'm also unhappy I started going here because I'm going to become a taco. Omg please try the crispy tacos! I'm officially a fan of them I usually get the regular tacos but I tried the crispy one today and let me tell you it rocked my world!! My favorite place 10/10", "author": "Jaleesa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Staple in the list of restaurants I eat at on the regular. Good food and very friendly staff.", "author": "Cabure B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "When I discovered Taqueria Cazadores, there were angels singing. It's a food truck stationed on Mission St between Van Ness Ave and 12th St. Walking distance from where I normally work and attend meetings. Not too sketchy of a location either. Everything that I've tried on their menu is fantastic and reasonably priced. I've had the California burrito and a regular carne asada burrito. I would get both again.\n\nThe service is very friendly. There is some outdoor seating next to the truck, though I've never actually stayed to eat. Great place for a lunch break during the week, but the line can get long. Either get there early (around 11:30 AM) or order ahead of time. I've always taken my food to-go, and it's always prepared quickly. They also do delivery and pickup orders. My favorite part is that they're open relatively late, until 11:00 PM on weekdays. Closed on weekends, though. This has become one of my favorite Mexican spots in the whole city. Not sure what else to say other than, I'll be back many, many more times!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Will most likely be my go-to taco/nachos/quesadilla spot in SF. Not too greasy or salty, great quality of ingredients, friendly service, very reasonable price. Not skimpy on the guac and fair wait time. Overall a 5+ experience!", "author": "Heidi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "Love the shrimp burritos, but they always get the order wrong, absolutely every single time.\n\nMy order is \"shrimp, rice, and pico de gallo\", but I always get either sautéed onions, sour cream and guacamole, or beans as well.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "My super burrito wasn't super. It was small and barely contained any meat. I ordered to-go with GrubHub. I am not sure who was responsible but the extra sauce/salsa was never place in my order as requested. The burrito was pricey for a thin and barely filled burrito.", "author": "Chantel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I had the crispy tinga for lunch today and it hit the spot! Everything was fresh & the flavors all married together perfectly.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "Sometimes I want a salad with a little kick.  Cazadores' garlic and lime cilantro salad with shrimp definitely hit the spot for me. I've only known about this place because of my co workers. Till this day, the only thing I've order is the salad. \n\nOrdering the garlic and lime cilantro salad by itself is $8.75. With shrimp, it costs $1.25. With chicken, I believe there is no additional cost. What makes the salad is the dressing - lime cilantro dressing and of course garlic! \n\nI would always brush my teeth, mouthwash or chew gum after munching on this salad. I don't want to have stinky breath in my meetings!", "author": "Kathleen U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "It's about time I write a review for this place since it's so incredibly good!\nI've had the chance to try several of their menu items  including burritos, burgers, homemade tamales, and the oh so delicious fish tacos! The food has fresh and unique flavors  that I have never quite experienced before!\nThe staff are super friendly in person and over the phone and service is quick and efficient. I wish I would have discovered this place sooner given that I only work about a block and a half away. Definitely my go to place for lunch! :)", "author": "Laura C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Great veggie burrito! They actually grill the veggies and the salsa is (optionally) actually a bit spicy. Great quality, cool little food truck spot. The pickup time was a little slow, but still not too bad. Would def come back again.", "author": "Rich W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "They were friendly. The food was good. Not sure what else to say about it. Literally nothing bad happened. Eat here.", "author": "Simon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "I love this place! The shrimp salad is delicious. The taco salad and tamales are scrumptious as well. Every once in a while they run behind in filling online orders, but they have a cute little sitting area which makes the wait more pleasant. Once or twice I've received a salad with over-cooked meat or veggies a little past their prime, but this a rare occurrence. They've been closed for a few weeks now...I'm hoping they'll be back soon. Come back Taqueria Cazadores!", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-21", "description": "My order comes with avocado but when I got back got work there was no avocado and that's the best part of the garlic lime salad.  I have ordered many times so I am disappointed.  Probably won't go back if menu will not be consistent", "author": "Michelle X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Best permanently located food truck in the city. (Only?) Flavorful, consistent food, robust salsas ... Only down side is the location astride a huge 5-way intersection of Van Ness, Mission, and ... and that other boulevard-width spur. Amusing that this quirky venue is situated between SF Planning and SFMTA.", "author": "Barry H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-02", "description": "Ordered food for 35 people.The food was good BUT THEIR CUSTOMER SERVICE IS SHIT.  Paid $350 to be Treated Like SHIT.\n-Ordered food on Delivery.com on a Friday for Tuesday Delivery at 11:45 am.  \n-Called Monday to confirm food will be delivered by 11:45 on Tuesday, they said \"no problem\".  \n-Tuesday at 11:45 No Food for 35 Hungry Staff \n-I started calling at 11:50 to see about the Food.  They kept saying \"we are working on the order\" What do you mean? You should be HERE by now. Not working on the order.\n-They kept blaming Delivery.com and Uber. \n-It Turns Out THEY WERE LYING!!!!  THEY DIDNT START TO COOK THE ORDER UNTIL IT WAS TIME TO DELIVER FOOD FOR 35 PEOPLE!!!\n-Uber was waiting on them to finish the order. \n-Food arrives at our office at 12:35 pm.  \n-MORE THAN 45 MINUTES LATE FOR THE STAFF LUNCH FOR 35 PEOPLE.\n-TERRIBLE CUSTOMER SERVICE! TERRIBLE PHONE SERVICE!!!!\n\nGo Here if you want to be treated like shit.", "author": "Luba P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "Closed until further notice. I was so excited to get these tacos. But nope. Ridiculous. Man I've got the munchies.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Shared their nachos this afternoon with my daughter...we both couldn't stop saying mmmmm each bite! Service was great too!", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "I work a block away from this place and absolutely love it. We go almost once a week. Highly recommend anything with the tinga in it.", "author": "Jordan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Our new go to, walking distance tacos. Just delightful food, and great people. I tried to order pickup online during a storm and showed up covered in water to find it hadn't reached them. I didn't need to worry though because after looking at my receipt, they busted the order out in less then ten minutes. They have my business just for that.", "author": "Evan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "This food truck is pretty good since its only one of the few places I can go to eat during my lunch break. They are super friendly and quick with your orders. I usually order it ahead of time online, and pick up and super easy. The owner is nice and remembers what I always order and always makes it as easy as possible for pick up or ordering at the front cashier counter. \n\nI love their shrimp salad, there are days where I want something light and that would be my to go food. Their quesadilla is good and the portions are huge!  I love their soft tacos, I usually order two super tacos, and its pretty filling.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Carne asada super burrito?  Pretty good.\nVeggie super burrito?  Equally good.\nAl Pastor soft taco?  Should have gotten more of these... Delish!\n\nThe red chipotle salsa was good, but the spicier green with a heavy cilantro flavor was even better.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Best carnitas around. Chips are addictive. Salsa is sensational. These guys have it nailed! Super stoked that they are only a block from my work! Eat here once or twice a week no matter what!", "author": "Trevor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I'm a big fan of the veggie burrito. Wish they were open on the weekend!", "author": "Miles S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "I needed a quick and cheap lunch, and Yelp lead me to Taqueria Cazadores.  It is essentially a non-moving food truck with a little outdoor seating area.  The girl in the truck was really confused, but the portions were huge.  The regular burrito was very filling, and you can choose between black, pinto, and refried beans.  In my opinion, the burrito had too much rice in comparison to the other ingredients.  The burrito also comes with free chips and red or green salsa.  Some chips were stale or undercooked, and they have salt and parmesan cheese on them, which is odd.  They were still good, but the salsa was awesome.  All of this was only $6.75.  They also gave me a free soda when they were out of coffee for the Yelp deal.\n\nThey have a little outdoor seating area if you don't need to get back to work.", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "I got this delivered using the grub hub app and it was the best decision of my night! The food came really quick, I got it 30 minutes after I ordered it and delivery guy was very nice and ran it to me because I didn't have shoes on. I got a veggie burrito and a side of guacamole and it was amazing! The veggie burrito was just like I wanted it, just like a normal burrito without the meat. I don't have anything else to say but that the food was amazing and I'm happy I have 1/2 of a burrito left for tomorrow! I'll be back soon", "author": "Grace V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-09", "description": "First time ordering from this place through Uber Eats. NOT GOOD AT ALL!!!! I ordered the garlic shrimp and onion quesadillas and 2 chicken crunchy tacos. The garlic shrimp in the quesadilla was super fishy and it had an over load of onions in it. The crispy chicken tacos were so disappointing the worse I ever had. The chicken didn't taste like chicken the texture was like potatoes I was so confused. I'm hoping I don't get food poisoning  I will never order from here again.", "author": "Lennie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Amazing place for a quick bite! Get either the Super burrito or simply the regular plate with carne asada and it'll fill you up for the entire day! No skimping as shown on the picture. Meat was cooked to perfection. Chips are also available for free upon request. Superb customer service as well! Definitely a must-try!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-25", "description": "I got the California burrito which had a lot of juice spilling out of it, undercooked french fries, and has caused my current food poisoning. Good chance I won't be coming back", "author": "Dan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "If you go around noon, you will have to wait about 20-30 minutes for your food to be ready. I would suggest going before or after it gets busy (12-1). Very friendly staff that got my order spot on, a cilantro garlic avocado shrimp salad and I got a pollo crispy taco all for $13. The taco was so so, however the salad & the dressing to be specific was incredible. The salad alone is a good meal, very large and lots of toppings. Also there's a red and green salsa by the silver wear in the seating area, the red salsa is fantastic and not hot at all, just good flavor. You can either order ahead or show up and order, take it to go or eat there. Overall very good hidden  spot to eat once you find it. 4 stars because the taco was allllllright not the best.", "author": "Brady H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-14", "description": "Was a great place for Burritos and Tacos. No longer, something changed, I dont know what. Quality? Cleanliness?  Suffice to say that I was diarrhea about 20 minutes after my meal. (Pork Burrito). My girlfriend got food poisoned and stomach cramped so bad her stomach has been messed up for a couple of days. Also had Diarrhea, (Chicken Tacos) \n\nDang, It was a good place before, but I will never go back now. Foodie beware.  Owner, better quality control please. Service is always friendly and accurate, thus the extra star for service, but food poisoning is a deal breaker.", "author": "Pavle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Such good food!!! You can take the freshness!! The chicken is grilled White meet, it's not that oil it's just amazing Mexican food! I practically can eat here everyday!!", "author": "Carol S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-15", "description": "Ordered delivery, it took 30 minutes longer than estimated to arrive, every 5 minutes it said 5 more minutes, decent food but plan on waiting indefinitely for it", "author": "Shelby D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "I'm lucky to have them so close to my office. I stress so much at work that I rely on consistent dishes during lunch for a much needed burst of Zen. My safety net is the Garlic Shrimp & Lime-Cilantro Salad.  In 2 yrs, I have never come close to re-creating the salad dressing or their salsas. I have basically given up. The shrimp is perfectly grilled and the sauces give the salad its depth. If you are looking to fill up, ask for the chips. The chips are delicious.", "author": "Evelyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "This temporary food structure is on a busy street corner I've passed multiple times on the way to the city's Building Department. Taqueria Cazadores is great for to go orders, or sitting outdoors for a quick bite to eat. It's generally been pretty busy each time I've walked by.  I was famished one day as I walked by and decided to sit and eat al fresco.  Nothing fancy, paper plates and you need to be okay with canned sodas (hard to accept at first as I prefer fountain sodas). I ordered a fish taco, fries, and a diet coke for a little over $7, that's a great deal as I expected it be more.  The fish taco had a generous portion of fish and fresh veggies. The fries were seasoned well, but not as crispy as I like.  Customer service was very friendly, and they seemed to have a lot of regulars.  Would stop by again the next time in the area as it was affordable, fresh, and convenient.", "author": "Nova P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "Real good sandwiches and tacos. The place  is really nice even if you are close to the road it's still a little oasis. Looks like the movie \"chef\" with Jon Favreau.", "author": "Thomas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "This is a food truck with its own little sit-down area to the side. I wanted to write this review because the customer service was amazing. We got there a little late (around 11pm, I believe), so most of the chairs and tables were already folded up and put away. The cashier came out and unfolded a table just for us and tended to every thing we needed. On top of that he was able to fit in a good conversation here and there.\n\nCarne Asada fries weren't on the menu, but he brushed that fact aside and made it for us anyway. The fries used were steak fries (a little different from what I'm used to) but nonetheless it was a good dish. Overall it's a quality place with quality service and food.", "author": "Anna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "I stopped by to grab some breakfast and ordered a egg and chorizo torta. It was so legit! The bread was perfect, the queso fresco was the perfect amount, and the chorizo to egg ratio was excellent. Coming from San Diego I'm pretty picky with my Mexican food, and I have to say this place surpassed me expectations and then some. Judging by they made that torta I'm expecting everything else to be on point. I'm looking forward to trying more items in the future.", "author": "Rudi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Ordered through grubhub and not only was the delivery incredibly fast (about 30 minutes) but the super burrito I ordered was delicious. This is the best delivery burrito I have ever ordered in the 14 years that I have lived in SF, hands down. The meat wasn't fatty, it was cooked perfectly and the salsas are flavorful with the right amount of heat. It's also a HUGE burrito, a great bang for your buck. I cut mine in half and saved the rest for lunch the following day. This place is solid and anytime I order delivery mexican, it will be from here and nowhere else.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Update: Service is good,super burrito on point,very tasty generous amounts of steak a sure hit.\n\nI have eaten at Taqueria Cazadores on many occasions. I have only ordered the steak Super burrito which is very tasty. And I here the burgers are very good also. The customer service is good,and keep in mind its a portable eatery i.e. a truck. So be prepared. At lunch time it gets very busy,and only two cooks are making the food so the wait can be long in excess of 20 mins for your order. Best to arrive 11 AM to avoid the wait.  They do have a small area to eat at,and as most get the food to go you there is always room there to sit.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "This place is a food-truck + small seating area outside. That being said, it does sell a california burrito.\n\nAs far as california burritos go, the fries were somewhat soft and mushy, which resulted in the entire burrito skewing toward the mushy side as the burrito was filled with refried beans. The carne asada was fine but this burrito was nothing special.\n\nI would probably choose something else on the menu if I found myself at this restaurant again.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Sergio is the best!!!! He is one of the owners. He has a great staff that is friendly and welcoming. And the food.... Is AMAZING!!!! Best carnitas tacos I've ever had. Thank you cazadores :)", "author": "Stacee Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Blown away!!!  Ordered first time tonight for delivery and the food is fantastic!  And I am one picky Mexican food gal.  I made a couple changes to the order and they got it perfect.  The cost is very reasonable and the menu has nice variety.  My usual go to place was closed so I tried here and I am SO glad I did!!", "author": "Lynne P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-27", "description": "Taqueria Cazadores has taught me I need to be a better communicator. \n\nI repeated my order twice: Chili Verde Pork Burrito with no rice, refried beans and avocado and the nice gentleman repeated my order back to me twice. However, when I got back to the office I got a burrito WITH rice and pinto beans. *sigh* http://www.yelp.com/biz_photos/pzsQrP8-41d1DeYXI1nKPg?select=JbNSWPIGQkRAGin8NOS_5A\n\nThe Chili Verde Pork Burrito ($5.75) was filled with an abundance of rice which managed to be wet and hard at the same time, so I just picked out the sparse chunks of chili verde pork which was tender but lacked any flavor or spice. \n\nOh well, I guess that's what I get for falling asleep during my Spanish Classes in high school. :X", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-24", "description": "Located at an odd intersection is this little built-up food truck that doesn't ever move. It used to have a few random tables off to the side, but is now upgraded to a bit nicer outdoor seating. Still not a lot of seating, but is much better than before with the umbrellas. They have several different salsas and I am a fan of the dark red one and the salsa verde. Chips come free. I've gotten the regular burrito, super burrito, and California burrito-- all great depending on how hungry you are and your protein of choice. The pastor was pretty spicy and the carne asada is my usual go-to. The shrimp quesadilla is excellent as well. I also love their gooey refried beans. Service is great. You can also order online and by phone. Line gets long at lunch. The trick is to order ahead of time.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "Best burrito to get in the mid-Market neighborhood. The carnitas is really good, and if you are in the mood for something sweeter, the tinga hits the spot. Not many places have tinga and it's worth a try. Burritos come with chips, which is always nice, and their salsas are homemade (truckmade?) and are very good.\n\nIt's like a food truck that they've parked here permanently, with a cool outdoor eating area that's fenced off. It can be kind of hard to see if you aren't sure where to look - it's a little triangle corner in between a 3-street intersection.\n\nThey are also really in to trying the new techy ways of paying and picking up. I know they take Square and are always telling people about some new pay/pickup service they offer.\n\nDon't forget to get a buy 10 get 1 free card for your burrito!", "author": "Cody R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Great place to grab lunch. Service is always quick and the food is good. Green salsa is really good.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "This was a roadside or food truck set up.  But, I am told it is a local favorite.\n\nWe stopped by a few weeks back.  My friend called in the order, in advance.  You know how these locals are.\n\nI just had a burrito, but is was hands down the best burrito I've had in a long, long time.\nThe nachos looked good, too!!", "author": "Joe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Great place to eat! It's not just a taco truck, it also has space for you to sit down n eat .. The service was amazing and very friendly. I got a regular burrito and I was stuffed before I could even finish it.. That's how big it was : )) I highly suggest this place", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Loved my open faced \"soft taco\" Al Pastor. I received excellent service. Cute seating area!", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Went here on a Monday afternoon. Loved the chicken crispy taco. Carne asada soft taco was just so so. Awesome chips with two different salsas on the salsa bar. Quick and friendly service!", "author": "Charles R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "I'm addicted to the shrimp lime cilantro garlic salad (I think that's what it called??), like seriously addicted it's that good. And you get a generous helping of avocado and the avocado tastes perfect. I had a co-worker try the salad and she said it was too garlicky for her..wth? She's crazy because garlic is everything and has medicinal, magical powers! So if you want to be healthy and magical you should get on this salad!", "author": "Holly D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-27", "description": "Multiple bad experiences with this food vendor. \n\n1st time ordered using their order ahead app. Ordered one burrito and side of guacamole for extra $1. Upon pick up I discovered they totally left out the guacamole. And I had a gut feeling that it's because I choose not tip $ 1 on the order ahead app. So he left out my guacamole! I left a feedback on the order ahead app to say \"you guys forgot my guacamole\" and they ignored me. Fine. I'll take it that you genuinely forgot my side order.\n\n2nd time I ordered using the order ahead app again. I ordered one burrito only. And this time, I discovered that they have set up the order app to include a Mandatory Tip of $1 ???!!!! There was no way to take it off my bill. So my $8.75 burrito became $9.75 !!! Totally unjustified! Customers tip AFTER receiving good service or AFTER they are fully satisfied with their meals. Not BEFORE!  And how is it fair to have to tip for a burrito pick up?? \n\nThe first burrito I ordered was soggy..but seasoned right. But the second burrito I had was overly salty. \n\nI don't recommend this place and will not return.", "author": "Pancakes D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "Great place to grab a bite -- most qualified burrito spot in mid market. The actual shop looks like a little semi-perma foodtruck (I've never seen it move) with a small seating area by the ordering window.\n\nI've had the burritos and the tacos. I recommend trying all of them.\n\nThe burritos have a crispy, flaky tortilla and is a bit more manageable than most burritos -- a lunchtime run will get you full, but not full-blown comatose.\n\nAlso the people who run it are pretty chill.", "author": "Christophe C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-21", "description": "You get one star for being somewhat friendly and the food typically being warm.\n\nI have been here about 6 times and of those visits they have gotten my order correct twice.  In short, don't order ahead, there's no point and you're more likely to have your order screwed up.  Also, it looks really really bad when you have people who ordered ahead online and they wait long enough to see people walk up, order and get their food before them. That was me today.\n\nI was literally torn between throwing the burrito back at you or asking for my money back.  Don't lie to your customers and say \"oh yeah, you're next.\" because that was a lie and it starts to feel insulting after 10 minutes and multiple orders come out.\n\nI ordered online at 12:20 they said it would be ready by 12:35.  It was done at 1:05.  Where the heck does it take 45 minutes to make a burrito?  You just wasted 30 minutes of my day which I would otherwise be getting paid for.  On top of that,  I spent 10$ on a burrito that was chicken instead of the steak that I ordered. 3rd time in a row you've gotten my order wrong. WTF...\n\nIf it was this bad, why did I keep returning, you ask? Well I like Mexican food and the idea of a taco truck around the corner from my office makes me happy.  Cazadores does not..  Keep your lousy 85 health score and mediocre food:  I'll venture further away for Mexican food from now on.", "author": "Luke W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "This place is my go-to lunch spot when I'm in the area, and I crave their burritos when I'm not nearby! Their burritos are a generous size for the price, and the added bonus is that the owners are really sweet people. Sometimes I bring my dog by, and they always give her a little cup of steak for free! :)", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "I would give this place 5 stars but I've only tried them once and I'd like to get a feel for their other menu items.  But the quesadilla I had was delicious and I'm excited to try even more! I definitely recommend them!", "author": "Z.C. V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-09", "description": "Cazadores sucks. We ordered 10 tacos. They tasted like card board. The tortillas were not cooked and the meat was dry. Very little lemon and no chile.", "author": "Olga H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "I had chicken tamales, rice and beans and to my surprise i actually enjoyed it. I epecially enjoyed the chips with pico de gallo. Delivery was fast. Food was nice delivery was nice delivery person was nice I have no complaints i will order from them again next time im craving mexican food. Nice job keep up the good work", "author": "Trisha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Excellent to-go food from a permanent food truck.  The people are super friendly and do a great job.   My favorite is the Vegetarian quesadilla.", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Seriously this is by far the most YUMMI Mexican foods ever like as a food cart place! I got garlic shrimp &lime-cilantro salad! It was not too big nor small! It was just right! Good favor! \n\nThe area is alil messy Cuz is right on the street is S Van Ness! \n\nI would totally try other foods on the menu since is close to where I live! \n\nBomb.com for a food cart! :)", "author": "Lala B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Some of the best tacos in SF... The crispy tacos are insane I usually get chicken or beef.. Regular tacos are ok but come with just near, I know they are not super but just meat can be a little boring.", "author": "Jack O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-10", "description": "What I ordered:\nAl Pastor Super Burrito, w/ everything BUT sour cream\n\nWhat I got:\ntough marinated pork no sour cream, no guac, no cheese, smushy rice. Taste was not bad, but I did not get what I paid for. $8.75. That's an almost $9 burrito. At least the chips and salsa are good. \n\nI was so excited that there was a 4 star burrito place close by. Next time, I'll bus it to the Mission. I should know better.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-14", "description": "Food:\nAlthough I typically dampen my expectations when visiting a roadside Mexican taco truck, Cazadores is uncharacteristically disappointing given the SF burrito scene. The Carne Asada Burrito is perhaps the blandest I've ever tasted (compared to Farolito, Castillito, La Taqueria, Tonayense, Cancun, Guadalajara, Pancho Villa, etc). \n\nThe nachos (chicken & carne) are even worse, with mostly just chips, cheese, and pico de gallo. The meat is an afterthought, often sprinkled on as you would salt and pepper. Sometimes they don't even remember the guac, which for me is essential. \n\nService:\nUsually I don't care to comment on the service because the food usually wins me over, but here I've been unimpressed at every visit. The wait is usually at least 20-25 minutes, and at one point they were charging more than their menu prices (and without disclosing it as such) which was very off-putting.\n\nConclusion:\nI really want to love this place because they have livened up an ugly corner, hired local transients, are conventiently located, and are family-run. Unfortunately the food is just barely edible, which admittedly is a low bar for me. Would not recommend.", "author": "Erik J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "I have no idea what the food is like here, but I was sitting in traffic as they were closing this evening and there was a homeless person looking for change under the rubber mats on the pavement.  The two men working here, patiently took their time to help.  They lifted the mats and helped collect all the change to be found.  Two good Samaritans after a long days work,  in a very difficult city for so many people.  I was touched at their kindness and will be popping down here to eat for sure over the next few days.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "Food = 5 stars\nLocation = 2 stars\nAmbiance = 1 star (or 0 rather)\nCustomer Service = 4 stars\n\nBest fish tacos I've had in the bay area! I bumped into this place because I was yelping mexican food that was near and found this place. It's virtually a stationary food truck with a little picket fence with tables next to it.\n\nIt's the best little place if you can handle the fact that it's at one of the busiest intersections  ever! The food is so good that I find the ambiance worth it sometimes. \n\nAlso, the guys running the place bring the food out to your seat and have offered free samples etc. They will also bring you hot sauce and other things you may need. They do this all with a bright smile and charm. :)", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-05", "description": "This is the worst mexican place i have EVER ordered from. at first i called to ask if they have hard shell tacos, the lady on the phone was incredible rude and confirmed they had hard shell tacos. i placed the order, 2 hard shell shrimp tacos( have pico de gallo hypothetically ) one chicken fajitas( has veggies hypothetically) chips and guacamole, shrimp quesadillas, and taquito fritos. Let me start with the fact that chips and guac NEVER ARRIVED even tho i paid for them. secondly the tacos were SOFT FREAKING WITH NO FREAKING VEGGIES, AND THE TAQUITO TASTED LIKE PLASTIC. THIS IS THE WORST FOOD. I PAID 50$ FOR THIS SHIT! I'D RATHER STARVE. THEY STOLE MY MONEY AND NEVER SENT THE CORRECT ORDER. CALLING GRUBHUB TO TAKE MY MONEY BACK PEOPLE DONT EVEN BOTHER EVERYTHING WAS TASTLESS", "author": "Lne V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Sneaky/awesome spot with legit Mexican food.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Just ordered two crispy chicken tacos from here. These tacos are delicious! They remind me of Mercedes in the financial district. I am glad I came here and will be back. The staff are friendly and professional. Their prices are reasonable. I like the to go container they gave me and my food was still warm when I got to the office. Beware of the crazy folks hanging on the corner with their signs asking for money from customers and folks in their cars waiting for the light to cross VanNess to change.", "author": "Kiana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-21", "description": "Pretty good Mexican food, with a dash of meh experiences, and unfortunately slow service.  This is a food truck that's kinda evolved into a permanent stand that does your typical tacos, burritos, and tortas.  The food is good and you don't have to go all the way into the Mission to get it, but the typical wait is up to 15 minutes from placing your order.  This is even if you've only purchased one item.\n\nThey have a wide variety of meats to choose from, I usually stuck to al pastor. I recently tried the Tender Tinga Torta which was essentially a bbq pulled pork torta with caramelized onions - really tasty, but took forever to come out.  So be prepared, especially if you want to get something a little off the beaten path on their menu.\n\nThe tagging that they do for signage is pretty awesome.  And they switch it up fairly regularly. 4 stars for food, -0.5 stars for long loading times.", "author": "Alan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "Extensive menu and choices for a small taco stand.   Really good and fresh tasting food.  Everything I have tried has been really good. \n\nThe chips, they could work on getting those more evenly cooked, but they are still good and really no complaints.\n\nThe upgraded seating area is clean and beautiful and a nice area to eat off this busy intersection.", "author": "Anibel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "OMG!!!! Sergio is the man!!! Serg and his crew make great food here. From their \"daily specials\" to \"breakfast burritos\" to \"garlic shrimp salad\". Everything is great. Really cant go wrong here. They have metered parking around on the back side of the shop. \n\nThis place has:\n-check in offers\n-great food\n-phone orders\n-nice sitting area\n\nIf your in the corner of Mission and South Van Ness and your hungry dont forget to try Cazadores!!!!", "author": "Ju R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-23", "description": "Wow, the owners have completely turned this place around!\n\nI've been frequenting Cazadores for about a year now, and over the last month, every aspect of the place has changed for the better. Their extensive menu is now simplified, including a few new specialties (TRY THE TINGA TORTA!!). The owners also overhauled their unattractive seating area and added a few tables and installed a marble counter seating area. \n\nSituated on the corner of Mission and South Van Ness, the location is really hard to turn into a confortable place to sit and have lunch, but they've definitely succeeded! \n\nMost importantly, the food is killer! I recently tried the tinga, and the flavor is amazing. It's a mix of sweet and savory, perfectly marinated. It might have just taken over al pastor as my favorite meat choice here. Try the tilapia tacos, too!\n\nGO HERE NOW!", "author": "Nick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "OMG! The food is AMAZING! The first time I had their food, I went back almost every day!! The portions are huge! The staff are super nice.  The décor inside is a bit funky, but who cares with great food like this???!!!", "author": "Terri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "I might be a burrito snob... If it doesn't come from Oakland, it doesn't taste good. I didn't make the rules; Mexican food in the city just sucks. Every burrito I've ever had in San Francisco was way too watery and bland... Never again! Cazadores, now that I've found you, I shall never leave you!\n\nI ordered an al pastor super burrito. The flavor and texture was perfect. It was not too moist nor dry. The al pastor tasted like they sprinkled crack in it; I could not get enough. I always get refried beans because let's face it, burritos are horrible for you - indulge! Anyway, back to my beans... They had a very appealing consistency, almost as if it were cooked slowly, and it was fully of flavor... Probably from all the oil.\n\nThe guy who took my order was courteous, which isn't amazing, but I still appreciate it. Their preparation was relatively timely for a food truck, and I got complimentary tortilla chips and salsa verde (standard but I felt they had skimped on the salsa)\n\nOf course to error is human. I do have one criticism... They don't serve lengua or cabeza, which are my go to meats. If that ever changes, 5 stars could not suffice to express how good this place is.  Oh, they advertise free wi-fi.  I could not tell which network was theirs... I wasn't really there long enough to care.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "I work across the street - so feel pretty lucky! I use OrderAhead and my food is waiting for me when I show up, which is good because the line gets long at noon. My favorite items are the veggie burrito or a tamale/potato taco combo. They also give me some free chips too and they have a Buy 10 Get 1 free card. There is a small seating area outside. Mind the cars though - this is a VERY busy intersection and people step off the curb into traffic all the time.", "author": "CJ L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "This star is for the 1 time i got food from here, too bad its also the last. I ordered the nachos and tamales: Chips were stale and they were covered in mozzarella and Parmesan cheese... I'm pretty sure that's Italian, correct me if I'm wrong. Nevertheless, it was well below satisfactory. \nI really like tamales, those were Ok. Nothing memorable, but at least it was edible.", "author": "Lena E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "I love this place!! The folks who run it are incredibly friendly and the food is awesome. Everyone in my family gets excited when I bring home food from Cazadores. Highly recommended. You won't regret giving this place a try.", "author": "Red F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-06", "description": "Needed a lunch spot prompto and was totally craving Mexican food! This seemed to be the only decent place nearby so I made the trek across the busy intersection and ghetto streets. \n\nWas met with a food truck and a small seating area that actually looked pretty nice. A counter with chairs and several tables under a canopy.\n\nPros:\n- Good burrito. Good size. Decent price ($7-8).\n- Comes with a small bag of chips!\n- Check in offer gives you a free coffee.\n- Yummy self serve salsa.\n\nCons:\n- Chips tasted stale...maybe it's just the way they make them? I didn't like them too much.\n- Coffee was lukewarm-cold. Definitely tasted like it had been sitting out all day (I was there at 2pm).\n- Your counter at the side of the food truck has dirty forks and knives. Everything looked dusty and untouched!\n\nYeah. It was okay.", "author": "Sally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-30", "description": "Woohoo! Found another great hole-in-the-wall place near work (although technically they don't really have a wall...). It's easy to miss this spot since there's no visible sign and the only way I realized it existed was because there were people lining up.\n\nI got the chile verde pork burrito which is humongous and tastes oh soo gooood....\n\n*dreaming about burrito*\n\nThe pork is marinated in chile verde sauce and is very flavorful. The salsa is fresh, the rice is good and they put a lot of cilantro, which I like. The extra nacho chips and tomatillos dip is an awesome bonus. The nacho chips seem to get fried just before we got them. The bag got soaked in nacho chips' oil on the way back (meaning: fresh nacho chips). The tomatillos dip tastes very fresh, it didn't even taste that good in other taco joints in the Mission.\n\nI tried my friend's fish burrito too, which is good but I still like my chile verde pork more.\n\nMy burrito costs $5.75 and it satisfies me well pass dinner time, although that might be because I finished everyone else's nacho chips...", "author": "Novalina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "I had a taco craving for lunch and as this was very close to where I worked, I figured why not? I'm glad I came here.\n\nFor $5 I got two extremely flavorful tacos. Al Pastor and Chili verde. I preferred the chili verde. It was spicier and for some reason I just prefer shredded taco meat. I have no idea why. It also had some radishes on top for good measure (and a wonderful little kick). \n\nThe salsa that they add on automatically is really good. While I wish they had some extra pico or spicier salsa to add on as well, this salsa had this wonderful roasted flavor. \n\nService was also very fast. This is one of those places that you really can't get bored with. They have so much! Next time I'll definitely try the fish tacos.", "author": "Sonia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "Wow. Carne asada super burrito was on point! Fresh tasty and filling.  Their hot sauce is perfectly smooth, complex, and packs a punch. I will be returning the this truck as soon as possible.", "author": "Guy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Some of the items are a little pricey, but everything is always fresh and delicious!", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "The fish tacos here are incredible. Quality grilled fish with all the trimmings. The outdoor setting is clean and comfortable. The guy running the truck is very friendly and gave great service. 5 stars for the food, but they are rarely open (closed weekends and after 6.30pm). Once these guys open for business more this will be my go-to mexican joint.", "author": "Luke C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-29", "description": "weak - got the panda special (2 tiny pollo tacos, 5 stale chips, spoonful of beans, lime wedge $7.75) around 4:45pm on a tuesday with no rice nor small salad, no substitution nor prorata for missing items.  \n\ntacos just ok and the bite of beans i had were well, beans w/4 or 5 sprinkles of cheddar on top...still hungry after the meal\n\nthe guys seem nice and do like the patio seating.  all things considered just lacking bang for your buck...wont be back", "author": "Clark G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-18", "description": "Coworkers frequent this little stand so today I ventured to try. I ordered 1 fish taco (coworker). I was jonesin' for some shrimp, so I ordered 2 shrimp tacos. It's not listed on the menu. Shrimp burrito is, but little ole me can't finish a whole burrito. They made it anyways. cool!\n\nI love shrimp so that part was yum. I just wish there was more fillings for the taco. Not sure what the standard is but other places have beans/rice/lettuce in their tacos. \n\nConvenient to work. Little outdoor seating area. Cheap eats. I'll be back.", "author": "Carolyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-28", "description": "I came here after a couple of my friends told me how delicious the food is. I went here while I was in the area and ordered the Super Nachos with Steak, Cheese, Pico de Gallo, Guacamole & Sour Cream. It was only $5.75! I also got a couple chicken crispy tacos @ $2.50 each. Whoo!\n\nI used to work across the street from this location when the ACLU was still there. I remember a hot dog place & taqueria but nothing ever stood out. Taqueria Cazadores definitely shines through.\n\nThe reasoning for my 5 stars is mainly because it meets the general criteria one usually has when hungry on a budget and pressed for time. The food and service is good, it's in a central location (close to Van Ness Station & several bus lines), and it's AFFORDABLE. Would be on a \"Best Cheap Eats List\" for sure.  I went there around 4-ish so I was not affected by the lunch rush which I read about it other reviews. I also appreciated the artwork on the side, which added some bright colors and style to an otherwise drab area dominated by concrete, cars, and buses.", "author": "Catherine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "I love this place! Its right across the street from where I work. I always always always get their fish taco and rice & beans w/ sour cream. \n\nThe guy is a little slow & I had to repeat myself all the time. He takes a long time to get the order down but the food comes out pretty quick! I actually think that he can't hear me because I'm so short & I guess I have a tiny little asian girl voice. & it's near a busy intersection and theres kitchen noise inside his truck. So I decided from now on I'm going to write what I want on a post it & just hand it to him. Did that today & it worked!!\n\nThe food comes out great!! Fish taco comes with a big piece of fish, not just flakes of it. And it's so clean. When I eat the taco, the sauce doesnt drip all over the place & it's not soggy. He uses good to go containers! He doesn't just wrap the taco in foil and throw it at you like most places. \n\nHe might be slow at taking the order but when he gives you your order, he makes sure you have all the sauces, etc you need. \n\nMy co worker loves their vegetarian quesadilla. .", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "With working for the City, time is a factor when getting food fast. This place rocks when I don't feel like walking down to 16th Street. It's good flavors, comparable pricing and it's in walking distance to the City offices down the street. \n\nTaco's and Burritos are it's specialties.\n\nPS: Cash only.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "Had this delivered through a delivery service and it is pretty good. I would order again for sure!", "author": "Meg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Twenty times better than the tasteless burritos served at some places in the city like Taco Bar on Fillmore.  One of my favorite burrito spots in the City.  Carne asada is flavorful like it should be for Mexican food.  Definitely recommend this spot if you want a real good burrito.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "I love the crispy tinga tacos! This is a great little spot.", "author": "ben s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "I don't live close by, but I always get lunch here while my car gets a wash across the street. I love their burritos, in particular, their carnitas. The place gets very busy around Noon, so earlier or much later is a good time to go.", "author": "Amit J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "very good food highly recommend.   the only problem is they're not open on the weekends only Monday thru Friday.   call ahead and get your food much faster", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "Taqueria Cazadores is less than a block from my office, so I find myself popping in their a lot. They recently added tamales to their menu. I really love tamales so I thought I would give them a shot. The chicken tamales had a lot of meat in them, but the flavor was kind of bland, even with a bit of green sauce ladled on top. I'm not sure I'll have them again. On a brighter note, one of my usual choices, the crispy beef taco, didn't disappoint. I don't think I would ever go out of my way just to eat here, but I've never had a bad experience. The guys who run the place are really friendly and they always have Mexican Coca Cola. In fact, about half my visits are just for the Mexican Cocoa Cola (with real sugar!) alone.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "Went there after a job interview and ordered a Fajita plate. WOW! I then tried the salsa...  Amazing! Clearly I have truely never had salsa until this day!", "author": "Jason K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "their tinga burrito is fantastic - super burritos are per SF standards.", "author": "Matthew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "Best Tinga and Al Pastor burrito you can get. Really like this place, delicious chips and friendly service. Fish burrito is also really good with their green salsa.Grilled tortilla, so much better then steamed. Guacamole instead of avocado on super but can ask to swap.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "My husband and I tried this place before an event at the Dianese store down the street. AMAZING! We actually used the Yelp monocle on my phone to find it :) We tried a pork tamale with their green sauce and shared a spicy chicken burrito. Ingredients were fresh and you can tell a lot of care went into their food. Especially since it's a little trailer on the street.\n\nFour stars only because I need to come back and try more in order to declare it as good as it gets!", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "It was my first time here, i pass it all the time but never knew it existed, I had a breakfast special, it was amazing. The service was great as well. They definitely have passion. Im coming back for sure.", "author": "Josue G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "Good Mexican place, plenty of options and the quality is good.  Prices are a bit more only because it's San Francisco, and it does get crowded/busy during lunch hour.  I would encourage you to call your order in for pickup so you don't have to wait for your food.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "We were getting our car washed across the street and happened upon this place. Good Burritos I had the Super Burrito and my mom had the Super Veggie. They are big. The Chicken was ok. Next time I will try the pork or the Carne Asada. Overall a good experience and the service was good. There is a small dining area to enjoy your food.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "The carne asada burrito here, and this assessment is certainly influenced by hunger, almost tastes like some iterations of my beloved California burrito in SD (just remember to get it without beans, cause you know, that's redonkulous)!  I think it has to do with the rice tasting like fries and the the melty cheese.  In any case, the burritos here are solid.  Portions are good and you even get a free bag of chips with your order.  There isn't much seating so this is more of a grab and go thing (I mean, it's basically a permanently parked food truck).  Definitely worth a shot is the chile verde pork but at times the chile verde can be a bit sour strong.  It'd be nice if the salsa options weren't so hidden.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "In the middle of one of the busiest intersections in San Francisco, with cars whizzing by and the 14 and 49 doing their thing, Cazadores is slinging their version of Mexican goodness. And they aren't doing a bad job at it. Burrito was made as ordered, with the grilled chicken, salsa and black beans all wrapped in a wheat tortilla. Price was a few pennies below average, and so was the size.\n\nWhether you arrive by car (no place to park), bus (it won't wait) or by foot (best option), it's an A-OK option for some eats.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Freakin yummie ass super Carne asada buritto, shrimp-lime salad, and chicken tamale. All meat was moist and very tasty. They didn't over do it by adding too much sauce in the buritto and it wasn't soaking wet. Perfect! We have visited a few times, and they cook and feed us with consistency and a smile.", "author": "D M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Great food, great place! Completely random place but I pass it every day when I come home from work. It is a great spot because the amount of people that drive and walk by is huge. However there is a LOT of car traffic so be careful walking around. Not always easy to find parking. I had a meeting here one day and decided - why not? I drive by it everyday...\n\nThe staff is super friendly, very quick and the food is quick with care and quality. Unexpected from a random truck on the corner. I highly recommend the food. I got fish tacos and taquitos and the fish was cooked perfect and the taquitos were crispy, hot with a perfect blend of meat. My absolute forward - topped with a coke bottle. \n\nThe only reason I gave it 4 starts is the location. There are a lot of beggers on that corner and sometimes you feel uncomfortable buying food and trying to eat there. Otherwise - I highly recommend it! \n\nGoing during the work day.. don't go right after work or at night (don't know if it's even open at night).", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "This place is awesome! I live nearby and it's my goto for mexican street food. The tacos and quesadillas are really good, and the guacamole is awesome.\n\nHe is super friendly. One day I was short of money and he would refuse to let me run to the ATM, and told me pay him back next time.\n\nSometimes it is difficult to order because of the noisy traffic, so I would recommend speaking up when placing your order. \n\nOther than that, fantastic service and food!", "author": "Glen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "I have lived in The City for about 4 years. The tinga crispy tacos were the best that I have had here. That is all.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Just went today. Place is great! Got a huge and yummy burrito with free chips and salsa for $6.75! Some of the chips were unevenly cooked, but I really can't complain, because they were free. Would definitely go back again and recommend.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "I Have drivin by this place for years, finally got the chance to stop in one morning. I ordered the Breakfast Burrito and it was awesome. Hands down the best breakfast burrito I have in a long time. I liked that food was prepared by the owner who is exited for you try his creations. This place is cool, local, and afforable.. Its now my go-to breakfast burrito spot", "author": "Kyler A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-10", "description": "Random truck in the Van Ness/Mission intersection. Who knew? It's this truck with a spray painted face on it and it has THE MOST delicious tacos. \n\nI didn't really want to go crazy at this place because it was my first time here, so of course i just had my standard steak tacos. I liked that they came with radishes on top because it gave it a nice little unexpected crunch that I most certainly enjoyed. I had the green salsa on top, which gave it a little kick too. \n\nWe didn't have enough time to sit down and eat at their little patio area because me and my friend were trying to make a movie, so instead we set up shop in front of the Goodwill store on a newstand and ate there until it came. People looked over at us in envy... at least that's what I tell myself. The meat was so delicious and juicy... and I just loved the overall flavor of it. \n\nThey also make crispy tacos, for those who care! I really can't wait to come back here. Also they serve hamburgers for those who care, too.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "I know that taco purists frown on the idea of crispy tacos, but I love them!  I mean everything is better fried, right?  They fry each taco shell fresh to order too! And the shredded beef filling was flavorful and juicy. \nAlso: There are two tables next to the truck so you can sit and wolf down your tacos instead of having to stand and drip like at other taco trucks.", "author": "jason s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "My crew and I were at a photoshoot near Cazadores last Friday.  We had discussed catering the shoot in the planning phase and opted to do \"something nearby,\" which I am quite pleased that we did.  We agreed to hit up Cazadores to feed our crew of 6 with a variety of tacos.  I personally had carnitas, fish and chicken tacos as well as a taquito, all of which were amazing.  The food was perfect, well priced and delicious.  The staff were super friendly and fun.  This fish tacos were the killer dish.  Can't wait to go back!", "author": "Drew P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "These guys have secured a prime spot at the intersection of Van Ness and Mission, and on the day of the Giants parade this year, I couldn't help but stop for a couple of soft tacos as I rode by on my bike.  I actually had to ask one of the chefs what the name of the truck was, because it didn't seem to have a sign in plain view.\n\nThe tacos were $2.50 each, and I ordered carne asada.  The flavor of the steak was pretty good, though not the best I've had, and maybe a tad dry.  The chunks of meat were also a little bigger than I'm used to, but that's not a big deal.  The guys running the truck are really nice, and the guy who took my order actually came out with a smile on his face to hand me my food!\n\nCool.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Best burrito I've had in a while.  Fresh ingredients; good guacamole.  Not the fastest service, but their facility is limited in size, so it is understandable.  Chips weren't great, but who eats that stuff anyway?", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "I love this place, and am a loyal customer (I work down the street), but I have to voice my disappointment that at least 50% of the time my order is wrong. Pretty simple mistakes -- rice on a \"no rice, please\" burrito, or I get a regular instead of a super. Besides the fact that I often take it to go and therefore can't have them make me a new one, but the wait is so long! Fix this communication problem and you'll be perfectly amazing.  It's delicious and the outdoor seating is awesome.", "author": "Ivy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Yes, it's a glorified food truck with patio seating that serves awesome tacos & burritos at a fair price. Despite being located on a patch of land at a major intersection, there's amazingly no bad exhaust fumes from idling vehicles. Just noisy & still a bit odd, which is why I always take the food to go. I order there & it takes 5-10 min for my order. Well worth it!! The fish tacos are my favorite - I always scarf them down! The supreme burritos are awesome, and huge. The only issue I've ever had was a dry carnitas burrito that I got mid-day after the normal lunch hour, so the meat wasn't very fresh.", "author": "Eileen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-15", "description": "Great food, affordable and the guys in the truck are awesome!  Good food on the go!", "author": "Bill K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "Right off the Van Ness Muni stop. Been here multiple times. Order the \"Tinga\" in anything. Mexican Coke. Great spot.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "Da bomb! Fresh ingredients and a wide selection. I've been coming here for years, mostly for the shrimp which is always tender and full if flavor.", "author": "Lance B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-22", "description": "Excellent Crispy Chicken Tacos!  \n\nNot a normal SF Taqueria where they pile everything imaginable in a tortilla.\n\nVery friendly staff/owners \n\nOne of my SF favorites now for Mexican food.", "author": "Martin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-01", "description": "Probably the worst burrito I've ever had. The veggie burrito should simply be called a rice burrito because that's going to be the majority of the filling. The tortilla was crispy and kept falling apart. The menu says the veggie comes with sour cream and guac however I was charged to make it 'super'. Yellow cheese, very little guacamole that tasted foul, not a true ~mexican~ burrito. Mission style chips that taste more like popcorn, ugh.", "author": "Cori W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-10", "description": "Location, location, location. They're in the middle of a bunch of office buildings where lunch options are pretty bad.\n\nThe main drawback is that the service is slow at lunchtime (15-20 minute wait for takeout). So, it ain't fast food. But the food is decent and fairly cheap.\n\nIn short, if you work in this area this is a decent choice for lunch. If not, there are better taquerias all over town.", "author": "Jamie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "I have visited this place for lunch on several occasions. The portions are very generous. The food is well seasoned. I recommend the Lime Cilantro Salad with Grilled chicken, Chicken Quesadillas and Carne Asada Super Burrito. This place gets a lot of foot traffic and is always busy at lunchtime. Downside: they take too long to prepare orders. I've tried to call ahead and order online but that does not speed up the process. Oftentimes, I've seen them get orders mixed up. The people are friendly, but they need to speed up their service and get a little more organized. I think they've outgrown their current facility. Also, had guacamole twice that was made with way overripe avocados (yucky). Their chips and salsa are fresh and tasty. Bottom line, definitely recommended, but not when you're in a hurry to grab lunch and go.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Excellent fish tacos, and great attention to detail. Friendly service and a pretty bomb little patio area that is a nice break from eating your food on the curb like with most food trucks. All in all a great spot.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-19", "description": "The best burrito in the outer Civic Center area!\n\nOkay, so that's not saying much, but seriously--not bad.  Delicious?  No way.  But I was satisifed.\n\nStars:  decent pricing, selection of beans, good portion size, even on the regular.  chips are thick & crunchy, like in a family-style Mexican joint.\n\nDemerits:  the don't crisp their carnitas on the griddle before wrapping it up.  Yes, that gets it you faster, but without the crunch, carnitas is stewed pork, IMHO.  their salsa is boring and green.  rice is not very Mexican.\n\nAll in all, these guys aren't great, but they are definitely the best burrito within 20 minutes walk of where I work.  Really, I'd say it's 3-star food, but they get an extra star for being convenient and rising above the low standard set by the competition.", "author": "Martin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-19", "description": "This place is awesome.  I work nearby and my coworkers and I regularly do a call in order.  It hasn't taken 15-20 minutes like some of the other reviews have mentioned.  I've had the quesadilla with carne asada, which comes with guacamole, sour cream, and pico de gallo for less than $6.  The burritos are also really tasty, and for me, usually make 2 meals.  Definitely a good, affordable place to get food in the area.", "author": "James D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "I just had one of the worst SF burritos ever today from Cazadores. With a tortilla as tough as leather, it was difficult to access the indistinguishable mash of flavors in my burrito Al Pastor. It reminded me of a microwave burrito. And such a small burrito for $6.75, esp given they ain't paying much for rent on that little piece of land. Very disappointing. Today it was one star for sure, but because I've had ok burritos there in the past, it gets two stars. Sorry guys, but there are way too many good/great tacquerias in this town to get away with this quality at this price.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "I usually don't eat at roach coaches but this place is pretty good. Much better than the Mexican restaurant around the corner on Lafayette and howard.", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "I come here for the steak taco salad w/ refried beans.  They've shrunk the outer shell so that it's easier to pack the to-go orders.  I actually enjoy the change as this shell isn't as greasy as the old one.  Great prices and friendly staff.  I still want to try their quesadillas one of these days.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "This place has THE BEST shredded beef tacos I've had in Northern California. The meat is deliciously moist and tender with no fatty residue. The taco shells are crisp, crisp, crisp and the fillings complement the meat beatifully. The quesadillas are similarly yummy with sides of guac and sour cream thrown in. Tacos are $2.50 each, so order up!\n\nThe only downside to this place is that it isn't open on Sundays or evenings. The owner said that he's considering staying open later, though, since there are a few bars in the area. You know how the drunks like their Mexican!", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "Delicious!  Got a vegetarian burrito here, my boyfriend got the tinga burrito.  Mine was good, his was amazing!  Get the tinga.  The ingredients taste fresh, the burritos really taste homemade (not assembly-line), and the prices are great!  I'll be back.", "author": "Meredith H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "Very fresh and good, inexpensive eats.  Compares favorably to Pancho Villa.  So far I've tried vegetable quesadilla, which was full of fresh veggies,  fish combo plate tilapia, and the chile relleno plate.  I also like their pico de gallo and guacamole.  My coworkers raved about other dishes.  Friendly staff.  Hurry down!", "author": "Catherine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "This place is just down the street from my office, and it is hard not to go eat there for lunch every single day.  Great prices, super friendly service, and holy crap these tacos taste so good when they hit my mouth.  A++ would eat again.", "author": "Bennett R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "Since discovering this place's delicious fish tacos, I go every day I\ncan at lunch time! And that's what I get every time--the fish tacos.\nThey come with crispy fresh radishes and quarters of lime to squeeze\non. All super fresh and yummy--and the fish is grilled to perfection,\nnot fried (I hate ordering a fish taco and winding up with fried fish,\nin batter yet). Well, yesterday I deviated and got the veggie\nquesadilla--also fabulous, with squash, bell peppers, etc. The guys are so friendly--and when I spaced out and accidentally forgot my jacket there, they noticed and saved it for me. When I walked by to catch my bus after work, *they* asked *me* if I had left my jacket at lunchtime!!", "author": "Arla S. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "I just found my new favorite lunch spot! For those of you working in the  Market and Van Ness area, you know how limited our lunch options are. Taqueria Cazadores is a much needed addition. The flavor and quality of the food rivals some of San Francisco's best taquerias, and that's no small task! The guys running the place are very friendly and they even have an outdoor seating area. I will definitely go back!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-11", "description": "The burrito was not very memorable. But the attitude of the pudgy wanna be hipster girl working there was. She was a bitch and on top of that the salsa was too smokey. Skip this sub par little beanery.", "author": "santiago c."}
