{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "This is a very good Mexican restaurant.  Perhaps not the best in the city but certainly one of the better ones.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "This taqueria is a hidden gem! We chanced upon it while walking to the bill graham for a show and since we needed to fuel up, we stopped by for a burrito. The people who work there are super nice, my friend was talking to them in Spanish and they took the time to carefully explain all the questions we had and gave us extra salsa later! We split a vegetarian burrito- it was so delicious! It had rice, beans, sour cream, avocado, pico de Gallo, onions and cilantro. The burrito was folded well and was HUUUGE, two key aspects of a good burrito. It was cash only, but they have an atm inside. Would definitely come back", "author": "Kulmeher D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "The place had 2 people working. One putting the burrito together and another cashier. Came here due to local and wanted something different. but had little flavor. It tasted boiled with no seasoning. I eaten food from trucks with more flavor. Watching the guy, was just reheating the meats and assembling. \n\nEven their chips, free with preassembled sauces tasted fresh from the bag.\n\nMaybe named Taqueria Castillo B, because of hepatitis b? Hope I won't sick from this place.", "author": "Elizaveta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "I literally love coming here for my burritos, tacos, nachos, whatever I'm feeling. Today I ordered my usual super steak burrito and when I got to work I started to dig in and noticed that my steak burrito was a veggie burrito!!!!! Hey what happened to my MEAT!!!!!! Luckily I work right up the street from them, so I walked back in and they remade my burrito with lots of Steak and it was a FAT burrito. They didn't even take the veggie burrito back. Awesome customer service. Thank you now I have breakfast, lunch and dinner for the next 2 days. Woot woot.", "author": "Tino C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-23", "description": "Came here due to the ratings and location. There are lots of taquerias around here in the Tenderloin area. I thought I found something special just to be disappointed.  \n\nI ordered the carne asada burrito and watched the guy piece it together, kind of like Chipotle but they were reheating it before putting in the burrito. The only difference was that they heated the tortilla on the grill too instead of the machine like other locations. \n\nAt the end was the lady who took my $11 for my super burrito and included a small bag of overcooked chips and 2 containers of sauce. There was no topping bar like other taquerias had, only what one paid for. \n\nThe 1st bite was OK. After that, the burrito was becoming more and more flavorless. Then an hour later was a bit on the sick side, not sure if it was food related.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-30", "description": "This is such a quiet place to sit and enjoy a meal with a friend.  The highlight is the mild fresh salsa.  Big plates.  Had heuvo rancheros,  simple with black beans, rice, lettuce, salsa, 2 fried eggs in a tortilla.  Quesadilla is more like grilled  burrito.  They have lengua with slightly higher price.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-29", "description": "Speedy service but not much depth and flavor in their meats but I prefer the tacos to the burritos.  Not a whole lot of tables to sit down and the back area has a cleaning supply smell that doesn't make things appetizing.", "author": "Shelton F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-24", "description": "11/21/15: Standard but good Mexican fast food.\n\n1. Regular Taco (Carne Asada) $2.67:  Your standard carne asada taco.  Got the beef, some green onions (well, I guess that's a bit different), a little cilantro, and diced tomatoes and onions.  Two corn tortillas.  The meat's alright--grilled but a bit dry.  Flavoring is good.  5/10.\n\n2. Super Nachos (Carne Asada) $10.25:  Why more than $10?--cause it's HUGE.  I mean, probably the biggest plate of nachos I've ever had in my face.  Heaping piles of beans, jalapenos, and meat... and a generously complimenting amount of whole jalapenos and a good amount of avocado.  Same asada--okay quality.  Could use more melty cheese, both more melty and more cheese.  Don't particularly like the chips--they use the cheap bulk kind.  Kinda stale and tasteless.  But the avocado--there's quite a bit of it!  Kinda different to just use scoops of fresh avocado instead of guacamole, but it works.  Overall it is indeed too much for one person, but you also pay for that amount.  Could taste better too, despite the expensive avocado.  5/10.\n\nSo, nothing particularly tasty, but good solid Mexican fast food if that's what you're looking for.\n\n3/5\n\n#mexican", "author": "Dean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "A solid taqueria  with good standard ingredients for a good price. If you like lingua, they have some good lengua.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "I live right next door to this space. It's nothing fancy, but the portion is large and price is affordable. Cash only and no fountain drinks.", "author": "D Andrew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "CASH ONLY*** The food here is pretty good. Their serving sizes are large and their prices are responsible.  I highly recommend the super steak burrito with chips for $11. If you are looking for a quick and filling meal this is the place.", "author": "Asa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "The wet burrito is really good here. It was very saucy. The tacos are really good too. The  prices are really good too. \nI like the seating area, very comfortable.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "They have shrimp tacos! However, dude to fact I've been eating tacos for the two days( I like to eat the same food for a whole week before I get sick and move on) , I decided to get a quesdilla here.\n\n\nThe quesdilla was like a huge burrito!! Until this day, I still don't believe what I've consumed in my stomach was a quesdilla ! It was stuffed with very salty ingredients. It was a bit salty to me but if you love flavor, eat this! \n\nOverall a good option for lunch if you're in the area!", "author": "Josie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Oh holy guacamole. I've finally found a Tenderloin taqueria that delivers a traditional street taco that rivals LA's King taco! \n\nA little pricey at $2.59 a pop, but they are stuffed full of meat, onions, cilantro, a solid dollop of sour cream and slices of fresh avocado (so Californian!). I ordered the carne asada, which was tender and not dry, and the al pastor which aren't that spicy in this case and still moist and tender. Definitely filling and very bomb!", "author": "Ruth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "Cash only. This place always hits the spot. My usual: 2 carnitas super tacos (comes with cheese+avocado, vs. the regular style). Extra hot sauce (the green one), extra jalapeños. Never disappoints.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "I am so happy to find this joint right by my work! I've already eaten here twice this week!\n\nLOVE the giant portions for a reasonable price. \nLOVE the freshly scooped avocados in your supers\nLOVE the fresh carne asada and al pastor\nLOVE the friendly and very efficient guys behind the counter\nLOVE that breakfast burritos are served all day long\n\nI get my stuff to go but there is a good amount of seating available. \n\nCASH ONLY!", "author": "Nina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "Taqueria Castillo was an afterthought after discovering lines and overpricing at the food truck venue. Castillo has a different setup. food counters are the structure, then the menus if one looks above. order is taken by \"grillmaster\". payment at cashier, end of counter.\n\neats: lengua taco (2.94)\n-tender pieces of lengua with bunch of veggies. 4 stars\nfish tacos(3.63)\n-disappointing fish still had frozen aftertaste\n-sour cream, onions, lettuce, tomatos, salsa, etc, nice\n3ish stars\nchips too, commercial ones.\n\nfrijoles refritoes:\n-plates usual price\n-didn't took at menu, just posters on windows.\n-quality inconsistent, lengua great, fish not\n-fabulous service\n3.5 stars", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "This place is a great find! They have the usual burrito fixings, but I got the Alambre plate. It was beef &  bacon cut into cubes and grilled with bell peppers and onions - fresh and really tasty! My daughter got super nachos. The portion was huge, with freshly grilled carne asada. \nThe only down side was that the restaurant is cash only. Not really a problem because those two dishes are around $11 each.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "Went there today for lunch. Ordered a burrito, took it back to my office, and found a very long hair about a fifth the way through. Won't be coming back. Wish I could get my money back.", "author": "Nia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Great burritos.\nGreat tacos.\nCarnitas are excellent.\nVarious huevos entrees are also excellent and a crowd favorite amongst out lunch group.\nVery generous portions.\nIf you're really hungry - order the burrito \"wet\" style - sauce and fresh cut avocado on top.\n\nNice.  !", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-15", "description": "I must be quite the burrito snob. I've been to all the most popular taquerias in the Mission, but for years, I've ignored this compact one in my own backyard. Well, it's not exactly in my backyard, but it is a stone's throw away. Just don't throw stones please. For Jane Kim's sake, there's enough crime in this area with all those surly-looking guys in the hoodies and the baseball caps on the corner of 7th and Market. Hurry up, CVS, open, open, open! But alas, I finally tried it when I decided to take the 5-line to get home. Since it turns onto McAllister instead of staying on Market, I felt this was the moment of the apocalypse when I should give it a try finally.\n\nIt's OK, not wow but OK. On my virginal visit, I went for the one-two punch of a $6.22 Vegetarian Burrito and a $2.39 Vegetarian Taco. The former seemed a bit overpriced, while the latter was quite a bargain, so net-net, I have to conclude it was decently priced grub. The burrito had all the standard ingredients, but satisfying as it was, the moisture of the tomato and lettuce made the sour cream especially drippy and the rice in need of an O-Cedar sponge (see photo). The taco, on the other hand, was liberally covered by all its vegetarian ingredients, the most prominent being a fresh avocado half scooped on top of a mound of sour cream and chopped tomato (see photo). That was good stuff.\n\nWhat I did notice on the way out is that they sell Menudo on the weekends for $9.66. I came back the following week and ordered it to go. It's ladled into a large Coca-Cola cup (...guess they save the plastic containers for special occasions) with warmed flour tortillas, chopped onions and cilantro, crushed oregano and chili peppers, lime wedges, and chips and salsa. Pretty good but not at the level of Mexico Tipico's. There was no tripe, just a lot of bones with leftover marrow and gristle but in a nice rich broth infused with red chili paste (see photo). Truth be told, I've had it a couple of times since my discovery, both times bringing it home to assemble and heat up. I'm no menudo snob, that's for sure.\n\nFOOD - 3 stars...good veggie taco but the convenient menudo is what draws me back\nAMBIANCE - 2.5 stars...just a hole-in-the-wall but well-kept compared to most Mission operations\nSERVICE - 3 stars...quiet and efficient\nTOTAL - 3 stars...my go-to place for a late-night menudo run", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "I would not have known about Taqueria Castillo B if it weren't for Ed U's recent review and his photo of the veggie taco (looked similar to the one at El Castillito). Thank you Ed U.\n\nI usually get my veggie tacos and agua fresca from El Castillito on Golden Gate Avenue.  However, El Castillito has been closed for a good while due to a fire.  Also, I did not know that one of the employees from El Castillito is working at this taqueria.  He was the guy preparing my 2 veggie tacos, and he knew I always get a large agua fresca (cantaloupe flavor).  He recognized me right away.  I must have a face that people don't forget...lol. \n\nSince it's my first time at Taqueria Castillo B, I'm just gonna start off with a three star rating (actually 3.5 stars).  I notice this place serves fish taco ($3.45), whereas El Castillito does not.  Thus, next item on the menu to try - their fish tacos.  If the fish tacos are tasty, there will be more visits to this place and a possibility of the rating going up to a four star.  Time alone will tell, but my preference is El Castillito for convenience (close to my office building).", "author": "Carol C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Came on a Monday night for dinner. This is a cash only place btw.\nThe staff makes the food in front of you so you can chose what you want in your burrito/taco/quesadilla: cheese, sour cream, black beans, rice, avocado...\n\nI ordered the vegetarian corn taco with rice, black beans, tomatoes and avocado and a grilled chicken taco. \nMy open tacos were about the size of the palm of a hand.\nMy husband had a grounded beef burrito: it was huuuuuge. \n\nIt was kinda complicated to eat - food got everywhere in the plate - so half the time I used the silverware, but it was very yummy and that's what happens when you eat tacos everywhere right?\n\nOnly thing I would change: a bit more sauce other than the hot kind (that I don't eat...).\n\nThe staff is very friendly and I enjoyed practicing my Spanish with them :-)\nVery cheap and authentic. \nOn top of that, I ate gluten free & dairy free which was great!", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "This place has nice sized tacos! The very nice guy making the tacos hooked me up with decent portions of shrimp--yes, I order two shrimp tacos, and they were pretty good. \n\nThe shrimp was cooked perfectly, in term of texture. However, it could have used a bit more flavor (perhaps seasoning salt?) other than that minor qualm, the tacos were pretty good. The prices aren't bad either.\n\nThe place is clean and the owner and employees were very nice. Overall, the service was superb. I would definitely come back again!", "author": "Sylvia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Well, you can buy an avocado at Safeway or Rainbow for $2.00, or you can get a Vegetarian Super Taco for $2.75 with a half a (small) avocado. That's rice, beans, cheese, pico de gallo, hot sauce, avacate, and jalepenos, sour cream, and lechuga if you want them. And chips and salsas. \n\nLike they say; you do the math.....", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "Absolutely great customer service!! The gentleman who made my boyfriend's burrito and my quesadilla was super awesome!! He gave great suggestions and was patient with me when I had to get on the phone and ask my boyfriend what he specifically wanted out of the options I didn't know they had. Great job!! The lady cashier was sweet as well.", "author": "Margaret Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-09", "description": "Bland meat and bland salsa. I ordered a Carne Asada quesadilla and stopped after a bite. My boyfriend got lengua and carnitas tacos which were large, but had little flavor. It tasted boiled with no seasoning. Confused by the 4 star ratings here.", "author": "Lauretta L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-05", "description": "I was out studying with a friend but he was starving so we took a turn and walked right into Taqueria Castillo. \n\nI wasn't planning on buying anything but my friend made me eat half of his food. He ordered a cocktail de camarones and a carne asada quesadilla. He also ordered a Sangria Señoral which was completely new to me.\n\nSangria Señoral is basically a sangria without the alcohol. So good! If you ever see a place that sells this stuff, you need to buy it.\n\nThe cocktail was good. A little too ketchup-y for my taste, but I added more tapatio and it got better. The workers were really nice to my friend and told him that if he wanted something changed, he just needed to ask.\n\nHe was still hungry after the cocktail, so he got the carne asada quesadilla. It takes a lot for me to be impressed by a quesadilla. I honestly didn't like this one. I liked the cheese, but I didn't like the meat. It was too salty for my taste and my friend agreed. Disappointing because it smelled so good.\n\nOverall, okay place.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "I'm from LA so naturally I cling to home in the wall spits. This would be one of them in SF! Fresh, fast & tasty.\n\nCASH ONLY!!", "author": "Celena F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "As most San Franciscans know, there are tons of much better Taquerias in the City but this one opens until the latest around here in the Tenderloin area, so people have no choice but to come here some times. It is okay but do not get the Carnitas here, it is not good at all. Has a weird taste to it. I was just glad I didn't get sick.", "author": "U L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "There is usually only one guy who makes the food. He is always super nice and says \"Hola amigo/a\" whenever you walk in. Brings a smile to my face every time. I personally have only tried the veggie burrito and veggie taco but I'm sure the meat options are delicious as well. \n\nThere is no salsa bar but they don't really mind if you take more than one container. Don't let the neighborhood throw you off! \n\nCASH ONLY!", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "What: Carne asada and Carnitas tacos\nWhen: once a week\nWhy: grubbin\nHow: orally\nWho: me\n\nYa feel me?", "author": "Johnny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "With all of the great taco spots in the Bay Area, I wouldn't come back here. It's decent if you're desperate for a cheap bite, but overall subpar Mexican. Everything is sitting out in an unappetizing, chipotle-style pre made way, though they do have fresh avocado. The carnitas were pretty good, but the pastor was full of gristle and fat. Overall the food lacked any spice as well. Head to the mission instead!\n\nSide note: their health score was a 78 when I was there :/", "author": "Eleanor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Taqueria right before you enter the tenderloin district?WHY NOT right? Haha. Even though it is, this place is a hole in the wall IMO. Might not be the nicest as far as atmosphere around the neighborhood but once you walk inside everyone is welcoming. Always get the carne asada here for about $8 and it's worth ever single bite. Try it for yourself folks! Good food most definitely.", "author": "Jaydee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "As I walk through the valley of the shadow of [the tenderloin], I take a look at my plate and realize there's nothin' left. Cuz I've been laughin' masticatin' so long that, even my momma thinks that the tortas are bomb. (I texted her, they were that good.)\n\nGo here, seriously good, cheap, authentic, fantastic. The back of the restaurant kinda smelled funky, so sit in the front - no big deal.", "author": "Zach C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "This place has the BEST burrito in the bay! ( I know this will cause people to be outraged) but there are never lines its cheap and good ingredients\n\nSo i don't eat rice (unless its wrapped around raw fish) so to save two bucks you can order a castillo quesadilla and add beans and save $2 rather then getting a burrito with no rice!\n\nI LOVE the Al Pastor super burrito, its like two full meals but its SO GOOD!", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "Delicious, cheap, not crowded, no-nonsense.  One of my new favorite taco spots in all of San Francisco.\n\nFreshly-sliced avocados on the super tacos is an awesome touch.  Spicy, delicious salsa.  High-quality meat -- not one single iffy chunk of chicken in 3 generously-portioned tacos.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Giant, tasty burritos with fresh ingredients. The avocado was scooped right out of the skin and into my veggie burrito. Great for grab & go, a little small and dimly lit for dining in. The al pastor turning on a spit looked very tasty too. Chips and salsa was a little on the small side, I could have used a bigger serving of their creamy salsa verde. Cash only.", "author": "Ferdi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "This place is a regular for me, at least once a week. About 90% of the time I order their Super Chicken Burrito and take it to go. The interior of the place is a bit run down so I don't normally stay and eat, which is the only reason I gave it 4 stars and not 5 stars. \n\nThe food is just authentic and tasty otherwise, and for less than 10 dollars I get a solidly packed and huge burrito with a whole freshly cut avocado sliced right into it. I've tried their other standard Taqueria menu items as well and have never been disappointed.", "author": "Larry D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-06", "description": "A few summers ago I was spending a lot of days working at the Civic Center main library, for lunch I would often hit up this taqueria (whose name I can't remember) just down 6th St. off Market that was inexpensive yet made great food. \n\nHaven't been back to the area much since then, but I was at the library and looking for lunch the other day and remembered the 6th St. taqueria. Braved the locos and the junkies to poke my head down from Market and ... it's gone, apparently. \n\nSo I went looking for some of my other lunch spots of years past nearby. The little inexpensive hole-in-the-wall breakfast and burger joint just down from Hastings? Gone. The 2 for $5 big pizza slice place just up the block on Golden Gate? Also ded. I was just about to settle for an All Star Donut Burger when I looked down the block and saw Castillo's yellow sign like a taco beacon in the mist. \n\nWalk in and ... holy shit, it's the guy from the old 6th St. place behind the counter! I don't know if they just hired him when the other place closed, or if they moved shop, or what, but the burrito was pretty similar to the old location - they don't toast the tortilla here, but it had the same good carnitas and pico that has just the right amount of chile to be interesting and get your nose running without inflaming your mouth and ruining the whole thing. \n\nOnly complaint is the price is higher than I remember - 6.95 for a regular is pretty steep even for SF.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Eek. Stumbled across this place after work, and I'm now terrified I may be an all too frequent diner. The other El Castillo just up the block scared me, it's in a seriously rough spot.  This location, however, is much more pleasant.\n\nOrdered the super carne asada burrito and pollo asada quesadilla suiza to go and oh my, both were so delicious!! Loved the different types of chicken and bean options.  Simple, wholesome, fresh and super tasty. Reminded me of San Diego Mexican food, always a good thing!  The man and woman working backstage were sweet, too. They enjoyed my attempts at ordering in espanol.\n\nMy only gripe is the chips were a little stale tasting.  Also, I paid about $15 for one burrito and one quesadilla which IMHO is a tad steep, but, they were so good!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-10", "description": "It straddles that good-decent line (good being better than decent, of course).\n\nIt might not be worth walking down McAllister for; but it's like dozens of Mission District taquerias, including the ones conveniently located outside the Mission, taquerias like El Castillito in Duboce Triangle, El Rancho Grande in the Western Addition, Chino's in the Outer Richmond, El Burrito Express 2 in Lower Pac Heights, and Zona Rosa in the Haight.\n\nIt's not hazardous eating here.  It's cleaner than I expected it to be, but also strange.  Assuming you're not lucky enough to snag one of the larger tables in the back, you'll be relegated to sitting and eating next to the line of people standing and ordering.  There's nothing wrong with that, but this place screams \"to go! to go!\" yet where are you going to take it?  UN Plaza?  Breen Place?  (RIP, dear.)  Maybe Civic Center Plaza, but at that point, you might as well brave the metal detectors and eat at Mint Cafe in the Superior Court building, because it's much closer.\n\nOfficially, it's an if-you-happen-to-be-in-the-neighborhood kind of place.  You could do better, but you could do much worse as well.  They're generous with the cilantro.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "I believe that when \"hole in the wall\" restaurants are a bit suspect from the front of the house, the kitchen is likely even more suspect, and the food is amazing.  No comment on the first two, but the food was amazing.\n\nAll my friend and I wanted was some Mexican food, Yelp led us to many high end, long wait, and closed restaurants.  Finally, it led us here.\n\nSuper Burrito with some chips on the side, hot as hell salsa, I had a very very happy tummy.  And the price is totally right.  \n\nI also love talking to new people and thoroughly enjoyed my conversations with the staff and other customers who were enjoying themselves as well.\n\nIf you're around the area and just want a super casual spot, this is a great place to park your butt and eat.", "author": "Jamila J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-11", "description": "Cheat and relatively good quality. \n\nIf you're looking for an inexpensive and fast meal, this is your place!", "author": "Xabier A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-25", "description": "We aren't from the sf area, but i do know good tacos. The place first of all looked kinda shady. Based on the reviews, i guess it's \"decent for the area\"...whatever that means. One of the first things i saw was their health safety rating. 78/100 -defined as \"needs improvement \". I thought, okay--i've eaten in Fonditas in the streets of Mexico, whatever, i can hang, as long as i dont get sick. I got 2 Carne asada tacos. They were generous with their meat. Ingredients make a taco: meat,tortilla, etc--it's a team effort.  The meat was so bland and flavorless. It tasted like they had boiled it, no flavor whatsoever. I couldnt eat my second taco. I was mad about its blandness. The place makes food to fill you up. Don't expect much. But. I did only taste the taco, give it a go, if youre a risktaker.", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "I don't remember the last time we drove by the area...but I was hungry and hubby wanted Mexican...what do I see as he made the turn?  Taqueria Casillo and there were parking space nearby!\n\nWe took a look at the menu outside before walking in.  While we were debating what meat to get for our tacos - we watched the man behind the counter put together a burrito.  It was huge and it sure looked good.\n\nWhat we  had:\ncarnitas taco - $2.5? - this was delicious.  the meat was crispy yet juicy and tender.  very generous portion.\n\nlengua - $2.5? - just as yummy, very tender pieces - also generous portion\n\nhorchata - pretty good, not watered down like many places", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Just visited tonight for the first time.  Great burrito!  There was a large group taking 4 tables and partially obstructing access to the counter in the process.  Service is very friendly and warm.  Got two super burritos, and they did them right:\n\n - Griddled both sides of the tortilla\n - Added cheese to melt on the griddle\n - Both the pastor and the carnitas were very tasty.  If you don't order pork, don't claim to know anything about burritos:)\n - Rich, tasty refried beans.  This is the *only* kind of beans that ever belong on a burrito.\n - Freshly sliced avocado, tasty mild and hot salsa, and sour cream finished it off.\n\nProbably the best burrito East of Van Ness.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "Really awesome food... the inside of the restaurant smelled like stale mop water and mildew which is a bit off putting.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "Big ass burrito--nice, friendly people, and good prices make this place a good choice. Location and cleanliness leave something a bit more to be desired but I really liked coming here. It was A-OK in my book.", "author": "Ian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "I literally work across the street from this joint, my co-workers raved about this place so I decided to give it a try and boy am I hooked!  The man making the burrito is really nice and super friendly.  My usual is the Regular Chicken Burrito, it's really good and affordable!  The only downfall is they only take cash, other than that this place is a must for the TL.", "author": "Katie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "My boyfriend's from central america so we probably got the best food ever!!!!!  I was very impressed by the tiny joint with tons of fresh food options. Plus we played the jukebox in back. We had chicken tacos Mexican style. \n\nRecommend for solo or groups, folks from out of town, families, & accessible.", "author": "McCracken C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Carne asada is fantastic as was the chorizo.\n\nThe salsa verde and pico de gallo were excellent, but I really could've used an horchata to wash it all down - alas this was not a menu option.\n\nOn the up side, the beers are VERY reasonably priced!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "My son always goes there, one day he came in with what I thought was a Burrito. I said let me taste it, OmMG! it was screamin! lol, He said it was a Qeusadilla! Rolled up like a Burrito its a whole different flavor.   \n It's called Quesadillas Costillo Cost about $7.00.  I've been getting it ever since and never disappointed! Beef,Chicken will make u salivate! Drawbacks cash only..TL you will see some strange people, that's typical S.F. It's worth it!", "author": "Toni S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "This place is legit . My husband likes Mexican food and we have tried numerous places and this is the best! The complementary chips are very good as well. Don't forget to get the chip sauce which is chilled individually in small container next to the cashier.", "author": "Nikki L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-01", "description": "Don't really know why it's rated so high... \nBeen here about 4 times now within the last few months and each time has just been alright. \nOrdered their super chicken burrito and the chicken had a pretty off taste to it-like burnt thigh meat? Idk. Can't really put my finger on it. This taste has also been consistent and had this flavor on more than one occasion. \nAnd Avocado slices as opposed to actual guacamole- No Bueno! \nI've also ordered carnitas and lengua tacos, those were pretty good. \nOverall, Taste isn't terrible, but there are far better places in the area.", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Pretty decent for the area, CASH only so that hurts my ability to get something often because I seldom carry cash these days ...especially if I'll be by the Civic Center Tenderloin. But it's nice not having to trek to the Mission to find a Taqueria. Burritos are $7.50, a steal.", "author": "Stu H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-19", "description": "Came here for a quick lunch before going to see a show at the Orpheum theater. Incredibly unimpressive. Really marginal ambience, sour cream was kind of watery, the flavors were just nothing special. It's fine, but nothing to rave about.", "author": "Jean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-30", "description": "Their burrito is the best I've found in the downtown area. It's not in the heart of SOMA or the financial district but it's worth the walk to Taqueria Castillo B. I've only been here twice but both times I've found myself blown away by how good their burritos are.\n\nYou won't call this a fine dining experience but it sure is a tasty experience and I'm now planning regular lunch hikes from the Yelp office to this place. The place is very authentic and you can catch the football (soccer) highlights on the tv since they have ESPN Deportes on.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "The best burritos in the city and I have tried many places. The price is right too. They load that bad boy up. I hardly finish it in one sitting. Sometimes I throw 'em off and order a Torta. Wow, one of those probably has more calories than 2 big macs but I aint counting. Neighborhood's a little rough but worth the trip.", "author": "Hale L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "When I land into SFO I take the BART into the city, get off at the Civic Center stop and head straight to into this place with bags in tow. I can't get enough of their juevos rancheros. After spending months overseas this injection of home made deliciousness is what brings me back home. Thank you, taqueria castillo, for being there.", "author": "Orlando B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "Coming from LA, I have a high standard for tasty, inexpensive Mexican food. This is the only restaurant in San Francisco that I have found with really flavorful, inexpensive food. They get extra points for generous portions,  friendly service, and free chips and salsa. I'm always happy to see the delightful woman at the counter who entertains my limited Spanish with a smile.", "author": "SF R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Who knew the chicken in a burrito could actually be juicy?? My mom's chicken doesn't even compare!\nCash only, but the CVS across the street gives cash back.", "author": "C S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "We were looking for a place for a quick bite to eat before seeing Wicked.  A security guard recommended this place.  Super friendly.  Tasty food.  Good prices.  We were very pleased.  Dinner for $20.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Thank u!! Todo estubo EXELENTE!! Def recommend there Asada burrito and jugo de naranja!", "author": "Lupe V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-21", "description": "Average at best, but not worthy of three stars. I went in thinking that I couldn't go wrong with a burrito. I left wishing that I would have just skipped lunch instead. It's unimpressive. If you're craving a burrito, go elsewhere.", "author": "Marcus A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-07", "description": "Meh.  Food disappointing.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-03", "description": "Yes, my stomach was full, but no, this is not the burrito you're looking for.\n\n* I don't need 6oz of sour cream in my burrito.\n* It would be great if the cheese was actually melted, you could try grilling it afterwards.\n* When I ask for my burrito to be spicy, I expect you to maybe put some jalapeños in it.\n* Finally, if you charge $8.80 for *that*, you're doing it wrong.", "author": "L D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-26", "description": "I was really stoked for this taqueria but it was overwhelmingly disappointing :( I ordered a Pollo Asado Burrito. First of all the burrito was waaaay too salty; my extreme thirst after my visit confirmed this. The refried beans made it a little better, but the salsa was bland and the overall flavor of the burrito was pretty unremarkable. Maybe my experience was an outlier but I wouldn't go back again.\n\nI guess a pro to this place is that they give really big portions. The regular-szied burrito is HUGE (and not much smaller than the Super Burrito, in case you're debating between the two). \n\nI'm giving it 3 stars because my burrito was less than satisfactory. I'm sparing it from only 1 star because I've only been here once and because maybe my experience was an outlier.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Worked six years across the street from this spot and never knew it existed.  \n\nI ordered a basic carne asada, super burrito the first time.  That thing was ginormous.  Could not finish in one sitting.  All ingredients were fresh  and good quality, Their tamatillo sauce for chips is excellent. \n\nBeen back here for breakfast.  Highly recommend the huervos rancheros for 5.99.  The cook even cut out a tortilla and fried the egg in the middle of it.  \n\nThe seating situation here is a little cramped.  Gets busy during lunch time rush.  \n\nIf you really wanna see the quality of this place, check it out right when they open.  That's when the salsas are freshly displayed and when they prep the meats.  The sight of their carnitas shows promise.  Will be my next protein choice when I go back..", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "Never been disappointed here.  Only gotten burritos but the cow head super burritos are incredible.", "author": "Kory-Oren E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Best of SF! Excellent tortas.  I'm partial to carne asada, on a delicious roll with avocado, tomato, lettuce, sour cream, salsa, and a few other ingredients. \n\nGreat value, like $6.25 or so for a torta you can split in two. tortas are way better than burritos imo", "author": "Steve Obama L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "For price and performance, Taqueria Castillo hits the mark. The restaurant is conveniently located near the Orpheum Theatre where I like to see shows. I've only ordered burritos here and it's a cash only operation. I would have to agree with a previous reviewer that the carne asada is dry. You're better off ordering the pork, chicken, or lengua.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "Loved the burrito. Fresh. Filling. Cheap.", "author": "Abhilash J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-14", "description": "Had a pork burrito, meat was grizzly and tough. Food is bland, low quality. Would not return, terrible food and dirty place.", "author": "Kay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "Best shrimp burritos I've had in a long time. Worth the trip to find this little hole in the wall is a diamond. They speak very little English but they make up for it in service.", "author": "Phillip T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "LOVE this place. I was working close by and it was hard to resist eating here everyday. I moved away from SF but am still dreaming about the carnitas tacos and super tacos picante...prices are great and the staff is really friendly. Can't wait to come back here.", "author": "Lisa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "So good. I get the steak burrito every time. At least once a week. I keep coming back because of the decent prices and delicious food.", "author": "Anthony Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "Not all that long ago, I reviewed another taqueria just a few blocks from this one. This place has several things in common, the most salient being that it's located in a really dicey area. \n\nThe long-shuttered Hibernia Bank is just a few steps away, St Anthony's dining room (and the waiting 'customers') is just around the corner, a smorgasbord of homeless, drug-addicted and mentally ill people are hanging around, and the ever-present scent of...oh let's say \"eau de pissoir\"... is all over the sidewalks.\n\nThings that make you go, \"eeeewwwwwww!!!!\"\n\nThe restaurant itself is actually much cleaner, fortunately. There's a reasonable amount of seating for the square footage available, the food is fresh and kept sequestered from grabby hands, and the menu has a reasonable variety to it.\n\nI had no qualms with the price, and it was pretty good quality food, too. Not the most outstanding Mexican food I've ever tried, but nothing wrong with it. One of my co-diners had a shrimp number that was \"al diablo\" (or some such Satanic description), and I believe I'm going to try that when I next wander in here.\n\nYeah: if you don't like seeing the worst of what our current economy has to offer, if you don't like seeing firsthand why \"drugs are bad, mmm'kay?\", or if you feel guilty having good Mexican food within a diagonal block of a soup kitchen, then you most certainly should go somewhere else.\n\nIf you have more of a spine, though, then feel free to drop by.\n\nFor now, I give it 3.2 stars. But after my dietetic duel with El Diablo, maybe I'll increase it.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Best super tacos in San Francisco, hands down. They generously fill corn tortillas with fresh avocado, quality meats, and headings of spivey salsa and sour cream. \n\n\nAlso try their horchata", "author": "Liz K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-07", "description": "Their super burritos are so good! It's like two meals wrapped into one. I eat half of it for dinner, the other half for lunch. :)", "author": "Ezekiel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "I've though about getting a whole roast chicken from here. Because I'm some weirdo wanna-be lawyer who needs a whole chicken, right? So I haven't. But I'm pretty sure the chicken they sell whole is the same stuff they put in their tacos/burritos, and you can really taste the rotisserie flavor. So if I ever NEEDED a whole chicken, this would be the place I'd go. Oh and their al pastor gave me insta-heartburn. Or maybe thats my heart on fire due to a double Laker loss- not sure which.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-30", "description": "We were on Market St. and craving burritos so we looked on Yelp and found this place, and it was awesome!  We were a group of three, two of us had burritos (wet burrito with spicy chicken and super burrito with beef) and the other had a carne asada plate.  The burritos lasted us two meals, as we had leftovers.  Burritos were about $7.50 and they were huge and amazing.  The beef burrito was really good, each bite was amazing and even after I got full the taste was still amazing.", "author": "Zachary H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-24", "description": "Nice people but the food was really bland. You can do much better for Mexican food in the city.", "author": "Minks M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-21", "description": "This Mexican restaurant can be summed up with one word: mediocre. Quite frankly, nothing here has struck me with tasty awe.\n\nOn the contrary, their prices are cheap, there is never a wait and they serve your food fast. Plenty of seating and a somewhat comfortable atmosphere to sit and chitchat over your meal.\n\nI live literally right across the street from this place so I tend to come often (I can be a lazy eater). I have no complaints so far, good place for a broke student such as myself.", "author": "Tim J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-27", "description": "I knew it was a bad sign. When I called ahead and the guy starts speaking Spanish. Why is he answering the phone? After mustering up a few words in Spanish. I put him on hold. Grabbed my co worker to talk to him. She places an order for 7. Once you walk through the \" hood of zombies\" which is the TL.  You bring back to the office . Just to see they messed up some orders. The steak burrito was disgusting. Stay away it's not worth walking through the TL. Just to get food that sucks.", "author": "Sandy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-21", "description": "This place had a fine burrito.  Probably better than you could find in most major cities in America.  But this is San Francisco.  You have to have SOMETHING special going for you to get a 4th star.  Unfortunately, Taqueria Castillo just doesn't have it.\n\nAt first I was excited when I saw they used avocado instead of guac.  But the rice and beans were rather flavorless.  The salsa was bland, including their \"hot sauce\" that I dumped over in an attempt to salvage some flavor.  Worst of all, the carnitas was overly salted (this is coming from someone who LOVES salt),\n\nThis was a solid cheap burrito.  I wasn't BAD, but I don't see why you wouldn't go one block away to Cancun,", "author": "Lenza M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "I was in-between appointments and needed food. They fixed me up nice with a very solid huevos rancheros. I recommend you order similarly if you happen upon this place in the late morning.", "author": "Jared M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-31", "description": "I am still in disbelief that I ate my ENTIRE carne asada super burrito here on Friday. Like, where did it all fit in my stomach? I have no idea, but it was so good, I don't care it lands on my hips. \n\nInexpensive, friendly dudes making burritos, and GREAT food. What more do you want?", "author": "Liz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-08", "description": "This may be the best taqueria in SF. The carnitas super tacos are superb. Good carnitas are hard to find.", "author": "Chad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "Excellent tacos with chicken in verde sauce.  GREAT rolled tacos (and I don't usually even like them).  The chips aren't great, but the salsas are delicious.  A wonderful value in the City.", "author": "Mac P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "Best taqueria I've been to in the TL. Quick and friendly staff that listen to you when taking your order. They give you lots of meat and don't skimp on stuff like avocado and sour cream either. Aquas frescas are always tasty and they change them everyday so its not the same stuff all the time. \n\nDrawbacks: Cash only", "author": "Jayme J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "Though not quite on par with the Mission, this burrito place is among the best in the Civic Center/Tenderloin area. Good prices and service and food. Definitely worth a visit.", "author": "Ned D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-26", "description": "I live close by and I come eat here way too much.  \nFriendly staff and pretty good food. \nMy regular orders: Chicken in Red Salsa or Carne Asada Regular Burrito on wheat with black beans, mild salsa, cilantro, add lettuce.  Cut in half.  One for lunch, one for dinner.  Done.  \n\nTwo cool options you may not have known about:\n(1)  3 Tortilla Choices (Flour, Wheat, Spinach)\n(2)  Meat Combos (i.e. you can get your burrito half carne asada mixed with grilled chicken)", "author": "Bert N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-14", "description": "Best burrito I've had since I left Texas in 2007. Mexican coke and fresh salsa bar top it off.", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-19", "description": "It's not too bad, the portions given are more than plenty. The prices are great for students on a budget. The food is made very quickly. \n\nHowever I wouldn't recommend sitting down there and to eat. The place is in very small cramped place and it's very loud.", "author": "Lena S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-17", "description": "What makes one burrito great while another is only ok? They usually have all have pinto beans, rice, and meat, but for some reason some are fantastic and others are 'meh'. This taqueria's Grilled Chicken Burrito was very standard. Not bad, not particularly good, just a generic burrito. $5.80 is hard to beat though, so props to them for the price!", "author": "Talia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "I stopped in here the other day to get a burrito because I was at the library and it was about lunchtime.  I got the lengua super burrito and it was delicious!  The lengua was moist and tasty as were the rice and beans.  I like that they use fresh avocado pieces straight out of the peel and not pre-prepared guacamole.  I also got a watermelon agua fresca which was prefect considering it was 95 degrees and sunny outside.\n\nthe actual place is small, though there is plenty of seating.  Service is good and quick and I would definitely come back if I were in the neighborhood, though not sure i'd make a trek just to get the burrito.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "They have a great veggie burrito here. The cheese is melted onto the burrito and the beans and rice were piping hot! They were generous with the avocado and all of their veggies were very fresh! Salsa and chips were tasty as well!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "I judge a Taqueria by their tacos.  That's just my thing.\nSome do with burritos, but burritos aren't Mexican by origin.\n\nI've had some goooood Mexican food before in L.A., and this has to be one of the better ones I've had in California.  Best one in SF so far.  One of few places other than the taco trucks where they make tacos the real authentic way.  I heard good things about the burritos, which I'll try sometime in the future.\n\nChips are nice and crunchy.  The food there is fresh.  I may go here this whole week during my break from the hotel across the street.", "author": "Winton W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-05", "description": "Every time I walk in the door to this place I think \"Hmm, maybe I won't get the runs today.\"  But I do.\n\nAnd yet I come back.  SOHHHH GOOOOOD.  The Prawn Quesedilla is great, the place is clean, the food is (looks) clean, the workers are very friendly and they have a big jukebox that blasts Spanish songs.", "author": "Darren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-19", "description": "Have ridden past this place on my way home nearly every day the last 2-3 years and was always curious. After a late night at work tonight, craving something cheesy/fatty, I rode past as usual, made a mental note of clientele as I went by (one harmless-enough guy eating) and decided to turn around and give it a whirl. \n\nThey only have a very basic veggie burrito option (no grilled veggies or other such deliciousness) but the staff was very nice and they use fresh avacado instead of guac. The one customer did have crazy eyes on closer inspection, so I took my burrito (with chips!) to go and biked home, while visions of blackbeans danced in my head. \n\nThe verdict: my burrito tastes ok! Decent size, overall fresh taste (though rice initially tasted a little dry), basically satisfying, no-frills burrito for $6 (and a penny - what's up with that?). OK, the chips were a little stale but oh well.\n\nI prefer more veg options but after 10 o'clock at night between downtown and home, one can't be particular! Def wouldn't go out of my way to eat here and prob won't stop again, but at least now my curiosity is at bay. :-)", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "Great for the Quick and/or Easy, Well cooked meal.\nIt was a CASUAL, well maintained, BIG portioned, well priced (10-15$), SMALL restaurant with a Mod-Box (Juke-Box) & Flat Screen(Playing soccer no doubt) ! \n\nI think the only reason we don't mark this place 5 more \noften is because its not gourmet, but for a small taco\nshop THERE DOING IT!\n\nATTENTION SENSITIVE EATERS;\nIts not GREASY so enjoy this nutritious healthy Taqueria.\nLet the homies know.\nSpecify if you don't want anything SPICY in your food. \nSay no to Green Peppers/Onions if you know they dont sit well w /you.\n\n\"Two cool options you may not have known about:\n(1)  3 Tortilla Choices (Flour, Wheat, Spinach) [Corn too!]\n(2)  Meat Combos (i.e. you can get your burrito half carne asada mixed with grilled chicken)\" -Bert N\n\nPlease improve- The chips, everything else is fresh.\nFAVORITE- Freshly squeezed juice, Nantucket, & Beer are among the various beverages.\n\nTheme Song\nMi Pueblo: http://www.youtube.com/watch?v=kv1KibKQz08", "author": "jennifer d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-04", "description": "Fantastic chorizo super burrito. \n\nThis was prepared extremely fast and turned out amazing and packed with perfectly sizzling chorizo, huge pieces of avocado, and lots of super spicy salsa. A++ The tortilla was also slightly crisped (very slightly) so it had a bit more of a hearty texture than the normal fare which is usually quite rubbery/chewy.\n\nWay better than my other favorite taqueria next to TuLan.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "Exactly what I was looking for.  Ordered the super burrito with al pastor.  I originally wanted to get lengua or cabeza, but they were out of both.  The food is fairly cheap, very generous portions and overall fairly tasty.  My friend had the pork stomach, and that was really good.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-19", "description": "I don't know why this place has such a high rating? In their defense, I have only been here once so I will probably go back to try some other items. I got the super burrito (which wasn't bad), but it definitely lacked freshness and flavor! I may just be spoiled because I'm from so-cal, so I definitely have been to amazing hole in the walls around LA. I requested they make it spicy, but I didn't taste any spice (maybe they forgot it?) Some spicy/flavorful salsa would've made a huge difference! To end on a good note, the portions and prices were good, and they made the burrito super fast! Ill be back though...", "author": "Alannah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-05", "description": "Castillo is my second favorite Tenderloin taqueria (after Tesoro).   Everything I've tried has been of high quality, but nothing stands out as especially sublime . . .  The pastor burrito is probably the best thing I've tried there.  My coworker orderd the camarones diablos, which I sampled -- these were good as well.  They cook up the meat when you order it, rather than just scooping it straight from the warmer to the tortilla.\n\nAnd the little things that make or break a taqueria -- Good:  good level of cleanliness; horchata is good.  Bad:  chips are from a bag; no salsa bar or pickles.", "author": "J S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-29", "description": "So I'm fond of El Castillo normally, but this location just lacks the thrills.  The service is sort of snarly at times --- not just aloof, but enraged at customers' daring in ordering food.  Some days this is not the case, but all to frequently it is.  They also have a nasty tendency of overcharging for things. \"You receive regular nachos --- but you pay for the super!\"  (though given that's only about $2 more, it's forgivable)\n\nIf the food was excellent in any way I would accept these indignities, but this is somnambulent Mexican fare.  The only bright spot is the green salsa.", "author": "Gustie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-10", "description": "I went in to get some Al Pastor. The place was dirty. The pork on a spit was just sitting there, not rotating, not being heated. I asked the guy at the counter what was up with that and he just smiled and said \"Yes\".\nI ordered a carnitas taco instead (greasy) and got sick the next morning for my trouble.\n\nAVOID!", "author": "R W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-08", "description": "This place fed me through many nights ... \n\nThe burritos definitely are the best!  They are fresh, yummy, huge and cheap.  I don't think I would have survived law school w/o this place.  :-)", "author": "Roni R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-16", "description": "A typical taqueria - nothing too different here.  Skip the carne asada though, it's really dry and flavorless.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "BEST Taqueria in the tenderloin by far! This place is a hidden gem. Went in one day ordered nachos to split. biggest 6 dollar plate you'll get. Great food all around, love the carne asada tacos. Plus it's all cheap!", "author": "Steven T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-27", "description": "Not the best, not the worst, it's OK. Decent food, fast, lots of tables. \n\nWe were in the area after a party at the Asian Art Museum and needed some food in our system after getting buzzed with all the free wine & sake at the event. I got the regular carne asada burrito. Tastes like a burrito with your choice of beans, rice, salsa, and choice of meat. Nothing special, but it hit the spot for us since we were hungry. We kept ordering more beers and got a little rowdy in there, but the staff just laughed at us.\n\nCool place, decent food, and bonus points for not kicking us out for being loud and staying there for so long!", "author": "Linda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "Not bad, huge servings but their nacho is not very good. Chips are stale because they throw it in the microwave. As a matter of fact, I got food poisoning from it. They also don't accept credit/debit card. They do however have an ATM inside which charges insanely but when you're hungry, you're hungry you know? Very popular place for college students To go to during class breaks, especially for ones taking night classes.", "author": "Leonard Andrew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-29", "description": "I don't write yelp reviews for anything, but after getting extremely sick from this place, I felt like I should warn people. I would give this place less than 1 star if I could. I can deal with bad food, but I cannot deal with sub par health standards. I should have known not to order from this place when I initially saw the meat sitting out uncovered and flies buzzing around everywhere. Alas, I was super hungry and didn't think much of it at the time. BIG MISTAKE. I got the worst food poisoning of my life from this place, and it lasted for 2 days. I didn't even get anything sketchy... I ordered a chicken burrito, which is usually one of the safest options to get at a Mexican restaurant. I ended up talking to some other people about this place, and it turns out that a lot of people have gotten sick from their food. Honestly I feel like this place should be closed down until they can get  their health standards up to par. Until then, I'm never coming back, and would recommend steering clear of this spot.", "author": "Andre K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "Good spot down in the 'loin. Went with a fairly basic veggie burrito, which consisted of a massive amount of black beans, lettuce and tomatoes wrapped up in a wheat tortilla. Note the black on the beans and wheat on the tortilla. My kind of place.\n\nFourth star clincher was when they only charged me for the cheaper bean and rice burrito, as I had asked they leave out the sour cream, avocado and cheese that typically comes with the veggie. A nice gesture, easily enough to get that fourth star.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-24", "description": "Whenever I feel like giving my colon a real test; you know, to make sure it is still functioning properly, I go to Taqueria Castillo B.  \nYesuree, that sucker still works like a charm, and I don't even eat meat.\nImagine!", "author": "Meg W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-23", "description": "inexpensive. small interior, mostly take-out. limited menu, heavy on burritos and shrimp dishes. two egg plates, one breakfast burrito option- chorizo.\n\nthis is basically across the street from the UC hastings dorm. it's of course in the super classy area known as the tenderloin, so dont be suprised if you have to step over some feces on your way in.\n\nwhen i came on a saturday morning, the window had recently been shattered. i bet the employees see a lot of interesting things...\n\nthe prices are a little odd, like $5.01, $7.93. i guess it's to make it even out to a round number when tax is included. \n\nI got a tamale plate, cost $5.09 or something like that. it came with two tamales. they were just ok. they were wrapped in saran wrap with a printed icon, so they obviously don't make them there. you can get either chicken or shredded beef tamales.\n\nI also got the fajita plate, $7.78. it was much better. you can get chicken or beef, they don't skimp on the meat. the onions and peppers were well-grilled. they shake some salt/seasoning mixture over the meat as it cooks. it was a bit salty for me, but i'm a salt wimp, i never cook with it. they didn't ask if i wanted flour tortillas, it came with corn, which i prefer anyway.\n\nthe plates come with rice and watery refried beans (you can get whole pinto beans if you prefer), shredded lettuce, a slice of tomato, a scoop of chunky salsa. orders come with chips, you have to grab the salsa yourself, it's already prepackaged into little to-go cups. they have a thinner green salsa, and a chunkier tomato one.\n\nmy total was $14.60. cash only, but they have an atm machine inside.\n\nthey are generous with avocado, which comes on a lot of the items, including the plates, the tortas and in the super burritos.\n\nthey also have fresh-squeezed juice, it's about $3.50. they have carrot, orange and grapefruit.\n\nthe tortas looked really good, the bread is long and wide, not short and square-ish, like you often see with tortas. they toast the bread on the grill and put half an avocado inside, along with tomatoes and lettuce and stuff. \n\nthey have a couple of refrigerator cases with jarritos ($1.84), american soda, domestic and mexican beer.  they had two jugs of aguas frescas.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-08", "description": "The burrito was nasty. This is the worst burrito I've eaten, even Taco Bell can do better. I only came here once and will never come again. I had a chicken burrito and it had no flavor except for a little spicyness from the salsa. The salsa had no other flavor except being spicy.\n\nThere wasn't much people when I came, probably cause it's nasty. I would never come again.\n\nOnly come if you have no sense of taste.", "author": "Loi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-17", "description": "More of the same..... only 2 blocks away from the Golden Gate location. (Refer to other review for the time being.)\n\nUpdate: Sometimes the food here feels slopped together..... that & they must be trying to cut food cost by using barely any cheese. It's just not the same.", "author": "Eugene G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-12", "description": "the castillitos of golden gate ave, yeah.\nA = good lunchtime asada tacos, poor salsas and most other things\nB = until recently very cheap, now the same as all the rest, probably the lower tl's all-around best taqueria.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "This is the best Mexican food in the TL and the surrounding area. The meat is off the hook.  You have to get the unbelievably good green sauce.  Also, make that burrito wet wet, brah brah.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "This place was my introduction to burritos when I moved out here for school.  I used to get them cut in half.  Stopped by after court since I was in the neighborhood last week and ate a whole burrito.  And accomplished nothing for the rest of the day.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-04", "description": "I agree that the service \"is sort of snarly.\" But other times, they're extra talkative and joke with you. But lately, it seems to have been the opposite. But I guess it doesn't really matter since with most cheap places I only come for the food anyway. \n\nI haven't been here in probably the last 6 months so I don't know how relevant my review will be. \n\nTheir food is okay, usually seasoned well (sometimes too salty though) and decent portions. Sometimes the rice is too dry and hard. \n\n I LOVE that they grill the meat before serving it to you so its hot and has that grilled taste. And I like that they can do different types of combo plates because I like variety. \n\nAnd, FREE unlimited chips and pico de gallo.  Its pretty average, but I like that its really spicy (maybe a little too spicy though). But you can ask them to give you the non-spicy kind. \n\nI've also had their seafood quesedilla. I think it was overkill, too many toppings or something but it wasn't very appetizing. I couldn't eat very much of it.", "author": "Dorothy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "Walk into Taqueria Castillo B, and it looks a bit...Loinish. Dirty, a random street person sleeping at a table, and a guy out front asking for change. However, without question, this is the best Mexican food you can find in the Loin...or Downtown for that matter. I would even go so far as to say it rivals many of the taquerias in the Mission.\n\nThe ingredients are uber-fresh, the service is fast, and the prices are cheap. Burritos are amazing--very generous portions, and some secret salsa they use that gives it just a bit of a kick that I really appreciate. While I eat there at least once a week, I've only put a small dent in their menu, so I can't say everything is amazing...But I'll let you know.\n\nIf you speak Spanish (which I don't) you have a huge advantage. Watching people in line, they seem to make you whatever you like--from sandwiches to wraps to plates to crazy breakfast entrees. Some of what they've made others ahead of me in line had me glancing up at the board to figure out what it was, and telling myself I need to learn some Spanish.\n\nAs far as service goes, yes, they can be a bit...short. But only when they have a line out the door. For the most part, they are friendly, attentive, patient, and never pushy.\n\nWell worth the 5 or 6 bucks. Give it a try next time you venture into the Loin, or find yourself hungry at the Civic Center Bart station.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "Super Soft Taco (Chicken): Chicken verde (spicy); no cheese, no sour cream. $3.17.  Portion is HUGE for the price.  Moreover, it may be the best soft taco I have ever had.  This place is my favorite afternoon \"fix.\"", "author": "Mark V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-28", "description": "I had the carnitas tacos today, and they were very good.  I can't review a taqueria fully until I've tried the burrito, so next time!  The people are very nice.", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Good burrito, this place reminds me of the little taco places I would find all over So Cal.  The chips are an afterthought so just don't go expecting to get something home-made in that department. I will definitely go back and try out the asada tacos next time...", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "The carnitas tacos are better described as melted pork juice with shreds of pork atop a woefully overwhelmed mini corn tortilla.  It's like a pork salad with a flattened corn disc plate.  That's a good thing, in this case.\n\nGrab a water and a pile of napkins and try not to look like a pig while eating this pig.", "author": "Likes J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "I love fish or prawn burritos.  However finding a place that makes them good is a challenge.  This place has probably the best prawn burrito that I have had so far.  They use 12 large prawns that are of very good flavor.  I don't like the way it is made on the menu, but they make it to order, as will any taqueria.  But most don't use enough prawns and not as good as this.  Sadly there are no fish burritos here.", "author": "Scott A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-31", "description": "I've been there twice and I've never spent less than 6 bucks on a burrito.  \n\nThe regular burrito (which is the cheapest one) is pretty much a lot of food, but it doesn't really taste like anything, which is a shame.  HOWEVER, the 7 dollar (\"super burrito\" i guess its called?) is pretty darn good.\n\n  HOWEVER, you can basically use that 7 dollars to get a similar burrito (without avocados) at the Tacqueria Castillito on Golden Gate and just spend around 4.50 to get a BETTER TASTING, Maybe even bigger, burrito and like a 2 dollar beer a long with it during happy hour.  (The burritos always around 4.50, the beer is around 2 bucks during happy hour, just to clarify things.)", "author": "Rusty W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-11", "description": "This place is right by my school so i go there often. I always get the same thing a grilled chicken super burrito with everything and black beans.  Overall I love the size of the burrito and it seems to be at a good price. My burrito tends to be very good but I Will admit that i have had a couple of misses in the past. where the chicken wasn't seasoned enough or the avocado wasn't fresh enough. But a couple of times out of the 3 years i have been going there is not too bad. \n Get your stuff to go if your in a large group. there are a few table inside but only 3 tables int he back that can seat 3 or more.", "author": "Jess M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "I like this place because they are open late on weekdays. I don't know when they close but I have gone in as late as 1030 pm and pick up a burrito.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-03", "description": "The first time i came to taqueria castillo my cousin had told me that its the best taqueria in the city!! The burrite is huge!! and the price isnt too bad either!! My friend Vy had the wet burrito and that was pretty good!! So everytime that i go to a taqueria i WILL ALWAYS ORDER Horchata!!", "author": "Junel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-13", "description": "I'm from SoCal so SF burritos are generally disappointing, but this place is preeeeeeeetty, preeeeeeetty, preeeeeetty good. Not amazing, but definitely much better than most SF Mexican places. This applies to all the other Castillo/Castillitos in the City since I've been to about 3? 4? of them and they all taste the same.", "author": "Phatalie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "Best prawn burrito that i have tried in San Francisco.  Haven't tried anything else.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "My favorite place for burrito in SF. Their el-castillito quesadilla is the best on the menu in my opinion. I like to get it either in a spinach wrap or an orange wrap.", "author": "Stevie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "This place practically raised me for 4 years of college at the Art Institute of California - SF. They have great torta's and awesome tacos. The chips are lame because they aren't fresh but with the price tag.. you can't beat it. I wouldn't say this is high class mexican at all... but with the friendly customer service and quick line, you can't beat this for a quick lunch or dinner. Mmmm this review is getting me hungry..", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-01", "description": "I'm not much of a burrito person but I come here once a week. I think it's best when you go there early or later during lunch hours because if they're in a hurry they might not get your order quite the way you'd like it. I love their tortas. They grill the bread with cheese inside and top it off with meat, lettuce, tomatoes, avocados, and sour cream. Yummy sandwich. They give plenty of food. Tacos are always stacked. The guys who cook up your food are cool when it's not busy and take good care of you.", "author": "Bee C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-29", "description": "I got introduced to this spot via a co-worker and I've been told this is the second outlet by the same owner.  Bottom line --- inexpensive Mexican food in heart of the city.  I usually have the veg burrito.  Interesting mural on the wall and other paintings", "author": "ITesh J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "I go to school next door, so this was an all time fav when I lived on campus.  I miss now that I've moved away to the Nob.  :(  Their veggie burrito is one of the best I've ever had.  So so good everytime!!  And it's HUGE, so it feeds me for about 4 meals.  The workers are always very friendly and playful.  Excellent service.", "author": "Latef X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-11", "description": "i eat here all the time\n\nthey know my boyfriend by name and practically have his veggie burritto prepared by the time he gets done ordering\n\nthey ask him to reach for items on high shelves\n\ni love this place", "author": "Keila E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "Good taqueria, worth the money.  Never had a bad experience, always quality food, for a reasonable price.", "author": "S. H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "This is a no-frills place, but with solid burritos: tasty and generously sized. Friendly staff, too.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "We love our neighborhood taqueria.  Prawn quesadillas, veggie burritos, good salsa, delicious orchata, cold beer if you wanted - and they are nice and friendly!  Added bonus, they have spinach tortillas!  Several locations that have all treated us well, but the one nearest us is dearest to our hearts.", "author": "B M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-29", "description": "Tasty, spicy food here with tolerable prices, but the hygiene is questionable. I overlooked the first hair I found on my fajita platter, but I had to put down the fork once the second hair made its appearance.", "author": "Mister Z."}
