{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Delicious and yummy Thai food :)\n\nWas recommended by a friend to try this place a while back but due to the distance, I seldom came out to this part of the city. Thanks to the brother and his newly arrived gf from Taiwan, I had the opportunity to play tourist for a whole day, taking her around the city and trying new food places. I called in for a reservation for 4 at 2 pm as we were driving there and they had availability. Thank god we did this cause they were already a third full when we arrived but immediately filled up with a huge party of 11. \n\nSeating approximately 38 people, the restaurant is small but cozy and clean. There appears to be one server only but he was efficient and accommodating. Since it was our first time, we asked our waiter, Johnson, for recommendations and ordered everything he recommended. \n\nTOM YUM SOUP: one of my favorites at Thai restaurants. I love sour and spicy soups cause the combination is just so appetizing. Made with tomatoes, mushrooms, onions, lemon grass, green pepper, galangal, and your choice of protein (shrimp, catfish, seafood, chicken), or vegetable and tofu. We ordered it with chicken for $11. I initially thought the soup was small, but it filled up four rice bowls perfectly. There was plenty of moist chicken meat and the soup was mildly spicy as requested. Soo good!\n\nSOFT SHELL CRAB ($13.75): light battered soft shell crab with onions, green onions, green beans, and red bell pepper served with chef special sauce. I wasn't able to try this cause I'm allergic but everyone said it was their favorite. The crabs were goldenly fried and the portion was very generous for an appetizer. \n\nFISH CAKE ($9/4pc): grounded fish paste seasoned and mixed with chopped green beans. Lightly fried. Dipped in this side cucumber sauce with ground peanuts. The fish cakes were big and round, like an egg almost. I found the fish cakes to be ok. Not great but not bad.\n\nOXTAILS ($16.95): made with star anise, lemongrass, onions, carrots, tomatoes, slow braised oxtails, and basil served. MUST TRY. omg. the oxtails were really good. the meat was tender and fell off the bone. super flavorful. I can tell they've been marinating the oxtail for quite some time cause of the flavors and texture. \n\nPAD THAI ($11): my ultimate childhood favorite growing up. Actually, the ONLY dish I used to eat at Thai restaurants growing up. I was so obsessed, I stayed loyal until literally college when I finally decided it's time to expand my horizon and try other stuff. Although I'm more open to eating other dishes now, I find myself craving a Pad Thai every time I visit a Thai restaurant. I used to even tell myself if they can make a bomb ass pad thai, then they must be good cause it's like their signature dish right?? Well, turns out I was only partially correct, lol. Thai Cafe's version of Pad Thai contained similar ingredients as the other places I've tried: stir-fried Thai noodles with soft tofu, bean sprout, ground peanuts, and your choice of meat (shrimp, beef, pork, chicken) or just tofu. Although not bad, I did think their Pad thai was a little bland. Lacked flavor. But it wasn't bad. I added some vinegar jalapenos and Thai chili's to it and it turned out good. \n\nDUCK FRIED RICE ($12.75): Woah. Although simple, the duck fried rice was really good and I really enjoyed eating it. Made with boneless roasted duck, egg, onions, and green onions, it was surprisingly very appetizing and everyone dugged in and even got seconds. \n\nFRIED CATFISH ($?): not sure if this was on the menu cause Johnson recommended it to us when we were ordering and I don't member seeing it on the menu. BUT nonetheless, it was one well-made catfish. The fish was fried perfectly with the right amount of batter while still maintaining the moisture and softness of the fish. Yummm.\n\nSo far, most the dishes were good. The oxtail, soup, catfish, and duck fried rice were all my favorites. All these dishes were seasoned just right and simply tasted delicious. Service was really attentive from Johnson. With a full house, he managed everything and stayed consistent with service. Way to go, Johnson! \n\nPlus! They offered wine and beer :)", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "I've always stopped by Thai Cafe every time I visited SF just for their amazing duck fried rice. Most of the time, I ordered by phone and picked up the duck fried rice because the other food was just okay, nothing special. \n\nThe fried rice itself is actually so-so, just like regular Chinese fried rice, but what makes it special is the duck pieces that you get with every bite of the fried rice and they are very generous in giving the duck pieces.", "author": "Nathania Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "A regular go-to for us in the Richmond district of SF. There are so many Thai restaurant in the Bay Area but I find this place to be one of the better ones that my husband and I really like. The food is always consistently good, the price is very reasonably and the restaurant is very clean. Even the bathroom was surprising above my expectation for a small neighborhood restaurant.  We've been coming here for years and will continue to come.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Delicious food, super-friendly service, great prices, and spotlessly clean. Thai Cafe has been rocking it on Geary for 35+ years... and frankly this is THE place to go for Thai food in San Francisco. \n\nMy favorite dishes are the Kang Curry w/Duck and the Eggplant w/Ground Chicken. For reals, these dishes are so good that you'll remember how awesome they taste. \n\nHighly recommended.", "author": "Jack D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "My friend introduced me to their duck fried rice a couple years ago but I always got to-go. After all these years, I decided to go back and dine in. Street parking was easy since the street isn't that busy. I went with friends and we got family style; ordered a bunch of dishes and shared. \n\nCalamari- The calamari was served with fish sauce and it was very hot and crispy. I enjoyed the appetizer with the fish sauce because it gave it a sweet and tangy taste. \n\nCubed Beef- Very well marinated! The beef was tender and not chewy. It was lightly seasoned, enough to taste the juice from the beef. I actually liked this dish. \n\nTom Yum Chicken- The tom yum wasn't spicy at all. It tasted like tomatoes and water. Didn't really taste anything else. This is probably one of my least favorite dish there. I have tasted way better tom yum soup. \n\nShrimp Pad Thai- Not sure if I enjoyed this dish or not. The pad thai was lightly colored orange and it didn't have the typical green onions.  It did have tofu though...I felt like it was missing something...possibly lemon and spices\n\nChicken Green Curry- Very watered down! I have had thick green curry before and it was great. But this curry was very watered down as well. There was a lot of egg plants and bell peppers! I just wish it was creamier. \n\nDuck Fried Rice- Their duck fried rice never fails me! Their sauce is like crack sauce...you just want to smother the rice with sauce. The sauce is a slightly sweeter version of soy sauce. \n\nThough I did notice that the duck fried rice we got was a lot smaller portioned than the table next to us. The guy next table to us ordered a duck fried rice and his portion looked like it could feed 3 people. Whereas, our duck fried rice looked like it could barely feed 1 person. \n\nThe total bill came out to be around $70.00 which is not that bad considering it fed 4 people. Overall, the experience was good but I feel like there are lots of room for improvement.", "author": "Vanessa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Very good all around. Duck fried rice is very delicious especially with the sauce.. always come here when going to san francisco. Almost never missed it. Especially when having guests out of town or out of the country.. always safe bet to come here to taste the asian food!!", "author": "Aristo A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "This place has been around for over 30 years! There is enough seating available but larger groups may have to make a reservation to avoid lining up.\n\nThe duck fried rice and deep fried calamari were quite delicious and worth trying. The rice noddle was quite basic but filling, that's for sure. \n\nThe service was quite attentive.", "author": "Foodie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-21", "description": "Visit this restaurant pretty frequently for lunch, there service is always slow because there is always only 1 server and seems to only be 1 cook.\nWhile the service isn't as fast as it would be in a more traditional restaurant, it can be doable. I visited last Friday with a co-worker and the service was TERRIBLE! \n\nNot only were people whom were seated after we were able to place their orders before we could, they received there food before we did as well. After waiting 30 minutes, I finally asked the waiter what the hold-up was and when we would receive our food. \n\nHe said he would get it right away and instead he began preparing a take-out order. We waited an 10 additional minutes and eventually got up and left without paying for our Thai Iced Teas. \n\nThe food is great for lunch in the area, primarily if you work close by but the limited staffing and ridiculously long wait time ensures that I won't visit again and plan to share the information with fellow coworkers who often visit as well.", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "I've been going to this place since at least the turn of the century . So I'm surprised I haven't done a review all these years. There was a time when they had to close for some remodeling and then they had this weird business schedule which made it hard for me to figure out when they were open. Anyway, they're on a normal and regular schedule now and that's all that matters. In the 18 years I've been going to this place, their food has been always consistently good. The Fried Calamari they serve up at this place is truly.. one of a kind. The crunchy garlicky flavor of the Calamari combined with the salty sweet dipping sauce is a delicious treat. My wife and I always use it as a standard to compare other Calamari dishes and so far, nothing really equals it. Next, the Clay Pot rice. Mmm Mmm Mmm!!! Filled with Bbq Pork, Chinese Sausage, Chicken, and Mushrooms.. my mouth is watering just talking about it. The Pad Thai, Basil Ground Chicken, Praram Beef, and Soft Shell Crab dishes are awesome and an even greater bargain when part of a lunch combo.", "author": "Orlando J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "I don't really write yelp reviews, but my family has been coming here for over 30 years and it is one of my absolute favorite places for clean, consistent, and DELICIOUS unique food. A perfectly smoky pad see ew, luscious duck, and insane pepper garlic shrimp and whole fried fish (pompano) curry!!!! Some of my absolute favorite dishes of my entire life are from here, and I have lived here my whole life and thoroughly enjoyed this city's abundance of amazing food. The people who work here are kind, hard-working, good folks; they are so warm and friendly and attentive. It's not 5 star service, but i'd rather have my food served with a smile than with the pseudo-personal rehearsed bullshit of so many servers in this city. I am over performative eating-I just want a delicious meal served in a cozy environment and in my home, and this place is my #1 for that. Couldn't love this place any more than I do!!!", "author": "Tanya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "An old established Thai Cafe located in the Richmond District of San Francisco, and it serves good old fashioned Thai food. Great for a quick meal or a family or group meal.", "author": "Stephen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "This place was open for dinner on NYE, so yay. \n\nThe server was very kind and attentive, but not annoyingly so. \n\nWe had Pad Thai with chicken that was more moist than I've had before, but had a great flavor. The Thai Fried Rice with shrimp and bbq pork was excellent. The eggplant with ground chicken had such a wonderful savory flavor and was accented with spicy chilis. Lastly, we had the duck and spinach. The spinach was cooked well and had a lovely color. The dish comes with a special chef sauce that was slightly sweet and lovely. The duck was so-so. \n\nOverall, we had a very nice experience.", "author": "Harper C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "This is a hole in the wall place that has good food and service. The waitress is very nice and continues to make sure you are pleased. Whenever I come it's not that busy so I enjoy that especially because I come with my family. Some dishes I recommend are the soft shell crab rolls, tom yum soup, seafood combo, beef cubes, and much more!", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "In San Francisco it's sometimes hard to be impressed by a new restaurant, but tonight I'm definitely impressed. Food was delicious and service was attentive. Definitely coming back!", "author": "Shawna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "OK, this place is a bit of a hole-in-the-wall.  More than a little bit of a hole-in-the wall.  The dining room is very small -- about 12 tables.  The décor is nothing to write home about.  It ain't bad but it is not \"breathtaking\" but more functional.\n\nIf you can get past the experience, the food is very solid.  I go with my dad.  He gets the seafood soup or sometimes the catfish pot.  (If you get the catfish pot, ask them to add veggies -- they can and will add some veggies for a few extra bucks and it really adds depth to the dish.)\n\nI usually get the larb, which is very solid.  I also enjoy the prawns with basil.\n\nThe ingredients are all fresh.  The dishes are well balanced and well prepared.\n\nThe service is friendly.  They are not super fast -- particularly if they are busy -- but the food comes out fast enough.\n\nIt can be a bit of a bear to park in that neighborhood -- so if you can walk or take the bus -- but go!", "author": "Gary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "I had the Curry Duck Noodle Soup :) It was delicious. Tasted exactly as expected and I loved it. :D I thought it was definitely worth the money and the server was very nice and the place is clean and everything. The bathroom was clean too :D Had a great meal and would definitely recommend.", "author": "VeryCherryBerry N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Quick service and friendly staff, the food was very tasty. Flavorful dishes, great portion, no complaints. I will definitely come back.", "author": "Lien C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "We love this place and go with regularity. They are friendly and generous. It can get busy at lunchtime especially when they have groups of families or students. They have a very diverse clientele. I like to listen to try to identify what languages are being spoken. I measure any and all curries against their curry (with green beans and eggplant). It's got a slight sweetness with perfect heat and never heavy.  Their soups and appetizers are elegant and tasty, and presentation is beautiful.  They offer kind of like 5 star food at reasonable prices and with lovely but not over the top atmosphere. It's all family run and grandma is in the kitchen.Try them and enjoy.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "This is one of my favorite Thai restaurants in SF! I LOVE their duck pad sew ew and catfish GP. I don't think duck pad sew ew is a common dish in Thai restaurants so I have nothing to compare it to but I crave this dish all the time. The catfish GP is fried to perfection and the flavoring is amazing. I'm salivating just writing about it. \n\nI've eaten other dishes but these 2 are def my top. Their fried tofu is also really good!! \n\nThe place is pretty clean and service is good. I'd recommend this place for sure!", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Finding authentic Thai anywhere in the states is a pain at times.  This was an accidental find as we were driving to the airport from the Indian consulate's office down the street.  \n\nWhen we got in, they had just opened.  The young lady that greeted us was nice but not overly friendly (which isn't always important).  She told us to pick a table and we sat by the window.  I informed her that we don't have much time and have a flight to catch.  She took our order and we had our food in about 10 minutes.\n\nMy husband got the red vegetarian curry and I had the yellow curry with chicken.  Both our food was amazing!  It was fresh and perfectly spiced (we like spicy).  By the time we were done, the restaurant was packed.  Good sign!\n\nWhen I move back to the area, I will be coming here on regular basis.  Bravo to the Chef!!!", "author": "Diane C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-05", "description": "I liked this little place. Its in a quiet neighborhood that doesn't have the usual San Francisco crowds or tons of options. We just kind of ended up there after a busy day, ravenous.\n\nNo sticky mango rice the day I was there (no good mangoes, they said) but I would try it next time.\n\nWe ordered: the yellow curry, tofu/vegetarian, very good over rice. A fried beef dish, which was basically like a chicken-fried steak with peanut satay-like sauce on the side. A bit heavy, but ok. Also, fried calamari, good and spicy with the sweet chili sauce on the side, and finally, Pad Thai, with shrimp, it was very flavorful and not too sweet, fresh succulent shrimp, lots of noodles, but I missed cilantro, chopped peanuts, and lime that adds so much flavor and freshness. I guess I should have asked, they probably had it. They really should serve it alongside the Pad That without asking.\n\nDelicious, albeit somewhat greasy, Thai food, fast, friendly service and cold water!", "author": "Annmarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "It is a smallish cozy place. The staff is friendly and the environment is clean. But the best thing is their food. It is all good and not too expensive. I totally recommend this little family own un-commercialized little hideaway. Been back many times now that I have discovered this gem.", "author": "Suzy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Great Thai food, got the shrimp garlic noodles for $10. My friend got the the Duck curry noodles ($10) that looked amazing as well. Definitely will come back here. The inside is nice and remodeled with nice tables.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Excellent Satay with peanut sauce and plenty of cucumbers. The kam ka soup was very flavorful and excellent. Quiet place - will come here again!", "author": "Keith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Not a bad spot for some casual Thai food.  Tried this place because the wait at Kaiju was too long.  Pad Thai was good, but they make it with more vinegar than what I'm used to.  Beef cubes were also good, but meat was a bit grissly.  Best dish was a green curry with chicken and green beans.  Chicken satay was a big hit.  \n\nAll in all, pretty good Thai food.  Prices were average for SF dining.", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "One of my favorite go-to restaurants in the city for its convenience and excellent service! My boyfriend and I come here often between classes since it's so close to campus and we have yet to get tired of it. Service is fast on most days and the red-haired waitress is always very attentive and makes sure we're in and out in time for our next class. She's super sweet and I love that she packs our leftovers for us (I would give her 10 stars alone, she's sooo nice).\nAs for the food, we always order the pad see ew and duck fried rice which are both amazing. Seriously, my boyfriend orders pad see ew at every Thai restaurant we go to and he says this one is his favorite; super flavorful without too much grease. I'm not as crazy about pad see ew as he is but I'd have to agree that this one is really good. The duck fried rice with their special sauce is to die for.\nI'd highly recommend trying this place out and I will definitely be coming back here regularly until I leave this city.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "I stumbled upon this place looking for a late night snack. I ordered a simple Pad Thai to go. Nothing could go wrong there right? The portion was tiny, the food was bland, underwhelming, with hints of dish soap. Just what I like in my Pad Thai. \n\nSo okay, all's fine. Disgusting food, and overpriced garbage. Never going back. \n\nBut then I got a little gift at 2 in the morning. The food hit me worse than a master cleanse. The poisonous food thoroughly drained my bowels! If it got worse than the three hours I spent in the bathroom, I would've had to call an ambulance. I'm surprised this place hasn't been shut down for health code violations. I mean dish soap Pad Thai and food poisoning??\n\nDo yourself a favor and pick one of the thousands of other Thai places in the city.", "author": "Dennis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Love duck fried rice.. but parking is sometimes challenging. Place is a bit small. Great that now they have much friendly waitress. They close in the middle of the day between lunch and dinner.", "author": "Julia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "Maybe they have some great dishes, but I haven't found them. I ordered red curry shrimp and it was more like onion soup with a slight curry flavor. The Pad Thai was passable but nothing special. Not many Thai places nearby but that's my last try with this place.", "author": "Edgar W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "duck fried rice. The best in the bay area! (or in the whole wide world?)\nI just cannot order anything else since this is too good to pass, and none in my table is usually willing to give it up either.. so sometimes, everybody just ended up eating the same item, individually. Sharing is not enough  We need to get our own portion. And that includes if I go there with my hubby, we would order 2, one of each of us. so good. Don't forget the sauce though that is important.", "author": "Olivia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-06", "description": "I give it 4 stars for the staffs there are really nice and friendly but as they said they are Thai restaurant and the name of the restaurant is Thai cafe but almost of the food there are not originals Thai dishes the seasoning the way it's cook and the taste are not Thai, it's taste ok but not just right for the type of food that they suppose to be . Well over all it's ok but if you would like to have Thai food I'm not recommended.", "author": "Waan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-21", "description": "I just want to have Thai food, but this restaurant the taste totally not Thai food. It looks like chinese want to try to do Thai food. Im sorry. Im so disappointed. Anyway, inside the restaurant and waitress is so nice.", "author": "Nisita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "I came to this restaurant a month ago with a lot of friends.  We go there late but they still happily served us.  The food was excellent.  Each and every dish was delicious.  My favorite always is the eggplant pork and shrimp dish.  The eggrolls are delicious, too!  We had a coconut curry which was delicious, too.  If you are hungry and want the best Thai Food and service, come to the Thai Cafe!  I have been here numerous times and I have yet to be dissatisfied!  Try the black sticky rice and mango!", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "Food: Really enjoyed the appetizers, not the entree as much. The papaya salad with fried soft-shell crab was delicious (and I don't even like soft-shell crab). The calamari was yummy too. My entree was a lunch special that came with duck and pork and broccoli. The meat wasn't that tender and the flavor was so-so. \n\nService and Ambiance: Both of these were great. We made a reservation for a large party and they took great care of us.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "If you care about what actual ethnicity is making your food, then I suggest you never patronize any Japanese restaurants in the city because they're all pretty much run by Chinese or Koreans.  Maybe the owners of Thai Cafe are ethnic Chinese who grew up in Thailand.  Whatever the case may be, I can overlook \"authenticity\" for taste because their duck fried rice is simply the best with generous amounts of meat. Granted, you may gnaw on pieces of bones and throw it to your dog, à la Asian fob style, but the sweetened MSG-like sauce that goes with the rice is superb.\n\nI also can't get enough of the Catfish GP.  Every time I go there, they already assume I'm getting the catfish because it's my default dish.  I've tried the soups, papaya salad, duck salad, and ground basil chicken lunch special which have all been excellent.\n\nPricey for \"Thai\" with my lunches there averaging about $17.  Small price to pay on days when I need comfort food to make me happy.", "author": "Bailey N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Best Thai take out. Seriously, this place is under-rated. The crispy calamari is SO amazingly good, it's like crack. I don't know what they put in that sauce and the fryer, but I can't eat enough. Pad thai is solid, and I've never had a bad thing on the menu.\n\nI've never actually eaten inside the restaurant, but I order take out a few times a month from them. Seriously though, eat the calamari.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Spent a delightful evening here with my wife. No delay in seating, quick service, tasty and fresh food. Papaya salad, catfish pot, shrimp noodle bowl, followed up with sticky rice with coconut icecream. Yummm!", "author": "Uday W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-08", "description": "What kind of Thai place runs out of Thai Iced Coffee and Fish Cake?!  These menu items weren't available at Thai Cafe even though our party was pretty much the only group in the restaurant for the majority of our time there.  We also got to the restaurant shortly after it opened.  When we asked how long it would take for the coffee to be ready, we were told that it would take 1 hour.  We were in the restaurant for WAY over an hour and the coffee was never ready whenever we asked about it.\n\nAlso, the waitress wasn't exactly the friendliest person.  I don't remember her ever smiling.  Additionally, there was one point where the waitress even pushed up against my younger sister's head...with her boob...  It wasn't as sexy as it may sound.  It was actually quite uncomfortable and awkward yet funny.  The waitress didn't even apologize for the unwanted physical contact.\n\nAnyway, as for the food...I ordered the Pad See Ew with Duck.  I liked the dish but it was a bit too greasy.  I'd eat here again but I wouldn't go out of my way to come to this place.  \n\nThe restaurant is a good place for large groups though.  My party was VERY large and VERY loud and the waitress still let us stay for hours.  I'm pretty sure she hated us though...", "author": "Francesca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "I've been going here (eat in and take out) for over 20 years since I was introduced by an insurance agent.  They are authentic (I lived in Thailand for over a year) and the quality never waivers.  They have a ground chicken and basil dish that I cherish (and no one else has), and their curries are sublime.  The appetizer prawns are also always perfect.  I put them on a par with Royal Thai in San Rafael, which is another reliable favorite.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Do get:\n\nGarlic shrimp noodles- tastes just like shanghainese noodles but sweeter and a little bit more garlicky. Perfect amount of eggs in the noodle.\n\nDuck fried rice- rice stir fried from natural duck fats adds a great flavor to perfectly coat every grain of the jasmine rice. No heavy soy sauce present in the rice.\n\nMinus one star for the small portion sizes. It's just so tasty you would want more!", "author": "Thankie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "I've been eating here for years and I love it! The service is fast and friendly. I am a lover of Thai food and this restaurant definitely serves some excellent dishes. My favorites are the fried Calamari, green beans with oyster sauce and garlic prawns with noodles. The food is always hot and fresh!", "author": "Maya W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "Worst thai food I ever had! Totally bland, doesn't taste like that food at all I had the thai bail chicken, most common and can't go wrong dish. I complained to the waitress and she just ignore me, take it or leave it no way they're going to offer you something else. I didn't eat it paid the minimum and left. There's so many thai restaurants in the city so if I were you, go elsewhere.", "author": "RC L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Thai Cafe is always be my to-go place whenever I am craving for fried rice. Their duck fried rice is really delicious especially when you pour a little bit (maybe more than a little bit) of their special sauce. YUMMMM :) \n\nI also always order an additional item, Cat Fish GP. I am not sure what GP stands for, but it is basically a fried catfish with basils, onion and pepper, which also taste really good. It is a perfect combo with the duck fried rice. \n\nI have tried several other food in their restaurant, such as their calamari, tofu tod and as well their claypot. It's good too. But, I rather stick with my usual must have order , which is cat fish GP and their duck friend rice. And for the calamari and claypot, I recommend to have it at Le Soleil, few blocks away.\n\nI have no comment for the service, I have never had very pleasant or very bad experience with that. so i will give 2.5/5 for the service.\n\nThey are closed on Tuesday like the other yummy restaurants.", "author": "Ulrica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "I came across this place while I was early meeting family.  Dropped in for a drink and ended up eating a bit too.  It is shockingly cheap!  I have no idea how they can charge such low prices but the food is worth it too.  Definitely a deal!  Try their chicken wings!", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "Since this place is so close to where I live, this is one of my usual Thai craving area. My favorite thing in this restaurant has to be their Thai Fried Rice and Garlic Shrimp Noodle. My partner absolutely loves their Beef Cube. Their lunch menu is also quite simple and affordable. The service is also really nice. Besides the mentioned three, there wasn't anything else on the menu that was really all that great for me. I still go there regularly, but only for the big 3.", "author": "Sudha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-06", "description": "I was hungover as all hell and the menu looked good. Better yet the place wasn't busy so I knew I could grub up pretty quickly and my pounding dome was saying that would be a good call.\n\nThis was one of those times I read up on the menu, looked around, and was banking on some 4 or 5 star food. I dunno, everything looked legit, I was stoked.\n\nSo I order up the lunch plate special, very good deal, yet it was just mehhhh. Execution problems if you ask me. Coconut based curries should be relatively thick, but here the dish had the ingredients swimming in a curry sauce as thin as water. Same with cucumber salad, the onions/cucumber slices were actually floating in the vinegar.\n\nIt was just OK... The cucumber salad was missing something as was the curry... but still OK. Service was very nice and I really like the setup inside. Small so you get that intimate vibe, it was staffed by one server just fine. Food wise though it was lacking just a touch, but at such a cheap price for a lunch plate I can't complain too much.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Not bad for a local spot for lunch. Had the shrimp pad Thai and can't complain that they load it with shrimp.. That was a big plus... Definitely would go back.", "author": "Keeks P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "We had lunch at this Thai place, it doesn't not look like Thai people own it. \nFoods r not good at all.  When we walked in during lunch hours, it was quiet,  and we knew it. unhappy server with an attitude,  don't wast your money, grabs a sandwich somewhere els is better.", "author": "Ileen R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "Duck Spinach is really Chinese roast duck probably from Clement BBQ but with a Thai sauce poured on it. Curry fried rice was too dry and didn't taste any curry. Spicy seafood was so-so. Disappointed with food here.", "author": "Will L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "After eating here many times, I'm not exactly what keeps me coming back.  I wouldn't say the food knocks your socks off, I definitely wouldn't say the customer service is something to rave about, and well, I just don't know.\n\nBut what I do know is that everything here I have tried has me wanting to come back for more.  I'm not sure if there is such thing as Thai comfort food, but if there is, this is the place to get it.\n\nGood portion size, great prices, and a satisfied stomach every time.\n\nThis place isn't fancy by any means, but once you come here, you'll be back for more!\n\nWhen I figure out exactly why I keep going back, i'll let you know...until then, you'll just have to try it for yourself =)\n\nHappy Eating!", "author": "Bradley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "I always get the same dish at Thai restaurants. I get the chicken pad thai &other one they have here is so good! Probably one of the better ones that I've ever tasted!\n\nTheir staff is nice, but the way they answer their phone could be a bit clearer &nicer.\n\nGET THE CALAMARI!!!! It's the bomb dot com! You won't regret it.", "author": "Sabrina S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-05", "description": "It's generally a bad sign for a Thai restaurant when both servers are speaking Chinese. Perhaps it's just a pet peeve of mine, since I don't actually know if the restaurant is owned and run by Thai or Chinese people. \n\nAs for the food I was not terribly impressed. My veggie pad thai was passable, but was a bit overcooked. \n\nI probably won't be back.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "The food was alright (not amazing) but the service was terrible. After I ordered, I was on my phone and the waitress yelled at me and said \"excuse me\" while I was sitting down at the table. She was trying to put the food down on the table, but it wasn't like I was hogging the table. We were a table of around 10 people and she just had to place it down at the edge of the table when there was a spot to my right that was open. This is seriously one of the few times I wanted to slam down my plate and walk out of the restaurant. If it wasn't for the 18% tip added to the bill this restaurant would not have gotten a penny from me. Learn some manners lady.", "author": "Edwin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "My favorites: ground chicken, duck fried rice, eggplant with shrimp and calamari. Better than OSHA which is over priced.", "author": "Dom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Thai Cafe's Duck fried rice is simply the best in the city. The ultimate reason is that because they have an optional secret sauce that enhance the flavor of the dish and makes it a little sweet. Another memorable dish is the Cat Fish GP. I always a fan of fish fillet and this restaurant serves one of the best out there.", "author": "Evander J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "Another favorite lunch spot! \n\nIt's close by work, always seems to have parking close by and offers excellent lunch combo specials...served up fast and hot!\n\nI'm a huge fan of the ground chicken and green beans, and the red curry.  I also like the papaya salad.\n\nService is fast...in and out and back to work.", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "This place has excellent duck fried rice and calamari! From the outside, it looks like a hole in the wall, but the food is wow! Worth a stop and try!", "author": "Tuan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "Are you a fan of duck fried rice? Your search ends here my friend. Thai cafe has hands down, the best duck fried rice I've ever had. As per the recommendation of my friend, you will want to moderately douse the sweet fish sauce onto the fried rice once it is brought out. It truly elevates the dish.\n\nThe blend of duck fat, perfectly cooked rice, appropriate seasoning and succulent meat will leave your mouth watering, and wondering, why it took so long to find duck fried rice this good.\n\nOther dishes on the menu are pretty good, actually above average for Thai, but that fried rice man... that fried rice.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-22", "description": "I randomly felt like Thai food recently so I looked some places up on yelp, and turns out this place is less than 5 minutes from my house! \n\nI got takeout and decided to order sweet & sour pineapple w/beef. It was good, but I wish it had a bit more flavor. Besides the pineapple & beef it also had onions & tomatoes in it. I thought both the meat  & vegetables were a little overcooked, but overall it was a pretty good dish. The prices are reasonable and they give you quite a bit of food. I got my meal w/brown rice ($1.50 extra...that's for all rice, not just brown), and as weird as it might be to point out, the rice was fantastic! Some might say rice is rice, but seriously that was some good brown rice! \n\nSince I got takeout, I didn't really experience the service at Thai Cafe, but the place itself is tiny. I'm not sure if this place does most of it's business on takeout, but there wasn't a single person dining in when I came to pick up my food (there was a couple other people picking up takeout). The woman who helped me though seemed nice enough. \n\nSince this place is close to my house and I love Thai food, I'll be back. I'm interested in seeing if other items on the menu are more flavorful.", "author": "George A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "My family best Thai food in the city. Crispy calamari, duck fried rice, and beef tube. Highly Recommended", "author": "Tee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "This is my favorite Thai place at the moment. My previous favorite spot was a place called Racha Thai, which closed many many moons ago. I loved that place so much because of a hand full of dishes, the main one being the roast duck. They made it perfect, and the sauce they served with it was delish (sweet thai soy sauce with minced peppers). Since then I couldn't find another Thai place that came close.\n\nThis place is my favorite Thai place currently for one main reason....the roast duck. Nice big pieces that are juicy. It can be a miss at times, as I had the duck served to me slightly dry a couple of times. The other dishes here are at least average. I liked the Catfish GP (wish it was a little softer though), and the special clay pot was good. \n\nAll and all, a solid Thai restaurant. I give the roast duck four stars (three and a half minus the roast duck). Give this place a try!\n\nPaolo says: If any of you Yelpers know of a great spot for great Thai Roast Duck, please shoot me a message! If it's awesomely awesome...then beers on me!", "author": "Paolo V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "Oh Thai Cafe, how I love thee! Let's count the ways... \nYour Pad Sew with BBQ pork is a full-blown addiction I can't do without.\nYour Spicy Peanut Sauce is so deliciously peanut-y it's cause to shout. \nThe Green Beans and Fungus? The finest among us. \nAnd the curries - red, yellow and green - are what make my heart sing! \nThe Papaya Salad is by far the best I've had, not to mention a certain \"Pad.\" \nThe Pad Thai is tasty, without a doubt, but different than what other places tout. \nSo enough of the rhymes, just let it be understood: Thai Cafe is unbelievably good.", "author": "Dana O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "Awesome lemongrass tofu and excellent service!  Good eats!", "author": "Connie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-10", "description": "I live nearby and went there for a weekday lunch. Understandably, I was the only customer there. The overpriced food is flavorless and the cold waitress acted like she didn't want me there. I won't be going back.", "author": "Pam J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "I am a fan of a Thai Cafe but just got my first disappointing dish from them.  Pad Thai, garlic noodles, pad seew, seafood combo, sticky rice balls, eggplant all good. Egg fried rice with roast duck - a disappointment. The rice was greasy and the picture posted here had me psyched to get a huge portion on duck, but not so. Only six small pieces. :-(", "author": "Heather G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "I live 4 blocks a way and eat here at least 2-3x a month. Nice simple atmosphere, tasty food and prices you will not find anywhere else in SF. My favorite dish is the mushroom and baby corn with chicken and light spice over (real) brown rice.", "author": "David G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-08", "description": "I concur with the others about this place being a Thai wannabe restaurant that's actually Chinese run. Food was gross, flavorless, experienced bad service and the selection is sparse. I'm only giving it an extra star because it's local and I tried to like it.", "author": "Natasha C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-05", "description": "I first went to this place in 1998, my son was a newborn, and my wife's friend was in town from Jakarta.  This place was recommended to her by friends 8500 miles away.  And it was a great meal.  \n\nThat was a long time ago.  \n\nThis is just chinese food now, and very lousy chinese food.  The quality of the meat in the beef dishes was very poor, the dishes were almost inedible.  The tomyum soup was simply horrible - tom yum with shrimp - should be an event....no, should not have ordered it.\n\nService:  I don't even want to start.  I am trying not to use bad language anymore, but the women who served us made me angry enough, that I want to call her names.  I won't, but I want to.\n\nStay away from this place.  It is currently an insult to the kind of establishment it once was.", "author": "Lou D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-01", "description": "Very disappointing. This is not a real Thai restaurant. It's a tired looking joint operated by Chinese staff that serves poor imitations of Thai food. The Tom Kha Gai soup was sickly sweet and contained pineapple, a weird addition never found in a proper version of this dish. Beef salad was way off base, tasted bad. On a Friday night, we were the only diners. No one there spoke Thai.\n\nWould never go back. Do yourself a favor and avoid this place.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "I lovee this placee! We go here often . We would always order either the \"tofu top\" or the \"fishcakes\" ITS SO GOOD. U could tell they made it themselves. And i love the hot and sour noodle soup! ITS SO GOOD! LIKE OMG I LOVE IT! Andd i love the thai ice tea . And the service is good too. Haha. I also really like the ground chicken with rice AND the roast duck fried rice haha. I swear ! Ive been coming here for so many years now and they have so many good foooood!", "author": "N S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Went tonight.  Had the duck fried rice and the garlic noodles.  The garlic noodles were really really good.  no need to go to b-star when this place has just as good garlic noodles.  \nAs for the duck fried rice - it was good too.  If I hadn't been spoiled with going to king of thai/kings thai since 2005 I'd say that it's an awesome dish.  But King of Thai/kings thai definitely beats theirs.  However, only the original king's thai on eighth, the 3rd street location isn't as good - anyway... \n\ni want to go back for their gra prao and squid.  Definitely worth going to\n\n5 stars for garlic noodles\n4 stars for duck friend rice\n\nround up to five for the fried banana and the HUMONGOUS scoop of coconut ice cream.", "author": "Adrian E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-14", "description": "I've come here on several occasions, both for dining and for take out. and what i like about them is that they are consistent!\n\nfood is always on par. speediness and service is concise and prices are fair. my favorite thing to get here is the duck friend rice, but my coworkers rave about their garlic noodle, which is something i probably shouldnt eat at lunch. lol but i'll definitely do a take out order before i head home one day!", "author": "amelia g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "Do not be turned off by the generic name. This place serves great Thai food. Or maybe they're just being modest. If that's the case, well played.\n\nMy favorite dish by far is the ground basil chicken. I've been ordering it since I was young, and trust me, even if you've been to a ton of Thai restaurants, you haven't had basil chicken like this. Bold statement, I know, but I stand by it. Make sure to ask them to make it spicier. Other favorites are the duck fried rice and the catfish gp.\n\nIt's easy to get to, parking is easy, and the place is rarely full, so you won't have to worry about any of that. My only (tiny) gripe is that it's a bit overpriced, but if this is what it takes for my favorite Thai place to stay open, then so be it! Feel free to go to King of Thai for a quick fix, but if you have a fever, and the only prescription is more Thai food, come here.", "author": "Stan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-26", "description": "Stir fry noodles are well made - not oily, great taste, texture of noodles were perfect.  The rest of the dishes were just average.\n\nOnly downside there is only 1 server for the 5-6 tables for groups of 4-5 or more, so the food was coming out really slow.  We waited 20-25 minutes before getting our first dish, the rest came out one after another within 5 minutes of each other.", "author": "Ju D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-16", "description": "Came here the other night. It's a really small hole in the wall restaurant. Can't say anything fabulous about the place. It's mediocre The only good thing was I was able to roll up in my car and park right out in front. Not many places in the City you could do that. Most places require you to circle the block for 45 minutes, get into a fist fight with some hipster, knock his teeth out and take his parking spot by force. Anyways, this place was not stressful which was the only redeeming feature of going here. \n\nIf you like Thai food served by Chinese people, this is your jam. That's right. These people aren't even Thai people. There was only 2 people working here while I was there. 2 people. I guess it's how you do it when minimum wage is pushing $11.00 per hour and Obama and Ed Lee are asking to raise it to $15 dollars per hour. \n\nThe cucumber salad has green food coloring in it. Yes, it does. I ordered one of these and it had sugar and green food coloring soaking in it. Really sickening. The beef and broccoli plate was really the only thing I could eat..but of course I could have gotten that anywhere else for about $7 dollars. This place is not very enjoyable. The food is a chore and really not special in any sense of the word. If you're out of choices, this place is doable but definitely not my first choice. \n\nThose per hour wage numbers are going to crush the service industry. Don't think many people have thought this through enough. Anyways, what can we expect? Bad service that's what. Many places will shut down and close. Others will have 2 workers working in the entire restaurant..so you will wait..and wait and wait for your food..and the bill will go up incrementally. Food prices will soon skyrocket thanks to rising wages for the food service industry. Mediocre food, lousy service and high prices. Welcome to San Francisco.", "author": "Tiffany R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Very nice place but a little small, I ordered the kang curry with side soup and spring roll. The food was delicious,chock of fresh vegetables  and they offered brown rice at no extra charge! The service was outstanding, and when you ask for the food to be thai spicy, it actually was nice and spicy! The bathroom was super clean, as was the rest of the premises. They really know what they are doing!", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "If you love Thai food then this is the perfect place to go to because the food is great and the service is fast and there half Thai cider and ice tea drink is amazing and I love going here for lunch cause they have there amazing hot and sour noodle soup", "author": "Julie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "So I was meeting a friend for dinner here before headind downtown for drinks (keep in mind I'm coming from 15 miles away).  It's located in a place where parking was easily found on a Saturday night.  From the outside it has a modest appearance near a BevMo.  You enter and are struck with the decor of a homely Thai home.  Quite plain.  In fact missing a few decorations on the shelves of an entire wall mounted display case with dusty shelves.\n\nThe menu is typical but I felt at a glance not as typical as other mainstream Thai restaurants...like a section on curries...nope, not here.\n\nThis was my 1st meal of the day so I was READY to eat anything...\n\nSo we started with fried calamari because that is my weakness and I try it everywhere I go.  So I have a very wide range to compare this too tonight.  It came out looking promising.  Many ringlets with a medium batter piled next to a dipping sauce.  I started with a plain piece to get a sense of the freshness.  The squid was chewy and probably frozen.  The batter was at least not soggy.  However, they were over-seasoned with salt.  Then the dipping sauce.  An Asian blend of a sweet and sour-esque with fish sauce.  Way TOO sweet.  Combining the over-salted flavour and you have a tart mouthful of....[fill in the blank].  I had to wash it down with 2 glasses of water and Thai tea.\n\nOur entrees were the Seafood Combo.  A hodge podge of mixed crap stir-fried together.  Not very fresh tasting and kind of dry actually.  Our 2nd entree was Pad Phem with chicken.  Good on the spicy meter because I do like spicy foods (the lingering esophageal smoldering burn was left in my throat a few hours later even after a couple beers).  The chicken was tender and reasonable.\n\nAll in all, I would have to say it's a local homecooked-like meal.  Nothing fancy or sophisticated.  If you live in the area or this is a middle point as a meet-up, it is fine.  Drive across the Bay Bridge for?....not so much.  But I will say the price was reasonable.  All the aforementioned dishes cost us 40USD.", "author": "Cary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "My wife and I have a new ritual,after we workout we go to the Thai Cafe and we always order three dishes and try to make them different from anything we've ordered b/4. The food is always excellent,the service fast and the people are very nice and never rude.\nWe love Thai food and this,in our opinion,is great food at a very reasonable price. \nAlso,they will make any dish to your taste as far as how spicy you would like it. \nSo,for good food at a good price & good service in a clean comfortable place the Thai Cafe is it.", "author": "Gerard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Nothing fance. Yummy lunch special. They use real Thai brown rice, which is hella better than the American equivalent. The clay pot was plentiful and quite tasty! If in the area for lunch, a great spot.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "I don't think it's a good idea to have Thai food while you are on diet, they use so much sugar! But diet doesn't start until tomorrow right? \n\nTheir fried calamari is delicious~ very light breading, yet crispy and with a little hint of spice. I also love their Tom Yum soup, one of the best I had in town. Duck fried rice is good too. But everything is very sweet. I hate my Papaya salad sweet, I wish it was a spicier and more citrus-y. \n\nOverall, good experience. Not a crowded spot, and easy to get to. Service is always good.", "author": "Marlis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "This is the best Thai food I have ever had.  Let me put it this way, I had to unfasten my belt for the first time ever at a restaurant because I did NOT want to stop eating.\n\nGo here now.", "author": "Andreas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "From the outside, you would never guess that this place is so darn cute inside!  Everyone loved their dishes, especially me.  The Roast Duck is fantastic!! I love duck so, so much and this is the best Roast Duck I have had at a Thai restaurant.  \nService was a little slow, so minus 1 star.", "author": "Jessyca M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-06", "description": "Not laptop friendly.\n\nIt's not that kind of cafe. Instead it's five spice chicken friendly.\n\nWhich didn't taste very spiced. At least nothing unique. Reminded me of something I would make if I left the oven on too long. Wish I could offer more praise.\n\nFor $10 plus tax the portion was reasonable. Needed a side or something mixed in.\n\nService was quick and friendly. Interior clean with modern touches. Really liked the lights hanging from the ceiling. Those get three stars.\n\nThis cafe overall unfortunately gets less.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-20", "description": "My favorite Thai food in SF. \n\nFresh ingredients, cooking with care, friendly service. Particularly good veggie offerings.  I also like their duck dishes.\n\nA favorite place to bring out of town guests.", "author": "E F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "I'm always on the look out for a good \"hole in the wall\" Thai restaurant and Thai Cafe impressed far beyond my expectations. The restaurant is small and casual but the food and service is exceptional. \n\nBetween the two of us we ordered 3 dishes for dinner and had some to take home too. We had the Tom Yum soup with chicken - which was really superb and different since they added pineapple to the recipe. If you like Tom Yum - you should definitely try it! The Papaya salad also had a little different flavor than what I've had before but the prawns are sliced thin which ensures one in every bite! To top it off we had the Spicy Eggplant with brown rice. That was probably one of the best thai eggplant dishes I've ever had. The dish includes prawns and chicken (or maybe pork?) and is extremely flavorful and breathtaking! \n\nI don't even live in the neighborhood but I plan on making the trip back over and over and over again!", "author": "Roya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "i love this place. they have the best coconut chicken soup, with tomatoes..yumm. The service is great. Its clean, their pad thai is super good!! Its mine and my husbands go to place for thai food.", "author": "sofia r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-24", "description": "I am originally from Orange County, but for some reason, a lot of my Indonesian friends know Thai Cafe in San Fransisco. So when I visit SF with a group of friends, my first impression is that of a cafe set-up, not very well-lit, and very quiet.\n\nIn the beginning, I didn't think much at first. Everyone including myself ordered the famous duck fried rice. It didn't take too long for the dish to come out (maybe because there's only 2 other table other than us). The food was excellent and very tasty. The sauce that came with the dish enhanced the rice and the duck meat. Overall, the food was excellent eventhough the place didn't support it.\n\nNow, everytime I come visit San Fransisco, I HAVE to go to Thai Cafe and get the Duck Fried rice. I don't know if it's a coincidence or not, but evertime I go there, I alwasy see at least 1 other table of indonesian group.", "author": "Daniel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "My husband frequented this spot a few years ago.  He was craving the special claypot, hoping it was as delicious and enticing as it was back in the day.  Although the place is quaint and had charm, the food lacked everything THAI!  I had the duck and bbq noodle soup... it was like pho noodles in wonton soup.  The claypot.... it tasted like any claypot from Chinese restaurants.  Well, if I wanted Chinese food, I would have gone to a Chinese restaurant.  \n\nI will not be eating here again.", "author": "Yee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "So I definitely love this place! I have been going to this restaurant since I was a child! We always order the same thing\n\n**spicy coconut soup\n**Spicy beef salad\n**vegetable spring rolls\n**Highway noodles with a gravy sauce, beef, and broccoli (I forgot the actual name of it)\n** Thai Ice Tea - my ultimate favorite~\n\nAll of these dishes are a MUST! The taste is delicious. The noodle dish is one of my favorites. It has just the right amount of gravy sauce, and just the right amount of beef and broccoli. The sauce taste excellent. The spicy beef salad is sooooo good! I would def. recommend going here for lunch or dinner. I always order for takeout so I can eat in the comfort of my home!", "author": "kathleen l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-12", "description": "The text on the sign for Thai Cafe, under the name of the restaurant, reads: \"THE BEST OF THAI FOOD\"\n\nThis is a lie.  Likely not intentionally, but sadly true.  I used to live up the street from this place and once had a hankering for Thai food.  I recalled seeing that Thai Cafe was at the end of my street so I called them up, ordered Pad Thai, and strolled on down.\n\nIts pretty hard to mess up Pad Thai (at a Thai restaurant- in my own kitchen it is more or less expected).  I had never met a Pad Thai that I didn't like (with the exception of those laced with cilantro- WHO DOES THAT?!?!?), but this was a disaster.  The chicken was of a poor quality and I could hardly bring myself to eat it.  The noodles were dry, AND I was not provided with any lemon or lime.\n\nThe people there, however, were very nice, so that has gained Thai Cafe an extra star.  I have since moved from this neighborhood and have better quality Pad Thai at my disposal (what up, Regent Thai??).", "author": "Nora S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-06", "description": "I loved this place when I was attending USF.  Decided to go back after being away for more than a decade, the claypot was good, but wasn't like i remembered.  Don't get me wrong, it was still good, but missing something.  The waitress was not the friendliest.  Most likely under new ownership or management. but the restaurant was definitely upgraded from the last time I was there.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-19", "description": "Okay. It's NOT THE BEST, but it's still good.. especially because it's so CHEAP.\nThey've got this great deal on lunch specials (served daily!) for $9.95. You pick a rice plate dish and it comes with 2 shrimp rolls and hot and sour soup. You also can still order just the rice plate itself for however much it costs. \n\nI had the spicy red curry that comes with eggplant, green beans, onions and for meat I picked beef. I shouldn't have gotten meat because I don't even like meat with my curry. Oh well. The hot and sour soup is tom yum I believe. It's not that sour, and the spicy red curry wasn't that spicy. As a matter of fact, I don't even think it was red...\nNonetheless, it was still good...", "author": "Susy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-31", "description": "Okay, so came here coz hubby wanted to try their Duck Fried Rice (supposedly super good)....NOT!!!! It was good, but not super duper. It tastes the same as any other duck fried rice (the cheaper ones!). In my opinion, their prices are higher than average Thai restaurant. So will I go back? The answer is NO. Btw, I ended up getting the Egg Fried Rice with Roasted Duck (again, it's nothing special).", "author": "Lovetoeat A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Tom Yum Soup - delicious (has pineapple which is a great twist)\nPapaya Salad - perfect\nEggplant dish - amazing!\n\nPrice - really good!\nService - very friendly and helpful\n\nI recommend this place to anyone who loves Thai food.  Its good for a weekday night when you just don't feel like cooking, and don't want to spend too much money.", "author": "Graham D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "I love this place.  I have been coming to Thai Cafe for over a decade. The food is always good and consistent.  Great service and reasonable price.  I come with my family like once a week.  We usually order the combination clay pot, ground chicken and squid with basil leaves, tofu pod, pork chop, garlic noodles with prawns and many more.", "author": "Monique N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "I went to this place with a good friend of mine.  We were skeptical when entering the restaurant because the entrance is a little strange.  But everything got better from there! The waitress was very welcoming at all times and always checked if everything was alright and refilled our teas and waters. The food (soup, noodles and rice dish) were surprisingly good and we both agreed that this is the best Thai place we had ever eaten at.\n\nYou won't be disappointed.", "author": "Annemarie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-18", "description": "Been here before and liked it so we decided to go again (we had flown in from Hawaii the night before). It was a liitle after 3 when we got there. They stop serving at 3:30. My husband and daughter went in while I fed the parking meter. Soon after, they came out and said we could only get takeout. WTF!? There were still people eating in there! Seriously? Who does that?? Since we had an hour on the meter, we spent our $$ at another area bu$ine$$ that deserved it.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "One of my favorite restaurants! I've been coming here with my family since I was a kid, and now that I'm older, I bring my friends. The BONELESS roast duck is great, as well as the garlic noodles and fried calamari (which probably has crack in it because it is so addicting!) The prices are high for the portion size, so this is more of a special occasion restaurant for me. It is small, so if you have a big group, and it's busy, you'll have to wait a little bit. Parking can be difficult, because it is on Geary St, which is busy. Service isn't terrible or extraordinary. Overall, if you eat here, expect to be coming back again for the great tasting food.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "A low-key Thai restaurant with great food! I get take out from there 2-3 times a month. I recommend the catfish GP and the dry pan fried string beans.", "author": "Hirokazu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "Lunch specials are great! Ground chicken is good...", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "I used to go here way back, early 2000 when it was still ran by THAI people. 10 years forward, my friend invited me to eat here again. Menu are pretty much the same. They passed down the recipe to the new Chinese owner. As you know, same recipe won't taste the same if it's make by different hands. Just like gardening. I wouldn't care much about the rest of the items. This place was once famous for their DUCK FRIED RICE, FRIED CALAMARI and TOFU TOD!!!! Papaya Salad is not bad either, but I've had good ones from other restaurants. Do not bother to try other stuff until you tried those three items that I mentioned. Other Thai places do not serve the tasty duck fried rice like them. Although yes, back then was amazingly good. Now, still good.", "author": "Clemencia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "One of my Favorite Thai restaurants in the city. I always order the same things; the pad Thai and their green beans,tofu and mushroom dish and they're always delicious.   they do take a little while to bring out the food but it's fresh  so i don't mind. My only concern is that  that they dont do delivery at much of a distance seeing that i live in the outer Richmond and this restaurant is located in the inner Richmond  and they say that I'm too far to deliver...so unfortunately the delivery service needs a little work.", "author": "V L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-30", "description": "Ok, so after venturing out and trying things on the menu whose veganness I was afraid it would be difficult to navigate, I was rewarded (or, \"shown up\" I believe is the more accurate term) with a few much tastier entrees than the one I had been ordering over and over again. Also, the staff member answering the phone to take my order has been much more accommodating recently. \n\nThe thing is, though, if you're in the neighborhood and in the mood for some saucey-tofuy-vegetabley goodness, might as well just walk the extra few blocks to clement, no? I remind that I work directly across the street from this place and am a Very Busy Person (ahemlazy). Oh, also, I know this is SOP for lots of places, but they close for a couple hours in the afternoon which, frankly, is just a straight up pain in the ass. How much money could you possibly be losing by staying open 3:30-5:30? Don't other people in the world besides myself eat at that time? So what if I work til 5 and often take lunch at 4. That's my business, Thai Cafe, and you should be there to accommodate my semi-abnormal eating habits. Gaaaaawd.", "author": "Devin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "My favorite Thai Restaurant in San Francisco! I love Thai Cafe. \nEven though its more expensive than some thai restaurants, they have the best pad see ew with beef. It's not oily and it's always served with the right amount of heat.  Oh, and their duck fried rice beats everything. I don't eat duck, but this dish is an exception! \nTom Yang Goong- YUM. \nTheir thai ice tea is a little bit too sweet for me but some of my friends love it. \nThis is the restaurant that I recommend all my friends when they're visiting SF! Really worth it!", "author": "Tessa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "the best squid salad ive ever had at any thai restaurant.\nfreshly made and spicy sweet.perfectly cooked squid.\nthe clay pot is my favorite meal and they dont skimp on the meats.\nthe rice here doesnt look all beat up and smashed like it was leftover from yesterday like some other places.\nplace is looking a little run down so if they spruce it up a little they get 5 stars.", "author": "FLICK R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-17", "description": "I went here because my friend recommended their duck fried rice. Ha! It was alright.. I was expecting something good. The waitress was really nice though.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-05", "description": "I am actually not a big fan of thai food my friends and I came here because they like it and they chose this place nothing about this place really stood out and nothing really did not work so well, I had the duck noodles soup and that seemed decent nothing to go flock there tomorrow for, but if my friends want to eat there again and I guess I don't exactly object", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-21", "description": "pics - http://www.yummycrave.com/2010/04/i-left-my-tummy-in-san-francisco.html\n\nWith too much food already inside my tank, I feel like dinner at Thai Cafe wasn't enjoyable as usual. My taste buds were numb and all the food taste was just okay. I remembered the last time we ate that duck fried rice was so appetizing and finished so quickly, this time it tasted bland and leftovers remained on the plate. The calamari used to be crunchy and has tangy flavors, somehow become too salty and not so crispy. Either we ate too much earlier or the food was inconsistent, this was the least memorable cuisines of my SF trip.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "Thai Cafe is a small and cozy go-to place for Thai food. It doesn't seem to get too busy around dinner time, and it's a good place to have dinner for two. I wouldn't suggest going to Thai Cafe in large groups.\n\nThe menu is quite selective, but nothing too special. I got the Pad Sew Yew with chicken. Their portions are a bit on the small side, given that the prices are a little more expensive compared to other Thai restaurants. However, the flavor is distinct and you can tell the food is authentic. My Pad Sew Yew wasn't over-the-top greasy for once, and the chicken was really tender and flavorful. I'd definitely re-visit Thai Cafe again.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-13", "description": "This place was so delicious. Great prices too. It is a whole in the wall but the interior is pretty. Great service , very attentive and the owner even came to say hello to us. If I lived in the city I would definitely come back.", "author": "Hellen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "The duck fried rice was the best!! Make sure to use the sauce from the squeeze bottle.", "author": "Johann G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "This place is delicious! Huge portions, great service, our waitress was awesome! Very nice decor and very welcoming. Would eat here again!", "author": "Janet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "As mentioned by lots of yelpers, the duck fried rice is flavorful and yummy. I've ordered this dish countless of time. Calamari is also pretty good. \n\nI've never really compelled to try other dishes simply because I'm already hooked on the duck fried rice and too lazy to order anything else. \n\nDuck fried rice for the win!", "author": "tee w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-24", "description": "Been coming here since I was a kid. LOVE their clay pot rice - flavorful rice cooked in a clay pot with Chinese sausage, chicken, mushrooms and shrimp. Yum! My favorite appy is the fish cakes. Hubby loves the red curry with duck and the duck with spinach. The duck fried rice is also good. Not a fan of the angel wings, but that's probably the only bad dish I've had there. Would've given it 5 stars if their service was a little friendlier.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "Never fails to come here for the duck fried rice each time i go SF :))  \n\ncouple times we drove up from LA just to have the duck fried rice and came back the same evening hooooooo i love it!!!", "author": "Harry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "Thai Cafe is a great place for lunch, the curry has been a constant disappointment, so I recommend sticking to the duck and the eggplant dishes here, they are fantastic.  Oddly, the lunch portions were larger than the dinner portions the few times I've been here.  The decor is nice, the service is passable.  Stick to the recommended dishes and you'll have a great meal.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-06", "description": "Came here today around 1pm and was turned down. Waitress was rude!!!! We walked in and the waitress walked by with a mugging face and said \"we're closed\". Seriously your sign says open and people were eating inside?!? We also looked at their opening and closimg sign for Monday and it says 9:00am-3:30pm. We thought it was just us but they also turned down people who came in after us as well. What kind of business is this??! NEVER GOING BACK", "author": "Linda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Two amazing things at this restaurant: duck fried rice and fried calamari. I always wonder what is the secret recipe to that insanely delicious sauce for the duck fried rice.", "author": "Wil P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "I really like this place. A small cafe, clean, good service, fresh ingredients (which addresses another reviewer's question about how a restaurant could possibly run out of a dish), and tasty food. A lot of medicos from nearby hospitals eat there and unlike many Thai restaurants they are open through an extended lunch time. High quality, savory food.", "author": "Don m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-26", "description": "When you are here, just get the duck fried rice to go. That dish is really good here. Everything else is expensive and not that good anyway.", "author": "July N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-25", "description": "First impression of this place is that it's just ok thai food. I've had better. I went here with my mom one night for dinner, cause it's close to home. It was nicely decorated, small, almost empty (except for us & one other large party), and had great service.\nI thought my dish (Curry Fried Rice) was great, but not going on my list of favorites. My mom, however, who gets Pad Thai at every thai place she goes to, hated her Pad Thai and said it tasted bbqish instead of peanuty, and that it was the worst she's ever had. I tried it and liked it, although it did taste a little different than other Pad Thai I've had.\n\nOverall, I liked the atmosphere and the service a lot, but the food wasn't spectacular. They are very close to my house though, so I can definitely see myself ordering lots of take-out from them in the future.", "author": "Erika B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "Very good Thai food, about average for San Francisco.  Service was quick and food came out relatively quickly.  Good place for a low key lunch or dinner.", "author": "Annabelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "Great little Thai food place near the Inner Richmond.  The food and service are good, not great, but for the price you can't beat it.  I highly recommend the Pad Se Eww", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-03", "description": "Been coming here on and off for the last ten years.  Popped in with a friend for a late lunch noticed that the menu looked different from the last time I had been there which was a while ago.  The decor and menu looked a lot nicer than I remembered it being.  Anyway, I was happy to see that my favorite dish was still on there.  In the olden days, it used to be listed as Pad Ka Prow...ground chicken with basil and mint, but now it's listed as just Ground Chicken with a more detailed description beneath.  For some reason, this is the one dish that I have consistently craved and ordered every time I come here.\n\nI've had this dish elsewhere and there are other delicious versions out there, but everyone else makes it sweeter and more oily.  The version here is not very oily and is more dry than what you normally get in other Thai places...some might even say it's too dry.  However, taste is subjective and for me, I have always loved the way Thai Cafe makes it.\n\nI noticed that there is now a lunch special that they call a Set Meal for only $10.95 which includes entree, choice of soup, and vegetable or seafood spring roll (egg roll?).  When the food came out, I was happy...the presentation was nice, the portions ample, and the food was good.  I enjoyed the ground chicken, the sweet/spicy vegetable soup, and the two spring rolls.  Not bad at all. Although I didn't have any, the portions for the roast duck looked pretty good too.\n\nYears ago, there were always the same two ladies working the front desk there.  One was always happy, smiling, and nice, while the other was always the exact opposite.  I think she was the one that turned me off to this place over the years.  Not sure if it's true, but I was told by my friend that the owner changed a while ago.\n\nAnyway, I like this place again and will definitely be back to try some of the other dishes.  The waiter we had was really nice and cool too.  Nice balance of taste, portions, and service in a cute little place at a good price.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-09", "description": "The Pad See Ew is friggin' amazing. They have that special red sauce and the jalapenos on the side tray are really spicy yet sweet. I could eat that stuff all the time. Also, the Tom Yum is hella good!", "author": "Danny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "This is yet another restaurant that I've driven past many times but never saw! \n\nWas in the mood for Thai (that's no surprise!) and decided on Thai Cafe upon Ryry's mom's suggestion. \n\nThe restaurant is very clean with nice glass-topped wooden tables and chairs and is very inviting. \n\nWe ordered the basil (ground) chicken, a curry dish and something else which I can't remember... this is because the curry we had was sooo spicy it erased the memories I had of what else we had that night. This is a true story!! We asked the waitress if we could have... oh, wait, I remember, we had a padseeyew, haha... the yellow curry made a little spicy. She asked us, \"Regular spicy or Thaiiii spicy?\" And with the emphasis she gave on the word \"thai\", I HAD to choose Thaiiii spicy! It sounded waaayy better than \"regular.\".... Boy, were we in for a surprise! They basically cut up a few small, green, potent Asian chilies so that the seeds were exposed and threw them into the curry. And MAN, did our taste buds pay for our poor decision! Needless to say, the curry and the rest of the food was deeelicious! It just took us a while to put the fire out of our mouths! \n\nSo, note-to-self, \"regular\" is A-OK!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-13", "description": "Went to the Thai Cafe for dinner recently near Mel's Diner on Geary.\n\nWe ordered the Tom Kha Chicken (Gai) soup and the Prawns w/ Bacon.  The broth could have used a little more spice.  I like how the vegetables such as the mushroom and tomato were fresh.  So it tasted ok.  We also had the Prawns w/ Bacon.  I thought I saw the largest prawns when I went to Abacus for lunch, but this place tops it.  The prawns were cooked perfectly.   The prawns are wrapped in bacon, dipped in egg and served w/ stir fried onions and cabbage.    But because of the egg dip, this plate ended up being ok too.  I could do without on the egg.\n\nThis place was worth a shot.  Maybe I will give the Quail, the Choo-Chee Clams or their Seafood Pot a try next time.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "I love this place! We always order the duck fried rice and the fried banana with coconut ice cream... yum! Service is good and food comes pretty fast. Definitely recommend this place if you want some delicious Thai food.", "author": "Anika K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-21", "description": "My baby called hungover this afternoon asking for \"Thai Soup\" and Thai cafe was the first place I saw. I'm a little bit of a Thai-o-phile and was a little shocked I'd never been into this place. I think I've probably visited at least 40% of Thai joints and probably 70% on this side of the Park.\n\nAnyway, an order of Tom Yum Kai (that's chicken to you, whitey) set me back 10 bucks. Now, I have no problem paying that much for Thai Soup, but it better come with something extra.\n\nNo such luck. Mediocre overpriced Tom Yum. Sorry guys, no second chance. Too many others on the list.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "The Ultimate Duck Fried Rice.\n\nWhy the Ultimate? The reason why Peeps would actually drive from LA to SF just for its Duck Fried Rice. Ha! Wasn't me who did that. It's someone I know who did it randomly. I thought I was nuts to be all over the area for good eats, but 400+ miles of driving for an overnight stay is EXTREME!! We're talking about a 1000 miles of driving on roundtrip.\n\nI tried this dish only whenever I'm in town. I'm in love with Duck Fried Rice. Everytime I drop into a Thai Joint, first thing I'll ask them is they serve Duck Fried Rice even if it's not on the menu, because sometimes they'll make it for you just because you're special. Yes, You can be special too. Keep ya head, kid.\n\nWhy am I hyping this place up? I don't even need to. It's alreadt famous among the asian community. I was already reccomended by a friend of a friend of A FRIEND. I know, I know..it's complicated. But, seriously..it's really that good. It's the best one out there so far, there's a reason why it's famous for its Duck Fried Rice. I mean It's that good, but I won't pull the same thing like that person who'll drive that extreme mileage. Talk about continent to continent.\n\nThis is one of the spot sometimes I wished I'm living in San Francisco. Nahh..yeah, Maybe. Under 10 bucks for that famous dish, that's special! After all, it's San Francisco...", "author": "Rick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-13", "description": "EDIT 08/11/07:  My Param tasted waaaay too much like barbeque, which is NOT what it's supposed to taste like--definitely not worth what I paid for.  Service is still up to snuff, but I had to dock them a star.  There's too much competition around here for me to keep them at a four.\n\n--------------\n\nAny restaurant that touts themselves as being the best in their cuisine has got to have some balls.  Easily passable due to its slightly tattered exterior and graffiti defaced awning, Thai Cafe may not be the best in Thai, but their food is well-presented and of high quality, while still retaining a casual dining feel.  \n\nNice sleek white/gold-trimmed tables of various sizes, and chairs with backings reminiscent of a washboard decorate the interior.  Dishes are a couple dollars more than usual (and veggies, expect to specify, as their isn't a separate vegetarian menu).  One large window allows a prime view of cars zooming by on Geary.  Staff is prompt and extremely courteous.  Don't pass this lil gem up.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-10", "description": "Duck fried rice, FRIED CALAMARI, and spicy eggplant with chicken. \nThis is a true REPEAT MEAL!  Trust me.\n\nThe calamari take a while to make.  Tell the waitress that you want it all to come out at the same time.  TRUST.", "author": "Deanna A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Best ground chicken and basil. I have been going for years. Also, try ground chicken with calamari and bamboo shoots. excellent. nice clean and quite.", "author": "Dee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-08", "description": "This is a three star joint.  Then why is it ranked a four, you ask?\n\nTony.  Tony makes this place amazing.  He worked for ten years at Lalita Distinctive Thai Restaurant near Hastings Law School, and claims \"that's why he's so tired.\"  Tony makes this place amazing! He's by far the best server I've had in months. Go just for him!\n\nThat said the lunch specials are a great value. It's not true Thai food, it's Chinese and Thai infusion.  The rolls are sub par but the soups are absolutely to die for!  I usually have the duck... its pretty good, not the best ever, but pretty tasty.\n\nGive it a try!", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-27", "description": "When you pass this block you are most likely bound to miss it. From the outside it might not seem much, but when you step inside everything is clean and sleek. The service is very friendly and attentive. \n\nThe one dishes I've tried for the first time and was pleasantly surprised: Beef Radna-- The best comfort food. \n\nBest time to go here is lunch because they have the (if you are a meat eater) the BBQ pork and duck with rice, the choice of cucumber salad, soup or egg roll. If that doesn't float your boat, they have a handful of other dishes to choose from for the lunch special. \n\nAnd my favorite Thai dish eggplant and tofu is scrumptious.", "author": "Caryl C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-14", "description": "We have been enjoying their food for last ten years. Eggplants, fried rice, we have not got anything we did not like. There was a older kid in the restaurant, who can not stay on his table with his parents, constantly running around. He was behind the counter, touching the glasses and food when we left. It is not hygienic at all! \nThe food will be missed but I do not appreciate the management any more. \nGood Bye!", "author": "Kay N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-16", "description": "it was just ok. they've remodeled the place a bit; but foodwise osha thai and king of thai are better.", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-26", "description": "my three favorite things at thai cafe are the fried calamari, duck fried rice, and duck pad thai. i LOVEEE drenching the fried rice in the duck soy sauce, they make it themselves, it's like a sweeter soy sauce. it is quite delicious!\n\nyum yum yum :P", "author": "Bianca W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "I like their duck friend rice here. Back in the day, I could eat 2.5 portion of duck fried rice. I wouldn't recommend such an impulsive act tho..:)\n\nOther dishes that I like are their green curry, calamari, and fried tofu. \n\nThe place is kinda small and can get crowded. The parking are tough.", "author": "Roy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "Some of the best thai food in SF.  Light yummy different \n\nA hidden gem.. .\n\nfor now. \n\ntry it.", "author": "SatSarbat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "I love Thai Cafe!!!\n\nStaff is always always welcoming and greet you with smiles when you walk in. The food here is great. One thing I love about thai food is that every dish has it's own distinct flavor/taste (unlike chinese food where everything taste basically the same and very greasy. I love chinese food though don't get it twisted haha.) The atmosphere is nice, warm, and clean!\n\nThe appetizer fried fish cakes are so good! So tasty served with the special sauce that goes with it! The ground chicken is delicious too! I've also had their pad thai which was great! Duck fried rice is pretty good too. Honestly, try anything here, it's all good. Try their thai iced tea and thai iced coffee, too!\n\nPortions are good, prices are not too pricey, and I wold suggest you try this place out especially if you're so used to King of Thai all the time. It's nice to change it up once in a while and get some real authentic Thai food.", "author": "upper d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-02", "description": "I recommend this place for take-out to any Laurel Heights slash Lone Mountain slash Inner Richmond residents. They will say it will be ready in 10-15 minutes, and it's always there. \n\nGet the Pad Thai vegetable.  Full of vegetables, noodles, and a light peanut flavor. If you're feeling brave, take home some of the spicey, red chile sauce.", "author": "Brett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-24", "description": "Great Thai place. This is by far one of the better restaurants in this area. Not much else is around Laurel Heights that is even decent! I recommend the beef curry dishes, but do order rice or noodles, it is quite saucy but delicious. \n\nVery friendly wait staff too. The soup is mmm mmmm good. Perfect thing to get for take out when you are sick. I guess $10 does not seem like too much for me to spend on soup. Hmmm... maybe that is why I am always broke? Who knows?\n\nOh! And I learned to say: kaeng ron which means hot curry. Now if I can just figure out how to get to Thailand and use my newly found language skillz... until then I'll keep stopping by Thai cafe for a bite.\n\nsawatdee!", "author": "Ali K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-12", "description": "Blah, not the best Thai food in town not even the best Thai within a blocks vicinity. If they put best Thai food within 5 feet I would challenge them b/c I bet Mr. Pizza Man could do better. The peanut sauce was alright, my chicken was rough and over cooked. Also the place was eery no one there except for this weird hipster dude. I give it two stars b/c under the counter they had a fish tank and I thought that was cool. \n\nIf you are going to ballsy back it up, sadly they did not and I want my ten dollars back.", "author": "Allan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-18", "description": "This was where I would take my Berkeley friends when they made the trek over. I really like their red curry and eggplant dishes, and the clay pot (is it clay? it's the iron bowl). \n\nThey remodeled and got pricier, but it's still good.", "author": "elaine m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "I really like this place. It's been renovated and prices are higher than they were before, but their specialty, clay pot seafood is as delicious as ever.\n  I do agree about Pad Thai - I did ordered it once and never again, but pompano fish, and clay pot seafood are awesome - they don't stint on mushrooms or seafood!", "author": "Bianca K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Anytime I get that urge for Thai food - the Thai Cafe is where I call. I can't get enough of their clay pot. Soooooo good. They are so friendly when I call my order in and it's always ready in a few minutes. You've got to try this place. CLAY POT !!!! You won't be disappointed.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-16", "description": "My friend and I were just driving around looking for a place to eat when we saw this place and decided to eat here. It was around 6:30pm and the restaurant was deserted. That's not exactly a good sign right? Oh well, we were already here. She ordered a eggplant special and I ordered a pad kee mao. She placed our food in the middle so we ended up sharing. My friend had also ordered a bowl of rice so since we were sharing I asked for a bowl of rice as well. The rice was quite hard which I did not like. Otherwise the food was really yummy. The waitress also bagged our food together in the same bag too without asking if we wanted it separately. While we were there two, two person parties showed up and maybe two people came in to order take out but overall it seemed to be a slow night for them. I would like to come back. I just hope next time the rice would be softer.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-26", "description": "This is the first Thai place I went to in San Francisco after I moved here a few years back.\n\nThe servers are super friendly and attentive.  It's a small place, but it never feels crowded.  They only have a few tables, so I get the feeling they really only want locals.  Then again, to find this place by chance, you'd have to pass by it every day.\n\nThe food is okay, not because the flavor isn't amazing or they don't cook everything perfectly, but because their menu is fairly limited compared to a lot of other Thai places.  They seem to have the mentality of doing a few things very well, rather than doing a lot of things just okay.  It's a good strategy, but I think in the interest of staying in business, they should add some more noodle dishes.  Just my humble opinion.\n\nIf I want to have Thai food with a date, however, this is definitely the place I would take them.  The small cozy space is great for intimate conversations.", "author": "Gavin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-20", "description": "I found this place while living in the city but recently went back again after moving to the East Bay. \n\nThe service is still very good, the food very good for the price, and the dishes were consistent, just as it was 2 years ago. They made a lot of improvements to the decor since I went there last.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "i love the fried duck rice! Probably that is the high light of the restaurant. I only had a bite from my friend but its really good. I ordered the beef curry, well it was good. But it wasn't to the point where i felt in love with it. I should have ordered the duck fried rice, anyways, besides that the service is really nice too. The waitress keeps on refilling my glass of water and asks whether or not i enjoyed the food. The decorations are also very home-y feeling, great place to have lunch with your friends here!", "author": "Cavin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "I've been coming to Thai café for years, since my family first moved to San Francisco through my years I spent at USF. I have a set rotation of dishes that I enjoy and I keep coming back for. \n\nThe Special Clay Pot is probably my favorite dish here at the restaurant. All though it's not as Thai authentic as other dishes, it is still very flavorful and enjoyable. It's a hodgepodge of chicken, Chinese sausage, pork, mushrooms and shrimp over rice in a clay pot. The cooking juices from the cooked meat form a delicious sauce that lightly covers the white rice giving it a delicious taste.\n\nI also recommend:\n\nFried Calamari- The fish sauce makes it taste better.\n\nSea Food Combination- A little weird with the ground chicken but it works. \n\nCho Chee Seafood- A little more kick and sauce compared to the Combo. \n\nBasil Chicken- Equally good.\n\nI would give this place 5 stars, however I often find myself waiting a while before the server comes. Furthermore, they have remodeled the place quite a few times over the years and with each time the price goes up. This was once a ($) place.\n\n5 Stars for the food, -1 for the service and price.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "I've been coming here on and off for over 15 years.  There have been changes here and there, but thank goodness my favorites are still on the menu -- I eat around a lot at other Thai restaurants, but I have yet to find another place that makes the Tofu Tod appetizer which is deep-fried tofu stuffed with fish paste and served with a spicy sweet sauce. Another go-to item for me is their eggplant dish which is their spicy \"Stir fried eggplant with ground chicken and shrimp\" which gets its heat from jalapenos, garlic and thai basil.  I usually don't stray from my favorites, but I have tried their various curries (yellow, green, red) for lunch and they're yummy.", "author": "Bodhi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-22", "description": "I love this place. This place has been around from about 1995. Their food  used to excellent then, and its still pretty good now. I love their pan friend flat rice noodle preperation. Its yummmyyyyy. The staff is also kewl and friendly. \n\nI have to say this is not a snazy place. On the other hand hand its a great laid back place with some yummmyy resonably priced food.", "author": "Amlan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-11", "description": "This city is void of real thai food, and Thai Cafe doesn't change this much, but it's still a nice little restaurant that I would frequent. \n\nAmbience: Clean, contemporary, white tablecloths, nice silverware, and airy.  It's not beautiful, but it's simple and bright, and has been kept up well over the years, although I liked how it was before the new furniture. It's good for the business lunch or the casual date.\n\nFood: Pretty yummy.  The lunch specials are very affordable and come in good portions, but I usually opt for a la carte anyway.  The fried chicken wings are a favorite, as well as the noodles with beef, broccoli and gravy (sort of like a thai chow fun).  The tom yum soup is also tasty.  They never do anything really poorly here. Although, the last time I came, there was a small piece of foil on our 5 spice chicken dish, and the wait staff kindly brought it back and brought us a fresh new entree.\n\nCost: It's a slightly more pricey than other thai restaurants, but you pay a little more for the dining experience and service which is always dependable here.", "author": "Audacity L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "Definitely my favorite place for my daily temptation for duck fried rice! Generous serving of fried rice with juicy pieces of duck meat within. The Beef Pad see ew is also a must-try and you must definitely try out the fried calamari when you are there. Fried to the perfect golden crisp, dip it in the sweet and spicy thai sauce, yummyy! Try it out for yourselves, you won't be dissapointed at all!", "author": "Steven K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-15", "description": "The food at this restaurant is definitely not what it used to be. The establishment has been there for over ten years and must have changed owners at least 2-3 years ago. The food quality from ten years ago and now is drastically different. \n We had the Clay Pot Rice and the rice wasn't even crispy! You could tell that the rice and the ingredients were pan-fried and then tossed into the Clay Pot. That type of style is chinese and not Thai. We also had the Roast Duck over Spinach  and the duck tasted old and the spinanch was soggy. The food wasn't fresh and tasty like it used to be at ten years ago.\n Unfortunately, this is my second time in the last two years and it has gone even more downhill since the last time I dined at this establishment. The prices for the menu have gone up substantantly and portions are very small. The price I paid for this meal, I could have gone to one of the five star high end restaurants and received at least better tasting food.", "author": "V. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "A fan of the duck fried rice!! First time trying it because most of my friend recommended me this place and this dish. Small place, pretty nice service, pretty good for the price, size is good enough. Ordered padthai as well, not so good, just okay. A little bit sour but not that bad either. Definitely going back to eat more of the duck fried rice and try out some other dish.", "author": "Irene W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-26", "description": "This is perhaps the closest place to eat from my house, so I decided to finally give it a try this weekend.  The interior is cozy, pretty small, maybe about 8-10 small tables. But it was nice, clean, and not so busy.\n\nThe food was average for Thai food. Not the best I've ever had, but it was edible. I ordered some sorta chicken dish that was labeled *extra spicy* on the menu, but when I got my dish I didn't notice an spice really. Granted I do love spicy food, but this dish was not spicy. At all.  We also got some Hot and Sour chicken soup. This was delicious! I'm normally a big soup guy, but this was really good. I can see myself coming here on a cold day just for this soup. I'm not sure about another full dinner here...I live to close to Clement Street to settle for average Thai food...but I probably will come back because the service was good and it's about 20 feet from my front door.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "This place used to be popular for their duck fried rice and fried calamari.\nSince at least last year, I feel like they overcooked their calamari and it does not taste good at all, as it is HARD. I have been a regular customer and this has been happening since a year ago.\nSo, if you were to experience the same thing, it's not because the calamari is suppose to taste like that and you may want to tell the server and ask him/her to re-do the calamari.\n\nI enjoy their duck fried rice with its sauce, fried calamari, and silver noodles.\n\nTaste does vary and can be too salty at times.\nI am not recommending any of their dessert, especially their black rice + mango + coconut dessert.", "author": "Monic S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Thai Cafe is a great place to go to.  It's not the same as it use to be.  I guess it's becauseof a staff members that left for a better opportunity.  The food is delicious, especially their duck fried rice.  I say their chow fun is pretty good too.  Service is great, the waitress kept adding water when ever I run out.  I didn't have to ask, she came by on her own.  The lighting and decorations make the place very welcoming.", "author": "Wayne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-07", "description": "Great food, especially the roast duck with spinach and ground chicken with basil leaves. Have been eating in this restaurant for more than 20 yrs. A little expensive but worth it.", "author": "Tommy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "Have been going here for many years, so time to review.  Food is very tasty, portions are generous, prices are reasonable, and my wife and I have always had good service for the many lunches we have eaten here.  We have had a number of different dishes between us over the years, and they all have been very tasty and satisfying.", "author": "M T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-03", "description": "nope, not happening.....got take out here and it tasted like a hot diaper.  being so close to Clement, try your luck there.", "author": "Colin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-15", "description": "I love thai food and my friend has recommend this place to me for over 6 years.  Finally I have chance to try it out at my friend's birthday dinner.  \n\nI love the stuff chicken wing and shrimp flat noodle.  I will bring my family here again to try more dishes next time.", "author": "Melody T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "actually this place doesn't look so cute from the outside, but the inside is pretty cute. i love their papaya salad here. the had a lot of papaya therefore it was filled with flavor.  our main dish was of course the duck fried rice.. and after that i wasn't able to eat anything else.. it was so good. i know duck is suppose to be fattening and all but i don't care.. that one dish made ms so full! next time i'm ordering my food togo so i can enjoy it at work.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "The BEST Thai restaurant anywhere.  I have lived at and travelled to many place - no Thai Food compares to this restaurant except for the ones in Thailand.  Beef cubes, papaya salad, the yummy coconut soup, pad thai, basil chicken, Thai iced tea, fish cakes and beef satay are to die for !!  Small operations, nothing fancy, down home Thai food.  Staff is super friendly.  Total comfort food place.  I have been going there for 21 years - never had a disappointing meal.  Go try !!", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-15", "description": "I cannot ever go back to this place. It's near my workplace so I have tried a number of times. Sorry, all you good reviewers, it's been bad every time and I only order simple Thia food like Pad Thai. What's with that?  I just can't stomach it.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-17", "description": "Okay, so I'm giving it Five stars because I know the owners. So what? Maybe this is going to be a bias 5 stars, but what are you going to do about it? Damn it, I'm giving this 5 stars because the owners are my girl Miyon and her husband who cooks inside. You see, Me and Miyo GO WAY BACK into High School, so you are saying I can't give an old high school buddy 5 stars for her restaurant? \n\nBest Thai Food In Town. Don't believe me? Read the sign people. Read the fucking sign on the restaurant.", "author": "Run Sing M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-19", "description": "I luv this goddamn place.\nThough the service is just O.K.\nFood is good and addicting.\nPricey though...hits my pockets.\nbecause of this it deserves a 3 star.\nThai Tea\n(i forgot the name of the curry with coconut juice, sweet n sour sauce, and with green basil....hmmmm!)\nDuck Sweet n Sour Pineapple\nRice\nMango w/ Sticky Rice", "author": "Nelson F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-05", "description": "Good Thai in a really cute setting. Nuf said.", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "What a great place to have lunch with a couple of friends (:\nThe place is...to me pretty uncomfortable. The seats were hard and didn't have enough room for my legs, so i had to sit kind of sideways.\nBut its all good since the food made up for that.\nI ordered eggplant something, pat thai (?), and the man i forgot what they were called....but basically if you go get the eggplant stuff, i saw everyone ordering that one.\nservice was good. price...i believe, or it seems like all thai places are kind of pricey, so this place wasn't too bad. ordered like 4 dishes, and came out to be a little over 40 dollars.\nwould love to come back!", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "The Best TOFU TOD and Minced Basil Chicken in town.  The Tofu tod is really crispy on the outside without being greasy ,tender and meaty inside.  The minced basil chcken was barbequed first then cooked with basil and peppers, delicious.  They have several other dishes that is great but I have been going here for more than 20 years mainly for my Tofu tod and minced chicken fix.", "author": "Tabp F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-27", "description": "I live right by this place and it is my go-to Thai restaurant.  I have eaten there several times and have not been disappointed.  You know how some Thai food can be a little greasy? Not the case here.  Good, reasonably priced food.   Also, the seating area is usually never occupied (5 or 6 tables).", "author": "Britany F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-04", "description": "Pretty good Thai food.  Clean place and not too big, but big enough.  Friendly and quick service (seems like husband and wife).  Had squid with bamboo shoots.  Lots of other interesting choices to try too.  Hot pots weren't huge, but big enough.  Everybody was happy and satisfied when we left.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-05", "description": "NO NO NO!!!! Their sign sad best Thai rest. False advertising. Papaya salad was $9.25 tasteless. Everything was super sweet. C'mon there are other ingredients besides basal and surgar. Told the waitress and she sad nothing. I was very polite and gave them my feedback. Listen to your customers!!! There are plenty of good Thai rest in the city just not this one. Truly the worst Thai restaurant in the city!!!!", "author": "Bob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-09", "description": "This was one of the first neighborhood spots Deb and I went to for dinner after moving out to the relatively sleepy Inner Richmond.  The food isn't exceptional, perhaps, but it's definitely really good and is pretty reasonably priced.  The decor, too, won't turn heads but is sturdy and comfortable and attractive--this is pretty much always a good place to sit and talk while you eat, which is more than you can say for a lot of restaurants.  If it weren't for all of the competition up and down Geary and Clement, we'd probably eat here more often--as it is, it's one of those places that's worthwhile but neglected.  You can definitely do a lot worse when you're in the mood for a creamy curry with some heat.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-22", "description": "We used to come here to eat when I was going to school at USF.  I don't particularly remember if the food was spectacular, but I don't remember it being bad either.  I just remember one of the worst dates I've ever been on.  My date being from a foreign country had no clue about tipping and wanted to leave mere cents on the table.  What a turn off!!!!!!!!!!", "author": "Kit E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-28", "description": "Thai Cafe was only okay in my book.  I've definitely have had better Thai food, and at cheaper prices even.  A typical rice dish or noodle soup dish alone is $7.50, and for a few dollars more you can get the lunch special--a rice dish and some accompaniments, either a cucumber salad or sweet and sour soup and a vegetable or shrimp roll .  Definitely a lot of food, but not quite worth $10 something.  At Chinese restaurants that same lunch special would cost you $6-$7.  I ordered the clay pot with shrimp, pork (appeared to be Chinese char sui style), chicken and Chinese sausage (which I could have done without!).  Veggies were only mushrooms and green onions.  The rice wasn't even a tad bit crispy on the bottom...as if they didn't' use the clay pot for any part of the cooking...cooked it elsewhere and plopped it on the (pretty) clay pot.  Kinda lame.  My dining companions dishes looked normal enough, but nothing too spectacular or dynamic.\n\nThai Cafe is just mediocre Thai food at on the high side prices.  I'd rather patronize King of Thai, Tawans or Osha Thai....but maybe I'll give it another chance and order a curry.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-19", "description": "It's over a year later and the BF is now a BFF, and while I haven't been back here since then, would you believe I'm still thinking about the quail?   It was that good.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-20", "description": "Whenever I am in the mood for Thai, I will make the drive to this place. They recently remodeled and it is great. They are very attentive and quick to seat you. It does get crowded since it is a farely small place. The food is wonderful! My favorites are Shrimp Pai Thai, shrimp and green beans with steamed rice. Topping it off with an iced coffee.", "author": "ruth c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-27", "description": "This is what you want in a neighborhood restaurant - decent food at good prices. While the banner above the entrance pronounces it \"The Best Thai Food In Town,\" you should lower your expecations and simply enjoy the fast, attentive service. I like their ground chicken with basil, though their curries are good also.", "author": "Timothy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-19", "description": "Decent price, decent food, decent service, and there is a fountain behind a glass window, for some reason, in a corner where no one can see it.  The duck with the coconut curry was pretty good, and again, the price is worthy.  I might go there again.", "author": "Cassio P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "This place is across the street from one of my offices and we like it A LOT. They are nice and accomodate you right away. The food is very tasty and there is a lot on the menu. They have a curry dish with eggplant that is very good as well.", "author": "A. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "I've lived around the corner from this place for almost 2 years and never tried it because my housemates said it wasn't good. While sick, I tried to order delivery Yellow Curry without fish sauce (Vegetarian), and to my surprise, most places wouldn't/couldn't do it. Thai Cafe does, and it is SO good. I've had it twice now and it's wonderful, and the brown rice is some of the best I've ever had. I used to only eat at Les Ros (which won't deliver to the Inner Richmond), but I've found a new neighborhood favorite!", "author": "M J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "We drive all the way to sf just to eat here. One of the best Thai restaurants! Love their fish cake, pad see-ew and duck fried rice.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-02", "description": "I LOVE THIS PLACE!!!  i've been coming here for years. especially when i want to have fried calamari!!! YUM!!!  the service is friendly and attentive.  the place is small and clean.  i definitely recommend giving this place a try!!!", "author": "Monica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-30", "description": "I always have cravings for the Pad Sew (thin egg noodles with broccoli and gravy sauce).  It is a little greasy but sometimes that is OK especially when you have a hangover and do not have the brain power to cook for yourself.  The prices are reasonable and it is within walking distance for me.", "author": "Micaela M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-23", "description": "Came here Saturday night for a birthday dinner.  I hadn't come here in years and years so I was a little surprised they re-did the interior.  It looks really nice inside!  Our reservation was for 6pm, 9 people.  They had no problem accomodating us and actually had another large party there at the same time as us.  No problems with service and the food was decent.  No complaints, but it also wasn't the best Thai food I've ever had either.  Everyone ordered a dish and we shared family-style so everyone could have a little taste of everything.  I wasn't too impressed with my Thai iced tea, but other than that, I'd say it was pretty fair.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-01", "description": "I've been here only once and I enjoyed my visit. Not only was the food good, but the service was nice. There is a guy named Tony there who treats all customers as if they were regulars, and that helps make your first experience at a restaurant you've never been to a pleasant one. Definitely a nice place to visit for some Thai.", "author": "Rommel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "Although it's not the best Thai food, I go here for the lunch specials. You get your fill with what you pay for. Good eats, good price! The service is quick. Sometimes, I go here during my 1-hour lunch break and I'm always back in time. :)", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "I love the fried calamari here, it is really tasty.  Other items are moderate, not too good not bad either.  Their Thai spicy is actually not spicy at all even thought we specifically asked for extra spicy.  The chilli sauce/powder on the side did the job for them :)", "author": "Lily K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-05", "description": "A little too expensive, but it is good.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "My boyfriend and I love this place.  It seriously had the best Thai food in San Francisco that I've ever tried, and it was definitely at a reasonable price.  I usually get the duck with rice and I love it!  My boyfriend loves getting the hot and sour soup with a chicken dish.  It is a small restaurant that is dressed up nicely.  The service is also great.  Whenever we have guests in town, we always bring them there, and they all love it as well.", "author": "Stina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-20", "description": "cute place and friendly service, but i don't remember my meal...", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-08", "description": "Best Thai Food in town? Maybe, but I will have to try some others out.\n\nVery prompt pickup service. And here I was thinking the food would be OK, I was pleasntly suprised. Yellow Curry was simple and delicious. Need to branch out more when I am hungry and order some more food. Pad Thai is next!", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-25", "description": "My Indo friends referred me to this restaurant. Delicious duck fried rice. Everything else on the menu are also good.  I don't think they're pretty consistent with their food. A couple of times that I ate there the dishes were just okay.", "author": "Danny R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-14", "description": "I live very close to Thai Cafe so it is a good option for me for quick take out. The people who work in there are very nice.  The biggest problem with the place is that in recent months there have been fewer and fewer people eating there. I dont really think this indicates a problem with the food, I think it is a general crunch on many restaurants in the city combined with a less-than-ideal location. So the point is, and I think this is just my personal hang-up more than anything, fewer customers mean less turnover of food, and it could impact freshness. \n\nSo anyway the food is good. I have only been disappointed once, and it was because the fried calamari was over-done. Serves me right for getting fried calamari, fatty. The actual thai food has never let me down, though. Im never blown away, but I keep going back. \n\nIf you are a denizen of the Inner Richmond, Lone Mountain, Laurel Heights whatever area, go to Thai Cafe!", "author": "Rick P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-12", "description": "A good choice for Thai in the neighborhood with friendly service.  However, for the money I'm not really sold on the value proposition.\n\nIt is a toss-up between three and four stars, but the fact that it is possible to get into this place without a wait for dinner tilts it toward 4.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-30", "description": "My friends and I stopped by the Thai Cafe before going to the Bridge Theatre on Geary.  We ordered Pad Thai, Pad See-Ew, Duck Fried Rice, and Calamari.  The Calamari was made just right - not too much batter and came with a tasty sauce.  The Duck Fried Rice has lots of bit sized chucks of duck.  The Pad See-Ew was the best I've had in a while - though greasy, still very tasty.  The Pad Thai was the worst - very ordinary, already pre-tossed, and no limes (when we asked for a lime, they gave us lemons - what kind of Thai place has no limes?)  We ordered Thai Iced Tea - also good, a little on the sweet side - if that's what you like.  \nAdditional notes:  The restaurant is small - only about 10 - 4 person tables - OK for groups of 5-8, any larger and it becomes difficult.  Service is OK - had one waiter for the whole restaurant.  Also, be prepared for your clothes to smell.", "author": "J. W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-11", "description": "Be warned, this is a Chinese owned and operated restaurant, not authentic Thai. The food is mediocre which is why I gave it two stars and not only one, but because there so many really good authentic Thai restaurants in San Francisco why go to a fake? Most of the dishes are Chinese and the only thing remotely Thai about this place is that they server curry. Som thom? Larb? Not. Duck fried rice is a Chinese dish people, and you're better off getting it at Mayflower further up Geary St. If you don't believe me look for anyone that is Thai reviewing this restaurant. None! (Or, ask a Thai person yourself). Lame! For some authentic Thai in the neighborhood go to Tawan's at Geary and 8th Ave.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-24", "description": "Not the best pad thai in the world. Garlic noodles...extreme garlic but tasty.  Veggie curry is always great, be sure to get some steamed rice.  Very tiny place, loved the place in Daly City better for Pad Thai.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-02", "description": "They have the best duck fried rice that I've ever tasted so far. Their claypot rice is very good as well. For appetizer, try their Thai calamari. I was tempted to give this restaurant a 5*, but there was this one time where they didn't make the food as good as usual. Having said that, the food was fabulous the last time I came there. Remember: DUCK FRIED RICE!", "author": "Ray W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "Don't remember Thai Cafe being anything memorable, but simply solid.  Service was great as I last recalled, and the ambiance was nothing to write home about.  They did slightly re-model it, but not sure how much it helped.  A certain overall niceness made it appealing.  Food was decent portions for all.", "author": "Kevin Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-15", "description": "Always come here for the Thai Duck Fried Rice. Yep, it's not in the menu but me and my friends always order the Thai Duck fried rice. I think they make the best Thai Duck Fried Rice. It comes with a little sauce on the side but I always eat without the sauce. When I'm tired with the Thai Duck Fried Rice, I order the Pad See Euw with Duck. Again, it's good! The calamari is delicious too and crunchy. Yumm.. Too bad I can't order 'very spicy' Thai Duck Fried Rice. I asked them once but the waitstaff told me to use the chilli powder that's available on the table. :(", "author": "Ona T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "My roommate and I order from this place all the time.  Our favourites are the Clay Pot and the Curries.  The staff are friendly and when we place the order it's ready in 15mins so we run down the street to pick it up.  Great when you need some food fast on a random afternoon/evening.", "author": "Mags B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "Not bad at all Pretty good Thai food! When you tell them spicy they listen. I got Pad Gra Pow Chicken it was ok  but very very dry, then I asked to make it jucier then when i got it  same thing! DRY!  but overall its ok there", "author": "dk s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-06", "description": "The duck fried rice is to die for!! Just amazing!! The fried calamari is really good too.", "author": "indah m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-25", "description": "I used to eat here frequently, given that I worked in the neighborhood for a while.\nThe food was always good, but the place developed a rep for being weird about tipping. I learned just HOW weird when I had the following experience:\nThe last time I ate here, I asked if they were able to make Praram Chicken. The waiter said that it wasn't on the lunch menu, then pointed out a chicken and vegetables in oyster sauce option.\nHe offered to substitute sauces for me (peanut for oyster).\nI said \"yes, thanks\"!\nHe brought an entree a short time later that consisted of the oyster sauce dish with peanut sauce thrown on top.\nIt might not sound too bad, but trust me, it really tastes NASTY when you mix the two.\nI choked it down and, when the bill came, decided that my waiter did NOT provide me with stellar service. I tipped about $1.00 in change (on a $10 total bill).\nWhat happened next was TRULY surprising. As I left the restaurant, some guy (a manager?) followed me OUTSIDE and confronted me with the tip. He was LIVID, and practically THREW my (tip) money at me, as he spat \"Don't you ever come to this restaurant again!\"\nNo questions, no discussion, no consideration of the whole PURPOSE of tipping. Just \"Don't you ever come to this restaurant again!\"\nUnbelievable. I hope that the management has changed. This incident, admittedly, was a few years ago.", "author": "J H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-14", "description": "it is a small thai restaurant known for their gREat Duck Fried Rice.. their service is great... my friend accidentally knock over her wine glass which shuttered on the table and didn't charge us for the wine glass... their garlic nOodle is delicious to try...", "author": "Lily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "whoa. that eggplant red curry was amazing. i LOVE lemongrass, granted it stirs up fond childhood memories...there's nothing like that zesty flavor. and the spicy ground chicken, you can always count on. i know a few people who are in love with it. tasty thai food, it's better to order a few dishes and share them for a rounded meal.", "author": "Faye P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "I L O V E this place! The papaya salad here is the best I have ever tasted. I love it to be extra spicy! YUM! The duck fried rice here is also really good. Words cannot describe how good this place is. Whenever I come here the service is fantastic the man that works here loves to cater to your every needs. The food here is fabulous, the waiters and waitresses are ever so greatfully nice. The prices for the food isn't overpriced for what kinds of foods they serve. The desserts here is one of a kind, literally. Who ever thought frying ice cream would taste good?! THE FRIED ICE CREAM HERE IS TO DIE FOR. I'm not kidding. It's so good. It's not regular vanilla ice cream, it's coconut! one of my favorite flavors which makes this one more reason to come here! I always bring new friends to this restaurant and they all love it. They also fall in love with the duck fried rice and the fried ice cream. This is probably the only restaurant that sells fried ice cream that I know of. If anyone else knows of place please tell me! 'Cause I love that stuff!", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-19", "description": "Thai Cafe on Geary - I blame the discovery on an ex-gf - is really quite good!  On some days, I think they might make the best Phad See-Ew in the city ( with chicken and broccoli of course).  They make a Massamon style chicken/potato curry that is also quite excellent.  Phad Thai here not recommended.  They recently re-modeled the interior so even though you feel like you are entering an outer ring of Dante's special place, it is calming and clean on the inside.", "author": "kevin w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-30", "description": "quick services, nice foods. thai duck fried rice is to die for!", "author": "Palacheta S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "Fantastic duck friend rice!  A must-have for anyone and everyone that eats here.  Other than that, the fare is decent.  I'd give 3 1/2 stars (yelp really should implement half stars!), but I suppose four isn't so wrong since I do frequent this place - more that I'd like -  when undecisive about what to eat.  Service is pretty good with the waiters usually attentive to our water or tea levels.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-25", "description": "Positives: Quick service and reasonable prices (most entree options are about 10 dollars).  Friendly staff.  Never difficult to get a table.  Open reasonably late (9p)  Negatives:  I had an MSG reaction after eating their food and am surprised they put MSG in the food.  Thai food is flavorful enough without it.  And it takes a lot of MSG to get me to react.  So if you're not MSG sensitive, definitely a good place to go!", "author": "N K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "I ordered the duck and red curry as mentioned here on yelp.  The curry was pretty disappointing, generically sweet without enough spice/flavor.  It had too many green beans as filler.   They duck was decent.   These were lunchtime prices/portions.", "author": "Bob D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-28", "description": "Most excellent service in a clean, nice environment. Food is pretty good and price is good.", "author": "C K."}
