{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Loved the pizza here; what is wrong with people? It's a hole in the wall making a delicious pie. I had the tomato basil and it was awesome. I only WISH I lived in the 'hood so I could take home. Yum", "author": "Dave S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "Don't go here unless you have literally no other option.  Forgot about my slice while warming, until I asked, gave me a burnt slice, stay away!", "author": "Isaac A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Gotta love Pizza by the slice!  Perfect for a snack on the way too or mainly from the bars in SF!  Pizza is great!! However, have only been hammered when eating", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "Reminded of elevated Dominoes but not In a bad way. Just a place that delivers quick, the pizza is thicker than a NY style slice, a bit doughier of a crust that you get with a Dominoes pizza. But the ingredients were definitely fresher and everything came fairly fast. We wanted a pizza late on a Thursday and this place came through in a pinch. Good stuff!", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "I ordered a 6-Pizza delivery for a party, yesterday - a bit of a risk on my part (scheduling-wise) for ordering food from anywhere that close to Market and Castro during Pride Weekend, but they pulled through!  They did call to let me know that they were super busy and that my order would be 10 minutes late (it was barely that), but I've had pizza orders from other places be 20mins late with no call or apologies.  Much appreciated!  Pizza arrived when they said it would, piping hot and delicious.  They also included plates and lots of extra condiments, which was unexpected, but a nice touch. Crust is on the thicker side, ingredients are fresh, and they don't overdo it on the salt.  Price is also super-reasonable - especially for the area.  Will order from them again, next party.", "author": "Jeanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I love this place, the slices are always tasty (especially the dough) and the people who work here (at all hours of the day I might add) are always super friendly.", "author": "Marc L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Wow all these people with the 1 star. I just had a slice of cheese that changed my life. Get with the program folks. Lovely joint.", "author": "Noah D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "Ordered a few times & the pizza was good. The last delivery was late by 1/2 hr. The guy had to get change for a twenty & come back 1/2 later. Won't be ordering from here again!", "author": "SP G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "An Eat24 5 star spot.  Think food court pizza but slightly thicker, made hot, cheap and served immediately.  The slice portions are generous.  I was starved for a quick bite and this hit the spot!", "author": "Mee-Jin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "A quality slice. Order at the counter. Dress your pizza. Walk while eating.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "I agree that there's no such thing as bad pizza.\nHowever, there is such a thing as mediocre pizza. And Cybelle's Pizza falls into that category. \n\nDon't get me wrong - this is not horrible pizza. At the end of the day, it's still melted cheese/goodness on baked dough. What's not to like? But the pre-made/re-heated quality of the pizza reminds me of the food you get at Sbarro's, those cheesy (yes, pun-intended) pizza parlor you find at shopping mall food courts. The slices are generous for the price, but there's just no love in these pies. The dough is bit thicker and doughier than I prefer. And if you don't eat the pizza right away, the cheese/toppings and sauce become luke-warm, congealed, and flavorless. \n\nAll that being said, I find myself in the neighborhood a few times/month for work. And when I'm really famished (bordering on \"hangry\"), a slice of Cybelle's Pizza has come to my rescue numerous times. So for that, I'm eternally grateful.\n\n* Be warned - they're cash only.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "I don't mind coming here for late night pizza. They always have a selection, they are tolerant, it serves well for the late-night feasting. However, I have preordered for dinner on several occasions and each time they are late. Order online, 25 minutes, run to the Slice, never ready. Now, when I call for my pizza order, I double ask the time it will be ready and arrive 35 minutes after my order.", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "The Slice Pizza (formerly known as Cybelles) is the best pizza I've ever had! They made it fast, they have so many options for toppings, and not too pricey for the quality! \nThis place really stands out because of the love that they put into every pizza. Everyone who works here is friendly and really loves what they're doing!\nIt's conveniently located in the heart of Church street, next to Dolores park! \nIf there's anything I recommend you do when visiting San Francisco, it's to try THE SLICE. \n(Still salivating even after eating that whole pizza to myself)", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "I come here for lunch all the time with my coworkers the ppl that work here are nice and the pizza is awesome!!", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "It has become ritual amongst my crew to start browsing Yelp Deals or Groupon for pizza deals after a long day of football and alcohol. Maybe that's the case for everyone, I don't know, I can only speak for myself. Cybelle's didn't have a deal, but they were closeby and my friend said they were good.\n\nSo we went with half Hawaiian, half Pepperoni with Jalepenos ($17.50 for a small!!), an order of Garlic Bread ($4.49), and an order of Jalepeno Poppers ($3.99 for 5 pieces), they are filled with cream cheese, just fyi, I prefer Cheddar cheese, because Chedda is Betta. The appetizers are super cheap,  which is nice because then you don't have to rely on pizza to be your one and only. I actually didn't realize that I ordered a small pizza until it arrived, which was a let down, but also a lesson in double checking, am I right?\n\nPizza was good, I mostly ate the Pepperoni half since I don't like Hawaiian, but the rest of my party was happy with it. We all got pretty full from the appetizers, but I would definitely order a salad next time; we were all carb'd out after we finished. Total came to like $31 something with tip, so not too bad for four ravenous young adults.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Really? Only 2.5 stars overall? I don't get it. It's a little hole-in-the-wall pizza joint that's open fairly late. I was heading to the MUNI and needed to grab a bite before hopping on the J-line, popped in and grabbed a slice of Hawaiian. It was big and tasty and off I went for under four bucks.\n\nPretty much all I need from a pizza place. Four stars instead of five only because, in honesty, Escape from New York and Nizarro's, down a few blocks, both have even better pizza.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "hot, fresh, and not greasy! this may become a regular pit stop for me! tomato basil slice was just what I needed!", "author": "Seth T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-13", "description": "There are many places to eat in San Francisco, and there is no shortage of pizza joints. Cybelles, unfortunately falls into the mildly mediocre category of pizza eatery. \nI come to this place a couple times a week, mainly because I work across the street. The slices are decently proportioned and usually get the job done. But as often as I stop by there, I just as often turn around. The main reason is that their slices are not always fresh. If you stop by there, and the racks are full, you have a good chance of biting into a hot juicy slice of pizza. If not, then your mouth will be raped by the bland, staledness of a cold pizza, making your taste buds quiver in shame.\nKeep in mind that I've not tried their delivery system, nor any of their speciality pizza.\nUpdate coming soon...", "author": "Joel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Open late - clutch.  Slices always on hand - clutch.  The pizza is good! Not the best pizza ever, but serves the purpose well! \nDavid, one of the guys who runs the shop is such a nice guy!", "author": "Steph W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-28", "description": "The low average star rating surprised me\nBefore going in. We went here after a session at Churchill and luckily they had just pulled out a fresh pizza from the oven. We each had a pepperoni and sausage slice. The slice was huuuge. All the condiments there and the hot sauce in a ketchup squirted was a very nice added touch. I'd consider ordering delivery from this place in the future. The guys working were friendly to me.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "Pizza is decent for the late hours they stay open. Customer service could use improvement.", "author": "Suzanne M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-11", "description": "Absolutely NEVER order from this place. Delivery never showed up. When I called they claimed they tried to deliver and called me, but they lied. I received no calls and the proof is in my call logs. They claimed they could not tell me the number they called either and would not try to deliver again or give a refund.", "author": "blue r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Love their House Special and the Vegetarian--Always arrives quickly and still hot from the oven.\nArmando is super nice when I order my delivery and even recognizes me as a customer when I call my order in.\nOutstanding.\nMarilyn M.", "author": "marilyn m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "Sliced right.\n\nAs expected there are slices available.\n\nAs not expected there is sliced bread available for sandwiches. Turkey BLT minus the B and adding the M (marinara sauce) made for something good. \n\nRight size for the $6 cost. Appreciated the ingredient swap by the small but kind staff.\n\nThree stars for the MLT.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-24", "description": "I've never eaten here, and now after the way they plastered my house with their flyers I never will. There is no reason for there to be six flyers hanging off my house, what a waste.", "author": "Margaret I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "This is not a $ restaurant. It's very expensive and our order of a med pizza and coke became 35$\n\nThe pizza is not good because the toppings were not baked enough.\nThe base was too thick and the corners were not done well\n\nCleanliness is poor. Restrooms are terrible\nRetouched old pizza slices for buying by slice", "author": "Mukund K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "Delicious pizza and responsible service. I placed a large order of 11 pies for a party and needed it early, by 1130am. They delivered! And the pizza itself... Crunchy,  medium thickness crust, tangy sauce, zrsty cheese and fresh toppings. Plus, not too expensive. Cybelle's is not hip but who cares!  It's an SF tradition since 1978.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "Great for delivery- they're quick and I've always had a good experience when ordering. \n\nThe ready to go slices in the case just OK (which isn't that surprising-- fresh pizza is always better). I only grab a slice if it's late or I need a quick cheap bite while on the go. It's good for those purposes, and every neighborhood always needs \"that\" pizza place. \n\nAlso, the people who work here are always really nice and polite.\n\nOverall, if you live in this neighborhood, it's worth trying, particularly for delivery.", "author": "Tanya S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-08", "description": "Got a whole pie delivered and on the 2nd slice, I found a long HAIR in my pizza!!! I lost my appetite and would not recommend this place.", "author": "jne n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-10", "description": "First of all, I've been regular customer of this location for well over 10 years.\n\nLast night however wasn't that good experience. Thought to share my complaint here,instead of waste my time arguing with them on the phone.\n\nOrdered my usual Hawaiian pizza, TWO 2-liter Fanta sodas,and a small lasagna.\n\nOrder shows up over an hour late. I had to call them to remind them(Annoying!!). Also I did not get the TWO sodas I ordered, the driver only brought me ONE (and you can see it on my Delivery.Com receipt as proof that I ordered TWO). I ended up paying the driver as if I paid for TWO sodas when I only received ONE.\n\nOhh and the same driver was rude to me before on a seperate incident involving tips. \n\nSorry but I don't have alot of money to throw around. If I don't get a free soda next time I order to fix this problem than I think this would be the last time I am dealing with this pizza place. They have made alot of money off me and well after the lousy service of last night I'm not too sure i wanna deal any further.As far as the quality of the pizza... It's okay, not the greatest(personally I always thought the best tasting Cybelle's location is in Daly City,CA),but sure as hell not worth waiting an hour for and having them screw up your order!!!! Is that how you treat a regular customer of over 10 years??? LAZY!!!\n\nMy 2 star rating is actually generous. Deep down I would soo rate this a one star but at least their health score is decent.", "author": "Isabella A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "This is one of the best pizzerias I have eaten from in San Francisco!  They offer excellent ingredients with fair 'market' prices (as pizza prices go)!  Friendly staff and speedy delivery, ALWAYS arriving before their target time- sincerely one of the best!  I am especially pleased with the few specialty ingredients they carry- my favorite being the Linguica that I don't find in many pizzerias!  5 stars, two thumbs up and an A+ from me!", "author": "Paul H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Have some respect for the environment and please don't litter my doorstep with your trash. Find other ways to advertise your business.", "author": "Tyler O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "I don't usually write these. But I have to say, these low reviews are surprising. I got cheese-less tomato basil pizza and it's great. Nice crisp bottom while still soft and gooey like pizza should be! Nice staff as well!", "author": "Samantha P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-03", "description": "All I have to say is that it took 2 hours to get one small pizza delivered.\n\nTWO HOURS.\n\nThat's absurd.", "author": "Chelsea A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-30", "description": "My friend and I stopped in here and were served 2 slices of OLD, COLD, SOGGY pizza by 3 guys who tried their best to ignore us.\nWhen I asked why he did not heat it up, he said they did not have to!\nWe were then chased down the street where two of the goons tried to bait us into a fight and called us F**KING F**GOTS. This place should be BOYCOTTED.", "author": "Arlon K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "So I was real skerrrd to eat a slice from a 2 star spot but I was too hungry and too busy-so I tried it.  You and I both have been faked out by a ton of poor reviews because this place is a great hole-in-the-wall (pretty much literally, there are 3 stools inside and 2 chairs outside). Better than frozen pizza, reasonably priced, locally owned, heavier dough, simple, straight-forward and convenient.  \n\nPerhaps the yelpers in SF have spoiled standards from all the phenomenal food here but Cybelle's not tryin to be anything she ain't, it's good cheap junk food.  Ill be back!", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "This is some good pizza especially the deals they have on yelp. Yelp coupons made me want to order here so why not. Well my first time ordering for delivery and it came within the time limit yelp gave me. They have door to door coupons but yelp deals are just as good and better. Free delivery if you spend more then $12. No problem and they called me when they were at my front building so it's good to no they don't reliey on your front gate intercoms because my number is not  programmed to it so that's a plus one.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "#luv great place great location and i love it the music is amazing and all your dreams will come true", "author": "William P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "Pretty good pizza; great for a late night fix.  My kid seems to like it a lot, but then again, she's just shy of 3 yrs old.  Pizza on the lines of Toto's in terms of flavor and style.", "author": "Leland H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-25", "description": "Straight up HORRIBLE pizza. We ordered delivery, and while it was relatively quick, the pizza was almost inedible.", "author": "Tik P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "I love this place!!! I wouldn't call myself a pizza expert but I definitely know what I like...and I love the pizza here", "author": "Karma B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "What's with all the hate? Fools.\n\nI order pizza delivery from this place at least once a month, for years now. Always fast, always delicious. Hello SOMA Special. Hello Mexican Weekend. I've never had a problem with this place. Yum.", "author": "Rick A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-10", "description": "Best pizza slices in the area. Best price too. Only a few seats in the window, but they do have free refills on soda. They may have a couple small tables outside also.", "author": "David H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-02", "description": "I have never eaten something so flavorless. Period.\n\nDo you have to be drunk to enjoy this place? *scratches head* As in, I-have-no-taste-buds-left drunk.\n\nFriends wanted pizza after a beer-filled night, fair enough. I went along for the ride and grabbed a slice. I asked the guy working which was the most flavorful veggie slice. Clearly, he and I were operating in different universes.\n\nThe verdict: lukewarm, flavorless chewing. We move the party back to my place and while my friends happily nom down their slices, I can't force it. They tell me I'm not drunk enough.\n\nWhy should I pay for food that's only going to take good when I'm intoxicated?!?\n*throws hands up in the air*\n\nI crank up the open and wade through the fridge for anything to slap on top of this deceivingly pizza-looking slice of tomatoey covered dough. Even after fancying up the cheese and reheating this bad boy, it was still a waste.\n\nLord help me the day I go here voluntarily and enjoy it.\n\nOn the (only) plus side: late night eats & cheapedy-cheap", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-02", "description": "The following review is mainly about the food. The customer service was great. I don't usually write negative reviews, especially when it comes to pizza. But I have to say this place was pretty horrible. I got there with a few friends after a night out at a few bars. I had a pretty good buzz going and my standards for food are much lower after I've had a few. We got our pizza and it looked great. I waited until it cooled down a bit and took a bite. I noticed that the dough was undercooked. The crust had zero flavor and it was still wet in the middle. The cheese and toppings were mediocre as well. It's hard to disappoint with pizza but this place was a disappointment.", "author": "S P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "So... I basically get one thing, and that is a thin crust and maybe sometimes a regular. Whoever answers the phone is always polite, they deliver fast and friendly. Also, if you are a fan of thin crust, you can ask for super thin like I do, and it's basically a cracker style crust -- which I love. I haven't ordered a pizza from anywhere else in a year.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-04", "description": "I know you're open late and all (til 2am on a weeknight) but what's up with the really, really DRY pizza toppings?!? \n\nNo bueno.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Solid, great, pizza that is consistently tasty. Love coming here after hanging out in the city, especially after a late night. The Greek Goddess pizza is amazing. The price is cheap, and the portions for a slice are big.", "author": "Sean P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "Stopped by for lunch. Solid slices of pizza, very friendly owner. Comes highly recommended. \n\nHad the Soma special. Very good and filling.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-17", "description": "When I was living in San Francisco before, I loved Cybelle's, I was pretty much addicted to their calzones. I loved them. Back then would have given them a five star rating.\n\nFast forward seven years - I move back to San Francisco. I am really looking forward to revisiting the pleasure of a Cybelle's calzone.\n\nI order it up. Anticipation building. It arrives on-time. The delivery guy is polite. I open the box. I find a soggy barely edible very bland mess. This was not the calzone I remembered. The mozarella sticks had very little flavor and what flavor they did have was not very good.\n\nThen I went and checked their online ratings. I am not sure what happened (possibly over expansion) but the quality sure has fallen off the charts.\n\nThe bottom line is that I will not be eating at Cybelle's again unless I hear that the pendulum has swung back the other direction.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-14", "description": "This place gets a bad wrap, mainly because it is bad, but hey, I keep coming back.  Why you ask, namely alcohol, not to mention, the Large 1-topping pizza ($9.99) seems like a great idea when you just tripped over the curb trying to make a booty call.    \n\nTwo things you can do to turn your 1-2 star experience into a 3, maybe even 4 star experience.  \n\n1.  Do not buy the slices, they've been sitting on the rack for a while and the cheese is spongy.  Order a fresh pie and eat it straight out of the oven.  \n\n2.  Don't get it delivered, this Pizza simply doesn't travel well, once you hang up the phone, you've already lost.  Say no to delivery!  \n\nI live two blocks away so the last two are pretty easy for me.  If I were looking for delivery in the area, my go-to is Pizzeria on Valencia\n\nhttp://bit.ly/xwdKAd\n\n2nd place goes to Goat Hill Pizza\n\nhttp://bit.ly/GDvSBr\n\nAnd 3rd place goes to, Escape from New York \n\nhttp://bit.ly/qfzByi", "author": "Steve C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-26", "description": "Disappointing. \n\nThe best reason to eat here is that it is close. The second best reason is that it is cheap. The third reason is that sometimes it tastes like pizza. \n\nThe crust is always disappointing. It tastes like nothing, instead of tasting like bread, and is never crispy. \n\nI feel like the misprinted sign on the door represents the whole Cybelles experience. When it came out of the printer, half cut off, they shrugged their shoulders and said \"eh, good enough\"\n\nWhen Cybelles is good, it's ok. When it's bad, it is disappointing. That's why I just ordered a meatball pizza from Marcello's. \n\n:(", "author": "Tim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Great neighborhood pizza. My delivery has always been prompt. It's not fancy gourmet but basic old fashion hit the spot pizza.", "author": "rassors T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-07", "description": "Decent late night pizza joint.\n\nThe pizzas are a doughy variation of new york style.\n\nThere are better places in the city for pizza, but if you're in the area and want a quick slice of pizza, this place will do.\n\nSlice =$3", "author": "Ayall S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-29", "description": "Poor Cybelle. \n\nI'm sure at some point in her life, she dreamt of selling quality pizza. Being the best she could be. But, where did things go wrong for her? How did she end up out at 2am trying to satisfy all kinds of men and women in this dark alleyway of a street? Two maybe even three at a time. This economy leaves us all desperate, and girl's got it bad. \n\nSadly, paying for Cybelle was like shopping at The Goodwill. You don't know how long it's been there, but they clean it up the best they can, so you can take it off their hands.", "author": "Ray W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-03", "description": "The pizza is awful. Some of the worst I've had in the city. They don't skimp on toppings, and sauce is okay but the pizza crust is what really ruins it. It tastes like cafeteria pizza.\n\nOn the positive, the pizza delivery guy was attractive and really nice. And the price was good.", "author": "Raquel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-20", "description": "Believe it or not the only thing I liked about this place will have to be the fact that their dry pepper is actually CALIENTE. Other than that pizza was okay I got the slice supreme which could of been better if they actually heated up and not just gave it to me like that. I also got jalapeno cheese poppers and which was large so I can share and turns out that only half the box was full with just a few and they tasted a little flavorless not like any others I have had. Plus they took for ever, even my buzz went away", "author": "Rosa A. F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-27", "description": "This the default place we go to after my wife gets her nails done across the street.  I'm still amazed that they can run such an operation from such a tiny facility--every square inch is used.  I have seen public restrooms larger than this, and yet they still have room for a pizza oven, a fridge for drinks, a soda dispenser, and a tiny dining area.\n\nIn itself, the pizza is decent and tasty--you can get it by the slice or you can order a whole pie to your specifications.  It's greasy and simple, and sometimes that's all you need for a meal.  It's best for food to go, because they only have two seats inside for sit-down dining, and a table outside with another two seats.  I have always had friendly service here.\n\nThis place is great for a quick, cheap bite if you're in the neighborhood.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "I was looking for a New York style pizza place to grab a slice.  This one definitely met the requirement. Just walked up and got a slice of mushroom. Super cheap and pretty darn good if you're in Castro.", "author": "Bobby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "These guys delivered me a pizza after the Giants won last night. You know how nuts that is? And it was super fast too. Thanks dudes!", "author": "Santos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Good, fresh, and affordable pizza! The staff are super nice too. I can't believe that this place only has 2.5 stars. Sometimes you can't just rely on yelp for good food and service", "author": "Connie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-31", "description": "not so much......\n\nI live two blocks up and it's very convenient to get a slice but not quality......Guys are cool though and I like taking a seat inside and watch all the crazy people on the street.  It's better than HBO!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Great NYC style thin-crust pizza. Great value. If you like \"low to the ground eating\", then the two seats they have will be fun for you. I like the cramped quarters, but can see how others may not. The pepperoni is a bit greasy, but the other slices are fabulous.", "author": "Shawn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-09", "description": "It's one of those \"it is what it is\" kind of places: late night pizza at the right time, the right place, the right price. Mushroom/pepperoni hit the spot, but wasn't anything to write home about. Although, it's clearly something to Yelp about...", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-08", "description": "Worst service ever for delivering at pizza I have not try it yet. I have been waiting for an hour and half. The men on the phone very unfriendly with the customer. He says there are very busy and can not have time to answer how long will take for your pizza to be deliver. What kind of business they want to run with this service.\nTo bad I gave my credit card to this people and I hook to wait for my pizza. They charge me right away.", "author": "Monica P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-05", "description": "Better than average pizza, but this is SF so that doesn't say much. I ordered BBQ wings and an \"Omni\" 14\" pizza (lots of meat).\n\nThe wings: Slightly bad tasting meat. Not much 'BBQ' flavor to it at all. Most of them are somewhat crisped and stuck to the foil container. A sachet of ranch dressing included. Classy.\n\nThe pizza: HOW did they make it so bland? This secret needs documenting. The dough is tasteless. The tomato sauce is oversalted and bitter. The cheese is flavorless. All meats are oversalted and yet somehow still bland. A sachet of parmesan and red pepper included. So, so classy.\n\nI had a hangover at the start of the meal and now I feel worse. I wouldn't mind if this was a cheapo pizza parlor, but that was $30 of food made from the cheapest, nastiest ingredients I've eaten since I moved to the US.", "author": "John R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-26", "description": "Disappointing. The best reason to eat here is that it is close. The second best reason is that it is cheap. The third reason is that sometimes it tastes like pizza.\n\nThe crust is always disappointing. It tastes like nothing, instead of tasting like bread, and is never crispy. \n\nI feel like the misprinted sign on the door represents the whole Cybelles experience. When it came out of the printer, half cut off, they shrugged their shoulders and said \"Eh, good enough\". \n\nWhen Cybelles is good, it's ok. When it's bad, it is disappointing. \n\n:(", "author": "Chas B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-29", "description": "Good pizza and delivery service. A little slow with the delivery part but pizza comes fresh. Not much that distinguishes this place from \"Bob's\" next door except they cater to the drunk crowd post 2AM.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-15", "description": "This little hole-in-the-wall pizza place is amazing! Me and my friend happened upon it one random day and it was a cheap, and amazing slice of pizza. The pizza was hot and huge! Filled me up. I got the tomato and basil pizza and I'm pretty picky about the pizza I eat since its my favorite food. The guys there were really nice and we struck up a conversation with them. While we were eating, a man and his daughter, who seemed to be regulars, came in bragging about how great the pizza was and how often they come back. Sorry about all the people who had bad experiences, must've gone on bad days. I'll be back soon!", "author": "Alyssa O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-06", "description": "Stopped by here for a late night bite after signing the night away at The Mint. The pizza was good, super cheap, and the staff was friendly. They also had much needed bottles of water for sale.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "Sooo I want to give this place an extra half rating (3.5)... maybe I'm bias because I ABSOLUTELY LOVE small pizza spots that serve slices with cheesy greasy slices! Plus... I live right down the street and frequent this place at least a couple of times a week (hence the zit on my nose recently ;(.) \n\nThis place is the perfect grab and go after/b4 having some drinks to coat your stomach so that hangover isn't too bad in the morning! Just the right amount of cheese and you can never go wrong with the Pepperoni slice. Service is quick and usually they are pretty friendly. I will say that I would have given it 4 stars but I think its ridiculous for a slice to cost $3.08 without tax! Nonetheless, so far its one of my favorite late night pizza spots...", "author": "roderick h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "They did great! Had an office B-Day party and Cybelles delivered promptly and tasted wonderful!! Thanx to the guy down there for rockin it out!!", "author": "Vampire J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-20", "description": "I got some Cybelle's pizza tonight, delivered.  \n\nI ordered Online then they called me to confirm it.  Annnyyywaayys.  Delivery was pretty fast.  Pizza was pretty thick crust.  Good taste overall.  Filling, kind of heavy.  \n\nDelivery guy was nice.  Brought me peppers and parmesan cheese.  Nice.  No napkins, but I didn't ask for any.\n\nThey have coupons on their website.  They are open late and I prefer this pizza over Mr. Pizza Man and I prefer it over Domino's and I prefer it over Pizza Hut.  I prefer it just barely over Round Table only because it seems healthier and less greasy, although Round Table I think is more yummy.\n\nIn a nutshell, a good delivery place.  I prefer North Beach Pizza though now that I think about it.\n\nI guess any pizza is good if you have enough beer.  *takes a sip*\nCome to think of it.....this was typical Cybelle's Pizza like I had at other Cybelle's  It fills you up.  It's yummy, it'll do in a jiffy.  It's ok.  lol\n\nI just realized I go to this place all the time when I am drunk.  Employees are cool.  Tonight I got a slice to go.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-06", "description": "Only make this mistake once and then come back so I can say I told you so. Cybelle's is quite possibly the worst of the worst.", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-14", "description": "It's OK.  I didn't realize before I ordered from here that Cybelle's is a local megachain, but the quality is better than Mr. Pizza Man.  I know; that's not saying much, but when you're a local megachain, you're going to be compared to other local megachains.\n\nI'd really love to know how to say it, and since I ordered online, I still don't know.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "Ordered a pizza last night at 8:50 PM. Had that pie delivered to my door by 9:20. Extra Large Greek Goddess with chicken. maybe sun-dried tomatoes.\n\nThe first time i had the greek goddess pizza was at the Cybelles in Daly City by Junipero Serra blvd. I was 9 years old. Greek Goddess still taste just as good as the first time i had it. \n\nKitchen Sink, Meat Lovers, or Greek Goddess..Check em out. Can't go wrong.", "author": "Raymon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-28", "description": "noshed on some pizza after a wonderful night of homolicious debautory.\n\nIt wasn't the best pizza, but it was definitely what I needed. \n\nQuick, Fast, Greasy.", "author": "Robin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-25", "description": "Yes it is conveniently located, however this place is the size of a shoebox, and the pizza is overpriced and just so-so. When I went here, they didn't have any cheese slices: If you don't have plain cheese slices, you are not \"selling pizza by the slice,\" what you are doing is \"selling leftover shit from the night before.\" Whatever. 1 star for location, 1 for not giving me food poisoning.", "author": "sellMyFing n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-20", "description": "Pizza wasn't too bad after you soak the grease up with a paper towel. The delivery took an hour and a half though and I couldn't order a soda to wash it down. I can't really rant or rave about this place. \n\nI prefer going in to get a slice. The pizza taste better, but it's tricky to find a seat and straws and lids are located in a not-so-short-person-friendly place.", "author": "Heather E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-13", "description": "Decent slice for the price. Easy and greasy. Their veggie slice is pretty nice.\n\nGreat for late night, post-debauchery fixations. In a great location, easy to access from many party spots.\n\nOnly problem=no ample seating area.", "author": "SF N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-09", "description": "Cheap low budget pizza shop. They never have any pizza available with sausage or pizza. I've been there a dozen times and NEVER had pepperoni or combo pizzas ready. Don't go here. They are trying to make a profit on cheap cheese and mushroom and cheese pizzas. Get a clue owners. Losing major business. Mythic Pizza is so much more accommodating.", "author": "Curtis S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-16", "description": "Even after a long night downing Churchill's sazeracs, this pizza did not hit the spot. How could that even be? The guys behind the counter were cool and I really expected some good down-home straight up pizza pie. Instead it was bland and dry. So sad.", "author": "Lisa P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "Probably some of the worst pizza I've ever purchased. They should also adjust their prices if they're going to deliver a sub-par product.", "author": "Shane S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-25", "description": "Its like that meal you ate last night, put in your fridge, and aren't terribly excited to eat it again the next day....but you do because its there, and because its cheap.  \n\nCybelles isn't the best pizza...but its across the street from Amber, and down the street from Lucky 13, and it makes a great coat to your stomach to prevent sickness before and after the booze.  Its there.  So we eat it.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-12", "description": "Cybelle's is no where near being good pizza. The only reason it gets 2 stars is that it makes excellent drunk food, and it is the only pizza place in the 'hood.\n\nAlso, they have pizza with corn on it!  Yes, corn! I love corn. I especially love it in my tuna, mixed in with my spaghetti, and *definitely* on my pizza.\n\nSo, plus one star for the corn.", "author": "S F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-18", "description": "I was a big spender last night treating myself to a late dinner slice.  I asked them to make it extra crispy which they kindly did.  \n\nNot the greatest pizza, but on my way home last night from happy hour imbibing, it hit the spot.  \n\nGod Bless Pizza!!!", "author": "James M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-25", "description": "Since when is it acceptable to take 1 hour and 15 minutes to slop a pizza together, nuke some pre-made wings and drive it two blocks?  Apparently, that's the way that Cybelle's does pizza.\n\nWhen you are stone cold sober in the middle of the afternoon during a PMS fit that can only be relieved by comfort food ... Cybelle's is a let down.  \n\nThe crust is way too dry and thick around the edges, but the bottom part is so thin that the cheese grease soaks through to the pizza box and makes a mess.  Too much cheese weight on a flimsy crust makes this pizza (what should be the most convenient food to eat) a huge sloppy mess on your plate, your clothes, your counter and your floor.\n\nThe chicken wings were bloated and soggy bits of disappointment clinging loosely to tiny brittle bones.  I imagine that these were just thawed from a Costco bag and nuked in the microwave because there was not one crispy bit of skin in the entire container.  \n\nIn conclusion, Cybelle's food is grody to the max.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-01", "description": "I've never eaten in the store but I've ordered pizza for delivery a couple of times. Both times the pizza was good and cheap. It took an hour to arrive but that's what they said it would take. \n\nGetting a cheap pizza with extras like wings and a bottle of coke during the week? Cybelle's Pizza on 14th St is a pretty good bet.", "author": "Gentleman Junky Jack R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-13", "description": "I needed to put something in my stomach before Friday night's drinking commenced and I was in a hurry to get to a nearby bar. Spotted this place while strolling around the neighborhood and decided it would work for pre-drink stomach filler. I just wanted a slice but I saw that you can order entire pies or sandwiches if you desire. Extremely average in every way, the only thing that I really remember about the experience is that I still managed to burn the roof of my mouth, despite asking the guy just to warm my slice briefly. This place works if you need something quick and don't know other options in the neighborhood, but I wouldn't make it my go-to place for slices if I lived in this area..", "author": "Nate R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-06", "description": "You're a responsible San Franciscan; you have an earthquake kit right?! You know, a bundle of food literally meant to SAVE YOUR LIFE?\n\nImagine it comes with pizza.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-29", "description": "Crap.  Years ago, CyBelle's was regular parlour style pizza, now it's crap.  Every Friday my son and I have \"pizza video game night\" and we have made the rounds of delivery.  We know pizza like Hunter S. Thompson knew drugs.  Seriously.   This stuff is crap.\n\nArriving in about an hour and change, what was (years ago) a nice pie with fresh ingredients, now resembles a really thick Domino's or Little Caesar's style production line pie.  The peperoni was so cheap that, by morning, it had stained the cheese orange too.  Like I said, crap.\n\nThere is far better pizza in this town for a better price.  Why eat crap?  Yuck.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-10", "description": "The pizza is actually surprisingly good.  I'm not sure if I just got lucky or something (based on the other reviews).  We ordered an extra large pepperoni with a group of friends and we went to pick it up.  Minus 2 stars for them burning our first pizza and making us wait for another one while crack heads and hookers walked in and out.  Oh and they thought it was funny that they burned our pizza.\n\nThey ended up giving us a little discount but that doesn't redeem them really, I mean a discount is expected in that situation.\n\nI'm sure I'll come back late night though.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Can't say I understand all the hate for Cybelle's.  It isn't great pizza by any means, but then neither are most places in this town.  Perhaps the disconnect is the fact that I order whole pizzas from this place for delivery instead of stopping by here for a slice like most people do.  All I know is the delivery is quick, prices are average, and the pizza really hits the spot if you're looking for no frills late-night post-drinking pizza.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-15", "description": "I feel bad writing this because the people who work there were pretty nice, but... The. Pizza. Is. Absolutely. Horrible.  And if I think it is bad at 2AM after hitting the bars, it's really really bad.  I don't think I've ever thrown away a slice before finishing the whole thing before this.  Everything that could be wrong, was wrong.  You name it: slimy, doughy crust, soggy toppings, watery sauce, tasteless cheese.  If it was 50 cents, it would still be a rip off.", "author": "Cheryl N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-02", "description": "I love this place.  I'm no pizza connaisseur like the rest of the folks, but I get consistently good pizza for very cheap at all hours of the day and night (well, til 2am). \n\nThe delivery is free so if I'm too lazy to walk the 2 flippin' blocks from my flat, they'll bring it to me.  And like I said, I LOVE IT!!\n\nOh, and what's wrong with dough that tastes like doughnuts?  Aren't pizza and doughnuts in the same not-that-good-for-you-family anyway?", "author": "Tanya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-24", "description": "I don't know what everyone is whining about. Just on the note that this  place always has slices waiting on the walk home from the bar, I give them 5 stars . \nSure it's not the best pizza, their slices are way better than their whole pizzas. Why, I'm not really sure. \nBut I'll tell you, I am always happy that it exists in my neighborhood.", "author": "Erin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "Pizza is amazing!!! Service was fast and fresh!! Owner is very nice and talkative. Great hole in the wall place!", "author": "Hang T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-29", "description": "I agree w/ Cooter and Jenny K wholeheartedly.\n\nIf you've read other reviews of mine you'll see I am willing to give places a second chance and sometimes a third.  That was the case here and I've been burned by them more than three times and now will never order from them again for home delivery.\n\nThe one star is for walk up slice service on my walk home and that's it.\n\nThe particulars:  \nPizza has been super greasy 90%+ of the orders I've had.\nPizza has been cold several times when delivered.\nHave waited more than an hour and twenty minutes more than twice.  Once was two hours.  These times have always been preceded with estimates of 45min-hour. \nHave lost my order once.\nWings are super fatty and often cold.\nSalad is adequate.\n\nSeriously, there are many other options in this neck of the woods and so my future home pizza delivery business will now always go elsewhere.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-25", "description": "I have ordered from Cybelle's several times over the last few years for my company.  We often order pizza for the entire office when we're having a big office meeting and want something easy and casual.  Cybelle's pizzas are great because they're huge and can therefore feed more people per pizza.  Also, the pizzas come with lots of toppings.  My favorite is the Brazilian chicken pizza with the hearts of palm, corn and ranch. I've never had corn or hearts of palm on my pizza before and they're delicious! I love the crunch of the corn.  Also, they're able to open early to make early deliveries or start my huge order early.  Very good.  I would definitely go again.", "author": "Marisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "I love this pizza. The crust is thick n fluffy. The sauce is nice, not too sweet. When you order a toppin, THEY TOP IT UP. super nice staff. Good hours-open late.", "author": "Carly W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-04", "description": "I liked the cheese on my $2.75 cheese slice.  I marked down as I felt there was too much sauce.  Nice place.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "Is it the best pizza ever?  No, it is not.  But is it thick and greasy and gives you PLENTY of cheese?  Indeed it does.  Great for a slice when you're in a hurry -- cause there's very little room to actually sit there (two seats inside and a little table outside).  I recommend the pepperoni.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "Ordered pizza and it came with half the cheese and toppings in a corner of the box. The replaced the pizza with a new one within 20 minutes. Job well done.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "We ordered from Cybelle's, as we have in the past, for delivery of a medium pizza that arrived promptly and was fabulous.  We had a double mushroom with 1/2 garlic and 1/2 artichoke for $18  that was well worth the price.  We had pizza left over and were happy campers.  I highly recommend Cybelle's. Evelyn G", "author": "Evelyn G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-05", "description": "pizza is okay. garlic bread with cheese was greasy and the bread was soggy and had no crisp. theirs some better pizza places then this.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "Arrived at my friends house and cybelle's pizza was sitting, pippin hot, on the kitchen table. Not sure about how long the delivery took bc I wasn't there when it was ordered. But, again, it was hot and cooked nicely. I devoured 2 slices in a matter of 5 minutes. Granted, I was starving from not having eaten all day...but I didn't think this was bad.\n\n I normally don't like thick crust, but the fact that there was a layer of cheese almost as thick as the crust, sort of balanced itself out. I would ideally not like a centimeter of cheese on my pizza, but it's hard to complain about alot of the goodness that is cheese. \n\nAn few hours later another slice did a fine job soaking up some of  the beer in my tummy. Not amazing pizza, but it served it's purpose well.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-28", "description": "A friend of mine had a fundraiser here for his swim club, and I wish now that I'd just donated some money instead of throwing it away on food I didn't enjoy. I felt that everything was mediocre, and the design and look of the place walks that line between tacky and...well...tacky. I couldn't understand why so many people I knew at the time raved about it. At least I didn't get food poisoning?", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-18", "description": "Absolutely the WORST pizza sauce ever. Watery and spiceless.  The only thing this place has going for it is that it's open ... and serves pizza. If you have a choice, go elsewhere.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-10", "description": "As one of the few people here who eat this stuff while sober, I have to say--not bad!  Yeah, it's not the most amazing pizza in the universe, but Christ, it's a walk-up pizza shack and they do a pretty good job.\n\nDitto to Cooter on the online ordering mess...Not enough for me to want to damn this place to hell, but I think I'll stick to phone ordering from them.\n\nA big plus--they have always been polite and accomodating with calling my cell when the delivery guy gets here...my door buzzer is useless.  Mythic Pizza, however, was not so fabulous.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-27", "description": "I too don't think their pizza is that great, but I really like their french burger and their drunken chicken! It's not gourmet, but it is pretty good delivery, and they have a good variety.  \nI have had a friend that  had a problem with the delivery guys and their bill too. However, when they called the manager was in and he came over to clear it up! \n(not in a stalker sense, the friend just lived really close, and the delivery guy was still there)", "author": "Dixon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-02", "description": "Great when you stumble in drunk from Amber across the street.  Sober?  Not so much.  \n\nEDIT 6/2907\n\nPS Also good when you stumble from Cafe du Nord.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "Grabbed a slice after an afternoon at Duboce Park.  It is perfect for just what it is...a quick slice of pizza.", "author": "Kacie O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-18", "description": "The pizza was reasonably tasty and slices were of good size. The cheese had a tendency to slide off the crust, which itself seemed somewhat limp. The chorizo tasted like normal sausage with some powdered spice added. As a friend pointed out, it probably seems much more impressive late at night after heavy drinking. I'd certainly eat there again, but it's not a destination pizza joint for me.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-03", "description": "When your in the lower haight-castro area drinkin your dome off, come by Cybelle's for a pretty tasty piece of za. They usually have like 5 different kinds on the rack like your usual pepperoni,cheese,mushroom & pep,pesto & mush, and the classic hawaiian slice. This place is so small you need to tell the delivery guys, or whomever is eating at the bar in the window to move outta the way to get your coke from the fridge. I believe it's a cornmeal crust, that's not bad when your drunk.\nNot my 1st choice in SF, but hey there open pretty late and you need that late night snackola...!!!! Abondanza mama celeste'..!", "author": "Sven S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "I'm conflicted because the first time I tried this pizza, I was amazed, and since then I've been somewhat disappointed. \n\nThe first time, I ordered a slice from a pizza that had just come out of the oven. It was soo good. Piping hot, melting cheese... I was graving a slice of good greasy pizza and it was exactly what I got.\n\nI haven't had a fresh slice since then, and it's been hit or miss. Sometimes it's pretty good, other times I've regretted getting it. \n\nSo apparently if you can catch them when they're making it fresh the pizza will make your day. Otherwise, try at your own risk.\n\nThe guys serving the pizza are pretty nice.", "author": "Maisha J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "I don't know where these reviews come from.  This place is amazing, the owner is the nicest guy ever and the pizza is as good as it gets in the area.....plus where else can you go after 11:30pm and get food??", "author": "John A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-20", "description": "This place has pizza that tastes preserved and microwaved.  No love in the sauce.  Even if you're drunk and nearby and FIENDING pizza, don't go.  At least I don't and tell my friends DON'T.", "author": "Peter N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-05", "description": "flavorless, soggy, greasy pizza. I'd rather eat an apple", "author": "Biemme B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-05", "description": "I left my chorus music here and a staff member help it for me and gave me his personal cell so that I could pick it up.  THANK YOU!!!  They have good pizza and I'm a loyal customer and often go when I drop by Blackbird for a drink.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-16", "description": "Pizza was ok, but their ethics suck.  I walked up, ordered two slices of cheese.  The guy says $5.50. I give him a Visa card, and he punches in $5.95. I ask why the difference and he mumbles something about \"everyone charges extra for credit cards\".   What a slime ball way to do business! He should have told me in advance that he'd be charging more.  Who does that, anyway?   (At least they didn't tack on a \"unhealthy SF\" charge as well...", "author": "Adam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-17", "description": "I waited an hour and 30 minutes for my order when I was quoted at 45 min. The guy who answers the phone is very very rude. Worst service i've had in a very long time. But, the pizza was delicious.", "author": "Kim F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-05", "description": "tried the Brazilian chicken special, which came with artichoke hearts, corn, green onion & onions, and chicken (obv) drenched in a ranch sauce.\n\nhuge slice, friendly service, just not THAT special, but not that bad either. \n\nno real seating inside (besides 3 bar stools), just fyi\n\nlearned that I've been pronouncing \"oregano\" incorrectly all 21 years of my life. that's what happens when your parents are first-gen Asian Americans...", "author": "Serena W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-22", "description": "Three bars open out onto Cybelle's doorstep at 2am.  Cybelle's is open until 3am.  That is all you need to know.", "author": "P J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "Cybelle's is great for lining your stomach after drinks at Amber or the Transfer. It's cheap, $2.75, fast and actually better than your average pizza delivery in SF.", "author": "Thel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-07-26", "description": "If you were to take the cardboard box in which the pie was delivered and cover it with bottled sauce and shredded processed cheese, you would have a better tasting pizza than those they make here.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-05", "description": "When pizza tastes bad sober, it really is bad.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-05", "description": "I am a professional boozehound. So that means I've had my fair share of drunky nights and pizza slices. But like I said, I'm a professional. So, I don't go around screaming, 'OH MY GOD THIS PISSHA IS SHO GOOD!' when I'm drunk. I take my drunken pallette into consideration and try and be as objective as I can. Honestly, this is not all that bad. It staved off my hangover and it tasted just like average, well, pizza. I give it a good C rating, it ain't gonna kill ya'...", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-09", "description": "It is what it is. Prices are a tad bit higher than I'd like (Mythic will give you a better slice for $2.50), but still decent pizza.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-12", "description": "I have to give this place 3 stars for the mere fact that their decent sized slices have filled my belly so many times after having a few too many drinks at Lucky 13.  It's not *authentic new york* or *authentic chicago* or *authentic italian*.  It's just PIZZA!  Greasy, cheesy, can't really say saucy though, but it's hot and ready to serve at a moments notice.  If you are a fan of the drunken consumption of *bad* food then Cybelle's has to be on your list if you are in the neighborhood.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-12", "description": "\"The only two reason sthat I've eaten here is that :\na. I live across the street\nb. It's open until 2pm so it's good for a late night snack.\n\nThe place consists of a counter and there are a couple of tables outside where you can sit. The pizza slices are pretty unimpressive, soggy, and greasy.  I recommend ordering a slice from one of the pies that have just come out of the oven because the other ones may have been sitting there for awhile.  I've ordered whole pizzas before and they were better than the slices but the quality was still low. The service is efficient but not overly friendly.\n\nThe best thing about this Cybelle's location is that it is right in the heart of the Church and Market bar scene so you are guaranteed some interesting people watching.  Also, if you don't get lucky at trendy Amber, you can always cross the street and hope to make your connection over a pizza slice at Cybelle's.\"", "author": "Susan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-11", "description": "The crust is not as good as the one from Marcello's, but is still good pizza.  It is very convenient for me because it is so close to my house, and the employees are very friendly with me.  It is also open late, so I can also grab a slice there before I go to sleep.", "author": "Francisco J. R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-23", "description": "this place sucks ass!!!!  i had delivery from them twice and it tasted and looked like they bought that shit @ safeway in the frozen section!  i even decided to give them a second chance and went to the walk up spot in the castro... rude as fuck and still the same frozen pizza factor!!!!  my advice... physically go to the safeway across the street from there and buy your own frozen pizza!!!!  at least you'll know it came from there and it won't cost you what they charge you!!!!!!!!\n\n\nsorry, but this place gets noooooo love!!!!\n\n\n\n\n\n***ursa major***", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "My favorite Pizza in San Francisco :P not to mention the nostalgic memories thru the years eating their Large Pepperoni, Sausage and Olive Combo with my significant other :P", "author": "Anthony J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "Just a short walk from my sister's place. I have not had a bad experience ordering from Cybelle's. Whaaatev guys, pizza is pizza.", "author": "S. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-31", "description": "i like pizza, my friends like pizza. we also like to consume loads of booze. everytime i've gone in or had it delivered my friends are all extremely excited about it. i really like the crust, but maybe i just don't know what the hell i'm talkin about.\ndelivery is fast, even at 1 in the morn.", "author": "tinkerbell e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-30", "description": "What happened Cybelles? I have to downgrade my 5 stars to a 3 star rating. The last few pizza's I've purchased have been a too doughy and bland. I don't know what happened but fix it and you'll get your 5 stars back", "author": "R J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-30", "description": "DO NO ORDER ONLINE. don't ask me why I even wanted this pizza at all, I was feeling lazy and hungry after a long day of work and wanted easy dinner. \n\nONE HOUR after ordering and I'm thinking \"where's my pizza?\" So I call them and they say \"oh, sorry, we just got your order, it's coming in on the fax machine right now.\" Yah, right. Perfect timing for my call, huh?\n\nDon't even bother calling your order in. Just order delivery from someone better, like Escape from New York.", "author": "junip a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-02-27", "description": "Pillsbury Dough Boy gets attacked by small amount of cheese and flavorless tomato sauce....", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-26", "description": "I once stood outside Cybelle's and asked someone to show me his prince albert.  And he did!  But I digress...  The pizza is standard and it hits the spot after a night at the bars.  Otherwise, it's nothing terribly special.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-17", "description": "Average pizza, but quick and friendly staff and right in the middle of the city make this place an easy stop off for quick food.", "author": "Anna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-21", "description": "I used to think this was good, until I learnt what good can be. It's still pretty good, in a nostalgic kinda way. This pizza gets significantly better after several cocktails at Amber across the street. Open late too..", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-07", "description": "Please keep in mind that I've never been here sober....but this place definitely serves its purpose at 2am. Cheap and greasy. I'd give it three stars except their damn drivers keep blocking my driveway.", "author": "Marie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-12", "description": "Cybelle's Pizza is the type of food you crave after the bars close.  It's greasy, fatty and salty.  If you ate it sober you probably wouldn't care for it, but after a bender you really crave it.  I admit I've craved Cybelle's Pizza a few times myself.  Sometimes when I haven't wanted to cook food late at night I've picked up a slice or two after work.  Their pizza by the slice options are limited, but at least its freshly made.  Their pizza to go freshly made and delivery is so slow.  It's not steller pizza, it's 2am pizza.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-30", "description": "Ohh man this is bad pizza. It gets one star for being really cheap, and 2 for the location (find me another pizza place near the 14th/Church/Market intersection and I will buy you a slice) - only out of sheer need for pizza should you venture here...", "author": "Anika K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-14", "description": "You know how when youre crushing really hard on a person, and you wanna do stupid crap to impress them, like wrestle midgets or run down an up escalator naked? Well...bringing them a slice of  this overpriced, under flavored pizza will significantly lessen your chances of amourous delicacies. It gets two stars MERELY for the fact that it was there for me one night after a Lucky 13 bender.", "author": "Mick F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-12", "description": "This pizza is actually edible. Anything beyond that is a stretch, but the crust was decent and the toppings (pepperoni and mushrooms) did the trick. The lack of sauce though, was extremely noticeable, but the size of the slice made up for it. At $3 its not a steal, but it will work, especially after having a few drinks and not having many other late-night options in the area...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-21", "description": "they'd get four stars but their delivery blows monkeys.\n\nthree stars for reliably greasy pepperoni pizza that fills my belly when i'm drunk in a taxi on my way home, trying to keep the hated hangy at bay...", "author": "nic f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-07", "description": "They delivered two completely wrong pizzas and then told me I was wrong and that is what I ordered.  They offered to come and pick up the wrong pizzas and deliver the right ones (in 2 hours).  Horrible customer service.", "author": "Kyle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-24", "description": "not only is the pizza gross, but i got food poisoning\n\ni hate them with every bone in my body", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-16", "description": "I was hoping for just a decent pizza.  Wasn't expecting anything great just decent.  It was horrible.  Soggy crust with truly terrible sauce.  We ate 2 slices and threw the rest away.  I would have preferred a frozen pizza from Safeway.  Please do not think 'how bad can it be?\" and then order anyway", "author": "Mark W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-03", "description": "Their delivery sucks.  It's often late and burned.  I hate burned pizza.  The 9th Ave store is so much better!", "author": "Zakkary Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-13", "description": "Got some good calzone there once and then, some very greasy slices to go.  Had a delivery from there, some time later - the driver was having a bad day.  I've had bad days, too. Get over it.", "author": "David H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-09", "description": "Horrible pizza.  Even when drunk. No reason to ever go here. Much better food options prolifically litter the surrounding 2 block area.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-19", "description": "Well...Placed the order at 6'15PM. Waited a bit...Called a 7'50PM to ask about the pizzas. Now it is 8'10PM and I am still waiting for it.\n\nI guess I am gonna find another place to order.\n\nL.", "author": "Lewis G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-21", "description": "I can't understand why you'd run a pizza business without ever bothering to learn how to make pizza.    Then again, there's plenty of sloppy drunks from local bars to keep them afloat indefinitely.  I know because I'm one of them, on occasion.", "author": "Brandyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "We order from this spot at least twice a week. They make a MEAN pie. We eat at other trendy and fancy places like Little Star, too, but this place is always delicious and satisfying. Always. Super decadent and consistent!!!", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-22", "description": "you'll be drunk and you won't want to walk all the way to escape from new york, so you go here. you eat it and it's good, because... you're drunk.\n\nit sounds like if you order maybe you get a better pizza than the slices they keep in the weird heater thing, but it doesn't really compare to the Front Room location.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-01", "description": "I've only had their new-ish chicken something or other pizza and it's pretty damn good, I have to say.", "author": "L. Renee D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-01", "description": "not the best pizza in the world, but it does the job if you need a \"sobering up\" after having one too many across the street at amber. it's better when it's fresh.", "author": "James J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-17", "description": "I think folks have been a bit hard on this place. It's certainly not worthy of 4-5 stars, but their pizza is decent. Their slices tend to be better than their whole pizzas (which is a bit perplexing), and you usually need to blot the grease off once or twice, but they do serve up decent comfort food for $2.50. A whole pizza... with toppings... only $9.99 so it's a good place to grab cheap pizza for a party.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-05", "description": "pep slicer, yup it did the trick. wasnt the greatest, but id give it another lick or chance. mind you, i wasnt sober, so pretty much everything tastes good.", "author": "riz l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-14", "description": "After many failed attempts at finding the \"right\" delivery cheap pizza, this is it. I had 1 bad delivery order out of 20 so far. Order it with thin crust because the regular is too thick and of course keep all the coupons and receipts that's a discount too. For cheap not very fast delivery I hightly recommend 14th St Cybelle's.", "author": "A M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-19", "description": "you want a tip, go in about 30 minutes before they close, you can probably get a whole pizza from med to x-large for $5.  it's either a mistake or someone called in a order and didn't pick it up, but at $5, it's a steal for a whole pizza pie!", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-02", "description": "i go to cybelles because it's there, and thats really the only reason why. it's a couple blocks from my apt, a couple blocks from work, and the walk-out slices are not too bad (especially after some bar-hopping in the neighborhood).\n\n..but their delivery sucks. despite only being a few minutes from them, it always takes over an hour and its always burned. after more than a couple disappointing deliveries, i decided to just stick to slices.", "author": "El B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-25", "description": "honestly guys, it's pizza. if it's greasy, cheesy, and covered in meat, i'll give it four stars. plus this place is right around the corner. what more could a girl ask for?", "author": "D M."}
