{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I love this place. Great happy hour and really good bar food. Highly recommend the pizzas and chicken strips.", "author": "Joey A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "A fairly standard bar whose best trait is, as the name implies, a wraparound balcony offering great views of Market Street, in particular all the people-watching this entails. \n\nI love how the vibe here is fairly casual, as it's a bit too compact to be a dance club. Drinks, especially cocktail specials, are reasonably priced, and, overall, it's a simple, no-frills place. My pet peeve is having to pay a cover on weekends even after any special acts have ended for the evening, so if this is a sticking point for you, then beware.\n\nOtherwise, this is quite a pleasant hangout if it's not crowded, primarily for the balcony.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Great local gay bar.  Most popular on Sunday afternoons, and Friday/Saturday evenings.  Also popular during events.  Great place for drinks, people watching, and a snack.  Sometimes they charge a cover.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "GAAAAY!!\n\nloved it!!\n\nKaraoke night Monday was hella dope. I had the Rodney Special and sang my heart out. The bar service was awesome and everybody that worked there was hella nice. \n\nCan't wait to go back and have tons and tons and tons and tons of fun. (\",)", "author": "Rodrigo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "The lesbian parade on the Friday of Pride weekend is what brought us here, to hopefully grab a birds eye view of it while having a few beers.  Believe it or not, it worked!  We ended up with choice seats at the corner outdoor lanai. \n\nATMOSPHERE:\nThe bar takes up the entire second floor of a two level building at the corner of 16th & Market, right where the parade passes.  Plus, they have a cool but skinny outdoor lanai with a railing counter and bar stools that is excellent for people-watching.  The inside has some good square footage but it still can get cramped. \n\nThe crowd was a mix.  We met all walks of life while here, including a gay-friendly drunk straight girl traveling nurse that wanted to take my gay friend and possibly me home.  :-O  Thanks anyway, sister lol. \n\nThey have a full service bar and great music.  My Bud aluminum bottles were a mere $3 regular price, yes!\n\nSERVICE:\nThough I didn't experience it because all of my beers were purchased for me, my friends returned fairly quickly from the bar, so service was fast despite the busyness. \n\nFUN TIP:\nSomething that kept me entertained were the ding dong drivers at the intersection of Market, Noe & 16th.  Some drivers on Noe that were headed north would stop for some reason in the middle of Market, thus blocking traffic headed east on Market.  HONNNNNNNK and me SMH all afternoon long, lol!\n\nOVERALL:\nCool vibe & views, great prices, free street entertainment.", "author": "Vince N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "How can you not love this place! Every time I have been to the Lookout I've had a great time! Drinks are good, people are friendly and you can 'lookout' from the patio area on the interesting Market St intersection.", "author": "Roma N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Can't think of SF's famous Castro District without thinking about The LookOut! Probably my favorite bar to frequent in the Castro. Nice drinks, nice patrons, and entertaining shows!", "author": "Toshi P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-29", "description": "Well I recently moved to the Bay Area and my best friend was in town visiting. My boyfriend, friend and I decide to check out the Castro and go out for Halloween and to celebrate my birthday. We instantly see the lookout is packed and seems to be a good time so we decide to pay the cover, head in and order some drinks (even though the bouncer was a complete asshole.) Music was awesome and drinks were actually good and strong. We were feeling good and enjoying ourselves when this employee comes over to clear our drinks from the table and then decides to make some condescending remarks to us about \"enjoying the show\" and something about how we should order their new \"pumpkin spice drink.\" We couldn't really hear the dude because it was so loud but we all felt the same vibe from him....which was get the fuck out. So we instantly decide to close out our tab and leave. I don't even know or have the words to describe how he made me feel. It was clear he didn't like the fact that we were straight and wanted us to leave. His voice literally sounded like the wicked witch of the west. I'll never go back.", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I don't know why i love the look out. I guess because of the outdoor area. It's really nice . You can go out with a friend and drink and catch up with a view . The staff there were nice and so were the drinks. This place has definitely a chill vibe to it if that's what you're looking for. I like how you can take someone here and actually hear their voice when you're talking to them compared to other places around the Castro. I mean if you're just tryna get down on the floor I don't think this place is what you're looking for .", "author": "Joshua O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "Nice place but they charged me $65 on drinks on my debit card even though it was $54. Please check you card statements right away as bars like these will take advantage of drunk people and charge them more. I literally have a receipt in my hand right here for $54. I'm pissed.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "There is nothing more sexy than a bar with management who cares. From community outreach, to the support of local performers, to fundraisers, to special causes, this bar does it all. There are categorically distinct qualities which engender loyalty to businesses, and one such quality is knowing that the business stands by its clients, maintaining a singular level of support to their brand. While this quality can be seen in the small things, it is in the business's worst moments that they have a chance to show their true colors.\n\nI have always enjoyed The Lookout -- its staff, its view, its atmosphere, and its reinforcement of its local community. Nevertheless, I recently had an experience that tested my care for this fine establishment. The owner and management staff were excellent in their outreach and attentive in resolving my issue, and seemed to truly care about my experience. This echelon of service is how a business inspires confidence. \n\nThe drinks, food, and almost all of the staff are fantastic. Give The Lookout a Try!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "I popped in here with my boys after the Santa Skivvies Run nearby, to warm up from the cold cold cold outside, and enjoy the lovely view inside!  Granted we were there at 11:00 am on a Sunday when they were packed for an event, so I can't give the best impression of the general vibe of this place under normal circumstances.  But under these festive circumstances, I had a blast!  The music was loud and completely infectious, people were wall to wall but we could still talk and order drinks in a reasonable amount of time, and all the cocktails were well made with a smile!  And though I didn't partake, they also had a really nice patio area outside overlooking the street, so this just seems like a really cool spot to enjoy drinks and probably dancing, while the city vibe rages around you.  \n\nI had a great tipsy time, zero complaints!", "author": "Terri N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-22", "description": "Review for the Lips and Lashes brunch only: \n\n-Food: 2 stars. Mediocre and limited, but you're not coming to this for the food.  Breakfast burrito was very bland, but not greasy.  The cinnamon rolls were stale, almost burnt.  The tatchos (tater tot nachos) were actually quite good\n\n-Drinks: 3 stars. Anything that is premixed like the sangria or bellini with the mini Korbel bottle were VERY sweet and a little expensive.  \n\n-Show: 4 stars. Enjoyable and energetic.  Get your $1 bills ready!\n\n-Service: 1 star.  When we walked in, the \"host\" barely looked in our direction, despite being some of the first to arrive.  We couldn't figure out where we were allowed to sit or what would be optimal for the show, until he reluctantly told us.", "author": "Sona P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Fun 2nd story bar in the Castro. From\nThe Balcony on the LookOut you can see Castro  street people watch. The bartenders are sweethearts and they had a special for Jameson Cask, which has that special place in my heart. We went on a Tuesday night. It was relatively empty and a nice place to catch up with friends. Not sure what the seen is actually like on the weekend.", "author": "Claire G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-18", "description": "The Lookout is a fun bar, but honestly looks so much cooler from the street than it is. Once you are up there, you do have the patio to overlook market street, which is the coolest part. With that being said, the staff and setup of the bar on the inside doesn't really add anything. There are so many place to go in the Castro, and the lookout is in the middle I would say based off of quality. If You are only in SF for the night, I would check out other places, but if you are here for a while, the lookout is a decent place to visit", "author": "Ross S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "Went there tonight with three other people and waited patiently for the bartender. I figured I'm there and that's enough of a signal for any good bartender. He was helping the group at the end of the bar that was there before me I believe so all good. Then two guys walked in and he walked right past me to serve them cause he clearly knew them so 20 minutes later we left without so much as a word from the bartender.\n\nConsidering there were maybe 10 other people total in the bar it's not surprising you guys aren't doing so well with a bartender with that attitude. Plus there were rats which I can sometimes overlook since market Street is market Street what are going to do but that attitude will not bring in customers and I will be sharing this with all my friends.", "author": "Rachel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "The best view on a sunny day in the area! The drinks are typically tasty. Definitely the best bathroom situation - super clean and there's at least four so there's never a long wait! \nThere's a fun crowd most of the time. A great spot for visitors! Entertainment varies.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "My BGGF and I came here for the Lips and Lashes Brunch. It was great! We had a great time and the service was excellent. Super good vibe and the show was fantastic. \n\nWe did split the chorizo breakfast burrito and that was also really good. I do recommend when coming to try the Korbel Peach Bellini-Rita. But even if you dont their drinks are strong and taste delicious. Very good bartenders.", "author": "Heather T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-15", "description": "My boyfriend and I went on Friday night around 11 PM. It would turn out to be our worst visit. We paid $5 cover apiece to get in, and we head to the bar. I see a flyer for a cocktail named \"Hurricane Bianca\": Southern Comfort, pineapple juice, grapefruit juice, and bubbles. My boyfriend sees a flyer for sangria. Both cost $9.\n\nWe order our drinks, and I'm blown away by the Hurricane Bianca. Served in a tall hurricane glass with an orange wedge and a cherry, it tastes great and looks great with its citrus ombre. This beautiful cocktail saves my review from being one star.\n\nMy boyfriend, meanwhile, gets a short glass of an amber colored liquid. He tells me it tastes strongly of cinnamon. I try some, and I'm forced to agree. It tastes remarkably one-note. He goes up to the bar to ask how they make it.\n\nAt this point I should inform you that I've made sangria myself. I used a big glass dispenser where i soaked a couple cups of diced apples and oranges in a bottle of white wine mixed with some club soda and a little bit of apple brandy. It tasted pretty good. People liked it.\n\nMy boyfriend comes back. The bartender told him that the sangria was one half white wine and one half Fireball Cinnamon Whiskey.\n\nNow, Fireball sangria exists, and--though I haven't tried to make it--I don't think it would taste like the awful swill we paid $9 for. This is not a cocktail you or I would knowingly order, and The Lookout should be ashamed to sell us a drink that is clearly not sangria and tell us it is.\n\nWhite wine and Fireball do not make sangria. The Lookout charged us $5 cover and $9 for cocktails. The Hurricane Bianca was a knockout. The sangria was disgusting, fraudulent backwash.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Some Spot....Met my Husband here, he was a naked drag act...That sort of thing gets me going!!", "author": "Aideen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "I've always passed this bar and I recently just went there with a friend to check it out. I saw that they had Happy Hour and I got a margarita for $5 and it was strong. It wasn't too crowded when we went so there was a lot of breathing room. We went outside the balcony and it had a great view of the street, hence the name.\n\nI'd love to come back here again during Happy Hour for sure.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "I've definitely had better. Maybe, it was the bartenders or maybe it was bad luck on multipliable  nights. But, whatever the reason EVERY time I go there.  I either get no service or HORRIBLE service (non-tentative/slow bartenders). I'm a bartender so I can understand how it is when it gets busy but the attitudes, looks  and hostility made me not want to step foot in this place ever again.   \n\nI love the view outside.  That counts as one star... I should at least give two because I can bring my drink out on the balcony..... again, that's almost shouldn't be an issue either way.\n\nThe issue here is the bartenders, AVOID this place, if you don't have a buzz. If you do, by all means go in and order a drink and wait on the Balcony it should be ready about time your buzz goes away...", "author": "E. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Catching up with my reviews, I'm looking through the photos of places that I've been to and \"The LookOut\"  like most of the bars in Castro, have provided me a memorable experiences.\n\nDrinks here are fantastic and the bartenders are super friendly.  My BFF loves martini,  though it is not my drink of choice,  but who can say no to Vodka right?  \n\nTake advantage of their fantastic outdoor patio overlooking Market Street.  There,  you can definitely do your \"LQQKOUT\" and give your eyes a bit of an exercise!  After all,  it's okay to look as long as you don't touch as we \"coupled\"  relationship fellas would say!  Take my word,  you wouldn't want to come home and get your balls chop-chop!  :p\n\nSome of the advantages of coming here are:\n\n-great view from the second floor \n-outdoor patio \n-omg,  yes omg; they serve food!  Sip and drink and munch while you froth yourself and drool with all of the hot muscles walking by from the local gym across the street \n-Sunday's here are so much fun with a dj and with great music\n-everyone here are super friendly \n-it's a bar for everybody\n\nSo when you find yourself in this neighborhood,  LQQK no further but where else...  at The LookOut! \n\nUntil then,  Cheers!   ~ :p", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "My boyfriend was harassed at this establishment and when I reported it the security guard they talked to the accused and then did nothing to remove him from the premises. He was extremely drunk and later on that night another drunk customer who could barely walk threw up all over the floor and on our shoes. The drinks being offered were so strong and by the end of the night even i had a difficult time keeping up. They don't seem to care about much except packing this tiny place and putting their patrons as risk. If you value feeling safe and want to enjoy your evening you will avoid this bar.", "author": "Mitchell G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "This review is specifically related to the wonderful experience we recently had during a private event fundraiser on 10/1. The Private Events Manager, Nicole Van Ness and bartender, Rhonda made the entire experience extremely positive from beginning to end, including drinks, food and attentive service. \n\nWe all had a great time and I would highly recommend Lookout for a private event with the help of Nicole.", "author": "Keith G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Appropriately named for sure...the place to see great views and to people watch.  My friend rented out the mezzanine area from 12:30 - 3:30 on a Sunday afternoon for his birthday.  It's got a few tables and a couch with a long table.  Good for parties of about probably 20ish.  It does have a green house effect though because of the glass windows.  The f&B minimum for the room is $300, not too bad.\n\n2 unisex bathrooms - 1 with 2 stalls and 1 single use.  Booze was strong and standard price.  They were charging people $2 cover when I was leaving, pretty sure this is the norm for Castro (from what I remember from The Cafe).  Definitely the place to be on the weekends and scope everything and everyone out.  3.5 rounded up.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-05", "description": "I gotta feel sorry for the bar tenders early evening 1/4/2018 who although they made an ok bloody mary turned up the VOLUME on Will & Grace ALL the way destroying whatever cozy ambiance there was in the place.  As a former service industry person working with bar tenders I rarely criticize; but, this was over the top.  It was raining out too so I suppose the bar tenders were competing as real drips ... .", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "The bartenders plus all the staff I encountered were seriously awesome!!! They were all so nice, and very accommodating! I have nothing but good things to say about this place. I went here two nights in a row and they remembered what I drank! That seriously doesn't happen very often. So, I was flattered when it did. The bathrooms seemed pretty well kept aside from running out of ass hats (toilet seat covers) from time to time. Also, this place has kick ass music! Shout out to the DJ's big time! It's hard to find good mixes nowadays!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "I love the drinks!!! The ambience is the best. I love coming on Sunday's for the food and the drinks. I really enjoy myself here with my girlfriend. No drama very loving people. The bartenders are the greatest!! If you want to come for a good time in the Castro. This is the spot to go!!!!", "author": "Daisy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "I came here for Happy Hour, and they have pretty good deals. $4 well drinks, margaritas, and bud lights. (Their cocktails are not weak.) $8 sangrias, which many friends told me is apparently not worth it. My favorite is the $3 beer bucket deal because they put several special beers into one bucket leftover from an event, so there are basically \"limited edition\" beers that are not regularly stocked at The LookOut. It's also convenient that they have their food list and prices displayed above the bar, which probably makes the bartender's job way simpler.\n\nIt didn't take long to figure out why this place is called \"The LookOut.\" The outdoor patio area along the second floor is way cool! Great place to people-watch, if you're into that. Overall, this place has a good mix of people, and it's not too crazy or not too chill. Would come back here again for some dancing and drinks!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "Rude to my handicapped friend. I cannot leave much of a review. We did not go in because of their response to accessibility.", "author": "Matthew Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Drinks are gross. Bartenders are the absolute worst and discriminate. Vibe is weird. I'll never go back. You could literally have a better time with food poisoning.", "author": "Vic Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "I wrote a review on this place before as very clean and it's great to have a patio but caution!!  Every time I open a tab, close it then check the next day i always find extra tip added that doesn't match what I put on the merchant receipt.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "Not handicap accessible and the bouncer today was rude about it. Left and went to a different bar.", "author": "Kaitlin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-06", "description": "being san diegans we had a hankering for margaritas.\nthey weren't good here at all.  we learned our lesson.\nbut this is a nice place with a view and you can tell the locals love it.  nice music and playing mean girls on tv.  i liked it!", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "The LookOut is nice place to drink because it has a outdoor patio overlooking the intersection of Market St, Noe St, and 16th St.  I typically like the music they play here and enjoy the DJ's.  The only downside to the place is that with all the windows and wood floor, there is nowhere for the various sounds to be absorbed, so it's loud.  The bar also shares the space with a restaurant that serves pizza.  I've never ate there, so I can't speak to the food quality or menu.  The place is poorly setup, so the restaurant side of things is completely out of sight and out of mind.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-22", "description": "Well hello there Hella Happy Hour. I recently discovered the Lookout on a recent trip out to the Castro for cocktails. I'm somewhat of a light weight now, so I needed a little something something.\n\nHere's a little tip: If you are going out in the Castro, you need no pre-gaming, just some food before you hit all them two-for-one specials and dance clubs. Woo-Hoo, believe me...I learned my lesson. \n\nI ordered the 21st Amendment's Watermelon Beer. It's light, yet somewhat filling and fruity. Perfect for drinking with a meal or BBQ type foods.\n\nWe ordered the Hawaiian Chicken Sliders and the Mini Corn Dogs. Both were really amazingly good and what a deal, everything is cheaper during Happy Hour!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "I have been curious about this place for the longest time so when a friend and I were out walking around, we decided to go inside. \n\nOther nights, I've seen the Lookout balcony REALLY packed. It wasn't so crackin' the night we went (Thursday). A decent crowd. More like a bunch of intimate groups.\n\nMy friend and I ordered Amaretto Sours ($6 each) and I tried to order tacos. They have a kitchen menu but the kitchen closes at a certain time. \n\nAmaretto Sours were good, just a little syrupy. \n\nLookout balcony would have been more interesting if there were actual things happening outside. Some nights are probably more interesting than others for people watching so I'm assuming that's part of why the place itself wasn't really filled that night.\n\nPretty cool place. I wouldn't mind going back. It kinda broke my heart to see so many handsome gay men I couldn't have for myself though.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-07", "description": "I'll echo what other folks have said here. The balcony is great on sunny days and for drinking cocktails and people-watching. \n\nThe service however, is REALLY bad. The bartenders have the worst attitudes and act like its a big inconvenience to serve you. Especially Jimi. I am a good tipper and used to work as a waiter, so am always polite to staff. In return you get bad attitude and crappy service. Not worth it for the price of drinks. Two stars", "author": "Jay K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-14", "description": "Last stop before my flight back to Las Vegas :(  I really wanted to check out the Castro district in San Fran.  My friend took me to this place as they had a nice outside balcony area.\n\nThe thing that makes this place stand out to me is the location.  Definitely the location.  It's in the middle of the intersections of Noe, 16th and Market.  Yes, definitely a busy intersection.  The cool thing is you see all the action. \n\nThe place is alright.  Little small and the outside balcony fits a few people.  The bartenders were nice, but definitely could see a not-so-pleasant side.  There were a few instances where they snapped at guests which surprised me.  \n\nMy visit was in the day time, however, I would like to return to this place to check out the nightlife and get a better sense of the place.  Hopefully my rating will change for the better.", "author": "Rockne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "The Lookout is always a fun place to come to with friends.\nThe drinks are good, bartenders nice, and the people make the atmosphere enjoyable. \nWhen I drink I like to think I'm a very happy and nice person and will assume everyone around me is too. Well, I usually get that here. People are really nice.\nAnd that balcony... I it's so fun to people watch. To just sip down a nice beverage with your friends and take in San Francisco and it's wonderful people.", "author": "Eff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "My first gay bar!  WOOOOOOO!!\n\nIt was St. Patty's Day (I know I'm lagging a bit on this review HA!), and I was more than stoked to get crazy in the Castro with my girls.  \n\nSCENE:  Great eye-candy \nATMOSPHERE: Think disco ball, colorful lights, and lots of dancing.  \nMUSIC: Not your slow bump and grind scene.  It's more Kesha, Britney Spears, Katy Perry.  \nSERVICE: Our bartender for the night was the sweetest thing ever.  Free lollipops for everyone!  Oh and did I mention the drinks were dangerously delicious?\nAnother highlight of gay bars - the little girls' room is NEVER crowded!      \n\nThere was definitely no shortage of delicious men, free shots, and lots of dancing.  It's everything I imagined a gay bar to be and so much more! :D", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "I'm writing about some awful customer service I experienced at The Lookout this past Monday evening around 10:15 p.m., on September 26th.\n\nI had to use the restroom, rather urgently! Upon my arrival I noticed the bathroom was not only filthy, but each stall was out of toilet paper. I attempted to use the single bathroom, but it was occupied. So I approached the bartender who was just standing there, he was not busy, and let him know there was no toilet paper. He looked as if I was insane, and then casually said \"oh yeah, we're all out\" as if that was an acceptable response. I paused for a moment, surprised by his reaction, and said \"ok, so what are you telling your customers then?\" To which he then said, \"well I don't know, no one has ever asked for toilet paper before!\" Im not kidding, he actually said that. That cavalier response combined with his complete lack of customer service skills were annoying enough, but even more so because I reeeally  had to use the bathroom! I asked him if he was the Manager and when he said no, I asked him to go get them. According to him the Manager was unavailable. Finally, after arguing with him for a few minutes he reluctantly agreed to go find some toilet paper. This entire time I did not see anyone else buying drinks or needing help. And there was a second bartender on duty anyway. \nHe then leaves the bar and is gone for a few minutes, and returns with no toilet paper. Next, he disappears for a few more minutes and eventually returns with a single roll of toilet paper and just sets it on top of the empty dispenser in one stall. Meanwhile the second stall still has none. He says nothing to me and proceeds to just go back to the bar. As he passes, I said \"thank you.\" Even though I would have rather just said a few expletives. \n\nEven if I felt better and relieved, quite literally, that whole encounter left me with a bad impression and I chose to just leave. Why on earth should I spend my money at a place where the bartender thinks that its ok to treat his customers that way. While I'm  sure people that work in a bar have to deal with crazy or drunk people often, that does not entitle them to provide horrible customer service like that. The bartender was rude, condescending, and flat out lied just because he didn't want to do his job which includes more than just standing there and expecting a tip for just pouring a drink or opening a bottle. \n\nI certainly don't plan to go back there anytime soon!", "author": "L. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "There's cheap drinks and a nice place to look out and people watch. I like the open windows and balcony here. The drinks are good priced and very strong in alcohol content. For credit cards, there's a two drink minimum though.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-08", "description": "Beautiful! FYI: The hours I had my fun was during happy hour on the weekday in the early afternoon! Not too busy, lots of seating, yummy snacks, and perfect drinks (strong ones) to make the hours definitely happy! I liked how there were a few nice lounge areas near the glass windows to LOOKOUT and view the part of the Castro. \n\nVery modern. Even the bathrooms were something to LOOKOUT for. Who has blue light hand dryers in their bathroom?! Well, the LOOKOUT does! \n\nJalapeno Poppers were nice and spicy, well mildly spicy.\n50/50, the french fries and sweet potato fries were large enough for 2 people.\nAnd again, the drinks offered during happy hour were strong! Even though I was craving a drink that wasn't on the menu, the best bartender ever made a creative drink and oh yeah, def hit the spot!", "author": "Christine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "One of my favorite spot in the Castro!\nThe view is amazing! Come early, the place gets packed fast. Drinks are nice and strong and the selection of beer is decent. This bar is worth checking out if you're ever in the Castro.", "author": "Mya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "me and my partner came here on saturday night and had a great time. The balcony alone is worth coming for and great for people watching, i dont think you can do that anywhere else in sf like you can here. The crowd is always friendly HAAAYYYYYY! \n\n:)", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "I like Friday happy hours at the Lookout. They've got $3 Skyy cocktails starting at 3:30pm which nobody in the Castro could beat that. Sometimes I'm in the mood of premium vodka drink and I'll have a Goose cosmo and it's just $8.50 during happy hour. It's the great place to jump-start the weekend. Depending on the weather, I like to sit on the balcony that affords the neighborhood's premium spot of people-watching.\n\nI like the connecting room to the left side when I want to hang out and chill with friends. You just walk over to the bar and buy your drinks. In the lounge area they have high tables and a couch. As for food, my staples are the carne asada and pollo verde tacos are tasty. You get two for $5.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Such a great experience! I've been coming here for a decade now and love the staff, with their love and kindness. It's definitely an open arms community, and a wonderful rallying point. With a food menu, ninja-skilled bartenders, and variety of events it fits just about every peg you could offer. If you want huge crowds and thumping dance beats, they've got them; if you want to catch up with a friend over drinks on the balcony, they've got it; if you want a throng of every sexy gay man at your service, they've got them. Tip to the wise though, pick your nights. Sundays are packed, Friday and Saturdays are high energy, and every other day is sublime. These guys deserve best gay bar 3 years running!\n\nNot to mention the reserve room!", "author": "Brad F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "This is a gay bar not a frat house so straight people check your privilege at the door. No one wants to see drunk straight preppy guys taking their shirts off and making a fool out of themselves. And straight girls you need to stop with the \"woo woo\" what is that? I give this place 4 stars because it's great once the obnoxious dude bros and marina girls finally leave. Maybe putting hardcore porn back on the tvs will help.", "author": "Derek I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-21", "description": "It's a fun place for all ages. And when I say all ages, normally best for 21-50 years old. The drinks are reasonable, and the staff is nice and rude. But of course not all at the same time. There's an outside patio, and you can smell the death outside because people use it to smoke. And I don't mean dick.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "fun place but roofie central...watch your drinks.", "author": "Ernest S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-25", "description": "Weak drinks, lack luster interior, rude staff. So many more venues surpass this place. Management and people looking for a place to go: send me a message and I'll give you some better recs in the hood.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-13", "description": "Bro-y gay scene with free wings on Friday nights (they're alright). I think they have a real menu somewhere but it's so packed I just ordered something random that was too sweet. It is SO HOT in there. Then everyone's smoking on the balcony. Sigh.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Nicest bartenders you will meet! We attended a birthday at the Lookout and had a blast! Drinks were flowing, Deejayed music, funny videos playing and oh the people watching!", "author": "Psusennes R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "This is one of my hood places I usually go for drinks.  Bartenders are very friendly.  Drinks are great (you can use CC there).   There are lot of views and you can sit outside and enjoy the beautiful scenery.\n\nI had one billing situation and emailed my concern to Gregg (GM) and Chris (owner). The billing situation was resolved quickly in a day, and I am happy with that.  Very professional and sincere guys.", "author": "vadim m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "I like the energy in this place.  There weren't douches on site (Thank God they stay in The Marina a lot). They had a male gogo dancer that was shaking his bits to the groovy tunes blasting inside the bar. I was surprised that he was a regular looking guy.  I was expecting someone ripped or \"muscley\".  The guy knew how to dance and make it clap though. I liked the music that was playing and it really made us want to dance. Too bad me and my girlfriends were the only ones dancing so that was quite awkward. \n\nI like being able to \"look out\" onto Market Street. There's a lounge area in the back with a full view of the bustling street and it looked like it would be a perfect spot to hold a party. The fireplace and squishy seats made it look inviting. Outside, there's a balcony where the fire breathing dragons congregate so that they can keep their cancer fumes to themselves.  Even though the balcony was in open air, the smoke somehow lingered in the vicinity and made me start wheezing. I used to be a fire breathing dragon a couple years ago so I was really surprised that their fumes affected me.\n\nBecause I was sober driver for the night, I wasn't able to try their $5 drink special that my buddy Kassidy loved. It was a rum punch type of drink which she happily guzzled within minutes. It smelled good and I saw that they put a good serving of alcohol in it. I hope they have this special next time I visit. I noticed that they had a food menu but we weren't able to try it because my friends wanted to try another bar. I want to go back here and try the snacks.", "author": "Shirleyanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "The LookOut is a cool bar! there is a fee to get in but either than that a dance floor, sexy gay men, and awesome drinks make it up.", "author": "Galya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-15", "description": "Jimmy Jimmy Jimmy! \n\nCool vibe, friendly bar tenders great food. \n\nSliders: were oh so delicious, they literally melt away in my mouth, I cant believe it took me this long to try the food. \n\nhas a very nice balcony so you can have a nice view of the Castro night.", "author": "Juana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "perfect place to go after Sunday bottomless mimosa brunch if you want to experience the Sunday shitshow!\n\npeople watching is one of my favorite things to do, and the crowd inside as well as the balcony that overlooks Market Street provide ample opportunities to do so.\n\nthis place is FUN! just beware the stairs on your way out... handrails are your best friend!", "author": "Sam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "this establishment reminds me of the wrong cruise i took once\n\nkiddin, they sponsored our softball team and was the 2nd gay bar i stepped into in sf.  first being the old kimo's on polk pre g word, pre tech boom 2.0 which i popped in unknowingly.  lets face it the gays know fun and they know how to party\n\nbig fan as the people, food and balcony view here is all worth it.  strong drinks and fair prices as they make a pretty mean thin pie too.  if your up for a happy vibe w/good folks, good laughs, dancing or people watchin on a sunday afternoon or evening for that matter...you've found it\n\nphobes and fun police not welcome", "author": "Clark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Came here after the 49ers NFC championship win, and the place was packed! The outdoor deck was pretty nice. And for as packed as it was in the bar altogether, there was still an OK amount of room to walk around here. For as busy as it was, the bathroom was never so busy that I had to wait in line. There was a good amount of urinals (might I add, clean ones) that were available to use. And there was actually soap and a working hand-dryer.\n\nThe drinks were OK. Albeit, they were cheap, but they were mixed only OK.\n\nThere was a DJ, but it's not exactly a dancing type of bar. Unless, you're that one random go-go dancer in the corner.\n\nI would probably come back for another chill afternoon-drinking. It's not exactly a final-destination type of bar, I don't think.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-21", "description": "The beer bust parties are the best at this venue and although the view should give this place a few more stars, The LookOut always seems to fall a bit short.  Once you find the door (located next to the nutrition shop on the corner in between Squat and Gobble) and walk up the stairs you'll be greeted by an ever-so-not-very-friendly doorman or tranny sitting down looking as if they live the toughest life known to man.  Your job isn't that hard, so smile because at least you're getting paid.\n\nFirst thing's first... a drink!  The bar is pretty accessible considering it's located in the middle of the room and takes up half the floor, so once your find your spot you'll be greeted by another not-so-friendly bartender serving your drink.  They do their job and that's about all you can ask.\n\nOther than the service needing a boost in energy and enthusiasm this bar isn't so bad. Grab a seat outside if you can and enjoy the view of some of the Castro.  I give this place 2 stars because of the experiences I've had here with the staff.  Not the worst of times but The LookOut could work a little harder.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-21", "description": "$4 cranberry vodkas\n$3 basket of french fries\n\nThere's a great view to \"Look Out\" from and over Castro. The entrance is next to Squat and Gobble where you'll find a staircase leading upstairs. Friendly bar. I only wish the drinks were a bit colder! Had to led the vodka and juice mix around the few small cubes of ice for a little while.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Cool place to sit upstairs and have drinks and overlook the Castro. The fm drinks are fairly cheap here too.", "author": "Aman S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "3.5/5 margarita time!\n\n$6 for a margarita bar. they serve you a full glass of just margarita and a little sweet and sour. then you take one of the pitchers full of juice/nectar and flavor to your own taste. after 1 you'll be good, after 2 you'll be better!\n\nthey have a few regular shows and events here, so it's always a spot to hang and have a good time.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Great place for people watching on the balcony on a sunny afternoon. Drinks are well priced, staff are friendly, and the music is good.", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-15", "description": "I suspected the onset of a headache, and oh did it come..\nI feel like a car crash progressing in slow motion, frame-by-frame whenever I end up here.", "author": "Ty T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "Amazing and enormous margaritas! Depending on the night (or how cold it is) I love the balcony here that overlooks much of the Castro foot action (yes here, not so much on Castro/Market or 18th/Castro like you would think). What makes LookOut better for coming on the regular is that it always feels cleaner than the other Castro bars, they take plastic and the crowd is good. \n\nPS- Blue Star from the cocktail menu and $3 well drinks happy hour on Fridays FTW! http://lookoutsf.com/menu/main/", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "I just love this place with balcony to do people watching! Besides the have Chimay on the tap! How could I resist that! The best Belgian Ale for sure! Also had the tex-mex style queso, the cheese dip was absolutely yummy! Will upload more pics later!", "author": "Lang C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-20", "description": "It's definitely not my favorite bar in The Castro and it's not the worst by far, so how does this place get a solid five stars above all of my other spots in The Castro? \n\nTHEY SERVE FOOD!\n\nI don't always want to leave my seat at the bar and have to go out of the bar, down the street and eat, only to return and find I have my seat taken and everything else is crowded.\n\nThe fact that this place serves food makes it my go-to spot when I'm hungry and thirsty and want to kill two birds with one stone. Also, you can always catch a sports game on one of their TVs. I've come here many times knowing that I'm guaranteed a seat, some great food and a good time.\n\nKudos, Lookout. I didn't like you much at first, but I've grown to love you.", "author": "Trav M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "This is a fun little venue not to be taken seriously. Their balcony area seems to cause more disturbance than it does good. People randomly keep going in and out and when they get where they need to be, they don't seem to know why they're there. The drinks are a good deal in comparison to other bars. The music is fun. The crowd is laid back and friendly. Pretty much anyone you talk to here randomly will have a conversation with you also.", "author": "Ee Vonn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "ok... Gay, Straight, Bi, or totally confused...  Whatever!  This place is THE place to let it all hang out.  From the front door ID check to the rock hard fakies I squeezed on the Door Lady ~  Everyone feels welcomed and a part of the gang here at The Lookout! \n\nI can't remember the name of the absolutely incredible bartender ~ THAT is how GOOOOOOOOOOOOOOOOOOOD his drinks were!  \n\nThere were games & prizes, there were drinks, there were shots, & I swear the sexiest man in the bar tastefully gave it a go at my boyfriend.  Totally flattering.  I had to say a few good words about the Lookout and post some fun photos we took while we were there since I thought some of the photos already posted were a bit silly and boring compared to our experience.  I will be back, everyone!  See y'all at The LOOKOUT!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "Bronzed, they roam cradling cranberry \nvodkas against their puffed out chests \nand place perky lips on double straws\nto suck up the liquor which travels\nstraight into their eyes which gleam\nat the pair of slight shoulders \nwhich greet the bouncer with twin\ndollar bills to join the Sunday frenzy.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "Honestly fuck this place. The girl bar tender last night was amazing and so kind. She made me a drink around 1:20 so it wasn't technically last call and I was just going to buy a shot. Well it was 1:49 and one of the workers snatched the drink out of my hand and tossed it when yea I get you close at 2 but what the fuck to snatch it out of my hand is just pathetic. That person I feel sorry for because they must have a shitty life to do that to someone. As a customer service representative I am disappointed. I spent 12 $ on a stupid drunk that I didn't drink. If ur gonna be a nasty person then don't fucken work at a bar. DUH?! Work somewhere u can handle since there's no patience what so ever in your life. So dumb. Any who don't come here if ur in San Fran so many better bars. No one was even here and it was Saturday night!!!! The bar down the street would have been a better choice. Fuck this place", "author": "Linda F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-22", "description": "If this bar assumes you are drunk they are very rude. I have never been drunk at this bar. Lost my sunglasses there and was reprimanded for asking.", "author": "Maiku B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-24", "description": "so, i don't really know what the hell is going on right now.    these nerds are throwing bean bags and everyone is leaving on a tuesday night.   maybe this is a one time thing, but do not come on tuesday horseshoe night.    i used to really love this place too.   bummer.  \n\nupdate.   i went back on a sunday afternoon and had a lot of fun.  maybe it was just a random weird tuesday gen-y thing", "author": "Eric - Bo -Dereck A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "as a visitor to san fran the staff are really welcoming and the drinks are just right.. like your local bar .", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "Brain Farts with Pollo del Mar last Monday was fun. It wasn't very crowded which was a plus and minus. Plus because we got our food and drinks quickly and minus because it wasn't AS rowdy as I hear it usually is. However, the theme was \"rain\" and the questions were good. \n\nI'm not a trivia whiz or a competitive person but I do enjoy an occaisional quiz night with friends. Pollo of course is highly entertaining with her quips and comments that are both loving and deprecating. Group names were naughty and full of inuendo and I love that winners get free shots.\n\nThe food was really good too. I had the Mission Steak Wrap. Came with crispy shoestring fries and my friend had the sliders with sweet potato fries. Very yummy.\n\nGo to Brain Farts on Monday for some good, well priced eats. Work your brain and be prepared to laugh and get your drink on.", "author": "Lianni C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Absolutely love Monday night karaoke here! Super cool crowd, great drinks, and very cozy, comfortable seating and great views of the city all around.", "author": "Terry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "The lookout is a great bar, with some lovely bartenders and great deals on thirsty Thursday as we call it! Great establishment and I love that you can sit outside and see most of San Fran", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Good food and drinks. They accidentally overcharged me $2, and when I called about it the owner of the restaurant personally called me, apologized, and refunded my entire purchase on venmo 5 seconds after getting off the phone. It was very sweet of him! That and the balcony is dope too!\n\nFinally, on Sundays they let various gay sports teams and other organizations do fundraisers at their establishment, for which I give them mad props! Good food + friendly people + positively affecting the community = 5 stars!", "author": "Marko J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "Every time I happened to be by the LookOut there was a party raging. Day or night, it seemed the music and good times were neverending.\n\nWell, I was kind of wrong in my assumption in that I got there a little after 2:00 p.m. on a Sunday and it wasn't poppin' at all. The oven wasn't even fired up yet! So my friend and I sat on the balcony, sipped back some beers, and waited for the kitchen to open up at 3:00. \n\nWe ordered a feast, by the way. Sweet potato tater tots with chipotle aioli, jalapeno poppers (I swear we did, even though I don't see them on the menu), and a sausage pizza. \n\nOur food was placed in front of us just as the music started. It was though they wanted to give a soundtrack for the party that was about to happen in our mouths. The place started to fill up once the music started, but my friend and I stayed at our prime real estate on the balcony overlooking the Castro. I want to go back later at night to check out the night scene, even if it means foregoing the snacks. I'll save my day-drinking and dancing for Lime.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "A pretty fun place - not as crazy on a Thursday night as I thought. And, a nicely diverse crowd. Overlook in particular is fun.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-30", "description": "\"LookOut\" makes me think \"makeout\", which I love to do. But do you know what else I love? NACHOS! I enjoy the crunchy, cheesy delight so much that I eagerly answered \"Nacho!\" when a Starbucks barista in Santiago de Chile asked me for my name. Unfortunately, she decided to feminize mi nombre and wrote \"Nacha\" on the cup instead. Bitch.\n\nCan you tell I love nachos?! \n\nI was especially horny for them after a few drinks last week and the chicken nachos here really scratched my itch. I don't remember much about the divine dish except the cheese was melted shredded cheese as opposed to the liquid-y Velveeta kind (which I love too). This is seriously a great snack for drunken fools but watch out when I'm around because I will eat the whole plate! Rawr!", "author": "Suany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Loved their music, drinks, and the view. I have not danced that crazy in ages. Everyone around me was great, so apparently great people come here. I had so much fun and I think this is going to be my new place to dance and party at. AMAZE-Balls!!", "author": "Sunny E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Omg. Fun all the time.  As a straight gal it's sometimes hard to get a drink but just switch bartenders and it will be ok. I like it how there is food until past 9p. The balcony is a bonus - one can do fun people watching.  The bar has anything from crazy dance nights to chill karaoke evenings. Drinks are strong. ;)", "author": "Zita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "I absolutely Love the LookOut! It is fun, the margaritas are killer, and by killer, I mean \"locked in a bathroom because I cannot find the door out as a girl is chasing me around trying to take off my pants\" killer.  Pretty much every time I go to the LookOut, it either ends my night by making me need to go home, or it ends my night by making sure I don't remember the rest of it.  Either way, it is one helluva good time.  I highly recommend \"fishing\" off the balcony, which basically entails dropping crumpled dollars and waiting until someone picks it up. You can yell things like \"you are so close\" or \"ALMOST\" but not tell them what it is about.  When someone finally gets the dollar, make a huge scene and make sure you see nipples.  It is a blast.", "author": "Dick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "They serve pizza here? \n\nSeriously?? And people go there for the pizza?\n\nI've only been the bar, which judging by the go-go dancers they've had on duty there, is where they hang the extra sausage and pepperoni . . .\n\nLame culinary jokes aside, LookOut is an excellent place to meet for an early drink - the bartenders, in classic Castro style, do not mess around when they mix . No, there's nothing wrong with your drink. Yes, you idiot, you can't taste the tonic because it's all vodka.\n\nThe music's adequate, the crowd's festive, but the clincher is the balcony, which lets you chat while you watch the wildlife parade by below.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-13", "description": "I've only been here once.  But i quickly found out that this is the spot to be at after Sunday Brunch.  \n\nThis is how Sundays go in the Castro:  Eat at Lime and then shoot over to The LookOut for the after party.  Then once nightfall hits  dispurse to the clubs of your choice later on that night.  So you start at 9am and end at 2am.  and the LookOut is definitely on the list of things to do on a sunday!    \n\nI'm a pro fag hag and i LOVE to be around my gay men ;)  I love that the bartenders are feisty.  I love that there's a patio that wraps around this place.  I love that the drinks are reasonably priced.  I JUST LOVE THIS PLACE.  \n\nLOVES IT!", "author": "Marie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-29", "description": "Rude!!!  Came to Castro with friends to spend the day trying out the different bars in the area. We were having a blast until we walked in the Lookout. It was early on Saturday evening - not busy. Door man was extremely rude to us for no reason...and so we moved to the bar to order drinks and the female bartender was just plain disrespectful and seemed as if she didn't like her job or the people \"customers\" she was serving.   Had one drink and left.  Very disappointed the only bad experience of the day the rest of the bars and restaurants in the area were super fun and welcoming!", "author": "Zoey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "Cool space on second floor with glass on all sides overlooking Market & Castro, and long deck with stools. $3 cover on Saturday is a little silly. 90% gay males. A little dead for a Saturday. Limited beer selection and slightly overpriced.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Good place for post sunday brunch, and to perch on the balcony and do some people watching.  Very lax atmosphere for a sunday afternoon.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "Lookout is I would say 1 of the standouts of the Castro bars. \n\n- It's a good place to grab a drink, maybe food if they're still serving it, or just hang out with friends or a date in their outside patio \"looking out\" over Market Street. It's somewhat shielded from the music blaring inside so a conversation is POSSIBLE to have, that aspect alone makes Lookout one of my favorite bars in SF/Castro. \n\n- the crowd Is hit or miss though. Most likely due to some days having a cover that's substantially higher that what they charge at the more popular Badlands. \n\n- Drinks are moderately priced and are made well. No complaints there.\n\n Overall cool place to \"See & Be Seen\" up top. Not a place you will stay in all night but definitely worthy of  a spot in anyone's Castrol Bar Crawl.", "author": "Lorénz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "been wanting to go there for a long time. sadly at 11pm on a Friday night (my birthday), it wasn't super crowded but the music was good, the patrons were friendly and the bartender gave me a free beer for my bday. i'd like to go back when it's more crowded to get the full experience but i did have fun looking out over Market Street and hanging with my girlfriends.", "author": "Tera K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "It's a man's world in here. (I kinda wished I was a good-looking guy when I came here my first time).\n\nStill, I had a ton of fun with my co-workers, kicking back strong (cheap!) drinks and munching on tasty happy hour snacks like sweet potato fries. \n\nThe person I appreciated most here was the DJ. He was so determined to play that song, keep me dancing (dancing) all night (all night)... No joke, we requested a song by the Killers and when he didn't play it for awhile, we asked him again and he assured us he hadn't forgotten, he was just waiting for the right transition. Smoother than Dr. J. \n\nThe bartenders could crack a smile every once in awhile (I mean, it wasn't like there was a maddening crowd or something) but maybe it was too early in the week for nonsense. Anyway, had a good time and it made me look forward to more hangouts at the Lookout.", "author": "liz c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "This is a happening place most of the time I understand. We went Sunday afternoon and it was really hopping and a fun place to be. The drinks were well made and I love that they offer SKYY vodka. I tried to buy one of their cool t-shirts but they were out of medium ones. The boy dancer was very hot as well. Jimmy the bartender was the best.", "author": "Steven J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I can't believe I've never written a review for this place. I probably come here once, maybe twice a month and I've always had a good time. I've never had the food or been there on a Sunday (when there's apparently always a fundraiser of some sort going on) but on both Fridays and Saturdays this place is pretty fun. \n\nFridays can be hit or miss as far as the crowd goes (I don't think they have any sort of theme/promotion on this night), but it's never too crowded and for the most part it's friendly. Saturday night is when they have \"Social.\" This entails a $4 cover, better music than on Friday, and for the most part a \"prettier\" crowd. \n\nThe thing I really like about this place is that it's one of those bars where it can be whatever you want it to be. There's a couple areas where they have tables and chairs inside so I if you wanna sit there all night, in a t-shirt and jeans, and be casual it's fine. If you wanna dress up a little more and stay near the dance floor that's fine too! There balcony is always fun for people watching down below and I've had some interesting conversations with random guys out there. \n\nThey have a full bar, standard drink prices, and pretty hot bartenders. Good times all the way around :)", "author": "George A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "Great location, nice view overlooking the crazy intersection of Castro/Noe.The owner is extremely nice and responsive and contacted me after my initial review to inquire why I had misgivings. I thought about it and it isn't the place itself -- it's that the patrons tend to be a bit more \"clubby\" than I am.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "Quickly becoming one of my favorite bars in the Castro.  Awesome balcony, good drinks, and fun crowd.  I came here on Saturday night of pride weekend and had a BLAST; good amount of people, but much calmer than the mayhem of pink party.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-23", "description": "The restaurant section is totally B.Y.O.B. (Bring Your Own Bear) or at least binge-and-purge-worthy because the portions are huge and the carbs are free flowing!  It's far from fine dining, but decent for this culinary-starved neighborhood.  The appetizers tend to have the most unique arrangements but the deep dish pizza is decent.\n\nItalian Nachos: I never never never thought I'd find such a unique and tasty snack at a Castro bar!  Pasta chips kind of taste like pizza dough made into chips.  The asiago cheese and Italian sausage are what really makes the dish because they beat queso blanco and chorizo any day!  The tomatoes, peppers and olives add a nice contrast but were merely wingmen to the aforementioned stars of the party.\n\nCheese Fries: Pretty boring.  After having such a great asiago cheese on the Italian nachos, I expected more.  Both cheeses were bland and melted on... cheez whiz would have even been better.  Definitely avoid as there are much better ways to have your carbs.\n\nChicken Club Deep Dish Pizza: Why put the chicken as the headliner when there is yummy bacon and ham?  My pizza expertise is more in the NY-style realm, so I can't comment too much on the attempted Chicago-style authenticity.  It was tasty, but super filling.  I didn't like that the parmesan cheese offered was powder rather than something freshly grated.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-01", "description": "Finally made it to the Lookout for Halloween! It was overly crowded but tons of fun! Great view. Had the \"fish bowl\" drink, creative touch =)", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I love this place! I love the vew, the drinks and the attention. It is also great for private parties. The food is delicious too.", "author": "Tatiana Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "Me: \"It's loud in here!\"\nWife: \"What?\"\nMe: \"Yes! Let's go out onto the patio!\"\n\nMe: \"Ah, that's better. It's kinda cold up here.\"\nWife: \"Yeah, but the beer is good.\"\nMe: \"Yeah. Hey, did 50 more people just crowd onto the balcony?\"\nWife: \"Looks like it. Nice view, eh?\"\nMe: \"It sure is. Honey...I'm old. And straight.\"\nWife: \"Pilsner Inn?\"\nMe: \"Yes, please.\"", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-05", "description": "The Lookout is a great place with a nice view of a busy city intersection. The crowd is good looking and friendly, the drinks reasonably priced, and they do a lot of fundraisers for good causes (my friend's softball team, tonight), which I like a lot.\n\nIt's a great place to pop in for an hour or with an out-of-town guest. I like it.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "The wonderful service alone is reason to visit.  Michael and team are about the best bartenders in SF!  The drinks, decor and the view from the balcony are pretty awesome, too.  Great location for happy hour!  I'm happy to report this bar doesn't attract twinks or bachelorette parties.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "I've recently went to this place because my friend was surprised that I never been to a gay bar and he told me I need to see how amazing and fun it is because I'm missing out and honestly I do admit he is quite correct! This bar I believe I can't quite remember has happy hour till 8pm because I was there around 6pm on a Friday and got $5 Margaritas which is a must get because it was in such a big glass and was quite delicious, if my friend didn't take too many shots I would've ordered another round. I love the atmosphere everyone was so jolly, the staff members were so friendly, and the music really makes you want to dance and smile. Even though this spot gets packed real fast there is enough room to walk around expect the patio when that gets crowded its quite difficult to get yourself out and back to the bar. The bathroom has two unisex and one gentlemen single so ladies don't get freaked out when you find men in the restroom, its perfectly fine.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-25", "description": "On Sunday October 24th I met a friend at Lookout at 5:30.  I have to tell you -- I was one happy patron. \n\nI'm very much a SOMA DADDY type, and with my bar I work a lot and don't get up to the Castro more than maybe once or twice a month to hang out for drinks.  Usually I go to 440, which I really like.  \n\nI've been to LookOut a few times -- but yesterday was amazing.  The bartenders are top notch -- they totally pay attention to all the patrons.  I know when I bartend I totally like to let patrons knows I'm more than happy to serve them another drink when they are ready....but when I go out -- I usually have to beg for a drink - or the attention of a bartender.  Not the Sunday Lookout guys -- they all knew what I was drinking, they all checked in -- all a lot of fun, polite -- good team.\n\nWhile I still plan to get to 440 a few times a month -- now I will have to include LookOut on my Castro stop -- with amazing service from these guys -- it's my new joint to hang.\n\nKudos!", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-26", "description": "This is one of those places where if you don't come armed with a pose, you're probably not going to have a good time. That or I'm a horrible loser, but I'm just going to go with the first choice. \n\nMy co-worker and I came here and were slightly annoyed by the stupid $5 cover. I thought this was a bar? Since when do you have to PAY to get into a stupid bar? And I just wanted a water (I don't drink) and it took 10 minutes for the bartender to hear us because the music is so damn loud and everyone is screaming...because the music is SO DAMN LOUD. \n\nI don't go out to the Castro a lot, but from what I've noticed there's 3 main groups of people. The good-looking, the bad-looking, and the medium. All the good looking guys come in gangs, the bad-looking guys come by themselves, and the medium-looking people come with their friends. And the problem is is that the groups never really talk to one another, and honestly I dont know how anyone can just approach another person in here because it is super intimidating to go up to someone when they're with all of their friends and try to strike up a conversation...then again, if you're coming to a bar, the end goal probably isn't a good date. I really didn't like this place. It just reaffirmed all the bad Castro stereotypes and the things I really hate about the gay \"community.\" But at least I can say I've been here!\n\nDamn, it's the most expensive water I've ever had", "author": "Dustin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "Had an awesome time here with a bunch of friends after breakfast at a nearby spot. We came here around noon for drinks and it was pretty quiet, so we headed to the outdoor lookout area for drinks and some smokes.\n\nAs we cheered attractive people and their puppies on from above the place slowly began to fill up and by 3pm it was packed with people. A drink sponsor for some juice infused vodka gave out shots from toned men in speedos as well as we bought a round of jello shots for our group and were given a complimentary DVD (adult film).\n\nThe bar area has a lot of room and with four bar tenders working it was easy for our group to continue to get drinks throughout the day. The drink prices were very reasonable as well. The entire place was very nice and clean. I want to go back to try the food next time.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-15", "description": "Went here on a Friday night and the bar was almost completely empty. The crowd was rather mixed and the prices for drinks were ok, but all in all I was not too impressed. The nice thing about this place is that you indeed have, as the name suggests, a \"lookout\" area, meaning an outside area with a nice view over the Castro area.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "Hello Saturday Margarita Bar @3PM - the bartender salts your rim (that sounds sinful) and fills up your pint glass about 3/4's full with tequila, and then you mix in your juice of choice. The options when I was there: peach, lime, or mango. Great people watching on Castro from the LookOut. Also, get the 50/50 fries. Trust me on that one!", "author": "Mal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-20", "description": "The bartenders are the reason why I don't come here.  There are plenty of options in the Castro.", "author": "Derek W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "I'm a total fan! I came here on Friday night for my Bestie's dual Bday party, very unfamiliar of the area. The booked a room upstairs with their own bartender (I can't remember his name but he was AMAZING!) and he made a wonderful drink the Fuzzy Navel but with champagne - I loved, loved, loved it. \nThere was a main bar outside of our party which you could go to as well and I believe a dance floor - I didn't check that area out since I was busy gabbing away to our hostess's friends (I talk way too much... like the Energizer Bunny, I keep talking, and talking, and talking, and talking!). \nEveryone seemed to have a great time and the venue was very accommodating to our party. I wouldn't mind coming back to the Castro and scoping this place out some more!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "There really is no better \"win\" feeling than waking up without a hangover when you're expecting the fattest one.  It's like seeing someone at the grocery store that you really don't want to see, and you just know they're going to come over and give you a hug, flash a fake smile, and pretend to be chatty and concerned with how your life is going... and then they just give a brief smile, small wave, and keep walking.  SIGH OF RELIEF.\n\nAfter the Bubbles & Brunch YEE, J and I decided to hang out some more.  For us, \"going out\" usually means him trying to make me drink a lot in the Castro, and then me deciding I need to go home before I get said hangover and him continuing to flirt and party the night away.  It's a lot of fun.  So, after a quick stop at Lime for a mojito, we headed to the LookOut with a few other friends.\n\nA $4 cover, two whiskey sours, a cran-vodka and a Malibu-pineapple (totaling $23) later, we were looking out onto Market Street on the patio because one of our friends wanted to actually \"look out\" while at the LookOut.  The people were super chill and laid-back, and there were a few people dancing inside, although they were mostly just standing around chatting.\n\nThe one star off (and I know it's not really their fault, but it totally ruined part of my night) is for their bathrooms.  It was disgustingly smelly.  Like smellier than any bathroom I'd ever been in.  Although it wasn't dirty, it literally smelled like something died in there.  I had to expedite my urination process so as not to pass out in there.\n\nNote to self: bring a small spray can of Febreeze wherever I go.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-06", "description": "Talk about a great location and an attractive young crowd, friendly bartenders. Can get rowdy rather quickly. However I avoid any place that charges a cover charge on a Sunday.", "author": "Hotel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "An excellent first stop for a bar/club night out in the Castro. The Lookout bartenders make strong (and cheap!!) drinks - they mean serious business here. Service is a little slow at times. \n\nThe balcony/patio makes it convenient to spot friends you're meeting up with. Good spot to get some fresh air, chat and watch the Castro festivities below. \n\nIt's kind of awkward when people try to dance here. The music is certainly danceable, and the crowd is always lively, festive and friendly, but think of this as a pregame to places like Badlands or The Cafe. \n\nOh yes, one thing you will never forget about The Lookout: the animated porn!", "author": "Waz W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "Got there early-Pretty quiet after a nice dinner with a girlfriend. Drinks cycled, place got busier and BUSIER, of course, it was at Saturday night. Looking over the balcony, we almost saw two very potential fights(it was really good exciting people watching) - HENCE the name. \n\n PLUS we made friends with an Olympic figure skater. I qualify that as an good night out.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "The drinks here  are  a bit small compared to other places (they serve them in those flimsey plastic cups). But the crowd is nice and yuppish. It can get very crowded on Saturday night or Sunday happy hour. Despite the inability to maneuver in and around sometimes, I still find myself here with a plastic drink cup in hand.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-22", "description": "I came here with my friend because her friends where having a party here.  The drinks were good.  1 star for having a pear cider - only thing my friend drinks - shes such a ligh weight. I probably wouldn't come here on my own if I'm looking for a good bar.  Tons of them around all over castro.  I'm happy this was my first time coming here - I know I'm not missing out on anything.\n\n1 star for good drinks and 1 star for apple cider.", "author": "Darren N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-13", "description": "In general, they bus your drink you have within seconds so just be sure not to order a drink.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "Not a huge fan and once had my jacket missing for a few days after I left it on a couch.  It turns out they took it to lost and found and I got it back, but it was still annoying (I only left it for a few minutes).  In the end, not my scene (most of the time).", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-04", "description": "I'm basing my review on their trivia night.  I don't mess around when it comes to trivia.  JK, even though I am still working on my dream team, I knew based on the sample questions I heard from Joshua that this was going to be different.  \n\nThe ladies reading the questions and the crowd made it quite rowdy and fun but I don't enjoy long passages of time between questions so that was a little frustrating.  If you are looking for a fast paced game where questions are read and that's it, don't come here.  It's chaotic and lively so I would encourage heavy drinking which I am assuming was the point all along.\n\nThe portobello fries and sliders were pretty tasty and it didn't take forever to get a drink so I'd come back, just not for trivia.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-27", "description": "Who in the world gave this place more than one star?  Stopped in.  Dead.  No one in the place.  Couldn't get service.  Bartender disappeared.   I left without giving them my money.  Oh, buy a broom and mop your floors.  Gross.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-03", "description": "No more free chicken wings for Friday night happy hour :(   BRING BACK THE FREE WINGS!", "author": "Dwayne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "This is one of my favorite gay clubs in the Castro.  The people are welcoming and I like their different theme nights.  It's never been too crowded when I've been, so even though the dance floor is small, it's big enough to do your thing.  I like that they have a large wrap around patio to use when you need some fresh air.  I'd definitely return!", "author": "Jade F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "Offering me my favorite drink of the night (an AMF), and meeting a random chick that was nonverbally willing to freak dance, made this place simply awesome!\n\nIt was also quite hilarious to see two drag nuns from the 2nd floor balcony!\n\nSmall $5 cover charge, but that didn't stop me from enjoying the night with friends.", "author": "Garett T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-21", "description": "There's a $3 cover charge to get in!  A bar?  Well at least the bartenders were cool, drinks were good & the music too.  The gay porn is interesting for me tho lol", "author": "Trynh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "I don't like paying covers, that being said the beer selection isn't bad.  Being a chick I was served almost immediately since, well, I am not the normal customer.  It is loud and there isn't much of a dance floor if that is your thing.  \n\nThey do have a large balcony for people watching in the Castro, but is that really the way you want to spend a night.  Wouldn't you want to meet someone you won't be shouting from a balcony too.  Then again maybe Romeo will be down there.", "author": "Megan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "My least favorite spot at the Castro so far. It's quite big, has many areas. I didn't see a dance floor by the bar though.. did I miss it? I'm sure people really like this place, it's crowded when I've been. Just not my preference. Very mainstream. I imagine a group of girls going there for bachelorette party or something like that. Nothing wrong with that, just not my style. They do have a nice long balcony that \"looks out\" to the streets. Perfect if you like to smoke haha", "author": "Vol T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "I love how security keeps a low profile and you can relax here.", "author": "F T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-26", "description": "Came here on a Wednesday night, it was fun. Not a lot of people of course, but the bartender as really cool, and my friends had a great time. We ended up leaving after we had a couple drinks because we wanted to bar hop to somewhere else.", "author": "Lindsey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-04", "description": "I like it! Can't complain in the least! Pretty good drinks at good prices. I love being able to \"look out\" on the Castro/Upper Market while having a drink, if I like. \n\nAlso, they have food from time to time - and it's pretty good food by different caterers/restaurants/chefs (not sure about how this part works, but what I had was tasty)!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-08", "description": "The worst service I have ever had! I'm disappointed in the way the bartender ignored us the whole time I was there. We asked to close out after being there for a couple hours when it was slow and after being ignored almost the entire time we were there. I just looked at my account and he wrote in his own tip! I am in the industry and things have to be pretty bad for me to stiff someone! He and everyone there were obnoxious and completely unprofessional. We had a friend who recommended we go there while in town and I cannot believe how we were treated! I will NEVER be back and will be contacting the manager first thing tomorrow about the bar tender closing out his own tip! Unheard of! As far as I'm concerned that was the worst service I have EVER had!", "author": "Melissa O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-24", "description": "Happy Hour after work is nice.  Not too crowded, space out on the balcony.  Even though it wasn't  terribly crowded, it was still pretty loud, though!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "Their fries are super yummy! The pizza and service is also decent. Seating is limited but comfortable... I love to come here with friends after having mimosas at lime and snack on a pizza or two. \n\nTheir calamari is also delicious... \n\nONLY CONS: get it out of a club! I hate the fact that it is inside a night club like the lookout which is pretty much open for business 24/7. Also if I were a smarter owner I would extend T&T hours some could make some profit out of those drunken gays that hit lookout overnight... Just saying", "author": "NC B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "I've eaten a lot of pizza in the last few days. And this was some of the best. The tomato pizza sauce had a nice kick, and the service was pretty quick and attentive. It's a bit unfortunate that it's linked to a bar because I'm sort of deaf in an ear so it makes it harder for me to hear...but other than that, I  thought the prices were pretty decent for what you get and the freshness of the place! \n\nmmmmpizza.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-07", "description": "I love this place.  You can have it your way (just don't get crazy).  Seriously though, you can dance if you want to, you can chill, you can eat, you can go out on the lookout and watch the ongoings of Castro, etc.\n\nThe bartenders are hotties and even have a great attitude.  There's none of the BS that comes with some of the other gay bars.\n\nOverall, it's a good place for good people.", "author": "Girls Named Cherise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Cool place, second floor with a nice little view of the area. Definitely seems to be one of the more active places in the area and the drinks were great at a good price!", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-18", "description": "$4 dollars for cover on a Saturday night, nice view on the balcony, amazing dancers all around, dance music blasting and GIANT DRINKS that are very reasonably priced.  \n\nThis pretty much sums it up.\n\nAnd for the ladies, you won't feel poached on at all.  I may be stating the obvious but it's a gay bar, and I think it's perfect for a girls night out, where you just wanna have fun, have a few drinks, talk to cool, upbeat people and just enjoy yourself.", "author": "Zu W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "Think out of all the bars we tried in the Castro....this was definitely one of our favorites...\n\nFrom the name....you got a great view of the city....plus the drinks are totally affordable....comparing it to LA prices....the drink prices are a steal!\n\nThis place got busy a few times....but if you wanted a place where it wasn't so nuts you could have that too.....great music....great bartenders......awesome vibe....", "author": "Jay A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "Awesome place to hang out and meet guys. Friendly crowd, good drinks. I'm a fan!", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-19", "description": "On a gloomy day, one Sunday afternoon, after 2 pints of beer and 2 vodka drinks, Eric G., Mark M., David T. and I decided that it would be a great idea to go to the Lookout for a few more drinks.  Little did we know, this would become an epic day of booze, boobs, and boos!\n\nIt began with jell-o shots!  There's always room for jell-o and we found this to be our demise!  We just so happened to go on a day where there was a fundraiser for a local gay soccer team.  With one jell-o shot underway, we decided to start off with a drink each. Then we were on our 2nd drink.  This time i bought and let me just say that drinks were not unfairly priced but they weren't super cheap or anything either.  The bartenders we're particularly friendly but they got your drink to you with a quickness.  Not to say they were rude or anything, they just did their job and moved onto the next drink.  As I was buying all our 2nd drinks, David T goes and buys us each a shot of Patron.  So to recap, i've had 2 pints of beer and 2 vodka drinks from 2 previous places, a jell-o shot, a shot of patron, and 2 greyhounds.  \n\nBy this time, i've noticed that this place is pretty crowded.  People were pretty good looking, and everyone was minding their own business.  We then decide to go outside and hang out on the balcony or \"lookout\"  It's actually pretty nice.  you get a nice view of the area around you, which is just market and noe/16th.  We end up talking to 2 women and one of them ends up flashing us.  A few guys end up flirting with Eric G., Mark M. is drunk and having conversations with people, I don't remember what i'm doing and David T. leaves.\n\nAfter this i don't remember the drinks we had.  I do remember more jell-o shots though!  Needless to say i did some things i never do in public, Eric G. had a great time, and Mark M. has an issue holding down his liquids.  By the time we stumble out of there, we are happy as hell and ready to go home.  \n\nI really enjoyed the balcony outside... and the fact that there is a good solid crowd there all the time.  I see myself going back there for shits n giggles.  Anyone wanna join me?\n\nPS jell-o shots are the debil (devil) !!", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-14", "description": "Great location, and the balcony is a plus..but..\n\nThe interior of this place needs to be gutted to the studs and redone. What a nightmare of flow and acoustics they have going in there! I don't know how many times I've found myself SHRIEKING my order to the bartender in order to be understood. They try to give you the total and if you don't read lips, all you can do is hand them a twenty and hope for the best.\n\nIf you stand by the doors it's freezing, if you stand in the back it's stifling, and that hulking bar in the middle of the room must have seemed cool in the '90s, but it just makes me tired, now.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-26", "description": "First time in this bar, on a Sunday.  Waited 15 minutes at the service bar for a drink, and still was empty handed when we left.  Either they need more bar staff, better bar staff, the POS system is slowing down the bartenders, or all three.  The crowd was mostly young guys, and bars just aren't that fun if you CAN'T GET A DRINK!  The other reason for the 1 star is safety.  This place was WAY to crowded.  Think: Triangle Shirt Factory.  As we were leaving, someone was bring their bicycle up the stairs, can't believe the doorman would allow this.", "author": "EC N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "It was a dreary December night. I had went to the Castro for some reason. I went into the bar, and this guy asked me if I wanted a drink with him. He assumed I was a fruitfly missing her fruit. We went up to the bar and had drinks.\n\nEventually, a bunch of gay men of all ages joined in. It was a lively discussion for a Wednesday night. We talked about football, men, disco, Madonna, etc... It was amazing.\n\nThe rainbow beacon of SF still whispers my name and when it does, I'll be at the lookout and won't try to be that much of a bitch like I was at Badlands.\n\nLove the disco balls.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "The LookOut continues to be one of my most favorite places to celebrate love and community. I've hosted 2 parties there, and I am a regular patron. Chris Hastings and the entire staff (Gregg, Jarrad, Jimmy, etc...) are some of the warmest and most accommodating folks I've ever had the pleasure of working with. The drinks are delicious and reasonably priced, and the bar snacks are extra tasty. The venue is centrally located in the heart of SF's Castro district with a stellar view. The DJs are fantastic, and there's always fun entertainment - whether it's a dazzling drag show, live musicians, or simply the excitement of a bunch of feel-good people enjoying a lovely afternoon or night out. I can't say enough about how this place always gives me the best warm & fuzzies. Thanks, LookOut ~ See you on the dance floor...", "author": "Gypsy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "So I've been here for the Thursday \"Beat the Clock\" Happy Hour.\nAs you know, its 50 cent drinks from 4:00-4:30, $1 from 4:30-5, $1.50 from 5:00-5:30, etc.\n\nI anticipated it being something ranging from an easy going happy hour where I can talk to my friends to some type of gang bang.  Luckily, it was the former.  Must've been the rain.\n\nAnyway, The 50 cent wells are unbeatable.  These aren't just your regular shitty wells... but ginormous 6 count pours of seagrams that will get you bent by 4:20 for $1.50!  The bartender honestly poured half a fifth into four well drinks.\n\nI'd stick with screwdrivers. The cranberry/vodka tastes like cough syrup... but if you add some promethazine it tastes a little better.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "Fast and friendly bartenders, good music. Nice addition having lite food for purchase at the bar. I highly recommend the bar. Great scenery- in and outside the bar.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "Hot Wings are GREAT!!!\n\nPizza, is just ok.\n\nDrinks seem weak.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-01", "description": "I like this place a lot because the crowd is always fun and everyone always seems happy. However, I understand that people are raising money for their organization but EVERY Sunday is getting a little old. I like this place because it's fun but I can get my drinks somewhere else without a cover. And the LookOut isn't even the most exciting bar at the Castro.\n\nWith that said, I still think the crowd at the LookOut is very fun, real, and not superficial (aka not a WeHo/Badlands crowd). The people at the LookOut remind me that there are normal gay men at the Castro.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-17", "description": "The food smelled great, the crowd was varied, the boys were cute, the balcony is nice, the trivia was easy enough to answer (but we still only managed to rise to mediocrity), Pollo del Mar was fun, Bebe Sweetbriar's mic sucked and we could hardly hear her, and the crowd was boisterous.\nIt was a fun, if at times infuriatingly loud night.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "If you wanna forget everything about that day, come to this place! They gotz the best memory-loss jello shots you'll ever chug! LOVE THIS PLACE! ;)", "author": "Vanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "Considering this was my first time at a gay bar...it was awesome!  We came early enough that there was no cover and $2 skyy vodka drinks.  There's a patio that was pretty much packed, so we ordered our (really strong) drinks and scoured the area for a place to get some apps since they were 1/2 off.  We found an empty lounge area with a cool view because I think most of the people there were to mingle, dance and get drunk!  The sweet potatoe fries were delish as well as their nachos.  \n\nThe staff was totally cute and when we asked if our gang could come back later in the evening, \"only if you give me sexytime\" was his response...cuuuute!\n\nOnce we left we just missed out on porn night because we could see the ripped stripper from across the street!  Definitely a place to have a good time with some of your friends.", "author": "Caren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "Since the incident I e-mailed  the owner and he apologized and has changed his security staff :-).   They also have new bartenders who are great and even more the owner sponsored an event for me to help repeal  prop 8.  Thanks Lookout!!!", "author": "Christopher T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-11", "description": "The LookOut makes me happy. I LOVE the bouncer on Thursdays, she's my favorite part of the LookOut experience. \n\nLocation: Right between Church and Castro on Market and in front of Cafe Flore. Really easy to get to either by the dangerous MUNI or by vehicle.\n\nSpace: Not the best decor, which is why it gets a point marked off. With such a GREAT space, you'd think they would hire a good interior designer. Not bad though. My favorite part is that there's a balcony where you can drink, smoke and judge those less fortunate beneath you.\n\nAmbiance: I usually go on Thursdays and I love my lesbians. The lesbians here are young, hip and hotter than any gay boy. Other than Thursdays, the crowd seems pretty bland, in a good way though, kind very quiet and chill.\n\nService: The bartenders are always nice and ready to give suggestions as to drinks. They make a good cosmo and martini. \n\nFood/Drink: I asked for something sweet and blue and she made an amazing drink. They make pretty good drinks and have a fair selection of alcohol.\n\nOverall: One of the places I like to frequent on Thursdays. I love my lezzie nights there very much and hanging out there with friends on the weekdays is always a joy.", "author": "SF N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "Hot lezzie bouncer.\nShe's fancier than the rest.\nDon't go upstairs.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "Surround deck is like surround sound, you get the FULL experience out here. The gossip, the kissing and oh my my the fondling. I love gay men and yes, I know that makes me a bona fide fa* ha*. Oh go freshen your makeup.\n\nCame here on a pub crawl with nary a non-hetero swinger in our crowd and guess what? everyone still treated us with love. My dilemma? A place filled with sincere, gorgeous men looking for love and spice. LORD. I tried my bestest to hook up the cream of the crop with each other, but it seems that under 25 and full of um, \"energy\" was more the order of the day. \n\nWig O'Rama was in full swing with a benefit for dental care for the toothy challenged south of the border. They were full of high spirits and so were the bartenders. Loved my stiff drinks and smiles. \n\nLike I always say, know what you want. This is a great bar to stop by and check out the 'view' from the deck and the scene, esp if you want to kiss your own kind, is friendly and boisterous. But if you are an electrical cord looking for his plug, keep it short and move on.", "author": "Miel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "Good drinks, good music, great balcony, cool drag queens.  \n\nDrink prices vary per either bartender or the person ordering drinks...I haven't figured this out completely.  I learned for my gay friend, the drinks are cheaper than they are for me...the straight girl.  :)", "author": "Tiffany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "This is a review for their Happy Hour. I went in when they had just opened so there was only a handful of people in but it was still a really nice venue. Kurt(kurk?) the bartender was sooo nice and talkative! His drinks were strong and he was happy to make me a conction to my liking when the cran vodka wasn't doing the job. Restrooms were clean, the prices were super cheap, and plenty of space to sit (granted it was empty). Will definitley be coming back.", "author": "Peggy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-07", "description": "Ok, so I get it. This place isn't for me. It's a scene, just like 330 Ritch and District are for us straight kiddies. I show up in my Sunday finery, and expect to get the evil eye from the gorgeous bouncer, the pretty bartenders, and anyone else with a penis who is not attracted to me. \n\nBut I don't. \n\nInstead I get shown the digs, with a spot overlooking Noe and Market, and within seconds we're given strong as Ahhhnold margaritas. More people show up, and we get to see all the pretty gay men trickle in. I check. Damnit, yep, still a straight female. \n\nAnd then 3:00 pm hits. \n\nWooo Britney Spears \"Circus\" release party! Bitches better recognize that my guilty pleasure has a new album out! We dance around and enjoy ourselves and order a delicious Thin barbeque pizza to coat our bellies. I watch my cutie-patootie gay roommate get his ish on with a hot lawyer from the Duboce triangle. \n\nI end up leaving at 4ish because hey, a girl's gotta get her swerve on in a place where gentlemen recognize her boobies and whatnot. At least I walked out with the phone number of a hot female Polish photographer who wants to take pictures of me. Notes on a Scandal FTW! \n\nGah. It's 7:17 pm on a Sunday and I'm hungover from daydrinking extra strong margs from the Lookout. *Checking.* Yep, still a chick.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-19", "description": "My Vodka Redbull was the size of my face - GREAT value :) Went there and the place is just chill, the people are fun and who doesn't *love* the castro? Went there for a DJ battle... I imagined DJ's lined up next to each other and actually battling... if they were, that would've clenched a 5th star... alas, they just took turns. *sigh*\n\nGreat spot, regardless - good view, nice atmosphere, great for a chill night of drinking.", "author": "linda t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "Great bar for people watching on Market St. whilst smoking a fag out on the veranda... hehe\n\nOh and there is a really cute and fun house DJ that spins on the weekends during happy hour. Christopher B. Eye candy with a side of funky house... does it get any better?", "author": "Tyler J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-24", "description": "I went tonight and had fun.  The staff is really friendly and awesome.  I met a couple Pinay lesbians, it was fun talking to them,  I like the outdoor balcony.  The DJ was good tonight.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "If they have Lesbian Night at this place, they should change the name to \"The LickOut\". \n\nJust sayin'.", "author": "Kiki G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "I always have a good time at The LookOut! I went to meet some co-workers on Sat. The Look-Out played good music.. the bartenders are super nice and they make a delicious margarita... which is pretty surprising, not many places make good margies. \n\n2 Thumbs up for the LookOut!", "author": "Monica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "It all depends on the crowd, but when you get burners, gays, great food, beats and cheap drinks. Well you know you are in for a fun night. It has a tiny dance floor, hence missing a star, and can have some very pretentious patrons. Yet usually it is very down to earth and not too over the top hot staff. The thin balcony is my favorite part. I love to be able to look out over Market St. Can't wait to go back and shake my tail feather!", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-02", "description": "If you're looking for a place to dance and be silly with your friends in the castro, this isn't the place to go. If you're looking to chill out, be seen, socialize, listen to music, people watch and is okay with big crowds then you should come here.\n\nThe Lookout was so full on a Saturday night that it was hard to get from point A to point B.  I came here with a bunch of friends.  I must say though that when it was Metro the crowd wasn't that great looking.   The crowd was definitely good looking (straight girl here lolz) and everyone was really friendly.  The DJ was pretty funny he danced and sang with me and played an array of good music.  Bathrooms were meh.  Only one bathroom for the gals which guys ended up using.  Drinks were good and the alcohol was plentiful.  I wouldn't mind coming back here again for the social scene.", "author": "Ro C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "It's sat and it's slow but the music is tolerable.   My faghags thought it was ok too, considering the bartender was hot (lest the no deodorant) and was nice.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "Wow, so during pride this year, some dude bought me a drink here from the other side of the bar. That has never happened before... and for that, this place will always have a special place in my heart.\n\nBut sigh, the dude looked like he just stepped out of the Liberace museum down in Vegas... you guys know what I'm talking about right? Whatever, I'm sure he had an amazing personality.\n\nAnyway, this is a fun place full of the friendliest people San Francisco has to offer... It doesn't seem to get that packed like the other bars in the 'stro - Wait what? There's a pizza place connected to it? Wh-wh-what!! Amazing.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "This is one of the first bars I've ever been to in the Castro.  I know, right?  Ridiculous given that I've lived in the Bay for more than 4 years now.\n\nA not-so-gaysian boy took me here to meet up with his fabulously amazing co-workers to celebrate the kick-off of Pride earlier this month.  FUN TIMES!.  For reals.\n\nThe bartender concocted some funky first drink for us both, not sweet, not yummy.  But we gave him a second chance and he poured out what has now become my new favorite drink...the creamy, the delectable, the downright sexual...choco martini.\nTwo things came to mind as I sipped (rather slurped) down my cocktail.\n#1 - Chocolate...\n(need I even elaborate?)\n#2 - Alcohol + Chocolate...\n(hot damn.  frisky.)\n\nHonestly I'm still reeling from the drink.  We loved it so much, we decided to try making it at home and surprisingly it was almost just as good. \n\nAND, as the name suggests...there's plenty to LOOK at here.  I mean come on!  \nHot mens EVERYWHERE.  \nIt's a straight girls eye-candy land.\nYumYum.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-16", "description": "Decent gay bar at a good location. \n\nI'd give it 5-stars for the location and the patio (I don't smoke but enjoy looking out from it), but the long lines on many evenings, the cover charge, the \"packed like sardines in a tin can\" space, the UBER strong drinks (they make drinks at Ginger Trois and Trax taste like baby solution) and the spotty crowd give it a 3-star. But then again, I'm a fan of bars like Trax, The Pilsner, The Cinch, Ginger Trois, etc. so its just different tastes.\n\nIt attracts quite a clean cut, non-edgy, somewhat polished crowd of youngins many evenings, all dressed preppy casual. There seem to be numerous community based events and fund raisers going on, which is neat. The music is good albeit very loud at times and making your way through the bar on a crowded night can be an adventure. \n\nI used to frequent it a lot when it was The Metro and had the Chinese restaurant attached to it eons ago. Decent place to grab a drink but not a place I make an effort to head to regularly.", "author": "Amit S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-17", "description": "The pizza here is amazing. I've been meaning to come back here again sometime for the food. Supposedly they have all you can eat pizza on Tuesday, so I'm definitely going to have to hit that one up. :)\n\nThe bar itself is really nice. You get a good view of Market St. and you can see all the colorful people walking around outside. They also have a DJ on the floor and they play video clips of random things on the flat panels on the walls. One time they were showing the Japanese anime Paprika o_O.\n\nOh, I do have to admit though, that sometimes this place gets super packed, which is annoying and tedious, one time I couldn't even get to the bathroom until I started body surfing on the crowd to get there *joke* but it would have been way faster I would imagine. I think it was Frat night or Boys night or something. So if you see anything advertising that, beware, unless you like your body constantly pressed up against some half naked boy and its so hot and sweaty you can barely breath. Well the first bit sounds nice :)", "author": "Xavier G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-02", "description": "Never been here, but hear alright things about this place.  Attracts an older crowd, though.\nRestaurant by day, gay bar by night. Woohoo!", "author": "Frankie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-25", "description": "Was so happy to find the pizza here!  Up until now, finding a good pizza always meant a hike to Gialina's or Arinells or, even farther, Amici's.  Now, a source in the Castro back-yard. \n\nNormally I'm a thin crust kinda guy, but with regard for consensus our group ordered the deep dish Castro Queen (a cornmeal-crust  pie, filled with lots of tangy chicken and spinach drenched in fresh & bright saucey goodness) and we all absolutely loved it.  The quality and taste of  the ingredients made this one vanish fast.  \n\nIt should be said to this is a great spot for people watching too, perched as it is above Market at Noe.  Really a fun spot.  And the food!!. . .I want to come back to try the other toppings too. . .\n\nAlready planning my return!", "author": "Mark N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-22", "description": "Brits ahoy!\n\nMy partner had some of his friends from UNI (lol) over in SF, and last night we met up w/ them.  After trying to go to The Slanted Door, we picked our brains as to what else SF has to offer... um, gays that are in a really good mood?  Check.\n\nWe took Muni from the Embarcadero to Castro and these poor, poor Brits were greeted by a prayer circle of none other than the Sisters of Perpetual Indulgence, oy!  As one of said Limeys said, \"When in Rome...\"\n\nWe made our way to the LookOut, as I vaguely knew of the place from friends.  Now, we didn't go to the bar section (where a drag queen was conducting quiz night, oy again), but sat in the back with the smaller bar.  Not his fault, but I think the bartender/server/he-who-wears-tight-pants was a little overwhelmed... with five tables... yea.  Anyway we got our drinks quickly enough but the food took a REALLY long time.  Like, kind of excessively.  Maybe if he hadn't been texting behind the beer tap and gotten on the cook's ass (not literally, stop it...) a little more our food would have been there sooner.\n\nWhen it did come, it was okay.  Gargantuan portions, as my British friends would comment upon.  The two burgers we ordered were good, if not a bit greasy.  The thin-crust pizza that was ordered was CRAZY greasy.  The cesar salad that was ordered looked uninspired.  However we had a great time, if it wasn't a bit hard to hear during the music interludes.\n\nAll in all a great night, but again slow service for less-than-stellar food.", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-19", "description": "I'm sure people don't care to see that I update this place constantly.\n\nBut this place is a holder to street traffic. Last time I was trolling the Castro at night after the Sara Bareilles concert - my ex-co-worker who was in Miami was back.\n\nWe call him Blackout Cake - after a dessert we have at work.\n\nAnd note to anyone, if you are blacking out by no means should you do it  on the balcony of this place.\n\nI was worried for him. He would lean over to kiss me in that slight homosexual way that is exaggerated and I was hoping to not end up in some tragic roadkill on the sidewalk below.\n\nThank Madonna, I made it home from that experience okay.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "Where to start, great location, cute boys, cute staff! Good food, happy hour on weekends and over all a great place to drink, catch up with friends and get your dance on because they play GREAT music here! The place is a gem in the Castro, its up the stairs and has 2 area's for private birthday parties and such. Clean bathrooms, a ton of outside space for overlooking the area and chatting with friends..this outside space has some bar stools and a long ledge for you to rest your drink on or any finger foods you have ordered on their happy hour menu. Inside is more bar seating from high tables and chairs...this place is casual yet border line nice-upscale ish.", "author": "Rose A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "First of all, I really wanted to rate the pizza restaurant, called Thick 'n' Thin, but I can't find a separate company listing on here for it...  I see the pizza place and LookOut as totally separate.  It's all about the pizza.  And what a pie it is. \n\nWe arrived at the top of the stairs to find an empty dining room.  Promptly greeted by the owner, Chris, who led us to a window table.  Great table, but the banquette bench on one side is significantly higher than the stool on the other.  We wondered if it's possible to lower the bench side; probably cheaper than replacing tables and stools.  \n\nThe glasses of red that we ordered were great.  The spinach salad was ho-hum, but the Caesar was delicious.  A creamy garlicky dressing evenly covered the evenly chopped romaine.  Note, I appreciate the even chop, while others prefer a rough tear or a classic, whole leaf.  The uniformity of the chop contrasted with the larger, rosemary-scented, focaccia croutons--homemade--and fresh-ground black pepper delivered a nice compliment to the garlic. One suggestion: toss those amazing croutons with the greens as you're dressing them!  Leave no crouton unturned!  \n\nCrouton lovers: run, don't walk. \n\nNow, to the pie. \n\nWe ordered the \"Castro Queen\" pie though we're now calling it the \"Upper Market Bro.\"  I doubt many Castro queens are going to going to delight in the thick, crunchy-on-the-outside, soft-on-the-inside cornmeal crust topped with a layer of perfectly melted cheese and a tomato sauce that rivals any I've had.  Imagine Zachary's in Berkeley, but punch up the seasoning and flavor of each pizza component and you've got Thick 'n' Thin.  The sauce tastes so fresh, and cuts right through the richness of the cheese and denseness of the crust, leaving you wanting to take another bite before you've hardly chewed the one you're enjoying. \n\nI'm heading there with friends on Friday night, so I'll probably try the thin crust option, another Caesar, and I'll note the name and details of the wine I liked.  \n\nHappy eating!", "author": "Jeremy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "They have Woodford, but the crowd has become a little sad over the years.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-22", "description": "Went to meet a friend for Happy Hour. Ordered Absolute and Cranberry.....$6.50 for a drink that had no alcohol. My friend came in ordered the same thing.....$6.00. It's overpriced, no alcohol, and they didn't know how much to charge.....never going back. I would have given them one star, but I really liked the view.", "author": "Troy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-15", "description": "Glad to see the Lookout owners really making an effort to put in something worthwhile in this often-overlooked restaurant space. I've been a deep dish fan since my kiddie days visiting Chicago, and the bar in the Bay Area is set pretty high due to Zachary's and, more recently, Little Star.\n\nWhile pizza is the main focus here, they do serve other items that go well with a place that's much more known for drinking than eating. Having said that, they do make a pretty decent pie. The cornmeal crust is executed quite nicely, giving a good crunch and solid base. Where this place fell short was in the other ingredients. The toppings were a little sparse, and the sauce was truly disappointing. What's always made an excellent deep dish pizza for me is the fresh, chunky tomato sauce that steams on top. What we got on our pie was too tangy, not very chunky, and altogether not that fresh tasting.\n\nHaving said that, if I am at the Lookout and got a serious deep dish craving, I probably wouldn't hesitate to order one. But if I have my heart set on truly outstanding stuff, I will probably go elsewhere.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "Connected to The Lookout bar, this is the yet next iteration of the restaurant space above Squat and Gobble.  Chinese worked for awhile, a grill was - eh - not so much, but the pizza thing seems to have stuck.  And by gory, it's pretty darn good pizza.\n\nThe Italian Stallion is really good (had to ask if it was the server or the pizza, but it was the pizza), the pepperoni is tasty, the vegetarian all right, the spinach and feta good (but too HOT!), and the sausage - meh - I've had better.  But the deal of deals is that it's all you can eat pizza on Tuesday nights for $7.95.  Hello!  The servers just bring around pies and ask if you want the flavor they have in their hot little hands.  Easy.  Love it.\n\nThe Cyndi Lauper beverage (vodka, cran, red bull) is also tasty, but REALLY SWEET.", "author": "Evan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-03", "description": "Owner is anti-lesbian! Owner physically pushed me over $2.00! Will never go back there again - he also grabbed my friends arm. There are better places to go for women and being a SF resident we will never go there again.", "author": "Maggie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "I love this space.  I always have.  Its one of my favorite perches for day drinking in all of the city.  Not a lot is changed from when it was Metro but something is different.  \n\nIts amazing how much changing lights, a paint job, moving all the shit off the counters and putting in a lounge corner can do for the ambiance of a place.  My first time visiting The Lookout was in the evening and the darkness outside combined with the warm lighting inside provided a great ambiance and a feeling of class, something we all know is completely missing in the Castro.  The hot bartender provided something to look at behind the bar.\n\nThe place was dead and pretty much always looks dead from the outside and I count this as a plus.  I was able to take over a portion of the lounge seating to wait for my man and crew.  When they arrived we could actually hold a conversation and were able to get the attention of the hotness behind the bar every time we needed refills with no struggle.\n\nI know there must still be some of the old Sunday Funday rowdiness goin on here since I see the guys dangling off the balcony on Sunday afternoons.  Someday I'll wander over and check it out.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "It's hard to beat the \"people\" watching from the balcony.  They also play a great selection of music, though too loud for me on a bright afternoon.  Drinks are strong and usually good.  They always have some sort of drink special, which makes them pretty cheap.  The food is above average for bar food, especially the pizzas and burgers.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-12", "description": "What used to be METRO transformed into THE LOOKOUT without my knowledge!!!  THAT IS HOW OUT OF THE LOOP I AM!!!  \n\nLast night, I was dragged out of my domestic confines and obligated, by peer pressure, to drink and be merry at THE LOOKOUT.  What really surprised me is HOW MANY HOTTTTTT MENS there were on a SUNDAY AFTERNOON...Don't  y'all know that Sunday is a school night?\n\nI had a great time mixin' and a mingling....BTW, there was not a cover and drinks were cheap...", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-03", "description": "I went here and they said 1) all girl dj's and 2) $2 cover charge and 3) good dance music. (according to marketing material and posters I saw online).\n\nHere's how it measured:\n\nFirst, the dj wasn't a girl. Okay, they said all women dj's so I expect nothing less. However, it was a guy. No big deal, but thought I point it out.\n\nSecond, the cover charge was indeed $2 dollars and there was enough space to dance. There weren't a lot of people there (Thursday night on long weekend), but it was still a sizable crowd. For $2 dollars, it's still a good deal to listen to music and dance the night away.\n\nThird, good dance music. I thought the music was pretty good. It's def. more dance, energy type music and less hip hop and R&B which I like anyways. Many Castro joints are similar in terms of music interest.\n\nFourth, I liked how even though it was women's night, they actually had a good blend between lgbt and straight and also men and women. it was nice to see that diversity and also in terms of ethnic background.\n\nFifth, it was very easy to find parking and since it's late at night it was free. I literally parked on sidewalk 1/2 block from it. It is also near residential so it's pretty easy (minus pride weekend) to find parking.\n\nSixth, for what it's worth, the bathroom wasn't that bad. Def. better and cleaner than the Cafe and some of the other clubs I've been to in the city.\n\nSeventh, for smokers, they have a cool outdoor small patio ish area that extends on the trims of the building (2nd floor). It's nice to let the smokers do their thing and to have that separation versus at the Cafe it's a smoker's room, but right in the middle of the dance action.\nA couple things on why I think it can be better:\n\n1. Cheaper drinkers- no drink specials and it was $9 + tip for one. I don't mind, but they should do some specials last night.\n\n2. It would have been nice if they served a little bit of food.\n\n3. Would have been nice with more people.\n\nWill def. go again because of the low entry price and decent music and will def. review it again on yelp.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "So my *girlfriend* and I hit up The LookOut with some friends (some gay, some straight) on Pride weekend.  While there was a 30 min wait and a $10 cover, everyone coming out of the place was stumbling drunk so we figured that's where the party was at.. and we were right.  Awesome crowd, cool dance music (gay-friendly anthems) and amazingly cheap, stiff drinks can be found here.  One of my friends (who's straight) declared it one of his best nights out EVER.  Disappointingly, the outdoor balconies were filled with tons of people smoking so if you're not into that, just stick inside.", "author": "Toby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "This is one of my favorite places to frequent in this beautiful city! Not only was it the first gay bar I went to, but it has amazing bar staff (always with a smile), great drinks, a tasty menu with great appetizers, talented djs on certain days of the week, and a location with a view that is to die for! I highly recommend popping in for an afternoon drink or partying it up any night of the week! Always friendly faces, and a great place to catch up with old friends. You'll probably see me here ~", "author": "Cornell M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-30", "description": "I LOVE the Lookout Karaoke Mondays! It is a great place to go have a pizza, a beer or something stronger and sing your guts out! There are a bunch of big screen TVs around the bar with the karaoke lyrics on them. The sound is not too loud, but the stage has monitors so you can really hear yourself sing. Members of the San Francisco Gay Men's Chorus often show up to sing so it is often like watching an episode of Glee. The karaoke host has an amazing selection of songs. This is a great karaoke night!", "author": "Paul d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-29", "description": "Best day is a Sunday afternoon (though it gets packed). Otherwise, not the funnest place unless you just want a drink with friends.", "author": "Phillip O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-25", "description": "Thursdays are the only night I've gone to The Lookout, for the ladies night.\n\nThe Lookout is a nice bar with some seats for group socializing, and a great deck-type thing looking out over Market Street for fun people watching.  Thursday nights there is a DJ, and some people dance in front of the DJ booth, but I wouldn't label this a dance party or club, I would refer to it as a bar with music and optional dance space if the mood strikes ya. \n\n*Draft Bud Light... as lame as it sounds, I do enjoy it.", "author": "Sandy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-01", "description": "This is such a great bar!!  The exterior seating with the lookout as the name professes already makes it a five star but it also has one of the coolest interiors I have encountered in my drinking days.  The bartenders are pretty friendly and the drinks are good.  Prices are better than what I'd expect at a place in this location that boasts such a cool view of Market.  Started out with some standard mixed drinks but have become hooked on the house beer which is aptly named Lookout Ale.  Great place!!", "author": "Sin F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-11", "description": "I like going to Lookout on Sundays. Nice vibe, good energy, and good music.\n\nWhy the low review you ask? Service! Don't get me wrong, there are some great bartenders at this place. But there are also a decent amount of lackluster bartenders at this place. No energy. So unhappy to be there. If you don't like your job, then why are you still there.\n\nThis one bartender in particular, who I later found out is the \"general manager\" there, is the worse. He sits and talks to friends as if there isn't another soul in bar. And when he finally takes time out of his personal life to take my order he deliberately makes it wrong. On numerous occassions, I've asked him for a Kettle One and Soda, but what does he pour into my glass?? Well vodka!! and still has the nerve to charge me Kettle One price! Who does that? Does he not see me watching him make my drink? or does he just not care? And when I've confronted him in the past, he either pretends as if he did make it with Kettle One, or rolls his eyes before making me the correct drink. You would think the \"general manager\", I think his name is Gregg, would have a stronger work ethic than that.\n\nIt sucks to have numerous Sunday afternoons at Lookout spoiled by a few bad apples within the company.  I've been to numerous places in the Castro and always had pleasant experiences with staff, even when its busy and things can get stressful for bartenders. Take a note or two from Cafe, Trigger, and Q bar. I always have more than pleasant experiences at these places, no matter if there are 3 or 300 people inside. And never have any of those places attempted to cheat the customer by pouring me well vodka instead of the higher quality alcohol that I ordered. Shameful!", "author": "Armando M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "I only come here on Wednesdays...it's Drag Night!!! Probably one of the funnest experiences (assuming the good ladies are there that night)..the drinks are good, and whats great is the balcony that looks out on the Castro which makes smoking and drinking even better!! Great place!", "author": "Mig I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-01", "description": "This place is THE place to be on softball Sundays or any other glorious summer day in the Castro.  Otherwise, it's just about average.  The pizza is good though!\n\nI was more of regular there until Trigger opened.  Then I moved the party on down the street...", "author": "Jimmie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-17", "description": "I like the Lookout! Nice staff, good drinks and they don't have attitude if you want to make up your own drink! And the outdoor LOOKOUT area is fun to watch the crazy intersection wondering if anyone will crash that day. You know what I'm talking about if you've been to the lookout. I never tried their food so can't judge on that.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "Cute gay guys on the prowl. Mixed in with strong drinks (decent prices) and dance-y music and outside seated balcony for smoking. A fan.", "author": "Carmen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "I kind of love this place, strong affordable drinks, friendly service, fun music and always great on a Sunday afternoon after an already crazy Saturday night.  My friends always throw their bday parties here in the side room, which I love because they have a separate bar for us to order food or drinks, a warm fire place if its one of those cold rainy SF days, and comfy places to sit.  I don't smoke but my friends who do love to be able to sit outside and Lookout at everyone as they are crossing market or castro.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-10", "description": "They have some of the best pizza around.  The Barbecue Chicken pizza is my favorite.  \n\nNachos are a bit salty, Quesadilla is awesome and hey, what happened to the RIBS! THEY WERE AWESOME!  BRING EM BACK! please ;)\n\nOh...  and the waiter with the blond hair is super cute...", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "one of the bars in the castro where you get the best view of what i call CASTRO CENTRAL. since they have an outdoor patio. you see one of the widest (and crazy) intersection in SF PLUS beautiful people walking up and down market. \n\ninside, there's various seating, as well. you get a fireplace and tables. DJ sets every night. i would definitely go every so often here.. most especially during summer. castro is very interesting during summer, and this place would be a good view point. \n\n$3 vodkas and what-not (happy hour) didn't disappoint me, at all. but i think i was too 'bougie' that one of the bartender have no idea what a 'slurpee' is. (FYI, it's a frozen cocktail!) ALSO, it's one of the bars that offers nibblers and pizza, to keep your stomach fueling (and tendency to get super hangover).", "author": "Marc K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "Gus's Saturday night event, Social Club, is arguably the best gay weekly event in SF. Good looking crowd, and that's coming from a boy spoiled by the guys at LA bars.\n\nOne complaint: no matter what the weather is like outside, this place is always way too warm...I find myself staking out a place by the window.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "We went on a sunday and it was pretty packed the drink service was great and also fast. however it was mostly alot of men. I think i counted a total including myself 7 ladies .lol", "author": "LoveMeTender t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "Some of the best things about the Lookout are the people working there. I've befriended the staff and the bouncers, and they def make the experience! They have a great selection of liquor, have a food menu, and actually have their own privately brewed beer - something unique that not a lot of bars have; especially gay bars! The balcony makes for a great space to hang out on sunny Sundays, but can get smokey on busy nights - which are most nights of the week and weekend!\nCons - bathroom, as with most gay bars, is pretty gross - and sloooow. The backroom could be better utilized - seems to never get people back there.", "author": "Dustin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "Went here for a drag event which was really fun! Everyone there was very nice and the bartenders kept em coming. I loved that they had a margarita bar where you can pour your own flavors. LOVED that. It had a nice view into the busy city and the balcony was probably the best part after one too many margaritas..", "author": "Diana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-09", "description": "This is probably one of my favorite locatins in the Castro. I love the outside balcony, especially on a nice weekend day. You can sit outside, sip your margarita and people watch on what's happening outside on the streets. You can probably see an almost near accident as this is the worst intersection in the City.\n\nI've had many a party here and they've been great. New owners of late and they seem to be ok. Under lots of changes...not sure if I' like them all yet.\n\nI love hanging out here on Sunday afternoons. It's lots of fun and a great crowd. The new Jock Sunday parties are lots of fun!\n\nIt's great to go to Lime Brunch beforehand and then off to Lookout!\n\nI'll take a top-shelf margarita, no salt and a splash of grande marnier on top!  Thanks~", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Decent little bar but a bit loud on the music. Not sure if it gets really busy or not.. So far, only been one time..", "author": "Rix G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-13", "description": "Staff is incredibly warm and helpful. We have worked on a couple events together and its been nothing but smooth sailing.\n\nExtremely professional.. AND good drinks and good food at thick and thin!\n\n:-)", "author": "Art A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-04", "description": "This is a nice casual bar that's not divey, but not too at all fancy.  The drinks are good and there's always a lively crowd.  This isn't the most exciting place to go to, but it's fine if you go with a few buddies and you just want a calm evening out.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-19", "description": "It's more fun than a barrel of drag queens!\n\nI was surprised at the percentage of women here, which got to be the majority as the night rolled on.  Mostly lesbian as I learned from a painful series of lost bets, but some bi and straight girls/guys throw in and feeling welcome.\n\nNot much space to dance.  This is more a eat/drink/flirt/be merry type of place.  The balcony is entertaining for people watching; not to mention the periodic traffic near-collisions.  I didn't have to wait long for a drink, but maybe that's b/c I was fresh meat.  Speaking of the drinks, they were fairly strong.  Imagine that.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "I love to people watch. It's a hobby of mine. This place hosts one of the most fantastic people spots in the whole city.\n\nThe drinks were good. The bartender was friendly to me even though I am a girl and the place seemed to be full of gay men. \n\nMy advice: Bring a jacket so you can sit outside. That's prime people watching country right there.", "author": "Adriane K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-04", "description": "It is so frustrating to me that this is the place my friends like to hang out these days.  Cool location, nice outdoor space, good music allow me to give this place two stars in lieu of zero considering the bartendars are absolutely terrible, inattentive, inorganized and frankly lucky they have ajob!!! The service is the worst of any bar anywhere I've ever been.  Go to the Lookout wtih friends and have a great time, but don't expect a quick drink or attentive bartenders (oh, btw, I don't drink so this isn't coming from someone needing 20 drinks a night)", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-01", "description": "I think this bar is average, the one thing that this place has \"going,\" is the patio/balcony/ i don't know what to call it. But, even that area feels too small, and when people start coming in, you feel VERY clausterphobic. Other than that, its just  like any other bar. I think it would be better, if they did more to make themselves stand out. I didn't pay a cover charge to get in that day, but I hear they do a $2-$5 charge on spontaneous days?  Its NOT worth it. Also, it gets crowded pretty fast, and protecting your drink, while dodging rude people is not my idea of a fun night.", "author": "Gabriel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-01", "description": "I almost passed this place up and was very glad I didn't.  This is a great place to hang out and meet people.  The patio is way too small, but the window give the place a nice open feel.  The bar service is quick and friendly.  The awesome cowgirl lebian working the front door this past weekend was fun and set the mood for people coming and going.  \n\nThere isn't much attitude here, it is just a lot of people enjoying each other's company.  This seems to be a place people go with small groups, as opposed to some of my other favorite \"drink to forget\" or \"drink to get laid\" haunts.  The bathroom line can be a little long, but it moves quickly.", "author": "Ted G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "OK, I'm so late to this game in updating my review, I guess that confirms my total unhipness and uncoolness.   \n\nI rescind my former review and give it four snaps and a circle.\n\nThey definitely figured something was not right and fixed it.  Sunday afternoon's are the best here. Too bad everyday isn't Sunday...", "author": "Jim O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "Ok, I'm going to come right out and say that The Lookout is one of my favorite bars in SF. I'd always been intimidated to go inside being that I'm a girl and this place is known for hottie boys \"looking over\" the outdoor patio. However, Pride solved that for me. I honestly thought it would be skeezy inside, but boy was I wrong...um can I say super fun?? The music is beyond awesome, like Britney, Ke$ha, etc. The drinks are incredibly strong, so much so that my friend had to ask them to put more Ginger Ale in her next drink. There are way too many gorgeous guys wondering around inside, holy moly, and most of them were super friendly and fun! I also like the layout of the place and of course the infamous outdoor look out area. Especially on Pride when you can see all sorts of chaos going on below. I'm not sure what it's like normally, but during that occasion there was a huge mixture of guys and girls. I sooooo want to go back and try out all the other cool sounding nights/happy hour/food!!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-24", "description": "I Think this place is great! The deep dish pizza is serious business. I have made my own by choosing my own toppings every time. AT LAST... a nice sit-down casual pizza joint in the Castro!\nIf only every pizza place had cute, friendly waiters!", "author": "Jimi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-22", "description": "Wow, it is sad how dead this place is. We went in last night at about 10:00pm and there were about 3 people in the place. The bartender was sitting at the bar with a newspaper because he had nothing to do. It is still a great space, and has all the ingreidents to succeed. They need to get some drink specials, some advertising, and most of all a SIGN. Hopefully the new owners can make a go of it.\n\nUPDATE: Went here on Easter Sunday about 4:00pm and the place was hopping, cute boys and sisters of perpetual indulgence everywhere, I had given it two stars, but adding another two, I love that it is doing well again.", "author": "Dave O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-03", "description": "Rude... we went to lime. Nobody checks on you or asks if your food and drinks are ok. Mine was not...but nobody knew. I was going to have a corporate thing here...guess not. Rude ass bartenders", "author": "D R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-12", "description": "k, so hands down FANTASTIC pizza in the CITY!  ;)  Loved both the deep dish and flat crust.  Great vegetarian options too...if you care.  ;)  \nBeen three times and the tastiness has been consistently GOOD.  Must try, more people should be.  CHEERS to THICK & THIN!", "author": "Jester Swink J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "Just here to review the pizza, although the bar looked great....\n\nI went based on the Tablehopper review, and was not disappointed.  In short, it's not as stupefyingly amazing as Little Star, but only by just a little bit.  Thus, it's really good.  And way better than Zachary's.  I had the thick crust Castro Queen and by all measures it was a solid pizza.  Crust was flavorful and not too doughy, fresh ingredients, and tangy sauce.  I will return, and maybe to the bar as well!", "author": "Marty F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-20", "description": "Not only is this one of my favorite gay bars, it is overall one of my favorite bars.  If it is a nice evening, the balcony makes a great place to have a conversation and people watch, the only problem is that for non-smokers, you may end up being surrounded by people smoking.  Overall, the drinks are decently priced (well, considering that all bars are way overpriced), the staff has always been friendly and good music.  My few times there I've never seen it too crowded, which I find nice.  I haven't tried any of the food there, only drinks in the evening.", "author": "Tony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "Been there twice as a Peachy's Puff and gay men are sooo much more generous with tips, smiles, and happy good times than annoying drunk straight men hitting on you.  At least at closing time folks were dancing, not very many, on their tiny dancefloor the times I've been there.  I like the deck, but it was way too packed with smokers.", "author": "Cara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-01", "description": "Five stars for the kindness, helpfulness, and great services from the staff, Eric and the Manager, Chris at the Lookout. I had my birthday party at the mezzanine and Eric was so helpful to get my party set up. He was quick and flawless.  Although he was busy at the restaurant, Eric still managed to take care of my needs. Great nibbles and drinks, too.  I wish I could give them more stars for their friendliness and flexibility to work with me on my schedule and requests. My guests had a great time and so did I. Love it love it and they sure know how to provide good service. Lookout has always been one of my favorite local bars to hang out with my friends. Now, Lookout is the first place that I would think of if my friends want to have drinks and hang out. Thanks again!!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-10", "description": "\"look out! there's a hot bunch of boys sitting in the corner.\"\n\"look out! there's some tasty bar food coming your way.\"\n\"look out! the drinks are very strong.\"\n\ni finally made it to my friend's new bar, THE LOOKOUT! the first time, i jumped the gun and he was carrying in supplies with a sign taped to the door asking for bartenders. whoops. \n\nit was worth the wait, let me tell you. i walked out of that joint all warm and fuzzy, well-lubricated, and grinning from ear to ear.", "author": "May T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-15", "description": "GREAT place to enjoy some late afternoon / early evening drinking with friends.  They need to rename it WatchOut though... cuz GURL!  There's something about the place - the drinks, the views, the balcony, the sunlight - that can keep ya there for a LONG time and gettin' ya PLENTY tipsy.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "This is strictly a review of the pizza restaurant within the Lookout, Thick and Thin. The bar is fine, but don't leave without trying their pizza!  Not the best pizza I've ever had, but it's by far the best bar food I've ever had. The thin crust is surprisingly good. They saute their mushroom topping in garlic before putting it on the pizza -- a welcome change from the dried out mushrooms you sometimes get on other pizzas. Service is friendly and attentive too.", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-18", "description": "Look-out for this place! (unless of course you like a cluster-fuck of crazy)", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "hmm where to start \ngood music\naffordable drinks\nnot a very aggresive crowd\nfriendly atmosphere \n(i am straight)\n\n\nbad \ni had to pay a $4 cover\n\nwill i go back i am sure ill be there again one day", "author": "Trent D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-02", "description": "I'm not a big fan of The LookOut, but I will say this, when I go, I do have a good time.  They do lack space for dancing, which is a pitfall, but they do have a balcony which I enjoy.  The drinks seem a bit pricier here for some reason, again not really sure why.  The DJs are hit and miss, but the last time I went they had someone who spun \"Me and Myself\" by Ben DJ and Sushy, which is my current favorite, so that was a major plus!  All-in-all not a shabby bar, but just not my usual first choice in clubs and bars to go to in Castro.", "author": "Brent A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "I have to admit I like the view from the Cafe a lot better than the Lookout.  Also, I'm not keen on the house version of every pop song being played at incredibly insane decibels.  Then again, I did have a great time for my friend's birthday.  It is very roomy and you can sit down and have a really loud chat (I mean, screaming at the person, practically).  Then again, you don't go to clubs and bars to have chats, huh?  Well, anyway, it's predominantly gay men sprinkled with a fair bit of straight girls in the crowd.  The bar staff is really nice too.  Overall, it was a good time with a bunch of friends.", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-06", "description": "great tasting pizza, I heart beefy and Jonathan, great mix of people and usually pretty busy.  The 'tending can be slow - other times painfully slow, but not bad enough to make me stay away.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-27", "description": "The old Metro  is now called The Look Out. Same decor same crowd but new owners. Sunday afternoons are not to be missed if you are in the Castro. They pour well and they are proud to have Mr Gay San Francisco 2008  as one of their staff members. He is hot, adorable and dating my friend Ms Buss (yes the secret is out...sorry guys but you are so cute together that I have to tell the world) and he loves him some Bambi too...", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-22", "description": "Avoid indie thursdays at all cost.  Not because of the indie music but rather the lack thereof.  Saw the advertisment and had my hopes up that this place will deliver some good indie music but instead they played pure dance pop with some colorful videos almost sounded like a continuous Aqua remix.  At one point they even played \"get into the groove\" by Madonna, I mean when was she indie??  I'm not trashing Madonna or what they played but please don't false advertise and then play dance music because if I wanted to hear Gaga, I would rather go to Badlands.  The closest it ever come to indie of MGMT, i guess.  People looked bored and left and the DJ tried to dance to bubblegum dance music and it was hella annoying......want to shake his head and say play something indie and stop dancing.  Wanted to relax and kick it with some indie stuff but complete waste of $2.  Never be back here again for the not so indie thursdays.  FYI, this place needs to google \"indie bands\" and get an idea who they are cuz what they played were anything but.", "author": "Jerek L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-17", "description": "It's a sure sign when you go out and the first drink you order, the bar tender after giving you your grey goose and tonic asks if you're high on coke... to just call it a night.  \n\nI was visiting SF this past weekend and was meeting a friend there, I got there sort of late, around 1:30AM on a Saturday night... was my first time.\n\nHow should I have taken that?  I was kind of shocked, and didn't really understand at first.  I don't do, or ever have done drugs.  hrm  wow and I still left a tip.  \n\nI was dressed nice, hair was good.  My eyes were a little red from having really bad contact in all day.  hrm.\n\nAnd I thought LA's gay scene was bad.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-11", "description": "Service is pretty damn slow, and it wasn't even that crowded. And they do not know how to make a lot of drinks.  The bartender actually asked me how to make what i ordered.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "LOVE THIS PLACE..   This place is my new hang out place after brunch on Sundays in San Francisco.  The crowd is typically great and has been pretty fun the times I have been in town with friends! Great atmosphere!  LOVE IT!", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "Dude, I'm not gay, and this is my first experience at a real gay bar.  I had a great time.  I went with two girls just incase, and didn't stray too far from them, but overall I had a good time.  Drinks were reasonably priced, and the view was cool.  Everyone was friendly.  I couldn't tell if they were genuine or it's cause I was wearing cowboy boots, but I think I'd go there again, with a group of course.  Oh and I tell you one thing, most all gay guys are ripped!  It looked like venice beach in there.  Made me want to hit the gym.", "author": "Amir B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "This is an awesome place to start (and potentially end) your night. I made my way over here to celebrate a friend's birthday on Saturday and it was the perfect crowd. Not toooo crowded but plenty of eye candy and an awesome view. The bartenders there were really friendly and quick to serve and the prices weren't too bad. On a nice night, this would be a great place to go because of the patio. Extra points go to this place because I ended up with approx. 27 pictures on my camera of me and friends with a poster of a hot half-naked man behind us.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "I was here for happy hour / a trivia night a few months back with some friends and had a blast. The Lookout isn't my typical scene but it was a great place to sip on some cheap happy hour drinks and attempt to answer some trivia questions! Everyone here is really friendly and it's a fun, upbeat environment. I don't think I'd make a special trip out to the Castro just to go to this bar but I'd definitely stop in again if I were passing by!", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "My hazy Sunday afternoon didn't really seem so different from my fuzzy Sunday afternoon experiences when this was the Metro.  And this is a good thing.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "It is fun to come on Sunday afternoons.  The drinks can be a bit pricey, but otherwise it is a lot of fun to enjoy the music and if you lucky enough, stand outside and overlook Market and Noe.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "The last few times I've been to the LookOut I've had a blast.  Drinks are good for the most part - a few bartenders aren't spectacular, but when you find a good one definitely stick to him or her!  The people are on average more attractive than in the other SF gay bars/clubs.  The little balcony area is also nice to get a breath of fresh air and be able to watch the parade of crazies pass by beneath you on the street.  There is also a great little sitting area along the back wall if you need to rest your feet from a night of dancing.  I also generally like the music here.  The DJs play a fun mix of housed-up pop songs.  Love this place, definitely check it out!", "author": "Scottie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "The Burger's and Pizzas are pretty tasty at Thick and Thin Pizza, but not really all that exciting.  Don't get me wrong, I eat here and like it, but I never leave thinking wow.  Service is friendly but amazingly slow.  Hopefully that is because everything is housemade?  Anyway I would give this place 4 stars if things improved slightly as it stands maybe a 3.5.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-21", "description": "Why can't the Castro ever get it right??  What a waste of an interesting space.  Big hopes with the ownership change to live up to its design potential.  Where's the imagination in a town as creative (hello...gay) as SF?   \"Lookout\", you might just find some inspiration from your name, the spectacular view and think about an appealing decor makeover that could attract both old and new clientele looking for something exciting and different (I dunno, retro airport lounge?? ski lodge?? internat'l spy hideaway?? space station??....anything but nothing.  just hire a decorator already!).  \n\nFor pete sake, at least get rid of those tired 'M\" chairs.  Why do you think the new \"Metro\" left them behind?  And please take down that tacky paper sign...prove on the inside that you are new and have your own distinct identity.  \n\nTo end on a slightly brighter note, the exceptional pizza and tasty cocktails are worth a visit as you \"lookout\" onto the Castro Hills and fantasize about what could've been (and still could be with some money thrown at it) a uniquely warm, cozy and groovy (but ideally still unpretentious) place to perch and chill.", "author": "Don C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "I have dined here a few times and have ordered appetizers at the adjoining bar (the LookOut), but this was the first time I had a chance to try the \"All You Can Eat Pizza Night\" on Tuesdays for only $10. (You can still order from the regular menu if you'd prefer.) They have five pizzas coming out in rotation, like a pizza version of dim sum. Our night included 4 cheese pizza, ham & pineapple, tomato basil, BBQ chicken, and a sausage/pepperoni. The slices are a little smaller, making it easier to sample a lot, but I still can't believe I ate SEVEN slices (getting the BBQ chicken and 4 cheese twice). Each one was awesome. They also have a nice wine list plus a full bar.", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "Had a fabulous time at trivia night last night, hosted by the inimitable Pollo del Mar and Bebe.  Bartenders were really friendly, the pizza from Thick 'n' Thin was incredible, and the space is great.  Love the wrap-around patio with the built in stools so it doesn't get too packed for the rail-riders.  Nothing better than a sunny weekend having post-brunch drinks and people-watching over the railing at your neighbors....", "author": "Lis W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-09", "description": "I'll be honest, I really miss the old Metro.  The Lookout just isn't the same.  Maybe it hasn't caught on yet, but each time I've been in, it's been dead.  The location ROCKS- with a great views of Market Street and all the queens walking to and fro-  so the lack of patrons is particularly surprising.  I'm going to hold off on a full fledged boycott of the space until the weather turns nicer.  With the outdoor balcony- it should pack them in when the sun returns to SF.  Fingers crossed, The Lookout space is my favorite in the city and beats Jet, Badlands and BoC hands down...", "author": "AJ L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-21", "description": "Went here for a few drinks on a Friday afternoon after experiencing my first 10 day week! Having come from Dallas, and not really being a \"Castroite\", nor someone who does the happy hour thing with any degree of regularity, I actually found this bar only \"kinda okay\", I mean, as bars go, it had cold beer, a somewhat attentive bartender, music and the usual S & M crowd holding court at the bar (in Dallas the S & M crowd is what we call the \"Stand and Model\" crowd).You know the types; pretty maids all in a row, but you say hi to them and they automatically shut down and go into their best Gloria Swanson pose and  their struggling!    Anyway, after having experienced the Bar on Church first, this place was a welcome respite. I managed to find seating out of the hustle and bustle and just sit and sip my drink and visit with my boyfriend. On a scale of 1 to 10, I give this joint about a 6", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "Fun, fun, fun! I love the little balcony Lookout, as well as the oval bar. The clientele are a great crowd - always friendly and fun. Definitely a good spot to spend a Thursday or Friday night!", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-08", "description": "What the heck happened to the Metro?! This place still has the same tired old queens holding court. Back in the day, it used to be a fun place with an awesome Chinese restaurant. Now it's just another lame bar on Market St.", "author": "Frank R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "I'm a HUGE fan of deep dish pizza and LookOut's got some of the best. Not only are the toppings top notch, but the corn meal crust (at least that's what I think it is) is divine!!! And I love that you can customize it just the way you like. The thin crust pies are pretty awesome as well. Plus they've got yummy fried goodies, sandwiches, etc. You really can't go wrong here. They used to serve a kick-a$$ dessert pizza a while back...graham cracker crust topped with marshmallows and chocolate, aka smore's pizza. it was TO DIE FOR. Would love to see it again...maybe at least as a holiday special :-)", "author": "Gregory G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-02", "description": "I'd be happy to update this review later as it looks like my experience is not the norm, but my friend and I came in here, sat down at the bar for several minutes and were summarily ignored. It wasn't busy at all and the bar tender made no effort to say he would be right with us. In fact, he left the bar area before speaking a word to us! This is when we left.", "author": "Stu M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-06", "description": "1 Star for the location\n(I love that it's on the Church-Castro route)\n1 Star for the drinks\n(tasty drinks from pretty bartenders)\n1 star for the music \n(never seem to be bad rotaions when I'm there)\n\nIt loses points for the drink prices and unattractive and mediocre queers...no offense I love queers (:\nAlso the fact that Ladies Night which is on Thursday costs money yet have no drink specials for the ladies..bad move", "author": "ebony p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-27", "description": "Nice gay bar in the Castro.  I went there on a hetero date and we were welcomed like one of the family.", "author": "Shawn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-17", "description": "I struggled with what to rate this one.  The bar itself does a lot of great events for the community.  It has affordable drinks as well.  But MY GOSH!  It's 100 degrees in that place ALL THE TIME!  And the lack of coat check is just not very nice if they are going to have it that hot in there.  Other then that the bar is great!", "author": "Nichole V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-22", "description": "I feel terrible writing a mediocre review for this place, since I LOVE the location and think the owners are great guys. I have tried time and again to enjoy this place and I just can't. \nWhat are the two biggest gay sins? Being boring and pouring weak drinks. By that criterion this place is sin-city. Cheap happy hours abound all over the Castro where you can get your drink on at reasonable prices, but not here. If I wanted cocktails filled with ice and juice I would go to a straight bar. Eeew! All that cranberry makes me bloat. \nAlso, the bar in the center of the space is the most ridiculous waste of space. It needs to be tucked back against the windowless wall at the back so that barbacks can directly access supplies without having to plow through the crowd. One big open space that opens onto the balconies would make this venue much more interesting for drag shows and fundraisers. As it is now this place looks like it was designed as a neighborhood pub where you sit at a table with your friends, but that's not how they are using the space.\n\nFix it and I will give you more stars!", "author": "J D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-04", "description": "Thursday nights are now ladies nite, a mix of the castro usual hip hop/house/dance/pop stuff that's always in just about every place in castro. The women who run it are very friendly, and you'll find lots of ladies who don't want to go to mecca, or who have come here after (as mecca closes early). This is the new spot for thursday nites for women (unless it's a 3rd thursday cuz thats drift nite!) Ps ok ive been twice... i dont go out to bars too often.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-21", "description": "I have been to this bar twice and both times only stayed for one drink.  They have nice drinks and good bartenders...I guess I just have a hard time staying at a place that seems so cold.  I think there is a lot of potential and maybe trying some drink special nights (I am not aware of them having any) would help.  Also I would recommend getting rid of the stools with the \"M\" on the back., having the old Metro chairs doesn't help create a new image.", "author": "Johnnie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-03", "description": "two words:  TRANNY TRIVIA!  \n\nLove it!  I had such a blast here!  I could see all the handsome gay men around the bar eyeing me and my girlfriends wondering why we'd invade their turf.  But, they knew.  We were there to WIN!  I laughed me ass off and even trash talked a gay porn star in the house!  Walked away with a tshirt, a buzz, and plenty of great memories for my efforts!\n\nYummy tomato/basil and quattro fromaggio (sp?) pizzas.  Pass on the sweet potato fries.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-15", "description": "The lookout is a cool place to hangout at on Sunday afternoon.  Ive been here on Friday and Saturday nights and it can get uncomfortably crowded ESPECIALLY Saturday nights.  Theres no room to walk around sometimes.  The drinks werent that bad not the strongest but fair enough.  I definitely prefer this place on a sat or sun afternoon though.", "author": "Victor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "The fried mushrooms were amazing.. or maybe I only thought they were amazing because I had 3 awesome cocktails? No, the mushrooms were incredible. I came here on a Tuesday evening. My friends and I were able to sit on the outside that overlooked Market St which was refreshing. Everyone we talked to was hilarious and extremely nice. I'll be back!", "author": "Ella C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-12", "description": "The bartenders are nice, the cocktails are decent enough...oh, and the view helps. This bars' best attribute is it's view. Many potential car accidents await (corner of Market & Duboce). Other than this, it like any other bar in The City.", "author": "Gabe T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "Came here on Sunday night (*night* for Sunday, late afternoon for other days), had some nice epiphanies (*epiphanies* for Sunday, happy buzzed thoughts-n-chats for other days).  One... gay bars may be the new hot spot for straight guys to meet straight girls.  Two... yelp parties have lots in common with my favorite things about gay bars.  Three... grey goose sounds a lot like gay goose when yelled over large crowds and music.  ...A few more i've forgotten.  But anyways this is a fun place Sunday night.  Ambiance - loud typical house music with a DJ, crazy video of army men and the little boys wrestling in a field, crowded and hot (at least on a sunny Sunday *night*), lots of men of course, drinks with liquor on the heavy side of course, balcony, large bar in the middle.  It was the crowd and vibe that made it fun.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "My eye muscles got cramps from checking out all the cute guys that flock to this place on Sunday afternoons. 'nuff said!", "author": "Charles U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-07", "description": "I would say Look-out! if you are paying with a card.. I know better though.. right?  always carry cash.. If I actually drank as many drinks as I payed for, I would have left there in a f#@king ambulance. I can over look paying for a few extra drinks, but after the bartender kept giving me other peoples cards I could tell that they don't really give a crap about their job.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-06", "description": "This is a fun place with average drinks at average prices. It just gets ridiculously crowded and hot to the point that you can't even manage to order a drink and have to push your way out to have a smoke. And as far as the long ass line to the restroom, you are better off exiting the venue and finding somewhere else to pee. If you want a crowded space this place can be really fun- if not, then pass.", "author": "Derek H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-08", "description": "I was pretty excited to try this spot ...but unfortunatley the pizza was pretty bad.  Maybe if you were super drunk from a night at the Lookout - the pizza would be a bit tastier.  If you are going for just the pizza,... I'd skip it.", "author": "erica g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-07", "description": "Though usually a fun bar to hang out at - easy bar access, neighborhoody environment when it's not crowded, and great views - going here on a Saturday night is a bad idea.  A $4 cover charge (highest in the Castro) and a bar too crowded to get a drink from makes for a one star review.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "Excellent salads, attentive, friendly service and very good pizza. Terrific crusts for both the deep dish style and the thin. Good selection of wines by the glass and a full bar to boot!  A relatively small spot, convenient to transportation. The view across Market Street makes for great people watching!", "author": "Larry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-19", "description": "As far as pizza goes, this is some of the best in the city - MEGADELICIOUS!!!!\n\nThick and Thin has managed to develop tasty offerings in both the thin and thick crust variety.  If you are looking for a small snack with your friends as you enjoy HH (happy hour), go for the thin crust - The BBQ Chicken is way better than anything you'll get at CPK.  If you are going for the gold and need to load up, hit up the thick crust.  All the pizzas that they regularly make are good, but you can also make your own and it always comes out delectable!  \n\nThe recent remodeling has created a more enjoyable restaurant experience and the location just doesn't get better!  \n\nCan't wait to hit up the all-you-can-eat!!!\n\nxoxo", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-08", "description": "Seriously, I'm not ageist whatsoever. Line my friends up and you'll notice diversity not only in age, but also gender, persuasion, race, and attractiveness. Well, actually, you'd better scratch that last one -- all of my friends ARE hot. That said, I used to love this bar for its quietly rowdy atmosphere and wrap-around deck for supreme people-watching on the 36 or so streets that all intersect just below. However, somehow it has morphed into official \"twink central\" of late, where approximately 6,000 pretty children with IDs now congregate, trying to out-shout one another over the constant mind-numbing thump of the sound system. I am seriously glad for the owners that the business is thriving, but they've definitely lost a former loyal along with this shift; not that said patrons nor staff would care much, given I no longer fit their demographic. And yeah, I know I'm not THAT old, but the only way I think I could enjoy this bar again would be via time machine. Either back to when it was still the Metro or I was 22 ... take your pick.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-24", "description": "next we went to lookout and it was ladies night. i didn't get hit on which bummed me out but o well. the bathroom was tiny and even in a gay bar there was a long line for the ladies room. i wasn't a fan really of the music since i wanted to dance more and it was mostly 80's but whatever i shook it on the platform and made a few dollas.", "author": "Angelina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-24", "description": "Ughhhh, god is this really the \"hot\" spot of the castro?  How sad. This place is without a doubt the worst bar setting EVER! Its like a big circle of death. Due to the \"round\"  layout, its horrible if you want to have a conversation with more than 1 person at a time. You can try to move to another spot, go this way, go that way, but your always stuck in the same position. This is the nightmare of the \"lookdown\"! The people are usually waayyy to drunk off there ass, which I don't understand because its like near DAMN IMPOSSIBLE to get a damn drink in this place anyway. So this is what goes down... You wait, and wait, and wait, and wait, and wait  while the short fugly drunk asian with the cowboy hat sneaks up in front of you and suddenly your now pushed to the back of the line. WTF? Where does the damn line start anyway?? Ok, so now its 36hrs later and I finally have my drink. Now to find my friends I must move through the uber gay sea of 45yr old men that feel the need to wear tight Hollister clothing while swinging there drunk old arms up in the air and spilling my drink allllll over me. Ok, seriously, this is a fricking crowded place, keep the old queeny gay arm movements to a minimum please!! So now that my drink is 3/4 gone from the spillage, shirt and shoes wet, I move through the \"rotunda nightmare\" and spot my friends on the outside deck. I think to myself I can make it. or can I? F\"ck that! Forget it!  The wrap around patio is the saddest, most useless area EVER put in any bar!  It packs you in single file like an elementary school fire drill! Plus, by the time I even make it to the patio door, my drink will be gone, clothes drenched from my spilt drink, nose irritation from the permeating stench of the sweat from the 45yr old Hollitser wearing priss man, deaf from the loud blood curdling screaming voice of the fugly drunk asian with the cowboy hat....... eventually leading to my untimely death. The circle of death.....stay away at all costs!", "author": "B B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-12", "description": "My first gay bar! I loved this place and I think it loved me back. The vibe was all laid back and no one even threw shade at my husband and I for being breeders! The bartender was crafty (making up pretty cool drinks on the spot) and the garlic fries were nummy!", "author": "Shaunte L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-15", "description": "Don't worry-- you aren't going to be eating dinner in a bar. And don't' worry, you're not gay if you eat here. Technically both rooms are under the same name, \"The Lookout,\" but don't let the loads of hunky men in the bar area scare you off. The two rooms (restaurant and bar) are joined by a hallway and platform, with an amazing floor-to-ceiling window where you can sit and watch all the action on the streets below. I've eaten here a few times now and the restaurant side is relatively dead considering the often large, fun crowds at the bar next door. In fact, on a Monday night, we were the only customers dining here. All the better! A quite place to gather with friends and sip cold beers, sink my teeth into salty kalamata olives and garlic-marinated mushroom pizza and enjoy endless people-watching. The service is consistently excellent and all kinds of people are welcome here, despite the prime location in the seemingly exclusive Castro scene. The pizza and views are far better than what you'll find at the other pizza options in the neighborhood (Cybelle's Pizza, Capri Pizza, etc.)", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-08", "description": "Guys....c'mon! The only day that the \"eat as much as you can\" is on Tuesday....but actually it doesn't work this way! Such a looooooooong waiting for a pizza slice or the next pizza to come. By the time it comes weare either zzzzzzz sleeping on the chair or no longer wanting to eat the pizza! I know it is a STRATEGY to make more profits leting people eat less pizza, so why bother saying that it is a \"eat as much as you can\"??? Why bother? It makes us believe we are being cheated on! This is not nice at all! Either drop the night \"deal\" or just serve pizza like the Goats Hill Pizza place on Potrero Hill does! That is \"serving pizza\" as much as you can eat! Otherwise it is just false publicity and scamming customers! Not us anymore!", "author": "karl g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-03", "description": "food is good, drinks are strong, I used to go to badlands but it has become all bridge and tunnel so the lookout is the new it bar, they take credit cards and serve food. can I live there?", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-08", "description": "Maybe Its cus i'm not a gay guy.  I may come across verbally abusive in this review because I feel like I'd been mistreated at this particular place.  First off the bartenders in this place are somewhat ok but for the most part suck ass (maybe they do?).  They don't acknowledge you unless you're a good looking person or something cuz they didn't even see me or my girlfriend for that matter.  They dont serve pitchers and they don't like to joke with the customer in any way, shape or form.  The music was good cuz it was techno, but if I hafto hear another lil wayne or rhianna song again on the radio I'm gonna kill someone. (My ears have feelings too! ESPECIALLY AT WORK WHEN IT'S THE SAME SONG ON AGAIN AND AGAIN AND AGAIN AND AGAIN AND AGAIN AND AGAIN AND AGAIN AND AGAIN AND AGAIN...i recently put it on the spanish station because of it...thanks lil wayne..thanks rhianna..for making me learn spanish!)  it's not because it's rap, because I am a huge rap fan..big pun, cuban link, biggie, big l, nas, jay-z's kinda whack now but still better than lil greesy and marijuana-rhianna.  anyway back to the review.  basically this was my second time in the gay district (you can read my review on sparky's diner if you think i hate gays..) and it was the most dry and arrogant surroundings ever.  there were two girls who kissed which was pretty cool.  that doesnt' happen too often.  but look..the definition of a bar is a place to go to let it out and have a good time.  I was not able to let it out and I didn't have a good time.  I'm never going to a gay bar again.  Thanks you homosexuals...you've ruined gay bars for me forever.  For all of you planning to goto this bar, make sure you're not straight and make sure you're dry and arrogant because thats what you'll expect to see here.  this place gets 10 to the 100th power thumbs down.", "author": "Jack N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-19", "description": "I stumbled upon this place while meeting some friends for drinks at the Look Out next door. I am SO happy that I decided to try their pizza instead of sticking with my normal bar meal of nachos (I fell back into old habits on another visit and they are also delicious) It was the BEST pizza I've had since leaving Chicago. The only bad part is having to decide between the super yummy thin crust or the equally good thick crust. I would recommend going with a large enough group so you can order both =). All the ingredients taste fresh, especially the tomato sauce, which has a great flavor and has real chunks of tomatoes. The best part is there are so many options - perfect for me, who is notorious for placing difficult orders and customizing everything.", "author": "Julia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "Delicious deep dish pizza with a martini. What other pizzeriza has a full bar?!", "author": "Paul R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-17", "description": "The hardest part of leaving my apartment in Hayes Valley was sacrificing proximity to Patxi's pizza.  Thank goddess, good pizza has made it's way to the Castro!  Enough with greasy slices on paper plates; this is the real thing.  Deep dish (I had the chicken club last night....delicious!) pizza covered in lots of sauce.  The magic is in the sauce for me; I'm one of those \"easy on the cheese--heavy on the sauce\" kind of guys.  Many pizza sauces are too sweet for me, though.  This one is a little spicy and super yummy.  That said, I was surprised to find that the thin crust pizza is even better than the chicago style.  And then there's the s'more pizza...do not attempt to eat it alone.  So they've got the food down pat, but the bar's gin selection is anemic.  Can't a guy get a top-shelf gin in the castro?  Perhaps some of the other neighborhood bars have a better selection; I wouldn't know, I usually make a u-turn about 5 paces past the doorman.  The Lookout is spacious, equipped with a wrap-around smokers balcony, and staffed by a collection of heavy-handed, sexy bartenders.  We were able to gather a group of 12-15 friends comfortably, without stepping on each other's toes all night.", "author": "Major M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-12", "description": "We went there early on a Tuesday afternoon and had a great time.  The thin crust Quatro Formaggio pizza was awesome, our cocktails were super, and it's not too expensive.  Great place to relax and people watch.", "author": "Katherine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "I wanted to buy a co-worker a thank you meal and he really wanted to go here.  After eating the pizza, I can see why.  I love pizza and will definitely be making a return visit, maybe as one of the places on my birthday.   If they start having root beer as one of the sodas, they'll get another star.", "author": "Cornelius M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-03", "description": "Plenty of hot guys here but there should be a requirement that they take their shirts off.", "author": "pauline e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-19", "description": "I'm an East Coaster who loves to hate on California pizza.  But these guys (who are also awfully cute!) got something worth checking out.  I've now had both the thin crust and the deep dish versions, both delicious.  And watch out for the nachos - chips are made fresh which makes them impossible to pass up.  The Lookout is a great spot to meet up with a crowd of friends for drinks and snacks.  Great location, fantastic balcony.", "author": "D J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "The Lookout is a great neighborhood spot. The staff is nice and not pretentious. And yes the guys are hot. But what about the pizza, people???  That's why I go. : ) Okay, and beers on the balcony too.", "author": "nicole e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-19", "description": "had dinner at the lookout last night.  definitely a surprise at the quality of the thin crust chicken pesto pizza.  really fantastic, plus it's a great bar with one of the finest views in the city.  the balcony here is one-of-a-kind, come for drinks, come for food, you won't be disappointed.  plus, it seems to be much more mixed than the rest of the castro bars, which this city needs much more of!", "author": "Brent H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-23", "description": "The new pizza restaurant is the best addition to the Lookout bar. Prepared with hearty yeast crust and garden fresh ingredients, pizza is upgraded to casual gourmet without being pretentious. Comes in personal size portions that are still ample enough to share with someone else if you're looking for a tasty tummy-satisfying appetizer. I definitely recommend the 4 cheese pizza where you can actually taste the uniquely fresh flavors of all 4 cheeses. A great blend of subtle salty, sharp and tangy flavors. Would also love to see this particular pizza complemented with a honey wheat crust. Cute and very friendly bartenders make it a nice place to just have some lowkey cocktails with friends and enjoy the food. They've been developing some unique signature drinks which are worth trying too. Hopefully with some warmer redecorating down the road, they'll make the Lookout a cozier and more fun place to spend a social evening or kickback weekend afternoon.", "author": "Tom A."}
