{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "The staff here is amazing! Usually one person working when my team is there for lunch, but I feel like we're never forgotten. All the food is excellent and there are plenty of options to choose from. They also have HP sauce which is rare in any bar!", "author": "Kory L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "This Irish neighborhood bar is such a riot! With its cast of charismatic, colorful & off-colored loyal clientele of mostly SF natives and locals, it could become one of those iconic hang out spots like the Central Perk Café, Cheers Bar, Clary's Café, or Monk's Café! I have literally, on MORE THAN ONE occasion, during broad DAYLIGHT and amongst SOBER people, witnessed a patient coming in for breakfast on a Sunday morning after JUST being released from the ER for having a crazy, drunken Saturday night; an entire bar play musical chairs with no music; people forming alliances with strangers to play pranks on others within minutes of meeting each other; and not 1, not 2, but 3 separate people putting on a mask that they randomly happened to have with them, NOT during Halloween. Again, during broad daylight and while sober!\n\nOk, now about the food/drinks:\nI don't know anything about beer, but they've got a LOT of it. Just remember, \"When in doubt... grab a STOUT!\" Guinness, of course!! \n\nOn cold, rainy days, the Shepard's Pie or the  Guinness Beef Stew hits the spot with tender, juicy meat, rich gravy, and fluffy mashed potatoes. \nSave room for dessert! Get that bread pudding!", "author": "Mitzi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "I came here the night before st patricks day to beat the wild crowd. Im half irish and have been wanting to try it out. I ordered the Guinness beef stew, onion rings, a glass of guiness, and a magners irish hard cider.\n\nIt was still crowded prior to st patricks day in an hour but the awesome waitress ran around and took care of the whole place with ease. She had a heavy irish accent but gave good recomendations and was very personable. \n\nMy Guinness stew was filling and very hearty. Lots of chunks of beef and veggies with the gravy and mashed potatoes. It was all tender and cooked just right. After drinking for a while I got hungry again and decided to go non authentic having met my half irish st patricks quota and got the onion rings. Oh man these were great. Meaty slices of onion and a crispy golden batter.\n\nThey took the time to tell me how much they would love me back and let me know of some good upcoming events and im definitely going to take them up on it.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Love this place!  Great neighborhood bar where they really know your name!  The place is filled with locals and they have some of the friendliest bartenders around.  Be sure to come for brunch,lunch, dinner, and late night bites.  The kitchen makes amazing food!  A lot of the food tastes homemade.  I'm a huge fan!", "author": "Lan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "This places is awesome.  A legit Irish bar to the core.  Good food, great drinks,  awesome & friendly staff, and they play everything.\nWe watched the NBA playoffs(OKC,POR, HOU, UT,) UFC Fight Night Prelim and Main card(Miller,Sterling,Frankie Edgar, Cub, Simon, Santos, Branch, Lee Vs Barbosa) , Showtime boxing( Broner, Charlo, Davis) .\n\nLove this bar in the mission.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "3.5 STARS\n\nA friend lives in the area, so the three of us went to The Napper Tandy and met up his girlfriend. We got here on Friday, May 19th around 9:15pm. We managed to grab a table by the water station along the wall. Our table was roomy enough for another friend to join us later.\n\n*Bacon Cheddar Fries Basket\n*Chicken Wings: spicy buffalo or bbq\n*Crispy Potato Skins: potato skins topped with melted cheese and bacon served with sour cream\n*Beer Battered Onion Rings: served with ranch\n\nI didn't take a picture of the menu, but we got the items mentioned above. A combo platter made up the chicken wings, potato skins, and onions rings while the bacon cheddar fries were their own dish. I didn't try any of the food, but it looked like your standard fried bar food to soak up the alcohol. I got a Jameson on the rocks and one of my friends got some sort of flavored vodka. Maybe an absolut citron?\n\nFun, kinda divey bar. Our server was great and I had a good time. Not sure if they still do Trivia Nights, but I wouldn't mind coming back to check that out. Or just dropping by to catch a game while throwing back some drinks and snacks.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "This place was okay, very crowded and not enough stools when they have a bar table up against the wall. No ventilation so stuffy. The food is good i must say and you get your drinks fast. Only been twice and would go again for the food i just got to stand and eat becauae they don't have enough seats", "author": "Mona L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "I've only been here for brunch, but I would come back here any hour of the day if I could get that wonderful eggs Benedict again. The atmosphere was really friendly and every seemed to be having a good time, regardless of whether people were sitting at the bar drinking and watching the game or like myself and just trying to squeeze in a great brunch with a friend. It was dive-y enough to make you feel relaxed and comfortable, without being too grimy or seedy.\n\nThe food itself was out of this world, especially for a bar. I have to admit my standards were quite low, but once I took one look at my meal I knew I would be enjoying every bite. My friend and I both got the Louisiana Benedict, and we still talk about to this day. The avocado was perfectly ripe, and the eggs a dream atop the sausage and English muffin. This will be the standard I hold the rest of my eggs Benedict to the rest of my life.", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "My favorite neighborhood bar. \nIt's hard to describe what I love so much about this place - it's one of those places you just gotta go to understand. \n\nThe food is hot and delicious. We order the hot wings, the tots, and a few beers and it's heaven! The staff is great and laid back. Love the vibe here. \nScreens for all your favorite shows. Friendly folks all around. \nNo Cons.", "author": "Nini H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Came here years ago when I still hung out with my coworkers. It was funny back then when Ramon left a 21 year old friend thinking he was abandoned.", "author": "M C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-28", "description": "Not a bad place, but please CLEAN YOUR TAPS! The draft beer here tastes rancid. Friendly crowd though, and (occasionally) friendly bartenders.", "author": "Danny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "The best bar food you could ask for, fresh beers on tap, and the nicest waitresses in the city. What more could you ask for? This is my favorite place. \n\nPro tip, get the tater tot nachos with bacon bits. Trust me.", "author": "Todd F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Alas Nappy Tandy, it shall never be. You had such potential but San Francisco beat me down, chewed me up and spit out my spent body and soul.\n\nYou would have been my dive bar of choice new dive bars. \n\nFew melenials and the dirty Irish folk that that both frequent the bar and work there were a complete joy to be around and all of you have the loveliest accents...\n\nI think I met my first semi-reformed soccer hooligan there... \n\nI would have stayed but my car was stolen on a Sunday and I got fired from a semi-shitty tech company the next Monday... A bunch of other sh¡the went down as well... \n\nI wish you all the best and you earned all five of your stars.\n\nMy home town of San Diego, she beckons me back to her warm, soft and inviting busom...", "author": "Steven T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Stopped in on my vacation in San Francisco because we desperately wanted pub food after the Sharks game. The food there is AMAZING and I never would have expected it. It looks like an Irish pub/sports bar mashup and the bartenders are super friendly ladies with quick service and awesome personality. Drinks are a little light-poured, and the specials were just premade cocktails in a pitcher that were a bit too sweet for me. But I would come back here any day for the mac and cheese, bangers and mash, and any other thing on that menu. I hate that I am so far away back in Seattle...", "author": "Hannah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Best dive bar in the Mission. They know how to pour a Guinness. Great place to watch a game. And their food isn't just really great pub food, they have a hearty brunch and an excellent spicy Bloody Mary. And lastly, it's the best name for a pub in the entire damn town. That alone makes this place extra special and worth a visit.", "author": "David A R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Just popped in for a couple of beers while on a business trip. Two fastest friendliest bartenders I've ever had in San Francisco. Day before St. Patrick's Day and this Irish pub was getting geared up while keeping everyone taken care of. Good Luck tomorrow, ladies!", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Ordered delivery through Uber eats and was very impressed with the quality of the food! We had onion soup, Cesar salad, wings and onion rings. The wings were really good size with lots of meat! The sauce wasn't really spicy but it was tasty. The Cesar salad was delicious! The dressing was great and the lettuce was clearly fresh and crisp. The onion soup was also very good. It had more onions than soup, which I personally like. The app didn't have an option for a side of onion rings so I added in the notes section of the order. The onion rings were light and crispy and the ranch dipping sauce was the best! \n\nOverall you can tell the food is freshly made and it seems as if all of the dressing is made in house. We will definitely be ordering from here again!", "author": "Mallory B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-20", "description": "I set up a brunch with some Eng friends and I on a random Saturday morning. It wasn't packed at all and service brought their A game. I've been here at night before too, and it's a whole different story (which of course is understandable, it's a great bar that's always packed!). \n\nI like that they have TV's, ample seating, lots of standing room, and it's intimate enough to have a conversation without going deaf. \n\nEverything I had at brunch was extremely salty, so I wouldn't recommend the food. \n\nLove the energy of this bar, so great!", "author": "Shereen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "This is a great bar.  Not much Irish in this Irish Pub, except that they serve Guinness and a shepherd's pie, but no matter.  The bar area is cramped and small, so be prepared to meet people.  A generous serving of TVs.  Lot's and lots of beer selection, from local crafts, to mexican and american favorites.  Lot's of booze to choose from also; I feel for the bartenders having to navigate around all that stuff in a small space.  Wings are excellent - I don't normally like breaded wings, but the sauce was just the right amount of HOT that I was converted.  Burgers are awesome and the parmesan garlic fries were outstanding.  Happy Hour specials.  A great lil bar that makes me wish I lived nearby...", "author": "Ken P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Great place to watch any sporting event with friends (though you may want to carpool...parking sucks around this area).  They have multiple TVs and even a large projector (although billiard players may be in the way).   Our fairly large group was able to get table(s) when arriving around 430 on a Friday.  \nTheir food is good, nothing to write home about.  We ordered the fried calamari (for some reason, it wasn't on the menu), wings (buffalo and teriyaki), garlic fries, fish and chips, and shepherds pie.  The fried calamari, while not on the menu, was good. Other places that I order fried calamari includes a marinara type sauce which I think would make this dish better.  Wings were very good (but it's hard to screw up wings).  The entrees we ordered (fish and chips and shepherds pie) were alright.  The fish and chips were on the soggy side, but still was good.  The shepherds pie tasted like shepherds pie and was very heavy on the gravy taste (which isnt necessarily a bad thing).  the garlic fries were cheesy and garlicy....best of all THEY HAVE PORTLAND KETCHUP (by far the best ketchup i've ever tasted).\nOur order also had many pitchers. Service was great and servers were attentive in cleaning away dishes and glasses and reordering food.\n\nTL:DR: great place to watch sporting events. Beer is in abundance and food is good.  USE PORTLAND KETCHUP!", "author": "Alex J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Great service, food and beverages. Had the fish & chips and an old fashioned with Bulleit whiskey", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Been wanting to eat here for awhile and today finally did today.OMG!!! From walking in the front door to leaving, out of a 10,it was a 20 ! We were greeted by Lisa immediately, seated, given menus, ordered drinks, looked at menus(plentiful options),got water and drinks, all within 10 minutes. Ordered the Big Blue.  AMAZING!! My partner ordered the corned beef and cabbage. YUMMMY!!!!throughout, Lisa checked on us at least five times although she had an almost full bar! Great food, drinks . Run to this bar, don't walk!!!!!", "author": "Gary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Nice neighborhood bar.  Friendly atmosphere with real Irish bartenders!   Guinness was on point for sure!  Leonie is a gem!  Mission district must do.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Love this place, especially for their Benedict selection and the best breakfast potatoes. Friendly staff, delicious food, strong drinks, reasonable prices and a good neighborhood energy. If you miss brunch service on weekends (they switch to lunch at 1:00pm), you can pivot to a solid burger and what I am pretty sure are the best onion rings in the city. On the healthier side, they serve excellent salads - the arugula salad is a standout - but at its core, this is an Irish pub so you are probably not coming for your health.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Went here for the UFC fights last night. The place is pretty spacious, but it was a Mcgregor fight, we were at an Irish pub and it was extremely busy.\n The staff was beyond AMAZING. Despite people being packed like sardines, blocking the POS systems, and just generally in the way, the staff remained patient, fast, and friendly all night. The bouncer is also hilarious- the boyfriend and I actually hung out with him for bits of the night.\n\nThe fish and chips were good and you get a great portion for the price. Over all a great spot, we've already made plans to go back next weekend.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "Was here on 6/17/17. The service at this time sucks. Other times it was good. Need a new crew this afternoon crew needs to go back to school.", "author": "Ricardo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Brunch is super yummy, lots of tvs, great for watching games with friends, drinks are good, staff is friendly.", "author": "Giovanie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "This place has the most amazing food and best bartenders! Ask for the French dip.. it's not on the menu but, they can make it for you. Arugula salad also awesome.. the wings are the best I've had anywhere.", "author": "William J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "I had breakfast here with my sister the other day while I was visiting San Francisco. It was on the early side (9:30-ish on a Saturday) and we were the only people in the place when we walked in. (More people showed up later.)\n\nWe had a very attentive server, and the food was really good. I had a veggie flatbread for breakfast. I think it had beans, mushrooms, and an egg on top. Originally I was skeptical of the idea of a pizza with beans on it, but it was super delicious. My only complaint is that it was a bit challenging to eat it off of the cute carving board they served it on without getting food falling everywhere. That might have just been a problem I had, though :) \n\nMy sister had the traditional Irish breakfast, and it was a ton of food. \n\nOverall, this was a relatively quick and definitely delicious place to grab some food in the morning. The ambiance is \"bar.\"", "author": "Becca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Who who a thunk, an Irish Breakfast at  6 pm? It worked well , everything was great from the bangers to the puddings. It was hearty filling and priced right.\n Only issue is the multiple waiters/waitresses that can add confusion to ordering , getting fed and then paying bill.\n  Will be back !", "author": "Craig S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Loads of beers on tap, including local, domestic, and imported suds? Check.\nAn actual Irish bartender or two? Check and check.\nDrunk man who stumbles in at 5pm raving about St. Patty's Day? Check.\nMultiple screens showing the xGames, World Cup, and AMA Pro Racing? Check.\nGuinness soup, burgers, and fish and chips on the menu? Check.\nFull bar? Check.\n\n+A solid bar with about 15 bar seats and plenty of table seating nearby. \n+I spotted one bathroom for the ladies and one for the gents (no stalls).\n+Ten bucks for two pints. Not bad at all.\n+After a pint or three, the burger's amazing (http://www.yelp.com/biz_photos/the-napper-tandy-san-francisco?select=d7tPVcBM2fy1m4lmzdDPfQ#Vf9enEeD7ibehshDa9Uteg). Wonder if it's just as good pre-brews. Guess I'll have to go back and see.", "author": "Adena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "Wow, this was a great brunch spot!  The food and service were both top notch.\n\nMy husband's traditional Irish breakfast was quite good - the sausage, black and white pudding (actually meat patties, not pudding in the American sense of the word), and Irish bacon (very different from American bacon, not really smoky) were all delicious!  The home fries were also cooked just right. My husband's only complaint was that the poached eggs were not runny, as he'd expected them to be.\n\nI enjoyed my garden omelette (it was very generously sized and I could only eat half).\n\nThe coffee was nice and strong and we enjoyed the complimentary Irish soda bread they brought us to munch on as we waited for our meals.\n\nThe service was great - our waitress was very friendly, attentive, and made sure our coffee cups stayed full.\n\nThis was a nice brunch find!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Trivia night is fun, we had about 12 teams going.  The woman who moderates the game has a strong Irish accent and makes it all the more enjoyable to listen to and play.  \n\nWe got $3 blue moon on tap all night!  Amazing. Good vibe, good peeps.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "Cute Irish bartenders. Mixed, interesting local clientele. Sports on the big screens. Good spot.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-14", "description": "1 Pool Table, some great rotating specials ($3 blue moons, $1.5 Smithwicks, $6.25 Keep Your Cup Guiness), and they have trivia nights Wednesday starting at 8:30pm. Arrive early to grab a table for your group, and be prepared for a couple hour event - there were 6 rounds of somewhat slow-paced trivia questions! The vibe is cool, and the service was friendly and... Irish!\n\nAs for food, the burger was ok, the fries were too crispy and garlic-y for my taste, but my favorite was the Guiness Beef Stew and I would def come back for that.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Watched the UFC fight at this bar for $10 cover. It's a pretty large space with a big screen in the back and smaller TVs throughout. Make sure to get there early since the bar filled up quickly. The service here is really attentive and friendly.\n\nThey have a full menu of burgers, pizza, Irish food, etc. I got the black and blue flatbread (~$8) which had steak and blue cheese with balsamic on it. It was pretty good but I think the blue cheese was a bit overwhelming. We got mozzarella sticks and parmesan fries for the table. Both were super good!\n\nOverall great bar to watch a game!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-24", "description": "Quick Review: I came here to watch the Warrior playoff game against the Rockets on a Thursday night.  I would never have thought there would be an Irish pub in the Mission but low and behold there is.  This is a pretty low key place with a more mature crowd.  If you are looking for a rowdy crowd you won't find that here but there were still people being vocal and cheering on the home team.  Huge bonus - they gave out free coronas at one point!  \n\nFOOD\nTater Tots - I wasn't super hungry so this was the perfect snack.  Super crunchy and it came with 3 different sauces (garlic aoli, ketchup and ranch).  \n\nSERVICE \nOur server was very busy, she handled the whole back areas (about 6 different groups).  However she did her best to check in with us periodically and took down all of our orders correctly.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-02", "description": "Stella pint: tasted old, not nearly cold enough to mask the flaws. \n\nGlass of water: free. \n\nGlass of soda water: $3.  \n\nGood luck, guys - hope things get better.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "And here's your 5th star review from your pal Crys, Naps. My friend and I hunkered down for last night's Giant's win against the Pirates, front and center. They have a great viewing area in the back of the bar where they fill in the normal pool table area with small tables to accomodate more people. \n\nWe ordered drinks with the super awesome waitress, can't remember her name but she was shorter and Filipino and just great. I love it when waitresses use their personality rather than their \"brains\" to get tips, it's refreshing and I don't feel shame for also being a woman.\n\nFor our appetizers we had the Garlic Parmesan Fries ($4.95) which was lots of parm, garlic, and potatoey goodness. We also had, and I kid you not, some of the best Spicy Buffalo Wings ($5 for 5) I've had in a while. They were very hot tempurature-wise, and slightly spicy with a really solid *crunch*. I had to stop myself from eating the whole plate before my friend got to taste their glory. Normally they're $6.95 for 5 but at happy hour it's $5 for a basket of 5, so we got two orders. Seriously good stuff, and on Monday's they're only 50 cents each!\n\nGreat vibes all around especially during a Giant's win, and trivia right after. We didn't stay for trivia but I've gone before and it was super fun.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "The food and drinks are absolutely amazing.  The staff are really great, and have treated us well regardless of whether they're busy or slow or we're at a table or seated at the bar.\n\nThe only down-side (for me) is that it's also a sports bar.  I don't mind that games are always on the screen, but when a big game is happening the place is pretty inhospitable to people who aren't fans of whoever's playing.  Sure, if you're a sports fan that is a big plus, but for those of us who aren't it means the place is kind of a hit or miss.\n\nI will keep coming back, because when it's a hit it's a very very big hit for me.", "author": "Trilo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Friendly service. Typical barfare. Moderate pricing. \n\nNo love letters here, or hate mail, for that matter: it's like the Goldilocks of pubs.", "author": "Janice P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "After having the app on my iPhone for almost a year, I finally made my first Groupon purchase. It was to this Irish Pub. I love a good pub and this one did not disappoint. Mind you it is an American style pub, so none of the great woodwork, low lighting and bench seats you normally find in Dublin.\n\nThere were t.v.'s throughout, showing various sports, a pool table and faux fireplace. The ladies bathroom was spotless and had plants inside. Apparently they just had a recent remodel. \n\nWe had an appetizer of Calamari with Aoili sauce. A+\nI ordered the Fish & chips. B+\nMy fella ordered the Shepherds Pie. A-\nThe Soda bread was dense and fluffy and the butter was soft. Soft butter is a must when you serve any sort of bread. Bonus points NT!\n\nThe info you have all been waiting on; the Guinness was creamy and delicious. Probably some of the best I have had in the Bay area by far. A++  Of course nothing beats a pint in Dublin (Ireland that is.) \n\nHmm, I wonder if they will play the world series. Dodgers are doing fantastic!\nSuppose I'll have to make another few visits to confirm.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Great service and staff! \nI enjoy the ambiance in this place. Its interesting to me. \nWe came here for happy hour and the prices were decent at that time. \nThe staff was really friendly and really helpful with our questions. \nI would recommend to drop by this place :)\nPros: Staff\nCons: Layout of the place\nStars: 3.75", "author": "Sunny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Cool little place with a nice bar, pool table in back, and a few tables. Their portions are large and good price!", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "My friend lives near 24th/Mission, and he mentioned he likes this place to have a drink during the NFL season.  Asked him about the food, and he mentioned he never tried the food.  Always on the search for a place with good fish n chips, we decided to step in for lunch.  The bar is clean, looks like a typical English style pub with lots of scotch, whiskey, and bottles of spirits in a dark divey cave like style.  The bar has a hallway, with a back room area with a pool table.  Plenty of room, never would have guessed how spacious it is after walking by this place for years.\nDuring lunch, they have a select number of appetizers, and one of their flat bread pizzas at a discounted price.  This caught my attention, so I was distracted enough to not order the fish n chips.  I ordered the wings, and steak and blue cheese flat bread pizza.  My friend ordered a huge burger with an egg on top.  Meanwhile waiting for our food, we shot a game of pool.  The vibe of this place is cool, and we had a good time watching pre-season football and rugby while playing pool.\nThe food was solid, the pizza has a good balsamic glaze with arugula.  The wings were good, not too spicy and plenty of crunchy veggies to help the cause.  My friend seemed to enjoy his huge burger with an egg on top.  I will come back during the NFL season to grab those fish n chips.  Service was nice, and our server/bartender lady also mentioned that Monday nights are all you can eat fish n chips.\nI think this place is worth a visit, its an authentic Irish bar, and the people are nice.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "love love love this place! Great food for Great Prices... they people from the neighborhood are nice plus the staff! Love their Corn Beef Sliders yumy yum nom nom nom", "author": "FoodieBy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "$4 beers during happy hour.\n$12.99 bottomless fish & chips on Monday.\nA pool table in the back. \nLots of booth seating. \nBig TVs.\n\nIt was a good time for our group of about 15-20 people. We put some tables together and talked to each other. It wasn't busy on a Monday afternoon so we were able to sit anywhere and take up a big portion of the seating in the back. We even got to play some pool :) this was definitely a chill place and good for groups! \n\nI would definitely come back around.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Love this place! It can get a bit crowded on popular game nights, so if you're trying to get dinner, come early. It has a sports bar-type feel in the front and a restaurant with tvs and a pool table in the black. Food is delicious, in the average price range for SF restaurants, and the staff is very friendly. This was my go-to bar when I lived in mission.", "author": "Kaitlin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "I love watching UFC, and Napper Tandy always has it on for a $10 fee.  The staff here are very friendly and solicitous in making sure you have a good experience. They all seem to have an Irish accent too!  Love it!  \n\nThe food here is typical pub food with some Irish goodness.  My bf and I love that Shepard's Pie.  We also had the Caesar salad which came in a large generous portion.  \n\nThe establishment itself has some good humored signs on the wall appropriate for an Irish pub and bar.  There is a pool table in the back which is in service when UFC is not playing.  Wherever you sit, you'll be able to see the screens with ease.\n\nAnother great point about this bar are the patrons.  People are so friendly and cool.  It's easy to start up a conversation with someone adjacent to you. The crowd is mostly 30 something, quite diverse and just well behaved.  You won't find any riff-raff in here!\n\nThere's nothing not to like about this place.  It's also conveniently one block from the 24th Street Mission BART station too.  See you at the next UFC fight!!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-03", "description": "Not particularly impressive - meh food - their fried fish was way over battered/fried. And their drinks are just ok. There's a lot of seating and it's not too loud, but otherwise, there are lots of other bars I'd want to eat/drink at.", "author": "Abeer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Love this bar. I go there for decent food and the UFC events. No matter what I get, I usually have fries. I like their shepherd's pie, corned beef and cabbage, bangers and mash, and burgers. I haven't had anything bad here.", "author": "Alton Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "This place is my favorite neighborhood Irish bar. A lot of TVs, you can watch any game of any sport you can think of, from softball to soccer to UFC fights. The staff is incredibly friendly, and they always make sure to update me on the daily specials and offer recommendations for food and drink. \n\nTheir food during happy hour is awesome, especially the wings. Excellent service, they really go above and beyond to make their customers happy.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "There is nothing about this establishment I would change. Great staff, selection, and ambience, if you'd prefer to converse with good company at an \"inside voice\" volume versus screaming at the top of your lungs, only to get a \"what did you say\", head here.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "This place is terrible! Came for UFC 202 Mc Gregor fight and the place was way too crowed and hot with zero ventilation. Waitress was super rude and almost kicked me out when I asked that she turn on the fan or open the door. They closed it to keep other ppl outside from seeing parts of the fight so I guess us paying customers ($15 entrance fee) were just suppose to suffer. On top of that I never got the beer or the chicken fingers that I ordered. I'll never come back here, wish I could give it negative zero stars", "author": "ADIKA B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "I consider myself a burger snob and so I was skeptical when ordering the Big Ass Burger. Long story short, I'll be ordering it over and over again. Big recommendation if you like burgers.", "author": "Winter G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "I discovered this place because I was craving for Shepherd's Pie and when I looked on Yelp, it was close enough to me so off I went to Napper Tandy. Small cozy neighborhood bar with Pub food, a good brunch menu.  Decor or lack of decor was plain,pretty drabby but I wasn't expecting much it was a pub.  The staff was friendly and efficient.  I have always come here during the day to eat lunch or brunch so it was never noisy or super busy.  I was able to enjoy my meal in peace.  \n\nThe food is really good! The Shepherd's Pie was delicious.  The burger was one of the best I have had in SF, really juicy and tasty.  Another thing that was surprisingly good was their Eggs Benedict and their Corned Beef Hash.  I was so happy after trying those you have to try it to know how good it is compared to other brunch spots.  For a pub I didn't expect to love the food but I did.  The atmosphere is fun and it a great place to have a drink with friends in the Mission!", "author": "Maria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Best Irish pub in SF. Great food, service was quick and efficient, beers cold... What more could you ask for... Oh wait TVs for all the sports of course. \nI had the Irish breakfast.. Big greasy plate of goodness. Sausage, bacon, eggs, beans, pudding, and house made soda bread. Great place, Definitely will be back.", "author": "Alan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-18", "description": "Blimey! We came here the evenin' of St. Patty's Day, decked out in green to not get pinched. Probably is one of the closest Irish pubs nearby. Very appropriate, and very packed -- they still had extra tables set up on the sidewalk!\n\nWe got what I'd say were the mandatory \"follow alongs\" -- a Guinness with a shot of Jameson, followed by a true green beer. Which beer that one was is still up in the air (could have been Budweiser...?), but it actually made my hands and tongue green until morning!\n\nUltimately: good service, and I would request a specific beer for green if possible, but it was all for the Irish spirit. Time to kiss the Blarney Stone!", "author": "Garett T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "Just your normal run of the mill - college town type - Irish pub. My friends from Dallas felt right at home here.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "It is what it claims to be.\nAverage Irish pub but excellent servers & some decent menu options for a bar.The salad was quite good. Wish there was more of a beer selection.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-08", "description": "Great place to watch a soccer game.  The fish tacos were tasty and the atmosphere was fun.  Pool table in the back with ample seating for large parties.", "author": "Trey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-21", "description": "I came here to watch the Matthysse vs Provodnikov boxing match, which they advertised in the window, and asked about it when I entered the bar.  Either they were having technical difficulties, or they didn't actually have access to HBO, I never found out which, but the fight didn't happen.  I hung out for about twenty minutes and nobody approached me about it to tell me, except another patron who was obviously here for the same reason.\n\nMy friend and I took a cab all the way across town to the Abbey Tavern on Geary, which reliably shows boxing as advertised.\n\nThis place seems like a pleasant enough little sports pub, but with the city being filled with such places, I feel like you need to be on your game for advertised events if you really want to draw people who aren't already regulars.  Maybe this place shines best when you come here to watch EPL soccer or something, but I wouldn't make plans to watch a big fight here again.", "author": "Gopal R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "A good alternative to Blackthorn for UFC fights. Pleasant staff.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "So I was up in the area and rolling around SF with my homegirl Mai. We cruised over to the Mission as she wanted to hit up Knead and afew other hot spots. Well as we are cruising around just after Mission Carnival, we see this low marquee that advertises $6 for Rum Punch, Margaritas, and Sangrias. Since we were thirsty, well we just had to have a quick drink.\n\nBeing a lover of Rum, I had the punch. They had some citrus and strawberry flavors mixed in and it was delightfully refreshing. I would love to have a little neighborhood corner irish pub like this here in so cal. The corniced ceilings, wood paneling, mirrors, windows galore, I mean it was a great lil hot spot (arent all the corner bars in SF???). They were very busy here and it shows with quick efficient service with a smile. Rather peculiar for the Bay, but not too hard to believe in the mission.\n\nThe seats were comfy, and they had a sit down area further back with lots of tables to house the grub part of their service.\n\nWhat was really crazy, was that this is an Irish bar, kinda obvious by its name. However due to the Carnival theme they tailored drinks to it in addition to playing some swanky latin music that easily made you sway to the rythem of the day. \n\nOverall, I really enjoyed this lil joint! Awesome stuff, check it out if you are in the area and need some refreshment ;)", "author": "Schel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-20", "description": "On Saturday and Sundays, they have a $5 breakfast special til noon. I'm on a budget so I was pleasantly surprised to find a reasonably priced Irish pub in the heart of the Mission. I actually found them on Scoutmob but I think I'll save that deal for when they don't offer a cheap special.\n\nI ended up getting French Toast and a side of potatoes. The potatoes were a little cold but the French Toast was tasty and only $5 to keep this hungry girl from going hungry.\n\nAll of the staff members are super friendly and have lovely accents too. \n\nJust as I was finishing up it was getting crowded as people were watching football or soccer as the Americans call it.\n\nI'm sure the drinks are pretty tasty as well.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "I love this place. Great food. Excellent service. Can get pretty busy for Soccer, Baseball and basketball games but the bartenders are always attentive. I'll be back soon.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Food: Delicious\nDrinks: Great/wide selection!\nPeople: Crowd is chill, fun, sports.  \nStaff: They are great people, attentive, fun and nice : )\nOverall: Go here, great sports bar, delicious food, fun atmosphere.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Very cute Irish pub in an amazing neighborhood. Small and intimate and we were so pleasantly surprised to see that our waitress as well as many patrons were actually Irish! My friend and I split the Disco Fries (a sort of poutine dish), the entree-sized mac and cheese and the chicken pot pie.\n\nEverything was very tasty but some of it wasn't exactly what I expected. Pot pie didn't have a lot of gravy and was VERY heavy on the potato, there was more chunks of that than peas, chicken, etc and not enough broth to properly soak everything up. On top was a MASSIVE puff pastry but the dish just wasn't juicy enough to warrant needing the bread; it just integrated with the potato to make it too starchy and thick. \n\nThe mac and cheese was good but needed to be a bit creamier, would've liked some gooeyness while eating it. It had a great flavor though, and you can add things like bacon or tomato to it.\n\nGenerous portions, very attentive and friendly waitstaff, nice atmosphere. I imagine it's chaos when a game's on or an Irish holiday but at 1 PM on a Monday it was a nice, quaint, yummy place to grab lunch.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-20", "description": "Drinks = good selection\nThey have seating in the back.  And they have some booth seating and some of those cling-to-the-wall kind of seats too.\nService = blah\nPrices = okay.  I got a $5 glass of sangria.  \nBig ass TV in the back area too.\n\nI love the bathroom signs--Lads and Lasses. :)\n\nMost entertaining thing here: the regulars.  lol", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "Napper had a $5 drink special going on as i walked by. dropped to this irish pub which also is a breakfast/sammie place. lots of flatscreens all around. \n\nsetup: place looks/feels like a converted victorian. very cosy.\n\npour: bloody mary(5)\n-strong drink with the various ingredients not integrated well. really tasted the worchester sauce....\n-fast service considering how slammed the place was. waitresses not just serving drinks but fetching and serving breakfast.\n-3ish stars\n\non draught:\n-just a few mix drinks on special, no beers\n-waitresses so busy they didn't have time to smile nor accept tips. gave it to them when they passed by again.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "This bar is THA BUSINESS! Jukebox, pool table, comfortable seats, food, drinks, music...cute sweet waitresses, big screen TVs, THA LIFE! My friend is studying for her class in behavioral psychology and I'm making a cookbook (yea...doesn't involve much cognition). I've been livin' that studying life for a minute but I am graduating this year and plan to never be in school again for my entire life...but my friend has to study so I'm gonna be supportive...SO here are my requirements for a cafe to study: bathroom, free wifi, plug point, open tables for my textbooks. Who would have thought that a bar can provide those same things...WITH margaritas! Woah! Where have I been? Why haven't I done this before? She's my hero! I feel like going back to school JUST to try and study drunk! Maybe I would have made some real educational revelations! \n\nI love this place and can't wait to come again (when I don't have to study, accompany someone studying, or when it's a Sunday) *although, Sundays are great here!", "author": "Leena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Great food and decent prices.  Go for the appetizer sampler or fish n chips!  The staff are great friendly people.  A genuine fun neighborhood bar.  Lots of TVs to watch the game from any seat.  Decent beer selection.", "author": "Zach T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "I recently came to the Napper Tandy for a very sad, but fun going away party. The location is so close to Bart, that it makes for a great drinking hole. It was fun to see all my friends and meet a couple new ones. \n\nI was really tired, so I probably shouldn't have started with a Hot Toddy even though I love those. It was great but decided to move onto Redbull Vodkas to kick my butt into party mode. It worked. \n\nAlso we had a most excellent time. Go Tapper Nandy!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-25", "description": "Not great service- watching games and as soon as someone else wanted to watch some other game, Channel was changed. Didnt matter I was also a paying customer", "author": "Irma P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-13", "description": "I started out liking this place, they put the hockey finals on for us, planned to watch the whole game. Then it went downhill fast.       Waitress came by and says we have to pay $10 each because the UFC fight is coming on. I could give two shits about UFC. I wanted to order some more dinner and watch hockey. My complaint is that they didn't tell us we would be kicked out for UFC when we sat down. When we ordered another round they REALLY should have told us about the UFC thing. Complete BS, and a shitty way to treat customers, it really pissed me off.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "So everybody says \"if you have a bad experience you'll tell ten people; if you have a good experience you'll tell one person.\"\n\nWhelp, I had a bad experience at the Napper Tandy and told Yelp, which means very little. However, the general manager contacted me, apologized and offered to make it up to me. I happened to be in the 'hood a couple weeks later and went by for drinks. She was incidentally working the bar that day and after having a nice conversation I realized she was the woman I'd spoken to on Yelp.\n\nShe was absolutely lovely and even bought us a round, despite being stretched pretty thin with all the patrons.\n\nI'd like to \"publicly\" give thanks to Marissa for being a great GM and a rad person. I love your bar and will continue to come by when I'm in the area.", "author": "Blake C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Outstanding fish and chips. Coleslaw has the flavor I have been tasting for. Really enjoyable. Fish is not greasy and is light. Very flavorful. You will not be disappointed! 4 3/4 stars!!", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "I came here to watch a late Sunday football game, and was slapped in the face with a mysterious charm of cozy, friendly, warmth.  Oh man, is this my kind of bar!  There is a roaring fire place, and the whole place screams warmth and cuddles and red cheeks and laughter.  How this is accomplished, I have no clue, but it is pretty wonderful!\n\nAnother great thing - this Irish bar....has actual Irish people working here!  Gives the whole experience even more charm (which I though wan't possible).  The bartenders were friendly and funny, and even invited our group to a holiday ornament exchange for the upcoming weekend.\n\nOverall, even those this is a pretty standard bar, there is something about it that makes me feel at home, especially as SF starts to cool down through the winter months!", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-05", "description": "In a neighborhood overrun by donut shops, taqueria this and taqueria that, and a plethora of Casas de Whatever, it good to see some diversity in the MIssion. And that is the Irish Pub Napper Tandy.\n\nI stopped here for two reasons, first it wasn't a taco joint and second there was parking out front (a bigger deal that you might imagine if you've never driven in the city before).\n\nThe Napper Tandy is a popular place, cozy but much larger than it seems when you first walk in. An entire dining room is hiding behind the bar.\n\nTheir special was $5 Bloody Mary's. I'm very particular about my BM's so I gave one a try.....I ended up ordering two. This is a well rounded drink. Not as strong as any drink served at the New Patio in San Carlos (few places are) the mix was nonetheless worth drinking.\n\nThe mixture had a soft tomato flavor slightly sweet and non-astringent, moderately spiced with a hint of horseradish. I may have given another star for more horseradish.\n\nWhile there I ordered their Sunday Special....two generous portions of pork loin, two eggs, two pieces of toast and a hill of seasoned potatoes. \n\nAnother 3 star effort.\n\nWhy not 5? I ordered the eggs over medium, they came cooked to death.\nThe pork was just a smidge overdone and I did not eat the potatoes as they tasted off.\n\nOverall though, the Napper Tandy has enough going for it in atmosphere, price and I saw enough other food coming out of the kitchen that I would like to try that I plan on coming back.\n\nIf I can find parking.", "author": "Elwood P. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Found this place by accident we had to use the restroom so we got a beer and stayed for more ... we got bacon cheese frys and chicken wings and it was DELISH! All recommended by our waiter don't know her name but she was tall and blonde and super sweet! Thanks again, we will def come back on our next trip to Frisco! Nice staff and great food and fair prices very satisfied", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "This place is so amazing fast on getting food out cheap prices friendly love this place great music come here its amazing.", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "Pretty cool place to watch a very boring Super Bowl. \n\nBartenders are attentive. Drinks are decently priced. Food is standard- not bad at all. \n\nBest thing about this place is that there are tons of TVs and they turn the sound on really loud. Not a bad seat in the house really. \n\nStandard sports bar. I'll probably go back to watch a fight or a game because it's unpretentious and on my way home.", "author": "Sydney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "Went here yesterday with a friend of mine (12/13/14) first time here, lived on 24th and Shotwell over 20yrs ago, the neighborhood has changed!!!  \n\nI had the full Irish Breakfast, OMG!!  Rashers, Sausages, Black and White Pudding, Potatoes, Baked Beans (I opted out of those) and Brown Bread, our server toasted mine for me (drools)!  I had a Bloody Mary with my meal yum, my friend had already eaten before we met up but he helped me eat mine as well lol.\n\nGuinness was PERFECT, atmosphere was great, the staff attentive, and the crowd was diverse.\n\nWill definitely go back the next time we are in the city!!", "author": "elizabeth m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "Pros - all you can eat fish and chips (Monday special) is super tasty. Amazing cole slaw (i usually HATE coleslaw), fries are great and the white dipping sauce (flavored mayo?) was great. \n\nCons - fish and chips were a bit oily. The food/drinks aren't the cheapest, but not unbelievable either.", "author": "Siva M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "There's a bar up in the Marina that has the slogan of \"The non-Marina bar in the Marina\".  I feel like the Napper Tandy is the non-Mission bar in the Mission, and that's just as good of a thing as the formerly mentioned bar is.  Laid back bar with what appears to be a healthy number of regulars and a low hipster quotient.  All of the food I saw coming out of the kitchen looked pretty great as well.  If I woke up tomorrow and discovered I was living in the mission (let's move past that nightmare quickly) I'm pretty sure this would end up being my local.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "This place is absolutely horrible!! I had the worst customer service experience in my life!! I would strongly recommend to never go there and support this type of establishment! I was there watching the game and I told them I wasn't sure what I wanted several times and because I didn't order within 10 mins they kicked me out and yelled at me.  I was nice the whole time until they kicked me out.  I will never go there again and support a place that treats people that way, I would hope you would do the same, you could be next!", "author": "Obie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "It's all about the trivia here. Trivia all the time. Wednesday nights, so much fun. As for the rest of the bar, a pretty standard Irish pub.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "I have only been here for breakfast but wow what a feast. Great full Irish. Highly recommend for those with a craving. Suggestion to management though. Maybe add brown/soda bread??  Thanks.", "author": "Dave O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "I was visiting a friend and this is one of his hang outs and I LOVE IT!!! \n\nThe bartender was hilarious, she was cracking jokes with us and other people that came into the bar. Everyone is very friendly and you can tell this place has it's regulars as they talk to each other across the bar. \n\nThey have pool there and the bar stools are comfy. I like the set up at this bar.\n\nThey also have pool in the back and plenty of seating.\n\nA must if you are in San Francisco!\n\nCheers!", "author": "Megan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "Came here on a random night to get a few drinks before meeting up with other friends. It was a cool bar with friendly servers. The bar was filled with people but there was a lot of room in the back.\n\n$7 for Jameson drinks, 2.75 for redbull =  was not bad at all. My friends and I will definitely come here again!", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Love this place.  Fish Tacos are awesome, which seems strange for an Irish Pub, but hey, why question quality.  Everything else on the menu is pretty damned good as well.\n\nService is ALWAYS excellent and friendly.  The bartenders and waitresses are very attentive, and know how to keep patrons happy.", "author": "Vicente A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-09", "description": "3.5* Been here once and I must say, for a dive bar, they have clean bathrooms with soap which is 1 star itself.  Food is decent to satisfying.  My bf and friends thought the wings were good, not great.  I had a Royal burger which didn't appear royal, but the taste made up for it.  Fried egg atop bacon and a medium thick patty? Mmm mm.  And they have an assortment of hot sauce.  Tasbasco? check. 2 kinds.  Sriacha for the Asian in me. Yes please.  I can't even spell it thanks to my whiteness.  And Tapatio the ultimate spice master.  Server was friendly which is a plus.  \n\nAs for the actual place, there's one pool table which was always occupied; I wanted to play. Booth seating for dining.  And a bar in the front.  I guess I'm not used to dive bars, but it wasn't the nicest looking interior.  I'd probably only come by for late night food and a drink before going to another place.\n\nI conclude: come for late night food and pitchers of beer- yes.  Come to sit and catch up with friends.  Do not enter if you want to dance, stand around, or expect entertainment besides the people or hopefully nice people you may meet because everyones sitting besides pool players.  Cheers.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Servers were quick, bar food was bar food, shots were big.  Came here to watch the mayweather pacquiao fight, good spot for it.  Was hot as hell inside, but their were mad ppl, but they handled it well.", "author": "christopher h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-29", "description": "Napper Tandy isn't a bad spot, but I did have an annoying experience this weekend though.\n\nMy girlfriend and I went to watch a March Madness game and saw the happy hour sign outside that advertised $3 Sierra Nevada bottles so we walked in and ordered 2 Sierra Nevadas. One bartender took our order and gave it to another bartender, who poured us two Sierra Nevada drafts and not the bottles.\n\nThe bartender who gave us the drinks said \"that will be $10 guys\" and then I mentioned the sign outside. She said that drafts are not in the special. I told her that it doesn't make sense to assume that a paying customer would not want the advertised deal, or that it wouldn't be given on default even though we didn't specify \"bottles\". She just stared at us and repeated \"$10, sorry guys\". We ended up paying anyways, just cause we didn't want to miss the game.\n\nThe $4 is difference (paying $10 instead of $6 total) is not a big deal, it's just a matter of principle. I'm still new to the city, but I probably won't be going back anytime soon. there are too many other awesome bars in the Mission with better customer service. \n\nI just want to give a heads up to other Yelpers that they can't assume the bartenders here will give happy hour specials unless you specify directly.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-30", "description": "The bartenders are nice. \n\nFood is average to below for a pub. \n\nWorst part is the beers are bad, not the selection but the way they pour. Not sure if it's a problem with the lines or the CO2 or what, but they pour bad tasting brew. Also frequently warm. Unacceptable for a pub...completely. \n\nThis place really lost me when I stopped in one day and ordered a Racer 5 and a shot. I already new they were subpar but I was in a hurry headed to bart. When I walked in I heard the owner behind the bar discussing with patrons and workers how some lines had become crossed and certain beers were not pouring with the corresponding tap. When I got my Racer it was immediately obvious it wasn't a Racer, so I let the owner know but said I'll drink it anyway because I'm in a rush. She actually argued with me that she definitely knew it was a Racer (it wasn't).  Not only was the beer warm with low carbonation tasting horrid, but she sold me a heferveisen and insisted it was a solid IPA. Ridiculous. \n\nAgain, the bartenders are very nice. I also like the owner, despite this experience. Danielle is hot. However avoid this place if your heart is set on an ice cold, crisp, fresh tasting brew of exceptional quality.", "author": "don h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Great place for a morning beer! Authentic Irish patrons and bartender!", "author": "Jake L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Knock 'em down.\n\nHungarian style: http://youtu.be/2YhshSW02Gw\n\nIrish style: Excellent egg white veggie omelet with sides of roasted potatoes and beans followed by a hunger defeating veggie burger and side salad.\n\nServer couldn't have been more friendly, genuine and accommodating. Those egg whites came with no extra charge. Perks of asking nicely.\n\nMyon & Shane 54 owned me. I owned this meal.\n\nEveryone won this game of dominoes.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "Awesome...Awesome and more awesome, covered in awesome sauce!  This place has made a complete 180 compared to where it was even 6 months ago.  It used to be a cramped dive bar with mediocre food and cheap drinks to keep the locals coming back, but now I would travel to eat here and even just to hang out.  \n\nThe bar area is open and airy, more loungy like vs. cramped and divey!  The dining room is much more spacious and welcoming.  The bathrooms are immaculately clean and the smell does not permeate the surrounding areas any longer.  They now have a projector screen by the pool table in the back to watch games on.  \n\nOkay...now that I've covered the atmosphere, let's talk about the food...yowzers!  All you can eat fish and chips on Mondays...finger lickin good!  Absolutely amazing...Plate after plate of mouth watering, succulent deep fried goodness piled atop hand cut french fries!  What more can you ask for???  All the other food is good too!  I usually get the Chicken Pesto sandwich and that's even gotten better since the upgrades (which also include trained chefs).  \n\nAnd last, but most certainly not least, the bartenders!  Lisa and Amanda!  Best of the Bay material...I love them both.  If you haven't checked out the Napper, you need to put it on your list.  I promise you will not regret it.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "napper tandy's is my most favorite bar in the mission.  MY MOST FAVORITE BAR.  i loved it when i first moved into the neighborhood two years ago and i still love it.\n\nthey recently upgraded the space - inside and out!  and it looks AWESOME.  unfortunately, karaoke on saturday's is no longer but they still have trivia on wednesday's, they still have the same great staff, strong drinks and now there's more room to sit and order food and get all types of tipsy.\n\nsomehow, i don't know how, but shit always happens at napper's.  not bad shit though.  good shit.  always good shit.  i've taken a handful of out town visitors here and months later they say how much they miss napper's.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Loved it. Authentic Fish 'n Chips with British vinegar. All you can eat Monday's.  I could've used a wheelbarrow to leave. Definitely going back.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "The housemate and I headed here to catch the Giants game 6. We were lucky enough to find a seat just in time. Within minutes, the bar got super packed with people and the drinks started flowing. There were 2 waitresses that I could see (plus the bartender). Without a second of delay, the waitresses came right up to our table and for the rest of the evening tended to all their customers as if they were the only people in the bar. Very polite, relaxed and attentive.\nWe had some garlic fries, which were great and a couple beers each. The prices are reasonable, the bathrooms are spotless and the WAITRESSES have special waitressing powers or something because they were awesome. \nDefinitely recommend this place.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "8:30 on Wednesdays are trivia quiz night.  Bring your brain trust, stomach and funny hats (can't remember why though).\n\nWe arrived with a Groupon, unknowingly it was trivia night.  Nice to exercise the brain once in awhile.\n\nIt's a pub with the usual beers but it also had slightly more elevated food menu than expected.  We started with a mixed green salad with balsamic vinegar, then beef stew + fish and chips, and finally a decadent fudge brownie with whipped cream.  Meals were delicious and bar staff friendly and helpful.\n\nA couple of dark ales and waters later, it was trivia time- 6 rounds.  We lasted 3 before calling it a night but did pretty well...3rd place.  Believe the first prize was a $30 gc @ Nappy Tandy's.\n\nCheers to a friendly pub where everybody is glad you came.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "A pretty good Full Irish Breakfast, but certainly not the best in the City.  And either their plates are too big or their servings are too small - it's disappointing to see so much open space on the plate.  The toasty soda bread was amazing.  Great bloody marys - and at only $5, destroys Fiddler's $10 average bloody mary.\n\nService was pretty darn cheerful considering we were there the morning after St. Pat's.  \n\nWe didn't have a session here, just breakfast, so I can't judge on the bar.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "My girls and I ducked in here on a rainy Saturday night. The front area is small so it gets packed fairly quickly, especially once karaoke starts.\n\nOur bartender was awesome - she was super friendly and gave me generous pours on my Dark & Stormies. The best part was - they were only $4 and it wasn't even happy hour! \n\nKaraoke provides non-stop entertainment - at one point we formed a cheer section for our friend as she went up and rocked out to \"I Love Rock & Roll.\"\n\nRock on!", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "Friday night, meeting some friends for a going away send off. \n\nI arrive and sit at the bar with xx. The rest of our group slowly trickles in. We are now congregating at the bar, deciding on what to order. \n\nBartender S: Hey, are you guys Yelpers?\n\nWe nod in confirmation. \n\nBartender S: I knew it! I recognize you guys from your reviews and talk. (points) You're xx, and you're xx, and you're xx, etc. Points to What's his name, I know you too but I can't remember your name. \n\nWhat's his name: Um, I'm the only black dude in San Francisco. \n\nHA HA!\n\n====================================\n\nFavorite part of the evening: Watching xx sit on XX's lap, doing an impersonation of a ventriloquist act. \n\nMost disappointing part of the evening: Not having all my orifices ravaged as was promised. Bye sweetie, we'll miss you!\n\nOne star off for not having red stripe and my watered down drink. (Not poured by Bartender S).", "author": "Chum L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "Was digging this place , nice sized , and people were having a great time , the vibes were good , and they had some very beautiful lady's working behind the bar with great personality , will be coming back next time I'm in town", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "This is a nice little Irish bar but I really really really wish they'd lose the pool table in the back that takes up half the damn place and is usually played by a bunch of obnoxious drunks who ask you to move out of the way so that they can miss their shots.\n\nThe bar is a lot smaller than it looks from the outside, and that's due to the damn pool table and a narrow connection between the back of the bar and the front. The front of the bar can get really crowded and when it's cold, the draft from the door can wreck you.\n\nTables are reserved for food-ordering folks but there are bar stools around the bar where you can down your Guinness. They do pour a real mean Guinness, courtesy of  the lovely Irish bartenders who will sass you if you sass them. TVs are set up in the front bar but they generally play football (the kind  where if you call it soccer to an Irish fan, they will reward you with a punch to the neck).\n\nTheir bar food is quite good! I wasn't expecting it but not half bad as far as bar food goes and the prices are decent.\n\nMost of the bar was filled with Irish ex-pats and some random Mission folk. No hipsters, which made it a huge plus in my book. I will love it much more, though, when it gets rid of the damn pool table!", "author": "Logan The H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-21", "description": "Date of visit: 4/16/16\n\nLet me start off by saying the food was great! Definitely exceeded what I expected to get for an order of wings and fries. Delicious! \n\nThe service?! HORRIBLE!! I would give our \"SERVER #2\" (as the receipt showed) a big FAT 0. Just a super bad experience. She either seemed too comfortable with her type of service or just didn't care. We walked in, got sat by her. As soon as we got sat, she asked us what we wanted to drink but as though it was a bother for her to ask. Both my friend and I ordered a Bloody Mary (delicious by the way). Once our Bloody Mary's were brought to us by SERVER #2, she asks us if we are ready to order and we say yes. She then says, \"Ok. What do you want?\" Ummm...last I know, NO server asks anyone in that way. Are you kidding me?! We order and immediately walks away as soon as we are finished speaking. Did you like have to use the restroom or something that it was necessary to walk away so fast as soon as we were done ordering?! Our food comes out about 10 minutes later but someone else other than her brings it out. We take a few bites and are need of more napkins and want another BM. Where is our server?! A table of 4 gets sat next to us. Immediately she re-appears again and goes over to them, takes their drink order. Ummm...hello?! As soon as I see she is done taking their drink order and is about to walk away I say \"Excuse me, can we please get some napkins and 2 more BM's please?\" And she says, \"Yep!\" and AGAIN zooms away. Again....okaaaay? 5 minutes later brings us the BM's but this time, SLAMS them on the table and goes to the table next to us to take their order. That to me just did it. I was mad, upset, and ready to finish eating to get out of there. Never, EVER have I had THAT horrible of service!! So never asked us how the food tasted, never checked on us to see if we needed anything, and never asked if we were ready for the tab. WE had to ask for it. We ask and brings it immediately. As soon as we put the cards out, she was quick to come and get them from us. Brought our cards back with the receipts. I never, ever leave $0, but I was soooo tempted to. We ended up leaving her $4 so she knew her service was not appreciated one bit along with a little note of advice. I never complain but this time, I truly felt it was needed! So server #2, if you are always giving this type of service, maybe serving is just not meant for you.", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Good service, decent prices, decent food: I ordered a chicken caesar salad, and they were generous with the chicken portions (and it was warm) Also came with soda bread, which was pretty good.  \nBonus, I left a bag there and the bartender had it for me behind the bar when I came back.  (I know that's often expected but it was a great feeling)", "author": "Eva L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-07", "description": "Have not been back to spend my money here because their service was disgusting. I am sad to say I loved their happy hour and that they have modelo on tap but I can not bring myself to be in an establishment where I feel unwelcome.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "As far as bars go Ive probably said this before I like to drink and if they are serving then its a great bar.\n\nPool Table = yes\nFull bar = yes\nPitchers = yes\nDarts = NO (sad face) most bars don't\nFood = decent (bar food)\nvibe = divvy but quiet enough that you can talk to people on most nights.\nOutside seating = yes\nDrunk Homeless people nearby = always\nStinky = probably\nAccepts Credit Cards = YES\nFun = yes (but thats because they have alcohol)\n\nDrink up!", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "Came in here last night after foreign-language-study-date-with-attractive-friend and had a good time. The waitress, who I believe was named Lisa, was really friendly and accommodating, smiling lots and even closing the door to keep us all warm. I had the Veggie Burger and actually preferred it to the one I had a week before at the more fancy Urbun Burger. It was also $3 cheaper. With good company, a nice pint and several games playing on TVs around the bar, it was a pretty perfect night.\n\nThis is why I love Irish pubs.\n\nThey also have rotating food specials throughout the week. For example, every Monday, they offer all-you-can-eat Fish and Chips. I wondered to myself just how much fried fish and potato I could put away before exploding and becoming a threat to national security. Not much, I don't think.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "Great atmosphere with a welcoming horseshoe shaped bar. I had a few pints of Guinness along with a fish and chips -- both were excellent.  The burger also looked good.  It was fairly full when I stopped by on a Sunday afternoon, but my friends and I were able to locate three stools together at the bar. I'll definitely go back at some point. If I were closer, I might just be a regular.", "author": "Brad C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-11", "description": "Napper Tandy is great place to go to after work....weather is with co-workers, friends or even with my  child to play some pool.\n\nThe atmosphere there is very friendly, specially bartender Smiley Lisa! She kno almost everyone who is in there and treats everyone great. I go there almost every Friday, and she makes me feel very welcomed, and she always greets my lil girl with a big hug. \n\nWeather I only go to grab a beer with friends, or for some dinner and a pool game with friends and kids...we are sure to have a good time!\n\nTheir food is delicious, specially the fish tacos are glorious, and the new look the Napper has is very clean and cool. And their happy hours are gnarly!\n\nI def recommend this restaurant bar!", "author": "elena s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Excellent local Irish bar. Great food, great place to play pool and shoot the shit.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Awesome Shepard's pie and great beer selection. We had a party of 4 and walked in at 7 and found a table immediately. Fast and friendly service", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "This is a great place for breakfast and booze. Last World Cup it was one of two spots I'd go to virtually every single day. No matter how crowded it is, the staff is super attentive and totally nice. The food is good, especially the breakfast fare. Stiff drinks , affordable prices", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Great atmosphere, incredibly friendly bartenders, good food. They have a great jukebox and tons of screens for watching sports. Pool tables in the back are typically open and I typically stop there whenever showing visiting friends around town.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-23", "description": "On a recent night, I popped in to have a drink on my way home.  Before I even sat down, the blonde gal working  the bar barked, \"THE KITCHEN IS CLOSED!\"\n\nI replied, \"Umm, okay, well actually I don't want anything to eat, I'm here for a drink\"\n\nAbout 10 minutes later, a guy walks in, sat on the barstool next to me, and asked if he could see a menu. The same gal working the bar said, \"Let me see what the kitchen has remaining ...\"\n\nShe returned from the kitchen, and informed the guy that he could have fish & chips. He said, \"Great, I'll have that\"\n\nI'm just wondering... did the blonde gal working the bar simply have something against latinos (after all, the guy who strolled in TEN minutes after the kitchen closed, was white, and he got served food).  I'll take my business to a place that doesn't hire prejudice bartenders.", "author": "Ted K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "The Napper what? The Napper who? \nThose were the questions I asked a few years ago when my friend, Randy, asked me to join him for a trivia night (and that's when my love for pub trivia began!). All I knew was that it was some Irish pub in the outer Mission. It was an awesome first experience at TNT. Found a parking spot right in front of the bar, ordered and enjoyed yummy pub food, drank a few rounds (or more) of beer, and came in 2nd place for trivia (not bad for a 2 person team)! Awwwyah! For the 2nd place victory, we got $20 (I think) credit for TNT. Sweet! \n\nBeen to TNT several times, and always good fun! It gets pretty crazy on Friday and Saturday nights, but I just recently stopped in for a drink and grub on a Sunday night and the crowd was pretty light (considering it was St. Patty's Day weekend!). Ordered a grilled cheese on sourdough with a green salad (or fries). This was a very good GC, especially since it was on sourdough! Green salad was mixed greens with a nice balsamic vinaigrette. \n\nService is good at TNT and food is tasty and reasonably priced (for pub fare). Cool ambiance, and the front area has a few tables by the door, but more stools around the bar. There's a cool jukebox with a sweet selection of songs from Journey, U2, Beastie Boys, etc.,  Additionally, there a bunch of TVs for your sports viewing pleasure. \n\nWill be back to TNT! More fun times to be had. \nErin Go Braugh! \n(In honor of St. Patrick's Day, I'll be yelping all Irish establishments this week!)", "author": "Gill C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-10", "description": "This is just for brunch. And it hurts.\n\nIf you like to brunch on the weekends with your dog and not a whole lot of other people, this place is it. And on Saturday, this is the activity of choice for us. You can have an Irish server who is both friendly and an excellent waitress....\n\nOr you can go on Sunday, where you have this one server who is as sweet as anything, but is not a good server, and what's worse, for some reason they make her work alone on a weekend.\n\nLast Sunday, we hosted out friends from Santa Cruz who had heard how we love the Irish bar that allows dogs. I saw that server, and I knew it would be a disaster. It was. She didn't write down any of our order (why do servers do that? Please write it down. After a certain age, everyone's memory just isnt' as good) Our coffee tasted like water, our eggs were cold and she forgot our soda bread. \n\nDuring our last Sunday visit, the dirty dishes from the guests before us were still on the bar when we left. Gross.\n\nI'm posting this because I would want to know if I was making a mistake so I could fix it. Please Slapper Nappy, get some help for her on Sunday!", "author": "Suzanne R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-23", "description": "Around the age of 4 - I raided my parents tape collection. I listened to the Eagles, Beach Boys, Beatles, and Abba non-stop for a good two years.\n\nBut Abba was my favorite. I used to choreograph interpretative dances to each one of their songs, and make my bewildered mom sit and watch.\n\nMe: \"Money, Money, Money....must be funny, in a rich man's world\"  (throwing monopoly money everywhere)\n\nProbably the best hour of her life (in my opinion).\n\nSo yesterday, when I was in the Mission and heard Abba trickling out of The Napper Tandy, I knew I had no choice but to go inside.\n\nI ordered up a vegetable pastie. Thick greasy flaky dough, filled with curried vegetables. It was decent, though a little expensive, and the service was a little slow.\n\nThe quaint front bar area reminded me of the pubs I used to go to when I was younger in Wales: warm and community-oriented.\n\nI don't know if I'll be heading back anytime soon, but if I ever have the urge to belt out some Dancing Queen karaoke  - it's reassuring to know that I don't have to look too hard.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Napper Tandy! Always a good time, full of good people, and the service is utterly amazing. Lisa, Emma, Leoni,  Sherri,  Shersa, Catrina, Janet, Franchisca and the onwer Marissa give their heart and soul to this establishment as well as their customers. Food is great,  drinks are fairly priced amd promt, and the energy is always fabulous. Thank you Napper. Will be back... daily!", "author": "Darian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "LISA IS THE BEST!!!\n\nI went there last Sunday for the Mexico soccer game and it was packed and crazy and hectic, but Lisa, the bartender, was so attentive, so nice, so amazing! She was so patient and didn't look rushed or frustrated because of all the people. She even offered me a taste of a beer I hadn't tried before.  Usually bartender can be huge a*** when it's crazy busy and crowds, but she wasn't.  \n\nOverall I think she has excellent service and such friendly vibe/personality.\n\nThanks Lisa :)\n\nI didn't try the food, but it looked sooooo good!", "author": "Katherine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "Yep thank you Napper Tandy for being what you are. Overcrowded?? No way. Over priced?? No way. Lines?? No way. Just as a neighborhood bar should be. Perfect place to grab a drink when you just want a little r & r.\nBartenders are always friendly and are sure to offer to fill your beer up before it appears to be empty. Clean enough with dim lighting and comfortable seats.", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "Interesting place a block or so away from the Bart station... A lot of flies (actual flies) around the bar, but the service made up for it(super-friendly bartender). In full disclosure, I wound up here around 2pm on a Thursday, and was the only one in the place... So I can't really  bash them too much.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Omg... Best Irish food in the city. Live music. Can't beat it. Shepard pie and chicken pot pie both amazing.", "author": "Tony T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Came here last night with some friends on an impromptu pub crawl. It was pretty busy still at 8:30 on a Friday but still got a table. The server was quick to respond and very friendly. The cocktails were reasonably strong and priced. Mixed clientele but all seemed cool. Didn't try the food but quite a few people in the back were eating.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-31", "description": "Mediocre breakfast at a decent price ($5 entrees before noon, $9 after that, $5 bloody mary).\n\nService wasn't great, but they were slammed during Carnaval so I'm guessing it'd be better on a normal weekend. Our server was irritated that we had a Groupon-like coupon on the phone vs. printed, so be aware of that and print a coupon beforehand. \n\nCheap is good, but I think you get less than what you pay for here.", "author": "Kimberley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "BEWARE! ACHTUNG! CAUTION!\n\nIf you go to the Napper Tandy with LAUREN P you might end up TIME TRAVELING.\n\nIf you are not prepared for time travel, hold onto something stable. Even though the patrons are all friendly try to stop stealing the karaoke mic - Ken is not your \"constant.\"\nEverything will be fine, eventually.", "author": "Gabriel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-23", "description": "The owners/staff have always been helpful and nice, and it's a great dive, in the best sense of the word. \n\nSurprisingly, the food is very good and very reasonably priced. I've had 'brunch' a few times, and after a great $5 breakfast and a few of their very very good bloody mary's... well, I've had fun. They also have mimosas in case your sister is coming along. She also had fun. \n\nThey have a thing going on every night, whether is a pub quiz, endless fisn-n-chips, or 'bring your iPod' night. Awesome times.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-20", "description": "There's lots of beer on tap, happy hour drink and appetizer specials, a full menu of pub food, big booths in the back, real Irish staff and pool. It's also super BARTable and way chill. I am far from impressed by their liquor selection but oh well - you can't have it all.\n\nHappy hour is from 5-7pm:\n-1/2 off ALL appetizers: Fries, garlic parmesan fries, bacon cheddar fries, chicken wings, potato skins, mozarella sticks, beer battered onion rings, chicken fingers, fried calamri\n-$3 well drinks\n-$3 bottled domestic beer (alternates)\n-$5 select cocktail (alternates)", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-23", "description": "After watching a Food Channel show about Fish Tacos we decided to drive to the Mission and get some.  This bar is fine, and the comments about friendly staff are correct.  But, the food was tasteless.  The Fish, which I was told is Cod, had neither taste nor texture, the Pico de Gallo was equally bad.  It had no heat, no spices, it just sat on the plate with the Cole Slaw, basically doing nothing, adding nothing to the taste experience at all.  Too bad, as walking through the door I had great expectations.  Order a Bloody Mary, but stay away from the Fish Tacos.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-20", "description": "This place has gone downhill. Or at least, it's having schizo moment, depending on time of day. The last time we were here, a couple years ago on st. patrick's day had a respectable shepard's pie. That's when it was in Irish bar mode.\n\nBut last night, it was almost empty on a Friday night at 10 pm -- yet the booths were covered in beer glasses from who knows when. There was a fancy cocktail menu with Miami style clip art and ketel one drinks, that didn't fit in at all, plus a second wine menu???  The bartender was slow and confused, even though there was no one else there.  You might say it was the location...but we went to two other even more out of the way bars in the neighborhood and they were bustling (Treat Street and the Phone Booth) that night.\n\nThe Napper Tandy may not be long for this world.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "Love the atmosphere, very friendly. Marisa (sp?) Was amazing! I am definitely coming here again and will recommend this place to everyone I know...", "author": "Josue G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "Ok so I celebrated my birthday here... And I don't remember anything. Ok so up to what I do remember... I came here with a couple of friends who decided to go bar hopping in mission district. We stumbled upon this place after passing on a couple of other bars that were either cash only or had cover. Once we walked in we could feel the nice vibe of the place, everyone was having a jolly time chatting it up and the bartenders were busy serving up drinks to everyone. So my friends and I started off with AMF's for everyone and that was when we started to get into this random conversation with these two hilarious Irishmen. As soon as they heard it was my birthday they wanted me to get a shot of whiskey. Me, feeling bad that it was just me taking a shot decided to buy a shot for everyone. And that's how the night started to get rolling. 3 more shots and a Long Island later I am starting to brown out. That's when the conversations started to get much more deep on a personal level. That's when I realized that we were actually in an Irish pub and that Irish people are freaking hilarious. They would clown on you so hard but got the vibes going up. Yeah I don't remember anything else after that except a faint memory of throwing up right outside the pub. That's how you know this place is cracking lackin.", "author": "Joe Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "Napper Tandy pours a great pint of Guinness. But mostly importantly, it makes THE BEST FISH AND CHIPS.", "author": "L P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "Great service! Good ass food! Best pub in the Mission!", "author": "Main G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "My local after work cocktail stop on Fridays. The beer is good, and the girls who pour it are nice.\n\nThey have a pool table in the back, which makes for fun after you've downed a few. Watch out for Beau, the local pool shark.\n\nThey serve food here, and I've only had the Shepherd's pie, but it was pretty good.\n\nFunky mixed crowd. You'll get Latinos (you're in the Mission, duh), some Irish ex-pats, and your regular smattering of local bar room characters. If you're lucky, you might even see me!", "author": "Wes T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "Lovely ladies behind the bar and amazing comfort food. Always welcomed with that Irish love and the Guiness Braised Beef Stew...I die for it every time. Tender pieces of meat paired with fresh, rustix veggies and mash. I want to marry this place.", "author": "Charmae C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Walked in not knowing what to expect. The bloody marys are cheap and good. Made from a mix so I knocked off a star. Had the Louisiana eggs benny and they were really good. The sausage was nice and flavorful with a spice to it. Great atmosphere,  a good place to catch the game. Bartender is nice and attentive.", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Cool sports bar/irish pub on the corner of 24th and South Van Ness.\n\nGreat place to catch a game because this place is chock full of flatscreens.\n\nClientele is pretty mellow and very friendly.\n\nAll the barmaids are cute little Irish lasses who from the accents you can tell, probably know a thing or two about booze.  They do not disappoint serving up drinks lightning quick even when this place is packed.  Prices for drinks are pretty decent, if I remember right they have $3 pints of Pacifico on draft, that's not too bad.\n\nFood is decent.  I can say that the Guinness Irish beef stew is pretty tasty.  The fish and chips always looks and smells bomb so I'll have to check that out sometime.  One of my homies said the shepard's pie sucks though so probably stay away from that.  The bacon cheddar fries are amazing, but that's no surprise because you're taking three things that are awesome on their own and combining them.\n\nAmple street parking in the neighborhood and about a block or two from the Mission and 24th BART station.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-11", "description": "Actually 3.5 stars, but not possible to  give half star ratings.  Good drinks, good bar, tasty burgers and fries.  My husband had the bangers and mash and said they were bangin!  Reminded him of his Gran.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "The Napper Tandy is one of those great local bars where you can get a tasty order of fish n' chips on a Saturday night and not have to fight through a sea of drinking locals to get it.\n\nThe bar staff (all Irish ladies) are friendly and quick with the bringing of victuals and ale. The prices are good and the portions ever better. A half order of fish n' chips should satisfy any normal hunger. The mozzarella sticks are also delicious, and with ranch instead of the usual marinara.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-22", "description": "Food was pretty good, and server was nice. I enjoyed the chicken pot pie and green salad (just lettuce tossed in a balsamic vinaigrette). The food there is very filling. There was a steady stream of patrons in and out around 8:30 on a Thursday night. Not sure it's a place I would recommend, since there are many other spots for a drink in the area. But if you want a place that is relaxed and easy for a beer and quick bite, this is a solid neighborhood spot.", "author": "Katelyn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "We went over for a quick pub dish-also to see the Giants vs Braves and let me tell you....the food was DELICIOUS!  Usually one will receive so so food at a bar but this Irish pub has it all.  Dive bar with tvs everywere with great service and yummy food.  They have prices you can work with in SF...not to mention daily specials like all you can eat fish and chips on Mondays!  I had the pesto chick sanwich with homemade cut fries(YUM) and John had the fish and chips.  Beer battered onion rings as a side dish...best I have ever had.\nDef a place we will visit again......", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-19", "description": "Pool table?  I didn't know they had a pool table in here.  You'd think I'd have noticed that.  Anyway, don't know what it's like here at night, but was here early evening with the McPhee, drinking in the mission, celebrating the bad economy and playing the proverbial violin as Rome burns. (For the record, the fiddle or violin wasn't even invented yet during the great fire of 64 AD in first century Rome)\n\nBartender was okay, patrons were interesting and I liked how the door opens up to give you a birds eye view of the world going by.  Didn't see any douches inside...perhaps it was a little too early.\n\nDrinks were sufficiently strong and reasonable...I'd consider going back someday.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "Just about everything I want in a neighborhood bar.  Decent selection of taps, reasonably priced.  Capable of producing the standard basic mixed drinks.  It's big value-add: they're food is really good and reasonably priced - the burgers especially, although the same goes for the Fish & Chips.  \n\nThe bar is split into two rooms; a big bar in the front, and a bunch of booths with a pool table in the back.  \n\nPeople who work there are actually Irish, with awesome accents.  \n\nThere's a good but hard Pub Quiz on Weds nights, that's run without any nonsense of a music round.  \n\nOnly missing the fifth star because I doubt I would travel far to go here, although I'm grateful it is near me.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "I really like this bar. The bartenders are pretty friendly, and the food here is pretty good. There are tables in the back if you want to get drinks and food, and sit where it's a little easier to talk. But damn! The karaoke here is pretty off top. And especially awkward. \n\nI love karaoke bars, especially ones that blast the music to cover up the bad singing- and all the singers don't give a fuck. Karaoke isn't about impressing people to me. That's why I like this place. \n\nCheap beer, bad karaoke, good people...all for a great night!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "Pub Quiz!\n\nGood service and all the bar staff are Irish ladies with accents. How awesome is that!?!?!?", "author": "Skye W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Great place to relax or watch a game and have a beer with friends. I don't know why, but I was really surprised to find so many Irish people in an Irish bar. The staff and most of the patrons were from the emerald isle or the nearby UK. The Irish curry there was exactly as delicious as it was when I had during my months in Ireland, and the vibe in the bar was relaxed and friendly. So much so that the people sitting next to us got the wrong kind of salad and instead of sending it back, they gave it to us, then we bonded over triathalon's and tough mudder, small world. I did have a little giggle at watching some openly gay Irish men playing pool and grabbing eachother's bums, as during my time in Ireland I learned that most guys are so \"manly\" that they deny even having gay friends, their loss! Had a great night, will go back next time I'm in the mission area.", "author": "Courtney L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "Irish pub, straight up.  Good and solid.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-09", "description": "Nappies! I've been here numerous times and have yet to be let down. I've watched the olympics, an amazing performance of Gangsta's Paradise, and lurve talking to the bouncer with the dreamy accent.\n\nGo buy drinks here, sing a few songs, and have a fun time!", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "We stopped here to waste some time before heading to the airport cause we had a late flight. It's an Irish bar with Irish food and Irish bartenders. We didn't try the food but this Asian family was trying everything on the menu and it all looked good. It's a  pretty cool bar, has a pool table, LCD tv's, and the bathroom was one of if not these cleanest I've ever seen in a bar. We went during happy hour and were told that the Blue moon and Pilsner beers were $3 which is really cheap. When we got the bill they were actually $4 not $3 but who cares cause that's still cheap. Sucks for the bartender though cause she would have gotten a bigger tip. Since we only had 3 beers we thought $9 would be the total and was gonna give $15 which would have been a $6 tip but instead she got a $3 tip.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "A great place to sip your pint and watch whatever ball game happens to be on at the moment, though my eyes are always on the soccer.  Friendly bartenders and good pub grub too.  There are a variety of meatless options on their extensive menu, and the kitchen is nice about letting you sub a veggie patty on one of their regular burgers.  Much appreciated!", "author": "Heidi D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-09", "description": "WHY WHY DO ALL THE DOUCHEBAGS CONGREGATE HERE??? \n\njust wanted to enjoy some monday nigh football, but unfortunately, i was cringing too much to pay attention. \n\nobnoxious shouting and mission hipster kids who are apparently in some competition to see who can be more pretentious. ugh. \n\ndidn't really have anything there except for a beer. the waiter was nice, but nothing special. two stars just because the service was decent.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "From the perspective of a weekend daytime patron I can honestly say it's a great little bar.  \nLocal patrons, unassuming crowd, many Irish.  Straight/gay/older/younger/whatever.  The food always hits the spot (I like the \"full Irish\"), and Lorna, the always luvverly n'fun Scottish bartender, pours very wonderful Bloody Mary's and trades wit and repartee with the locals.\nTV usually a mix of Euro soccer and US sports.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Great hangout in general but sometimes the kid-friendliness of it gets to me. I think it's great there are little ones in there, and it reminds me of England a lot but sometimes I just want to chill with my pint with just the sounds of a TV and the drunk next to me. Appetizers could offer some non-fried foods that might hint at healthiness but overall, I like the pub.", "author": "Dan-o T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-25", "description": "I've been here many, many times and I have to say that it is hit and miss.  Particularly, there is one bartender that is such a damn grouch every time you ask for a drink.  Unless your Irish of course, and then she will make it rain with booze (I've seen it).\n\nBut one bad apple can't spoil the bunch.  The rest of the staff is great and always up to converse with you.  The drinks are priced fair and the food is great for being pub grub.  Their cheddar bacon fries are AWESOME, especially when you have a hungry group.\n\nGive it a shot as it is still a fun place!", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "I've been walking by this place for years.  After seeing they remodeled and Groupon got me in the door. I brought the family in for dinner.  We sampled the fried calamari and fish taco appetizers.  The calamari with aioli was decent but the fish tacos were very good.  We also tried, Fish & Chips (with malt vinegar of course!), Shepherds pie, Bangers and Mash and the Guinness Beef stew.  All dishes were very solid pub grub; homey, with larger portions -- perfect for a cool night.  The beef stew was very flavorful.  Dessert choices were a variety of pies and cheesecake.  The wait staff very friendly and busy.  They covered both the bar and the dining areas.  It wasn't full but it was only 6pm on a Wednesday.  The Sugar Bowl was on several large screen TV.", "author": "Shane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "Great foood, good servive.  Will be back try the Pastami.", "author": "George M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "A great set of taps fairly deep in the mission.  I've spent almost every monday night over the past couple years there with my co-ed soccer team after our games.  Lorna, runs the bar, and keeps the pints coming, while the kitchen serves up some solid Irish pub food as well.  The jukebox is always usually rolling through some random concoction of early 90's rap, indie rock, and some random electronic music every now and then.  \n\nAll in all everything I look for in a place to dive in and have a beer with a group of friends without any presumptions.  great place, I'll be going there as long as I'm around SF, thats for sure.  Not sure who was there when Sammy ( below ) was there.  The bartenders are nice when ya get to know em, but definitely won't take any shit.  Which in my experience is a pretty typical relationship with anyone Irish.  ;)", "author": "Justin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "This my home away from home. Its kind of locals only spot thats why it rules hella hard.", "author": "Ali E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "Had my first date with my beau here. An awesome Irish bar. Spent St. Patrick's here recently. Great Fish & Chips. Great Caesar too. And Smithwick's. Pretty large inside.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-13", "description": "Went here for Trivia Night on Wednesday. Fun stuff.\nWe had a larger party and I was sad to see they did not have tables to accommodate us all. We had to split into two teams. :(\nThe beers were good...and cheap.\nWe didn't eat but the food smelled AMAZING. Standard pub fare...", "author": "Maureen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "If you're looking for a friendly, casual, neighborhood feeling bar, this is a good pick.  The drinks are reasonable, the food is good, the bar staff is friendly.  It's the kind of place that you may go to watch the game or just meet up with friends.  I love neighborhood bars like this.  If this was my neighborhood, I would hang out here.", "author": "Caitlin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "I never had a very good impression of this place because it's so over decorated on the outside. Maybe it's an OCD thing but looking at this place makes me jumpy. For that reason, and the abundance of bars I already know I like in the area, I've avoided this place.  Recently someone raved about the food so on my way home from getting my hair spiked I stepped in.\n\nThis is kind of a weird place. It's a smallish room with a giant bar in the middle and some tables and chairs crammed around it. If they had a smaller bar against the wall they could probably double the room for customers.\n\nI ordered the full Irish breakfast for $12. For that kind of money I expected a big meal. They did their best to spread it all around the plate to make it look like more than it was but  it wasn't a very good value for the money.\n\nI do like to people watch, the characters in this place tickled my inner Bukowski. Three stars for that alone!", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "Came here to watch a Lakers playoff game but I promise this review wont be biased because I was upset at how poorly the Lakers played, thus left me leaving the bar unsatisfied. \n\nThe place itself is small, but had lots of room at the bar and a ton of LCD TVs with various games on (baseball, basketball, soccer). Ordered two beers ($4.50 each I think). Food-wise got a basket of garlic parmesan fries. I know its bar food, but this was not the one! Fries sprinkled with a bit of garlic and shredded parm (which never got soft or melted) is not the way. Can they at least add some salt to it or something?! Also got the chicken fingers, which were actually pretty good. It wasn't breaded heavily and the chicken was crispy yet juicy..good job fryer! Finished off the Lakers loss with the Royal Burger, which I loved. Beef patty was juicy, and the fried sunny-side up egg topped it of perfectly (who doesn't love gooey egg yolk running down the burger and one's fingers whist eating?.. anyone?? well i do because eggs are amazing, especially on burgers. \n\nFriendly staff, friendly patrons, bonus stars for witnessing someone so drunk that he fell into the daily specials sign knocking both himself and the sign onto the floor while his friends pointed and laughed. Poor guy.", "author": "Pornsakdi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Stopped in here when I got in town on a Saturday and had to watch a UF football game. It wasn't incredibly crowded, but they were nice enough to turn the game on for me even though probably no one with the exception of one other person particularly wanted to watch it. Good (but not vast) beer selection, and nice neighborhood place. Not a lot of sports bars in the mission so this is a friendly and convenient spot.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-05", "description": "First, this place is a Dive.  I mean that in the best sense of the word.\n\nHusband and I have only been here for breakfast.  The food is diner style and quite a good value.  Their prices are more than fair, the bloody mary's good and the service friendly and efficient.  \n\nWe've not yet tried to cure a hangover here but I'm sure it's an outstanding place for hair of the dog.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "This place is pretty awesome.\nI LOVE the trivia nights on Wednesday.\nI LOVE their giant book of girly shots/drinks.\nI LOVE the fact that you can eat and play pool in the same room.\nHowever, I don't like their breakfast menu!  It's very limited and the eggs benedict just tasted funny.  I'm not sure what it was, but it wasn't very tasty.\nHowever, I have tried their specials, the shepherds pie, the fish and chips, and everything else is pretty spot on.\nThis place is mostly a good place to pre-party before you head off to other bars.", "author": "Meh M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-30", "description": "I mean where else can you get a good- nasty snarl from a real Irish bartender? Not just an authentic one, but kind of in a arrggg pirate \"walk the plank\" or I'll knife you...yeah nothin' says true warmth and welcome like a ship-wrecker. Well honestly that's why I'm moving out of this neighborhood: no decent bars and the crime among other things. Now that I'll be far away, I can finally write this review without the fear of being captured and beaten by the motley crew that frequents here. \n\nEverytime I've needed another drink I've literally had to do the YMCA to get the attention of a certain *cough* bartender who seems to be suffering a bad case of scurvy on the regular. The real gem though is the look of utter disdain when you get your very small and over-priced drink. \n\nNow I've given it 2 stars, so let's look on the up-side. There is a pool table, they serve real food (not that I've tried it) and the back wooden booths can actually be nice for a decent conversation with a friend or a date. In my (old) hood this was as good as it got within my radius...AND I do like an Irish accent.", "author": "NaNa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "Didn't spend too much time at this pub, but it had a great feel inside; warm and friendly. The people there are your average joe, no shows or meat markets here. Grab some good cheap drinks, catch up with old friends, and let the good times roll.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "I'm writing a review because this bar is underrated. The bartender tonight, (Sunday), was Emma. Emma was terrific and nice. I walked up to the bar and she got me a drink immediately. This happened four or five times. She was friendly and welcoming. The drinks were inexpensive. They have drinks that are 4.75 and such, but so does Clooney's, so similar pricing structure. I like to just leave the quarters with the tip. But, the point is, they have a good on-tap selection, the bartender is friendly, they have space, and there was nobody that was too rough for the go. Napper Tandy is like a nice, middle-working class bar without hipsters or people that are actually dangerous when they're drunk. I liked it here. They treated me well and they gave me good drinks.", "author": "Sergi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "I lived by this place for a few years after it opened and never went in. Boy was I missing out on good breakfasts!!! Went for the first time a couple weeks ago on a Friday night and had a good time playing pool, drinking, and meeting new friends.\nI had such a good time, I accidentally left my hat. I ended up calling them after 2am and thankfully, they found it. I went in hungover the next morning to pick it up and stayed for some corned beef hash and eggs. IT WAS DELICIOUS!!! I am definitely going back for breakfast if I'm in that neck of the woods again.", "author": "N. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "Very delicious. Their guinness stew was one of the best I've had, and my friend's pesto chicken sandwich was very juicy and delicious. The server was very friendly as well. This restaurant also regularly puts out discounts on restaurant.com and livingsocial, so its worth checking out for awesome eats.", "author": "Angela V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-23", "description": "Satisfactory location to watch soccer matches.\n\nPlus: Had US v Algeria and England v Slovenia showing on adjacent televisions. Small thing, but tells me they know what they're doing.\n\nPlus: Standing room only for US v Algeria this morning.\nMinus: Quiet crowd. I'm a big introvert, and when I'm the one initiating clapping or cheering, that tells me something about the other people watching.\n\nPlus: Have a real Irish breakfast. Surprisingly hard to find. I love me that perfect fork-full of sausage, baked beans, black pudding, egg yolk, and fried tomato\nMinus: I think I was the only one who ordered it. Other people ordering eggs florentine--I'm sure it was good, but really? in an Irish pub?\n\nPlus: Nice people, friendly pub.\n\nTake-home: Quite a fine place for a drink and pub meal. Not sure that this will be my go-to pub for future soccer matches.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "+2 stars for beers just the way I like 'em - lager of some kind w/ lime - thanks gals.\n\n+2 stars for fun trivia night wackiness.  A total treat.\n\nAlso: it's Boston-y!", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-09", "description": "Oh the Napper :-)\n\nBeen here TONS of times and have had a blast every single time. Some good friends of mine live close so it used to be our after work spot, we quickly became good friends with the staff (celebrated New Years Eve with them) and then the Napper became a regular spot for my boyfriend and I to watch Sunday football. \n\nThe foods good, the service is friendly. All around great place.", "author": "Elise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "Alright so most of my socialization last year was going out after work to bars (or during lunch).  This place happened a few times because it was close enough to where we worked (Excelsior/Outer Mission) and it is tasty!\n\nThis place has great food for decent prices as well as great drink specials all the time.  It's been crazy busy a few times, and a few others it's been dead, so it's really about if you love the crowd or not.\n\nIndoor and outdoor seating a plus, small bathroom a minus.\n\nAlso I know a bartendress there.  She rocks!  But there is another female bartender/server that is just rude.  She has an Irish accent I believe.  I don't know why she is always just rude or seemingly hates her job.", "author": "Xhris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "I've only been here for trivia night and it's always tons of fun (even if we don't win).  Anyone interested in joining the team? :) The food isn't great, but I will say that their wings are pretty decent, though you basically need to inhale them for them to be good.  Once they've been sitting around for 3 minutes or so, they lose their magic, so be warned.  There's a petite bartender there I really like because she rocked when she had to kick out a drunk 6-foot+ man out of the bar for smoking inside.  Tip her well.  I think her name is Sherry (?).", "author": "Terri M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-03", "description": "The food is decent enough pub grub, but the service is atrocious. The TVs are small and too high to watch them.\n\nEverything takes forever: ordering drinks, getting them, getting menus, ordering food, getting the food, etc. Unbelievably, after the waitress dropped off our food, she just split for the evening! None of the other staff followed up, and after sitting there for the 30 minutes it took us to figure that out, we had to go to the bar to fetch and pay our bill. Ridiculous.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-13", "description": "This is a small Irish bar with no happy hour, mediocre service, and INCREDIBLY DELICIOUS FRENCH FRIES, predominately patronized by Mexicans and assorted Mission sketchballs.\n\nAnd a pair of friends: one respectable-looking dude with a laptop case in business attire (that would be my buddy Don), and his tired, dirty, just-moved-in-and-can't-find-any-clean-clothes-and-hungover-from-Latin-American-Club-Margaritas companion (that would be me).\n\nSeriously, this place is not big. There's a room with billiards adjoining the bar itself, but it feels like a separate bar altogether. And the waitresses will NOT be very interested in you. Or, at least they weren't interested in us. And we're interesting, damnit! They were more interested in practicing their Irish-Spanish with the dudes on the other side of the bar. \n\nHowever, I believe this DID lead to either an intentional or unintentional deduction of one beer off our tab. So that's a big plus. I hate small talk anyway.\n\nAnd they did, however, bring me the aforementioned MOST DELICIOUS FRENCH FRIES ON THIS EARTH. Did I mention I was hungover from the Latin? \n\nOh, you've never had a margarita at the Latin?\n\nI HAD TWO. GO ATTEMPT THAT FEAT AND SEE IF YOU EVER OPEN YOUR EYES AGAIN.\n\nSo yeah, I ordered me some french fries. And holy crap, they are GOOD.\n\nSo all that said, I'll probably be back. Don and I will be resurrecting our after-work drinks, now that we're neighbors, and this will be a good, quiet spot, where we can be more or less ignored by the staff, entertained by sketchballs, and cure any shameful weekday hangovers with delicious assorted friend items for dipping.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-05", "description": "Well, I don't know if this is as good as it gets, but damn it does come close.\n\nThe service is spot on. Lisa and Amanda (the only ones I've met) are always smiling, friendly, and do they have a sharp memory!\n\nHappy hour is awesome. I forget when it starts (I think 3pm) til 7pm.  \nEvery day there's a different theme to the day:\n\nMonday\nAll you can eat Fish n Chips\n$3 Heineken and Amstel\n \nTuesday\n1/2 price wine and champagne  \n\nWednesday\nBrainstormer Pub Quiz  \n\nThursday\nOpen Mic - Yeah, scarey.\n\nFriday\nAfter Work Happy Hour!  \n\nSaturday\nBreakfast\nKaraoke Night  \n\nSunday\nBreakfast\nJazz @ 12:30  \n\nThe prices low and portions are never EVER short changed.  Did I say their food is decent?  Also, that Lisa and Amanda are AWESOME!!!\n\nThe clientele is mature.  I've never felt uncomfortable in this place... unlike the bar down the street... but that's another review.\n\nI'm telling you this is the west coast version of \"Cheers\".", "author": "Herman P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-24", "description": "You know it's going to be a rough night when you have to have a shot BEFORE you go to the bar.\n\nSuch was the case yesterday when my Manders & I popped into The Napper Tandy before hitting DYL.\n\nDespite this establishment being mere blocks from my abode, I'd never been there before last evening...\n\nNow I know why:\n\n$12 for two lemondrop shots, which took the bartender 10 minutes to make...\n\nShe had to call in help from a more experienced bartender.\n\nNot good.\n\nHint to bars: don't schedule new bartenders who don't know what the fuck they're doing for a Friday night at Happy Hour time.\n\nPoor choice, Napper Tandy - doubt I'll be back.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "I went to the Napper Tandy to meet a crew of new friends on a Wednesday night.  It is definitely a neighborhood bar with some interesting character.  It's got a laid-back crowd, with cheap drinks.  I'd recommend coming here just to see what you might see...\n\nFirst, it was quiz night.  There was a lady with a thick accent announcing borderline unintelligible questions/answers out of the PA that reached all of this very small bar.  Second, there's this odd thing about people bringing in donuts from the late-night donut shop from across the street.  Third, there's this random cool little dog running around the bar like he owns the place.   Fourth, I had heard a story here about some guy \"shirt-cocking\" out of the bar during the day - he dropped his pants and walked out and about, with nothing but a shirt on over his junk.  And to make matters more strange, this dude was part of the group I was hanging out with.  \n\nYes, it's a strange would we live in, and the Mission seems to own the lion's share of this strangeness.  And if you would like to witness this while having a drink, come to Napper Tandy.", "author": "Leo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "5 Stars for the Onion Rings...seriously the best I have EVER had. The guy sitting next to us ordered a \"side\" (full plate portion) of Onion Rings..when they emerged from the kitchen the entire bar was drooling. They are the size of donuts and are pure perfection!!\n\nThe bar itself seems pretty chill...but the ONION RINGS!!!! Seriously I think I dreamt about them last night...", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-28", "description": "\"Snapper Tranny?, Natty tapper?, Clap or Candy?\" huh?\n\nI walked down 24th and saw a sign dawning \"The Napper Tandy\" moniker and the above cell phone conversation made sense.\n\nI met up with a friend here; upon arrival I was slapped in the face with what seemed to be the smell of 100 year old puke  (however, I'm a serious fan of dive bars so, I was not deterred).\n\nThis place has a lot going for it but, here I will use my trusty bullet points to sum up the pros and cons:\n\nPros:\n~Real honest to gosh Irish accents in the Mission\n~Irish-Mex...livin' in harmony dynamic\n~Newcastle on tap...niiice\n~Dinner at the bar (i'm turning into my G-Pa)\n~Nice pub feel\n\nCons:\n~Afore mentioned puke smell\n~Chicken in the Chicken curry is just weird\n~Dumb-Ass name\n\n3 pros + 3 cons= 3 stars\nnice math", "author": "R M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-24", "description": "This is a weird place to do karakoe. They have a big comfortable room in back that would be perfect, but there's a pool table in it. I'm sorry, but I don't give a feck for pool. When I was a kid I was shite at sports, but I was pretty good at playing Galaga and Rolling Thunder at the 7-Eleven. Now I'm a Karaoke Matador who sucks at pool.\r\n\r\nAnyhow, bar-wise this is just a place. If Glenny (the full-contact KJ of Amnesia and Lingba) didn't do karaoke here, I likely wouldn't be reviewing it at all, as essentially it's The Phoenix or Liberties, only in a grubbier location. Same Faux Oirishness, same beerses, same-ish greazy pub grub.\r\n\r\nBut back to karaoke. Because it's off the beaten track I got to sing like 5 songs last night. Awesome. One Mic Whore, present and accounted for. But why did that nice girl sing Good Charlotte last night? How did that seem like a good idea? Lifestyles Of The Crappiest Music.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-29", "description": "I have to knock a couple of stars because I live nearby. Normally this would be a plus except that sometimes on weekdays I would hear a guy singing one of those depressing-  I just got dumped songs over and over and over again. This really sucks when you have to wake up at 4:30 in the fucking morning to open up a coffee shop. Thankfully that was ages ago and I don't need to worry about that anymore, but it was such a pain in the ass to only squeeze in 2 hours of sleep on a weekday, you know.\n \nDecent cocktails, better than average beer selection, and the burgers and some of the specials are good too. Fun place to play pool, as for brunch I have yet to go but seems like it's worth checking out. Owners are super friendly, they always say hi or smile when I pass by. Overall nice neighborhood spot.", "author": "X marks the spot .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "This is a great Irish pub.  I come here primarily for the Wednesday trivia night, but I would stop by for a drink another time.  The waitresses are all really friendly and accommodating.  They always have some great drink specials so be sure to ask!  One thing, I wish the trivia went a little faster because sometimes it goes until almost midnight which is much longer than most other trivia places.", "author": "Marin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-14", "description": "I wanted to like this place since I live in the neighborhood. They pour a good Guinness and I thought the bartender was nice. I went with a friend to have fish and chips, but that soon changed. \nWe saw a employee who was cooking the food use the bathroom and not wash their hands. YUK!\n\nI cook for a living, and not washing your hands after using the bathroom is a no no. Look everyone has a busy life but it only takes 1 minute to wash up. \nSorry Napper Tandy. I still might go for a beer but not the food.", "author": "krispy k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-21", "description": "After driving around for a long time.. Decided to stop here... Homestyle apple bees as my buddy calls it. I'm starving and.. Its been 30 mins.. NO FOOD.. Really it takes that long to fried 3 piece of chicken tenders!!! Overall, I do not miss this place one bit, unless they hire more folks, and stop working the poor waitress all by herself serving a crowd of 30+, front and back room!", "author": "Monika T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-29", "description": "33% Irish Pub, 33% Sports Bar, 33% Mission Dive, 100% good times. I watch football here on Sundays and the staff could not be any more accomodating or charming (especially when you have the sunday morning hangover blues). It's family owned and operated with tons of regulars (mostly young ex-pat Irish fellas in tow with their adoring groupies. Old school blue collar mission blokes too).\n\nGlen, the dude who runs karaoke on saturday nights is the most fun energetic motherf*&^ker on the planet. Plus, he's got a cowbell. I really need to get one of those.", "author": "John T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-01", "description": "I went here for 3 world cup games. The first two experiences were great --after today I will never go back, especially since there are tons of other great places to watch matches. Outside they posted $20 minimum for a table--fair enough. What was not clear was that they expected everyone to buy $20 of drinks (but did not enforce it with tickets etc) even if you were standing watching the game. We had a few drinks yet were continually rudely being told we had to buy more and more--they might as well have come to us every three minutes and told us to give them more money like beggars--it completely ruined the experience for me. So I left and watched the rest of the game elsewhere where I continued to get more drinks that this time were not being thrust down my throat.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "Went there 8-6-11 about 8pm'ish with kendo on karaoke.  I met some regulars last saturday, they're cool and I spoke with them.  Definitely enjoy myself belting out my tunes:  1) just the way you are by billy joel, 2) honesty by billy joel, 3) let's groove: earth wind+fire(this one regular joined me in this song), + 4)for the longest time: billy joel.  I'm glad folks actually enjoy listening to me sing along wih others.  I had a mgd($3, it's cheap, but didn't really enjoy the flavor)---followed by fat tire,new castle+hefewezein beers. This bar allows dogs into the establishment, which one patron brought in", "author": "Jer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-17", "description": "Meh, this place is alright. I've only been here twice, both times because my buddy Tom lives a couple blocks away from it. \nThe beer selection's pretty thin, but the barstaff are cool, and will make you all sorts of weird drinks if you ask, like the Orange Tic-Tac, which I think contains orange liqueur of some kind plus vodka and Red Bull. It sure tasted like a orange Tic-Tac, but made me feel sorta queasy afterwards, like Red Bull usually does. \nThey also have a pool table hidden in the back room, but I have never played on it.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-07", "description": "Went into the Napper Tandy for the first time last night.   Walking in, it's your typical Mission dive bar.  I like dive bars, so I thought I'd really enjoy this place, and it's close to my house.  Not so much.  It's not the place, or the energy, or the specials (which are great by the way!  Monday night all you can eat fish & chips / and $9 pitchers of Bud Light), no it's none of those things....it's the staff.  \n\nIt could have just been an off night, but both the chicks behind the bar had sour looks on their faces and wouldn't even bother to serve me - preferring instead to wait on every guy at the bar and not even looking in my direction.  I understand that men generally tip female bar staff better, but maybe it's because you ignore your female patrons.  Ever thought of that, geniuses?  \n\nIt wasn't until my boyfriend went up to the bar that they paid attention.  Again, the only reason to go here is the specials, and while the fish and chips were good, and they had sports on all the tv's, the attitudes of the bar staff are really not worth enduring - oh, and don't go in without a guy - lest you die of dehydration before getting a drink.", "author": "Alison L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-06", "description": "You know how everyone feels the need to rep where they're from?  Are you East Coast like P Diddy or West Coast like Snoop Dogg?  East Bay holdin' it down, or livin' large on the Peninsula?\n\nWell Lil MC Mar here layin it down 4 realz.  i been all up in the Napper Tandy 'hood for days and i ain't playin when i tell u s'alright.  Fo sho they gots the full bar, TVs, pool... but ain't that special.\n\n4 hella days i got the feelin that i gots 2 get Tandy's back just cuz we in the same hood and all.  My homies swear by it, but i really think they just talk it up cuz its real close, ya heard?  But ya know i tell u what Yelp done been more family 2 me than the Tandy ever been and i gots to 2 b true 2 my real relations, fo sho.  Tandy ain't bad, i been there sumtimes, but it ain't no big deal.\n\nMaybe on a quieter night I'll enjoy a small gin and tonic with a squeeze of cranberry with my associates, however I wouldn't recommend it to an out-of-towner.  Period.", "author": "Mari C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "fun fun fun! wed. trivia night is a blast- bring a well rounded team and you'll have a great time.\n\ni didn't love my food, but it was good enough and the drinks were brought to us by a friendly and attentive waitress. even when we were picky, she was nice.\n\ni probably wouldn't go here for a mean but i'll definitely be back for trivia night and vodka tonics.", "author": "Nikki C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "Great ambience. Very cool bartender. Fish and Chips were awesome. Wish I had tried the bangers and mash or the shepherd's pie. Nice little spot. And they pour Guinness the proper way.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-02", "description": "Despite the recommendation from my friend that Phonebooth was the trendier choice (where, he noted, he saw Drew Barrymore the week before), we made our way north to Napper Tandy.  \n\nSurveying it from the entrance, I liked the layout of the place -- a large central bar surrounded on all sides by seating, with a cluster of high tables flanking the window to the right of the entrance.  At the back, there appeared a small gnomish opening--the type you might use to enter John Malkovich's head--which led to a secret back room containing billiards and more seating.\n\nIt was about a half hour before the last BART on a saturday when we happened on this place, and it was only about half full.  I don't know if this is an aberration, but its just the way I like it.  Enough room to sit down and relax, but not empty enough to hear crickets.\n\nWhile the selection of beers on tap wasn't phenomenal, you really only need one to get you though any particular night. \n\nThis is definitely the place to go with friends from out of town who you'd like to converse with, since you can actually hear yourself think (careful, that inner voice might be John Cusack in there...)", "author": "LJ W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "I really dig this place.  It's really cozy and the bar ends up taking up most of the room.  I like how there's a lot of tables in the back as well so it's good to chill with a group of people.  A few years back they had karaoke there and it was awesome.", "author": "Mitch A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "Napper Tandy contacted me regarding the misunderstanding with the Sweetjacks deal.  They let me know they had a $25 voucher for food with my name on it.  Last night my sister and I went to have fish n' chips and sure enough there was an envelope under the counter with my name on it!  The fish n' chips were very good.  Definitely going back to try out breakfast and other items on the menu.", "author": "Etta L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-22", "description": "Back in 85 my neighbors had a Tandy PC and it was off the hook. I completely destroyed everyone at the surfing competition in California Games.\n\nI don't think they made Tapper for the Tandy PC though, which is unfortunate because Tapper is an occasionally accurate representation of The Napper Tandy, broken glasses and bar fights and all. (It's really pretty chill most of the time. I just couldn' t tie the Tapper reference up any other way.)\n\nThere's food too. The fish & chips are about as greasily tasty as deep fried fish and potatoes are supposed to be, and I imagine the fish tacos are decent too since they appear to be the same pieces of battered fish on tortillas instead of french fries. Portions are generous and reasonably priced, and the service is friendly.\n\nThe bathroom line at the Napper Tandy is one of the few places in the world where you can overhear a drunk Englishman and a drunk Mexican man debate the relative merits of Manchester United and Chivas USA.\n\nIt turns out that it's actually named after James Napper Tandy, a 19th century irish politician and activist rather than the Radio Shack PCs from the 80s. Tapper was still pretty awesome anyway.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-08", "description": "ever seen a 5 foot tall woman bartender kick a one legged man out of the bar for being a complete d*ck? i have, and it was awesome.\n\nthe food looked great, but i was too late to get any myself. i'll be back.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "I am starting to dig this place! The first time I came here was for Karaoke night and it was a big surprise to all of us that showed up, and we had a blast! Very cheap well-drinks & beer.  Get there early to enjoy their happy hour menu & hang out with friends.  The bartenders are very friendly and have irish accents!!! I love this place especially their fish & chips (you need to check them out).  And if there's Magners that makes me a happy camper :)", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-24", "description": "Sure, it looks kinda lame on the outside but trust me, its much cooler once you're through the doors.  I recently made the Napper Tandy the last stop on my birthday bar crawl on 24th Street.  I had my doubts (i.e. I thought it might be a lame Irish pub with a bunch of dudes wearing button-down shirts and eating bad nachos) but I included it on my crawl because it has karaoke and I figured it'd be a fun way to end the night.\n\nIn our case, fun was an understatement.\n\nThe karaoke is totally low-key, unassuming and generally awesome (no stage, small space).  The crowd immediately accepted my gang of drunk newbies and tons of compliments were exchanged after each performer.  I rarely do karaoke because I know I'm a lousy singer and I don't want to embarrass myself, but I felt comfortable enough to sing here and I'm pretty sure the crowd enjoyed my rendition of \"Total Eclipse of the Heart\" (it's a pretty fabulous song, no?).  I told the karaoke DJ it was my birthday to ensure I'd get a shot to sing-- not only did I get my chance but the whole bar sang \"Happy Birthday\" to me afterwards.  It was a blast!\n\nGreat song selection and the peeps who were there had super good taste in songs-- almost every choice was a winner (and by winner, I mean the whole bar sang along and cheered).\n\nI'm relatively new to the city and I fully intend on becoming a regular at the Napper Tandy.  Come check it out-- we'll do a duet!", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "Its Monday night post a brutal soccer match. You're sweaty, you're hungry, and all you really want is Guinness.  Welcome to the Napper Tandy.   Cheap Bar food, great drinks, and a nice little jukebox.\n\nAnd the best part?  Lorina.   She pours a perfect guinness, she's fast, attentive, and doesn't screw up orders.   And right when you take that last sip, she is there asking you if you want another.  Yea, she pretty much rules.  \n\nThe Napper isn't fancy, it isn't snooty, but its perfect.   And 5 Guinness's later I oft wonder how I managed to get toasty, once again, on a Monday Night.   I'll thank Lorina for that one!", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "I was a Phone Booth devotee until I discovered the Napper Tandy, now my half of my heart (and liver) belongs to the Nappers. \n\nBartenders are super friendly (Bill and Lisa are my favorites), drinks are good (Grey Goose Sea Breeze), fantastic jukebox and the crowd is super nice. I don't do pub quiz or karaoke, I visit the bar to drink and hang out, but it is nice to know I have options!", "author": "Anabelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-24", "description": "I stumbled into Napper Tandy at 9:30 a.m. one September Sunday morning, looking to watch some NFL in the Mission. I haven't missed a Sunday since.\n\nI really like the location of the Napper Tandy. It's located one block from the 24th St. BART station, and only about 7 or 8 blocks from where I live, so it's a nice walk.\n\nThe restaurant and pub are owned by Marissa, who is from Ireland. Her sister Danielle reached out to me the first time I went there, and now she is one of the reasons I go every Sunday.\n\nNot only are their drinks good, but they have amazing food. Guilded bangers and mash anyone?\n\nI am pretty new to Yelp, so I am not sure how these reviews go, but I would recommend Napper Tandy to anyone who wants to just relax on a weekend, watch some football, shoot some pool, and eat some bangin food.\n\nMy friends and I even started an Irish breakfast club in the back room.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-15", "description": "I was originally going to give the Napper 2 stars, but I thought I would go with the flow. \n\nLet me begin by saying that the 2 stars is no reflection on the Napper itself but on the area its in. I know, I know you hipsters are probably writing me off right now, but you can all go to hell. I lived at the corner of 24th and shotwell for over a year, so I am not some uniformed yuppy who cant handle a little flavor. \n\nThe Napper was a block away from my house at the time and my roomates and I drank here often. It was the perfect place to chill and do some serious drinking during the week, with a mixed bar crowd. \n\nI basically just got tired of the crappy walk back home.", "author": "Tom V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-29", "description": "Cool bar- definitely a neighboorhood spot. I could tell it was almost 99% regulars in the place. NO idea they had food here, as couple guys actually brought in a couple burritos.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-05", "description": "Im still laughing about one of the reviews of this place..  the fact that they had to pay for the food, very funny... I haven't explored the menu, i just saw a sign on the wall saying all you can eat.. the thing is, maybe i'm a sucker for fish and chips.. but i liked em... maybe it was because on Monday nights (the only time i have eaten there, drank there many times) its all you can eat for 10 bucks...\n\nReally nice staff, crazy weird customers, that tend to sway back n forth from here and Treat street.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-12", "description": "The best way I can describe the Napper Tandy is that it's a Lower East Side Manhattan hipster karaoke pub crammed into San Francisco's Mission District.\n\nOkay, admittedly that has a lot to do with the fact that you're literally ALWAYS in somebody's way when you're at the Napper Tandy. If someone wants to get to the bathroom, the whole place has to reshuffle. If someone wants to order a drink, the whole place has to shift & grind to accommodate. Basically, it's a place meant for regulars & small crowds.\n\nStill, despite the intense crowdedness, the karaoke was FUN & the crowd was having a blast.\n\nOh yeah, & minus one more star for high drink prices. Seriously, three shots of Wild Turkey & a vodka tonic for $22 at a dive bar?! Gimme a break.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-21", "description": "The Napper Tandy, the Napper Tandy, the Napper Tandy...\n\nI heard of this place a few times on some yelp threads and I keep thinking to myself \"I heard of this place before\"\n\nI finally search for it and I'm like \"I BEEN HERE!!!  I FINALLY HAVE A PLACE TO FUCKIN REVIEW\"\n\nAnd here it is:\n\nIt's a nice place in the Mission district, with a very nice atmosphere, nicely priced alcohol, and lots of seating.\n\nThe bartender that I had was very efficient, and got my order perfectly correct even though I made a few mistakes while ordering like 5 drinks...\n\nIt has a nice vibe to it and I enjoyed the few hours I was there with some co-workers.\n\nEnjoy!!", "author": "Mike V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-03", "description": "I recently visited The Napper Tandy during a SF DYL.  I enjoyed the excellent table service from our hard working waitress.  The mojitos were delicious, as were the bacon cheddar cheese fries.  I must complain about the layout of the bar and its many enclaves.  Furniture could be placed better.  Our Yelp swarm overwhelmed the sporty room in the back, further complicating the already small area.  I left without saying goodbye because I just felt trapped.", "author": "Camille K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-28", "description": "My Home away from home. I frequently stop in here after work. sometimes I'll bring work into the back room, you know a satellite office. I wish there was a 4.5 because it's not the best bar in the planet. But it's accessible, easy to find, and serves alcohol -- don't get no better than that!\n\nYou will find me here 4-5 days a week, enjoying the SF life.\n\nEDIT: I spent last night drinking at the Tandy, and was allowed to commander the back room to watch 24. No. Seriously. I was allowed to watch 24, whiskey and pool stick in hand. It was awesome. 4.5 stars no more, this place deserves all 5. Yelp will have to go to 6 stars if they start serving Jack Bauer Shots (50/50 mix of gasoline and whiskey). Awesome.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-15", "description": "Three stars for the Napper Tandy itself.  But this place has Pub Quiz (Wednesday nights) and Pub Quiz means an automatic extra star.  While my team has yet to win a Pub Quiz, it's a great (and cheap) form of entertainment, especially if you're a bunch of Caltech grads who think they know everything but always get boned by the dreaded Sports Round.\n\nHaven't been for Karaoke, but given the jukebox selection, it doesn't surprise me that hilarity would ensue.\n\nAlso, props for having an island bar (well, ok, a peninsula bar).", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-25", "description": "I feel like a stranger in a strange land when I go here, but I keep coming back. Very pleasant and somewhat matronly bartenders with accents, but my hot tottie was infested with roughly 50 whole cloves. The food is blah, but sometimes you want blah. Try the shepherd's pie. Why not? It's easy to feel depressed here. \nWendesday night is trivia night, filled with dweebs, geeks, and weirdos, but I can't come down too hard because my team came in last.  Waiting for rematch.", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-28", "description": "Unfortunately, I wasn't able to review the food or drinks because as soon as my friend and I walked in the bartender was more than rude. She didn't greet us when we came in she just glared at us and didn't even get up off the stool she was sitting on to help us. we were just taking in the seemingly fun atmosphere when, before we sat, the bartender said \" before you two even sit down, I need to see your i.d.s, don't get too comfortable.\" That did it for me, we just walked out and left, that was a Sunday night, maybe someday I will try again but certainly not a Sunday.", "author": "Jamie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "Good location, crowd and atmosphere, mediocre food and great service.  Happy hour specials are solid and Sheri will take very good care of you.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "Outstanding beef stew. Good beer special. Wifi sucks but that's not what I came for.", "author": "t k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "This is the best place to come for football Sunday! Great food, drinks and staff. The bartenders are always so personable and cheerful. We love coming here! They play all the games and have a ton of tv's to view games from. They have raffles with prizes after the morning and afternoon game. We always feel welcomed when we come. Like I said, it's the best place to go on a Sunday. It has the best of everything!", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "Sunday morning and the wait at St. Francis down the street was already ridiculous. Hungry as hell. $20 in my wallet, so Slow Club or Universal Cafe was also out of the price range. \n\nPayday not for another week. \n\nWhere do I go?  The fucking Napper Tandy, that's where. Before 12pm on Sundays, you can get a variety of awesome breakfasts for $5 (I got eggs, potatoes, bacon, and toast for $5. seriously.), and one of their pretty damn tasty Bloody Marys (which they make with a shot of Guinness here by the way... totally fitting for an Irish pub) for another $5. On top of that, if you order a $5 breakfast, you can add on a Mimosa for just $3 more. I got all of the above.\n\nTotal bill? $13. And I was buzzed too. So good.", "author": "George C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-05", "description": "The service tends to be terrible (dirty dishes and glasses take forever to get cleared), the food is mediocre and overpriced, and every piece of furniture in the place (booths, barstools, tables) is somehow just a little bit uncomfortable.\n\nThe upside is that this is the one place where I have actually won a pub quiz / trivia night.  Not because my teams are good, mind you, but because the braniacs who show up to places like Mad Dog in the Fog and kick my moderately-informed ass week after week have left the Napper Tandy alone.  If you want to get drunk somewhere and still feel smarter when you leave, this place is worth a try.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-25", "description": "I love the Napper Tandy. I discovered it walking home after work from the 22nd St. CalTrain Station. I had just climbed Potrero Hill under the horrible sun and suddenly  I started fantasizing about a sexy big cold Guinness. You know what they say: once you go black... \n\nAnyway, there I was, thinking about this heavenly liquid pouring into my throat from a big glass pint with condensed water droplets around it and, suddenly, I saw it: The Napper Tandy,  with a neon Guinness sign on the facade. \n\nI think that the lovely Irish waiter realized my liquid cravings at first sight, and rapidly asked me: Cold beer sir? My \"yess\" was probably intimidating and obscene.\n\nAnyway, since that day, I cannot resist the temptation of hoping out the 24th bus and getting a Guinness and a snack before going home. And every single time I go I find myself mingling with an Irish crowd (love Irish people) and being very well treated by the Irish sisters behind the bar.\n\nI am spoiled and like to be treated well when I am hungry and thirsty. \n\nI haven't tested it during drinking mode, so the rating is for how perfectly The Napper Tandy works  for me when I want a beer and something to it on my way home. \n\n Long live the Napper.", "author": "Jorge B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Came here last night because my friend was hungry and I was thirsty.  There was a good crowd on Sunday evening, but it wasn't too crowded.  Ordered a mimosa and it was heavy on the champagne AND cheap at $5.  Good mix of music playing.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "Wow! Can't believe I didn't review this place before.\nMy favorite local bar. Wednesday night trivia is pretty sweet (once you get used to Marissa's accent). The bartenders are amazing. Sometimes, the food is a little slow (the kitchen gets backed up when it's crowded). They have typical American food and some Irish dishes (Bangers and Mash, blood sausages, you know).\nThis is a really great place to be! Oh, and they have drink specials every night.", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-29", "description": "Since the demise of my favorite corner bar, the Napper Tandy is rapidly becoming one of my favorite hangouts. The staff is always friendly and  courteous. The customers are friendly, and I've always felt comfortable striking up a conversation with the person next to me. Best of all - they have Boddington's on tap! \n\nI've eaten here several times, and have always enjoyed the food. They have a new menu, which I haven't sampled, but plan to in the near future.", "author": "Lucky G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "Good vibe, good horse shoe shaped bar, friendly girls bartending, like Cheers where everybody knows your name.  A few hipsters sometimes sashay in here with their smirks and waxed moustaches, but mostly it's normal people, local folks, day laborers and UK ex-pats.  Many TVs with sports on, great beers, and sometimes they'll play your ipod on shuffle for the whole bar.  Pretty cool.  Their food might be their best feature, just tonight I had a killer reuben with thick chunks of corned beef and nice crispy fries.  I'd avoid their burgers because they're frozen patties not worthy of the rest of this awesome pub food menu.  I dare say, even better than the other local irish sports pub with great food, the Phoenix.  Plus I enjoy sipping my Smithwicks and watching all the dum dums meandering down 24th street outside.  Napper wins!", "author": "Evan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "Woo hoo quiz night!\n\nI'm only here for that, racking my brain with an ever-changing cast of cohorts.  We're in the back of the pub near the pool table, crammed into a booth, eating various fried foods, downing beer and screaming whenever we get a wrong answer.\n\nOur team did place 2nd once, though, and we split the bottle of wine we won.  It's such a good time, and the friendly staff at Napper Tandy always helps things run smoothly.  Our table service has always been top notch, and you can't beat the $5 drink specials.  Since this place is so close to BART I don't fret the trek back to my part of the city.", "author": "Charlotte M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-29", "description": "came here for trivia night... irish pubs arent my usual thing, but i truly enjoyed my fat tire and garlic fries here\n\ncool, chill neighborhood friendly place.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "I like drinking beer in its branded glass. Silly, I know. They have the fancy Modelo glasses here. $4.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "First, I met my girlfriend here while having drinks with friends. \nSecond, I think they have reasonably good food considering that it's a pub (and I've heard magnificent stories about their shepherd's pie).\nThird, they have Boddington's.\nFourth, it's the place where a giant guy with a Giants jersey came out of the bathroom being sorry for the giant stinkage left in the bathroom. \nQuintessential San Francisco, no?", "author": "Dario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "Love the quiz night! WIll definitely be back ---and the foods not terrible too. Yummy fried pub food.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "Hung out at the Napper Tandy for many World Cup games. The staff was really friendly and the atmosphere is super chill. Great food, had bfast and then the burger and fries and it was all killer! I will def be back for that burger!", "author": "Gretchen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "friday night a friend suggested we head over to this pub and grab some drinks, food and the warriors game. we headed for a booth in the back with a clear view of one of several large tv's that litter this place. the waitress was EXTREMELY nice when i asked if it was possible to turn the game on and immediately changed the channel for me. reasonably prices beers/shots (we drank guinness, coors light and jamie) the food was probably the best bar food ive ever had. the bacon/blue cheese/onion string burger was phenomenal. we split a plate of disco fries. i am not a fan of gravy in general, but man, those were some good fries. my friend had fish and chips, which he had my try and they were also really really good. the two waitresses on staff that evening were attentive, quick and very friendly. all in all, i would certainly return.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-02", "description": "I live 2 blocks away.\n\nBelieve everything you read since your experience will vary based on a bunch of factors -- day/night, staff, cook, regulars, gangsters, current sports.\n\nAll in all, its the greatest bar at 24th and South Van Ness -- for normal people.", "author": "Simon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "Great Irish bar with good drink prices (and specials), and the bartenders and patrons make great company. I had the fish and chips, which was solid. I live around the area and plan to visit regularly.", "author": "Yasser A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "What a great bar!\n\nWe came in at 8:30 for 8:30 trivia and there were no tables available. The owner found a table for us from the basement and set us up! I don't know if I've ever experienced that much service before! Food was good, and a pitcher of beer was $12; there were also $3 beer specials.", "author": "Jay T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "My friends and I live around the corner, and frequent the pub for a quick round of drinks or crawl back the next morning for $5 breakfast.  Friendly service and a mellow local crowd make this a solid neighborhood choice.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "Shouts out to the Napper!\n\nOne of the main reasons my soccer team and I go to the Napper is because of Lorina.  She's a cool ass chick that gets along with the best of them. I give her praise for she puts up with a lot of idiots and crap at the bar, and yet doesn't let it bother her.\n\nShe loves that we harass her with our cheer and chants upon entering and leaving every Monday night.  She knows our drinks and the food we eat.  Shoot, we should call her Mum for she takes such good care of us.\n\nThe Napper is the real deal and Lorina just adds to the spice of the place!", "author": "Piper C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "This place kicks ass.  A definite mish-mosh of pure Irish drinking, hospitality and food combined with some Mission flavor.  Also, the place always gets pretty decked out for holidays, so it gives Napper's a real homey feel.  The Bartenders are great as well all, they keep it real but have a gentle soul.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "Watched USA vs Ghana here with the Napper Tandy filled to the brim.  I give the service by the bartender that morning 5 stars.  Very attentive and quick when we placed our orders.  The reason I give this place only 3 stars is the TV quality was a little fuzzy when watching the game and the food was just ok pub food (we had chicken tenders and potato skins).  For me it defeats the purpose of going to a pub and watching a sports match if the quality is not as good or better than my home system.  I'll have to check out the vibe on a typical night to see if I can upgrade my rating.", "author": "Brian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-22", "description": "Walking home from a Glen Hansard/Marketa Irglova/Frames gig, a friend and myself got off the BART at 24th and Mission and happened upon this place accidentally.  Irish accents were tumbling out of the doorways, and salsa music played on the overhead speakers, a strange and lovely mix, and totally appropriate for the Mission.  I ordered a Guiness and Bailey's, and the bartender was warm and friendly, and even bought us a round of drinks-- I loved everything about this place, and would recommend it to anyone. :)", "author": "olga n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "This is a really nice place. The staff are great, very friendly. Food is good. Not very busy on a Saturday night, kinda quiet.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "LEGITIMATE IRISH ACCENTS AND FULL-BLOWN SUNDAY NIGHT KARAOKE. Can somebody please high five me?!", "author": "G. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "An uncrowded Mission Irish dive bar with young white girls having a hip hop karaoke contest on a Saturday night . . . this clash of cultures was a stunning thing to behold.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-13", "description": "I had walked by this pub dozens of times, and on each occasion I thought it just a tiny bit out of place...c'mon an Irish pub in the heart of the Mission?!?! Had I just stepped through a worm-hole that spit me out in the Sunset?! \r\nFinally I had a great reason to step through the thresh-hold - co-workers enjoying a pint and some great live music. \r\nIt was TINY...at least the front room was. We crowded around and happily swiveled  on our stools anytime anyone needed to get through the aisle that even Paris Hilton would have trouble squeezing through. (Fortunately she was not present...would have severely affected my review) \r\nThe bartenders were friendly and attentive. \r\nI must qualify this review --- I DID NOT EAT. The past ratings seem to reflect the quality of the food...i am merely rating on booze-ability and the ability to spend some time there with a group of friends and have a few chuckles. Four stars for me...I would go back!\r\nLauren G. i will chuckle and not guffaw...should any obnoxious cacklers be near i will commence with a beat down!", "author": "Jessa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-28", "description": "A wacked Irish bar deep in the Mission, full of latinos, has all the food and decorations an Irish bar should have in San Francisco, including bar flies from up the hill.  Food until ten, drinks till you drop.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-07", "description": "The one good thing from dating that girl in the Mission for all of 2 weeks was coming here and getting tequila shots.  I never stopped by in the dark.  I never played pool.  We would stop by for a warm up shot and beer and be on our way.  It seemed cool enough.... for a Irish bar deep in the Mish.  I loved the people watching while at the bar and it was rightly priced.", "author": "Chard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-05", "description": "I give this place 5 stars for the bitchin' trivia night that they do.  Excellent hard questions, good prizes and colorful crowd.  Definitely a must do for any trivia geeks.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-28", "description": "last week i was in the mood to be keeled over with a gut-wrenching stomach ache caused by some of the worst food i have ever eaten in my entire life (and yeah, i've eaten chow mein in guatamala, skirt steak in vanuatu). good thing the napper tandy was open. they set me up with a standard so-easy-you-can't-possibly-screw-it-up breakfast combo of eggs and sausages with homefries. lo and behold, within thirty minutes i felt like i had swallowed a live cat...my entire body was jerky and wrecked from this foodish filth. not just me, but the 4 other folks who shared the same breakfast felt the exact same. ...a few days later, after significant warning, a friend ate there AGAIN...same story. he paid the price, oh, he paid the price.\r\n\r\nthis is a place that serves \"french toast with fresh fruit\" with three-week old refridgerator-rotted CANNED fruit. people. there's a frickin horn-a-plenty fresh fruit stand across the street! oh, i could go on and on. i have to say, tho, that i kind of repect their persistence, i mean, it's like failing grade school -- you have to really try to do that, to be that bad. and for that, i give them an A for effort . For, dear reader, they have succeeded in being number one in at least one category: the most digusting ass-food in the city.", "author": "Tad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-17", "description": "Ok, I haven't had the food and most likely never will. This is great clean bar which is somehwat uncommen in the mission. The service is great (ok the bartnder may have bought a round or two). I work in the neighborhood so this is kinda a nice plain to unwind on a Friday afternoon.  They were kind enough to make my co-worker a blended  mango margarita (she had a big craving) even though they had to go find the blender and make sure it worked. I hear they have kick ass karaoke on a Saturday nite as well.", "author": "Catherine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-02", "description": "i like the randomness of this place. we went last night for fish and chips (Friday). the fish was more batter than meat, but the chips were good.  the randomness comes from the clientele- a bunch of old doods, some latinos, a lot of young hot irish guys with young hot irish accents, and us.  not a lot of ladies up in the joint. it seemed like the type of place you stop in after work and before going out (even though it was like 10pm-ish when we got there).  \n\nThere's an irish guy who i feel sure is a regular, who is the funniest thing ever. my friend and i never laughed so much in my life, and i'm sure if i go back, he'll be there again. so for that reason alone i give this place 4 stars for intertainment.", "author": "ms.kiki g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-19", "description": "LOVE THIS PLACE!! Found them on restaurant.com. Thought it would be a great place to go to with some friends up visiting for the weekend. The fish and chips and Shepherds pie are to die for. Service was great, considering there was only one person running the bar and serving. She did fantastic. Will definitely be back very soon.", "author": "Kathy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-05", "description": "I walk past the NapTand every day, check out the brunch and dinner specials chalk board, and think \"I wonder if that's any good.\" I figured I would put all my eggs in one basket and go for dinner AND trivia night on a random Wednesday night. I don't know what I expected but I was let down. Trivia didn't start until a good 30-45 minutes after they said it would, the booths were extremely uncomfortable to sit in, and the food was sub par. Someone described the fish and chips as fish doughnuts. Eww. I would give it only one star but the oktoberfest was decent. What can I say, I'm a sucker for beer...", "author": "Susan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-17", "description": "Okay, so I don't really drink at this bar (seems kinda like a fishbowl full of televisions) but I do walk by quite often and I'm always amused at the bad spelling on their specials board outside. One time they actually had a special called \"Festy Nachos\". What the hell was that supposed to be?? Festy?? I've even seen Mango Moose Cake (mmmm, moose). One of these days I'm going to drop a dictionary at their door, but until then at least it gives me something to smile about on 24th street.", "author": "Stella O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-11", "description": "Had several rounds of blood mary's and the first couple were spicy and good. They went a little downhill towards the end, but still is a good spot to watch some sports and have a few drinks. As for the food, not sure why anyone would actually eat here, considering all the other options in the vacinity...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-28", "description": "i remember being out celebrating my friend's 25th birthday with the napper being the final stop on our vodka infused evening. us girls were far too faded to partake in trivia; and the boys were freakishly way too into it!! wanna know how done i was?! instead of participating in trivia, i decided the table made a much better pillow. sadly, so did the birthday girl. as i sat there arm folded on table and face buried in arm; i heard a trivia question through my Z catching. \n\nof the seven wonders of the world; which is the only one that still exists?\n\ni instantly popped my head up and told the boys it was the pyramid of giza. the boys laughed at me and told me i was wrong and decided to go with the grand canyon. i gave a very polite \"F*CK YOU\" and put my head back down. moments later the answers were called out and.... dun dun dun...who was right?! YUP the drunk girl passed out on the table!!! to that i raised my head again, and said \"DAMN it feels good to be a gangster\" and put my head back down again.\n\nthe moral of this story is:\n1) girls are always right\n2) the napper not only makes great drinks, but is also has fun trivia nights\n3) the napper ALSO makes a great resting place.", "author": "Kristin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "the bar maids who work here are mad!  they're drinking with the patrons, and may be even drunker than them too.  \n\nit's good fun at this bar.  it's the kind of bar where you keep knocking them down the hatch, and the next day you're trying to retrace the events of your previous binge session.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-10", "description": "I had never heard of this place until I went there last night for a friend's birthday party- karaoke style.  The bar is a bit cramped but I think that adds to the atomsphere and allows you to get to know your fellow bar-mates.  The bartenders were attentive and friendly and even though it was very crowded it wasn't too hard to get a drink.  When I am in this neighborhood again I would make a return trip.", "author": "Liz U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "Best fish and chips EVER!  It's definitely a local bar with local Irish peoples chillin on any given day.  It's a good spot.  I come here when I'm craving fish and chips or a nicely poured black velvet.  YUM!  The bartender is super nice and awesome in every way possible.  There's a front area where the bar is plus a back area with more booths, tables, and a pool table.  There's also a jukebox so I've been known to come here for happy hour, turned dance party, with the coworkers.  They also have trivia night, which I need to remember to partake in sometime soon!", "author": "Lynda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-16", "description": "I was only there for 20 minutes, but any place that has a bar that big in a space that small deserves a starting point of 4 starts. Lots of stools, lots of TVs, nice peeps.", "author": "Annie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-28", "description": "I went to the Napper Tandy to: \n\n    A.) experience the DJ (a little birdy told me he was good)\n    B.) Karaoke\n    C.)Spend quality time w/ the boys\n    and D.) get snockered\n\nAll in a short period of time because I turn into a pumpkin after 12! *gasp*   j/k... BART stops running at 12 and little ol' me would have no place to go after last call.   All that being said, I love Karaoke more than life itself.  So I'm one of those people who doesn't need to be drunk when I belt out Kelly Clarkson's - \"A Moment Like This\" to a crowded bar in the middle of SF, but it doesn't hurt.  :-) \nMy friends & I took BART from Pleasanton. Arriving safe and sound in SF around 9:30, we took a short walk to an already pretty crowded establishment. When I first walked in I was like \" wow, this place is tiny!! \".  The DJ greeted us warmly upon entry.  We made our way, shuffling, single file along the right side of the bar to the back room.  As we entered this new area we saw some friends sitting in one of 6 or so large wooden booths that sat 6 people each.  I would imagine that the space would be ideal to shoot a scene in Boon Dock Saints. Or just grab a pint on a cool afternoon in the city with a few friends. mmm sounds so cozy ~ ^,_,^ ~ At any rate... it was great while it lasted and the Karaoke was a blast. The crowd is so supportive and very warm. The drinks were average both in quality and cost. The bar tender was nice... Tall thin blonde lady with a nice smile. I would say it was worth the BART ticket out there, but I would have really liked to stay the whole night and crash at someones house in SF... Maybe next time. \n\nOver all a great place. :o)\nI want to be there for quiz night... *sigh* Some day I guess - They list their weekly (or was it Monthly *ponders for a moment* )events on they're coasters and so I am curious... Sounds like fun.", "author": "Lynsey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-22", "description": "Exactly what you'd expect.  Down-home drinks, service, and decor.\n\nFor misguided \"Sammy S.\":  never got anything but stellar service there.  I guess not being a hipster helps in that regard.  Also: you don't order lime with a whiskey and coke.  Are you new to drinking?  And, you don't \"excuse me, yoohoo\" -anyone-, never mind the person pouring for you.  There's such a thing as the customer being flat-out wrong, rude, or in your case both.\n\nThe bartender I believe you refer to has *always* been pleasant to me and is pleasant to look at.\n\nPlus, your raving personal attacks are sad.  Did you go in on your \"red week,\" by chance, or just write your review during it?", "author": "Jimmy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-08-16", "description": "holy shit this is ike the worst food i've ever had to pay for. seriously, I would rather have a \"moons over my hammy\" at Denny's than anything from this rotten kitchen. My frist try at the Napper I ordered a caesar salad-what i got was iceberg salad max (complete with little shredded carrots) and WISHBONE ITAILIAN DRESSING. that's right, wishbone Italian. That's right, on a Caesar. the second time I was there drinking and my friend insisted on eating-I warned her, tbut my attempt was futile. a quesadilla. literally the kind you make at home when you are wasted-two torillas grilled with shredded american in the middle. that's it. oh and a ramekin of sour cream. i watched another friend ruin his night by ordering pork chops-about a centimeter thick and dry as my mouth after a four foot bong rip. you have been warned...", "author": "Chaka K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "So hey!  This is a goddamned Dive Bar.  Not a Michelin rated restaurant.  They have the best Effing Fish & Chips in San Francisco though the great ingredients in their burgrers could do w/ a bit more temperature to give a slight crusty-ness to the patties. \n\nThat said, the crowd is usually great, the staff a hell of a lot of fun if a bit distracted at times, & the pints good & chilly.\n\nMake sure to stop in on Saturday days when 'The Meanest...and Most Fun' Bartender in San Francisco is working.  The locals all seem to have an outrageous time giving her a load of Sh%#t while she dishes it right back!  They call her something like, 'The Lorn Beast', or 'Haggy'.  Note exactly politically correct, but what she doesn't seem to care.  People show up just for the abuse as it's apparently something of a weekend ritual amongst the regulars and a great bit of fun for the unsuspecting sod who wanders in.  The odd surburban droid might not get it unfortunately.  Then urbanites don't get them either.\n\nThe only real down side is that it is usually something of a Sausage Party.  Especially on the weekend days with the American Footbal crap.  That said, 'Cherry' (?) is the sweetest thing this side of Honolulu and everybody seems to be hot for the blonde one they call 'The Teacher'.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-03", "description": "I have been here only on Wednesdays. My experiences are limited to Wednesdays, so this review will be based on my Wednesday visits.\n\nWhy Wednesday, you ask? The Napper Tandy runs a little thing called A Pub Quiz. As such, they are heavily staffed by a large number of Irish folk who happen to be among the nicest pub workers in the world, albeit heavily understaffed. In addition to being patient and kind, they make tasty chicken fingers and finger-licking good chocolate martinis.\n\nI wish I could say the same about pub quiz attendees. RAMPANT cheating. I don't want to see your iPhone pulled out, little fingers typing away on Blackberrys (Blackberries?!?). Just... don't. Is that too much to ask?", "author": "Tina V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-18", "description": "This bar has no idea what it wants to be. It's not really Irish, it's got bright Mexican colors and is filled with confused white people. Too schizophrenic.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-18", "description": "I've gotta say, I live very near to this bar and have only ventured in once or twice.  Bad Marina-style karaoke on the weekends spills out onto the sidewalk.  Last night, however, all I had in mind was a beer and a game of pool.  And Napper Tandy could not deliver.  The doorguy was literally passed out on his stool-and it was 8:00.  The bartender was MIA, then she was on the phone, then she was smoking.  On my 4th visit (still no beer) I let her know that the cue ball was stuck.  She tried to shoo me away; I had to beg for my beer.  And it was a crappy beer.  And she told me one price and charged me another.  Anyway, it's confirmed.  This place blows.  Thankfully, moved onto Bar Mission at 23rd and had an EXCELLENT experience.", "author": "rachel h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-07", "description": "I get it - it's a bar, not a restaurant.  I come here about once a week to watch Giants' games because it's on my way home from the BART station.  Bartenders are mildly friendly and the beer is beer (not a bad selection, but nothing prolific either).  The food however, is incredibly bland.  Had fish and chips last night ($12 I think) and didnt taste anything other than the tartar sauce I ended up having to use to make the fish have any flavor.  If they don't care about the food, that's fine, but i think the prices should reflect that.  Don't mind coming here for a beer while watching the game, but won't miss the place when I move to the Richmond next month.", "author": "Dareyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "$5 breakfast on Saturday and cheap mimosas - pretty good bargain for SF, even if the portions aren't that big.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-23", "description": "Good atmosphere but the wings and fish where sub par.  The fries on the other hand are fan f**king-tastic.  The service was good and I'll def give their burger a try next time I stop in.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-07", "description": "Some people like to drink so they go to a place like The Napper Tandy and have half a dozen Pilsner Urquells for $4 a piece and then go off happy to have a bite to eat somewhere else and dream  a little dream once they get home to their beddy-byes.  The end.", "author": "Kasey K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-12-20", "description": "Shut up you noisy m*****f*****s!!! I live on the next block up and invariably on any weekend-night there is always some drunken pack of pale, blotchy skinned girls smoking on each other and screaming on the corner in front of it. And just so you guys out there don't get any big ideas: they're usually fat and stupid! Yeah, I said it, you wanna brawl?!  I'm gonna get a paint gun. I walk by this place in the morning on my way to bart and it usually smells like Pine-Sol and throwup. It boggles the mind that anyone would eat there. Luckily alcohol kills bacteria.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "I mainly visit the NT on Thursday poker nights.  The pot pie is really good with a decent salad to boot.  And they have good meatloaf too.  How do I know about the meatloaf if the potpie is so good?  Well, they gave me a meatloaf dinner free one night after accidentally making me wait FOREVER, for some potpie to go.  Wouldn't take my cash for the potpie either and set me up with a free Harp whilst I waited.  Very creamy mashed taters too.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "A real Irish bar in the Mission! without the 'tude. Highly recommend the Guiness stew which is amazing. Giant fish and chips. And if you're a fan of Irish soda bread, this place will remind you of your mum or your friends mum. The atmosphere is on local bar/divey side but it definately has it's charm.", "author": "kevin k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-22", "description": "Not really sure what to expect as reviews seem mixed (except for the guy/girl who lives down the street...quit your b**thin, if it bothers you so much move and stop hating.) but me and my mates had an excellent time. The female bartender mixed a mean fast drink and really new her stuff as we drank our way through a multitude of cocktails. I also like the fact that they serve Magners my favorite home town drink. We had such a good time at the bar that night that we braved a pick me up the next morning and we where not disappointed. The irish bfast was just the job with real galtee meats and heinz beans hmm hmmm. Cant wait to go back. Glad the kitchen has sorted things out. Great atmosphere and wonderful service both times. Thumbs way up :) \r\nPS I did not see any fat blotchy women only young and middle aged people having FUN and interacting with each other.", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "i have no real desire to come here at night, but have recently become rather fond of stopping by in the afternoon for a bloody mary or two. \n\ntheir bloody maries are tasty, not the best, but certainly worth dropping a five buck bill from time to time. i have yet to try their food, but i am determined to try their fish and chips one of these days. \n\nthere has always been questionable music involved in my visits... playing the killers one notch over acceptable happy hour volume, making it rather difficult to hear what your company is saying, is a bit of a bummer.\n\nthe bartenders have always been friendly ladies, though, and there is just something about the small, highly intoxicated, early afternoon crowd that appeals to me.", "author": "Kayla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-30", "description": "The usual after work stopover on the way home...great corned beef and cabbage, good beers, and friendly bartenders make the Napper a vital part of my daily diet. With the pool table in back you've always got something to make an ass of yourself at after too many drinks!", "author": "Craig E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-23", "description": "Great hole in the wall pub to have a drink without too many lingering readers, web surfers, people discussing the third or fourth degree they are working on (Momi Toby's, I am looking at you!).", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "Went here for the 1st last night with a group of friends. The drinks were well made and priced even better. We ended up ordering several rounds of garlic fries along with some fish & chips which was good but could have used some more flavoring. The bartender was attentive and quick with the drinks. Bathrooms were surprisingly clean which is a big plus.", "author": "Alfredo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-09", "description": "i like the set up of this bar. everyone sits around the bar, like circle time in kindergarten. \nmy favorite thing:  the bar tenders don't give you death eyes if you ask for a bloody mary.\nthe bar tenders are nice and cute also.\ncheck it out.", "author": "ellen m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-28", "description": "You ordered a quesadilla at an Irish bar and you're surprised it's not good??...Quiet enough at Thursday at 9 for a group of 8 to sit together, no problem. It got slightly busier as the night went on, but not much. Fine neighborhood place for a pint.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "the drinks are very good and very cheap, and also come very fast\n\nthe karaoke competition is zagat-rated as one of the most intense in the world next to that of american idol\n\nparking here is surprisingly easy, and if you don't feel like hanging around, the neighborhood has a lot to offer", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-22", "description": "as a dc transplant, i've been fiending for a place to watch 'skins games. and this has quickly become my favorite place, because come sunday, they've always got my game on by the time i arrive. also, there's a crowd of fellow dc transplants who gather there to watch them, meaning there's always someone to give a high-five when clinton portis catches a beautiful throw from jason campbell and skips into the inzone like it ain't no thang. \n\nthis is not a perfect bar, but it's way better than your usual dive. and it's not a gourmet restaurant. but their food is way, way better than most bar food, and the person who said they have AMAZING fries--that person is entirely correct. \n\nand yes, the bartenders are actually irish. and they have a back room with a larger screen (just in case the 6 or so TVs in the front bar area weren't enough for ya) as well as a pool table and some booths. and they have decent vegetarian brunch options (veggie sandwich, tofu scramble, omelettes, banana-walnut pancakes, etc.), which makes football sundays fun for both me and my girl.", "author": "Marla W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "What more can I say, this is a great happening bar in the heart of the buzzing Mission district. Just a mere stones throw away from bart you can get fed, hammered, watch some ball, play some pool and then fall the few steps to bart. and home! brilliant !! The bar is fairly big plenty of light if you wanted to go in for a midday read which is why I went in in the first place but I came back to explore after I had a swift look at their menu which was presented to me by an Irish bartendress with a cheerful smile who asked how my day was before she asked what I would  like to drink. Its a big menu they do everything from hamburgers and Irish breakfasts to Quesadillas and pulled pork sandwiches the food is moderately priced but I dont mind paying if its worth it. They also have lots of beers on tap and I noticed three different bottles of tequila (which I hate but I guess I am in the Mission) There is a pool table in the back of the bar which always seems to be accepting quarters and the regulars do be lining up to take on the table champ. All in all good food, good people, great Craic", "author": "daire l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-29", "description": "So I went here for the trivia night a while back and was underwhelmed.  The trivia was one of the company written ones which instantly decreases my interest.  Given the division of the Tandy into several rooms, I think we only saw one of the other teams there.  Trivia also started late and was rather slow.  Most annoyingly, the prize was 30 \"tandyBucks\" which means my team will have to go back there at some point to use them.  Beer selection was decent, did not have food so I cannot comment on it.  The only thing I can say positive about the trivia is that the competition was very weak.", "author": "Alured P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-13", "description": "An Irish pub with a pool table, pitchers of beer, food, karaoke, and trivia nights.  What more could you ask for?  I like this little joint, I pop in every now and then for a beer and a snack.  They also serve breakfast on Friday, Saturday and Sunday.  Not the best food I've ever had but for the place and the price it's not a bad deal.  The bartenders are cool and on certain days they will play your iPod, which can be a good thing if you're You, but bad if you're stuck listening to someone else's crappy music.", "author": "P D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-11", "description": "I come here everytime i visit the city. Whether it's for a nice quiet meal with some friends  on a Tuesday where the bottles of wine are half price or when it's at it's liveliest friday/saturday night. My friends and i have a blast everytime we go-it seems like everyone knows everyone and they're not afraid to have fun.  The locals make you feel welcome and i can't help but  appreciate the authenticity of  the vibe thats created in the bar  by having a little Irish, Iatin, Amercan fusion of people.  Great pub grub-tough break for those who were disappointed cause the foods been delicious everytime i've been there. Myself and my girlfriends were there last Friday night-we were only supposed to go for one before we went to the yuppie red room. We never made it down town that night. Check this place out-Good times all around", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-02", "description": "Good  food and great people in this bar which make It is a must.  It is a  Irish Pub with plenty of Irish people, not only the bartenders but also clientle.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "Napper Tandy is the bar I head to when I need a drink and some grub after a taxing day at work. It always satifies. Usually Lisa seems to be working  but all the staff are great. Lorna was working a recent Thursday and was a hoot. I say to all the haters go to a different bar.", "author": "Ralph R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-27", "description": "Minus 4 stars for being a fake Irish pub.  What self -respecting Irish pub has no Chef Sauce or HP Brown sauce to serve with their full fry (Irish breakfast)?  The surly woman in charge says they have A-1 as if it's inter-changeable or a remotely close substitute.  Geez.  Roxie's Market in the sunset has cases of both sauces readily available for them to get some Irish street cred, but you can tell they just don't care.  Very negative vibe here.  Super sweet lady bartender Taylor tried to make up for your woman's surly-ness but it was outwieghed by tons.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "i love this bar. here we go:\n-chill bartenders\n-funny patrons\n-chill atmosphere\n-music cool depending on who is feeding the juke box\n-BEST F*IN HOT WINGS IN THE MISSION, SERIOUSLY! \nreminds of something i would get on the eastcoast.\n-STRONG DRINKS!\n-good prices, 2 for 1 margaritas thursdays.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-30", "description": "fun bar with snarky fun waitresses, but a bathroom that stinks to high heaven.  within walking distance to the house, so we will definitely be back!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-16", "description": "my friend and i wanted to catch some first round ncaa tournament action AND eat dinner so he suggested the napper tandy for its better than average bar food and he wasn't lying. we shared an order of potato skins, which were average. however, his shephard's pie and my fish and chips were surprisingly good. also worth mentioning were the numerous people who came in and picked up take-out orders. how many times do you witness that at a bar? next time there's a sporting event you wanna watch and you're lookin for a low-key atmosphere, one that your regular sports bar can't offer, and some decent grub, try this place.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "great neighborhood bar with a good to great kitchen, depending on your expectations.  if you think \"pub food,\" you'll be happy.  fish and chips are lovely, as is the irish breakfast.  the bar gals are wonderful and the patron mix is always a hoot.  i want to add that i was there also during Carnaval and was impressed at how coolly and efficiently the gals handled the overflowing crowd.  we were amazed they even bothered opening the kitchen, but they did, and the food was as good as usual.", "author": "Kathryn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-03", "description": "when i came in here last night a dude was singing the real slim shady on karaoke. i started to sing along and i knew the lyrics better than he did, too. then some really bad ballads came on and i had to have a couple of drinks just to stand it. unfortunately, i didn't have enough liquid courage to belt out a few myself. maybe next time. maybe i'll even get to use that fake guitar they have...", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-02", "description": "ok, so this place is across from my new apartment in the mission, and while it seemed a little scary at first, they in fact have a good selection of beer on tap and damn good food.  what got me in?  the monday night fish & chips!  and they are really bloody good!  so good that my belly and innards were all messed up the next day from gobbling down four huge oily fillets.  they also got damn good burgers, jimo says that it's the best burger he's had so far in san francisco.  i'd say it's in the top 3, for sure.  anyway, aside from being a bit sporty and bro-ish, this is a cool spot.", "author": "eric i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-03", "description": "First time at this place last Saturday morning.  Wandered in alone off the street  looking for some breakfast.  I seemed to be the only non-regular but everyone was friendly & I had a great time.  The bartender was super entertaining & sweet - she did a smash up job managing all the customers bellowing at her for more booze, and kept my coffee cup full.", "author": "Anna V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-28", "description": "lorna! need i say more?", "author": "Jenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-25", "description": "Took a trip into The Napper Tandy last night after passing it on the bus for months.  Being Irish, I'm more than a little skeptical about Irish bars in the U.S. and nothing pushes my snob buttons more than a badly poured pint of the black stuff.  But, this is where my date wanted to meet & I decided to roll with it.  I was not disappointed.  This bar has buckets of personality, from the friendly regular crowd, the occasional amorous elderly gentlemen, to the constant hum of tvs broadcasting sport from everywhere else in the world.    I have to give extra-special props to the bartender - the lovely Lorna.  She was super friendly, efficient, managed to politely (but effectively) shoo away a demented old man who was sabotaging my date AND she complimented my perfume, so she has extremely good taste to boot! If you are looking for a bar in S.F. with some honest-to-goodness  real Irish flavor, go here.  If you are looking for Disney Irish, take  your sorry ass to the Marina and leave this Mission gem to those who can appreciate it.", "author": "Ciara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-12", "description": "This is a great  place!!! Ive had some fun nights here in my life, which END UP turning into crazy nights. Maybe I'm biased  - I love pubs. They are truly the greatest social environments on Earth. Now if you could do a pub orgy, anyway, the wait staff are comprised of pretty ladies who'll happily pour you a beer, just don't get cheap on the tip, otherwise they unleash the beast on you. He sits happily downstairs in the basement, and is fed Guinness and fish and chips, but is most happy when he is called to the task of having to \"escort\" someone out of there. So, take my word, don't disrespect the ladies. There is ALWAYS sports playing, and it is a very intimate setting to watch sports of all kinds particularly World Cup games, though they show futbol(soccer) year round. Sometimes you don't need to do Jilians to watch sports. The food is also great, really, but the in intimacy, and great service from all the girls there is what keeps people going. Oh and then there's also Aiden. Oh and karaoke on Saturday night brings in a dedicated group of singers with beautiful voices. This karaoke rocks because everyone is havin fun with it, no Minty pressure.", "author": "Maui G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-25", "description": "great food, good selection of beers on tap and a great staff.  check it out", "author": "Ausewaldoe J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-11", "description": "a great place to hang out on an off day...was actually a lot less grubby than I expected and all the servers were actually Irish!  points for \"authenticity\".  Plus they have a fun pub quiz night on wednesdays that isn't so ridiculously hard that you sit there feeling like an idiot all night, but hard enough where you're using a few brain cells.", "author": "jozilla w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-19", "description": "How to start! Firstly i'd like to say that some of the earlier reviews here are waaaaaay off! I've only recently discovered The Napper and i cannot find one bad thing to say about the place, honestly! The food is just delicious, have tried the fish n chips, chicken tenders, the breakfast, (real rashers, sausages & puddin!) a few other things but can't remember all the names, saw alot of food being served to other people and they looked yum too, every other customer i've seen in there seems pretty happy and full with it too as all plates are empty going back to the kitchen! Portions are massive, definitely worth the price. The place is very clean, staff are great craic, cocktails are yum. They have some good deals going on a daily basis, ie Mon is all you can eat Fish n chips, tues half price bottles wine.  They do specials on some of the cocktails too i think.  Will definitely be going back for the cure breakfast or just for a good session! Any body who says different must be in the wrong bar!", "author": "Maureen D."}
