{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "The Black Horse might be my new favorite place in the world! I was in SF   solo for a work trip and it happened to be my birthday. A couple of amazing coworkers were also in town so we decided to get saucy. We ended up at Black Horse and we had an absolute blast. Check out Jonathan T's review for a full account of what went down. \n\nThis magical night was filled with bathtub beers, new friends, bar dancing, ice throwing, dice rolling, and even hula hooping! I got to shotgun a beer, wear a happy birthday sign the bartender cut down from the ceiling, and don her dope ass LA Gear pink denim jacket while I showed off my moves atop the bar. The memories I have are all amazing and I can't wait to come back on my next visit.", "author": "Scotty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "The most wild, scandalous, and this-stays-only-between-us-please memorable bar experience of life occurred in space no larger than a 2010 Toyota Camry (LX). Why? \n\n- I won a dice game of 1, 4, 24. (Buy-ins cost one dollar). And after I announced my victory, the bartender dropped all ten, hepatitis covered dollar bills on my face. When she ran out of money, she tossed a stack of coasters onto me. #blessed\n\n- If the bartender likes a patron, he or she may ask that person to dance on top of the bar. I had the opportunity to do so and got down to Michael Jackson (so stretch your calves and ankles before venturing out to The Black Horse). Also, if you stand on the bar you then the awesome opportunity to have ice thrown at you. *Pro tip: Hold onto one of the walls, so you don't fall. \n\n- It ain't up to code, but all of the beer sits in a bathtub full of ice behind the bar, and their selection varies every night. Bring cash because they don't take credit card. *Note: The convenient store on the corner has an ATM. \n\n- I saw my boy Scottie grind with the bartender. He asked for her pink jean jacket, so she sexily took it off, rubbed it in between her cooch, and handed it to him between her legs. He then put it on and looked mighty fly. They then danced together, and he looked so happy because the sista was stacked. She's pregnant now. \n\n- The bathroom has one magazine (ESPN), and it's from 2005. The cover page features ex-NFL running back Cedric Benson and words that read, \"I'M NOT RICKY.\" I don't think anyone has touched it since that year, too. \n\n- A random happy birthday sign ran across the room, and the bartender cut down just for Scotty.\n\n- Slam a beer for only six bucks. \n\n- For about ten minutes, everyone left the bar to practice hula hooping out on the sidewalk.\n\n- There was a dude hugging a Taylor Swift cardboard cutout and taking selfies with it. lol. \n\nSure, I may have contracted some sort of venereal disease or skin infection that night, but I would relive it all over again. The Black Horse welcomed me to its cozy, bacteria infested little home, and I can't wait to return see my weird family. And I wouldn't want it any other way.  \n\nWear shoes you don't love there. Trust.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "We were walking back to our hotel and someone inside this tiny little bar yells at us to come in and that this is the \"smallest bar west of the Mississippi\".  We decided to stop in and grab a beer and we were glad we did.  Very charming local watering hole, super friendly staff and patrons, and rotating selection of craft beers kept behind the bar in an old bathtub full of ice.  Worth checking out!", "author": "Mark Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "This bar rocks. And I'm not just saying that because, thanks to 1-4-24,* I've almost always walked out of this bar with more money than I walked in with. \n\nIt's really more like hanging out at a friend's place than a bar. It's tiny, just like all my friend's apartments. \n\nJames is less like a bartender and more like my buddy who's just standing closer to the bathtub of beers, so he hands me one when I'm in need. I do have to pay him (and tip him) for those beers, but just like most of my friends, he's tossing them back too. Occasionally he'll just shotgun one because sipping is too slow. \n\nAnd just like most of my friends' places, we all want to leave when Ruggy shows up. \n\nBeer and cash only.\n____________\n\n*This is literally the only game I have ever been lucky at. I don't understand it, but I also don't want to question. If you don't know what 1-4-24 is, you better get over to the Black Horse and find out.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Insanely small with all the charm of someplace ten times its size. The Black Horse London Pub is another oddity I check off my list of strange-yet-cool places I've visited in San Francisco. \n\nThe size is what makes it unique and is also their selling point. The tiny bar can seat maybe eight people max. When sitting, your back is practically up against the wall. Your knees bump the bar. The stools are uncomfortable. The beer is literally a few canned selections served out of a bathtub. \n\nIf all this sounds horrible, it's not. It's what makes this place fun. You can actually get to know your neighbors without shoving your way through crowds or getting mean mugged. It's small enough that the bartender will stop and talk to you. And on a good night, like the Tuesday I visited, they might even have a couple drunk dudes crammed in the back corner playing guitar.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "It's like I'm starring in, \"Being John Malkovich\" as the place is so amazingly small. Stumbled into the Black Horse last night with a friend on a whim and really enjoyed my time there. For those of you who don't know, the beers are in a bathtub behind the bar, the place might seat 10 and it's an great no frills spot. \n\nHere's how my night progressed...\n\n1. Ordered a PBR ($4) and bellied up to the bar \n2. The bartender offered me some of his gummy bears and I kindly accepted. Pure gold. \n3. Took a shot of Irish whiskey\n4. Listened to two patrons play guitar in the back of the bar\n5. Exited the bar\n\nMy advice, is to experience this place ASAP. There are few gems left in this city and the Black Horse embodies what I love about the \"old\" San Francisco. It's also a great place to watch a soccer game on Saturday morning.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "I've lived here 12 years and this is my Cheers. Say hi to James (owner) and give him crap about the Indians Cavaliers and Browns haha.  Bear Honey may be guarding the door.", "author": "Geno B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "What a crap hole. The owner gets beer at Costco by the case and chills it in an old bath tub behind the bar. Everyone in there thinks their  doesn't stink because they're shoulder to shoulder getting a niche and \"authentic\" bar experience by going to this place. Complete joke. Also, the guy who runs the place sucks at playing guitar and nobody has the marbles to tell him. Lame", "author": "Richard J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I love this bar. - intimate, fun, cool patrons, occasional games, the owner is cool as fkkk, bartenders are super chill... my go-to when I stay in the area whilst in San Francisco...", "author": "Lilia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Suuuuuuuuper freaking sweet y'all!!\n\nI walked into this place sooo confused and lost cause it was NOT what I expected. But the people here from the staff to the attendees will turn your frown upside down in a heartbeat. They are super cool, have some funny but honorable rules hung on the wall I suggest you check out before getting comfortable lol. \n\nOnly missing a star cause I had trecked so far to this place thinking they had hard liquor but it was only beer, but honestly that's just the drinker in me being picky. These people are so sweet and definitely worth the visit. I'm taking a friend there this weekend(and I'm from Sacramento lol).", "author": "Anissa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Been going for years. Great local experience and very welcoming! Nice, cozy bar ambiance and great spot for beer and a chat. Always making new friends there with the patrons.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "This is hands down my favorite bar in San Francisco. My friend recommend it to me and told me I have to go no matter what. I was not disappointed this bar is a hidden gem as soon as I walked in I was greeted by the bartender JC and all the patrons, sat down and had a few cold ones. If you are looking for a fun and awesome time definitely come in and experience it for yourself! Also shoutout to JC the man behind the bar keeping the beer and tunes coming! Best bartender in SF!", "author": "Willie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Best pub in San Francisco.  Friendly locals and a genuinely nice place to hang out and have a laugh for a couple of hours.  No pretentions...just a fun place to be.", "author": "Tim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "How many places would have a bar that only seats 9 people and serves great Brit ales and Belgian beers out of a bathtub full of ice? this has to be the most unusual bar I've ever been in, and I've been in quite a few. The bartenders and the other patrons are super friendly too.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "Itsy Bitsy, Inny tiny, famous for being small. Yawn. Can you say  Clicky? Parking is a pain, arrive by bus...too crowded? Keep cruising down Union street for a plethora of bigger better bars.", "author": "Laurel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Randomly walked into this pub over the weekend. Coined as the smallest bar in San Francisco this pub literally has seating for less than 10 people! Beers served out of a bathtub on ice behind the corner. Random memorabilia pinned up all over the walls. Every neighborhood needs a small hang out spot like this where everyone is friendly, the bartender knows your name and suds are continuously flowing.", "author": "Ralph A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-06", "description": "Totally not what I expected. It must be where they coined the phrase \"hole in the wall.\" Super nice bartender and regulars, but.... I came for good beer, and I was disappointed.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "Extremely small place. Only about 6 people fit inside. We were unable to even walk in as it was a hole in the wall", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "File this under Another Thank You To Yelp for finding me a cool place.\n\nI was out with my dog in SF and wanted to find a dog-friendly place to have a beer and watch the Chargers vs. Raiders game.  And while the Chargers didn't deliver, as they were wont to do this season, the Black Horse did.\n\nRealize that the place is tiny.  The Village Pub in Carlsbad can accommodate 18 people comfortably, and maybe 30 in a United Airlines level of comfort.  Black Horse accommodates half that.  But it's the friendly half.\n\nBartender (owner?) James had 8 types of bottled beer available, all chilling in an old-house porcelain bathtub.  I went for a Kloster Andechs, a German abbey lager I'd never hear of before, and kept coming back for more.  The other 8 seats were periodically filled with locals and tourists, and my adorable Pit/Lab pup, The Wee Baby Ava, pulled up a spot in the doorway and greeted everyone who came in.\n\nBut we're not just talking dog-friendly here.  When one customer got a serious swerve going on, James not only summoned a Uber, but did it using his own account. That's incredibly kind.\n\nWhen in SF, I'll be back!", "author": "Erik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "First time I have come here! Got very impressed, specially with the decoration on the walls.\nNice place, sort of a small place to hang out with your friends and have a good time. Nice appetizers and really good service. Cool atmosphere.", "author": "Janes R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "A unique gem that's great if your up for something uniquely great and different.  A very friendly Englishman and fellow staff serve you ice cold beer and cider from a bathtub.  There is room for about 8-12 people.  Make friends, actually chat with people, imbibe and be jolly!", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "This is a tiny bar.   The owner, James, was extremely friendly. The atmosphere is outstanding.  The bar only fits about 15 people, but you get to chat with strangers who are super friendly and helpful when looking for good restaurants and bars in the area.  This is a must hit place in San Fran if you are staying in the area.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "This is what it is: a neighborhood bar that is to the point. Very few drinks available but not over priced. \n\nThe drinks are all on ice and kept cold in a bathtub. The bathroom is small. The whole place is small. You really just cannot fit a lot of people here. \n\nThe bartenders and owners are all awesome though. The owner will make men get up so women can sit down, which is so gentlemanly. They were all amazing to talk to. \n\nEveryone acts like family and friends here. I really liked it and would definitely go back if I'm ever in town. Just don't expect some amazing mixology cocktails happening here.", "author": "Janice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "A little bar with a lot of character. Visiting The Black London definitely bettered our experience in San Francisco. We enjoyed the company and got some great restaurant recommendations! Thank you and hopefully we'll be visiting again.", "author": "Mindy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "We were there a few days before St. Patrick's Day 2017 and the place was packed with lads from Roscommon, Ireland. Since I was one of only two gals in the place, I was quite happy! Plenty of Irish song and a bottle of Jameson passed round. Was a splendid night!", "author": "Michele M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Love this place.\n\nTiny, adorable, cash only (I think?), and they take barters.  Ie. if you have foreign money, a cool pin, or an old ring who knows... you might get a beer for it and they'll put it up amongst their other eclectic decor.  This place also has a lot of history and not many beers on tap regardless, the visit is for the ambiance, local flavor, and stimulating conversation with the bar keep.\n\nAll in all, I plan to visit again.  Great place to take visitors-but not too many, it is pretty small inside.", "author": "Sara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Really small bar with bartenders that have really large personalities. Lots of regulars so you might feel left out at first but James and Cassandra will make you feel right at home before you know it. Come here to get away from the regular bar scene.", "author": "Gonzalo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Lord what a wonderfully eclectic hole in the wall. It's like snuggling with strangers in a drunk shoe box but you'll love every second of it. Reasonable prices. Fantastic company from the employees to the customers. I had a wonderful time here on my visit to San Francisco and would gladly return on every trip.", "author": "Hollie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "So tiny but that's what makes this place awesome (unless you get stuck in here with 5-6 Marina douchebags )", "author": "Tauasa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Great place to go to for good company and beer! Plus, who doesn't want to say they have been to the smallest bar in San Francisco?!", "author": "Sara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Found this place right here on yelp. What a cool place. Very small but that is what I liked about it. My wife and I were in there about 10 minutes and a local regular came in and bought the place a round. Thanks Mike. We played out favorite dice game (10,000) with one of the bartenders. Thanks for kicking our ass Kim. Overall great little place to hang out. This will be a regular place for us to visit when we go to the city.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "I hadn't been here for awhile - such a charming little place with purplish soft lighting.  Their selection of beers changes according to what is in stock and in season.  Loved the bartenders, especially Kimberly!  I will be back!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-24", "description": "Drunk bartender berated a group inappropriately. Not worth it.\nHe claimed that the party had left a used tissue on the ground. Not sure what actually happened but his behavior was beyond a normal response. Won't go back.", "author": "Eli H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "This is the best bar in San Francisco. Hell it might be my favorite bar in the country. The Black Horse London Pub (or B-Ho as my friends and I call it) located in the Marina district. I first came here with my buddies (and regulars at the bar) Stefan and Stephen. I was visiting the Bay Area for WWDC and Stefan told me I had to come to this place before I left. Best advice ever. Now that I live in the city I stop there whenever I get the chance.\n\nFREQUENCY: I've been to the Black Horse more times than i can count. A lot of times I'm there once a week but on a good week it's twice.\n\nFOOD: They don't serve any. If you're hungry then stop somewhere else beforehand but make sure to come back for some drinks, you won't regret it.\n\nDRINK: The Black Horse only serves beer so if you aren't a beer fan this place might not be your favorite. But the atmosphere is amazing so read on before you decide not to go just because there's only beer. You can order a PBR for $4 (and shotgun with the bartender if you so dare) and most other beers are around ~$6. The beers are served out of a tub and the selection changes pretty regularly. The selection always seems to have a good variety of beer styles.\n\nATMOSPHERE: This is the smallest bar in SF. Honestly would believe that it's the smallest bar in the country. You are either sitting at the bar of squeezed one to two rows of people behind the bar stools. This place does not fit a lot of people. They will make you sit up for women (as they should) to sit. There's one TV but what I love about this place is the social aspect. James the owner is always there drinking with the regulars. Either he or a patron may pull out a guitar and sing later on into the night. I always meet and talk to new people here. If you aren't outgoing you might not enjoy the Black Horse because you don't really get personal space in there. There is a ton of cool memorabilia on the wall that lends to the atmosphere. Watch out, this place is so small you could walk or drive right by it without realizing. The bar does close at midnight though so make sure to watch the clock and get your drinks in. Don't worry though, there are bars around the corner to move on to.\n\nSTAFF: The staff is amazing. They are a lot of fun to drink with and won't hesitate to call you on your shit. Like I said, I've shotgunned with them, chugged with them, sang with them, and always have a great time with them. You're missing out by not meeting these people.\n\nPAYMENT: The Black Horse is cash only but there is an ATM at the corner store right next to the bar.\n\nI started with it and I'll end with it. This is the best bar in SF. The atmosphere it great, the staff is great, and the patrons are great. I've never had a bad time here and I doubt I ever will. I tell everyone they should stop by this bar at least once and give it a try. I know I'll be there again relatively soon. Most likely tonight.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "My  favor  Bar in SF.\n\nlove  visiting there with my  group. \n\ndrinks are cheap ,  music is great,   people and service is  perfect  .  i so love that place.\n\nthe place is unique   no doubt.   you must  visit to see.", "author": "Jaime J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Small, cozy, and unique. Make sure you stop by for comedy night.\n\nIt's cash only and all the beer is on ice in a old bath tub. This is truly a one-of-a-kind spot.", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "This bar. My friends and i walked a mile uphill to get to this bar. Sign outside says deli, I was a bit worried; had I looked up a sandwich shop?\nI look inside and it looks like a hallway in a house, but actually. A hallway with a bar in the middle of it. It fit about 12 people. Ladies always get a seat first. Hurray. It was still bright outside, a unique change from the usually dark can hardly see what I'm drinking bars.\nEveryone seemed to know each other. Everyone was super friendly. \nJames was a lit major. If you can guess the author or book the quote on the wall comes from, you get a free beer.\nThere's about 8 different beers, 1 beer on top, and beers from a bathtub.\nOh, and the bathroom is marked \"WC\" for water closet. \nIt was kind of awesome. Anyone can own a bar, anywhere, if you have the right attitude.\nDef one of a kind.", "author": "Trang B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "I know I'm an idiot; I have to be, don't I?  A tiny closet-sized space that only seats a half dozen people?  One beer on tap, and the rest in a damned bathtub behind the bar?\n\nYES!!!  I'm not addicted to eclectic or off-the-wall establishments, but this place is exactly what I look for in a neighborhood watering hole.\n\nLet me explain: The \"one beer\" on tap is invariably a fine craft ale that has been cask-conditioned and hard to find.  The beers in the tub are well-iced and of a great and insane variety.  The interior is as madcap a collection of conversation pieces as one could hope for, and last (but by no means least) James is just plain cool as shit.  The few other patrons that can crowd in are almost forced into conversation with one another, and James drives the whole experience like a master social conductor waving a baton made of beer.\n\nYes I know that metaphor made no sense.  \n\nJust go here before you die or you LOSE.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Stumbled on his place and loved it. If you want to feel like a local while visiting this is a good stop through for a beer.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Had some beer with a packed bar full of friendly regulars.  Helped said group of friendly regulars take out the recycling.  Watch a british man totally fail at shotgunning a PBR.  Found a well stocked library in the bathroom.  Victory.", "author": "P J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "This is probably my favorite bar in SF. My friends and I nearly always leave with a story or two. \n\nThe beer in the tub changes most days so prepare to be flexible. Ladies, if you ask nicely you might get a mug of wine if you don't fancy the brews.", "author": "Owen Conor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "We'd read reviews that this place was small, but when we approached the door I was so taken aback that I hesitated until the bartender beckoned, cheerfully shouting \"C'mon in, there's plenty of room!\" We walked in, one of the gentleman gave up a barstool for me and we ordered a bottled beer from the bathtub behind the bar.\n\nSo glad we listened. James and Cassandra, the bartenders, were amazing. They navigated the minuscule behind-the-bar space like a well-practiced waltz, chatting and playing a dice game called \"One, Four, Twenty-Four\" with locals and visitors alike. They were running a show, but not in a way that was at all unauthentic - you can tell they genuinely liked being there and enjoyed hosting people in their strange little bar. Without them, I really doubt this kind of space would work. \n\nIf you're in Marina, stop by. It's awesome.", "author": "Scarlett C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "James (the owner) is the man.  Love this joint.  All the alcohol (and by alcohol, I mean just bottled beer) is kept in a big bathtub behind the bar full of ice.\n\nIt's also probably the smallest bar in SF....I think it has only like 6 seats at the counter.\n\nBut a great place to spend time and shoot the sh$t with James.  If you ask nicely, he may pull out his guitar and sing you a little ditty.", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Awesome tiny spot with maybe 10 seats. Always a kick back easy mellow feel. Think old school San Francisco no frills beer drinking. Fellow Patons become friends fast. Just reliably lovely. Awesome bartender is such a nice change.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Effing amazing. But it's about the size of a shoebox so don't plan on bringing your bridal shower down here. The space is dominated by a bathtub which houses the evenings beer offerings and empties, and which the bartendress regularly has to scale to maneuver her way around the place. But it's effing fantastic. Love love love this place. Best pub in SF.", "author": "Gary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "I always stop in for a beer when I visit San Fran. It's tiny, tiny. Dollar bills on the wall along with other memorabilia give it a nice charm. The girl that tends the bar is friendly, as well. Will keep coming back.", "author": "James E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "By far my new favorite bar. The smallest bar in San Francisco has stolen my heart. It's a bar that makes you feel like you're just one of the gang. Relaxed atmosphere, but not a full bar. only serves beer.", "author": "Alyssa E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "So we ran into this bar wanting to take a quick shot before our bus arrived in 6 minutes. So glad we did.  First, they don't sell liquor but everyone was super welcoming and it appeared to be stand up comedy night. The lady we heard was pretty hilarious and we were able to chug an ice cold beer just in time for the bus to arrive. If we didn't have to get back to Berkeley, we would have stayed longer. So glad we happened upon this bar on our week in San Francisco. This was on a Wednesday night, btw. Not sure if they have comedy every night.", "author": "Sheela Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Excellent little pub with great staff! Best bar in San Fran!! It has to be everyones local", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "First, I've seen bigger walk in closets. This place is tiny. Second, they only serve bottles of beer. Third, they close at midnight. Forth, they have a dart board you can't use.\n\nIn spite of all this, if you're brave enough to walk in when it's empty, packed, or something in between, you get a chance to talk with some of the fantastic and friendly drunken degenerates that inhabit the black horse. Come and have a drink, play some 1-4-24, and get to know the regulars. If you're brave enough to venture in, you're likely to come back. If for no other reason than to try and win your 1-4-24 money back.\n\nSee you there!", "author": "Preston B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "If you come here and don't have a nice time, you're doing something wrong. It's about half the size of our old apartment but filled with ten times more charm, cheeriness, and good manners than our place ever had.\n\nBefore my dear friend left San Francisco, I told her she had to come with me to the smallest pub in town. She did and now, even though I didn't find her a husband, she can die with no regrets. \n\nDon't leave this world, or San Francisco, without regrets. Come to the Black Horse, make some new friends, and just imagine how cool the world would be if everyone was this polite.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "The fire code for the Black Horse London pub tops off at 22 people. Quite frankly, I think this is way high. I cannot see how to 22 people could squeeze their way into this establishment, let alone exit it safely in an emergency.\n\nThere are 12 bar stools against the bar. There is no refrigerator, just a claw footed bathtub full of ice and bottles of beer. I believe there's also one keg. I sure hope the bartender's favorite game is the floor is lava, because she was literally crawling across the bathtub to serve people.\n\nPerhaps it's a coincidence, but I'm guessing it has a lot to do with the atmosphere, the people in this bar are the friendliest around. We met a lot of amazing, outgoing, kind people in San Francisco. But nowhere else was it so easy, and so necessary, to start a conversation with a complete stranger. I got the sense that this bar has an awful lot of regulars. If I lived in San Francisco, I would be one, too.", "author": "Kate D. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Great hole in the wall full of charismatic chatty locals. It's the smallest bar in SF (a walled off alley way). Definitely worth stopping in for a few beers!", "author": "Whitney W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "The list of 10 Commandments nailed to the wall dictate something along the lines of \"Thou shalt give up your seat to a woman.\" as the first commandment. HELL-TO-THE-YESSSSS! \n\nAt last, a pub/bar that commands chivalry. Long dead in our society, it's nice to experience a bit of it in this lifetime. The bar owner is extremely friendly, and the people who come here are as well. I had been wondering why this bar was so small (it's about the size of a small hallway), so the owner enlightened me.\n\nThis had been an alleyway between two buildings, and the previous owner had been genius enough to turn this into a place of business. Boom, bang, a few decades later, and you have The Black Horse.\n\nBeer preserved in a claw-foot tub, friendly pub-goers, an owner who's so friendly, if he had one more droplet of friendliness in him, he'd implode, and an intimate ambiance that allows for actual conversation = my new favorite bar in all of SF.\n\nI like intimate bars. I like intimate bars that once upon a time, used to be an alleyway, even more.", "author": "Ellie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "An awesome must visit pub in SF!! Small but  such a hidden gem!! Only one bar counter with about 9 seats around and bar rules are if a lady walks in a gentlemen MuST give up his seat!! So sweet!! And don't get me started on the owner James!! He is such a great Host!! Gets to know everyone in his bar and gives great food advice!! So funny!!", "author": "Judy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "A great place to stop by and meet some folks. One of the friendliest bars in SF. Both James and Cassandra are wonderful folks.", "author": "Da Wei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "What a great place for a random night.\n\nI stumbled upon this place on Yelp one night when I was out alone on a work trip to SF. I stopped in for a drink and stayed for a few hours. I love the charm of this place and the welcoming nature. The bar kind of naturally selects for people willing to have a conversation with the person next to them. Also, there's a great burger place nearby that you can go and bring food back from (grab a burger for the bartender too).", "author": "Bryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "The smallest bar in the world. Period. I mean that in a good way by the way. The staff is what makes this place great. They introduce themselves and get to know you by name. \n\nWhen I was visiting San Fran, I wanted to get a couple of drinks before I went back home. Looked this place up and saw that they had some good reviews but didn't look at the pictures on how small it was hahaha. Walked in and people were playing a card game and invited us in to play. Awesome. \n\nThey only have bottle beer, but a good variety. No food. Cash only. \n\nWish they had some beers on tap and would accept credit cards.", "author": "Hugo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Great experience after having my farewell dinner. We actually just wanted to grab one beer but a couple hours/beers later we were still in there. \nGood variety of beers. I am from Germany so I know what I am talking about! :p\nFriendly barkeeper with lots of knowledge about beer but please give her some sleep. This 5-hour energy stuff is not the way to go.....\nCool drinking games and nice ambiance thanks to the small size of the place...\n\nBottom line: Ill def. come back as soon as I am back in town", "author": "Daniel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Was in town and staying down the street. Decided to have a drink at the first bar we found and are so glad we found this place. Discovered a coffee stout that was fantastic AND it was movie night! Score! Mars Attacks came with a drinking game and six new friends! Perfect Tuesday evening!", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "Why 5 stars?  Because I felt like I was amongst nothing but bff's.\n\n   ---   ---   ---\n\nYelp, you sonofabee.  After walking around San Francisco by myself for a couple of days, I found my way to BHLP.  Upon entering the threshold of the door way, I completely forgot that I was alone in the city and felt like a super regular at the local pub.  I was greeted and treated so warmly while I was there, I am still kind of amazed by it.  As I walked in, everything kind of stopped and everyone seemed to turn their attention to chatting with me.  That makes me sound like a narcissistic blow hard, but who doesn't like that kind of treatment when you're riding solo?\n\nIt is as small as others have pointed out.  Including the bathrooms, I don't know if they could fit 25 people in there, personal space be damned.  I feel like that kind intimacy adds to the charm.\n\nI asked about the 1-4-24 game that I read about, and was once again, they seemed to be at my service and dropped everything to bust the game out for me.  It's a really fun and addicting game that's perfect for the bar.  I recommend you all check out Black Horse for the rules and explanations.  I'm sure you can google it, but why not add some adventure into your life and check out the ole' pub and learn about the way people used to before the internet?\n\nI had some good beer while I was there as well.  I wish I could remember what they were, but nay.  The selection was definitely quality over quantity.  I'll be back during my next visit to SF.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "If I had only had more than 30 minutes in this perfect bar. That would be my one wish before dying. I love this pub and will definitely return - knowing how to play 1-4-24 next time. But don't go when you visit... it's a perfect local gem. Never change, Black Horse.", "author": "Greg K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "This is an awesome pub in San francisco. A friend of mine and I wanted to checkout Marina bars, and kind of stumbled into this place (Thanks Yelp :). This place is so intimate and super friendly. Had super conversations with the Bartender who also was supposedly a great baker and treated her with superb treats. Beer selection was good, but the coziness and friendly atmosphere beats everything else :) This place is a must visit if you're visiting the city.", "author": "Shriram R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "What an absolute beauty! \n\nThis is one of the smallest bars I've ever been in - but boy is it worth squishing up.\n\nBeers are cheap and served from a bath tub filled with ice! You could be excused for thinking you're at a friends housewarming - if they moved into a 40sqm apartment.\n\nThe size of the bar gives it a great ambience - it almost feels like everyone knows each other.\n\nHaving arrived without local currency, we were given free beers by the owner, after donating some foreign currency to the wall (there is a space on the wall covered in foreign currency - I donated South African Rands and Mozambiquean mets). \n\nOur second round of beers were paid for by one of the friendly patrons who couldn't cope with the idea of us leaving as a result of our non cash carrying habits.\n\nThe only devastation was the bar closing at 12 on a weeknight \n\nGreat spot - worth checking out, especially if you live in the area.", "author": "Peet K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-13", "description": "This bar is super small. No joke, the max capacity is no more than 10 people. That's cool but, beyond that, there's not much to love.\n\nMost importantly, it's not a \"dive\" because it's not exactly cheap. The bottled beers (served from a tub) are $5 or $6 and there are no brews on tap. This upsets me.\n\nAlso, the service is a little strange. The bartender said \"I don't know you\" when we walked in. Typically I like this sort of sass but it wasn't delivered properly. She then told us about her parent's marital problems. Girl, I don't need to hear this, I'm just trying to get my drink on!\n\nAnyway, the size is fun but everything else is below average.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "This is one of those places that's so unique and off the radar that you really feel like you've discovered something special by stumbling in here.\n\nThe bar is incredibly small, the smallest in San Francisco I've been told. The $5 beers they serve, out of a bath tub behind the counter mind you, have varied every time I've been here. The oddest thing about this place is that there's a dartboard on one of the walls, which I'm sure has never been used due to the risk of impaling a patron given you'd have to throw right above people's heads.\n\nThe thing that makes this really special is that because of intimate size, you inevitably end up becoming friends with the people sitting next to you and the bartender by the end of the night. They also have a no cell phone rule that's really refreshing given how much of a distraction that can be on the here and now.\n\nIf you're in the neighborhood you should also head down to Black Magic Voodoo Lounge and stretch out a bit.", "author": "Madhu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "What a great experience...not sure words can describe. It reminds me of times in my past where you don't need to talk on your phone or be distracted by the daily chaos of life. Enjoy a conversation or a quiet moment while having a beer served out of a bath tub  (nothing else is served) James was great.....enough said...", "author": "Tim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Best pub in town.  Owner is charming and invites customers to play games with dice.  Rules are women sit, while men stand.  It's the tiniest bar in SF, but the best imho.", "author": "Molly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Being a freak about all things London, I had to stop in this adorable pub on the way home one night. It's very small but that adds to the ambiance. The pubs in London are fairly small and are there for beer and beer only!  If they happen to have food, it's usually marginal. This was a great place to grab a brew and enjoy an hour after work!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Great beer selection, great employees. Love coming here with my sister when I go up and visit the bay", "author": "Sam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "We heard this bar was pet friendly, so of course we had to give it a try! It is very tiny. Maybe there are 8 barstools in the whole place and it's a cash only bar. But it has a lot of character and they allowed us to bring our dog in so we couldn't have asked for more. They had a nice variety of beers. Not your standard Heineken or Budweiser which is a nice change. They're only five bucks too. There are a couple of TVs and it was a neat diversified crown of neighborhood locals. If we are in the neighborhood or at the nearby dog park and craving a beer, we will definitely choose the black horse!", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Didn't check the pictures of the place before coming so we were kind of surprised to find out that the bar is the size of a college dorm room. Nonetheless, this place is a great spot to grab an afternoon beer and watch the Giants play. The bartender was really nice and we chatted about all the different people who stroll on through the bar. They have quite a collection of international dollar bills so be sure to bring something cool to add to the wall!", "author": "Derek L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Simply the best bar in the entire city.  Some of the most memorable nights of my life have been here...from walking into a U2/Oasis singalong at 2am on NYE, or when the whole bar sat riveted watching \"Piranha\" together.  But the best part of the bar is simple: the diverse crowd and James/Cassandra, the oddest best friends you'll ever meet.  Not a trendy scene, not an amazing selection of alcohol, just an endearingly quirky true \"neighbors\" bar with an interesting mix of very squished people.  A true SF treasure.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "This is a tiny bar with great service and every time I've gone in I have had great conversations and it's super friendly.  I bring all my friends there!", "author": "W. Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "This is not only the smallest bar in SF but the friendliest! James and Kim were so nice! We were there celebrating our birthdays and they made us feel so welcome. The locals were very friendly, too.  We ended up buying the whole bar a round (it is the smallest bar after all)!! We will definitely go back!", "author": "Janell G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "My wife and I visited the Black Horse on our honeymoon in 2010....and its taken me this long to write a review...we visited other restaurants and bars through out San Fransisco but we ended up at the \"Deli\"every night.\n\nIt's everything everyone says, smaller than small..but you walk in and James the barkeep  introduces you to everyone, and its like going to a party with your best friends.\nBeer is served out of a bathtub, and you can gamble on a dice game at the bar.....If  your looking for a nice piano bar with elegant decor..then keep looking...if you like some good beer guzzeling with great fun people..look no further.\n\nI've been to countless pubs and bars all over the world....and so far... this place is my No # 1. favorite....", "author": "R. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "James and Cassandra are both uniquely amazing in their own right! I loved the welcoming vibe in this tiny, overcrowded bar that serves a delicious rotating selection of bottled beers beautifully chilled in a bathtub behind the bar. The first night I visited I was reluctant to go in being so packed and standing room only but the regulars truly respect the rules--men are expected give or at least offer their chair to a lady. Chivalry is nice...especially when \"dems da rules\" :) and you've been walking all day! I wish they were in the LBC, because I love it hear that much! Come on into the BLACK HORSE LONDON PUB, you will have a great time... Oh and bring that stash of Cash!!! $", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "My Local Pub! it's small and I like it! \nGreat service, Great people!", "author": "Phil L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "James is friendly and hospitable.  Cassandra is a consummate professional and an A+ hoopsta.  The beer is quality.  And the customers are quirky and fun.  Shame on me for not stopping in more often.  New-leaf time.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "My friend and I were walking around the Marina looking for a good spot and decided to check this place out.  It was smaller than I thought it would be, but that's actually one of the best parts!  Everyone is friendly, and I've met a lot of great people here. They are cash and beer only, but that works for me!  I live near the ballpark so it's a little bit of a trek, but it's worth it!  Awesome place.", "author": "Ian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Went here last night and had a margarita that was on par, wish I had another and glass could have used on salt. Place is small and people are great. James made sure he makes you feel at home. My only complaint is that its small.", "author": "Oliver G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-26", "description": "I'm tempted to give is a low rating to keep the crowds away - because the place can't hold them.  The only reason I don't give the Black Horse 5 stars is because it is not for everyone - as evidenced by the occasional bad rating (though I can't figure out how someone who has never been inside has the nerve to rate a place).  Small, cozy, tiny, or any other similar adjective will barely fit in the door.  When we lived in the area, this was a regular stop for us.  Now that we live out in \"San Ramote\", we only get here about once a month.  It is well worth the stop when we are in the City.\n\nJames (the owner) is great and the place is friendly.  The beer selection is as small as the pub, but high quality.  There is usually a Chimay or two on the list, another beer from Germany, Austria, or other beer making country.  Sometimes he has another selection such as a hard cider on the list.  There is also a cask ale on tap, something you should at least try (not carbonated, solid taste).  And he has the proper glassware for each type of beer.  Chimay should not be consumed out of your standard wedge shaped pint glass that most places use.\n\nThe cheese plates are top notch.  Yes, they are served on paper plates - but you don't eat the plate.  For your money you will get two high quality cheeses (love the English Cheddar), a tasty meat (usually salami), some great bread, a healthy serving of chutney, some onions, and a sliced apple.  Order the large plate and share, you may meet a new acquaintance.\n\nIf you want wine, go to Amalie or The Wine Bar on Polk.  If you want hard liquor, go back up Union street to any number of places.  If you are looking for a place to be seen by the in crowd, go to Vessal. But if you want a friendly place where you can hang and have a conversation while sipping some quality beer, this is your place.  Stop here on the way to the other places, you may never make it to where you were originally going.\n\nSo Dee C., next time you walk by why don't you pop in.  You might actually meet some real people and have fun talking to them.  And given that you are female, you will always get a seat.  But don't use your cell phone or you will be asked to leave.\n\nXMAS 07 UPDATE:\nWent there twice over the holidays.  Good time had by all.  On Christmas Day James served his special Glog - very yummy.  We met 3 Kiwi's, a Texan cowboy, and several other new friends.  Gave James a framed print of his place (uploaded here).  It's now hanging on the wall behind the bar.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-06", "description": "The Chinese calendar has designated 2010 as the Year of the Tiny. Hence therefore twice removed, The Black Horse has been deemed bar of the year.\n\nIf my room at the Harbor Court is a womb, then the Horse is the birth canal. Seven seats at a bar that's a Fat Albert away from the frame-adorned walls. Bottled beer ($5-8, cash only) served from an ice-filled bathtub in which you'd expect to wake up, sans kidney. Tips in a hanging pitcher and a corkboard loaded with tacked-on foreign currency, just because.\n\nThe one TV on high is useless, as your face will be in the back of the head of the guy who's standing in front of you, just as the party-back of your mullet is filling the nostrils of the man standing behind you. Rest assured, assuming you're male, you will be standing. The first of ten Rules of the Bar mandate sacrificing your stool to any lady in an act of shotgun chivalry. The rules are enforced, much to the chagrin of two goobers who didn't want to move. Sorry Charlie!\n\nIt's here I learned of a magnificent dice game called 1-4-24. And because you learn the rules when you manwich your way to your first beer at the Horse, I'll spare you the details.\n\nGo, drink, be born again.", "author": "Damien S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-09", "description": "I've been to some small towns in my time. Places where your next door neighbor and the guy on the other side of town are the same person. Some would call it cozy or quaint, others claustrophobic.\n\nThe Black Horse is unapologetically small. Its smallness is its greatest feature. Not that it doesn't have anything else going for it. The décor--mostly football memorabilia (soccer to us yanks)--is tacked up with no real organization or explanation. There's also a large flat screen TV that inexplicably played a poker tournament on mute the night I visited. Who cares? There's also a corkboard with small denomination bills from all over the world pinned to it.\n\nLike a small town, you get to know your neighbor. It's kind of unavoidable when you're so packed in that you're rubbing your goods and services against them all night long, and vice-versa. By the end of the night, you'll know what kind of cell phone everyone has in their pocket.\n\nJust like in those great small towns that cover the country, there are unwritten rules to obey at the Black Horse. The greatest of these, is that women have preference on the bar stools. When a lady comes in, she gets the stool. No questions asked.\n\nDrinks were nothing fancy. It's bottled beer + and cash only, at that. But it's all about community. And whether you're pressing the flesh with the guy next to you, or playing a spirited game of 1-4-24, it's definitely about the crowd (and being crowded) at The Black Horse.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "If there's ever been a place to get to know a stranger, it's the black horse. Smallest bar west of the Mississippi, the owner proclaims, with about nine barstools, you're going to be cozy. It's a place to meet and make friends, the regulars are all warm and welcoming, they'll rope you into having a beer (....or 4) more than you signed up for but you'll go home a happier person for all the good times and quality conversations you have shared. Fantastic staff, unique beer selection, absolutely fabulous. All my love to the Horse!", "author": "Hunter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "Double midnight! \n\nBesides the extra-small interior that everyone has already mentioned, the one thing that sticks out in my mind about Black Horse is the crazy dice game that's played on the tiny counter space within. Don't ask me how it's played, 'cause I'm slow to catch on and even slower to remember, but it has something to do with 1's and 4's and the number 22. And I'm not a bettin' woman, so you're just going to have to go there and see for yourself!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "I stopped into The Black Horse not knowing that it's the size of a shoebox (my brother and I were on our way to a fancy steak dinner). No matter, though; the crowd was super-friendly and respectful -- a necessary feature when every two minutes someone has to slide out of the way to make room for someone else. Making conversation with other folks seems almost expected; the bartenders and other patrons chatted both me and my brother up within a few minutes of entering. A fun experience overall.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-10", "description": "The Black Horse would be my favorite bar ever if only they'd throw some sparkling splits in their bathtub of beer. Don't get me wrong I enjoy delicious beer, but I can literally drink about two in one sitting before I become full and truthfully I want to stay here longer than that. Perhaps someone from the Black Horse is reading this and is willing to put Sophia in their menu rotation? It's the can of sparkling wine that comes with its own sipping straw like a juice box and I think it would fit right into your eclectic selection and the ladies that you are so kind to already would love it.\n\nAh hell, who am I kidding really? The Black Horse is pretty much my favorite bar even with just the beer because it's just that awesome. It can hold maybe 16 people at once and there are people spilling out onto the sidewalks. It's crowded, but no one is pushy. It's the opposite in fact; everyone is friendly and trying to figure out how they can help you get in to get a beer. Plus they are very kind to ladies with rules about letting ladies have the seats at the bar and that guys have to stand. I like this show of chivalry.\n\nAnd once you're sitting down (or standing up if you're a boy) you can engage in a game of 1, 4, 24 for $1. It involves dice and rolling certain numbers, but that's all I'll say - you have to learn for yourself if you ever make it there.\n\nI think what I'm trying to say here is Black Horse, I heart you.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "a nice place, all friendly ppl! last year before i drive to LV for ces, I was so happy to meet some guys here!", "author": "Huang C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "Neat little bar with a friendly atmosphere.  Within minutes you will know everyone and talk to each other like you were neighbors or friends.  Conversation was constant and topics ever changing.  It was interesting.  Beer was a little more than other places and I figure since it is such a small bar and can only serve a certain amount of people, one way to at least make a profit is to charge a little more. \n\n It would've been four stars but It appears that they do allow smoking inside here which made me take away a star.  If this place was bigger I seriously wouldn't have minded at all.  but when someone is next to you smoking in such a TINY area there is no escaping it.  Seriously, if I started farting and it stunk up the room would everyone be fine with it? (Maybe some guys would be amused)  Or would at least the ladies be offended if I sat next to them and pass a little gas.  Well that is how smoking next to me is.  Just my opinion.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-06", "description": "If there was one place in San Fran that I wish I could shrink down, put in my pocket and take to Cleveland, it would be Black Horse.\n\nStrangely enough, I wouldn't actually have to make it much smaller than it already is to be able to carry it with me. And trust me, I'm a pretty small lady. This bar is literally the size of a long closet and is actually THE tiniest pub in California... possibly even the entire United States. \n\nThis little spot consists of a small bar with maybe 10 stools and enough space for one person to fit behind you. Not an over exaggeration. Behind the bar there really isn't much more room to work with, which might be why the beers are stored in an old bathtub filled with ice. I don't even think you could fit commercial sized coolers in here. \n\nBlack Horse is a cash only bar with about 8 tasty beers to choose from. That's it. There are a couple of rules that you have to follow here as well. For one, no cell phone use in the bar. I find this to be a relief in such a small space. Also, it's just kind of rude, but hey... whatev. I like it. Second, ladies always get the bar stools. What an amazingly refreshing idea! A bar that instills manners and chivalry? WOW. I'm thoroughly impressed!\n\nThe sense of community and family in this little bar is intense. I mean, talk about regulars. These people call talk about this joint like it's theirs... like they own the place. I love that. Besides, if you're going to stand that close to one another and drink, it's probably hard not to be like family. Plus you get built-in entertainment with a house dice game called 24. Pretty much everyone pitches in a dollar to the pot to play and it actually gets pretty intense (in a nice way). I'm definitely bringing this game back to Cleveland. \n\nOh, and I saved the best part for last. I was sitting at this tiny bar, enjoying the close-knit feeling, sipping on a delish cider and wondering why I felt so at home. Welp, turns out the owner is actually from Cleveland! Ahhhhhh, a little taste of CLE all the way out in Cali. Priceless.", "author": "Cara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Haha, I seem to run back and forth from Black Magic Voodoo Lounge to this place!", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "This is by far the smallest bar I've ever been to. Its not the size of the ship it's the motion of the ocean and in terms of coolness the Black Horse popped several Viagras. \n\nThe max capacity is about 20 people, and they only serve beer and wine that is kept cold via bathtub behind the bar. It really kind of resembles a college dorm room converted into a saloon. \n\nThe greatest part about hanging here is the fact that you get to know everyone in the place. You can't help, but strike up a conversation when sitting inches from the next barfly. \n\nThe bartender (I'm assuming owner) is super chill and will play dice with the patrons, but watch out he's got a hot hand. \n\nCertainly not the type of place to hit up if you want to rage against the machine, but if a chill couple of beers is your tone for the night this place is right up your alley.", "author": "Danny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "You have to have a bar. And you have to have only one. If I would live in SF there is a good chance it would be the Black Horse. Only a few people fit in but it worth to squeeze in.  European beers served from a bathtub by the friendly saff. Some patroons were challenging each other with bar tricks. I will be visit again for sure.", "author": "György M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "This is bar is like drinking in your best friends' basement when his parents are out of town for the weekend and his alcoholic father forget to lock up his good beer. What? Don't look at me like that. I know I can't be the only one who had this experience growing up. Words won't prepare you for how small this place is. You wouldn't believe me, so I won't belabor the point. Suffice it to say, it's small. Real small. But that's the appeal.\n\nThere are all sorts of domestic and imported beers. While there, I drank an Australian beer (IPA; light) and some Eastern European beer (Czech? I can't remember; it was dark in color like a stout but it wasn't as heavy as a stout). Wow. I am overwhelmed by the usefulness of this review. Apologies. In any case, the beers are all in a bathtub full of ice behind the bar. Awesome. The owner/barkeep can give you great details about all the brews, but still. Bathtub. Full of ice. Win.\n\nSpending an hour and a half or so here made me feel like a bona fide San Franciscan. It was a terrific re-introduction to the city by the bay. I didn't see a Black Horse. I might have seen a cherry tree. Woo hoo. I definitely saw a Londoner. And, I was in a pub. So, I guess the name of the bar makes sense -- which is more than I am doing now. What am I saying? Uh, come here to drink beer out of bathtub and battle claustrophobia. A word of warning, though: resist the urge to do anything concerning the numbers 1, 4 and 6. Don't ask why or what, just resist. Trust me. My wallet is thinner for having stared into that abyss.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "I have never been in a bar like this. After wandering around Union Street for a while, my husband and I wanted to get off our feet and relax with a beer. When we walked in and saw how tiny it was, and how there seemed to be no seats available, we almost left. But we were coaxed in an almost surrealistic way, \"Come in, come in, there's always room.\" Two people gave up their seats for us, which we felt bad accepting... but then after more people came in, we learned that that's the tradition: give up your seat for new people entering (especially women, which as a women made me feel slightly uncomfortable). Everyone seemed like good friends, but after being invited into the conversations, we found that most people had only met there. We stayed for 1-2 hours, talked to so many different people (including the bartender, who was amazingly nice), and had so much fun. Seriously - we're living in the Mission right now and are considering a move next year to a different part of the city, and the location of Black Horse London Pub may affect our decision. Best bar experience ever.\n\n(Btw, I noticed other reviewers saying claustrophobics shouldn't come here... I am claustrophobic and did freak out slightly when I saw the place. But I made sure to sit close to the door and was perfectly fine. Although, I was there on a Saturday afternoon and not an evening, so I don't know how crowded it gets later on. When I was there, all seats were filled with about 3 people standing).", "author": "Tessa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-06", "description": "Stopped in here for the novelty of it being the smallest bar.  The beer price was not as small though.  For you non smokers beware, they sometimes smoke inside.  And the place is so tiny, the smoke does not disperse by the time it reaches you.  \n\nEveryone is extremely friendly here.  So do not hang out here if you dont wanna conversate and be left alone with your drink.  Come here when you need people to talk to because you will definitely find someone to yap your heart out to.", "author": "Kat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "Tiny bar, but lots of fun and good beer.", "author": "T S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "What a delight! Do not hesitate stopping by, just a sincere pleasure with the bartender and owner!", "author": "Brendan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "My new buddy Patrick said it best, \" my favorite bar because you have no choice except to meet the people around you.\" The smallest, coolest bar.  James is a great owner. We loved the tight quarters, the bathtub full of beer, the food menu (strip of bacon and cheese plate), and everything else", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-14", "description": "Things that are larger than the Black Horse:\n\n-A '68 VW Bug\n-Verne Troyer's trouser snake\n-An iPod Nano\n-The amount of words in Jay Cutler's vocabulary besides \"you know.\" http://www.youtube.com/watch?v=L9WCPxDYBjg\n-The dollar amount currently resting in my bank account ($3.77)\n-A stapler \n-15 adult midgets in a hot tub\n-This dog http://www.youtube.com/watch?v=LmN_m7F9C7Y\n-George W. Bush's 19% approval rating in 2008\n\nHopefully by now, you have an idea of what I'm talking about. The Black Horse is officially the smallest bar on the West Coast, and the owner suspects it's actually the \"Smallest bar west of the Mississippi.\" That term gets tossed around with more regularity than a Tiger Woods one night stand, but in this instance, I think it could be accurate. At capacity, the joint holds 22 people, and according to James, the owner of Black Horse, the most they've ever had inside at any given point was 25. That may sound like an extremely small amount of people, but to call this place diminutive is an understatement.\n\nIt's been said previously, but if you're a shut-in who hates people, it'd be a smart move to avoid this place at all costs. Due to the lack of square footage and available seating, you're forced to become BFFs with the other bar patrons real fast. For those lonely nights when a dark corner and a stiff drink are the only thing that'll suffice, go elsewhere - trust me.\n\nThey only serve beer (out of a bath tub) and they enforce their bar rules with the heavy hand of a supreme court judge. By no means will you be sentenced to execution for violating the laws of this itty-bitty London Pub, but you'll be politely asked to avoid using your cell phone and you'll have to prove that chivalry is not dead by vacating your seat if women outnumber men inside the bar. So if you're the kind of guy that has no manners, and you can't resist checking Twitter from your Crackberry for more than 15 minutes at a time, you might be better off trekking a few more blocks to get tipsy in the Marina. As guilty as I might be in regards to being a slave to my iPhone, it's a relief to suspend day-to-day activities and reliance on technology to enjoy a few good brews with strangers (A.K.A., friends you just haven't met yet), in a truly remarkable setting.\n\nIf you're checking out the place for the first time, like any bar in the city, do your best to venture out on a weekday. Weekends can be an absolute disaster, and this isn't the kind of place that has a high turnover rate for bar goers. Once folks get comfy, they're usually in for the long haul.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "Great place to have a cold beer that was chilled in a bathtub behind the bar. The hostess/bartender/waitress is a sweetheart. Warm feeling in the pub-style closet. \n\nLast night they had bacon-wrapped hot dogs, green flash beer, and playoff baseball on the TV. I was a happy man. \n\nSimple place, good people, cold beer. I'll be back.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Great place to catch the Browns play or to just hang out with friends. My friends and I consider this place a standard for any Sunday NFL watching.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Awesome little Bar, not your typical place.  Go here for the experience and the great service.  I went here with a few friends, which our group took up most of the seats in this place.  They did only have 5 choices of beer, but its probably the smallest bar you will ever go to.  The bartender was so awesome, really engaged in conversation with you, but not forgetting to keep the beers coming if you want them.  I highly recommend to go check out this little gem, like I said, not for the beer, but for the experience.", "author": "Brandon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-28", "description": "As I walked into this itsy, bitsy, tiny pub, I was greeted by James. I introduced myself and for the remainder of the night, he addressed me by my name, which was cool. \n\nThe place was packed, so all the seats were occupied. The pub has a rule about occupying seats. If the pub is packed and you are a male with a seat, you must sacrifice your seat to a standing female, which is cool. I don't mine giving up my seat to an attractive female...hehe.\n\nThe beer was good. I forgot which one I had, but it was $7; most expensive beer available in the pub.\n\nOverall, the pub was an okay experience. I would go back again, but next time I would avoid the Yatzee games that goes around the pub as I witnessed some shady stuff with the payout and just enjoy the beer.\n\nCheers!", "author": "Suefow S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Become a regular who moves away to have your 4th grade picture hung on the wall. Otherwise make sure you're in before midnight otherwise the deli master has to lock up shop.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-25", "description": "Cool, intimate, beer pub with laid back people sipping on great beers kept on ice in a bathtub behind the tiny bar! \n\nThey have a \"no cell phone allowed\" rule which is awesome because it keeps out the annoying Marina Douch-a-b@gs talking nonstop on their phone.\n\nOwner, James, is awesome. He's debonair, tells sensational stories and andhe's the epitome of gravitas. I heard he once owned a bar in Aspen.\n\nI'm a girl and had a huge crush on the female bartender. I go back just to watch her take  caps off of bottles. Soooo sexy!", "author": "Taylor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "We ended up here as tourists looking to watch the sunset, and I found this bar on yelp. Very tiny bar with a lot of character, and the owner and regulars were very nice. They serve Dogfish head 90 min IPA which was a surprise bc this is a delaware beer. There is a claw foot bathtub behind the bar as the ice chest. Lots of character. Good time!", "author": "Julie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Legitimately, may be my favorite bar of all time. The experience is just so unique yet 100% authentic that you cannot help but loving it. I was in SF for work, asked yelp where to go and it sent me here. James, the owner, is a riot and welcomed me to his bar with shots of Jameson from the bottle he brought in (nothing besides beer is sold). Then the bartender bought pizza for the bar and I won $40 in a dice game. \n\nThis is the no BS bar you have been looking for that is full of great people and is sans posers. Actually, it's more of a social club than a bar because everybody in there knew each other except me. \n\nCannot recommend this place more!", "author": "Brian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-11", "description": "Chill bar, visiting from So. cal Friendly atmosphere..", "author": "Eric J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Adorbs! Cute little spot with interesting selection of beers stored in a giant bathtub. Not my favorite beers but def a fun pub to stop in.", "author": "Cec D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "Great little bar owned by James. He is a genuine entertainer and good guy. Beer selection is in a bath tub behind the bar, so that's it, but they have good beers for $5 per bottle. The bar is so small that you'll start talking to people because they are that close, but thats what makes it a cool bar!!!", "author": "Sylvia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "This is a true hole in the wall - I'm guessing it's the smallest pub in SF.  Driven by plenty times - finally made it in one afternoon before it was full.  The bartender was very friendly - there was one draft and he didn't think it was something we may like but hubby and I both liked it.  With that, it was an extremely generous pour...more than a pint and we even got a small refill.  While there, we met a couple regulars and a visiting Brit who truly enjoyed a home away from home.\n\nOther bottled beers are stored in an old bathtub w/ ice - it's like a frat house party but cooler.\n\nGood times...", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Let's get one thing straight. If you don't like what you read about this place, do not bother coming. As a regular at this spot, this is a breathe of fresh air in the neighborhood.\n\nBasics:\n1. James is the soul of the bar. Cassandra is his partner in crime.\n2. Bar closes at 12midnight. Best time to arrive is around 10:30pm and join the bar in a crawl to Black Magic Voodoo Lounge or Shanghai Kelly's.\n3. Only beer served (from a bathtub). Options change on a rolling basis. Expect $5 a beer so I recommend coming a bit buzzed.\n4. Women get chairs. Most nights are standing room only. Get to know the people around you.\n5. No talking on your cell phone. Period.\n\nLove this place. Could be the only redeemable bar left on Union Street. Great spot to roll up with a girl as the place is one of a kind.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "This is a great place to post up before or after a meal. As others have said, you have no choice but to socialize and meet everyone else in the bar. Fine selection of beers served straight from the tub.", "author": "Laura N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Very intimate and great ace to visit Johnny is a great and wonderful bartender.  It's a place to visit for sure. I will come back again....", "author": "Lettisha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "In town for a few days to meet friends, figured we'd go drink somewhere local.  \n\nFirst reaction walking up to the Black Horse was - is this it?  Yeah its a narrow shop front - with folk sitting in the doorway.  Says Deli outside - ignore that...\n\nThe place is small - really small - very limited seating - about 6 or 7 seats, rest is standing room only.  There's definitely a blink moment when you walk in.\n\nWe walked in to a rousing chorus of Loving Feeling - whole/almost-full bar singing (yeah all ten of 'em).  This place is Intense - everyone quickly becomes neighbours/friends, you have no choice.  Also the bar staff are super friendly, its like Cheers, just much better!\n\nThe food was a communal plate of Doritos - this place is for beer and great company.  As noted elsewhere the beer is kept cool in a bath-tub of ice behind the bar - nothing on tap.  Decent beers in the tub - drank Chimay Blanche - notable Argie IPA also in there.\n\nCome here again?  Definitely...", "author": "Steve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "Wow, I never thought I'd enjoy a tiny tiny bar where I couldn't even get a seat. I did. I had a blast here. The people who work there are fantastic and so are the customers. Its a friendly little joint that reminds me of some of the tiny pubs I'd visit in Ireland. Nothing but good memories of my first visit. I look forward to my next.", "author": "Rich M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "Tiny. Great beer, too. (Loves me some Anchor Summer!) The beer? It's in a bathtub behind the bar. Is that even legal? (And honestly... does anyone even care in San Fransisco?)\n\nProbably not. \n\nBut who effing gives a rat's butt? I like beer, and I also enjoy things that challenge the size ratio. Black Horse does both of these things: beer and tiny. Seven seats, as others have mentioned, and also, the bartender was very nice. She gave me a piece of her pistachio cherry blondie bar, which I happily ate, as I was at that point drinking on a very empty stomach. Also, the house rule? Ladies sit, and dudes give up their seats. (Whaaa? Dang...chivalry lives! And if not, you're pretty much forced out, so take that, dudes.)  \n\nTiny bathroom, tiny bar, big ol' bathtub full of beer -- not gin! -- and a great honest little place. Hearts.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "One of the coolest bars I've ever visited.  It's small, simple and a great place to hang out.  Everyone in there is getting along and having a good time.  Their beer selection is simple, delicious and rotates.  The owner, James, and his sexy bartender are very good at their jobs.  This is a place you HAVE to hit up while in San Francisco.", "author": "Frank G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-01", "description": "What an awesome place. \n\nYes it's tiny, and yes the beers are kinda pricey. But all of this doesn't matter when we followed an elderly gentleman in to the pub and he bought us a round of beers. Just like that! It was my first time coming here and I didn't know exactly where it was located. \n\nThe people are friendly and entertaining. You can hear all kinds of stories and from different perspectives. The patrons and the bartender welcomes everyone who has a good attitude. \n\nIt's a nice place to just grab a beer and soak in the characters who live in sf.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "My husband and I rented an apartment on Van Ness when I was coming to San Fran to photograph a wedding. I am from Canada, but my family lived in San Fran for a long while before I was born, and I've been back a number of times with them. I was so eager to explore the city on my own and had a list a mile long of things my family said I should see and do. \n\nWell, then I found the Black Horse London Pub and the majority of those plans got put on hold. I was yelping around our apartment and it popped up with some intruiging reviews. We walked by and it was empty. My husband, who is also Canadian but from a fairly British family line, was quickly enamoured by this tiny hole-in-the-wall pub that actually seemed, well, like a pub. (None of this So-And-So's Public Eatery crap for him). \n\nWe did it. We walked it. Immediately James treated us like family and not for one second did we feel like everyone knew we were tourists. James, the owner, learned our names off the bat and him and the female bartender introduced us to everyone who came through the door. We stayed until closing playing the dice game and watching soccer and even went out with James and some of the more die-hard regulars after closing. \n\nSO all our plans for big dinners out turned in to ordering pizza to this bar. We loved it. I would live in it if I could. As you've probably already read, the beer is in a bathtub and James picks up more as it starts to run out. James also makes food as needed for people to enjoy. And he had a good laugh when I though he put out peanut butter and crackers and ended up with a mouthful of mustard. It seats maybe 8 and perhaps another 10 standing, which just adds to the already huge amounts of charm. It's perfect. \n\nThey will take you in and welcome you like you've probably never been welcomed. And I am from Canadian - by and far considered to be uber polite - and I was blown away by the hospitality. \n\nJames - we don't stop telling people about your pub. We loved San Fransisco too, but the greatest discovery was your pub. We will be back as soon as we can.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "We found this little pub tonight after searching for local pubs nearby out hotel. We were thoroughly impressed. As soon as we walked in we felt like we were home. The atmosphere is perfect for tourists. You walk in off the street and you are welcomed with open arms. The staff go above and beyond. Good drinks. Cheap drinks. Friendly chats with the regulars make this place worth going to every night. We can't wait to go back.", "author": "Tegan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "Don't come with more than 4 friends, you'll break the max capacity limit! Great pub with great fare and friendly staff. \nor\nLike \"Cheers\" but smaller...", "author": "C. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "The interior dimensions of this pub are 7.5 feet wide x 23 feet long! This implies an extra layer of cosiness to everything that guarantees a memorable experience capped off with a most endearing owner. Cheap bottled beer plucked from an ice laden bath tub must surely rank as one of those only in the twilight zone experiences as you rub shoulders with the masses and gaze around at the flotsam and jetsam adorning the walls. Lots of pleasant chit-chat amongst the ever changing every type of age audience combined with the occasional guffaw at the tinted glass Google Bus stopping right outside to deposit hordes of millenials who as legend has it have never stopped in for a quick one!", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "If you are in San Francisco there is no reason why you shouldn't go to this bar.\n\nThis is old school before Mixologist came and ruined my dining experience by giving me a funny look when all I asked for was a Jack and Coke.\n\nNo I don't want your award winning Sapphire Rose Martini that you concocted while the rest of the world was actually doing something that matters.\n\nSo if you like Old School bars with rules that society forgot and should remember...well...this is the place for you.", "author": "Cliff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-06", "description": "I may have peaked.  The Black Horse may be one of the coolest bars I and only ten other people have squeezed themselves into.\n\nTo call this place a hole in the wall would make people think that a hole is bigger than it really, really is. The fact that it is only 250sq feet big is in total adds to the charm of this bar that insists on no cellphones, cash-only and stools reserved for the ladies only. \n\nPeople who aren't fans of bumping up against strangers should probably stay away.   You'll end up talking to people, while having your personal space zone invaded like no other time in your life.  The prices are great, the bartenders are fantastic and you'll have a wonderous time. Just make sure you brush your teeth.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "So to be honest, I only came here because I thought this Pub had a pretty cool name. \nA few friends and I were brainstorming the other day of Pubs around the city we havnt been to. When someone proposed the Black Horse, we all agreed - saying that the name sounded pretty cool.\n\nThe first thing you notice when your there is how small the venue is. Most of the people there were standing, and if your lucky enough to find a seat, you HAVE (its their bar rule) to give it to a lady. \nAnother one of their rules is that you cant be on your phone (talk/test) in the bar, which is a freaking awesome rule! It forces your to socialize and not be anti-social and buried in your texting world. \n\nDespite the venue being really small, the crowed itself is freaking awesome. Everyone there (including the bartenders and staff) are really friendly, and will often engage you in conversation seeing that you are banned from using your phone.\n\nBotton line, awesome bar. I wish it was just a little bigger =)", "author": "Corey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "This may be one of the tiniest drinking holes that I have ever imbibed in...not a bad thing?\n\nLove the Chimay, love the dice, love the tight spaces.\n\nIf you love brew and a laid back vibe...this is the place for you.\n\nNo frills. No cash. No space.\n\nGood times.\n\nThe end of my teeny tiny review.", "author": "Marcia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "I love this bar because I respect places that respect themselves enough to make you work a little bit for their services. I respect their set of written rules that would ideally be unwritten rules in any good bar (i.e. No talking on cell phones [texting OK], guys who are sitting have to give up their seats to women who are standing, etc.), and believe that those rules are one of the ways a bar this tiny can work so beautifully. I love that they serve their awesome selection of beers out of a bathtub, because it makes me feel like I'm in a speakeasy back in the bad old days when booze was illegal and actually had to be made IN a bathtub. I love that the bartenders are the type of guys who will let a neighborhood regular run a tab, and who can be good-natured when telling your goofball brother-in-law when he's being a dumbshit. True pioneers of the I.B.V. (Ideal Bar Vibe).\n\nCash money only.", "author": "Trav W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "As small as they all say, but quaint means that you get to really get to know your new found friends. This place houses regulars for the most part, all the folks that I saw seemed to know each other however they all were very welcoming and interested in the new faces that try to fit in the joint. The fact that its cash only keeps the douches out, which makes it a place to gravitate towards. Go.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "good beer, laid back place, good to stop in on week days - not too busy either. so small, so hard to come with big group, but intimate enough to have good conversation.", "author": "Sara N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "Hands down my favorite bar in SF. Thank you to Ruggy for showing me and Tiff this freakin awesome joint with it's rad owner/bartender and really really cool clientele. Seriously, every time I've gone here, I've had an absolute blast and met people I thought were totally awesome. And I always get to show this place to friends when they come into town and blow their mind completely out of their head. \n\nAwesomeness incarnate!", "author": "Nicholas N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "My neighborhood spot. Whatever I say about this place would not do it justice...James the owner and the vast majority of the people who work here are super friendly and courteous. And the House Rules absolutely Rule!", "author": "Anny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-14", "description": "We met James through a friends wedding and he immediately treated us like family. I fancy myself a well traveled barfly and this is one of the coolest places I've ever been to.  It's small and cramped and cant hold more than 15 people.  It's perfect.\n\nIf you want a cool place to grab a strange brew and a unique experience, this is your spot.", "author": "Cody V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-18", "description": "This is a nice little different type of bar, very small, bUt with it's own atmosphere, which I really liked. If you look up Irish Bars on yelp it comes up, no I have no idea why? other then Americans famous lack of knowledge of geography, LONDON IS IN ENGLAND, Ireland is another country, thank you very much.\nAny way, I liked it a lot, I should say at this stage that the beer in the bathtub is bottled, and not served draft-wise straight from the tub by a hairy arsed Englishman.\nSo go here, you'll really like it.", "author": "Paula M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-13", "description": "Love this bar. James would be considered a bar god in Greek times. He is fun, witty, and charming. I took my best friends here after reading a review on yelp.  We went back the NEXT weekend and we were having so much fun with James that he closed the bar and we all went to an after party on Polk Street.  It is literally the smallest bar I have ever been in; if you don't meet someone new in here you are definitely in the wrong district.  No cell phones and he means business, so don't even try. \n\nI was sad when I went back a few weekends ago and it looked like the silicone yuppie marina types were having a birthday party here.  I hope they haven't discovered the true greatness of the place because it would ruin the ambiance it has.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "My friends have been going here quite a while, and finally Friday seemed like the appropriate day for me to see what the big deal is about. As you've probably noted from other reviews, it is probably the smallest bar you've ever been to. Mayyyybe 20 people can cram themselves into this place...maybe less.\n\nThere was a single beer tap, no liquor of any type to be seen, and I think they keep the beer in a bathtub of ice. \n\nSomehow, this odd combination of size and simplicity produces a very friendly environment that encourages people to meet and talk to strangers. The bartender is a super nice guy, and makes you feel right at home.\n\nI wish it was closer to where I lived.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-04", "description": "I put an extra star because of Chimay and smallness.\n\nThere are only 7-8 seat.  Sometime I really want to drink in small place like here.  It is better to finish your dinner at the othet place.  There is almost no food in here because too small.\n\nThe one cup of Chimay after the dinner is really good!", "author": "Hiroko S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "This is James King's place\n(chivalrous proprietor).\nBeer and brains collide!", "author": "Nathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-07", "description": "I love this place.  James is the coolest bartender and I wish I could remember her helper, who kept my chimay glass full.\n\nTHis is an outstanding bar where they keep their beer in the bathtub filled with ice, play chess and dice with you. I met a lovely young lass there as well...truly an outstanding place.", "author": "Blake t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "When people try to describe how small a place is, they are sometimes given to saying, \"There's not enough room to swing a cat.\" With the Black Horse London Pub, such a remark would not be an exaggeration. This hole in the wall pub/deli on Union Street near Van Ness Avenue can comfortably seat about eight people but frequently holds many more. The record, according to the owner, is 53 people stuffed into this tiny beer room. Even with as few as a dozen drinkers, you find yourself becoming physically intimate with your neighbors, and any journey to the restroom invariably involves making new friends along the way.\nThis scenario could go horribly wrong in so many ways if it wasn't for the genteel and sociable clientele and the bonhomie of the good-natured bartenders and owner, James King, who welcomes every new arrival as if they were a long-lost friend. If King or the bartender somehow misses greeting you, there's a good chance that one of the other patrons will extend a warm welcome. We began this crawl at Tommy's Joynt, which proclaims \"Welcome strangers,\" but Black Horse is in a different league altogether. \nBlack Horse isn't so much a pub as it is a cool rec room, with a flat screen television perched at a neck-straining angle at the corner of the ceiling; a dart board on the wall hanging precariously close to the rest room; and a bathtub full of ice and beer behind the bar. The wall is decorated with pictures of Prohibition-era beer protesters (\"We want beer\") and soccer scarves. Since the Blackhorse is, after all, a London Pub, it can perhaps be forgiven for prominently displaying a blue Chelsea scarf.\nOn one recent visit during March Madness and right after St. Patrick's Day, the white porcelain, claw-footed beer tub was full of Guinness, Smithwicks, Harp and Corona. Also nestled in the ice were some lovely bottles of Chimay Reserve, which matched the vibe perfectly. \nAfter an hour or so, beer reinforcements arrived in the person of Marin Brewing Company Head Brewer Arne Johnson, who brought along a keg of his excellent cask conditioned IPA, which King generously poured into a large mug. Between popping open bathtub bottles and pouring Marin IPA, King was busy preparing cheese platters to nosh on with the beer.\nBlack Horse might not have the biggest beer selection, but that's not the point of this unique \"snug.\" At the Black Horse, it's all about the vibe and the camaraderie, with beer serving as a vital social lubricant. Even the injunction against cell phones seems designed to encourage real social interaction with your fellow revelers.\nCow Hollow is full of pretentious pubs and bars that attempt to create a friendly drinking atmosphere. Most of them fail miserably, and it all comes across as phony and artificial. James King could give them a master's class on the technique of a being proper publican; when you're in the Black Horse, you're in his house and, at least for the evening, part of the family. All in all, Black Horse London Pub is a delightful exercise in social interaction at its finest and one that must be experienced at least once as part of the city's vibrant, eclectic pub scene.", "author": "chuck l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "As mentioned by others, the space is small and often times standing room only.  I prefer to drop by after a walk with my Pupkins - What I love about this place is they let the Pupkins come in and hang out with their mom while their mom throws a few back.  The beer selection is fantastic (my favorite ~ Chimay BLUE - which they were out of this past Sunday; the shame of it all considering this bar is the only bar in SF that has the biggest account with Chimay).  \n\nAnd as mentioned by others, because of the tightness in space, folks are friendly and are happy to engage in conversation.  And yes, there appears to be an unspoken rule; men do offer their seats to the ladies.  Ahh, chivalry is not dead - a refreshing reminder of that men can and will be gentlemen despite the social pressures of living in a small metropolis where the standard is brawling and fighting amongst one another for the most ridiculous of things.  Folks here do not lack virtue or politeness.  \n\nSo if you're one of those people who are awkwardly social, grumpy and confrontational (and doesn't like Dogs), this place is NOT for you.\n  \nIf you are a person who appreciates meeting strangers and engaging conversation, and don't mind being courteous to others, this place IS for you.", "author": "Cris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-10", "description": "Great spot, good beer, fun crowd. Not too Marina and the limited seats make it easier to decide if you want to hang or not. I have always had fun here. \n\nShout out to Frenchie, Scott and the East coast Westchester gangstar.", "author": "Doreen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-02", "description": "This is a great neighborhood spot, where anything goes, and everyone truly gets to know your name. For what it lacks in size, it makes up for in it's welcoming atmosphere, great beers, and friendly patrons.\n\nI really enjoy this pub. Sometimes it's quiet, sometimes it's rip-roarin' loud and I need 2 Chimay Blue's to join the party. I was there last Sunday for the Canada vs. USA Hockey game, and it was a GREAT time. \n\nMy only complaint is that sometimes my husband \"loses track of time\" there and comes home late for dinner....I suppose that's a trait of a really good pub.", "author": "adrienne l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "Are you kidding?\nVisiting my buddy George in San Francisco, all weekend long he kept talking about his favorite bar.\nWith every intention to make it there, Friday and Saturday just didn't pan out.\nFinally after a day at Danny Coyles, it was time to check out Georg's favorite watering hole.\nThe second we walked up I stopped to laugh, knowing now exactly why its his favorite. The place is fucking tiny!\nIf memory serves me right, there was just enough room for 5 bar stools, a small bar, a bathtub full of ice (where they serve the beer from), and a broom closet sized restroom. There wasn't any room left for even someone to fart.\nI had a really good time enjoying the beers with the company we had, but when a few more couples crammed in, then a couple of dogs started  pushing their way around, claustrophobia kicked in.\nIt was time to leave.\nAn awesome place to get really acquainted with your neighbor on the bar stools next to you.", "author": "Noel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "Oh man, this place totally rocks, one of the best bars in the city. If you don't mind getting cozy with your fellow San Franciscans, I highly suggest checking this place out with a friend on game day. And the people who show up are always fun and sociable. There's two taps in the bar that they switch out daily and the rest of the beer chills in a bathtub full of ice behind the counter. \n\nThe bartender's are hilarious, one bartender, Scott, is a diehard San Diego Chargers fan with more sass than anyone knows what to do with. In one instance, I was telling this girl that another bartender, Liz, was my sister (don't ask me why, I have no idea) so the girl walked up to ask if this was true. Without a moment's hesitation, Liz confirmed we were blood and then went on to recall memory after hilarious memory of our childhood together, it was a riot.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "Great place. I like the intimate setting in the bar, and the rule that if there is a girl, a guy has to give up his seat for them. It's a great way to start conversation with people in the bar too. All very nice. \n\nThere'll be the occasional marina-guys that end up here with his \"buddies\", but dont let that discourage you. Just wait for the 1-4-24 dice game.", "author": "Chieko H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "I stumbled on this place while visiting a friend in the Bay this summer.  We planned on having one drink and ended up staying for 4 hours.  It has a great atmosphere and our bartender was really nice.  I would recommend this bar to any local or traveler because it has such a unique feel.  They have the best deli sandwiches by the way!", "author": "Brian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "Been here many times.  It is a cool spot, great owner, great regulars, and nice scene.  It's a tight space, so if you can't mingle in close quarters, you may want to rethink it.  Highly recommend for those of you that love beer, and for those that don't...have a cider.  Someone may ask you to guess at the name of a movie, after providing hints from a movie book.  There is a lot of competition.\n\nOh yes - Hi James, Hi Steve, and all the others!", "author": "N F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-15", "description": "really cool place to go if it's not crowded. I'd say it's the only neighborhoody sort of place around there that isn't expensive.\n\nbeer kept in a bathtub by the bar and usually one really good local beer on tap. would like to try the food but they are more about the beer.", "author": "Crutonic L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "love the fact that the guys are only searching for dates.....what happened to this place? will only show my face if james or cassandra are there...otherwise, its a joke. fire the rude du\nde from tonight...", "author": "debbie w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-19", "description": "If you suffer from any claustrophobia whatsoever, then this place is not for you -- in fact, if you even know what the word means, it might not be the place for you.\n\nEverything here is defined by the lack of space. The forced intimacy means that you pretty much have to introduce yourself and talk to whomever you're near. Hopefully, you enjoy their company, because it's basically impossible to move elsewhere to mingle.\n\nI didn't mind the absence of privacy too much at first, but after the \"nth\" time that somebody says \"Excuse me\" as they scrape by you to get to and from the one bathroom, it got pretty tiresome.\n\nThere's no draft beer, just cans and bottles, and $3 for a PBR can is on the high side, no? \n\nI spotted a yellow, red, and black \"Deutschland\" soccer scarf high up on one of the walls, which presumably would be an absolute sacrilege in a real London pub, so I'll give the owner the benefit of the doubt and assume he lost a big bet or something.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "I went to the Black Horse London Pub on Friday night for the first time with some friends....It was the best bar EVER!  Don, the firefighter was in town visiting from LA, and made the most delicious soup and tri-tip sandwiches, that he so nicely shared with us!  Everyone at the Pub, especially owner, James, and regular, Steve, were so friendly and welcoming and made our experience amazing!  \n\nI would highly recommend this Pub as a great spot to hang out and meet some great people!", "author": "Candace W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-22", "description": "This place is really cool. small, cute, has a lot of character. \n\nThe reason I only gave it two stars is because of the bartender.\nI won't leave a name because I don't want to get her in trouble but..\n\nI can't believe the owners of this bar would hire someone who is clearly coked out of her mind, complete with twitchy jerkey movements. \n\nOh, and did i mention that this was during the daytime? Unacceptable.", "author": "sam s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-30", "description": "On the advice of sir Ruggy (who has never yet set me astray), I came down here for some mid-sketchfest booze to keep the day flowing if ya know what I mean. \n\nMe and a friend walked into the place with no one else in there, but then again there are really only one kind of people that you find in a bar @ 2PM on a beautiful Saturday...professional drunkards. I was pretty impressed at the beer selection - there wasn't a ton of them, but they were all well thought out...and sitting in a bathtub. The prices were perfectly reasonable too - I think Chimay was on the high end and ran you $7. The bartender knew his stuff too - the beer recommendations were top notch.\n\nThis place is teh win (and got the 5th star) for really exactly one super reason tho - the awesome peeps that go there. No scene. No pretention. Just a bunch of easy going people wanting to talk about shit and drink some delish beer. Doggies allowed. Cell phones not. Seats have to be given up for the ladies (damn chivalry) if need be. Oh yeah, and watch your head when you get up from sitting on the poo poo machine - you'll smack it on the towel dispenser if you aren't careful (I did...even though there is a giant sign on it warning you of this fact).\n\nI think I must have talked to everyone in there (I'm serious...because that was only like 7 people by the end of the night) about awesomeness and life in general - a history of schwinn bicycles to an awesomely kind gentleman with a handlebar moustachio, and the shitiness of New Jersey to someone else who escaped that wretched hell hole a long time ago (just like me!). \n\nReally, this is a great place to go to hang out with a cool crowd and kill some time if you're bored...I'm already planning on heading over there tomorrow since I don't think I'm going to have anything else to do.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "I had to look through the reviews as i had never read them, but i've been going here for years. Its a sleepy little spot that pumps. Ultra small bar. Basically there is behind the bar and in front of the bar, and a small area for darts. Super cool spot to hang, but dont try to come here with a group. it'll never happen. The whole bar may be able to fit... 20 people? Great drink/beer selection. One of SF's (little) gems. \n\nI'm just wondering who is the 1 Yes vote in the survey under Coat Check???", "author": "Adam X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "Charmed.  I am absolutely charmed.   If this pub asked me to dinner, I would blush and giggle and then run out to buy a new outfit and maybe even a pretty bra (because I'm thinking you are totally gonna get to second, Black Horse...).   \n\nI've been twice in the last three days.  Too eager?", "author": "L W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "Do you live in a teeny tiny studio? I'm not talking the sort where there is room for a bed and a couch, plus a hallway, bathroom and full kitchen. I am talking you walk in the front door and have to step over your twin sized bed to get to the bathroom and mini fridge/ hotplate combo that the landlord qualifies as a \"kitchen\". \n\nWhen you start feeling claustrophobic and need to be cheered up over your cramped living quarters just pop over to the Black Horse and grab a brew. It is cozy, and by cozy I mean, you just made a new friend of everyone in the place without even trying, cozy. This little pub will make your place look like the Taj Mahal.\n\nOn the upside it is owner operated and will allow you, legally, to smoke inside. Cute LITTLE place.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "Pure. Genius.  Words fail to describe the eccentricity and magic of this one-of-a-kind surreal bar experience.  \n\nFirst of all there's the mythology and cult appeal -- James, originally from Cleveland (who he describes is a good place to \"be from\" but not \"be at\") bought the place (originally a deli shop, and still is by the books) almost 20 years ago and has been running the unusual shotgun establishment since.  From the moment he says hey you'll love the guy.  Well, unless he's kicking you out for being on your cellphone -- no phones allowed!  (Texting is ok though).  Due to the zoning \"as a deli\" he's forced to close at 12pm and can only serve beer.  Not that he'd like it any other way, I'm sure.  James is the man.\n\nThe venue reminds me of the 7 1/2th floor in Being John Malkovich.  It is wedged between businesses like an earthquake or large construction vehicle played an unfortunate fate to its size.  Yet it adds so much to its appeal.  To stand in the Black Horse is an experience in an of itself.  Once inside you'll see that there's a vintage bathtub housing a keg of Caske Ale (1 of 2 only places that serve it) through a ghetto-rigged hose on a hand pump tap.  The rest of the tub serves as a colorful odorous trash bin for beer bottles.  What a sight!   \n\nThe rumor is if the barstools were removed 50 people can fit inside the place at once.  Even with only 20 or so patrons the bar seems impenetrable and intimidating for the shy passerby.  You will be bumping people, rubbing against them, apologizing, greeting, laughing, and partying with everyone in there like it or not.  There's also the matter of quirky dice games, outsourced food logistics (order a pizza to be brought here, no problem!), and the mythical cheese plater.  It has its own black board.  You will soon understand.\n\nSo what makes this place a 5-star Yelp \"good as it gets\" spot? \n\nThe people.\n\nThe Black Horse London Pub is effective in autonomously repelling the kind of people that wouldn't have a good time there, so you'll be treated to some of the friendliest outgoing people that San Francisco has to offer. You cannot move past someone without getting to know them, and you'll be glad you did.  \n\nThe forced circumstances ensures great times, guaranteed conversation, bewilderment, and a warm and fuzzy sense of spontaneous stranger togetherness that you've perhaps only seen on television.  Maybe only the mythical Cheers tops this experience.\n\nCome to The Black Horse and come often.  We will know your name.", "author": "niero g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "One of the coolest owners I've ever met.. You can tell he really enjoys what he does.. Check this place out, it's awesome!", "author": "Jaipal N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "This bar is huge, I had a party for about 300 people here once. Oh wait, just took my medication, must have been hallucinating... Actually, if you can get 30 people in here I'd be surprised, and that's a good thing.\r\n\r\nThe Black Horse is truly that bar where everyone could potentially know your name, well at least after a few pints. Everytime I stop in, there's always someone telling a story. On the flipside, if you're talking to whomever you're with, there's a good chance that another patron will chime in with his/her own opinion.\r\n\r\nNo cell phones allowed, you'll get nasty looks, and the usually gentlemanly bartenders will ask you to leave. Don't be that guy.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "Hadn't been here in years but wandered by last weekend... to my surprise, still a great place with a great vibe.  Amazing how many cool people you can meet in a place that seats @10 people.\nDo yourself a favor, read the rules and don't be an A#@ and you'll get along just fine here.\nThey have an interesting assortment of beers that seem to change regularly, the blackboard will give you the list and the bartender can fill you in on the qualities of the beer.\nGod times!", "author": "Jack P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-17", "description": "So.... I was in a rush to get out of my apt to meet my friends at the BART. So I didn't bother reading a single thing about the Black Horse before we got off the taxi at Union & Van Ness. Hah. This was so different than what I expected, or from anything that I have EVER seen before. \n\nLet's start with the sign, which says \"Black Horse London Deli\". The place was so small, I kept expecting a \"surprise! There's a hidden room in the back\" revelation. Or, \"surprise! This is our appendage Deli; we run the Pub behind the Deli in this big room that you were expecting.\" I saw the door at the end of the shop, thought it was a portal to a bigger area. It was the bathroom. And apparently there's a max volume b/c there's apartment neighbors. It is nuts how small this place is. I don't think I've seen one of those small restaurant crevices this small. Those things have room in the back for more space.\n\nFriendly people who don't give a trap about being bigger. The novelty wore off pretty fast, and we played some 1-4-24. That was it. The can likely distinguish the regulars and the occasional tourist. But nothing was made of your strangeness; instead, they were quick to explain the game, and the beer, and what's going on.\n\nI cannot believe this place can exist. And I think I would enjoy this place, but alas I am moving. I think I would up their rating to a 5 if I stayed in the Bay.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-06", "description": "My New Year's Resolution was to spend more time in this bar.  \n\n\nWith a sea of bros in mesh trucker hats swallowing my neighboring Russian Hill bar scene whole, it's nice to come to a place that is down to earth enough to keep beer on ice in a bath tub behind the bar.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "Def. worth a visit!  I was a stranger in a strange land when I first moved to SF and after a day of rollerblading, I was hungry and thought I'd pop in for some food (Their sign includes the word \"Deli\").  I was absolutely delighted by this very quaint bar, and lively crowd.  I knew I had stepped into a gem. Kinda like one of those off the beaten path finds except that it's literally 2 blocks from mi casa.  On this day, I'd forge a friendship with one of my closest friends.\n\n1)  I love how the men are required to give up their seat for you. \n2)  I love that it is small, and that it is easy to make conversation and new friends\n3)  I love James - he's just a cool cat\n4)  I actually love their charcuterie plate: with stinky cheeses and meats. - I'm unsure but I don't think they serve this anymore.\n5)  Dog friendly\n\nMy neighborhood local watering hole, bring cash.  Beaware of Chimay's after 2 or 3 - you will be certainly buzzed if not, drunk.  ;-)", "author": "Sheila W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "\"Small pub, big heart\" perfectly embodies The Black Horse. Regarded by me and my friends as \"the smallest pub on earth\" (likely not, but I care not about any smaller). \n\nJames and crew clearly enjoy tending bar here and who can blame them? They make this place what it is, along with everyone else who appreciates it.\n\nCouldn't think of a place more worthy of my 100th review. I've shared 100s of beers and 100s of laughs with 100s of people and 100s of  well spent dollars in my years visiting this fine pub. I've been here during an earthquake when people outside felt it and we didn't. I've seen a dog dressed as superman and a man dressed as super woman. I've cried...tears from laughing so hard. I've taken a glass home (on accident)  and brought it back for a free refill (don't recommend this one). I've jumped into the back seat of a stranger's car at the gas station across the street and got taken home. And will continue to have many stories to share with time.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "I came here for the first time last night and it's a really cool place. James was bartending and he's a really friendly guy. I tried the Kasteel Cru -- a French beer fermented with champagne yeast. It tasted very similar to champagne and nothing like any beer I'd tried before. \n\nThe only disappointing aspect of my experience is they didn't have any beer on tap. They usually do, just were out on that particular night. I'll definitely be back here again for good times and draft beer.", "author": "Aaron V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-14", "description": "I lived in London - I know pubs. This a real one, not that crappy \"ye olde English pub\" (which is actually everywhere in England) but a real London style pub. They even have yummy pub grub - like ploughman's lunch - even had stilton. \n\nThe Real DEAL!", "author": "Danger A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-24", "description": "Sometimes its hard to feel like \"Mr. Big\" in this city- you know what I mean, you walk into the bar, and the sum total of every client looks up at the new stranger coming in with a look of well....drunken happiness. \n\nwell, this is definately the place. WIth an awesome beer selection (double points for the chimay blue and quad points for the spaten Oktoberfest) and the cheese/chutney plate was to die for. And with the place being so small, there's no way you could not make friends with everyone in the bar in say, 5 minutes....which can be a bad thing if you do like I did and agree to play the sadistic (but cheery) bar staff  a game that is a crazy mix of simon says combined with tazer technology, and if you lose then......yeah, it must have been the beer......\n\nbe warned, cell phone technology- unlike tazer-enabled simon says games- are frowned upon muchly!", "author": "Tim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "This is a locals' treasure. If you are new to SF and live in the Marina or Russian Hill and don't know anyone - pull up a bar stool (if you are lucky there are any left) and get to know your neighbor. The owner James is a gem. He is so sweet and genuine. You are forced to speak with everyone in the bar since it is so small and no cell phones usage is allowed. Genius! If you use it you will be put in time out - not kidding. We need a technology slap in the face once in a while and especially at your local watering hole!", "author": "Laura A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-17", "description": "Oh, I love it.  I love interesting beer, and tiny crowded spaces, and unpretentious bars. I even love the fact the beer comes from a bathtub. (I didn't think I would love this, but I do!)\n\n Next time, I will:\n\n1. Not come with a guy friend I haven't seen in awhile, because (as others have pointed out), this is a prime place to chat with strangers and not so ideal for a one-on-one conversation\n\n2. Not be such a girly-girl and order myself a cheese plate right from the start\n\n3. Get a little wasted and join in the heated dice game going on in the \"back\" of the bar (maybe a scant five feet away from the front)", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-16", "description": "Obviously opinions change continuously...\nAfter visiting the smallest bar in the city for the second time, but this time actually being able to enter made all the difference. \n\nThe one bartender is personable and welcoming. How could you not be when you are 2 feet from each other at all times. Conversation was good and the idea of the place made me feel more comfortable. \n\nI'd recommend coming here on week night. I wouldn't recommend ordering a cheese platter (the only dish they offer) I don't know how it could be sanitary to eat in the little joint, but a beer and laughs is just fine.\n\n______________________________________________\nmy original 2 star review:\nI'm stuck in a box and there's no way out........\nI admit I haven't been inside. I have walked by it numerous times and I cant fit and if I could I'd be stuck between eeks a mouse and a dirty bar stool. Smallest Bar in SF, what is cool about that?\nHow can you run a business out of a closet. I wonder what rent is... One star for still being open after a billion years \nOne star for trapping customers (I don't know how you do it, but it's something to be proud of)", "author": "Dee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "After years of walking past this place and wanting to give it a try, I finally got the chance!  A friend organized a small group of us to stop in here on a recent Friday night for happy hour.  I was worried we wouldn't all be able to fit, but we managed.  I love the rules this place has, #1: no talking on cell phones (texting is okay), #2: men must offer their seat to ladies.  The bartender/owner, James, made it a point to learn everyone's name, which is very touching and made me feel at home here, even though it was my first time in the bar.\n\nA small yet varied selection of bottled beers is available out of an ice bucket in a bathtub, and all are reasonably priced.  If you are really watching your wallet, there is always the $3 PBR ($2 at happy hour).\n\nA tiny space but I had a great time here.  Chatted with my friends and met a few of the regulars, and I look forward to coming back again soon!", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "Maybe I should have gone to this bar with a different perspective but with 5 stars from so many Yelpers I thought this place would be amazing.  Don't get me wrong, its a cool place where your beers are served from a bathtub but its really small.  You can barely walk by people.  The staff is cool but I had a hard time understanding who was a bartender from the people behind the bar.  As a 6'4\" person I need a little more room to walk around and chat with people.  Otherwise a bar with a lot of personality.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-06", "description": "There is a tiny bar in Tampa, called Fuma Bella.   I though it was the smallest bar ever, until I came here.  \n\nThis is also one of the coolest bars I've ever been in, but be prepared for cramped quarters.   The entire place is about 10 feet by 20 feet, about the size of the bedroom in your house, but full of character.  \n\nSeats about 8 people at the small bar.   The also have a dartboard, but if there are more than about 4 people in the bar you can forget about that!\n\nCool bartender, I forget her name, but she was bartending while trying to pass the bar exam!   There are all sorts of lawyer/bartender jokes there, but I'll refrain.   \n\nThis is definitely my favorite bar in San Francisco, and will return next time I'm in the city.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-16", "description": "REALLY???  I've been coming here for the last 8 or so years and I have never seen such a horrible sight before in such a beautiful place...PBR cans on the bar???  WTF is up with that?  Joe (the original owner) would be sooooooooo disappointed.  They had nothing on tap and the other beer selections were nothing special.  We don't come to the Black Horse for stupid PBR (which I am a fan of and have put back many in my lifetime, but go to crap bars to drink it).  It was absolutely the saddest moment of my week when I saw the cans.  \n\nJJ and James, please fix this.  PLEASE!!!!!!", "author": "Ayrn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Definitely going to back one day! Cassandra is the best! Nice little hang out spot if I still lived in the city.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Hot Dang this place is amazing! One of my favorites. As a single lady it is next to impossible to find a bar where you can have a beer on your way home and not get hassled. James and his amazing staff have solved this problem. \nP.s. If you are a game player (dice, dominos, cards, cribbage) this is the place for you!\nFor extra fun go see Ryan on Thursdays!", "author": "Sally L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "True love:\n\nMe:  \"I'll have a Chimay, please.\"\nBartender:  \"White or Blue?\"", "author": "Ann M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-10", "description": "Its square footage is akin to that of a walk in closet, which is sort of what made our visit extra special (once we squeezed thru the throngs of people who managed to pack themselves cozily into this hole-in-the-wall pub).\n\nWe were lucky enough to meet Dave (and his buddy Matt) before his venture out into the Galapagos Islands to keep his gf company while on a research assignment. He hooked it up with free pints of beer and cider, which only made his (and Matt's) travel conversations all the more interesting. \n\nBy etiquette, gents aren't allowed to sit on the bar stools if a woman wants to sit down. Yeayuh. And I find this to be a BIG plus. Especially since we need the bar hooks for our purses/coats/and ish.\n\nOverall - a basic, no-frills and no-nonsense pub. Great bartenders with great capacity to hold a fun and buzzed conversation!", "author": "Ro D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-25", "description": "it's my life long dream to fill a bath tub with alcohol so, SOLD.\n\ni don't even care that they only accept cash, because of course they only accept cash. they don't have a fucking refrigerator, why would they have a credit card machine.", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "This is a great place. If you are in town and near by its a must to visit. James is awesome and makes you feel at home right away. Great place, great people.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "This place made my first trip to SF unforgettable. A cozy old fashion - talk to your neighbor - we're all here for good company- sort of atmosphere. If I recall correctly, no cell phones were permitted. Small, simple, and welcoming.. all you really need :)", "author": "Krystle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-16", "description": "When they say this bar is small, they are not kidding. Do not come here if you have \"personal space issues.\" However, J R. is correct when she says that James is a god amongst bartenders. Truly, he is the best bartender I've ever encountered. And not just because he has a sexy accent.\n\nMy favorite thing about this bar is the fact that it is nearly impossible not to make friends. You are literally FORCED to interact with people as they climb over you (and vice versa) on their way to the bathroom. Luckily, most of the people who were here when I was were very nice... and they didn't smell bad.", "author": "Evann G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-24", "description": "Cutest bar ever! Tiny and charming. Five beers to choose from, four of which sit in an old ice filled bathtub behind the bar, the fifth is a cask on tap selection. Friendly proprietor, nice patrons...definitely don't bring the whole crew from the office here. If you sit near the door and stay long enough to fall of your barstool, you'll roll right into the street where the bus or a cab will surely run you over. Great place to show visitors some off the beaten path SF flavor.", "author": "Pam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-07", "description": "There are so many factors that collided to make this a 5-star review.  Let's begin!  \n\nIt was date no.2 with a semi-stranger.  On the way to drop me off, we drive by, find parking, and next thing I know we're at the door.  That's where I stopped.  It was packed, elbow-to-elbow, and there were only 5 people inside.  He assures me to just keep pushing, and sure enough, in the way back, there was room for us.  I will say, whether planned or not, the confined space was an excellent excuse for body contact.\n\nOnce in back, we hear that someone has bought a round for the bar, so we score free drinks and someone offers me a stool to sit on.  As we're drinking, a dice game is going on, and ends.  We can play in the next game for only a $1 buy-in (conveniently I had two bucks in my wallet).  \n\nHere's where it gets even better (I know, unbelievable!).  My pal takes the shaker, rolls, and loses.  The shaker is passed to me, and after three rolls, I've WON the entire game (which might have been called One Four Twenty-Four??).  How much did I win, you ask?  A whole $14!!!  So now I'm drinking free beer and up $12!!\n\nNow for the best part!  There is a nudie calendar of everyone who works there, complete with bios.  It was only in draft stages during my January visit, but I'm pretty sure the final version can only be better.\n\nAdditional Pros: The beers are recycled into a claw-foot bathtub behind the bar; everyone in that place is talkative and friendly; prices are super cheap.", "author": "Lindsay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-26", "description": "5 Stars = NOT ENOUGH\nThis place is my favorite bar in San Francisco...HANDS DOWN!!\nMy friend Jamie and I came here on a whim...on a what the heck, there are two stools available in an 8 stool bar...on a HOLY CRAP is that CHEESE PLATE on the One Item menu...on a what?? Is that an ice filled bath tub holding your beer ... on a Credit Cards...we don't need credit cards where we're going cuz it's cash only ADVENTURE...\n\nAre you in need of an adventure...a small adventure...???", "author": "Karen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-09", "description": "The most unbelievable bar you'll come across on Union Street!  I really thought my eyes were deceiving me when I walked in.  The place is literally as big as a walk-in closet!  But something about those close quarters on a chilly night was very comforting.  Maybe it was the leg-cuddle I was forced to do with the cute guy on a date with an ugly girl (believe me, he was having more fun with my leg).  The owners/bartenders are great guys... but they have their rules: no cell phones unless you're in the W.C.  They were regulars of the place and after tallying more than 1000 hrs, they decided to buy it!  How do I know?  They have a time-clock and all the true regulars can get one to keep track.  Good beers and a great pear cider... but nothing more than a cheese plate at dinner time.  If you're a bar connoisseur, you've got to check this real \"hole-in-the-wall\" out!\r\n\r\nUpdate:  I added one more star because they upgraded their menu... they now serve a salami sandwich, so you can down as many Chimay Blue's as you like and not be scared of falling off your barstool and into some guy's lap : )", "author": "Tara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-26", "description": "Very much a little local spot with fun loving local flavor. The bar is so small that if you don't have a conversation there is something wrong. \n\nPerfect place for Chimays... but watch out, they can creep up on you quickly.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "I lived in Cow Hollow for 5 years and made a trip to James' warm and welcoming cozy home every couple months.  He's turned his spot into a friendly bar where everyone knows your name and keeps interesting suds (that's beer people) inside his claw foot bathtub on ice.  If you're walking by Union Street at Van Ness, and love quaint cozy spots, be sure to stop in and say hello to check it out!", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "FUN FUN FUN! I earned my nickname BLACK MAMBA from James the second weekend we went here. It's like a great huge party in a box (LITERALLY, with it's size) everytime!\nMy sister learned the how serious indeed they are about NO CELL PHONES when she was expecting a call from her husband who is in the Navy and has been away in Iraq. The did offer to let her use the office when he called but she just booked it out of the place (and this is no easy feet with people jam packed into every crevice including the front door). She left so fast that she didn't grab her jacket and I had to squeese out the front door with it in hand because I was worried she would freeze. It was still \"California winter\" time after all.\nI love love love going to this bar. It truly gives you the authentic pub feel, while squeesing you in like a sausage!", "author": "Lynda O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "Tiny review for a tiny bar: good beer, friendly bartenders, fun atmosphere. Come visit!  (...just not all of you at once.)", "author": "Jennie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "I love this place, run by USF Alumni James ( Elvis) and a partner.  I knew it would be great , if James had a part in this place, and it was,. It's a teeny tiny closet of a bar, but had good company , good vibe and great beer. He also had some cheese and fruit.  I had a blast along with the rest of my girlfriends.  I have been meaning to go back and will make a point of hitting up this spot this summer. Cups up to all that go!", "author": "Susie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-25", "description": "I love this bar. It is probably one of the best places to grab a beer after work. You know a bar is great when Bloomberg posts a story on it. This story was the seventh most read story on the Bloomberg professional service. I work at Bloomberg and can tell you that we NEVER write stories on bars.\nHere is the story.\nhttp://www.bloomberg.com/apps/news?pid=20601010&sid=aSxIlW88E6no&refer=news", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-15", "description": "This is a love story.\n\nAs big as a big closet and as cozy as Christmas morning. Chilled Chimay blue--along with a small list of other well-chosen beers--flows freely. Cheese plates all night long. The clientele seem to be undergoing an unusual, collective identity crisis, all wondering whether they belong in Berkeley or the Marina. Bartenders are friendly and so genuine. Though the Black Horse isn't quite in North Beach, drinking here made me feel like I'd stepped into old Beat San Francisco.", "author": "Karin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-25", "description": "Under any other circumstances I would of just passed this place up if I walked by; considering it looks like a closet. However, my good friend Cory was a bar back there and made the experience an awesome one for me every time I was there. All the people that come to hang out are friendly and easy to talk to. I don't drink alcohol, but was always accommodated with the special tea and crackers that Cory or James so kindly prepared for me. \r\n\r\nThe place is TINY and I mean TINY!!! That's why I just couldn't give it five stars...", "author": "Crystal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "This place is amazing.  On a recent visit to SF, my good friends Tiffany and Nick introduced Jared and I to this bar and I must say thank you!  I am with Tiffany on this, I do love beer but I was so full after two that I had to stop drinking.  Luckily, I had that dice game to keep me busy.  James was friendly and made sure he met every person in the bar and knew their names.  The bar was well lit, the music wasn't too loud, and you could talk to everyone in the bar.  Awesomeness.", "author": "Yvonne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "Consistent with other reviews; the place is tiny but the bartenders are genuine and always welcome you in.\n\nI wouldn't go there if you're claustrophobic or mind having to squeeze by people to move around.\n\nThat being said, other than being small, this place is perfect....the only truly \"Cheers-like\" place in the Marina (or the city) I can think of.", "author": "Nate H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-09", "description": "3.5 really\n\nThis little gem fits about 10 comfortably. The bartender was very nice, the beer even nicer but we may have had too much of a dirty gay aura about us, cuz nobdy tried to talk to us. This was after all, a night away from our beloved Dolores Park hood. I imagine that had we had a couple of seats, or a couple more rounds things would've gotten cozier.  But we had cougars to hunt and fernet shots to do in search of the uber Marina bar.\n\nI'll definitely come back here without a cultural agenda. Gotta love a tiny but well honed European beer offering that alone deserves 5 stars.", "author": "G Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-04", "description": "Wow. This place is fantastic. I had no idea it existed until my friend suggested it the other night. The Black Horse only holds around 15 people tops, and that's what makes it so amazing. The beers of the day are kept in a bucket and the cheese plate is delicious with fruit, salami, chutney and bread. We played a gambling dice game with the bartender and a few others while the guy sitting next to me swapped great stories then bought everyone in the bar a round.\n\nThis is the friendliest, most relaxed bar I've ever been to. I've never felt more at home and had one of the best nights ever with my friend. I can't wait to go back.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "Best bar in the city.  Not only did I meet my wife here, but we got engaged here as well.  Go here if you want a fun local crowd.", "author": "Bob R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "Small, but awesome. Nice people! The problem is that the parking meters are expensive, and be prepared to stand. Watching games are great thought!", "author": "Paige H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-19", "description": "Best \"deli\" ever.\nBest bartenders ever.\n\nThis place seriously feels like Cheers...minus all the extra room.  Everyone always gets free shit.  The last time I was there, some guy spotted the whole place, I scored a few beers.  I love the phrase \"it's on me\", you seem to hear it a lot here...which is totally fine with me!\n\nGood times, good people, good booze.  Goodness!", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "The Black Horse London Pub tested my will power. My favorite Comedian, Mitch Hedberg, once said, \"Alcoholism is the only disease that you can get yelled at for having. Damn it Otto, you're an alcoholic! Damn it Otto, you have Lupus! One of those just doesn't sound right.\" \n\nWell, luckily I do not have Lupus, but on Sunday night I thought that someone was going to yell at me for becoming an alcoholic. If you love beer in good company, The Black Horse London Pub is a dangerous place! Like most people, I love the occasional beer. And like most, every now and then I like to test my level of consumption. Sunday night drinking has never been this much fun! \n\nThis place is so small it's like someone threw all of their wife's shoes and jackets out of her walk-in closet. They then decided to line the walls with random artifacts, put in an actual bathtub, fill it with hard to find bottles of European beer and throw down one hella of a time! They slept on the couch for a week afterward, but damn was it worth it!\n \nBecause of their extremely small square footage, I can't say for sure that this place is taken from the pubs of London. I have witnessed many people getting yelled at in London for alcoholism and the yelling starts at 9am, so therefore their pubs have to be larger.\n\nEverything about this place fits! I have never seen so much great beer being consumed with absolute glee. I have never seen so many people smiling in unison. In fact, I'm still smiling. I spoke with people that I have never seen in my life and we talked as though we were in the \"shit\" together, (I believe that's a war term). Be careful, the bartenders are instigators. They stand behind the bar sparking conversations with a bottle opener in hand waiting to unlock all that you are trying so hard to fight against... that one more. At this place, from this day forward, the \"one more\" will now be called the \"3 more\" (minimum). Pass it on.\n\nTry this place right now! They're open at 4pm for those of you that may be reading this before hand. But at 4pm... Go There!\n\nCheers!", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-03", "description": "DO NOT EVER GO TO THIS PLACE!!!\n\nWith that being said...\n\nI love this place!  But it's TINY and gets crowded and I don't want you all to take over!  It's my place...MINE!  I stopped in the other day, walking home from shopping on Union, sweating, desperately needing a beer...\n\n...heaven.  Krusovice...my favorite Czech beer...in a BIG bottle...\n\nThis place has got style.  And not your uber-lounge, see and be seen, style.  It's got a bathtub to chill the beers style.  And its pet friendly.  Good, that means I can bring along some of the dogs I typically end up dating.\n\nRemember:  Don't come here!", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-31", "description": "WOW, size really does matter! The smaller the bar, the better the wait.\n\nSo I walk in here and the first thing I get is, \"Dude? did you read the rules?\"  I'm like WTF?  \"Dude, the rules, on the wall...read them\".\n\nSo I read them. Hell yeah. I agree with them 100%. Order a Chimey and get to know your neighbour. \n\nP.S.  - Give up your seat to a lady,.....you smug S.O.B........then try to get her to come home with you.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "I could try to be witty about how small it is (bring your own bar stool) or make some funny pun (hole in the wall)... but let's not dwell. \nIt's a fun, charming bar; complete with naughty, homemade calendars. And yes, the rumors about the cheese plate are true.", "author": "Meg I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "This place is great. Best atmosphere in any bar around, cool people, and excellent drinks like the Coopers Stout. Love it, will be back next weekend again!", "author": "Dan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-26", "description": "This may be the only place in San Francisco smaller than my studio. \n\nWhat's it got that my place doesn't? Chimay... blue and white! And bottles of beer on ice in a claw foot bathtub behind the bar. \n\nMy fellow patrons are great... all 15 that can fit in the bar with me, and James the bartender knows every single one. The first time I came in, he knew I wasn't a regular, and made sure to introduce himself. So rare for the city! He's very attentive, and has discreetly offered to rescue me before from overly-friendly \"gentlemen\". \n\nI just hope the dartboard on the back wall is a joke!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-12", "description": "They brag about being the smallest bar on the West coast. I don't have any reason to doubt them. Standing room is barely one person wide.\n\nIt's good place to hang out and grab a few beers. Not really a pickup joint.  They have Stella, two kinds of Chimay, and a cask on tap.\n\nThe regular crew there are pretty entertaining. Ask to see the \"Men of the Black Horse\" calendar. Um, actually, maybe you shouldn't...", "author": "Shawn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "The people that \"have actually fit\" into this cute (tiny) little bar know what this place is all about. Funny staff behind the bar, surprise beers all the time, and VERY VERY intimate conversation. I think this place is awesome. I only have the patience to go there sometimes but when I do - its a blast!\n\nIf you can find it - GO!", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Woah, this place is teeny, but it was so much fun! Good thing I only came with one other person!", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-10", "description": "In an area of the city maligned for it's superficial nightlife, the Black Horse stands apart.  It's the type of place that reminds you of why you live in the city... a simple pub that does everything right.\n\nAnd what other bar holds a Big Lebowski party?", "author": "Mathew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-04", "description": "This bar is really REALLY small. Like I'd say only 20 people MAX can fit in here. With that being said the people here are really really nice. I love that most of the regulars sitting at the bar all had British accents ( it is a London pub, right?!).  The first thing I noticed when I walked in is the bathtub behind the bar that they use as their fridge. They fill it up with ice and keep all the drinks in it, pretty interesting and eccentric at the same time. I would come here for a drink or two with one buddy, if you are in the mood for a great conversation, or for the dice game 24 ( which I played, and WON!).\n\n The only reason this place isn't a 5 or 4 star bar to me, is that it is really really tiny and I also think they only serve beer, I'm pretty positive that there isn't a full bar, and if there is WHERE are they hiding it?!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "The Horse is awesome.  If you don't  like awesome people and a guaranteed good time, you should probably keep walking.  Also, James is great :-)", "author": "Kyla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-05", "description": "The cheese plate is amazing. Great local spot to go and have a few, strong beers with a good friend. You usually meet some really nice folks too. \n\nOh and they have rules posted on the wall that you can't use a cell phone and men must give up their seats for the ladies. Gotta love it!", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-03", "description": "We feel so proud of ourselves for finally having a drink at this place. We loved the euro-beers, loved James, loved the tiny tiny bar...and the fact that he has an Edward Gorey book propped up on the wall above the bar just sold it for me.  \nAnd now for the icing on the cake: it is a dog-friendly bar!!!!\nI think we just found a new bar. \nyay.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "What a shock this place is located where it is!  \n\nEveryone talks to everyone.  It feels like the neighborhood-y place you'd hang out in if you worked in a textile mill and had to drink to cope every night... no, here, they drink to enjoy the company.  Wholly different.\n\nThe guys who work the place are genuinely friendly.  I will return with friends soon before we retreat to someone's place in order to beat ROCK BAND.  Double true!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-06", "description": "It's tiny, it's fun, and there's always great beer available. James (the owner) is one of those people who, if you study him a bit, you see that he is living out his dream of owning a pub and is proud of the place. Yes, there are rules, and that is a good thing. Otherwise things could become unmanageable in this place. Yes, you are forced to talk to people you don't know. Which is again a good thing (most of the time).\n\nThe atmoshphere is welcoming and what a true neigborhood bar should feel like. It's like that Cheers-like feeling, but grounded in reality and not on television but in real life.\n\nHats off to owners James and JJ, as well as Chris the bartender.", "author": "Tolga E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "Very nice bartenders, decent music, cozy little room and friendly and cool customers.\n\nI'd go 5 stars if not for the sliiiiiiiightly overpriced beers. $5 for a 12 ounce Newcastle is a bit pricey, but that aside, this is a great little spot. I will absolutely be returning.", "author": "K F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "The Black Horse is a gem. A diamond REALLY in the rough, if you will....\n\nAt this point in my Nightlifetime, there have been no comparisons to this closet sized bar with bathtub chilled beer and to be quite frank, I wouldn't want there to be another one. It's perfect in its own little shack-ish way, a pub right out of England (even though I believe the owner is from Ireland), with the quirkiest of the quirks, and all the entertainment a live Saturday night could really need. People are usually apprehensive to its size and forced intimacy, but get them the Blue Chimay and they'll warm up to their neighbors pretty quick.\n\nFun Times... 4 Stars!", "author": "Morgan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-03", "description": "Is it a good thing that a bar has rules? I guess I always thought that rules and bars don't mix. Anyways, two of the rules are as follows: 1) no cell phones, and 2) always give up your seat if a lady enters the bar. I guess those aren't too bad.\n\nThe real appeal (or draw) of this bar is it's size. Typically bigger is better, but when it comes to a bar where you actually want to get to know those around you and have a conversation, smaller does the trick.  This place is probably 18 ft. by 6 ft. and is the smallest bar in SF (if not the world.) Enjoy a Chimay and talk with your neighbor.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-31", "description": "See, bigger isn't always better.  \n\nThe coziest, most chill, funnest, and friendliest bar in Northern California.  Make that the US.  The hell with it, the universe!  James should be given a medal from the city and one of those large ceremonious keys for establishing a fun and friendly bar.  Socializing is mandatory and welcome, and there's none of that lame \"Standing around looking bored while trying to find cute guys\" Marina bs.  \n\nThis is my favorite bar in the city by far!", "author": "Ria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-29", "description": "This place is tiny but always friendly.  Don't go there if you want a private conversation with a date.  Good selection of beers, and I remember having a cheese plate with several european style cheeses.  \n\nAwesome neighborhood bar.", "author": "Kurt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-10", "description": "Exceptional service by the Master of the pub, James. \n\nBest place to grab a drink, eat a cheese plate, and have a little conversation in the city. Hands down.\n\nTruly a hole in the wall place, the Black Horse usually has one cask of ale on tap and a few tasty bottled beer. The Chimay is a great choice.\n\nThe clientelle are mostly locals, friendly, and it's easy to get a conversation going with most of them. \n\nHighly recommended!", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-04", "description": "Really chill teeny tiny bar. The boys had fun here while the girls got Mani Pedi's next door. Plus, plus for being super dog friendly. \n Later on we joined them for some Chimay, \"white grape juice\" and dice. Black Horse is full of character and great people.", "author": "Douggers M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "This would be my local watering hole if I only lived closer. The bar tenders are courteous and try to make room for everyone in this comfy hole-in-the-wall. \n\nI was waiting for a friend to meet me here and it was easy enough to strike up a conversation with the other patrons while I waited (or you could feel free to not chat as well - there didn't seem to be a lot of pressure either way). At one point in the evening I think there were roughly 30 or 40 people crammed into the tiny space. Somehow it worked. :)\n\nThe beer selection is great (more \"worldly\" options), the atmosphere is grandma's kitchen/english pub/diner counter and the patrons are as varied as the city.", "author": "Becky B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-28", "description": "So happy I came here!  My girlfriend lives right across the street, so this is her and her man's neighborhood bar.  \n\nFirst off:  it's small.  Very small.  Small as in I'm sitting on a bar stool, and someone squeezes by and their crotch is on my knee small.  Good thing I don't have a problem with crotch on the knee (kidding).  Shake it off, Sarah!  So, they only serve beer.  And, yeah, it's all in an old fashioned style bathtub behind the bar.  We had Chimays.  The bartender/owner is super nice and friendly.  \n\nAsk to see the Black Horse calendar.  They have one for guys and one for girls.  Hilarious!  Each Man of the Month or Woman of the Month is a customer/regular... in sexy outfits.  Beyond classic.  \n\nThey also have this \"buzzing\" game.  Ask to play it, they'll get it off the shelf for you and show you how to play.  I love drinking and playing games- we need more bars like that.  \n\nAll in all, a really fun bar- filled with regulars and people just down to have a good time.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-05", "description": "I was considering writing a nasty horrible review of the place but that would not be truthful. This is one of my all time favorite places from when it is packed or empty. \nYou get the feeling that your all in this together...", "author": "Marcus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "My friend introduced to me this place one St. Patties. The bartender was dressed as the pope, served bottled beer from a bathtub behind the bar, and had a spray bottle of Jameson .. or maybe that was just from the clientele. I've been back there since, and everybody is always friendly, and its a great place to knock back the beer.   The place is TINY though, so don't bring a crowd.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-25", "description": "Great local hangout.  Love their Mateveza beer.  Great place with wonderful staff.  The bartender even made treats for the Friday night crowd.", "author": "Tommy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "This is an awesome, TEENY-tiny, old school bar sporting old school house rules, including no talking on cell phones (though texting I believe is allowed - if not I was seriously breaking this one).  The beer is on ice behind the bar in an old claw-foot bathtub (insert \"AWESOME!\" here), and while they claim that they have fit 50 people, I challenge that no more than 25 can squeeze in - and that would be like 25 sardines in a well-packed can.  If you're claustrophobic, that's ok - you too can enjoy this fabulous establishment!  Just come during daylight hours - as I've heard it doesn't draw as much of a crowd.  The bartender (and co-owner) James was sweet as can be - and introduces himself to all of his customers, making it a point to remember their names for future visits.  But the *best* part?!  One of the house rules is that men must offer up their seats to ladies.  LOVE IT!  Too many men show a serious lack of chivalry... and while many should have learned this a long time ago, James proves that it's never too late to educate on proper etiquette.  \n\nAnd for all of you guys who aren't so pleased with having to offer up your seat, think of if this way:  it's a fantastic way to strike up a conversation with the dashing brunette across the bar.  And by across the bar, I do mean four feet away.\n\nFantastic place... I'll surely be returning.", "author": "Whitney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "The worse kept secret in San Francisco. The Black Horse is actually a deli, but come sundown, the coolest bartender in the planets rolls out a porcelain tub of alcoholic riches. James and his tiny nook of a bar is the happiest place to grab a beer!", "author": "Rey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "I feel like this eeety beeety bar is made for eeety beeety people; not for the 10+ burly men and women that were crammed in here on a Friday night. Some how it all works because everyone who goes here seems to \"get it.\" After about 10 minutes of paralyzing claustrophobia, I realized that it wasn't so bad. So what if the guy next to me was so close he might as well be shacked up in bed with me. So what if I could smell the beer on his breath and the girl next to me had her purse resting in my lap. So what if I didn't have an inch of space to stretch my limbs. I had a beer in my hand and a smile on my face.... and somehow as the evening went on, I got it.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-16", "description": "Scott, the friendly bartender here emphatically announced to me \"You have found the best bar in San Francisco\".\n\nAnd I wholeheartedly agree. Great things come in small sizes and this is a case in point. Super highly recommended.", "author": "sunny m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "Long on regular patrons, cool owner and good bartenders.\n\nShort on high prices and attitude.\n\nThis is a must visit for any bar creature.  Highly recommend.", "author": "The P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "Had a great night in there. It may be small but that's it's secret weapon... great place for drunken chit-chats.", "author": "Ian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-05", "description": "the black horse seats about 12 and holds about 30.  they have a reasonable selection of beer and the tight quarters impose a kind of forced mingling...excuse me...pardon me...sorry, i didn't mean to touch you there...that's not my hand...oh my...really?...ok well...nice to meet you.\n\nplay darts you'll have the added challenge of lofting your dart over about 4 people so please play only if you are good...really good.\n\nthis place also has a set of house rules posted on the walls, for example, ladies get priority for the bar stools.  now this sounds very proper and chivalrous, but i suspect its just a way for the bartenders to get more action...as if they need any help...\n\nanyway, a nice cozy pub with a neighborhood feel if you happen to be in, well, the neighborhood.\n\ncheers!", "author": "eric g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "I don't know how to give this place a positive enough review. My girlfriend and I were walking towards the waterfront for New Years fireworks about 9p, when a gentleman stepped out from the bar and encouraged us to come in. We started talking to people and met a bike mechanic, a bunch of Austrian tourists, along with a few other couples. We had enough fun that we called my parents who joined us after their New Years party ended. We left at closing and I gave a $100 tip for the best bar experience I've had in memory.", "author": "Cameron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "tiny. great conversations with strangers. chimay. james is cool. i'll be back. totally wasted but i do remember asking something about a cheese plate lol, that was interesting.", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "This is a great little spot where they serve up beer from a bath tub (don't worry, it's bottled) and all the patrons and bartenders are friendly as can be.  \n\nSomewhere between the Marina and Russian Hill, this place is not what one would expect after visiting other bars in the area.  There are no frat boys or hair extensions here.  \n\nThey won my heart when last time I came they offered me not 1 but 3 slices of pizza to accompany my brew.  Black Horse London . . . you had me at hello.", "author": "Brenna C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-25", "description": "I can't believe this bar has as good a rating as is reflected.  It's small and the 4 or 5 people that can sit in there are all weird...not weird as in unique, or weird as in \"not Marina,\" weird as in just plain weird.", "author": "elizabeth b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "Not for the claustrophobic or friendliphobic...\nEverything (good)  they say about this place is true. It's tiny, they only serve beer and James is an outstanding people person and bartender.  Great place to pass the time, meet some people, and perhaps play DICE!!!  This is NOT a place for posing, dressing up or being pretentious.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-19", "description": "As a small person, I appreciate little spaces more than average person, and I loved this place. I've walked by this bar more times than I can count and finally last Thursday I stopped in. Six types of beer, including white and blue Chimay, and everything was $5 or under. And they have cheese platters. The best part was that everyone in the bar was friendly- everyone chatted with each other, and had great conversations. I haven't experienced that in a bar in San Francisco the first time you walk in. It was simply wonderful. I look forward to being on a first-name basis with the regulars.", "author": "Noelle Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-25", "description": "I sat on one of 10 stools; leaned back against the 'far' wall with my feet on the bar.  It's comfy being a drunk fool in such intimate confines.", "author": "Jake H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-12", "description": "Fantastic spot.  Smaller than my old studio apartment, but HUGE in terms of good times, great bartenders and fun.  Excellent beer list, but only beer available.  Come by if you want to meet random people, chat with your bartender, and pretend you're at a small house party.", "author": "Jordan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-07", "description": "The first time i visited SFO i was treated to what my friend called the smallest bar in town.  To tell you the truth that didn't really excite me.  But when we got there and he proved to be truthful i was very pleased.  the bar had some nice beers to offer all served ice cold out of a bathtub full of ice behind the bar.  Most recently in SFO on my first day out at night i asked if we could go back to that really small bar.  I was so happy to learn that they were serving Mateveza beer.  its very exclusive to the west coast and have been hoping to have some since i was last in portland OR.  We were able to talk with james the barkeep more because the place was pretty much empty and he was great.  no matter who showed up that night, local or stranger he was pleasant and accommodating.  i recommend this bar to anyone who likes to see the bars most people don't go to in SFO.", "author": "Darreck R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-18", "description": "Absolutely love this place, I honestly can not think of another bar in the city I'd rather go to for a non-specific purpose. No, you won't be packed into a bar with a bunch of frat guys and sorority chicks, no you won't be slipping from dark corner to hardcore-music filled dark corner among tattooed peeps, and no you won't be dancing like an idiot to house techno (who even likes that crap anyway?). \n\nWhat you get here is perfect: A tiny place, friendly people, good beer. Done. \n\nCan't be beat.", "author": "John E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-23", "description": "At first I thought this bar must be cool because it is always packed with people flowing out of the doors. At the same time, I never wanted to go because it was always so packed. Yesterday, I went and it was heaven. Great beer selection, chill bartender, good patrons, and that old magical London feel that I so miss. I think that fact that it's maybe 8 feet by 12 feet may now be one of the best parts- only cool kids will keep coming.", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-27", "description": "Yes, it is tiny, but everything it does is done perfectly.  It is a great small pub.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-30", "description": "The size of a shoe-box... it MIGHT hold 20 people on a good day.  But the excellent selection of English beer and the friendly bartenders make it worth cramming yourself in here.  And even when it feels \"crowded,\" there still aren't enough people to drown out your voice, so it's pretty easy to have a conversation.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-27", "description": "i loved this place!! went here on a whim with my cousin and although i usually play hermit after work, she's visiting from out of town, so i forced my lazy ass to get up and go out. boy am i glad that i did!! this is a great little neighborhood bar, and i'm not joking about little, the place seats only about 10 people. \n\nwe walked in and i felt like we were walking in on a small private party where everyone knew each other, but we were instantly welcomed. they only have about 5 beers, but they apparently rotate them every few months. the atmosphere is really chill and everyone is friendly with each other, although most people do know each other. but it's a great place to just unwind after work or before heading out for a big night. \n\njames, the owner was really friendly. introduced himself and spent a little time talking to us. told us they'd ordered pizza and that if we were hungry to just go ahead and grab a couple slices at the end of the bar. kim, the girl who was working the bar offered home-made rice krispy treats. we had a choice of plain and coconut/cranberry ones. apparently she bakes every tuesday!! at least 2 guys, who i assume were regulars, stopped by, grabbed the tasty treats, said hello and left. \n\ni'll definitely be back and can't wait to become a 'regular' as well. oh, and if you stop by, ask to see 'the men of the black horse 2008 calendar' it's hilarious!!!", "author": "Angela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-18", "description": "awesome things about the black horse:\n\na) beer only. and it comes from a bucket.\nb) 12 seats\nc) everyone has to get up when you have to pee\nd) owned by people who love the bar\ne) there's no space for all of those douchebags who fill up other bars", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-17", "description": "If I died and did go to heaven, it would be the Black Horse Pun and Deli.\n\nSmall, small, small bar is off the beaten Union St. path and is a complete delight. They only serve beers, such as Bombardier, Chimay, and usually have a cask conditioned keg and a cider on \"tap\". Tap either being what I assume is a pneumatic keg and a antique tub. How can you not love that.\n\nWhat makes this place awesome is the bartenders, especially the owner James and the people who frequent this small place. Place is full of great conversations, bring a friend or make some here. \n\nThere are some rules, abide by them. Like put your cell phone on vibrate and shove it in your pants, purse or leave it at home. And be chivalrous with your stool. Such a small place I never knew there was a bathroom, always run across the street to the gas station. And they do have food here, a great cheese plate.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "I like this place. \n\nNothing on tap the night I went in, just various beers in cans and bottles and really friendly folks inside. The bathtub full of beer completes the sensation of crowding into a bathroom with six friends to talk and drink. \n\nThe owner and bartendress were extreremely friendly and warm. I'll definitely return.", "author": "Gym W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "I went here for the first time the other night.  It was really fun.  There was not much room there, but it was really fun nonetheless.  They have really good specials.  They only serve beer as far as I could tell.  It was really fun though.  It was a nice local bar and a nice place to meet locals.  I went there with my brother and two of his friends that I just met and we had a fun time.  They have a bunch of cool games and such there.  They also have a set of rules there that was really nice as well.  No talking on the cell phone, give your seats up to ladies if you are guys when they walk in etc... People there were really friendly and we met a lot of people at the bar and hung out with them at the bar as well.  The bartender seemed friendly enough and carries on full conversations with you as well.", "author": "James J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-14", "description": "I don't go drinking anymore as I am a family man but ever once in a while I go for a beer with a friend and this place is the number place I go. The Black Horse is the size of a rich women's closet except instead of shose if full of good people and great beer. The owners and bartenders love what they do, serving great beer and talking with interesting and fun people. They usually only have one beer on tap, the speciality of the day and/or week and then a selection of bottle beer. Most all is from aboard, my favorite is Chimay. The owners have standing rule that if a lady/s come into the bar the men have to give up their sits, so ladies you will always have somewhere to sit.  Love this place, not a pick up bar, just a good place to enjoy a cold one and converstation.", "author": "Alec D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-24", "description": "Go. James and JJ, the owners, make this little spot the best bar in the world. The blackboard with the ~6 beers offered that night never steer wrong. I usually stick with a chimay blue, but never more than 3. Never more than 3. Go. Support these guys, all of them, infront of the bar and behind. This place is the best gathering of people I have ever met. I loved working there the short months that I got to, go back whenever possible.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "Been to the BHLD a few times since moving to the area.  While the selection is limited due to the purchasing location, they have good prices for a pint or two whenever you're around.  But more importantly, the people make this place - it always has a group of people ready with a story or some good conversation.  Not to mention James is a pretty laid back guy so things run well.  Last prop - NO CELL PHONES IN THE BAR!  Best idea in the world given the size of this pint-sized brewhouse.  Keep it up - I'm going back.", "author": "Mark J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-22", "description": "I barely noticed the change of ownership that took place more than two years ago (it was also a bar).  The selection of beer shows that they care about the details as does the Ploughman's Platter.  The bartender and proprietor is a doll.  I can see myself going back for sure.  It's only dinged one star because of an annoying group of patrons and I can see that being a problem.  What can I say?  I have a low tolerence for such things.  That's why I go out early.  That, and I am getting old.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-02", "description": "Going to the Black Horse is like showing up to a party where you know a few people and then like totally make best friends with all of their friends. I am going back now ALL the time. They have great cask ale (purportedly difficult to find in the city, though I admit I have never really tried) and really, really beyond friendly service. I honestly felt like I was at a friend's house.", "author": "Sahra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-07", "description": "Chimay makes you go heeeey!! Well at least it has that affect on us. lol ...Absolutely love this bar. James and Kris are fricken awesome. Went in months back for the first time, and now try to make a stop by there every time I'm in the City. My friend had her \"quitting party\" there, it was hilarious trying to stuff our crowd and the rest of the patrons into this place.  I love that the guys remember names/friends etc. It's an interesting journey trying to get to the bathroom, but worth it. You never know what cuteness you get to snuggle next to while waiting for your turn.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "While there couldn't be a worse fit for the saying \"good for groups,\" I'd imagine the Black Horse Pub is one of the best places to grab a beer with one or two other people. I wouldn't know this first hand of course, since we tried coming here with a decent sized group, but somehow we all crammed in (with a bit of spillage onto the sidewalk at times). But all in all, it makes for a very intimate pub experience that you can't find anywhere else in the city. The bathtub behind the bar and cheese plates served with drinks make for a nice touch.  If I lived closer I would definitely stop in more often.", "author": "C P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "Perfect spot for a beer on a Friday afternoon!  Very small space so prepare to get to know your neighbor :)  If they served wine, I may never leave.", "author": "Kim F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "Quite the neighborhood bar. There is no scene whatsoever, just good beer, good people and a great cheese plate. Its a great place to take friends or to hang out and meet a new one. James is the man, he will go out of his way to make sure you are having a good time and drinking more of his fine beers. The place is tiny so you better be ready to make nice with your neighbor.", "author": "Joe A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-07", "description": "I had a couple of friends in town and we were looking for a nice low-key bar to watch the Sunday Night football game.  I knew this place was right down the street from my apt, so I decided to check it out.  When we got there it was so small that we were a little hesitant that it would be the right place to go.  One of the other bar patrons that was outside smoking started chatting with us while we were outside being indecisive and he convinced that we should stop in and have at least one beer.  Glad I did.  The beer selection was small, but solid.  The bartender was very friendly in a genuine kind of way.  It was just a lot different from most bars where everyone is kind of in their own world, here everyone was talking to each other even though there seemed to be at least 4 separate groups of people.  I would have given 5 stars if there was actually enough room for the dart board.  Also, I wouldn't mind a slightly larger selection of beer.", "author": "Ted G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-04", "description": "This place was easily AS ambient as any pub in England - and I didn't believe the whole \"smallest pub in North America\" thing until I walked in.  Very cozy - went twice and felt like family.  Apparently the Ploughman's Platter is fantastic, good selection of cheese, onion, etc.  My aunt tried it (without me) and raved.  The owner is a hoot.  Ask him why he's allowed to call it a \"pub\".", "author": "Catherine F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-27", "description": "On a fun-per-square-foot basis, the Black Horse could be one of the coolest bars in San Francisco. Great vibe, nice staff, good beer. (Oy that Chimay!) I feel like keeping my review short is a bit, well, appropos here.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-12", "description": "It's a bit snug (READ tiny!) but the first time I walked in here they gave us FREE PIZZA. They have a very small selection of beers but their choices are FANTASTIC. They have excellent taste in beers, and they're not only British beers, but also Austrian and German beers. They also had fun games, one being an electrocution one. It's great fun when you're drunk. The bartenders are super nice, they'd have to be cause this place seriously has only room for maybe 20-30 people MAX  (I think even 30 is pushing it).  They always have food because they're a food and beer/wine establishment. They don't have a whole lot of beers on tap, but what they sell is pretty tasty on it's own, especially if you're a beer connoseiur.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-18", "description": "Small but with the greatest beer and cheese platter!!  Clock in and get a pint!", "author": "George M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-14", "description": "I like this bar a lot, haven't been in awhile....but we used to ride bikes over to the Black Horse and there were always a bunch of crusty old timers. Love that. Also any bar that is that small makes me feel big and there's no other feeling like it!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-08", "description": "Great place!  I had my birthday party here last year and I think we packed in about 25 people!  My roommate at the time was even allowed to bartend the event!  Really friendly barstaff and regulars.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-08", "description": "I've been meaning to have a  drink here for years, but don't find myself in the neighborhhod much any more. We had a few minutes to kill while we waited for our reservation up the street, so we came here. It's a tiny place but we managed to get some of the last seats in the place. \"King\" James was made us welcome. I't's a freindly place with good music, not loud and easy to scialize. We only had time for one, but I'll be back. It's on of the better / places on that side of town.", "author": "Sleepy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "Weird, odd and unusual are the first words that enter my mind after leaving this place. $5 for your choice of 5 different bottles of beers served out of a bathtub. Apparently the cask ale has been out for more than 6 months and they don't know when it can be filled again. I suggested Rogue as a supplier, but apparently they don't deliver. The people were overly friendly, but maybe I just wasn't drunk enough...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "This place is great, small, but great. I was told an amazing story of a game of darts from the doorway that ending up with a \"holy\" pewter mug!!", "author": "Todd C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "This bar is small but great things do come in small packages... apparently... anyway, good conversation, reasonably priced beer, and the size of the bar + the way it is laid out, forces all patrons to get to know one another... a breathe of fresh air in a city that tends to get really clicky and forget to interact with people outside of their comfort level.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-13", "description": "With a bar that seats less than 4, a killer cheese plate, and some of the only \"true\" brittish cask ale in the city, the Black Horse is a neighborhood local gem.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-08", "description": "It was an itsy bitsy teenie weenie... bar that is. But what a hell of a bar it was. Just keep in mind that there are only about 10 or so barstools  and no other table seating. Drinks? I was a happy little monkey when I found out that they served cider (not on tap). The beer on tap was nice as well. As mentioned previously, the cheese plate rawks.", "author": "Christie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-30", "description": "This is a great neighborhood bar. Although small, this place is amazing. No more than 20 people can fit inside but the crowd is excellent. The owner introduces himself and keeps everyone's tab on a yellow lined paper.  They serve only a few different kinds of imported bottled beer out of a bath tub but who can complain about Krusovice.", "author": "elissa w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-20", "description": "I used to go to this bar daily on my way home when I lived in SF.  My apartment was near Green and Laguna and I hated my neighborhood, except for this gem and a few other dingy treasures in the Marina.  It has been a long time, but you used to be able to smoke inside because it was a sole proprietor, i.e. no employees.  I haven't been back in years, but given the amazing comments, I don't think much has changed, which is a good thing. Any time you have a keg chilling in ice in a big, old clawfoot bathtub, you know you're in the right place.", "author": "Victor T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-26", "description": "This is pretty much what every bar should strive to be: a local watering hole with character, where the bartender engages the whole bar  (that is, all 10 patrons that can fit) in lively conversation, and where cool, delicious, obscure imported beers are served on a daily basis.\n\nFour stars PLUS a bonus star for serving a great cheese and salami platter!!  (To comply with local laws requiring this joint to be a \"deli\", not a \"bar.\").\n\nOh yeah, and there's a dart board.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "Can't believe I never wrote a review for the Black Horse... it's the best bar in the city.  Everything has already been said here: James is the best, it's cozy, love the courtesy rules, great beer selection, and just a great place to have a good beer.  A must-visit.", "author": "Bob A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "girls love this bar because it is clearly as good as, if not better, than the best man in SF\n\nguys love this bar because it's a manly man bar with only beers and that sells a girls of the black horse london pub calendar \n\ngirls love the bar because the calendar proceeds go to charity and they think that because they have a guys calendar equivalent that shows the men that work at the bar would never objectify women in a way that they were not willing to do themselves\n\nmen love the bar because it's the kind of bar that you can hide from your girlfriend at because if your girlfriend is \"that\" type of girl that you want to hide from...trust me, she is not one of the girls in love with this bar\n\nthe staff is probably the most genuine and hilarious in a sweet way staff I have every encountered in many many years of drinking away the nights and days.  \n\neven cooler is if you come here more than three times they give you a time card!", "author": "Yvonne Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-12", "description": "Don't you love when you get so drunk that you don't remember shit......and you friends have to give you a play by play on all the retarded things that you did.....maybe I really am retarded....anyways.....I love this place!", "author": "tom h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "One word..Chimay! and more words...best atmosphere ever! quaintest set up I have seen in the city...and when i say quaint, i mean tiny with tons of character and charm. be prepared to make friends with everyone in the bar within 10 minutes of getting in there....you pretty much have no choice since you are all on top of each other..literally.  tuesdays are the best since they give out pizza and the nice bar tender makes baked goods for everyone! james(the owner) is hilarious and ready to be your best friend right away. perfect if you want the whole cheers scenario where everyone knows your name, what kind of drink you want, etc. and if you are even in the mood to show up by yourself looking like a scrub after a long day!", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-04", "description": "Let me just get this out of the way to begin with. Yes gentleman, size matters! If you have heard that it doesn't please check your references again. They may be faulty. There are only a couple reasons why a woman would say that to you: 1. You have been with this girl for some time, possibly dating/ possibly marriage. She is not saying that because she is trying to make you feel better about yourself, although if she is nice she is sparing your feelings. It is quite the opposite, she is saying it because she is making herself feel better that she has stuck with a guy of your stature for this long. (*wink) 2. You are hooking up and in order for her to avoid your pitiful inadequacies, self esteem issues, or a night of hugging her pillow as she listens to you in the fetal position sobbing like a 4 yr old school boy in the corner, she says it doesn't matter. 3. Or lastly, regardless of what happened between the two of you, she is going to tease you to no end, behind your back and to your co-workers, once you are no longer intimate. \n\nIn the Know: Now with that said, take everything I just said and disregard it (for a moment). At the Blackhorse it is all about size, and trust me when I say, the smaller the better! I can count the maximum occupancy on my 'lil fingers and toes, and that includes standing room. The bar divides the space in half, roughly 2-3ish feet on either side. Behind the bar is a small (do I even need to say that if the whole thing is small?) service station, a place to make a delicious cheese platter and/or a samich (sandwich for all those properly edumakated folks), and of course an old school bath tub filled with cans or a keg. The decor is what you would expect to find at any local London pub, including but not limited to pictures of London, beer posters, hanging steins and my personal favorite \"Rules of Behavior.\" Now I feel as though these rules should just be common knowledge for any bar but apparently the good ol' days of male chivalry (you must give your seat to a lady if she doesn't have one) and female courtesy (ladies no one wants to hear what you have to say on your cell phone, especially about the guy you met outside your apartment at 3 in the morning and now you regret letting him know where you live because at any second he could turn into a stalker so you have to constantly keep your eye out every time you walk around your hood) have completely been ignored. Blackhorse, way to make us face our issues with claustrophobia and behavioural patterns all in one swoop. That is why we (the 'we' refers to me and my other personality) totally heart you! \n\nBehind the Bar: My favorite thing about going to certain bars is having a friend be a bartender. On top of receiving cheap to free drinks all night, they always give me the honest, inside scoop on what works and what makes them secretly want to burn the establishment down. More often than not they want to do the later but that generally goes hand-and-and with hating the owners of the place or knowing that they are working for people that are dumber than they are and resent them or the bar even more. (*not that that has ever happened to me...um....ya....) I am very happy to report that neither of those are an issue at this place. My friend loves the owner and loves the small space he works in. So really there are no negatives for this section. (might actually be a first!) *I should mention that the one thing quite literally behind the bar is the Black Horse calendar. People, if for nothing else, please take a gander at this. It could possibly be the hottest thing I have ever seen. \n\nWho is Who: This bar might be considered located in the Marina, but it is far from a Marina crowd. (Thank god!) The couple times I have been there the patrons are nothing but laid back people that just want to enjoy a cozy spot with some friends. I might go as far as to say this could be one of the best bars in the city. I wouldn't do that though because I am a cynical and selfish. I mean if you can only fit 20ish people in this bar, why the heck would I want to tell the masses to go there?", "author": "Sheyna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-04", "description": "This place is the friendliest bar, great crowd and the nicest bartender in the city.\n\nIf you haven't been check it out.", "author": "lindsay d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-16", "description": "This is the Cheers bar you've been waiting for. \n\nWhen we're craving a good dinner with better company, we'll go and enjoy a Chimay and a cheese plate that cannot be beat. \n\nThe best part about the bar is the friendly bartenders and the clientele-we've met many good friends at the Horse.\n\nWe love you James!", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-08", "description": "Third time was just as fun as the first two.  Next time you go and Scott is bartending ask for SCOTTGUNS!!!!   He'll know what to do.  This place is awsome!", "author": "BIG B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "There is nothing better to do on a chill Friday night than stop in and hang out with your local friends and have some beers out of a bathtub. The biggest reason to go to this place though...Jaime...the best bartender around. She makes the whole experience that much better!", "author": "Ilya F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "It's hard to find places with a true pub feel but the Black Horse has it!  Even though this place is the size of your bathroom it has more character than most bars you will encounter.  If you don't like small places or socializing with your fellow pub patrons then you may not like this place.  I'd suggested going to this place with limited people and planning on making some new friends (the whole bar can probably only fit 20 people).", "author": "Justin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-26", "description": "Countless times I have walked past the Black Horse Pub, the smallest bar in San Francisco- sometimes during the day, and sometimes at night when I see just how crowded and intimate it can get. And countless times I've said to myself, I should really check it out- yet I never did....until tonight. And thank god I did otherwise I would be missing out on one of the city's best kept secrets- a gem of a bar with friendly staff and a jovial ambiance. People are friendly, and due to the close proximity of you and your beer drinking neighbors, you can be sure you'll strike up a conversation with a stranger at some point during the evening. I had the Belgian Chimay, served in a glass fit for an ice cream sundae. The bartender reached into a bathtub filled with beer bottles- note they don't serve from a tap- to fish out the desired brew. The beer was served cold, and although it was colder than possible outside (this is San Francisco summer for you) the nearly claustrophobic nature of this establishment kept me warm. And claustrophobic isn't necessarily a bad thing here either. It's just pleasantly packed (and with friendly people, no doubt). Yes pleasantly packed, not packed like you find on the 30 or 45 buses going past Chinatown, but I digress. I had the feeling I had entered someones home (completely with pizza and laundry service, no kidding!) as charming knick knacks lined the walls. Even the bathroom was kept incredibly orderly for such a bustling pub. All in all, this is a wonderful and warm environment in which to enjoy a variety of beers. I highly recommend it over the more traditional Marina establishments.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-18", "description": "Finding a place like this is why I am addicted to yelping.  I am visiting the city for a conference and I wanted to find some local flavor and stay away from the tourist traps.  I definitely found a diamond in the rough in Black Horse.  Perhaps the smallest bar I've been in, and I have been in some small bars.  Completely packed nuts to butts yet completely charming.   Jaimie was the bartender that night and made me feel right at home.  Met many locals which is what I was looking for.  Made friends with James who gave me the first tri-tip sandwich he made (some guy made it and brought it by to share!) which I thought was a kind gesture since I was a guest.  Someone also came by with a cup of what I think was an English stew of some sort.  I felt like I was part of the family!  Before I left I asked for a water and it was poured in a Radeberger Pilsner mug which was so cool looking I asked if I could buy it for my bar glass collection and as a souvenir of the place.  James gave it to me :)  I am so glad that I came here.  I will make it a point to visit every time I am in SF.", "author": "Juliana M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-04-22", "description": "i think this is the tiniest bar in SF. small but a good time. friendly bartender. a good place if you actually want to have a conversation.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "This is probably one of the best bars in the entire city.  It's one of those neighborhood gems that is loaded on charm.  A tiny bar, which lend itself well to an intimate experience with the locals.  Well worth checking out, but be warned that they only take cash and as far as I know only serve beer.", "author": "Debbie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-20", "description": "i got ridiculously drunk here last night, the beer keeps flowing and they laugh at you when you leave.  well maybe they just laugh at me.", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-14", "description": "niiiice. cozy spot with good beer and friendly patrons. you kind of have to be in the mood to sit down and shoot the shit in order to come into this place, because you'll be in close quarters with everyone there. very neighborhoody feel, a definite spot for socializing with your brew.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "This place is about great beer and good conversation. No cell phones, no TV, no frills. The patrons are generally super friendly and the bartenders are always welcoming. If I was new to SF, hitting the town solo, this is the first place I'd stop by.", "author": "K W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "Its so small that they can completely control not only the atmosphere but the interaction between people. They do a great job at making sure the personality of the place transcends one on one conversations. It a really unique cool place. We walked in not knowing anything about the place, met a bunch of east coast people and felt like we had been coming there for years. Highly recommended!!!", "author": "dc h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "This London-styled pub is one of the best places to hang out. The small capacity space (everyone has to get up when you have to pee)makes it hard not to make friends. And the bartender makes this pub even better. He makes sure that the Black Horse Tenets are followed. Patrons look forward to the rotating selection of European imported beers including Chimay, Bombardier and Stiegl to name a few. The menu is limited to a cheese plate and a sandwich but that isn't what people come here for. If you are looking for the perfect cozy neighborhood bar, this is it.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "This has been one of my very favorite bars in SF for the last ten years.  It is like drinking in a phone booth, so you quickly get to know everybody in the place.  Very chill vibe.  Extra bonus points for the no-cell phone rule that keep the place douchebag free.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-22", "description": "best pub hands down.\njames and blue.", "author": "m b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-06", "description": "The concept is pretty cool and the bartender was equally cool, but upon entering, I knew I had to get the hell out of there immediately. Perhaps I went on the wrong night, but after reading all these reviews I was under the impression that everyone talked to everyone, were eager to meet new people, etc. so I waltzed in by myself. Turned out, everyone inside knew each other (not sure if a large group of people went there together or what) and kind of just looked at me like I was a weirdo for going by myself. I felt very uncomfortable and awkward. Also, one of the bar's \"rules\" is to not butt in on others' conversations unless invited, so I didn't want to just jump in and start laughing along out of nowhere with people. I decided to stick it out for a second beer thinking that maybe I just needed to give it a chance but I just wanted to get out of there the whole time. I'm a social, nice guy so it's not like I was just some freak or some douche walking in. Again, no fault of the bartender or the bar itself, maybe the people on that particular night just sucked. The beer selection wasn't anything outstanding, but it was decent. I did like the atmosphere though and I could totally see how it could be a fun place. If I went again, I would definitely go with someone so as to not feel like an alien.", "author": "Craig D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-08", "description": "Best cheese plate in town, huge & tasty plus good beers.", "author": "Jake F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-15", "description": "star 1 - cask ale\nstar 2 - cheese plates\nstar 3 - small size\nstar 4 - James\nstar 5 - cask ale, cheese plates, small size, james all in one place\n\ntoo bad i can only give five stars cause there is a lot more going on", "author": "Milo A."}
